[
  {
    "title": "Breakthrough Deal Aims to End Gaza Conflict; Troops Withdrawal Planned",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Wed, 08 Oct 2025 19:24:36 -0400",
    "source": "NPR",
    "sources": [
      "Global News",
      "ABC News",
      "Deutsche Welle",
      "Financial Times",
      "Al Jazeera",
      "The Guardian",
      "NPR",
      "Forbes",
      "Washington Post",
      "CityNews"
    ],
    "domains": [
      "www.theguardian.com",
      "globalnews.ca",
      "abcnews.go.com",
      "www.npr.org",
      "ottawa.citynews.ca",
      "www.ft.com",
      "www.dw.com",
      "www.aljazeera.com",
      "www.washingtonpost.com",
      "www.forbes.com"
    ],
    "snippets": [
      "The deal raises the possibility that the war may now be over, ending the  bloodiest fighting ever between Israelis and Palestinians.",
      "Mediator Qatar said that more details of the agreement would be announced at a later date.",
      "US President Donald Trump said this means that all of the hostages will be released very soon and Israel will withdraw troops. DW has the latest.",
      "President Donald Trump said earlier Wednesday he may go to the Middle East in the coming days.",
      "US president says all hostages to be released ‘very soon’ as he hails breakthrough deal",
      "<p>Donald Trump announces that all hostages will be released ‘very soon’ and Israel will withdraw troops to an agreed upon line</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/oct/08/gaza-ceasefire-talks-israel-hamas-trump-us-qatar-turkey-egypt-live-news-updates\">Follow latest upd",
      "'This means that ALL of the Hostages will be released very soon, and Israel will withdraw their Troops to an agreed upon line,' Trump wrote on his Truth Social website.",
      "President Donald Trump suggested he may travel to Gaza.",
      "U.S. President Donald Trump has announced that Israel and Hamas have agreed to the “first phase” of his peace plan to pause fighting and release at least some hostages and prisoners. “This means that ALL of the Hostages will be released very soon, and Israel will withdraw their Troops to an agreed u",
      "A senior Hamas official said late Wednesday that an agreement to end the war in Gaza was “imminent.”"
    ],
    "image_url": "",
    "titles": [
      "Israel and Hamas agree on the 'first phase' of Gaza ceasefire deal",
      "Trump says Israel and Hamas sign off on first phase of Gaza ceasefire plan",
      "Israel, Hamas sign off on phase 1 of Gaza plan, Trump says",
      "Israel-Gaza live updates: Trump says Israel and Hamas signed off on 1st phase of deal",
      "Trump says Israel and Hamas have agreed first phase of Gaza peace plan",
      "‘First phase’ of ceasefire deal to end war in Gaza agreed by Israel and Hamas",
      "Trump says Israel, Hamas agree to 1st phase of Gaza peace plan",
      "Trump Says Israel And Hamas Have Agreed To First Phase Of Peace Deal",
      "Israel and Hamas agree to ‘first phase’ of plan to end fighting and release hostages, Trump says",
      "Trump, Hamas officials say Gaza ceasefire deal ‘very close’"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.984,
      "consensus": 1.0,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.882,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A breakthrough deal has been announced, potentially ending the war in Gaza, marking the cessation of the bloodiest fighting between Israelis and Palestinians. Qatar, acting as mediator, confirmed details will follow. U.S. President Donald Trump stated all hostages will be released imminently, and Israel will withdraw troops to a specified line. Trump also hinted at a possible visit to the Middle East soon. This agreement represents the \"first phase\" of a peace plan, with a senior Hamas official indicating an end to the conflict is \"imminent.\"",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Jack Eichel Secures $108M, 8-Year Extension with Vegas Golden Knights",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Wed, 8 Oct 2025 18:28:28 EST",
    "source": "ESPN",
    "sources": [
      "NHL",
      "Sportsnet",
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.sportsnet.ca",
      "news.google.com",
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "Jack Eichel has signed an eight-year contract extension with the Vegas Golden Knights that carries a $13.5 million average annual value.",
      "Eichel won't be hitting free agency in 2026 after all",
      "<a href=\"https://news.google.com/rss/articles/CBMikgFBVV95cUxPNHl1V2xqVVlqTnFPejd0ME1fTWw3UzlqQmo4WWxQNFEwMHhDUmxJeVlNZUM3Q2hOWjBuYWhoVkt5R0ItNEZZMmJ0VXppb01aQU5xLUVJbExJZnZBWWZGSmVBXzFlZ2FpeWt3N3NIQmFEOGdoc0ptTGRIWktjQjNCcVVVdzNRR3g1VU5Pdm1OUnd3QQ?oc=5\" target=\"_blank\">Eichel signs 8-year, $108 mil",
      "<p>The Vegas Golden Knights signed star forward Jack Eichel to an eight-year, $108 million extension, Sportsnet&#8217;s Elliotte Friedman reported on Wednesday.</p>"
    ],
    "image_url": "",
    "titles": [
      "Eichel lands 8-year extension with Golden Knights",
      "Jack Eichel contract extension: Golden Knights star to remain in Vegas on eight-year deal topping $100 million",
      "Eichel signs 8-year, $108 million contract with Golden Knights - NHL.com",
      "Golden Knights sign Jack Eichel to eight-year extension"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.965,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.807,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Jack Eichel has agreed to an eight-year contract extension with the Vegas Golden Knights, worth $108 million. This deal, averaging $13.5 million annually, ensures Eichel won't become a free agent in 2026.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Accuses Pritzker, Chicago Leaders Without Evidence",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Wed, 08 Oct 2025 21:28:36 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Axios",
      "Al Jazeera",
      "LA Times"
    ],
    "domains": [
      "news.google.com",
      "www.aljazeera.com",
      "www.latimes.com"
    ],
    "snippets": [
      "Trump slams Chicago mayor and Illinois governor resisting his mass deportation campaign as US troops arrive in state.",
      "<a href=\"https://news.google.com/rss/articles/CBMihgFBVV95cUxNODU0dE5Ea1BGZFR0dl8yOWs0c1MtMnlpV2JmLVpZUUJ6em5Ta3lIOXhCLWdmZ1FPOG9NTnlwUHhWSkU2ekhaXy1jRVFhTElkS2VfR0hPT21taTJadkpVd3c5VWRZZDJTQjlHQ2RGemNOTWtWZ0JQdGNZUmZid0lDbzFTRUd5Zw?oc=5\" target=\"_blank\">Trump baselessly calls for Pritzker, Chicago ",
      "<p>President Trump continued to campaign for deploying National Guard troops to Chicago and Portland, Ore., despite opposition from local and state leaders.</p>"
    ],
    "image_url": "",
    "titles": [
      "Trump calls to jail Chicago mayor, Illinois governor in immigration dispute",
      "Trump baselessly calls for Pritzker, Chicago mayor to be jailed - Axios",
      "Trump says Chicago mayor, Illinois governor should be jailed amid militarized campaign"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.945,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.743,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "President Trump made baseless accusations against Governor Pritzker and Chicago's leadership, alleging their failure to protect ICE officers. No evidence was provided to support his claims.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "IRS Furloughs Workers Amid Ongoing Government Shutdown",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Wed, 08 Oct 2025 20:00:29 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Forbes",
      "The Guardian"
    ],
    "domains": [
      "www.cnbc.com",
      "www.theguardian.com",
      "www.forbes.com"
    ],
    "snippets": [
      "The IRS furloughs came on the same day that the Senate again fell short of passing a funding resolution that would end the federal government shutdown.",
      "<p>Move comes after White House memo suggests workers may not get back pay, despite law Trump signed in first term</p><p>The Internal Revenue Service said it will furlough nearly half of its employees – about 34,000 workers – due to the government shutdown, making it significantly harder for US taxp",
      "Tax filings and payments are still due and Criminal Investigation will stay on the job. But processing of refunds and amended returns will likely be delayed.",
      "The Senate failed Wednesday to approve spending plans to reopen the government."
    ],
    "image_url": "",
    "titles": [
      "IRS furloughs nearly half of its workforce due to government shutdown",
      "IRS to furlough nearly half its workforce due to government shutdown",
      "IRS Halts Most Taxpayer Services As It Furloughs Nearly Half Its Workers",
      "IRS Furloughs Nearly Half Of Its Staff Amid Government Shutdown: Here’s What’s Impacted"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.898,
      "consensus": 0.789,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.743,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The IRS furloughed employees as the Senate failed to pass a funding resolution, continuing the federal government shutdown. Despite efforts, no spending plans were approved to reopen the government. President Trump previously stated that about 750,000 federal workers could be furloughed or fired due to the shutdown.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: effort, plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Man Arrested for Historic LA Fire, AI Image Found on Devices",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 08 Oct 2025 20:55:04 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Al Jazeera",
      "Deutsche Welle"
    ],
    "domains": [
      "www.dw.com",
      "www.bbc.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Investigators say evidence collected from the 29-year-old's devices showed an AI image of a burning city.",
      "Police say 29-year-old Jonathan Rinderknecht was behind fire that destroyed much of the Pacific Palisades neighbourhood.",
      "Authorities announced the arrest of a 29-year-old man for allegedly starting the devastating fire in the Los Angeles neighborhood of Pacific Palisades in January. It is considered the worst fire in the city's history."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/3d6e/live/0e430540-a469-11f0-928c-71dbb8619e94.jpg",
    "titles": [
      "ChatGPT image snares suspect in deadly Los Angeles fire",
      "Suspect charged with starting deadly Los Angeles Palisades fire",
      "US police arrest man suspected of starting deadly LA fire"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.915,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.727,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Jonathan Rinderknecht, 29, was arrested for starting a fire in Los Angeles' Pacific Palisades neighborhood, considered the worst in the city's history. Evidence from his devices included an AI image of a burning city.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Flight Delays Rise Amid Controller Shortage and Government Shutdown",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Wed, 08 Oct 2025 20:20:49 GMT",
    "source": "Axios",
    "sources": [
      "CNBC",
      "Axios",
      "ABC News"
    ],
    "domains": [
      "www.cnbc.com",
      "abcnews.go.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMiigFBVV95cUxQWE1tajBMMWdsc0h1dTlycUx1clJBLU5HSDBSV3pnWmhDU1ZvM0dzemVtUFJNZXJYVU0yQWlWNmt4NDZOM3dSMXNSUmZUQXpmZGhrSFhBS1hCSnFON1hQRFRNaE91dVM2Yktoc0lvYURuaDNmZTBSWWFVR0Z4dlRCTndrZmtpbEhEWGc?oc=5\" target=\"_blank\">How air traffic controllers could help e",
      "Flight delays and cancellations are climbing as sick calls involving air traffic controllers leave a number of airport towers and control facilities without enough staff to handle all flights.",
      "The government shutdown is exacerbating concerns about the strain on air traffic controllers, a shortage of whom has vexed airline executives for years."
    ],
    "image_url": "",
    "titles": [
      "How air traffic controllers could help end the shutdown - Axios",
      "WATCH:  Air traffic controller shortages amid shutdown lead to canceled flights, delays",
      "Air traffic control shortages add to U.S. flight delays, FAA says"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.904,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.725,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Flight delays and cancellations are increasing due to a shortage of air traffic controllers caused by sickness-related absences. The ongoing government shutdown is worsening the situation, highlighting a long-standing issue of controller shortages that has troubled airline executives for years.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Attack on Manchester Synagogue on Holy Day Kills Two; Assailant Claims IS Ties",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 08 Oct 2025 19:37:42 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Al Jazeera",
      "New York Times"
    ],
    "domains": [
      "www.nytimes.com",
      "www.bbc.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Police confirm the attacker made the call after he crashed his car into a brick wall.",
      "Police said Jihad al-Shamie called emergency services to declare allegiance to armed group as he carried out the attack.",
      "Jihad al-Shamie, who attacked a Manchester synagogue on the holiest day of the Jewish calendar, called the emergency services during the attack to claim responsibility."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/a5fb/live/0efb21c0-a455-11f0-8a21-ff96e44d1cc2.jpg",
    "titles": [
      "Synagogue attacker pledged allegiance to 'Islamic State' in 999 call",
      "Manchester synagogue attacker claimed allegiance to ISIS, UK police say",
      "Manchester Synagogue Attacker Pledged Allegiance to ISIS, Police Say"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.89,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.722,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Jihad al-Shamie attacked a Manchester synagogue on the Jewish calendar's holiest day, killing two worshippers. During the attack, he crashed his car into a brick wall, then called emergency services to claim responsibility and pledge allegiance to the Islamic State, according to police.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Tuchel Calls England 2026 World Cup \"Underdogs,\" Stresses Unity and Cohesion",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 08 Oct 2025 21:21:46 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian",
      "Deutsche Welle"
    ],
    "domains": [
      "www.dw.com",
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Thomas Tuchel believes England will go into the World Cup as \"underdogs\" and says they have \"no chance\" of succeeding unless the team unite.",
      "The 2026 FIFA World Cup is set to be the most expensive, polluting and political yet.",
      "<ul><li><p>Tuchel: ‘I don’t see why we should burden ourselves’</p></li><li><p>Head coach ‘not just collecting most talented players’</p></li></ul><p>Thomas Tuchel has said England would be underdogs at the World Cup and would be stronger if they did not allow themselves to become burdened by expect"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/4684/live/c0c65910-a487-11f0-961e-13040d1e97f4.jpg",
    "titles": [
      "England will be 'underdogs' at World Cup - Tuchel",
      "Will the 2026 World Cup be a disaster for fans?",
      "Tuchel insists England should embrace underdog status at 2026 World Cup"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.923,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.721,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Thomas Tuchel, addressing England's prospects for the 2026 FIFA World Cup, labeled the team as \"underdogs\" and emphasized the necessity of unity for any chance of success. He highlighted the importance of not overburdening themselves with expectations. Additionally, Tuchel mentioned his approach to team selection, focusing on cohesion over merely gathering the most talented players. The 2026 World Cup is noted for being anticipated as the most expensive, environmentally taxing, and politically charged iteration to date.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Winnipeg Jets Sign Kyle Connor to $96M, Eight-Year Extension",
    "domain": "sports",
    "source_domain": "www.forbes.com",
    "location": "global",
    "published": "Wed, 08 Oct 2025 15:56:18 -0400",
    "source": "Forbes",
    "sources": [
      "NHL",
      "Forbes",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "news.google.com",
      "www.forbes.com"
    ],
    "snippets": [
      "Rather than giving the NHL a jolt in fan interest before heading into media rights negotiations, the below-market extension just holds salaries down.",
      "<a href=\"https://news.google.com/rss/articles/CBMimwFBVV95cUxNYTBSYy1FTHpWemx3TVBHbU1qTEhNVS1EbFItd3RBN3FlVTMxOU1valNoTHpWWGQ0Ym8wVjhiYUhJcmJ2SHgzSENMcU9QT3RTRHBSek1rSEtYRUFYTHJ1SkEwbzFQU2tvcWhRWGtlbElKbnBoVkhEZDNoNkdYQUFrMDhFNENYSXIwX2ViNjR5Y2N2Z0dwN1RwVWE5RQ?oc=5\" target=\"_blank\">RELEASE: Jets sig",
      "<p>Sean Reynolds catches up with Winnipeg Jets&#8217; Kyle Connor after signing an eight-year extension with the organization to discuss what the deciding factors were for him and his close connections with his teammates and the city of Winnipeg.</p>"
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/68e6c0cae19fe497ad88db40/0x0.jpg?width=960",
    "titles": [
      "Connor McDavid Contract Extension Does NHL, Players No Favors",
      "RELEASE: Jets sign Connor to an eight-year contract extension - NHL.com",
      "Why Connor decided to ink eight-year extension with Jets"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.915,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.72,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Winnipeg Jets have signed Kyle Connor, a star forward, to an eight-year, $96 million extension. The team announced this on Wednesday. The deal secures Connor's future with the Jets for a significant period.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "France's PM Lecornu: Budget Must Pass by Year-End, Avoids Snap Elections",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 08 Oct 2025 20:50:17 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Al Jazeera",
      "New York Times"
    ],
    "domains": [
      "www.nytimes.com",
      "www.bbc.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Sébastien Lecornu, the outgoing prime minister, said MPs recognise the pressing need to pass a budget by the end of the year.",
      "The announcement came after last-ditch talks by outgoing premier Sebastien Lecornu failed to find a solution to crisis.",
      "The announcement from the French president came after last-ditch talks held by Sébastien Lecornu, France’s departing prime minister, who said most parties wanted to avoid snap elections."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/c717/live/89beaff0-a480-11f0-892d-8503a9b17f9b.jpg",
    "titles": [
      "Macron will nominate new French prime minister in 48 hours",
      "France’s Macron to appoint new prime minister within 48 hours",
      "Macron Will Name New Prime Minister Rather Than Call Elections"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.913,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.719,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Sébastien Lecornu, France's outgoing prime minister, announced the need to pass a budget by year's end, following unsuccessful last-ditch talks to resolve a crisis. Despite the failure, Lecornu noted a general consensus among parties to avoid snap elections, as stated by the French president.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Man United Co-owner Backs Coach Amorim, Offers 3-Year Window to Prove Worth",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 08 Oct 2025 18:08:16 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Sky Sports",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com",
      "www.skysports.com"
    ],
    "snippets": [
      "Manchester United co-owner Sir Jim Ratcliffe says manager Ruben Amorim needs three years to prove he is a \"great\" coach.",
      "<ul><li><p>Minority owner moves to clarify coach’s future</p></li><li><p>‘You can’t run a club like United on kneejerk reactions’</p></li></ul><p>Sir Jim Ratcliffe insists he will not take a “kneejerk” decision to sack Ruben Amorim and has indicated he will afford the head coach three years to demon",
      "Manchester United minority owner Sir Jim Ratcliffe has said he wants to give under-pressure head coach Ruben Amorim three years in the job to prove himself."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/6aed/live/3ebc1c60-a45b-11f0-bf2c-b564608f4fa4.jpg",
    "titles": [
      "Amorim needs three years at Man Utd - Ratcliffe",
      "Ratcliffe says Ruben Amorim has three years to prove himself at Manchester United",
      "Ratcliffe: I want to give Amorim three years to prove himself at Man Utd"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.863,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.719,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Manchester United co-owner Sir Jim Ratcliffe supports head coach Ruben Amorim, stating he will not make a \"kneejerk\" decision regarding his position. Ratcliffe emphasizes the importance of stability and has indicated Amorim will be given three years to demonstrate his capabilities and prove he is a \"great\" coach for the club.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "EU Parliament Bans Meat Terms for Plant-Based Products Amid Criticism",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 08 Oct 2025 16:55:42 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian",
      "Washington Post"
    ],
    "domains": [
      "www.washingtonpost.com",
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Pressure to ban meat labels for plant-based products comes from Europe's livestock farmers.",
      "<p>Proponents say move would strengthen position of farmers in supply chain but critics dismiss it as ‘hotdog populism’</p><p>Veggie burgers, tofu steak and cauliflower schnitzel will be off the menu if the European parliament gets its way after a vote on food names.</p><p>MEPs voted on Wednesday by",
      "More and more European shoppers are buying imitation schnitzel, bratwurst and steak made from plants but some politicians say only real meat should use those names."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/62fd/live/09d090f0-a45e-11f0-a789-358ea6d9d143.jpg",
    "titles": [
      "No more veggie burgers? EU parliament votes to ban meat names for plant-based foods",
      "‘Veggie burgers’ could be off EU menu as MEPs back renaming plant-based foods",
      "That’s no schnitzel! E.U. moves to ban using meat names for veggie fare."
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.842,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.715,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "European Parliament voted to restrict plant-based products from using meat-related terms like 'burger' or 'steak'. This decision, supported by livestock farmers aiming to strengthen their market position, faces criticism for potentially misleading consumers and limiting choice. Critics label it as 'hotdog populism'. The outcome impacts labeling of plant-based foods across Europe, with opponents arguing it could confuse shoppers accustomed to such terms for vegetarian options.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Lamar Jackson Misses 4th Practice; Cooper Rush May Start, Hamilton Returns",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Wed, 08 Oct 2025 18:20:58 +0000",
    "source": "CBS Sports",
    "sources": [
      "Sports Illustrated",
      "Sportsnet",
      "CBS Sports"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.cbssports.com",
      "news.google.com"
    ],
    "snippets": [
      "It could be Cooper Rush under center again for Baltimore",
      "<a href=\"https://news.google.com/rss/articles/CBMidEFVX3lxTE9ZUm9rdzdob3M3bGxSSkE1cnR6djRWT2pwanFYaEhLd2x3OHFtSjF3X2FWT3pwck1WeGoyaGRIeG9XYzc3Y1ZUcTR2RVl1M0hJODdodUFtdXp2bHJsMkpWZkZwWGVrZnM5anFVdUFQeTlQNnNS?oc=5\" target=\"_blank\">Lamar Jackson Injury Update: Ravens QB Misses Fourth Straight Practice<",
      "<p>Lamar Jackson was again absent from practice for the Baltimore Ravens during the portion open to reporters, but star safety Kyle Hamilton was back on the field Wednesday.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/10/08/9d7ceee7-94fd-4f7c-90ab-b8dda9cd1583/lj.jpg",
    "titles": [
      "Lamar Jackson injury: Ravens' QB misses practice, status still in doubt for Week 6 against Rams",
      "Lamar Jackson Injury Update: Ravens QB Misses Fourth Straight Practice - Sports Illustrated",
      "Lamar Jackson still absent from Ravens practice, Kyle Hamilton returns"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.885,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.714,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Lamar Jackson missed his fourth consecutive practice for the Baltimore Ravens, raising the possibility that Cooper Rush could start as quarterback in their next game. Meanwhile, star safety Kyle Hamilton has returned to practice.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "McDavid Signs $25M, 2-Year Extension with Oilers, Praised by NHL Chief",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Wed, 08 Oct 2025 23:16:50 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "globalnews.ca"
    ],
    "snippets": [
      "Connor McDavid left a bag of money on the table this week.",
      "<p>NHL commissioner Gary Bettman discusses Edmonton Oilers superstar Connor McDavid&#8217;s recent two-year, $25-million contract extension, saying the deal is a &#8220;testament&#8221; to McDavid&#8217;s &#8220;passion for the game.&#8221;</p>"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/10/cd29d9071c840175a70107e81050853a49247bc9cc6951c934a3fdb561a93ef4.jpg?quality=65&strip=all",
    "titles": [
      "Bettman commends McDavid over contract",
      "Bettman: McDavid’s contract is ‘testament’ to his ‘passion for the game’"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.981,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.708,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Edmonton Oilers' Connor McDavid signed a two-year, $25-million contract extension, showcasing his commitment to the game. NHL commissioner Gary Bettman praised the deal as a testament to McDavid's passion.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Flintoff Resigns as Northern Superchargers Coach Over Contract Dispute",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 08 Oct 2025 17:28:43 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Sky Sports",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com",
      "www.skysports.com"
    ],
    "snippets": [
      "Former England all-rounder Andrew Flintoff says he will no longer coach Northern Superchargers in The Hundred, feeling he is \"worth more\" than what the new owners offered.",
      "<ul><li><p>Terms could not be agreed with new owners Sun Group</p></li><li><p>‘You’ll be missed. I wasn’t expecting that,’ says Adil Rashid</p></li></ul><p>Andrew Flintoff has walked away from his role as Northern Superchargers head coach, suggesting the team’s new Indian owners made him feel underv",
      "Andrew Flintoff has walked away from his role as Northern Superchargers head coach, suggesting the team's new Indian owners made him feel undervalued."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/69d4/live/a607bdb0-a466-11f0-8c79-29eeaf2ea52d.jpg",
    "titles": [
      "'I'm worth more' - Flintoff leaves Superchargers",
      "Andrew Flintoff leaves role as Northern Superchargers head coach",
      "'I'm worth more' - Flintoff steps away from Northern Superchargers role"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.851,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.707,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Andrew Flintoff has resigned as head coach of the Northern Superchargers, citing dissatisfaction with the contract offered by the team's new owners, Sun Group. Flintoff felt undervalued by the terms proposed, leading to his decision to step down. Teammate Adil Rashid expressed surprise and disappointment at Flintoff's departure.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Bank of England Warns of AI Market Correction Risk",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Wed, 08 Oct 2025 13:37:34 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Ars Technica",
      "The Guardian"
    ],
    "domains": [
      "www.cnbc.com",
      "arstechnica.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "The Bank of England has warned that risk of a sharp market correction has increased, amid stretched AI-related valuations.",
      "<p>Possibility of ‘sharp market correction has increased’, says Bank’s financial policy committee</p><ul><li><p><a href=\"https://www.theguardian.com/technology/nils-pratley-on-finance/2025/oct/08/the-ai-valuation-bubble-is-now-getting-silly\">Nils Pratley: the AI valuation bubble is now getting silly",
      "Central bank says market concentration hasn't been this extreme in 50 years."
    ],
    "image_url": "",
    "titles": [
      "Bank of England warns of 'sharp market correction' if AI bubble bursts",
      "Bank of England warns of growing risk that AI bubble could burst",
      "Bank of England warns AI stock bubble rivals 2000 dotcom peak"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.786,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.701,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Bank of England's financial policy committee has cautioned about a heightened risk of a sharp market correction due to inflated AI-related valuations. The warning comes amidst concerns over market stability and potential disruptions.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Colombian Boat Bombed by US in Anti-Drug Effort, President Claims",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Wed, 08 Oct 2025 21:46:49 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "New York Times"
    ],
    "domains": [
      "www.nytimes.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMie0FVX3lxTE50MFpHMVllcnJfTjVpZXF1endKV1JPeU10MkdWU2xwYlRZc2pWdHhOeTBrS1EzbzZKMWltYXFNS2JsdkphZVBVUl9Mc1pRSDNVYThkb2ZjcURRTzVwVXVRUFMwa05McFVRX3d6YUd2bDRYb3kwbWRYc21oSQ?oc=5\" target=\"_blank\">Colombia president claims U.S. bombed Colombian boat in strik",
      "The Trump administration has said that it is attacking boats and killing their occupants because they are smuggling drugs from Venezuela to the United States."
    ],
    "image_url": "",
    "titles": [
      "Colombia president claims U.S. bombed Colombian boat in strike off Venezuela - Axios",
      "Colombia’s President Says Boat Bombed by U.S. Was Carrying Colombians"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.931,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.658,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Colombian president claimed that a boat from Colombia was bombed by the U.S. as part of the Trump administration's efforts to combat drug smuggling from Venezuela to the United States. This action is part of a broader strategy to target vessels believed to be transporting drugs.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Spain Passes Law Enforcing Arms Embargo Against Israel",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Wed, 08 Oct 2025 20:10:59 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "The vote, which passes 178 votes to 169, enshrines into law an embargo that has been in effect since the war began.",
      "Spanish lawmakers have passed a law ending all trade of arms, defence equipment, or technologies to Israel.",
      "<p>Decree bans all exports of defence equipment, products or technology to Israel and imports of such goods from Israel</p><p>Spain’s parliament has voted to enshrine in law an arms embargo on Israel that the prime minister, Pedro Sánchez, introduced to end “the genocide in Gaza”.</p><p>Parliament b"
    ],
    "image_url": "",
    "titles": [
      "Spain’s parliament formally approves Israel arms embargo",
      "Spain approves arms embargo on Israel due to Gaza genocide",
      "Spanish MPs back move to enshrine in law arms embargo on Israel"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.92,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.653,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Spanish lawmakers have passed a law, with a vote of 178 to 169, officially enshrining an arms embargo against Israel. This legislation bans all exports and imports of defense equipment, products, or technology to and from Israel, aiming to end what Prime Minister Pedro Sánchez described as \"the genocide in Gaza.\"",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Signals Imminent Gaza Peace Deal; May Visit Middle East",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Wed, 08 Oct 2025 22:56:51 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMidEFVX3lxTFBQc25iSUp6Q05iblQ0NVJtWGhZdGEzMGVYTWptSlhENktQQ0g2SHVQS0lkS3lnZWYyZFZsVHZRdHYzS3dwUExCY3l2WW5nZ0Q3WUJsdXhKeHp0TVhsN05KWDZOaGxENGFVRnVQVHVMbUs4TlU2?oc=5\" target=\"_blank\">GAZA PEACE DEAL REACHED: TRUMP</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Axi",
      "<a href=\"https://news.google.com/rss/articles/CBMicEFVX3lxTE1hbXNZQTdmUDd2OVRfMUdRVmtYcjl0cFNSRFhmOVRNQnJDZ1JpRUoyZGlMdC1EUDhOTlN4X1JNNGxWUDhyQzJoQWZEXzdNQS1wY01HaXAyWGhGX2Y2SHR1dmxqOUlnY1M5RHB6OUFkVlA?oc=5\" target=\"_blank\">Gaza peace deal may be imminent</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Axios</",
      "<a href=\"https://news.google.com/rss/articles/CBMimgFBVV95cUxQWkJPaGFvSTlmOHV3ZTNnRF92dUJuX0tya3JjVzFUalVwODVnQW1OSDY2VHFMblBMRG85YURObEZVakVXZENmZDNWclJyWnVtTU1XbDZsNVctcWFUbHA3ek1NRGRLQkR3SG01WkJ6S0ktS2dOQU5IdVFWNnBSUlEzSHIyTlJKZWwwVTlkcjJoQTdJejFDb015UHpn?oc=5\" target=\"_blank\">Kushner and Trump e",
      "<p>US president optimistic after US, Qatari and Turkish officials join third day of indirect Israel-Hamas talks in Egypt</p><p>Donald Trump has said he may travel to the Middle East at the end of the week, adding that negotiations in Egypt to end the two-year war in Gaza were “very close” to reachin",
      "<p>Note from secretary of state says ‘you need to approve a Truth Social post soon so you can announce deal first’</p><p>The text of the note handed to Donald Trump by Marco Rubio, the secretary of state, on Wednesday afternoon, captured in a photograph, suggested the president could soon announce a"
    ],
    "image_url": "",
    "titles": [
      "GAZA PEACE DEAL REACHED: TRUMP - Axios",
      "Gaza peace deal may be imminent - Axios",
      "Kushner and Trump envoy arrive in Egypt for crucial negotiations on Gaza deal - Axios",
      "Trump says Gaza peace deal ‘very close’ and he may travel to Middle East in days",
      "Marco Rubio interrupts Trump with handwritten note on Gaza peace deal"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.954,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.653,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A peace deal to end the two-year war in Gaza appears imminent, with Donald Trump stating negotiations in Egypt, involving US, Qatari, and Turkish officials, are \"very close\" to a conclusion. Trump is optimistic about the talks and may travel to the Middle East soon. A note from Secretary of State Marco Rubio suggests Trump will soon announce the deal on Truth Social.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Tigers Rally to Beat Mariners 9-3, Force Decisive ALDS Game 5",
    "domain": "sports",
    "source_domain": "sports.yahoo.com",
    "location": "national",
    "published": "Wed, 08 Oct 2025 23:43:21 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "sports.yahoo.com"
    ],
    "snippets": [
      "The Detroit Tigers' All-Stars stepped up when they were needed the most.  Facing elimination and trailing the Seattle Mariners 3-0 in Game 4 of the American League Division Series on Wednesday, the Tigers' slumbering bats finally regained their thump and forced a winner-take-all Game 5 on Friday in ",
      "<p>Riley Greene and Javier Báez homered in a four-run sixth inning and the Detroit Tigers kept their season alive with a 9-3 win over the Seattle Mariners in Game 4 of the American League Division Series.</p>"
    ],
    "image_url": "",
    "titles": [
      "Tigers' All-Stars come through in 9-3 win over Mariners and force a Game 5 in ALDS",
      "Tigers rally to beat Mariners, force decisive Game 5 in AL Division Series"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.99,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.653,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Detroit Tigers overcame a 3-0 deficit against the Seattle Mariners in Game 4 of the American League Division Series, winning 9-3. Key players Riley Greene and Javier Báez hit home runs during a four-run sixth inning, reviving the team's offense. This victory forces a decisive Game 5, keeping the Tigers' season alive.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Fed Officials Split on Rate Cuts Amid Inflation Concerns",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Wed, 08 Oct 2025 19:04:20 GMT",
    "source": "Axios",
    "sources": [
      "Financial Times",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "www.ft.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMid0FVX3lxTE4tMnZYV3RzYmo1c0FVUUYwaEktTWl5ZlZ6VzlrT3lFb2lYRnc5SVRBWTg3OTlISEhnNXNud3BlMFhDNTZuN3p6NC1KV0JiUEtHdzR1UmZyNjRNQ29GRnE1QVAtUGg0MDNOaFNqRGpJQURkRXc3QjFZ?oc=5\" target=\"_blank\">Fed minutes show some officials cautious about recent rate cut</a>&",
      "Minutes from US central bank’s September meeting showed lingering concern about price pressures"
    ],
    "image_url": "",
    "titles": [
      "Fed minutes show some officials cautious about recent rate cut - Axios",
      "Fed officials were cautious about inflation as they agreed rate cuts"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.88,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.638,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Minutes from the US Federal Reserve's September meeting revealed that some officials were hesitant about the recent decision to cut rates, due to ongoing concerns about inflation. Despite this, new projections indicated that the Fed anticipates two more quarter-point rate reductions by the end of the year.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Lecornu Resigns 14 Hours After Cabinet Formation Amid Party Resistance",
    "domain": "business",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-10-08T18:39:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Financial Times",
      "Deutsche Welle"
    ],
    "domains": [
      "www.dw.com",
      "www.ft.com"
    ],
    "snippets": [
      "Caretaker Prime Minister Lecornu resigned on Monday only 14 hours after naming his Cabinet, which had met resistance from rival political parties.",
      "Outgoing premier Sébastien Lecornu says prospect of a snap parliamentary election is receding"
    ],
    "image_url": "",
    "titles": [
      "France: Macron to name new French PM after Lecornu resigns",
      "Emmanuel Macron to name a new French PM by Friday"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.891,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.633,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Caretaker Prime Minister Sébastien Lecornu resigned just 14 hours after forming his Cabinet due to resistance from rival political parties. Following his resignation, Lecornu noted that the likelihood of a snap parliamentary election is decreasing.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "2025 Nobel in Chemistry for Pioneers of Pollution-Fighting Frameworks",
    "domain": "technology",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-10-08T09:50:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Ars Technica",
      "Deutsche Welle"
    ],
    "domains": [
      "www.dw.com",
      "arstechnica.com"
    ],
    "snippets": [
      "The work that won Susumu Kitagawa, Richard Robson and Omar M. Yaghi the 2025 Nobel Prize in chemistry could help tackle challenges such as climate change and lack of fresh water.",
      "Three researchers share prize for structured polymers called metal-organic frameworks."
    ],
    "image_url": "",
    "titles": [
      "Trio wins chemistry Nobel Prize for metal organic framework",
      "Chemistry Nobel prize awarded for building ordered polymers with metal"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.741,
      "consensus": 0.591,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.623,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Susumu Kitagawa, Richard Robson, and Omar M. Yaghi were awarded the 2025 Nobel Prize in Chemistry for their development of metal–organic frameworks. These structures are capable of capturing carbon dioxide, storing toxic gases, catalyzing chemical reactions, and harvesting water from desert air. Their groundbreaking work offers potential solutions to global challenges like climate change and water scarcity.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: development, solution",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Amazon Pharmacy Launches Medication Kiosks for Common Prescriptions",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Wed, 08 Oct 2025 12:53:58 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "TechCrunch"
    ],
    "domains": [
      "www.cnbc.com",
      "techcrunch.com"
    ],
    "snippets": [
      "The kiosks are operated by Amazon Pharmacy and stock a range of commonly prescribed medications, such as antibiotics, inhalers and blood pressure treatments.",
      "The kiosks have a range of commonly prescribed medications, including antibiotics, inhalers, and blood pressure medications."
    ],
    "image_url": "",
    "titles": [
      "Amazon launches prescription vending machines at One Medical clinics in Los Angeles",
      "Amazon Pharmacy is launching vending machines for prescription drugs"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.774,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.61,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Amazon Pharmacy operates kiosks stocking various commonly prescribed medications like antibiotics, inhalers, and blood pressure treatments. The kiosks provide convenient access to these medications for customers.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Nobel Chemistry Prize Awarded for Metal-Organic Frameworks Innovation",
    "domain": "science",
    "source_domain": "www.newscientist.com",
    "location": "global",
    "published": "Wed, 08 Oct 2025 11:58:33 +0100",
    "source": "New Scientist",
    "sources": [
      "Phys.org",
      "New Scientist"
    ],
    "domains": [
      "phys.org",
      "www.newscientist.com"
    ],
    "snippets": [
      "Susumu Kitagawa, Richard Robson and Omar Yaghi have been honoured for the development of metal-organic frameworks, porous materials that can capture water or pollutants",
      "Three scientists have been awarded the 2025 Nobel prize in chemistry for discovering a new form of molecular architecture: crystals that contain large cavities."
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/10/08110541/SEI_269475037.jpg",
    "titles": [
      "Nobel prize in chemistry awarded for work on molecular architecture",
      "Nobel chemistry prize awarded for crystal materials that could revolutionize green technology"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.759,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.607,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Susumu Kitagawa, Richard Robson, and Omar Yaghi were awarded the Nobel Prize in Chemistry for creating metal-organic frameworks. These innovative porous materials have applications ranging from capturing water in deserts to storing gases and delivering drugs. This recognition highlights their significant contribution to science and various industries.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Asian Stocks Set to Climb Amid Rising US Market Confidence",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Wed, 08 Oct 2025 23:22:51 GMT",
    "source": "Bloomberg",
    "sources": [
      "Bloomberg"
    ],
    "domains": [
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMilAFBVV95cUxQVmI4SnQxUnBKUVNZaFpCRmdjQkd0R0VwdkJGU0FmUkFaWlplN0FPUzY2N01qMkMtSnBUZ0E5TFNiUkJmS2pKQ2FGT1FWanhxOTdZWDhBSTNLaGhfMWVab2tlMWNfYThVMDJBRW9wOU4xWWI4dnp2bjVaWFNPbGIzam9keTZIeEtEenA0MTlqMjlOU3Mw?oc=5\" target=\"_blank\">Asian Stocks to Rise on US ",
      "<a href=\"https://news.google.com/rss/articles/CBMilAFBVV95cUxPR2hJSm1SdENvMUl4WXN6YTVHSml1djBydVo2aGJGN3VHaVBodm1wUldTRnhlel84ZDNUb3VsQlk4ZnRoYjVVb2JZNWtNMTJZYVk5OF82a0ZkUEJCMkVDSTRQejdmVHZoZUtMeTY1YTQtdW1VNjJUeXktR0JUOUlESThHSE12YldVQW4xeEphNXdwaXlT?oc=5\" target=\"_blank\">Stock Buyers Step In to Pow"
    ],
    "image_url": "",
    "titles": [
      "Asian Stocks to Rise on US Gains, China to Re-Open: Markets Wrap - Bloomberg.com",
      "Stock Buyers Step In to Power Wall Street Rebound: Markets Wrap - Bloomberg.com"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.963,
      "consensus": 0.35,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.471,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Asian stocks are projected to rise following a positive shift in the US market, signaling investor confidence. This uptrend is supported by active stock buyers stepping in, which further boosts market optimism. The current status reflects a recovery in stock values, indicating a positive market outlook.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Prime Big Deal Days End with Discounts on Tech and Budget Items",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-10-08T18:58:33-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "www.theverge.com"
    ],
    "snippets": [
      "Prime Big Deal Days is well into its second and final day, and big-ticket tech like Sony’s Bravia 8 OLED TV and Bose’s QuietComfort headphones are still some of the more marquee deals that caught our eye. However, you don’t need to spend hundreds (or thousands) of dollars to score something great. I",
      "Day two of Prime Big Deal Days is in full swing, and while there are still plenty of big-ticket discounts lining the digital shelves of Amazon, not everyone is looking to shell out a bunch of cash (myself included). The good news is you don’t have to spend a fortune to score a great deal, [&#8230;]"
    ],
    "image_url": "",
    "titles": [
      "These 63 October Prime Day deals under $50 are still available",
      "We handpicked 30 last-minute Prime Day deals you can still grab for under $25"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.975,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.463,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Prime Big Deal Days has entered its final day with significant discounts on high-end items like Sony's Bravia 8 OLED TV and Bose’s QuietComfort headphones. Despite the focus on expensive technology, there are also numerous deals available for shoppers on a budget, emphasizing that great deals are accessible without spending a lot of money.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]