[
  {
    "title": "Trump Hosts Zelenskyy at White House to Discuss Ukraine War Resolution",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Tue, 19 Aug 2025 05:18:17 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Washington Post",
      "ABC News",
      "New York Times",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.washingtonpost.com",
      "www.nytimes.com",
      "abcnews.go.com"
    ],
    "snippets": [
      "US president proposes Putin-Zelenskyy summit in latest push to end the war in Ukraine.",
      "President Trump has downplayed the need for a ceasefire agreement, but if there isn't a one \"before those peace agreement talks, then the killing will just keep going,\" ABC News' Martha Raddatz says.",
      "A repeated refrain from European leaders during remarks ahead of their meeting was the need for security guarantees for Ukraine.",
      "The high-stakes gathering comes as Trump presses for a peace deal to end the war in Ukraine after Russia launched its full-scale invasion in 2022.",
      "The leaders presented a relatively united front and appeared to agree on the next steps in the effort to halt the fighting between Ukraine and Russia. But much remained unresolved."
    ],
    "image_url": "",
    "titles": [
      "What to know about Trump’s talks with Zelenskyy and European leaders",
      "WATCH:  President Trump meets with Ukrainian President Zelenskyy and European leaders",
      "WATCH:  President Trump pressed on security guarantees for Ukraine",
      "What to expect as Zelensky, European leaders meet Trump at White House",
      "5 Takeaways From Trump’s Meeting With Zelensky and European Leaders"
    ],
    "score_components": {
      "magnitude": 0.96,
      "recency": 0.943,
      "consensus": 0.985,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.821,
    "summary": "President Trump hosted Ukrainian President Volodymyr Zelenskyy at the White House, aiming to negotiate an end to the war in Ukraine. Despite Trump's minimal emphasis on a ceasefire, ABC News' Martha Raddatz highlighted its necessity to halt ongoing violence prior to peace talks. This significant meeting occurred six months after a previous diplomatic mishap in February, marking a warm reception between the leaders as they seek a resolution to the conflict.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 72 tokens",
    "image": {
      "src": "icons/ukraine.svg",
      "thumbnail": "icons/ukraine.svg",
      "alt": "ukraine flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "SoftBank Buys $2B in Intel Stock Amid AI Market Challenges",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Tue, 19 Aug 2025 05:59:32 GMT",
    "source": "CNBC",
    "sources": [
      "TechCrunch",
      "Financial Post",
      "CNBC",
      "Business Insider",
      "Washington Post",
      "Forbes",
      "MarketWatch"
    ],
    "domains": [
      "www.cnbc.com",
      "www.forbes.com",
      "www.washingtonpost.com",
      "www.marketwatch.com",
      "www.businessinsider.com",
      "techcrunch.com",
      "financialpost.com"
    ],
    "snippets": [
      "Investors are also looking ahead to the U.S. Federal Reserve Chair Jerome Powell's annual speech at the central bank's summit in Jackson Hole, Wyoming.",
      "SoftBank will pay $23 per share for Intel's common stock, acquiring roughly 2% of the struggling chipmaker.",
      "The U.S. chipmaker has struggled to keep pace in the AI market alongside competitors like Nvidia. Softbank has agreed to buy Intel common stock at $23 per share.",
      "SoftBank agreed to acquire $2 billion worth of stock in beleaguered chipmaker Intel as the Japanese conglomerate continues to deepen its investment in the U.S.",
      "Intel is getting a $2 billion investment in common stock from SoftBank, which is betting big on the AI revolution.",
      "Intel Corp. shares jumped in after-hours trading Monday after the chipmaker announced a $2 billion investment by Japan’s SoftBank Group Corp.",
      "BANGKOK (AP) &#8212; Japanese technology giant SoftBank Group plans to take a $2 billion stake in computer chip maker Intel as it deepens its involvement in U.S. semiconductor manufacturing and other advanced technology in the United States, the companies said Monday. Shares in SoftBank fell 4% Tues",
      "SoftBank will pay $23 per share for Intel common stock."
    ],
    "image_url": "",
    "titles": [
      "SoftBank shares fall over 5% after it announces $2 billion investment in Intel",
      "Intel is getting a $2 billion investment from SoftBank",
      "Japanese tech investment giant SoftBank to invest $2 billion in Intel",
      "SoftBank To Make $2 Billion Investment In Troubled U.S. Chipmaker Intel",
      "SoftBank is investing $2 billion in Intel as part of its AI bet",
      "Intel’s stock rallies after $2 billion investment by Japan’s SoftBank",
      "Japan’s SoftBank to take $2 billion stake in computer chip maker Intel",
      "SoftBank makes $2B investment in Intel"
    ],
    "score_components": {
      "magnitude": 0.92,
      "recency": 0.937,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.809,
    "summary": "SoftBank has agreed to purchase $2 billion worth of Intel's common stock at $23 per share, acquiring approximately 2% of the chipmaker. This investment comes as Intel faces challenges in the AI market, particularly against competitors like Nvidia. The announcement of this deal led to an increase in Intel Corp. shares in after-hours trading. This move signifies SoftBank's continued investment in U.S. semiconductor manufacturing and advanced technology sectors.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 72 tokens",
    "image": {
      "src": "icons/chart-up.svg",
      "thumbnail": "icons/chart-up.svg",
      "alt": "stock",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Zelenskyy, Trump Discuss Russia War, Seek Diplomatic Solutions",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 19 Aug 2025 03:09:59 GMT",
    "source": "BBC",
    "sources": [
      "New York Times",
      "Axios",
      "BBC",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.nytimes.com",
      "news.google.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Unlike February's row, Trump and Zelensky struck a more diplomatic tone despite their remaining differences.",
      "Ukraine&#039;s Volodymyr Zelenskyy has arrived at the White House for a crucial meeting with Donald Trump about Russia&#039;s war.",
      "<a href=\"https://news.google.com/rss/articles/CBMifkFVX3lxTE5pSUFsSW1PSkhUMzdfM0hnRERVaDkzXy00c0t1bmhIajR4RG1RY0NFN1FCeVhnWkJpU0ZPdURWSnFaVGgwZkdTTFVYRTZ3WnpuNGhqcHRFVGl4RGtfbWVqdEJrUHRFLWx3UGV0dTV3b0R3cmxINHh4cVBLODUtUQ?oc=5\" target=\"_blank\">Trump calls Putin at White House summit to arrange talks ",
      "European leaders are joining a trip to Washington to make sure the trans-Atlantic alliance remains intact."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/2d15/live/b4febdc0-7caf-11f0-83cc-c5da98c419b8.jpg",
    "titles": [
      "Zelensky leaves White House unscathed as he buys more time",
      "Zelenskyy arrives at White House for talks with Trump",
      "Trump calls Putin at White House summit to arrange talks with Zelensky - Axios",
      "Zelensky Brings Backup to the White House as Trump Aligns More Closely With Putin"
    ],
    "score_components": {
      "magnitude": 0.92,
      "recency": 0.884,
      "consensus": 0.985,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.795,
    "summary": "During a significant meeting at the White House, Ukrainian President Volodymyr Zelenskyy and U.S. President Donald Trump discussed Russia's war, adopting a more diplomatic approach than in previous encounters. Trump also called Putin to arrange talks, signaling efforts to address the conflict directly. The meeting, which included European leaders, aimed to ensure the trans-Atlantic alliance's unity amidst the ongoing situation with Russia.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 66 tokens",
    "image": {
      "src": "icons/russia.svg",
      "thumbnail": "icons/russia.svg",
      "alt": "russia flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Hamas Agrees to Ceasefire, Hostage Release in 60-Day Deal",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 18 Aug 2025 20:51:15 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian",
      "New York Times",
      "Axios",
      "Al Jazeera"
    ],
    "domains": [
      "www.nytimes.com",
      "news.google.com",
      "www.aljazeera.com",
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The proposal from regional mediators would see Israeli hostages released in two batches during a 60-day truce, according to a Palestinian official.",
      "A Hamas source told Al Jazeera the group has agreed terms for a ceasefire in Gaza, as a step towards ending the war.",
      "<a href=\"https://news.google.com/rss/articles/CBMifEFVX3lxTE9saHZpZ0I3UnptUi1iSVRsSzllcS1fM1ZJZWt5eWVXRmNRamZSQ2p3LVFLU3pfTks2UlR0cHNDLTktenpjekJGeVFsWnpnX1lGTUFMamRYSEhMbVRNQzkxN0t2bHYtM1RjdHduSUVPNXh0QndMUDZJbnhjSFc?oc=5\" target=\"_blank\">Hamas accepts latest Gaza ceasefire and hostage deal proposa",
      "<p>Deal would include 60-day halt to violence and exchange of half of living Israeli hostages for Palestinian prisoners</p><p>Hamas officials say they have accepted a proposal for a Gaza ceasefire deal that would include the release of half of the approximately 20 remaining living Israeli hostages a",
      "It was unclear whether Prime Minister Benjamin Netanyahu of Israel was on board with the terms, which came as Qatar and Egypt were intensifying mediation efforts."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/fee2/live/2774ccb0-7c96-11f0-ab3e-bd52082cd0ae.jpg",
    "titles": [
      "Hamas source says group agrees to latest Gaza ceasefire proposal",
      "Hamas agrees terms for Gaza ceasefire, source tells Al Jazeera",
      "Hamas accepts latest Gaza ceasefire and hostage deal proposal - Axios",
      "Hamas says it accepts proposal for Gaza ceasefire and release of hostages",
      "Hamas Accepts New Gaza Cease-Fire Proposal, Officials Say"
    ],
    "score_components": {
      "magnitude": 0.9,
      "recency": 0.775,
      "consensus": 1.0,
      "constructiveness": 0.091,
      "proximity": 0.5
    },
    "score": 0.779,
    "summary": "Hamas has agreed to a ceasefire and hostage deal proposed by regional mediators, which includes the release of Israeli hostages in two phases over a 60-day period, as confirmed by a Palestinian official. This development aims to establish a truce in the region.",
    "constructiveness_score": 0.091,
    "constructiveness_reason": "1 constructive keywords out of 44 tokens",
    "image": {
      "src": "icons/newspaper.svg",
      "thumbnail": "icons/newspaper.svg",
      "alt": "general",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Alcaraz Wins Cincinnati Open as Sinner Retires Due to Illness",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 18 Aug 2025 20:45:33 GMT",
    "source": "BBC",
    "sources": [
      "Sportsnet",
      "BBC",
      "The Guardian",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.theguardian.com",
      "www.sportsnet.ca",
      "www.bbc.com"
    ],
    "snippets": [
      "Jannik Sinner retires from the Cincinnati Open final against Carlos Alcaraz with illness, only six days before he begins his US Open title defence.",
      "Jannik Sinner retires from the Cincinnati Open final against Carlos Alcaraz with illness, only six days before he begins his US Open title defence.",
      "The defending champ pulls out with illness, raising questions about his preparations before next Sunday&#039;s US Open.",
      "<ul><li><p>Alcaraz confident rival is ‘going to come back stronger’</p></li><li><p>Swiatek beats Paolini 7-5, 6-4 to win women’s title</p></li></ul><p>Carlos Alcaraz has won the Cincinnati Open for the first time in his career after the world No 1, Jannik Sinner, his great rival, was forced to retir",
      "<p>The latest entry in the burgeoning Carlos Alcaraz-Jannik Sinner rivalry wasn&#8217;t quite the epic with which tennis fans have become accustomed.</p>"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/5e1b/live/cb0cae80-7c71-11f0-ab3e-bd52082cd0ae.jpg",
    "titles": [
      "Sinner retires from final against Alcaraz with illness just six days before US Open",
      "Sinner retires from Cincinnati final against Alcaraz with illness",
      "Carlos Alcaraz wins Cincinnati Open final after Jannik Sinner retires",
      "Carlos Alcaraz wins Cincinnati Open as Sinner retires from final with illness",
      "Alcaraz wins Cincinnati Open after Sinner retires with illness"
    ],
    "score_components": {
      "magnitude": 0.9,
      "recency": 0.773,
      "consensus": 0.985,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.766,
    "summary": "Carlos Alcaraz won the Cincinnati Open for the first time after his opponent, world No. 1 Jannik Sinner, retired due to illness during the final. At the time of retirement, Sinner was trailing 0-5. Alcaraz, the second seed, was confident that Sinner would come back stronger. This event marks a significant moment in the ongoing rivalry between Alcaraz and Sinner, although this match did not live up to the epic encounters expected by fans.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 75 tokens",
    "image": {
      "src": "icons/newspaper.svg",
      "thumbnail": "icons/newspaper.svg",
      "alt": "general",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Bogaerts' HR Overturned for Fan Interference, Padres Manager Ejected",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 19 Aug 2025 00:45:15 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.sportsnet.ca",
      "www.cbssports.com"
    ],
    "snippets": [
      "San Diego's Xander Bogaerts had a home run overturned due to fan interference, and Padres manager Mike Shildt was ejected for coming out of the dugout to talk to the umpires in the second inning of Monday night's 4-3 loss to the San Francisco Giants.",
      "Did the fan even interfere with the ball?",
      "<p>Xander Bogaerts of the San Diego Padres had a home run overturned due to fan interference and manager Mike Shildt was ejected for coming out of the dugout to talk to the umpires in the second inning of Monday night&#8217;s game against the San Francisco Giants.</p>"
    ],
    "image_url": "",
    "titles": [
      "Padres' Bogaerts loses HR on fan interference call",
      "Padres' Xander Bogaerts has HR taken away, ruled out due to controversial fan interference call vs. Giants",
      "Padres’ Bogaerts loses homer on fan interference call, manager Shildt ejected"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.932,
      "consensus": 0.897,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.766,
    "summary": "In a game against the San Francisco Giants, San Diego Padres' Xander Bogaerts had a home run overturned due to fan interference. Padres manager Mike Shildt was ejected for disputing the call with umpires in the second inning. The incident occurred during the Padres' 4-3 loss on Monday night.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 50 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Trump Plans Trilateral Meeting on Ukraine Security After Talks with Putin",
    "domain": "business",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Tue, 19 Aug 2025 00:51:55 -0400",
    "source": "ABC News",
    "sources": [
      "Fortune",
      "Forbes",
      "ABC News"
    ],
    "domains": [
      "fortune.com",
      "www.forbes.com",
      "abcnews.go.com"
    ],
    "snippets": [
      "President Donald Trump was asked in the Oval Office about security guarantees for Ukraine and whether that will involve the U.S.",
      "Trump's discussions with Zelenskyy come after he met with Russian President Vladimir Putin on Friday.",
      "\"After that meeting takes place, we will have a Trilat, which would be the two Presidents, plus myself.\""
    ],
    "image_url": "https://s.abcnews.com/images/US/donald-trump-12-gty-gmh-250818_1755538547682_hpMain_4x3t_384.jpg",
    "titles": [
      "Trump-Zelenskyy live updates: Trump says Putin-Zelenskyy meeting being planned",
      "Trump Says He Called Putin To Make ‘Arrangements’ For Putin-Zelenskyy Meeting (Live Updates)",
      "Trump says he’s arranging for Putin and Zelenskyy to meet face to face, followed by meeting of all 3 presidents"
    ],
    "score_components": {
      "magnitude": 0.86,
      "recency": 0.935,
      "consensus": 0.897,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.762,
    "summary": "President Donald Trump discussed security guarantees for Ukraine in the Oval Office, following his recent meeting with Russian President Vladimir Putin. Trump mentioned that after his upcoming meeting with Ukrainian President Zelenskyy, a trilateral meeting (Trilat) involving himself, Zelenskyy, and Putin will occur. This aims to address security concerns involving the U.S. and Ukraine.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 55 tokens",
    "image": {
      "src": "icons/ukraine.svg",
      "thumbnail": "icons/ukraine.svg",
      "alt": "ukraine flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Iga Swiatek Wins Cincinnati Open, Eyes US Open After Wimbledon Victory",
    "domain": "sports",
    "source_domain": "www.independent.co.uk",
    "location": "national",
    "published": "Tue, 19 Aug 2025 06:46:41 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Sportsnet",
      "Sky Sports",
      "Yahoo Sports"
    ],
    "domains": [
      "www.independent.co.uk",
      "www.sportsnet.ca",
      "www.bbc.com",
      "www.skysports.com"
    ],
    "snippets": [
      "Swiatek captured her first Cincinnati Open title without losing a set after beating Jasmine Paolini in the final",
      "World number three Iga Swiatek said triumph at the Cincinnati Open gives her a &quot;boost of confidence&quot; before the US Open begins on Sunday.",
      "Iga Swiatek warmed up for the US Open by winning the Cincinnati Open for the first time and will now turn her attentions to securing back-to-back Grand Slam titles after her Wimbledon triumph in July.",
      "<p>Third-ranked Iga Swiatek captured the Cincinnati Open title by defeating No. 7 Jasmine Paolini 7-5, 6-4 on Monday night.</p>"
    ],
    "image_url": "",
    "titles": [
      "Iga Swiatek sends ominous message to US Open rivals after securing Cincinnati title",
      "Swiatek beats Paolini to win Cincinnati title",
      "Swiatek wins Cincinnati title ahead of US Open",
      "Iga Swiatek wins Cincinnati Open title, defeats Jasmine Paolini"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.973,
      "consensus": 0.897,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.749,
    "summary": "Iga Swiatek won her first Cincinnati Open title, defeating Jasmine Paolini 7-5, 6-4 in the final without losing a set throughout the tournament. Ranked third in the world, Swiatek's victory boosts her confidence ahead of the US Open, following her recent Wimbledon triumph. She aims for consecutive Grand Slam titles.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 53 tokens",
    "image": {
      "src": "icons/usa.svg",
      "thumbnail": "icons/usa.svg",
      "alt": "us flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "European Leaders Present Ukraine Security Plan in DC, Trump Noncommittal",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Mon, 18 Aug 2025 19:30:15 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Financial Times",
      "The Guardian",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.theguardian.com",
      "www.ft.com"
    ],
    "snippets": [
      "European leaders join Ukrainian President Volodymyr Zelenskyy in Washington, DC for talks.",
      "Document seen by FT lays out Kyiv’s proposals to US president at crucial White House meeting",
      "<p>Moscow has yet to confirm meeting after day of intense diplomacy at White House with European leaders</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/aug/18/ukraine-war-live-update-russia-zelenskyy-washington-trump-europe-meeting-talks-latest-news#top-of-blog\">Follow it live:</"
    ],
    "image_url": "",
    "titles": [
      "Are US security guarantees enough to end the war in Ukraine?",
      "Ukraine offers Trump $100bn weapons deal to win security guarantees",
      "Ukraine talks: Trump arranging Zelenskyy-Putin meeting as European leaders push for US security guarantees"
    ],
    "score_components": {
      "magnitude": 0.86,
      "recency": 0.769,
      "consensus": 0.897,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.729,
    "summary": "European leaders met with Ukrainian President Volodymyr Zelenskyy in Washington, DC, emphasizing the need for security guarantees for Ukraine. A document outlining Kyiv's proposals was presented to the US President at a significant White House meeting. However, President Trump has not committed to deploying American forces in Ukraine, and the specifics of the proposed defenses remain undisclosed.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 58 tokens",
    "image": {
      "src": "icons/ukraine.svg",
      "thumbnail": "icons/ukraine.svg",
      "alt": "ukraine flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "\"Jasveen Sangha to Plead Guilty in Ketamine Case Linked to Matthew Perry's Death",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 19 Aug 2025 00:07:33 GMT",
    "source": "BBC",
    "sources": [
      "Deutsche Welle",
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "www.dw.com",
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The American-British dual-national is one of five people who were charged with supplying ketamine to the actor.",
      "The woman known as the \"ketamine queen\" has agreed to plead guilty to supplying the drug that killed \"Friends\" actor Matthew Perry, according to prosecutors.",
      "<p>Jasveen Sangha, fifth and last defendant charged in Friends star’s overdose to strike plea agreement with prosecutors</p><p>A woman known as the “ketamine queen”, charged with selling Matthew Perry the drug that killed him, agreed to plead guilty on Monday.</p><p>Jasveen Sangha became the fifth a"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/f9aa/live/19eb83f0-7c6d-11f0-b2a5-a19d6935816e.jpg",
    "titles": [
      "'Ketamine Queen' to plead guilty in Matthew Perry overdose case",
      "Woman to plead guilty over drug that killed Matthew Perry",
      "‘Ketamine queen’ accused of selling Matthew Perry fatal dose to plead guilty"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.829,
      "consensus": 0.897,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.72,
    "summary": "Jasveen Sangha, dubbed the \"ketamine queen\" and an American-British dual-national, has agreed to plead guilty to supplying ketamine that resulted in the death of \"Friends\" actor Matthew Perry. She is the fifth and final defendant to reach a plea agreement with prosecutors regarding the case.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 47 tokens",
    "image": {
      "src": "icons/newspaper.svg",
      "thumbnail": "icons/newspaper.svg",
      "alt": "general",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Leeds United Beats Everton 1-0 with Late Nmecha Penalty",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 18 Aug 2025 21:35:39 GMT",
    "source": "BBC",
    "sources": [
      "Sportsnet",
      "Sky Sports",
      "BBC"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.bbc.com",
      "www.skysports.com"
    ],
    "snippets": [
      "A late penalty from summer signing Lukas Nmecha helps Leeds United win their opening match on their return to the Premier League as they beat Everton 1-0 at Elland Road.",
      "Leeds take a late lead at Elland Road against Everton.",
      "<p>Jack Grealish was unable to inspire Everton after going on as a second-half substitute for his debut in a 1-0 loss to promoted Leeds in the Premier League on Monday.</p>"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/08ea/live/4cbe7550-7c7a-11f0-a34f-318be3fb0481.jpg",
    "titles": [
      "Late penalty gives Leeds win against Everton on Premier League return",
      "LATE DRAMA as penalty controversy gives Leeds late goal against Everton!",
      "Grealish debuts for Everton in loss at promoted Leeds in Premier League"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.787,
      "consensus": 0.897,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.712,
    "summary": "Lukas Nmecha's late penalty secured Leeds United a 1-0 victory over Everton in their Premier League return at Elland Road. Despite Jack Grealish's debut as a second-half substitute for Everton, he couldn't prevent the loss. This win marks a successful start for Leeds in the league.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 51 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Newsmax Pays $67M to Settle Dominion Defamation Lawsuit",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Mon, 18 Aug 2025 17:59:33 +0000",
    "source": "Al Jazeera",
    "sources": [
      "CityNews",
      "Axios",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "news.google.com",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "Newsmax has paid $27m so far, and will pay $20m in 2026 and $20m in 2027 to technology firm Dominion Voting Systems.",
      "<a href=\"https://news.google.com/rss/articles/CBMiigFBVV95cUxNVFVqUTl4QUhjNXhrMFd0LUpSdlRYcWxFVFFCbVFyNDc3SERWX1dDdUFJOE1Tc09VbEtkYzZJRmpQWXN1WG9oZGFIM0kwSEtHY0pVeUlCNElHaFYyM0JMdHZkWS1Qbm9udl9JN2ZRVGNKVTh6X25UTVZ4ZzNiZ1JHdGxYM24wWVVGSnc?oc=5\" target=\"_blank\">Newsmax to pay $67M settlement to Domini",
      "DENVER (AP) — The conservative network Newsmax will pay $67 million to settle a lawsuit accusing it of defaming a voting equipment company by spreading lies about President Donald Trump’s 2020 election loss, according to documents filed Monday. The settlement comes after Fox News Channel paid $787.5"
    ],
    "image_url": "",
    "titles": [
      "Right-wing US network Newsmax to pay $67m over false 2020 election claims",
      "Newsmax to pay $67M settlement to Dominion Voting Systems over 2020 election lies - Axios",
      "Conservative network Newsmax agrees to pay $67M in defamation case over bogus 2020 election claims"
    ],
    "score_components": {
      "magnitude": 0.82,
      "recency": 0.745,
      "consensus": 0.897,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.71,
    "summary": "Newsmax has agreed to pay $67 million to settle a defamation lawsuit with Dominion Voting Systems. The lawsuit accused Newsmax of spreading false claims about the 2020 presidential election. The settlement includes payments of $27 million already made, with additional payments scheduled for 2026 and 2027. This follows a similar lawsuit in which Fox News Channel paid $787.5 million.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 60 tokens",
    "image": {
      "src": "icons/newspaper.svg",
      "thumbnail": "icons/newspaper.svg",
      "alt": "general",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Zelenskyy Condemns Attacks, Seeks Support Amid Russian Strikes",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Mon, 18 Aug 2025 15:25:07 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Washington Post",
      "New York Times",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.washingtonpost.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "Ukraine&#039;s President Zelenskyy says attacks on civilians are &#039;demonstrative and cynical&#039; before high-stakes talks.",
      "Amid renewed Russian missile attacks, Zelensky and European leaders pushed Trump on security guarantees for Ukraine.",
      "President Volodymyr Zelensky of Ukraine pressed for security guarantees in a cordial meeting with President Trump and European leaders."
    ],
    "image_url": "",
    "titles": [
      "Russia pounds Ukraine, kills more civilians before White House meeting",
      "Russia pounds Ukraine ahead of Zelensky White House meeting",
      "White House Meeting Ends With Few Signs of Progress on Ukraine"
    ],
    "score_components": {
      "magnitude": 0.82,
      "recency": 0.706,
      "consensus": 0.897,
      "constructiveness": 0.071,
      "proximity": 0.5
    },
    "score": 0.71,
    "summary": "Ukrainian President Volodymyr Zelenskyy labeled recent attacks on civilians as 'demonstrative and cynical' amid a backdrop of renewed Russian missile strikes. In meetings with President Trump and European leaders, Zelenskyy advocated for security guarantees for Ukraine, describing the discussions as cordial. This push for support comes as Ukraine seeks to bolster its defenses against ongoing aggression.",
    "constructiveness_score": 0.071,
    "constructiveness_reason": "1 constructive keywords out of 56 tokens",
    "image": {
      "src": "icons/russia.svg",
      "thumbnail": "icons/russia.svg",
      "alt": "russian flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "OpenAI Launches Lowest-Priced Subscription in India at 399 Rupees",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Tue, 19 Aug 2025 06:31:36 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "TechCrunch"
    ],
    "domains": [
      "www.cnbc.com",
      "techcrunch.com"
    ],
    "snippets": [
      "OpenAI has launched a subscription plan for users in India, priced at just 399 rupees ($4.57) per month, its most affordable offering yet.",
      "This plan will offer 10x more messages and image generation than the free tier, among other benefits."
    ],
    "image_url": "",
    "titles": [
      "OpenAI launches cheapest ChatGPT plan at $4.6, starting in India",
      "OpenAI launches a sub $5 ChatGPT plan in India"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.948,
      "consensus": 0.682,
      "constructiveness": 0.195,
      "proximity": 0.5
    },
    "score": 0.682,
    "summary": "OpenAI introduced a subscription plan in India for 399 rupees ($4.57) per month, marking its lowest-priced package. This new plan provides subscribers with ten times more messages and image generation capabilities than the free version, along with additional benefits.",
    "constructiveness_score": 0.195,
    "constructiveness_reason": "2 constructive keywords out of 41 tokens",
    "image": {
      "src": "icons/india.svg",
      "thumbnail": "icons/india.svg",
      "alt": "india flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Diamondbacks' Ketel Marte Misses Games After Home Burglary Incident",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 19 Aug 2025 00:45:15 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Ketel Marte explained he was \"frustrated\" and \"in a bad spot\" after his home was burglarized during the All-Star break, leading him to miss games.",
      "<p>Ketel Marte is having one of the best seasons of his career on the field. That hasn&#8217;t stopped a fair amount of criticism for the Arizona Diamondbacks slugger off of it.</p>"
    ],
    "image_url": "",
    "titles": [
      "D-backs star Marte apologizes, explains absence",
      "Diamondbacks’ Ketel Marte apologizes for absence following All-Star break"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.932,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.677,
    "summary": "Ketel Marte, an Arizona Diamondbacks player, missed games due to frustration and distress after his home was burglarized during the All-Star break. Despite experiencing one of his best seasons on the field, Marte has faced significant criticism off it. This incident highlights the personal challenges he has encountered amidst his professional success.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 53 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Titans' Ward, Simmons Involved in Practice Scuffle After TD Celebration",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 19 Aug 2025 00:45:15 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Titans rookie QB Cam Ward got into a scuffle with defensive lineman Jeffrey Simmons as the two exchanged shoves.",
      "Tensions flared after Ward flashed his signature move in front of Simmons after a touchdown toss in practice"
    ],
    "image_url": "",
    "titles": [
      "Titans QB Ward scuffles with DT Simmons in camp",
      "'Zombieland' celebration triggers skirmish between Cameron Ward, Jeffery Simmons at Titans training camp"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.932,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.677,
    "summary": "During a practice session, Tennessee Titans rookie quarterback Cam Ward and defensive lineman Jeffrey Simmons were involved in a scuffle following Ward's touchdown pass celebration, which included his signature move directed at Simmons. The altercation consisted of the two players exchanging shoves.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 43 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Frankie Edgar Exits Retirement for Bare Knuckle Fighting Championship",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 19 Aug 2025 00:45:15 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "UFC Hall of Famer Frankie Edgar is poised to come out of retirement for a bare-knuckle boxing contest.",
      "<p>Turns out &#8216;The Answer&#8217; couldn&#8217;t stay away. Former UFC lightweight champion Frankie Edgar is returning to sign with the Bare Knuckle Fighting Championship, Yahoo&#8217;s Ariel Helwani reports.</p>"
    ],
    "image_url": "",
    "titles": [
      "UFC HOFer Edgar unretiring for Bare Knuckle fight",
      "Report: Frankie Edgar unretires to join Bare Knuckle Fighting Championship"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.932,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.677,
    "summary": "Former UFC lightweight champion and Hall of Famer Frankie Edgar is coming out of retirement to join the Bare Knuckle Fighting Championship, as reported by Ariel Helwani of Yahoo. This marks Edgar's return to combat sports in a new format, transitioning from mixed martial arts to bare-knuckle boxing.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 50 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Week 2 Standouts: Croskey-Merritt and Tinsley Emerge as Players to Watch",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 18 Aug 2025 23:54:57 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Week 2 is a dress rehearsal for many teams, so how did the starters look in extended play?",
      "Get to know the names Jacory Croskey-Merritt (aka 'Bill') and Mitchell Tinsley"
    ],
    "image_url": "",
    "titles": [
      "Preseason takeaways: Can Washington's run game survive without Brian Robinson Jr.?",
      "Commanders-Bengals takeaways: Cincinnati defense is major issue, Washington RBs shine without Brian Robinson"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.916,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.674,
    "summary": "Week 2 of the season served as a dress rehearsal for many teams, where starters had extended playtime. Two players, Jacory Croskey-Merritt, also known as 'Bill', and Mitchell Tinsley, stood out during this period. Their performance has made them notable names to watch.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 44 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "US Open Mixed Doubles Revamp Draws Stars; $1M Prize Announced",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 18 Aug 2025 23:27:24 EST",
    "source": "ESPN",
    "sources": [
      "Yahoo Sports",
      "ESPN"
    ],
    "domains": [
      "www.independent.co.uk",
      "www.espn.com"
    ],
    "snippets": [
      "The US Open mixed doubles tournament has a new look, with huge names and prize money.",
      "Comment: For all the star-studded pairs and $1m winning purse, the new-look mixed doubles in New York lacks Grand Slam prestige and has largely disregarded doubles specialists, as Kieran Jackson explains"
    ],
    "image_url": "",
    "titles": [
      "Everything to know about the revamped -- and controversial -- US Open mixed doubles",
      "Why controversial US Open mixed doubles event is not worthy of Grand Slam status"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.908,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.672,
    "summary": "The US Open mixed doubles tournament has been revamped, featuring prominent players like Emma Raducanu, Carlos Alcaraz, Jannik Sinner, Iga Swiatek, and Madison Keys. In the first round, Britons Raducanu and Jack Draper will compete against each other, paired with Alcaraz and Jessica Pegula, respectively. The event, now positioned before the main tournament, offers a significant prize of $1 million to the winning duo, attracting Grand Slam singles champions to participate.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 71 tokens",
    "image": {
      "src": "icons/usa.svg",
      "thumbnail": "icons/usa.svg",
      "alt": "us flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Trump Pledges US Support for Ukraine, Seeks Summit with Zelenskyy and Putin",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Mon, 18 Aug 2025 23:26:59 GMT",
    "source": "Axios",
    "sources": [
      "Financial Times",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "www.ft.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMiiAFBVV95cUxQdXphVTNOcTI3RmlmMTBNWXhZdUxwdTRzLXFuM3hNXy0tQmhpVzdmV1pJcUVvQkJ2RUNlNFZyTlpQeXBSaEVucTNJbXdROEF1b3I3d3JWczREY0tlYmM3UkQ2Z0w4LWFkUzdHQlNVRXlvNVRaUXRKRDdaX3BXYUtpenY2d0haRVBI?oc=5\" target=\"_blank\">Trump says U.S. will help guarantee Ukraine",
      "President moves to arrange summit between Zelenskyy and Putin in bid to end Russian invasion"
    ],
    "image_url": "",
    "titles": [
      "Trump says U.S. will help guarantee Ukraine's security if peace deal signed - Axios",
      "Trump says US to ‘co-ordinate’ Ukraine’s security with Europe"
    ],
    "score_components": {
      "magnitude": 0.76,
      "recency": 0.818,
      "consensus": 0.682,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.66,
    "summary": "President Trump has announced that the U.S. will assist in guaranteeing Ukraine's security and is working to organize a summit between Ukrainian President Zelenskyy and Russian President Putin. This effort aims to conclude the Russian invasion of Ukraine.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "1 constructive keywords out of 40 tokens",
    "image": {
      "src": "icons/usa.svg",
      "thumbnail": "icons/usa.svg",
      "alt": "us flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Trump Hosts Zelenskyy at White House to Discuss Ukraine War Resolution",
    "domain": "business",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Mon, 18 Aug 2025 19:40:49 -0400",
    "source": "ABC News",
    "sources": [
      "Financial Times",
      "ABC News"
    ],
    "domains": [
      "www.ft.com",
      "abcnews.go.com"
    ],
    "snippets": [
      "President Trump welcomed Ukrainian President Volodymyr Zelenskyy to the White House as Trump continues to push for a deal to end the war in Ukraine.",
      "Leaders’ warm meeting in the White House comes six months after February fiasco"
    ],
    "image_url": "https://s.abcnews.com/images/Politics/250818_abc_social_oval_office_hpMain_4x3_384.jpg",
    "titles": [
      "WATCH:  President Trump and Ukrainian President Zelenskyy meet in Oval Office",
      "A letter for Melania and a suit: Zelenskyy charms Trump in the Oval Office"
    ],
    "score_components": {
      "magnitude": 0.76,
      "recency": 0.839,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.654,
    "summary": "President Trump hosted Ukrainian President Volodymyr Zelenskyy at the White House, aiming to negotiate an end to the war in Ukraine. Despite Trump's minimal emphasis on a ceasefire, ABC News' Martha Raddatz highlighted its necessity to halt ongoing violence prior to peace talks. This significant meeting occurred six months after a previous diplomatic mishap in February, marking a warm reception between the leaders as they seek a resolution to the conflict.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 72 tokens",
    "image": {
      "src": "icons/ukraine.svg",
      "thumbnail": "icons/ukraine.svg",
      "alt": "ukraine flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Hurricane Erin Spurs Tropical Storm Watch in North Carolina",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Mon, 18 Aug 2025 14:04:50 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "Forbes"
    ],
    "domains": [
      "www.npr.org",
      "www.forbes.com"
    ],
    "snippets": [
      "Tropical storm conditions and coastal flooding are expected to appear in areas along the Outer Banks starting late Wednesday.",
      "Though Hurricane Erin will not make landfall in the U.S., here's why a tropical storm watch has been issued for parts of North Carolina."
    ],
    "image_url": "",
    "titles": [
      "Hurricane Erin: Storm surge watch is issued for North Carolina's Outer Banks",
      "Hurricane Erin Prompts Tropical Storm Watch For North Carolina"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.747,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.64,
    "summary": "Tropical storm conditions and coastal flooding are anticipated along the Outer Banks of North Carolina starting late Wednesday due to Hurricane Erin. Although Erin is not expected to make landfall in the U.S., a tropical storm watch has been issued for parts of North Carolina as a precaution.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 49 tokens",
    "image": {
      "src": "icons/briefcase.svg",
      "thumbnail": "icons/briefcase.svg",
      "alt": "business",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Soho House to Be Acquired for $2.7 Billion Despite No Profits",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Mon, 18 Aug 2025 21:35:43 GMT",
    "source": "Axios",
    "sources": [
      "Fortune",
      "Axios"
    ],
    "domains": [
      "fortune.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMiZ0FVX3lxTE5BUGdQMDI4S0Jlbmx4UGRNSEstMTNXbjdrWXVXSGJNU0tNZU54SWVQRVFLN3NoNW1CMXBua0MwTHlORzQtNkpKa3p4RGIzODRKNmJ3SzlzeXI1aG9pUUowUV95Znc0WTA?oc=5\" target=\"_blank\">Soho House to be acquired for $2.7 billion</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Axios</f",
      "Founded in 1995, Soho House has never turned a profit."
    ],
    "image_url": "",
    "titles": [
      "Soho House to be acquired for $2.7 billion - Axios",
      "Soho House goes private in $2.7 billion deal as Ashton Kutcher joins the board of the swanky members’ club"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.787,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.623,
    "summary": "Soho House, founded in 1995, is set to be acquired for $2.7 billion. Despite its establishment over two decades ago, the company has never recorded a profit.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 28 tokens",
    "image": {
      "src": "icons/briefcase.svg",
      "thumbnail": "icons/briefcase.svg",
      "alt": "business",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Palo Alto Networks Beats Q4 Expectations, Offers Positive Outlook",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Mon, 18 Aug 2025 21:33:26 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "MarketWatch"
    ],
    "domains": [
      "www.marketwatch.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "Palo Alto Networks surpassed Wall Street's fiscal fourth-quarter estimates and issued upbeat guidance.",
      "The cybersecurity company’s recent “platformization” push has paid off, and investors are optimistic about future growth."
    ],
    "image_url": "",
    "titles": [
      "Palo Alto Networks reports earnings beat, says founder Nir Zuk retiring from company",
      "Palo Alto Networks’ stock rises as earnings point to future sales boom"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.786,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.623,
    "summary": "Palo Alto Networks exceeded Wall Street's expectations for the fiscal fourth quarter and provided positive future guidance. The company's strategy to expand its platform offerings has been successful, leading to investor optimism about its growth potential.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 38 tokens",
    "image": {
      "src": "icons/briefcase.svg",
      "thumbnail": "icons/briefcase.svg",
      "alt": "business",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Hong Kong Conservationists Fight to Save Endangered Species in Urban Area",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Tue, 19 Aug 2025 02:04:50 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "phys.org"
    ],
    "snippets": [
      "Above the teeming shopping streets of Hong Kong's Causeway Bay district, a fight to save one of the world's most endangered species is unfolding high in the branches of a decades-old cotton tree."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/nestled-among-the-boug.jpg",
    "titles": [
      "HK scientist puts hope in nest boxes to save endangered cockatoos"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.959,
      "consensus": 0.393,
      "constructiveness": 0.182,
      "proximity": 0.5
    },
    "score": 0.498,
    "summary": "In Hong Kong's Causeway Bay district, conservationists are engaged in efforts to protect one of the most endangered species in the world, situated in the branches of an old cotton tree. This initiative highlights the ongoing battle for wildlife preservation amidst urban development.",
    "constructiveness_score": 0.182,
    "constructiveness_reason": "2 constructive keywords out of 44 tokens",
    "image": {
      "src": "icons/beaker.svg",
      "thumbnail": "icons/beaker.svg",
      "alt": "science",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Protein Prediction Models Boost Drug Discovery and Biological Research",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Tue, 19 Aug 2025 02:30:01 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "phys.org"
    ],
    "snippets": [
      "Within the past few years, models that can predict the structure or function of proteins have been widely used for a variety of biological applications, such as identifying drug targets and designing new therapeutic antibodies."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2019/10-dna.jpg",
    "titles": [
      "Researchers glimpse the inner workings of protein language models"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.967,
      "consensus": 0.393,
      "constructiveness": 0.111,
      "proximity": 0.5
    },
    "score": 0.493,
    "summary": "In recent years, models capable of predicting protein structures and functions have become integral in biology, aiding in identifying drug targets and designing therapeutic antibodies. These tools have broad applications in advancing medical and biological research.",
    "constructiveness_score": 0.111,
    "constructiveness_reason": "1 constructive keywords out of 36 tokens",
    "image": {
      "src": "icons/beaker.svg",
      "thumbnail": "icons/beaker.svg",
      "alt": "science",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "New mRNA Cancer Vaccine Shows Promise in Mice, May Boost Immunotherapy",
    "domain": "science",
    "source_domain": "www.sciencedaily.com",
    "location": "global",
    "published": "Tue, 19 Aug 2025 02:22:25 EDT",
    "source": "ScienceDaily",
    "sources": [
      "ScienceDaily"
    ],
    "domains": [
      "www.sciencedaily.com"
    ],
    "snippets": [
      "A breakthrough mRNA cancer vaccine has shown the ability to supercharge the effects of immunotherapy in mice, sparking hope for a universal “off-the-shelf” treatment that could fight multiple cancers. Unlike traditional vaccines designed to target specific tumor proteins, this approach simply revs u"
    ],
    "image_url": "",
    "titles": [
      "A new cancer vaccine just wiped out tumors in mice"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.964,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.481,
    "summary": "A new mRNA cancer vaccine has demonstrated potential in mice studies to enhance immunotherapy effectiveness, offering hope for a universal treatment against various cancers. This innovative vaccine differs from traditional ones by not targeting specific tumor proteins but instead boosting the body's immune response to fight cancer more effectively.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 50 tokens",
    "image": {
      "src": "icons/beaker.svg",
      "thumbnail": "icons/beaker.svg",
      "alt": "vaccine",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Dual Vents Erupt, Lighting Sky with Lava Glow",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Tue, 19 Aug 2025 02:10:04 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "phys.org"
    ],
    "snippets": [
      "Lava shoots high into the sky. Molten rock erupts from two vents simultaneously. The nighttime sky glows red and orange, reflecting the lava oozing across a summit crater."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/hawaiis-kilauea-volcan-2.jpg",
    "titles": [
      "Hawaii's Kilauea volcano is on the verge of erupting again"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.96,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.48,
    "summary": "Molten rock is erupting from two vents simultaneously, shooting lava high into the sky. The nighttime sky is glowing red and orange due to the lava oozing across a summit crater. The volcanic activity is intense and visually striking.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 39 tokens",
    "image": {
      "src": "icons/beaker.svg",
      "thumbnail": "icons/beaker.svg",
      "alt": "science",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "1950s-60s US Colleges Embrace Coeducation, Marking Social Shift",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Tue, 19 Aug 2025 01:53:25 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "phys.org"
    ],
    "snippets": [
      "In response to shifting gender norms and post-war social movements, many U.S. colleges and universities began admitting women in the 1950s and '60s. The coeducational movement, which started in the early 19th century, sparked innovations in education, labor, and civil rights in the United States."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/students-college.jpg",
    "titles": [
      "Q&A: How coed campus transitions in the 1950's and '60s influenced gender research publications"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.955,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.479,
    "summary": "In the 1950s and '60s, influenced by changing gender norms and post-war social movements, numerous U.S. colleges and universities started admitting women, marking a significant shift towards coeducation. This movement, rooted in the early 19th century, led to notable advancements in education, labor, and civil rights across the United States.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 52 tokens",
    "image": {
      "src": "icons/usa.svg",
      "thumbnail": "icons/usa.svg",
      "alt": "us flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Exascale Supercomputers Enhance Earthquake Simulation Accuracy",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Tue, 19 Aug 2025 01:53:19 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "phys.org"
    ],
    "snippets": [
      "Simulations still can't predict exactly when an earthquake will happen, but with the incredible processing power of modern exascale supercomputers, they can now predict how they will happen and how much damage they will likely cause."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/exascale-simulations-u.jpg",
    "titles": [
      "Exascale simulations underpin quake-resistant infrastructure designs"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.955,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.479,
    "summary": "Using the advanced processing capabilities of exascale supercomputers, scientists have improved earthquake simulations. While these simulations cannot determine the precise timing of an earthquake, they can now more accurately predict the manner in which earthquakes will occur and estimate the potential damage they may cause.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 45 tokens",
    "image": {
      "src": "icons/beaker.svg",
      "thumbnail": "icons/beaker.svg",
      "alt": "science",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Study: High Sensitivity Linked to Greater Therapy Benefit, Risk of Depression",
    "domain": "science",
    "source_domain": "www.sciencedaily.com",
    "location": "global",
    "published": "Tue, 19 Aug 2025 00:17:07 EDT",
    "source": "ScienceDaily",
    "sources": [
      "ScienceDaily"
    ],
    "domains": [
      "www.sciencedaily.com"
    ],
    "snippets": [
      "Researchers analyzing 33 studies found strong evidence that highly sensitive people are more prone to depression and anxiety but also more likely to benefit from therapy. Since about 31% of the population is highly sensitive, experts argue that clinicians should consider sensitivity levels when diag"
    ],
    "image_url": "",
    "titles": [
      "This overlooked trait could explain anxiety and depression in millions"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.923,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.473,
    "summary": "Researchers reviewing 33 studies discovered that highly sensitive individuals, making up approximately 31% of the population, are more susceptible to depression and anxiety. However, they also respond better to therapy. This finding suggests that clinicians should take into account a person's sensitivity level during diagnosis and treatment planning to effectively address mental health issues.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 55 tokens",
    "image": {
      "src": "icons/beaker.svg",
      "thumbnail": "icons/beaker.svg",
      "alt": "science",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Garden Plant Selection Focused on Aesthetics and Bloom Timing",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Tue, 19 Aug 2025 00:10:01 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "phys.org"
    ],
    "snippets": [
      "People often prioritize aesthetics when choosing plants for their gardens. They may pick flowers based on colors that create visually appealing combinations and varieties that have bigger and brighter displays or more fragrant and pleasant-smelling flowers. Some may also choose species that bloom at"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/pollinator.jpg",
    "titles": [
      "Cultivating for color: The hidden trade-offs between garden aesthetics and pollinator preferences"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.921,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.472,
    "summary": "People commonly select garden plants based on visual appeal, favoring those with vibrant colors, larger blooms, and pleasant fragrances. Choices are also influenced by bloom timing to ensure a continuous display. This approach focuses on enhancing the garden's aesthetic value through careful plant selection.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 45 tokens",
    "image": {
      "src": "icons/beaker.svg",
      "thumbnail": "icons/beaker.svg",
      "alt": "science",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Allianz Life data breach affects 1.1 million customers",
    "domain": "technology",
    "source_domain": "techcrunch.com",
    "location": "global",
    "published": "Mon, 18 Aug 2025 22:26:54 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com"
    ],
    "snippets": [
      "Data breach notification site Have I Been Pwned notified 1.1 million customers of a July data breach, a number not previously reported."
    ],
    "image_url": "",
    "titles": [
      "Allianz Life data breach affects 1.1 million customers"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.818,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.452,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 9 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Nvidia gives fake Harrison Ford better hair using spheres",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-08-18T15:30:00-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "www.theverge.com"
    ],
    "snippets": [
      "Indiana Jones and the Great Circle will be the first game to get Nvidia’s new RTX Hair features next month. Instead of using triangles to model hair, Nvidia will use spheres to improve Harrison Ford’s virtual hair in the Indiana Jones game. RTX Hair is designed to improve lighting and shadows, all w"
    ],
    "image_url": "",
    "titles": [
      "Nvidia gives fake Harrison Ford better hair using spheres"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.769,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.449,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 9 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "T-Mobile claimed selling location data without consent is legal—judges disagree",
    "domain": "technology",
    "source_domain": "arstechnica.com",
    "location": "global",
    "published": "Mon, 18 Aug 2025 19:07:52 +0000",
    "source": "Ars Technica",
    "sources": [
      "Ars Technica"
    ],
    "domains": [
      "arstechnica.com"
    ],
    "snippets": [
      "T-Mobile can't overturn $92 million fine; AT&#038;T and Verizon verdicts still to come."
    ],
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2024/10/t-mobile-its-alive-1152x648-1729188629.jpg",
    "titles": [
      "T-Mobile claimed selling location data without consent is legal—judges disagree"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.763,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.448,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 12 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "The best Garmin watches for training and everyday life",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-08-18T15:00:00-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "www.theverge.com"
    ],
    "snippets": [
      "Few brands are as synonymous with outdoor sports as Garmin. You’ll find these fitness trackers and smartwatches on dozens of wrists at any 5K, marathon, or Ironman. You’ll also find Garmin devotees among divers, thru-hikers, golfers, kiteboarders — you name it. But these devices aren’t just for athl"
    ],
    "image_url": "",
    "titles": [
      "The best Garmin watches for training and everyday life"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.761,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.447,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 9 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Elon Musk’s “thermonuclear” Media Matters lawsuit may be fizzling out",
    "domain": "technology",
    "source_domain": "arstechnica.com",
    "location": "global",
    "published": "Mon, 18 Aug 2025 18:42:08 +0000",
    "source": "Ars Technica",
    "sources": [
      "Ars Technica"
    ],
    "domains": [
      "arstechnica.com"
    ],
    "snippets": [
      "Judge blocks FTC's Media Matters probe as a likely First Amendment violation."
    ],
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/08/GettyImages-2202762628-1024x648.jpg",
    "titles": [
      "Elon Musk’s “thermonuclear” Media Matters lawsuit may be fizzling out"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.756,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.446,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 11 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "X’s declining Android app installs are hurting subscription revenue",
    "domain": "technology",
    "source_domain": "techcrunch.com",
    "location": "global",
    "published": "Mon, 18 Aug 2025 20:49:36 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com"
    ],
    "snippets": [
      "X is struggling on Android with installs down by 49% year-over-year as of June 2025."
    ],
    "image_url": "",
    "titles": [
      "X’s declining Android app installs are hurting subscription revenue"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.79,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.446,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 10 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Roblox is locking down sexual content and access to ‘adult’ locations after lawsuits",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-08-18T13:56:59-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "www.theverge.com"
    ],
    "snippets": [
      "Roblox is updating its policies prohibiting romantic or sexual content to also forbid “content, settings, or behavior that implies sexual activity,” according to a Friday post from chief safety officer Matt Kaufman (emphasis Kaufman’s). The changes follow recent lawsuits against the company, includi"
    ],
    "image_url": "",
    "titles": [
      "Roblox is locking down sexual content and access to ‘adult’ locations after lawsuits"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.745,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.444,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 13 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Texas attorney general accuses Meta, Character.AI of misleading kids with mental health claims",
    "domain": "technology",
    "source_domain": "techcrunch.com",
    "location": "global",
    "published": "Mon, 18 Aug 2025 17:59:29 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com"
    ],
    "snippets": [
      "Texas attorney general Ken Paxton is investigating Meta and CharacterAI over claims they deceptively market chatbots as mental health tools, raising concerns about child safety, data privacy, and targeted advertising."
    ],
    "image_url": "",
    "titles": [
      "Texas attorney general accuses Meta, Character.AI of misleading kids with mental health claims"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.745,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.444,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 14 tokens",
    "image": {
      "src": "icons/robot.svg",
      "thumbnail": "icons/robot.svg",
      "alt": "ai",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  }
]