[
  {
    "title": "Trump Revises Stance on Ukraine, Backs Territory Reclaim with NATO Support",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Tue, 23 Sep 2025 16:57:42 -0400",
    "source": "NPR",
    "sources": [
      "BBC",
      "The Guardian",
      "Financial Times",
      "Axios",
      "Al Jazeera",
      "NPR",
      "Deutsche Welle",
      "New York Times"
    ],
    "domains": [
      "www.npr.org",
      "news.google.com",
      "www.aljazeera.com",
      "www.theguardian.com",
      "www.ft.com",
      "www.dw.com",
      "www.bbc.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "Last month, President Trump said Ukraine needed to be open to giving up some of its territory in peace talks with Russia. But those talks haven't happened. Now, he says Ukraine could win it all back.",
      "The US president says Ukraine can win back land with support from Nato and Europe, marking a major shift in his position.",
      "Trump previously said both Kyiv and Moscow would have to cede land to end Europe&#039;s deadliest war since World War II.",
      "US President Donald Trump said that with \"time, patience, and the financial support of Europe and, in particular, NATO,\" Ukraine could regain its territory from Russia, who he said had been fighting \"aimlessly.\"",
      "<a href=\"https://news.google.com/rss/articles/CBMiekFVX3lxTE9ISERQbzZDaV96TXlsaXZ6NG1keUdBMnU2OTY2Rmw0SHVpdWxBZUoySUszSF9XWmFmSEdTYXdLMVRDM3p1RENCSjJyX1RQdkxQNjV3OTNnTW5EZEFSdUZxQU5UU0c1bERMSTJBd3REQlJxLW9mWWswbm1n?oc=5\" target=\"_blank\">In extraordinary shift, Trump says Ukraine can win war with Rus",
      "US president signals change of stance and suggests Kyiv, with support from Europe and Nato, can restore its old borders",
      "<p>US president claims Russia is in ‘big economic trouble’ as he calls for Nato countries to stop imports of Russian oil</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/live/2025/sep/23/donald-trump-unga-autism-tylenol-us-politics-live-news-updates\">US politics live – latest updates</a></",
      "President Trump’s pivot could give him room to distance himself from a conflict that he once promised to solve in days or weeks."
    ],
    "image_url": "",
    "titles": [
      "Trump, in major shift, suggests Ukraine can win back territory long held by Russia",
      "Kyiv can win all of Ukraine back from Russia, Trump says",
      "In major shift, Trump says Ukraine can win back all territory from Russia",
      "Trump says Ukraine can regain territory lost to Russia since 2022",
      "In extraordinary shift, Trump says Ukraine can win war with Russia - Axios",
      "Trump says Ukraine can win back all of its territory seized by Russia",
      "Trump says he believes Ukraine can regain all land lost to Russia since 2022 invasion",
      "In a Sudden Shift, Trump Says Ukraine Can Win the War With Russia"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.858,
      "consensus": 1.0,
      "constructiveness": 0.2,
      "proximity": 0.75
    },
    "score": 0.867,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "President Trump has shifted his stance on the conflict between Ukraine and Russia, now stating that Ukraine can reclaim its territory with support from NATO and Europe. This marks a significant change from his previous position, where he suggested both Kyiv and Moscow might need to cede land to end the conflict. Trump's updated view aligns with increased assistance for Ukraine and suggests a strategic distance from the conflict, which he once claimed he could resolve quickly. Ukrainian President Zelenskyy has expressed gratitude towards Trump for his efforts to end the war.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: effort, support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Man Convicted for Attempted Assassination of Trump, Faces Life Sentence",
    "domain": "sports",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Tue, 23 Sep 2025 14:43:17 -0400",
    "source": "NPR",
    "sources": [
      "The Guardian",
      "ABC News",
      "Axios",
      "NPR",
      "Al Jazeera"
    ],
    "domains": [
      "www.npr.org",
      "www.aljazeera.com",
      "www.theguardian.com",
      "news.google.com",
      "abcnews.go.com"
    ],
    "snippets": [
      "Jurors convicted Routh on five charges, including last year's attempted assassination of Trump as he golfed at his South Florida course. Routh represented himself in court and faces life in prison.",
      "A US jury finds that Routh intended to kill then-presidential candidate Donald Trump last September.",
      "<a href=\"https://news.google.com/rss/articles/CBMihAFBVV95cUxQdEpTbnphd2daQU16UVd1Qzg3dWpNakFRS3dldEg3LVJWbFdITUd2dVNBT3FtM1oxbGEzM25tRlI5OWtyUG1HaFgwTzB2NVZHVFVXLWNHbl9ieGhJbXNWVG9ybTU5ZXVQd1BoUVBjbVJpZVZNM1BTQXJLRlNCekpfc0lxSkc?oc=5\" target=\"_blank\">Ryan Routh found guilty in Trump assassination a",
      "Ryan Routh, the man accused of trying to assassinate President Donald Trump on his West Palm Beach golf course last year, has been found guilty on all five counts.",
      "<p>Routh represented himself in trial over botched attempt on Trump’s life at West Palm Beach golf course </p><p>The man accused of trying to assassinate <a href=\"https://www.theguardian.com/us-news/donaldtrump\">Donald Trump</a> on his West Palm Beach golf course two months before Trump clinched his"
    ],
    "image_url": "",
    "titles": [
      "Jury convicts Ryan Routh on all charges in attempted assassination of Donald Trump",
      "Ryan Routh found guilty of attempting to assassinate Trump in Florida",
      "Ryan Routh found guilty in Trump assassination attempt - Axios",
      "WATCH:  Ryan Routh guilty on all counts in Trump golf course assassination attempt",
      "Ryan Routh found guilty of 2024 attempted assassination of Trump in Florida"
    ],
    "score_components": {
      "magnitude": 0.964,
      "recency": 0.819,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.825,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Ryan Routh was convicted on five charges, including the attempted assassination of Donald Trump at a South Florida golf course last year. Representing himself in court, Routh now faces a life sentence. The jury concluded Routh intended to kill Trump during the incident. After the verdict, Routh attempted to stab himself in the neck with a pen.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "OpenAI and Oracle Launch $500B Stargate AI Project in Texas",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Wed, 24 Sep 2025 00:27:36 GMT",
    "source": "Axios",
    "sources": [
      "Financial Times",
      "Axios",
      "TechCrunch",
      "CNBC"
    ],
    "domains": [
      "www.ft.com",
      "news.google.com",
      "techcrunch.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMiekFVX3lxTE10cjBrMDkxZWZWbU1jekZrN3RrVklkTldxWGJSMG44eEdOcmVicXhSTTgzNU4wNmIxdS1zSVNiN1JsbTRiSjFsNjktX19GMFdkdk1XQmdwWFprQ3kybUZzOGZhN3h0VGw3UmNJU3pfUi13ZTlfeEctbEZB?oc=5\" target=\"_blank\">OpenAI announces five new sites for Stargate data center projec",
      "OpenAI and Oracle are betting big on America's AI future, bringing online the flagship site of the $500 billion Stargate program in Abilene, Texas.",
      "The agreements will take the cost of the high-profile data centre initiative to $400bn",
      "OpenAI is continuing to build out massive AI data centers to train and serve increasingly powerful AI models."
    ],
    "image_url": "",
    "titles": [
      "OpenAI announces five new sites for Stargate data center project - Axios",
      "OpenAI's first data center in $500B Stargate project is open in Texas, with sites coming in New Mexico and Ohio",
      "OpenAI expands Stargate AI project with five US sites",
      "OpenAI is building five new Stargate data centers with Oracle and SoftBank"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.904,
      "consensus": 0.908,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.797,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "OpenAI, in partnership with Oracle, has launched the flagship site of the $500 billion Stargate project in Abilene, Texas, marking a significant investment in the future of American AI. This initiative, which aims to expand AI data centers for training and deploying advanced AI models, will see its costs rise to $400 billion as it progresses.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: initiative, progress",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Italian Cinema Icon Claudia Cardinale Dies at 87",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 24 Sep 2025 02:16:26 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC",
      "Fortune",
      "Deutsche Welle"
    ],
    "domains": [
      "fortune.com",
      "www.dw.com",
      "www.bbc.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "The actress, who starred in Fellini's 8 1/2, is synonymous with the golden age of Italian cinema.",
      "Best known for her role in Federico Fellini's \"8½,\" Cardinale has passed away after starring in over 100 productions.",
      "<p>The husky-voiced, chain-smoking actor had a reputation as a fiercely independent, free-spirited woman</p><p>Claudia Cardinale, a glamorous symbol of post-war Italian cinema who enjoyed a long and varied acting career on film and in the theatre, has died at age 87, according to AFP and other Frenc",
      "“It’s marvelous to live so many lives,\" Cardinale said. \"I’ve been living more than 150 lives, totally different women.”"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/4639/live/d8a17ff0-98e9-11f0-8370-cbf41ac97b25.jpg",
    "titles": [
      "Italian actress and star of The Leopard Claudia Cardinale dies aged 87",
      "Italian movie star Claudia Cardinale dies at age of 87",
      "Claudia Cardinale, glamorous star of The Leopard and Once Upon a Time in the West, dies aged 87",
      "Claudia Cardinale, legend of Italian cinema, dies at 87"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.939,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.777,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Claudia Cardinale, celebrated for her role in Federico Fellini's \"8½\" and a symbol of the golden age of Italian cinema, has died at 87. With a career spanning over 100 productions, Cardinale was known for her husky voice, independent spirit, and significant impact on post-war cinema.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Yankees Secure Postseason Berth with 3-2 Win Over White Sox",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Wed, 24 Sep 2025 02:14:59 +0000",
    "source": "CBS Sports",
    "sources": [
      "Yahoo Sports",
      "CBS Sports",
      "Sportsnet"
    ],
    "domains": [
      "www.nbcsports.com",
      "sports.yahoo.com",
      "www.sportsnet.ca",
      "www.cbssports.com"
    ],
    "snippets": [
      "This marks the Yankees' eighth postseason appearance in the last nine seasons",
      "Jose Caballero hit a walk-off single as the New York Yankees clinched a Major League Baseball post-season berth on Tuesday with a 3-2 come-from-behind victory over the Chicago White Sox.He then had a balk before Jose Ramirez scored on a groundout to put Cleveland up 3-2.",
      "With the win, the Yankees reached the postseason for the 60th time in team history.",
      "<p>Watch as New York Yankees infielder Jose Caballero hits a walk-off single against the Chicago white Sox to clinch a post-season berth for his team.</p>",
      "<p>José Caballero&#8217;s RBI single with two out in the ninth inning scored Aaron Judge and the New York Yankees rallied to beat the Chicago White Sox 3-2 Tuesday night, securing their eighth playoff appearance in nine seasons.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/24/34bde306-1a5e-480a-8f62-4758e3a9ed94/caballero-imagn.png",
    "titles": [
      "Yankees clinch MLB playoff berth: Bombers, led by MVP favorite Aaron Judge, still eyeing AL East title",
      "Yankees clinch MLB playoff berth with walk-off win over White Sox",
      "Yankees rally past White Sox 3-2, clinch playoff berth and close within 1 game of Toronto in AL East",
      "Yankees’ Caballero hits single to walk off White Sox and clinch playoff berth",
      "Yankees clinch playoff berth, move within one of AL East-leading Blue Jays"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.958,
      "consensus": 0.809,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.733,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Jose Caballero's walk-off single scored Aaron Judge, leading the New York Yankees to a 3-2 victory over the Chicago White Sox, securing their postseason berth for the eighth time in nine seasons. This win marks the Yankees' 60th postseason appearance in team history.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Cancels Meeting on Gov Shutdown, Blames Democrats",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Tue, 23 Sep 2025 12:30:23 -0400",
    "source": "NPR",
    "sources": [
      "Axios",
      "NPR",
      "CNBC"
    ],
    "domains": [
      "news.google.com",
      "www.npr.org",
      "www.cnbc.com"
    ],
    "snippets": [
      "President Trump called off a planned Thursday meeting with top Hill Democrats to discuss a possible deal to avoid a shutdown. He called Democrats' demands \"unserious.\" Democrats say he chickened out.",
      "<a href=\"https://news.google.com/rss/articles/CBMikgFBVV95cUxOWDlTYlFqNlNRRTZVT294VTFRVGhrYlpoV3l5TDdnT0x3N1laNU5nTWFJUXlUOTFnRUpldHVFQ3NHNE1pYms4NXdjeWlWdFU3X3JySjBId3NXVVFFNzU0NTJRbkhBbjRfYnNTWHdoMEdvM2Y4eDlITlI3UEFKLUpCQ2I2OG5DSDJVR0VHblppMkREZw?oc=5\" target=\"_blank\">Trump cancels meeting with to",
      "New York Democrats Sen. Chuck Schumer and Rep. Hakeem Jeffries say Trump will take the blame for a federal government shutdown if a deal can't be reached."
    ],
    "image_url": "",
    "titles": [
      "Trump cancels meeting with Democrats as prospects for shutdown increase",
      "Trump cancels meeting with top Democrats as shutdown looms - Axios",
      "Trump cancels meeting with top Democrats as government shutdown looms"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.782,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.732,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Former President Donald Trump canceled a meeting aimed at preventing a federal government shutdown, blaming Congressional Democrats for the impasse. He accused them of losing their way in a post on Truth Social. New York Democrats Senator Chuck Schumer and Representative Hakeem Jeffries countered by stating Trump would be blamed for the shutdown, criticizing him for avoiding negotiations. The potential shutdown threatens federal workers' pay, air travel, and food stamp distribution.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Oklahoma State Fires Coach Mike Gundy After 21 Years Amid Poor Season Start",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 23 Sep 2025 14:56:39 EST",
    "source": "ESPN",
    "sources": [
      "Sports Illustrated",
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "news.google.com",
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "Gundy's long tenure in Stillwater is over. Who replaces the Pokes legend and who are the key players on the roster?",
      "<a href=\"https://news.google.com/rss/articles/CBMilwFBVV95cUxOVkdPVFdlWlNDemkwOHBCNUJndGVfekM5dWo4Wm8zUTFqazJCSGVUWV9yN1c1bjZQTUx3UUh1bWU1TTNCa2VrcDc5OEpHSGxONVhpalB1ekZWdjVPYVU2cUdtZnRweTJlTHZsT0w0ajhiV1lmeWRhOUV6b0F0emxpNzhYSFhybm9RT3BZZng5ZlJzaGRCdHl3?oc=5\" target=\"_blank\">Mike Gundy Exited Oklah",
      "<a href=\"https://news.google.com/rss/articles/CBMidkFVX3lxTE1PaUxHa1lHbklxNjM0c1hPUGJqTDhxMkhKaXdOaTl5YVlVaGVoWTBTNW9mRWE4ZGQ4eUF3THF4RGZOVUJia29FMnlMdWVpcF93Sl9PVmNvSHZ0TVk5WnRDd2tCZFBnaGdZaU9pbWR5aGZkRnA3NVE?oc=5\" target=\"_blank\">Oklahoma State Fires Mike Gundy, Program's Winningest Coach</a>&nbsp",
      "<a href=\"https://news.google.com/rss/articles/CBMimgFBVV95cUxOY2ZGS19VN2xZbGNTTGNiUXExUEhyNVZnbldkTjhEQUpOU0RkN01PUTYtLVZQR2ZjS0RILVZqdW43YXNBaFhrMENjTURNWUxmR1Q5RHE1YThoMnVMNExRcE5PR2JCaXZOQ05rUF90M001aFZBVWRuWTFRX3NLeGFxUjVYV0V0N2Q0bHlIUFZhQ1ZHMDZWRTJiLUln?oc=5\" target=\"_blank\">Mike Gundy Fired: T",
      "<p>Mike Gundy, one of college football’s most colourful coaches over the last two decades, has been fired at Oklahoma State, according to multiple media reports.</p>"
    ],
    "image_url": "",
    "titles": [
      "Mike Gundy is out at Oklahoma State: Top candidates, transfers, recruits to watch",
      "Mike Gundy Exited Oklahoma State Exactly How You’d Expect - Sports Illustrated",
      "Oklahoma State Fires Mike Gundy, Program's Winningest Coach - Sports Illustrated",
      "Mike Gundy Fired: Ten Candidates for Oklahoma State Football Coaching Search - Sports Illustrated",
      "Oklahoma State fires football coach Mike Gundy after 20-plus years"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.823,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.726,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Oklahoma State has dismissed head coach Mike Gundy after a disappointing start to the 2024 season, ending his 21-year tenure with the team. The Cowboys have struggled, losing 11 of their last 12 games. The search for Gundy's replacement is underway, with the future direction of the program and its key players now a primary focus.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Claims Resolution of Conflicts, Critiques Global Bodies at U.N.",
    "domain": "sports",
    "source_domain": "www.washingtonpost.com",
    "location": "global",
    "published": "Tue, 23 Sep 2025 17:34:40 +0000",
    "source": "Washington Post",
    "sources": [
      "Washington Post",
      "NHL",
      "New York Times"
    ],
    "domains": [
      "www.washingtonpost.com",
      "news.google.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "In Trump’s speech before the U.N. General Assembly, he said he had ended a growing list of conflicts. In some of them, his role remains contested.",
      "President Trump’swith a rebuke of global institutions,",
      "<a href=\"https://news.google.com/rss/articles/CBMigwFBVV95cUxOTkZoY3V4dHJtV002c2tFQWhWbXloOW03eWRNVGdQbWxUOXNNSG1OdDRsY2pCbHhPeE1nRUZmVzFtNnQ1OUZfbjJsMmtrcThpRmlMeUdzSjU3UzZWR0ctU2RtZGlHWm1EY1drUi1TN3hnckJUSEtDOFFZelhFb1NkR0RLcw?oc=5\" target=\"_blank\">PHI@MTL: What you need to know</a>&nbsp;&nbsp;<fo"
    ],
    "image_url": "",
    "titles": [
      "Trump says he has ‘solved’ 7 conflicts. Here’s what to know about them.",
      "Here’s what to know.",
      "PHI@MTL: What you need to know - NHL.com"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.799,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.711,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "During his speech at the U.N. General Assembly, President Trump claimed to have ended a list of conflicts, though his involvement in some remains disputed. He also criticized global institutions. The specifics of the conflicts or the nature of the criticism were not detailed in the provided content.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Shane Pinto Scores OT Winner, Senators Beat Maple Leafs 3-2 in Pre-Season",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Wed, 24 Sep 2025 02:35:33 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "Sportsnet"
    ],
    "domains": [
      "globalnews.ca",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Shane Pinto scored a power-play goal with two minutes left in the third period to tie the game, then scored 16 seconds into overtime to win it as the visiting Ottawa Senators rallied to edge the Toronto Maple Leafs 3-2 in NHL pre-season action at Scotiabank Arena on Tuesday.",
      "<p>Shane Pinto scored a power-play goal with two minutes left in the third period to tie the game, then scored 16 seconds into overtime to win it as the visiting Ottawa Senators rallied to edge the Toronto Maple Leafs 3-2 in NHL pre-season action at Scotiabank Arena on Tuesday.</p>",
      "<p>Shane Pinto scored the game-tying goal with just over two minutes remaining in the third period and buried the overtime winner to lead the Ottawa Senators to a 3-2 victory over the Toronto Maple Leafs.</p>"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/878631a059e0ae0c38f905ce1f57922110daa5d761e81892393ca6a42de92dec.jpg?quality=65&strip=all",
    "titles": [
      "Pinto paces Senators to 3-2 win over Leafs in OT",
      "Pinto paces Senators to overtime win over Maple Leafs",
      "NHL Pre-Season Highlights: Senators 3, Maple Leafs 2 (OT)"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.965,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.705,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Shane Pinto led the Ottawa Senators to a 3-2 victory over the Toronto Maple Leafs by scoring a power-play goal to tie the game with two minutes left in the third period and then netting the winning goal 16 seconds into overtime. The match took place at Scotiabank Arena during an NHL pre-season game on Tuesday.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "YouTube to Allow Banned Misinformation Channels to Seek Reinstatement",
    "domain": "technology",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Tue, 23 Sep 2025 20:54:25 GMT",
    "source": "CNBC",
    "sources": [
      "The Verge",
      "Ars Technica",
      "CNBC"
    ],
    "domains": [
      "arstechnica.com",
      "www.theverge.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "YouTube on Tuesday said it will allow previously banned accounts to apply for reinstatement, rolling back a policy that had treated violations as permanent.",
      "Google has announced it will reverse a major content moderation decision: YouTube will offer channels that were banned for spreading covid and election misinformation in 2020 a pathway back onto the platform. In a letter sent to the House Judiciary Committee, Alphabet's lawyers claimed that the Bide",
      "Alphabet blames the Biden administration for its moderation decisions."
    ],
    "image_url": "",
    "titles": [
      "YouTube to allow creators banned for Covid-19, election misinformation to apply for reinstatement",
      "YouTube will let creators who spread covid misinformation back on the site",
      "YouTube will restore channels banned for COVID and election misinformation"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.839,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.705,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "YouTube, owned by Alphabet, announced it will enable channels banned for spreading COVID-19 and election misinformation in 2020 to apply for reinstatement. This marks a reversal of its prior policy treating such violations as permanent. The decision was disclosed in a letter to the House Judiciary Committee, where Alphabet suggested the Biden administration influenced its moderation policies.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Jonathan Toews Returns to NHL, Jets Fall 3-2 to Oilers in Preseason Game",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Wed, 24 Sep 2025 02:44:22 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "Sportsnet"
    ],
    "domains": [
      "globalnews.ca",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Colin Miller and Colby Barlow scored the goals while Jonathan Toews played 18:36, winning just over half of his faceoffs.",
      "<p>Even though his Winnipeg Jets side lost 3-1 in pre-season action, Jonathan Toews got his first taste of NHL action in two-and-a-half years.</p>",
      "<p>Ty Emberson, Isaac Howard and Quinn Hutson each scored and Matt Tomkins made 13 saves as the Edmonton Oilers narrowly beat the Winnipeg Jets, winning 3-2.</p>"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/TOEWS.jpg?quality=65&strip=all",
    "titles": [
      "Jonathan Toews makes preseason debut as Winnipeg Jets fall to Oilers 3-2",
      "Jonathan Toews has quiet Jets pre-season debut",
      "NHL Pre-Season Highlights: Oilers 3, Jets 2"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.968,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.699,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Jonathan Toews returned to NHL action after a two-and-a-half-year hiatus, playing 18:36 and winning just over half of his faceoffs in a preseason game where his team, the Winnipeg Jets, lost 3-2 to the Edmonton Oilers. Despite goals from Colin Miller and Colby Barlow for the Jets, the Oilers secured the win with goals from Ty Emberson, Isaac Howard, and Quinn Hutson, alongside 13 saves from Matt Tomkins.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Criticizes EU Immigration Policy, Global Institutions at UN Assembly",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Tue, 23 Sep 2025 16:34:31 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "New York Times",
      "ABC News"
    ],
    "domains": [
      "news.google.com",
      "abcnews.go.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMieEFVX3lxTFB1cFA1NVE4VGczTUtWeFlsa3ZMYzR6bmtWLWpjQWlHTWUwcUMxUTE0bFpNdmZUc1czSGludmxSQWthOVJqUkNXY0FwMFNRbkFsTXEzR3djN25RR3FweEQyV1p3TVFXMHRsb0NUX1gyc1dlekRsQnVTVA?oc=5\" target=\"_blank\">Trump's middle finger to the UN: \"Your countries are going to hel",
      "President Donald Trump criticized the European Union's immigration policies while speaking at the United Nations General Assembly on Tuesday.",
      "In a meandering address, President Trump rebuked global institutions and complained about immigration, environmentalists, windmills and more."
    ],
    "image_url": "",
    "titles": [
      "Trump's middle finger to the UN: \"Your countries are going to hell\" - Axios",
      "WATCH:  Trump tells European Union nations: 'Your countries are going to hell'",
      "‘Your Countries Are Going to Hell’: Trump Airs His Grievances at the U.N."
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.767,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.697,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "During his speech at the United Nations General Assembly, President Donald Trump criticized the European Union's immigration policies and expressed disdain for global institutions, environmentalists, and windmills. His address was wide-ranging and included various complaints.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "NASA's Artemis II to Orbit Moon in 2026, Eyes Lunar Landing in 2027",
    "domain": "science",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 23 Sep 2025 15:29:27 GMT",
    "source": "BBC",
    "sources": [
      "Phys.org",
      "BBC",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.bbc.com",
      "phys.org"
    ],
    "snippets": [
      "The mission around the Moon will pave the way for a lunar landing as soon as 2027.",
      "The crew of Artemis II will not land on the moon but will lay the groundwork for the first crewed missions to Mars.",
      "NASA on Tuesday said it was on track to send astronauts to orbit the moon in early 2026, as the United States races China to return to the lunar surface."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/0e57/live/d786ec00-9898-11f0-9b4d-3db5bd560027.png",
    "titles": [
      "Nasa to send first crewed mission around Moon in 50 years",
      "NASA plans to send manned Moon mission by February 2026",
      "NASA says on track to send astronauts around the Moon in 2026"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.75,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.697,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "NASA announced plans for the Artemis II mission to orbit the Moon in early 2026, setting the stage for a lunar landing in 2027 and future crewed missions to Mars. This mission aims to establish groundwork for further space exploration as the US competes with China in returning to the lunar surface.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Skubal's Struggles Lead Tigers to 7th Straight Loss, Guardians Tie for First",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 23 Sep 2025 23:47:33 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "Ace Tarik Skubal fell apart on the mound in Cleveland on Tuesday night and Detroit fell to its seventh straight loss, allowing the Guardians to catch the Tigers in the standings and secure the tiebreaker.",
      "<p>José Ramírez drove in a run with a swinging bunt when Cleveland rallied in a strange sixth inning against Detroit ace Tarik Skubal, and the Guardians beat the Tigers 5-2 on Tuesday night to move into a tie for first place in the AL Central.</p>"
    ],
    "image_url": "",
    "titles": [
      "Skubal, Tigers collapse; caught by Guardians",
      "Guardians down Skubal, Tigers to pull even atop AL Central"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.989,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.685,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "On Tuesday night, Detroit Tigers' ace Tarik Skubal struggled on the mound, leading to a 5-2 loss against the Cleveland Guardians. This defeat marked the Tigers' seventh consecutive loss. During a pivotal sixth inning, José Ramírez's swinging bunt drove in a run, contributing to the Guardians' rally. The victory allowed the Guardians to tie with the Tigers for first place in the AL Central and secure the tiebreaker.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Phoenix Wins Overtime Thriller Against Minnesota in WNBA Semifinals",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 23 Sep 2025 23:38:00 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "The 2025 WNBA semifinals are underway, and Phoenix beat Minnesota in OT in an instant classic Tuesday.",
      "The Lynx will try to take a commanding 2-0 series lead on Tuesday night"
    ],
    "image_url": "",
    "titles": [
      "WNBA playoff schedule: Fever, Lynx take 1-0 leads in semifinals",
      "Lynx vs. Mercury schedule: Game times, where to watch and what to know about WNBA playoff semifinals"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.986,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.684,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In the 2025 WNBA semifinals, Phoenix defeated Minnesota in an overtime match that was hailed as an instant classic. Despite this loss, Minnesota aims to secure a 2-0 series lead in their next game on Tuesday night.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Ex-Philippine President Duterte Arrested on ICC Warrant, Detained in Netherlands",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Tue, 23 Sep 2025 05:37:30 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "Washington Post",
      "The Guardian"
    ],
    "domains": [
      "www.washingtonpost.com",
      "news.google.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMikgFBVV95cUxNWUNTc2RXTkRmTEYxd0J3R3dLM28xbXhNWHJ2M2NZUHZRX0UxQm45eW1qNUxPek1JSU1fa3RWdlBSbktCbW5FNWZ6RXVZMy1JbzVXSGhIbllhcmJaQTZpQUJycmxBVU9QZWVxU29fMG8zMmRiSWtEVFhCRi1OeURIc0IxT2tmTVp3dFRRUEFCaTBMUQ?oc=5\" target=\"_blank\">ICC charges ex-Philippine Pre",
      "<p>Three charges against Duterte stem from his years-long campaign against drug users and dealers that rights groups say killed thousands</p><p>International criminal court prosecutors have charged the former president of the Philippines Rodrigo Duterte with three counts of crimes against humanity o",
      "International Criminal Court prosecutors allege that Rodrigo Duterte carried out crimes against humanity while in office, in pursuit of a brutal war on drugs."
    ],
    "image_url": "",
    "titles": [
      "ICC charges ex-Philippine President Duterte with crimes against humanity - Axios",
      "Rodrigo Duterte, former Philippines president, charged with crimes against humanity at ICC",
      "Duterte, former Philippine president, charged with murder at ICC"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.61,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.666,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Former Philippine President Rodrigo Duterte was arrested in March by local authorities on an International Criminal Court (ICC) warrant and is currently detained in the Netherlands. The ICC has charged Duterte with three counts of crimes against humanity related to his aggressive anti-drug campaign, which rights groups claim resulted in thousands of deaths.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Drone Strike at Haiti Party Kills 8 Children, Mistargets Gang Leader",
    "domain": "general",
    "source_domain": "www.nytimes.com",
    "location": "global",
    "published": "Wed, 24 Sep 2025 03:40:30 +0000",
    "source": "New York Times",
    "sources": [
      "New York Times",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "A drone meant to strike a gang leader hit a celebration where children had gathered. Haiti is using drones to repel gangs that control much of the capital.",
      "<p>Six others were injured after drone explosions in Cité Soleil, where an alleged gang leader was distributing gifts</p><p>At least eight children were killed and six others seriously injured in a drone attack on a birthday party in <a href=\"https://www.theguardian.com/world/haiti\">Haiti</a>’s capi"
    ],
    "image_url": "https://static01.nyt.com/images/2025/09/23/multimedia/23int-haiti-drones-qtkw/23int-haiti-drones-qtkw-mediumSquareAt3X.jpg",
    "titles": [
      "Drone Strike in Haiti Kills 8 Children at a Birthday Party",
      "Haiti: at least eight children among 13 killed in drone attack on birthday party"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.987,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.666,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "In Haiti, a drone attack intended to target a gang leader mistakenly struck a birthday party in Cité Soleil, resulting in the death of at least eight children and serious injuries to six others. The incident occurred as the country employs drones to combat gangs dominating the capital.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Colombia's Petro Seeks UN Probe into Trump Over Caribbean Strikes",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-09-24T03:37:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "The Guardian",
      "Deutsche Welle"
    ],
    "domains": [
      "www.dw.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Gustavo Petro has called for a criminal investigation against Donald Trump over deadly strikes on boats in the Caribbean. Earlier, the US president said all drug smugglers will be blown \"out of existence.\" DW has more.",
      "<p>At UN, Gustavo Petro says ‘poor young people’ died in US strikes on alleged drug trafficking boats off Caribbean coast</p><p><a href=\"https://www.theguardian.com/world/colombia\">Colombia</a>’s president Gustavo Petro addressed the UN general assembly Tuesday to call for a “criminal process” to be"
    ],
    "image_url": "",
    "titles": [
      "UNGA: Colombia's Petro wants Trump to face criminal process",
      "Colombia’s Petro urges ‘criminal process’ against Trump for Venezuelan strikes"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.985,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.666,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Colombian President Gustavo Petro called for a criminal investigation against Donald Trump at the UN, citing deadly strikes on boats in the Caribbean targeting alleged drug smugglers. Petro highlighted the death of \"poor young people\" in these strikes. The call for legal action follows Trump's declaration to eliminate drug trafficking threats.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "ABC Suspends Kimmel, Affiliates Drop Show Over Remarks on Kirk's Death",
    "domain": "business",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-09-24T03:19:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Business Insider",
      "Deutsche Welle"
    ],
    "domains": [
      "www.dw.com",
      "www.businessinsider.com"
    ],
    "snippets": [
      "Jimmy Kimmel was suspended by ABC network for six days following comments he made about Charlie Kirk's death. Two companies that own ABC affiliates have refused to air the return of his late night show.",
      "Before Donald Trump's comments, two of the nation's largest station owners said they would not air Kimmel's show on their local stations."
    ],
    "image_url": "",
    "titles": [
      "Trump taken aback over Jimmy Kimmel reinstatement by ABC",
      "Trump is railing against Jimmy Kimmel ahead of the comedian's return to late-night"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.979,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.651,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "ABC suspended Jimmy Kimmel for six days due to remarks about Charlie Kirk's death. Upon his return, two major ABC affiliate owners refused to broadcast his late-night show, a decision made before Donald Trump's comments on the matter.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Tether Negotiates $20B Stake Sale to Become Top Valued Crypto Firm",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Wed, 24 Sep 2025 03:07:31 GMT",
    "source": "CNBC",
    "sources": [
      "Financial Post",
      "CNBC"
    ],
    "domains": [
      "financialpost.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "The crypto company is looking to raise between $15 billion and $20 billion in exchange for a roughly 3% stake through a private placement, the report said.",
      "Tether Holdings SA, issuer of the world’s largest stablecoin, is in talks with investors to raise as much as $20 billion, a deal that could propel the crypto firm into the highest ranks of the world’s most valuable private companies."
    ],
    "image_url": "",
    "titles": [
      "Tether CEO confirms major capital raise at a reported $500 billion valuation",
      "Crypto Giant Tether Seeks Funding at $500 Billion Valuation"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.955,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.646,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Tether Holdings SA, the issuer of the world's largest stablecoin, is negotiating with investors to raise up to $20 billion by selling about a 3% stake through a private placement. This funding could elevate the crypto company among the most valuable private firms globally.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Super Typhoon Ragas Causes Barrier Lake Burst in Taiwan, 14 Dead, 124 Missing",
    "domain": "general",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Wed, 24 Sep 2025 00:30:47 GMT",
    "source": "The Guardian",
    "sources": [
      "New York Times",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "<p>Deadly flood crashes through Taiwan’s Hualien county as barrier lake bursts banks, leaving 124 people missing as typhoon continues its path</p><p>The bursting of a barrier lake in Taiwan has killed at least 14 people and left 124 people missing, officials have announced, after Super Typhoon Ragas",
      "The storm left 14 dead in Taiwan, and flooded Hong Kong and Macau, disrupting flights."
    ],
    "image_url": "https://i.guim.co.uk/img/media/d90cc30530a06c46ac53a34fc01162238121cdb5/50_0_3747_2999/master/3747.jpg?width=140&quality=85&auto=format&fit=max&s=32e7a58980e56c72a858d8ce05841156",
    "titles": [
      "Super Typhoon Ragasa: at least 14 killed in Taiwan as Hong Kong and southern China brace for impact",
      "Typhoon Ragasa Kills 14 in Taiwan as Hong Kong Braces for Powerful Storm"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.905,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.643,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A barrier lake in Taiwan's Hualien county burst due to Super Typhoon Ragas, resulting in at least 14 deaths and 124 people missing. The typhoon also caused flooding in Hong Kong and Macau, leading to disrupted flights.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump's Vaccine and Tylenol Remarks Stir Controversy",
    "domain": "science",
    "source_domain": "www.newscientist.com",
    "location": "global",
    "published": "Tue, 23 Sep 2025 21:30:38 +0100",
    "source": "New Scientist",
    "sources": [
      "New Scientist",
      "CityNews"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "www.newscientist.com"
    ],
    "snippets": [
      "Scientific evidence is lacking to support the US government’s decisions to caution against using a common painkiller in pregnancy and fast-track the approval of an experimental medication for autism",
      "Many doctors and scientists were reeling Monday after President Donald Trump went on TV to insist that pregnant women should never take Tylenol and revive debunked theories about vaccines and autism. Trump went beyond his own Food and Drug Administration’s more modest advice that doctors “should con"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/09/23192712/SEI_267248545.jpg",
    "titles": [
      "What we know, and don't, about the link between painkillers and autism",
      "What we know about autism’s causes and any potential link to Tylenol"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.85,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.642,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "President Donald Trump's statements on TV advising against the use of Tylenol by pregnant women and reviving debunked theories about vaccines and autism have sparked controversy. These statements go beyond the FDA's more cautious advice, leading to confusion and concern among doctors and scientists. There is a lack of scientific evidence to support the U.S. government's caution against Tylenol in pregnancy and the fast-tracking of an experimental autism medication.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Urges NATO to Shoot Down Russian Jets After Poland Incident",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Tue, 23 Sep 2025 20:54:20 +0000",
    "source": "Al Jazeera",
    "sources": [
      "ABC News",
      "Al Jazeera"
    ],
    "domains": [
      "abcnews.go.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "US President Donald Trump says NATO countries should shoot down Russian aircraft that violate their airspace.",
      "Trump also pressured European countries to stop buying Russian oil."
    ],
    "image_url": "",
    "titles": [
      "Trump: NATO countries should shoot down Russian aircraft violating airspace",
      "Trump says NATO countries should shoot down Russian aircraft that violate airspace"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.857,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.64,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "US President Donald Trump suggested that NATO countries should shoot down Russian aircraft entering their airspace, following an incident where Poland, a NATO member, fired at a Russian aircraft. This marks the first such action by a NATO country against Russia since the onset of the Russia-Ukraine conflict.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump-Epstein Statue Installed on National Mall Sparks Reactions",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Tue, 23 Sep 2025 23:34:38 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "The Guardian"
    ],
    "domains": [
      "news.google.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMiekFVX3lxTE05dXcza3hWam52VE5DbndEN21YR2IxYzVLZVBDUko0TVdKRTJTUkFHSVhGLXdKS1kyR1dselB3RG9Yd3VrUVpvVWptelFmcDVzdjdLSVZOTWc2S3QzaFhsNnpFekdWZXFYWGU3eVlhM3gyaWhsc2pNU2pn?oc=5\" target=\"_blank\">Statue of Trump and Epstein holding hands appears on the Nation",
      "<p>Bronze statue by an anonymous creator shows the two men frolicking and holding hands with a foot kicked back in joy</p><p>There’s a new statue on the east end of the National Mall for Washington DC residents and tourists to enjoy. The bronze statue shows two men frolicking, grinning wide and hold"
    ],
    "image_url": "",
    "titles": [
      "Statue of Trump and Epstein holding hands appears on the National Mall - Axios",
      "New statue on National Mall celebrates ‘long-lasting bond’ between Trump and Epstein"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.887,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.639,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A bronze statue depicting Donald Trump and Jeffrey Epstein holding hands and frolicking has been installed on the east end of the National Mall in Washington DC. Created by an anonymous artist, the statue features both men with wide grins and a foot kicked back in joy, sparking reactions among residents and tourists.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Fed Chair Prioritizes Labor Market Concerns Over Inflation",
    "domain": "business",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Tue, 23 Sep 2025 15:10:54 -0400",
    "source": "ABC News",
    "sources": [
      "CNBC",
      "ABC News"
    ],
    "domains": [
      "abcnews.go.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "The remarks came less than a week after the Fed cut interest rates.",
      "Powell said Tuesday that weakness in the labor market is outweighing concerns about stubborn inflation."
    ],
    "image_url": "https://s.abcnews.com/images/Business/fed-ap-er-250923_1758643994446_hpMain_4x3t_384.jpg",
    "titles": [
      "Fed Chair Powell says rising inflation and slow hiring pose 'challenging situation'",
      "Powell says slowing labor market prompted rate cut, sees 'challenging situation' ahead"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.827,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.634,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Federal Reserve Chair Jerome Powell stated on Tuesday that the current weakness in the labor market is a more significant concern than persistent inflation. This comment came shortly after the Fed decided to cut interest rates less than a week ago.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "NASA Eyes Crewed Artemis Moon Flight Within 20 Weeks",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Tue, 23 Sep 2025 15:42:03 EDT",
    "source": "Phys.org",
    "sources": [
      "Ars Technica",
      "Phys.org"
    ],
    "domains": [
      "arstechnica.com",
      "phys.org"
    ],
    "snippets": [
      "After multiple delays, the first crewed Artemis flight around the moon could be less than 20 weeks away, NASA officials said Tuesday, putting the space program one step closer to returning to the moon itself in its \"second space race\" with China.",
      "\"There is a desire for us to be the first to return to the surface of the Moon.\""
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/moon-orbit.jpg",
    "titles": [
      "NASA officials say Artemis II moon flight could come in early February",
      "NASA targeting early February for Artemis II mission to the Moon"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.836,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.632,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "NASA officials announced that the first crewed Artemis flight around the moon could occur in less than 20 weeks, advancing the space agency's goal to return to the lunar surface and stay ahead in the space race with China. This development brings NASA one step closer to its objective of returning humans to the moon.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Airs Grievances in U.N. Speech Amid Funding Cuts",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Tue, 23 Sep 2025 17:41:33 +0000",
    "source": "Al Jazeera",
    "sources": [
      "New York Times",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "The US president meets Arab and Muslim leaders on the sidelines of the UNGA, hoping to end the war in Gaza.",
      "The president made inaccurate claims about the economy, renewable energy and the mayor of London.",
      "The leaders of Ukraine and the United States will hold talks weeks after President Trump agreed to participate in postwar security guarantees for Ukraine."
    ],
    "image_url": "",
    "titles": [
      "Trump urges Gaza war to end ‘immediately’ in UN General Assembly speech",
      "Fact-Checking Trump’s Speech at the U.N. General Assembly",
      "Zelensky to Meet With Trump on Sidelines of U.N. General Assembly"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.801,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.629,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "At the United Nations General Assembly's 80th session in New York, President Donald Trump delivered a speech marked by grievances and inaccuracies, amid the U.S. withdrawing funding for U.N. programs. Trump's address, which included warnings about immigration and green energy policies affecting western Europe, coincided with the U.N. Secretary General's statement on the organization's principles being under threat. Additionally, Trump's participation in talks with Ukraine for postwar security guarantees was noted, alongside the U.S. refusal to pay certain UN dues and a $1 billion cut in U.N. f",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Jessica Chastain's \"The Savant\" Pulled from Apple TV+ Schedule",
    "domain": "technology",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Tue, 23 Sep 2025 20:37:14 GMT",
    "source": "The Guardian",
    "sources": [
      "The Verge",
      "The Guardian"
    ],
    "domains": [
      "www.theverge.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "<p>The Savant pulled from Apple TV+ release schedule ‘after careful consideration’</p><p>Jessica Chastain-led series The Savant has been pulled from the Apple TV+ release schedule.</p><p>The thriller was set to begin on 26 September but its release has been postponed.</p> <a href=\"https://www.thegua",
      "The Savant, the upcoming Apple TV Plus show about law enforcement working to prevent domestic terrorism, was slated to premiere this Friday. But the streamer has quietly pulled the series from its release slate and it&#8217;s not clear if or when it will now debut. Based on Andrea Stanley&#8217;s 20"
    ],
    "image_url": "https://i.guim.co.uk/img/media/471cfb9ab346f95293d8715d8270a3aa44dd493d/720_0_7200_5760/master/7200.jpg?width=140&quality=85&auto=format&fit=max&s=8b672750d5d507e53b60a4428afedec7",
    "titles": [
      "Apple postpones Jessica Chastain series about domestic extremism",
      "Apple TV Plus has quietly pulled its new show about domestic extremism"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.834,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.629,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Savant, a thriller series led by Jessica Chastain and focused on preventing domestic terrorism, was scheduled to premiere on Apple TV+ on September 26. However, after careful consideration, the show has been removed from the release schedule, and it is currently unclear if or when it will debut.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Online Retail Giant to Close 19 Shops, 5 to Become Whole Foods",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 23 Sep 2025 17:11:29 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "CNBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "The online retail giant says it would convert five of the 19 shops into Whole Foods stores.",
      "The company's grocery business has undergone significant changes over the past few years, including trimming its brick-and-mortar store footprint."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/bc2e/live/a738bca0-987e-11f0-b146-278281693603.jpg",
    "titles": [
      "Amazon to close its UK grocery stores",
      "Amazon to close all of its Fresh grocery stores in UK"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.777,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.627,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "An online retail giant announced plans to close 19 shops, with five being converted into Whole Foods stores, as part of a strategy adjustment following the unsuccessful adoption of its till-less store concept. This move reflects significant changes in the company's approach to its grocery business, which has seen a reduction in its physical store presence recently.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Meta Launches Super PAC to Oppose AI Regulation Policies",
    "domain": "technology",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Tue, 23 Sep 2025 14:02:30 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "TechCrunch"
    ],
    "domains": [
      "news.google.com",
      "techcrunch.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMibEFVX3lxTE5EUTlOMkprWjVvMFZDRkRHekpselFfUkczV05DbXpPY09DZ3hHTl9LV0UtSG5LUVo5dkp3d3djVGVNRC1RWm5iTGFYYWtYMUxqeVVCWXl1VXlDZEZDTXZJVjZoLV9SbzNIYjBDcA?oc=5\" target=\"_blank\">Exclusive: Meta launches super PAC to fight AI regulation</a>&nbsp;&nbsp;<font co",
      "Meta is investing 'tens of millions' into a new pro-AI super PAC called the American Technology Excellence Project to fight state-level tech policy that would regulate AI."
    ],
    "image_url": "",
    "titles": [
      "Exclusive: Meta launches super PAC to fight AI regulation - Axios",
      "Meta launches super PAC to fight AI regulation as state policies mount"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.727,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.607,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Meta has launched the American Technology Excellence Project, a super PAC, with an investment of 'tens of millions'. The purpose is to oppose state-level policies aimed at regulating AI technology.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "NASA Picks 10 Astronauts for 2025 Class, Eyes Moon and Mars Missions",
    "domain": "science",
    "source_domain": "www.sciencedaily.com",
    "location": "global",
    "published": "Tue, 23 Sep 2025 10:10:07 EDT",
    "source": "ScienceDaily",
    "sources": [
      "NASA",
      "ScienceDaily"
    ],
    "domains": [
      "www.sciencedaily.com",
      "www.nasa.gov"
    ],
    "snippets": [
      "NASA has chosen 10 new astronaut candidates who will train for missions to the Moon and Mars. Their selection represents a powerful blend of talent and ambition, fueling humanity’s next great leaps into space.",
      "NASA’s 2025 astronaut candidate class greets the crowd in this Sept. 22, 2025, image. The group was introduced Monday following a competitive selection process of more than 8,000 applicants from across the United States. The class now will complete nearly two years of training before becoming eligib"
    ],
    "image_url": "",
    "titles": [
      "10 people who beat 8,000 others to become NASA astronaut candidates",
      "NASA’s New Astronaut Candidates"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.745,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.604,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "NASA selected 10 astronaut candidates from over 8,000 applicants for its 2025 class, introduced on Sept. 22, 2025. These candidates will undergo nearly two years of training for future Moon and Mars missions, marking a significant step in human space exploration.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Tech Leaders to Discuss AI, Space Economy, and Startups at TechCrunch Disrupt 20",
    "domain": "technology",
    "source_domain": "techcrunch.com",
    "location": "global",
    "published": "Tue, 23 Sep 2025 22:00:00 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com"
    ],
    "snippets": [
      "At TechCrunch Disrupt 2025, True Anomaly’s Even Rogers and Vast’s Max Haot will join the Space Stage to explore what’s needed to unlock a sustainable and scalable space economy.",
      "On the AI Stage at TechCrunch Disrupt 2025, Mercor co-founder and CEO Brendan Foody will break down how artificial intelligence is transforming not just how we work, but also who gets to work in the first place.",
      "Vinod Khosla, founder of Khosla Ventures, takes the Disrupt Stage for a candid fireside chat on AI, climate, healthcare, and transformational startups. Hear blunt, big-picture advice from one of tech’s most legendary investors, and learn what founders truly need to succeed in turbulent times."
    ],
    "image_url": "",
    "titles": [
      "Building the new backbone of space at TechCrunch Disrupt 2025",
      "Mercor’s Brendan Foody breaks down AI’s impact on hiring at TechCrunch Disrupt 2025",
      "Vinod Khosla on AI, moonshots, and building enduring startups — all at TechCrunch Disrupt 2025"
    ],
    "score_components": {
      "magnitude": 0.393,
      "recency": 0.877,
      "consensus": 0.35,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.46,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "At TechCrunch Disrupt 2025, leaders in technology and investment, including Even Rogers, Max Haot, Brendan Foody, and Vinod Khosla, will discuss key topics shaping the future. They'll cover the development of a sustainable space economy, the impact of AI on employment, and the role of startups in addressing major global challenges such as climate change and healthcare. The event aims to provide insights into creating successful ventures in a rapidly changing world.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  }
]