[
  {
    "title": "Israel, Hamas Agree on Ceasefire and Prisoner Exchange in Gaza Peace Effort",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Thu, 09 Oct 2025 16:15:30 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Washington Post",
      "CNBC",
      "New York Times",
      "Financial Times"
    ],
    "domains": [
      "www.cnbc.com",
      "www.ft.com",
      "www.washingtonpost.com",
      "www.aljazeera.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "A government spokesperson has laid out how Israel will implement the first phase of the peace plan for Gaza.",
      "Trump announced that Israel and Hamas had agreed on the first phase of a peace plan which could put an end to the two-year war and free hostages.",
      "The ceasefire deal’s initial phase, if implemented, would halt fighting in Gaza to release hostages in exchange for Israel’s release of Palestinian prisoners.",
      "The Palestinian militant group is giving up much of the leverage it has with Israel, with no guarantee some of its main demands will be met.",
      "Prime Minister Benjamin Netanyahu of Israel said he would convene his government on Thursday to sign off on the agreement. Hamas said that the agreement would lead to the end of the war, but many of the details were unclear.",
      "Hostage-release agreement marks milestone in efforts to bring two-year conflict to an end"
    ],
    "image_url": "",
    "titles": [
      "Israel announces timeline for implementing first phase of peace plan",
      "Israel, Hamas agree to first phase of Gaza peace plan, allowing release of hostages and prisoners",
      "Live updates: Israel and Hamas sign first phase of Gaza ceasefire deal that would release hostages",
      "Hamas Takes a Big Risk in Deal With Israel to Release Hostages",
      "President Trump Says Israel and Hamas Agree to First Phase of Peace Plan",
      "Israeli cabinet due to vote on first phase of Trump-backed peace deal"
    ],
    "score_components": {
      "magnitude": 0.964,
      "recency": 0.92,
      "consensus": 0.995,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.83,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Israel and Hamas have agreed on the first phase of a peace plan, aimed at ending the two-year conflict in Gaza. This initial phase involves a ceasefire and the exchange of hostages for Palestinian prisoners. Despite concerns over unmet demands, both parties see this as a significant step toward peace. Israeli Prime Minister Netanyahu plans to convene his government to approve the agreement, while Hamas views it as a potential end to the war, although many details remain unclear.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Blames Democrats for Shutdown, Threatens Program Cuts",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Thu, 09 Oct 2025 14:00:49 +0000",
    "source": "Al Jazeera",
    "sources": [
      "The Guardian",
      "Al Jazeera",
      "CNBC",
      "Forbes"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.forbes.com",
      "www.cnbc.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "US President Donald Trump blames Democrats for government shutdown, says he will cut &#039;very popular Democrat programs&#039;.",
      "President Donald Trump said his administration plans to use the government shutdown to permanently cut government programs popular with Democrats.",
      "<p>Trump says federal cuts made while government is shut down will ‘only’ target his opponents’s priorities; House-passed bill and Democratic stopgap rejected</p><p>The president has spent much of Thursday morning <strong>thanking his allies on Truth social for praising his diplomatic efforts in Gaz",
      "The government shutdown began at midnight on Oct. 1 as Democrats and Republicans appeared to be nowhere close to reaching a funding deal."
    ],
    "image_url": "",
    "titles": [
      "LIVE: Trump again threatens to cut ‘Democrat programs’ if shutdown persists",
      "Trump threatens to use government shutdown to cut 'popular Democrat programs'",
      "Trump says ‘we’re only going to cut Democrat programs’ as Senate again fails to pass dueling funding bills – live",
      "Government Shutdown: Trump Vows To Cut ‘Very Popular Democrat Programs’ As Shutdown Enters 10th Day"
    ],
    "score_components": {
      "magnitude": 0.932,
      "recency": 0.878,
      "consensus": 0.908,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.799,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "President Donald Trump has attributed the government shutdown to Democrats, announcing intentions to permanently cut programs favored by them amidst the deadlock. The shutdown, which started on October 1, occurred due to a lack of consensus on funding between Democrats and Republicans. Trump has also expressed gratitude towards allies for their support on his diplomatic efforts, specifically mentioning acknowledgments on Truth social.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: effort, support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Breakthrough Deal Aims to End Gaza Conflict; Troops Withdrawal Planned",
    "domain": "general",
    "source_domain": "www.bbc.co.uk",
    "location": "global",
    "published": "Thu, 09 Oct 2025 16:32:00 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "ABC News",
      "Washington Post",
      "BBC"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.co.uk",
      "abcnews.go.com",
      "www.washingtonpost.com"
    ],
    "snippets": [
      "Israel and Hamas have agreed to the first phase of a peace deal",
      "There are many questions surrounding the Israel-Hamas ceasefire deal and what it means for the region.",
      "Trump’s framework to end the war in Gaza is the basis for an initial agreement between Israel and Hamas.",
      "A senior Hamas official said late Wednesday that an agreement to end the war in Gaza was “imminent.”",
      "<p>Sidelines chat at UN was turning point for US president, but others also have right to claim role in end of two-year war</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/oct/09/gaza-ceasefire-live-trump-says-hostages-probably-released-monday-idf-says-gaza-city-still-extremely-da"
    ],
    "image_url": "https://ichef.bbci.co.uk/images/ic/240x135/p0j72y80.jpg",
    "titles": [
      "Can Trump turn a Gaza ceasefire into a lasting peace deal?",
      "How the potential Gaza ceasefire deal may face challenges",
      "What to know about the Gaza ceasefire deal",
      "Trump, Hamas officials say Gaza ceasefire deal ‘very close’",
      "‘Trump is like a juggernaut’: how the Gaza ceasefire deal was done"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.907,
      "consensus": 0.908,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.788,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A breakthrough deal has been announced, potentially ending the war in Gaza, marking the cessation of the bloodiest fighting between Israelis and Palestinians. Qatar, acting as mediator, confirmed details will follow. U.S. President Donald Trump stated all hostages will be released imminently, and Israel will withdraw troops to a specified line. Trump also hinted at a possible visit to the Middle East soon. This agreement represents the \"first phase\" of a peace plan, with a senior Hamas official indicating an end to the conflict is \"imminent.\"",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "László Krasznahorkai Wins 2025 Nobel Prize in Literature",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 09 Oct 2025 12:29:09 GMT",
    "source": "BBC",
    "sources": [
      "Deutsche Welle",
      "The Guardian",
      "Le Monde",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.lemonde.fr",
      "www.theguardian.com",
      "www.dw.com"
    ],
    "snippets": [
      "He was recognised “for his compelling and visionary oeuvre that, in the midst of apocalyptic terror, reaffirms the power of art”.",
      "Krasznahorkai became the 122nd recipient of the prize, which has been given out with few exceptions since 1901. Celebrated both at home and abroad, he is famous for his dystopian novels depicting life in rural Hungary.",
      "Tenu pour un « maître de l’apocalypse », le romancier, né en 1954, se voit distingué vingt-trois ans après son compatriote Imre Kertesz.",
      "<p>Hungarian novelist celebrated for dystopian, melancholic novels that ‘reaffirm the power of art’</p><p>The Nobel prize in literature for 2025 has been awarded to the Hungarian author László Krasznahorkai, the Swedish Academy has announced.</p><p>The academy cited the 71-year-old’s “compelling and"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/194a/live/f91c69d0-a4ff-11f0-9156-136a18fa2a3c.jpg",
    "titles": [
      "Hungarian author László Krasznahorkai wins Nobel Literature Prize",
      "Nobel Prize in literature goes to Laszlo Krasznahorkai of Hungary",
      "Le prix Nobel de littérature 2025 a été attribué à l’écrivain hongrois Laszlo Krasznahorkai",
      "László Krasznahorkai wins the Nobel prize in literature 2025"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.833,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.763,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Hungarian novelist László Krasznahorkai, aged 71, was awarded the Nobel Prize in Literature 2025 for his \"compelling and visionary oeuvre\" that explores apocalyptic themes while affirming the power of art. Known for his dystopian novels set in rural Hungary, Krasznahorkai became the 122nd recipient of the prestigious award, announced in Stockholm.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Erik Spoelstra Named Coach for U.S. Men's Basketball Team for 2027, 2028 Events",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Thu, 9 Oct 2025 15:48:41 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sports Illustrated",
      "Sportsnet"
    ],
    "domains": [
      "www.espn.com",
      "news.google.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "USA Basketball is expected to hire the Miami Heat's Erik Spoelstra as the next head coach of the men's national team, sources told ESPN.",
      "<a href=\"https://news.google.com/rss/articles/CBMie0FVX3lxTE83OGJUOE9scHZtNGJlajFuY29BNGxqMlRZbXAwTC1RSTdKR1B2UmFaVzBNc2dQUmZJZG1wN3M0NEdvWkprNWtkbTRhWk5hUnF1alppX1FNOUxRV2xzWHlETXYySGdSLUoxeExlYm91VUdtNXpFenp5STJwcw?oc=5\" target=\"_blank\">USA Basketball Tabs Erik Spoelstra As Next World Cup, Olympic",
      "<p>Erik Spoelstra of the Miami Heat has emerged as the choice to become the next coach of the U.S. men’s basketball team for the 2027 World Cup in Qatar and 2028 Los Angeles Olympics, two people with knowledge of the situation said Thursday.</p>"
    ],
    "image_url": "",
    "titles": [
      "Sources: Spoelstra to be next Team USA coach",
      "USA Basketball Tabs Erik Spoelstra As Next World Cup, Olympic Men's Coach - Sports Illustrated",
      "AP Source: USA Basketball expected to name Erik Spoelstra as new head coach"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.991,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.76,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Erik Spoelstra, the Miami Heat coach, is set to become the next head coach of the U.S. men's national basketball team, according to sources. He will lead the team in the 2027 World Cup in Qatar and the 2028 Olympics in Los Angeles.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Week 6 Fantasy Football Tips: QB Picks and Giants' Player Updates",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Thu, 9 Oct 2025 15:48:41 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sports Illustrated",
      "Yahoo Sports"
    ],
    "domains": [
      "www.espn.com",
      "sports.yahoo.com",
      "news.google.com"
    ],
    "snippets": [
      "An all-encompassing look at the matchups to exploit or avoid and lineup locks in fantasy, as well as projected scores for all NFL games.",
      "We've got everything you need to prep your fantasy football lineups for Week 6, including rankings, sleepers, start/sit advice and more!",
      "<a href=\"https://news.google.com/rss/articles/CBMinAFBVV95cUxQR055MnVlcEQzVHd1VmJjQUFLbkRGZEFfRmIweTNGelhuNGdMUWoxNFc5elg5SjlHMnFIWTc5ZTFlOTZrRDEtMk01NGxrNGZKUk4wbVZGNlB2ZTh2SGJ5dDMxSEdDZVg4Wk5QZmx3ekQ5eHZPTVhONnBrUlZ2OGN1djdfZlZsTW5wOUJTM25pTGdFVE5LeGtvQTYyQ04?oc=5\" target=\"_blank\">Running Back Sta",
      "<a href=\"https://news.google.com/rss/articles/CBMimAFBVV95cUxOQzhzN3JiTHR4RVBDVnJzTVV3a0I2Sy1kZk96eVBzanprLXEydGN6aEVGNmlTeVhJM2tiV0diU1dCZUU2NE1iY1RfcFNpSXZvcXQzeUJNLTR0UTI5Y0VxZG03elZMM2gyZDZfNEt2SDVXbHozeE9BemFlNFhJZ3AtbXBDS1JueFNjX05MN2JtRlZJRFVDQm1UVw?oc=5\" target=\"_blank\">Tight End Start 'Em, "
    ],
    "image_url": "",
    "titles": [
      "🏈 Fantasy football playbook for Week 6",
      "Fantasy Football Week 6 Toolkit: Rankings, sleepers, start/sit advice and more",
      "Running Back Start 'Em, Sit 'Em For Fantasy Football Week 6 - Sports Illustrated",
      "Tight End Start 'Em, Sit 'Em For Fantasy Football Week 6 - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.991,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.76,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "In Week 6 fantasy football, certain quarterbacks are recommended for lineups, while others are advised against. Additionally, guidance is provided for selecting running backs and tight ends. The New York Giants have ruled out three players for their upcoming game. The details on which quarterbacks to choose or avoid were not specified in the provided content.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Angel Reese: First Pro Athlete in Victoria's Secret Show",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Thu, 9 Oct 2025 15:39:04 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sports Illustrated",
      "CBS Sports"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com",
      "news.google.com"
    ],
    "snippets": [
      "The Chicago Sky star will make history as the first professional athlete to walk in the fashion show.",
      "Reese continues to grow her star and find new ventures off the court",
      "<a href=\"https://news.google.com/rss/articles/CBMickFVX3lxTFBuU3JlZlZGWnIzMEFfaTY3UVZWZm5JaUlkbXNlSnZadXhQMlJIVEhzdG9MVXNOVlF4SFQyODdsZjJsZ3RLYUx1NklqWjhUc1FVTDk3SzAyNE5kTmFoZEZMU244RlFBbkxBckF4Wlpmelk1Zw?oc=5\" target=\"_blank\">Angel Reese to Become First Pro Athlete to Walk Victoria's Secret Runway<"
    ],
    "image_url": "",
    "titles": [
      "Angel Reese to become first professional athlete to walk in Victoria's Secret Fashion Show",
      "Angel Reese to appear in Victoria's Secret Fashion Show as first pro athlete to walk runway",
      "Angel Reese to Become First Pro Athlete to Walk Victoria's Secret Runway - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.988,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.759,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Chicago Sky's Angel Reese is set to become the first professional athlete to participate in a Victoria's Secret fashion show. This milestone marks a significant expansion of Reese's career beyond basketball, showcasing her growth into new ventures.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "SportsLine Releases Predictions for College Football, MLB, and NFL Games",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Thu, 09 Oct 2025 19:20:32 +0000",
    "source": "CBS Sports",
    "sources": [
      "Sports Illustrated",
      "Yahoo Sports",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "www.covers.com",
      "news.google.com"
    ],
    "snippets": [
      "The SportsLine projection model has revealed its Philadelphia vs. New York picks for the 2025 NFL Week 6 'Thursday Night Football' game",
      "SportsLine expert Adam Silverstein has revealed his Philadelphia Eagles vs. New York Giants picks for Thursday Night Football from MetLife Stadium in East Rutherford, N.J.",
      "NFL player prop picks and SGP bets for New York vs. Philadelphia on 'Thursday Night Football' from the SportsLine Machine Learning Model AI",
      "Our anytime touchdown picks for the Eagles vs. Giants hone in on a pair of tight ends.",
      "The latest Thursday Night Football odds for the 2025 season, with Week 6 featuring Eagles vs. Giants on October 9.",
      "<a href=\"https://news.google.com/rss/articles/CBMilwFBVV95cUxQX1NVWTVBRDhCcmhKYjlXQzQ4d3JqLVdFbnFpblQtS2ZZMmtqWHo1NDhfS21VMnh6VnFnU1hidGt0eUIwNW05bFE1RHhZN0dnMUEyUG11SGFrcGhHV0Zhd0t5cTNXTnVCUEMzcmVFMjRUQzNNRlVscWN3Mm9ENnk1LW9QNUF4VmRpZml0OEJ2WGR0T2xVdWtr?oc=5\" target=\"_blank\">Eagles vs. Giants: Four",
      "SportsLine expert Jimmie Kaylor has revealed his Fresno State Bulldogs vs. CSU Rams picks, predictions, and best bets for Friday's game on CBS Sports Network",
      "The SportsLine Projection Model has revealed its Washington vs. Rutgers picks for Friday",
      "The SportsLine Projection Model has revealed its South Florida vs. North Texas picks for Friday night"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/01/30/77b9b505-71d2-4c90-8d2d-1324589d6f71/aj-brown-eagles-usatsi-3.jpg",
    "titles": [
      "Eagles vs. Giants prediction, odds, start time: 2025 NFL Week 6 Thursday Night Football picks by proven model",
      "Giants vs. Eagles picks, odds, time: 2025 NFL Week 6 Thursday Night Football prediction by expert on 37-22 run",
      "Giants vs. Eagles NFL player props: Self-learning AI backs Hurts under 196.5 yards on Thursday Night Football",
      "Anytime Touchdown Scorer Eagles vs Giants Prediction: TD Picks for Thursday Night Football Week 6",
      "Thursday Night Football Odds: TNF Betting Lines 2025",
      "Eagles vs. Giants: Four Bold Predictions for 'Thursday Night Football' in Week 6 - Sports Illustrated",
      "Colorado State vs. Fresno State prediction, odds: 2025 college football Week 7 picks, prop bets by top expert",
      "Rutgers vs. Washington prediction, odds, line, time: 2025 college football Week 7 picks by advanced model",
      "South Florida vs. North Texas prediction, odds, line, time: 2025 college football Week 7 picks by model"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.982,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.733,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The SportsLine Projection Model has released its predictions for several sporting events, including college football matchups between Southern Miss vs. Georgia Southern, Jacksonville State vs. Sam Houston, East Carolina Pirates vs. Tulane Green Wave, and Louisiana Tech vs. Kennesaw State, all scheduled for Thursday. Additionally, it provided picks for the MLB National League Division Series Game 4 between Philadelphia and Los Angeles, and for the 2025 NFL Week 6 Thursday Night Football game between Philadelphia and New York. Furthermore, it recommended taking Houston's spread against Oklahoma ",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Rishi Sunak Joins Microsoft, Anthropic, and Goldman Sachs as Senior Adviser",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 09 Oct 2025 19:37:59 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "Financial Times",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.theguardian.com",
      "www.ft.com"
    ],
    "snippets": [
      "The former prime minister has been told not to lobby the UK government by the appointments watchdog.",
      "Former UK prime minister adds Silicon Valley posts to his role advising Goldman Sachs",
      "<p>Former UK prime minister told post-ministerial jobs watchdog roles would not involve lobbying or UK policy influence</p><p>Rishi Sunak has been appointed as a senior adviser by the US technology companies Microsoft and Anthropic.</p><p>The former British prime minister’s pair of new jobs emerged "
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/75b5/live/f04264c0-a538-11f0-8469-192d9823e9a2.jpg",
    "titles": [
      "Ex-PM Sunak joins Microsoft and AI firm as paid advisor",
      "Sunak takes Microsoft and Anthropic advisory jobs",
      "Rishi Sunak takes advisory roles with Microsoft and AI firm Anthropic"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.967,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.73,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The former UK Prime Minister, Rishi Sunak, has been appointed as a senior adviser by US technology companies Microsoft and Anthropic, in addition to advising Goldman Sachs. He has assured the post-ministerial jobs watchdog that his new roles will not involve lobbying or influencing UK policy. The appointments watchdog has advised him against lobbying the UK government.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "HBO Unveils Trailer for Prequel Series Set 100 Years Before Game of Thrones",
    "domain": "business",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Thu, 09 Oct 2025 17:22:19 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "Forbes",
      "Ars Technica"
    ],
    "domains": [
      "www.forbes.com",
      "arstechnica.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "<p>Latest Westeros-set show, based on novellas by George RR Martin, takes place 100 years before events of Game of Thrones</p><p>HBO is headed back to Westeros once again. The network revealed the first trailer for its second <a href=\"https://www.theguardian.com/tv-and-radio/game-of-thrones\">Game of",
      "A Knight Of The Seven Kingdoms just dropped its first trailer, and it's perfect in every way. The show also has a premiere date.",
      "\"I know I'm just a hedge knight but sometimes I think I could be more.\""
    ],
    "image_url": "https://i.guim.co.uk/img/media/18204ad9037bf9de6dfeb438ad952331a316bbba/141_0_1600_1280/master/1600.jpg?width=140&quality=85&auto=format&fit=max&s=ad12a85edfd54833c7be738eec970153",
    "titles": [
      "A Knight of the Seven Kingdoms: first trailer for new Game of Thrones prequel",
      "‘A Knight Of The Seven Kingdoms’ Looks Even Better Than ‘Game Of Thrones’ In Its Incredible First Trailer",
      "A Knight of the Seven Kingdoms teaser debuts at NYCC"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.923,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.728,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "HBO released the first trailer for \"A Knight Of The Seven Kingdoms,\" a new show set in Westeros 100 years before Game of Thrones, based on George RR Martin's novellas. The series, featuring a hedge knight aspiring for more, also announced its premiere date.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "IRS Adjusts Tax Brackets and Deductions for 2026 Under New Bill",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Thu, 09 Oct 2025 18:49:47 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "CNBC",
      "Forbes"
    ],
    "domains": [
      "www.forbes.com",
      "www.cnbc.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMifkFVX3lxTE56anFuSGZTSG94cmVlSGsyc3QyeGpSYU14YkIyNjF0LUprdXNSRzZhV2FIaWVWTkJWcTB5UlNJLXVSeWRpOG9qTHJkNDJaWjNUdnhnUnVGQldFVWlENGI0Y2laSlN3MTlzQzZOYWJQSFQ2SC1tdW15dE01RDhvQQ?oc=5\" target=\"_blank\">IRS releases 2026 tax brackets and higher tax deductions ",
      "The IRS has announced higher long-term capital gains brackets for 2026. Here's what investors need to know.",
      "Here are the tax rate schedules, tax tables and cost-of-living adjustments for 2026, including new and increased deductions created by the 2025 One Big Beautiful Bill Act."
    ],
    "image_url": "",
    "titles": [
      "IRS releases 2026 tax brackets and higher tax deductions for 2025, 2026 tax years - Axios",
      "IRS unveils higher capital gains tax brackets for 2026",
      "IRS Announces 2026 Tax Brackets, Standard Deductions And Other Inflation Adjustments"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.951,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.727,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The IRS announced increases in federal income tax brackets, standard deductions, and long-term capital gains brackets for 2026 due to the One Big Beautiful Bill Act. This adjustment aims to accommodate changes in the economy, affecting taxpayers and investors by potentially altering their tax liabilities.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Sora App Surpasses 1M Downloads Faster Than ChatGPT",
    "domain": "technology",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Thu, 09 Oct 2025 14:57:09 GMT",
    "source": "CNBC",
    "sources": [
      "The Verge",
      "CNBC",
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com",
      "www.theverge.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "Sora reached 1 million downloads even faster than ChatGPT, OpenAI's popular AI chatbot that supports 800 million weekly active users.",
      "OpenAI’s social AI video-generating app, Sora, has reached over 1 million downloads in fewer than five days since its launch. That’s according to Sora head Bill Peebles, who said on Wednesday that Sora racked up downloads faster than ChatGPT did at launch despite being an invite-only app. The compan",
      "This level of consumer adoption is worth noting because Sora remains an invite-only app, while ChatGPT was more publicly available at launch. That makes Sora's performance more impressive."
    ],
    "image_url": "",
    "titles": [
      "OpenAI's Sora hit 1 million downloads in less than five days",
      "OpenAI’s Sora has already hit more than 1 million downloads",
      "Sora hit 1M downloads faster than ChatGPT"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.877,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.712,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Sora, an invite-only app, achieved 1 million downloads faster than OpenAI's ChatGPT, despite ChatGPT having 800 million weekly active users and being more publicly accessible at its launch. This highlights Sora's significant consumer adoption rate.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Global Eyes on Nobel Peace Prize Amid Speculation Over Trump's Reaction",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Thu, 09 Oct 2025 12:17:08 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "The Guardian"
    ],
    "domains": [
      "www.npr.org",
      "www.theguardian.com"
    ],
    "snippets": [
      "Anticipation is growing and bookies around the world are taking bets on who'll be awarded this year's Nobel Peace Prize. Here is what to know ahead of the award announcement this week.",
      "<p>US president may impose tariffs, demand higher Nato contributions or even declare Norway an enemy, analyst says</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/2025/oct/09/trump-nobel-peace-prize\">Why is Donald Trump so obsessed with winning the peace prize?</a></p></li></ul><p>With ho",
      "<p>The US president’s fervid pursuit of the award is believed to have been a key motivator in brokering peace deals in Ukraine and Gaza</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/oct/09/norway-braces-for-trumps-reaction-if-he-does-not-win-nobel-peace-prize\">Norway braces for Trump"
    ],
    "image_url": "",
    "titles": [
      "What to know about the Nobel Peace Prize",
      "Norway braces for Trump’s reaction if he does not win Nobel peace prize",
      "Truly, madly, deeply: Trump’s desire for a Nobel peace prize is driving diplomacy"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.921,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.681,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Global anticipation builds for the Nobel Peace Prize announcement, with speculation on potential winners. Amidst this, there's focus on President Trump's intense interest in the prize, believed to be a motivator in his efforts to broker peace deals in Ukraine and Gaza. Concerns are raised about Trump's possible reactions if not awarded, including imposing tariffs, demanding higher NATO contributions, or declaring Norway an enemy, according to analysts.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Turning Point USA Plans Super Bowl LX Performance, Details Pending",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Thu, 09 Oct 2025 16:48:15 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "Forbes"
    ],
    "domains": [
      "www.forbes.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMilgFBVV95cUxOWlNxVm5UNlJJY0U5dHdSUjV5bERUX2pFRmRGTkJ0a1VMdWx6ejdIVkxQS0NSTC1FNzRaREU5MVRPUGIxZFNuRjhSZU5VaGVRYXMycGZ6UUlLRzVkbldzT0NnT21jRE5jZTV1LTFvcFJnNVJJUE5uVmwwdWgwUS0yODI4djZXNEJWcERtMUVqRG1OUy1QWVE?oc=5\" target=\"_blank\">Turning Point USA will h",
      "The conservative group has released few details about the upcoming performance timed to coincide with Super Bowl LX."
    ],
    "image_url": "",
    "titles": [
      "Turning Point USA will host a rival to Bad Bunny's Super Bowl halftime show - Axios",
      "Turning Point USA Announces ‘All American Halftime Show’ As Bad Bunny Super Bowl Halftime Counterprogramming"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.912,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.679,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Conservative group Turning Point USA plans a performance during Super Bowl LX but has not provided many details about the event. The outcome or current status of the story is pending as more information is awaited.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Chris Jones Admits Error in Chiefs Loss, Vows Improvement",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Thu, 9 Oct 2025 15:48:41 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.espn.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Seen watching as Trevor Lawrence scrambled for the Jaguars' winning touchdown over the Chiefs, Chris Jones said he will do better going forward and that such an incident \"won't happen again.\"",
      "<p>Chris Jones took ownership of his mistake on the decisive play in the Chiefs&#8217; loss to Jacksonville last week, when the three-time All-Pro defensive tackle thought Trevor Lawrence was down and stopped on the play, only to watch the Jaguars quarterback scramble to his feet and into the end zo"
    ],
    "image_url": "",
    "titles": [
      "Chiefs' Jones owns up to not chasing Lawrence",
      "Chris Jones owns up to mistake in Chiefs’ loss to Jaguars"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.991,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.678,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Chris Jones, the Chiefs' three-time All-Pro defensive tackle, acknowledged his mistake during a critical play in their recent loss to Jacksonville. He stopped playing, believing Jaguars quarterback Trevor Lawrence was down, which allowed Lawrence to score the winning touchdown. Jones has committed to improvement, stating such an oversight \"won't happen again.\"",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Phoenix Mercury's Sabally Out with Concussion for WNBA Finals Game 4",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Thu, 9 Oct 2025 15:48:41 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.espn.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Phoenix Mercury forward Satou Sabally has been diagnosed with a concussion and ruled out for Game 4 of the WNBA Finals on Friday night against the Las Vegas Aces.",
      "<p>Already on the brink of elimination, the Phoenix Mercury will have to go without one of their best players should they want to stay alive. </p>"
    ],
    "image_url": "",
    "titles": [
      "Mercury's Sabally (concussion) out G4 vs. Aces",
      "Mercury’s Satou Sabally ruled out for Game 4 of WNBA Finals with concussion"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.991,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.678,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Satou Sabally, a forward for the Phoenix Mercury, has been diagnosed with a concussion and will not play in Game 4 of the WNBA Finals against the Las Vegas Aces. The Mercury are facing elimination in the series.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Michael McLeod Signs 3-Year Deal with KHL's Avangard Omsk",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Thu, 9 Oct 2025 15:48:40 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.espn.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Michael McLeod, one of five Hockey Canada players who were found not guilty of sexual assault charges in July, has signed a three-year contract with Avangard Omsk of the KHL.",
      "<p>Michael McLeod will continue his hockey career in the KHL.</p>"
    ],
    "image_url": "",
    "titles": [
      "Acquitted McLeod joins KHL's Avangard Omsk",
      "Michael McLeod signs with KHL’s Avangard Omsk"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.991,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.678,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Michael McLeod, cleared of sexual assault charges in July along with four other Hockey Canada players, has signed a three-year deal with Avangard Omsk in the KHL. He will be continuing his hockey career in the Russian league.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Ceasefire in Gaza: Hostages Released, Israeli Troops to Withdraw",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Thu, 09 Oct 2025 16:04:45 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "New York Times"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "Russian President Vladimir Putin said Moscow supports US President Donald Trump’s plan to end the Gaza war.",
      "President Trump’s plan contains elements that Hamas has resisted in the past, and which may yet prove to be sticking points."
    ],
    "image_url": "",
    "titles": [
      "Putin backs Trump’s Gaza peace plan, will support ‘peaceful efforts’",
      "What Trump’s 20-Point Gaza Peace Plan Envisions"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.917,
      "consensus": 0.591,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.665,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A ceasefire agreement in Gaza, announced today, will result in the release of hostages and the withdrawal of most Israeli troops after over two years of conflict. The plan, supported by US President Donald Trump, includes elements previously resisted by Hamas, which could pose future challenges.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: plan, support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Colombian Boat Bombed by US in Anti-Drug Effort, President Claims",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Thu, 09 Oct 2025 17:21:40 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "New York Times"
    ],
    "domains": [
      "www.nytimes.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMie0FVX3lxTE50MFpHMVllcnJfTjVpZXF1endKV1JPeU10MkdWU2xwYlRZc2pWdHhOeTBrS1EzbzZKMWltYXFNS2JsdkphZVBVUl9Mc1pRSDNVYThkb2ZjcURRTzVwVXVRUFMwa05McFVRX3d6YUd2bDRYb3kwbWRYc21oSQ?oc=5\" target=\"_blank\">Colombia president claims U.S. bombed Colombian boat in strik",
      "The Trump administration has said that it is attacking boats and killing their occupants because they are smuggling drugs from Venezuela to the United States."
    ],
    "image_url": "",
    "titles": [
      "Colombia president claims U.S. bombed Colombian boat in strike off Venezuela - Axios",
      "Colombia’s President Says Boat Bombed by U.S. Was Carrying Colombians"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.922,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.656,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Colombian president claimed that a boat from Colombia was bombed by the U.S. as part of the Trump administration's efforts to combat drug smuggling from Venezuela to the United States. This action is part of a broader strategy to target vessels believed to be transporting drugs.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Man Rearrested at Manchester Airport in Synagogue Attack Probe",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 09 Oct 2025 19:20:42 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "A 30-year-old man was re-arrested at Manchester Airport earlier, Counter Terrorism Policing said.",
      "<p>Police arrest 30-year-old on suspicion of failing to disclose information about potential terrorist acts</p><p>A 30-year-old man arrested over the Manchester synagogue attack has been rearrested at an airport shortly after being released.</p><p>Counter-terror police detained the man at Manchester"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/ff1c/live/c2f875e0-a538-11f0-8469-192d9823e9a2.jpg",
    "titles": [
      "Man re-arrested at airport over Manchester synagogue attack",
      "Man rearrested at Manchester airport after synagogue attack detention"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.961,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.654,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A 30-year-old man was rearrested at Manchester Airport by Counter Terrorism Policing on suspicion of failing to disclose information about potential terrorist acts, shortly after his initial release. This arrest is linked to an investigation into the Manchester synagogue attack.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "De Klerk's 84* Guides SA to Thrilling Win Over India in Women's World Cup",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 09 Oct 2025 19:57:22 GMT",
    "source": "BBC",
    "sources": [
      "Sky Sports",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.skysports.com"
    ],
    "snippets": [
      "Nadine de Klerk hits 84 off 54 balls as South Africa recover from 81-5 to chase down their target of 252 with seven balls to spare, securing a famous three wicket win against hosts India at the ICC Women's Cricket World Cup.",
      "Nadine de Klerk hit 84 not out off 54 balls as South Africa stunned hosts India by three wickets at the Women's Cricket World Cup in Visakhapatnam."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/185a/live/b5b5edc0-a549-11f0-92db-77261a15b9d2.jpg",
    "titles": [
      "'A famous victory' - South Africa stun India after De Klerk's heroics",
      "South Africa stun India to win Women's World Cup thriller"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.974,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.65,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Nadine de Klerk scored 84 not out off 54 balls, leading South Africa to a remarkable three-wicket victory over India at the ICC Women's Cricket World Cup. South Africa chased down a target of 252, recovering from 81-5, to win with seven balls remaining in Visakhapatnam.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Luxury Automaker Lowers EV Business Outlook, Misses Analyst Expectations",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Thu, 09 Oct 2025 19:03:00 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Forbes"
    ],
    "domains": [
      "www.forbes.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "Analysts said the targets, which were announced as part of the firm’s Capital Markets Day event, fell short of expectations.",
      "The luxury automaker also scaled back expectations for its new electric vehicle business."
    ],
    "image_url": "",
    "titles": [
      "Ferrari on track for worst trading day ever as guidance disappoints",
      "Ferrari Shares Plunge Toward Worst Day Ever As Guidance Worries Analysts"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.955,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.646,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "During its Capital Markets Day event, the luxury automaker announced targets that analysts deemed below expectations. Additionally, the company revised downwards its expectations for its new electric vehicle business.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Prince William to Represent King at COP30 Climate Summit in Brazil",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 09 Oct 2025 18:49:56 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Prince William will attend the COP30 summit on behalf of the King, joining other world leaders in Brazil.",
      "<p>Prince of Wales’s decision welcomed as a means of drawing attention to the event and galvanising talks</p><p>The Prince of Wales will attend the crunch Cop30 UN climate summit in Brazil next month, the Guardian has learned, but whether the prime minister will go is still to be decided.</p><p>Prin"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/f8ec/live/e1295ad0-a53c-11f0-8303-d57b048c793f.jpg",
    "titles": [
      "Prince William will attend COP30 climate summit in Brazil",
      "Prince William to attend Cop30 UN climate summit in Brazil"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.951,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.645,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Prince William, the Prince of Wales, will represent the King at the COP30 UN climate summit in Brazil, aiming to spotlight and energize the discussions. The decision has been positively received, though it remains unclear if the Prime Minister will also attend.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Israel, Hamas Prepare Ceasefire to End Two-Year Conflict",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Thu, 09 Oct 2025 15:19:25 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "The Guardian"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Hope battles with distrust as Palestinians in Gaza wait for Israel to implement the ceasefire. Here&#039;s what they said.",
      "<p>Israelis and Palestinians share mixed feelings as end to bloody two-year conflict that has killed tens of thousands nears</p><p>Israelis and Palestinians celebrated on Thursday night as Hamas and Israel’s government began preparations to implement a <a href=\"https://www.theguardian.com/world/2025"
    ],
    "image_url": "",
    "titles": [
      "Palestinians in Gaza worry and wait for Israel to implement ceasefire",
      "Joy and anxiety as Hamas and Israel prepare to implement ceasefire deal"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.903,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.643,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Israel and Hamas are preparing to implement a ceasefire, aiming to end a two-year conflict that resulted in tens of thousands of deaths. Both Israelis and Palestinians express a mix of hope and skepticism about the ceasefire's implementation, reflecting the deep-rooted tensions and the heavy toll the conflict has taken. Celebrations occurred as the first steps towards peace were initiated.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "YouTube Offers Second Chance to Banned Channels Amid GOP Criticism",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Thu, 09 Oct 2025 16:00:01 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Ars Technica"
    ],
    "domains": [
      "www.cnbc.com",
      "arstechnica.com"
    ],
    "snippets": [
      "YouTube is rolling out a feature for previously terminated channels to apply to create a new channel after scrutiny from Republicans and President Donald Trump.",
      "YouTube will evaluate each request individually, but copyright violators need not apply."
    ],
    "image_url": "",
    "titles": [
      "YouTube will give banned creators a 'second chance' after rule rollback",
      "YouTube prepares to welcome back banned creators with “second chance” program"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.897,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.634,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "YouTube has introduced a new feature allowing channels that were previously terminated to apply for the opportunity to create a new channel. This decision comes after criticism from Republicans and President Donald Trump. The platform will review each application on a case-by-case basis, explicitly excluding those who have violated copyright laws.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Apple Criticizes Texas Law for Compromising User Privacy",
    "domain": "technology",
    "source_domain": "techcrunch.com",
    "location": "global",
    "published": "Thu, 09 Oct 2025 14:38:58 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch",
      "Ars Technica"
    ],
    "domains": [
      "techcrunch.com",
      "arstechnica.com"
    ],
    "snippets": [
      "Apple speaks out about how the Texas age assurance law was written, saying it affects the privacy of users.",
      "Texas requires sensitive info just to check weather and sports scores, Apple says."
    ],
    "image_url": "",
    "titles": [
      "Apple prepares to comply with Texas age assurance law, but warns of privacy risks",
      "Apple and Google reluctantly comply with Texas age verification law"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.89,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.633,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Apple criticized a new Texas law for compromising user privacy, stating it mandates the collection of sensitive information even for basic tasks like checking weather and sports scores.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "New Peptide Blocks Alpha-Synuclein Misfolding, Aids Parkinson’s Research",
    "domain": "science",
    "source_domain": "www.sciencedaily.com",
    "location": "global",
    "published": "Wed, 08 Oct 2025 23:24:48 EDT",
    "source": "ScienceDaily",
    "sources": [
      "ScienceDaily",
      "SciTechDaily"
    ],
    "domains": [
      "scitechdaily.com",
      "www.sciencedaily.com"
    ],
    "snippets": [
      "Researchers have designed a peptide that prevents the deadly misfolding of alpha-synuclein, the protein behind Parkinson’s and some dementias. In lab and animal tests, it stabilized the protein and improved motor function. The work demonstrates the power of rational drug design in tackling brain dis",
      "<a href=\"https://scitechdaily.com/scientists-discover-food-molecules-that-trick-cells-into-staying-young/\" rel=\"nofollow\" title=\"Scientists Discover Food Molecules That Trick Cells Into Staying Young\"><img alt=\"Energy Vitality Human Health Lifespan\" class=\"webfeedsFeaturedVisual wp-post-image\" heigh"
    ],
    "image_url": "",
    "titles": [
      "Scientists just found a molecule that could stop Parkinson’s in its tracks",
      "Scientists Discover Food Molecules That Trick Cells Into Staying Young"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.704,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.603,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Researchers have developed a peptide that inhibits the harmful misfolding of alpha-synuclein, a protein associated with Parkinson’s disease and some forms of dementia. In laboratory and animal studies, this peptide stabilized the protein and enhanced motor functions, showcasing the potential of rational drug design in addressing neurodegenerative disorders.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]