[
  {
    "title": "Google Won't Sell Chrome, Faces Deal Restrictions After Antitrust Ruling",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Tue, 02 Sep 2025 17:15:23 -0400",
    "source": "NPR",
    "sources": [
      "The Verge",
      "Fortune",
      "Business Insider",
      "Ars Technica",
      "NPR",
      "Forbes"
    ],
    "domains": [
      "www.npr.org",
      "www.theverge.com",
      "fortune.com",
      "www.forbes.com",
      "www.businessinsider.com",
      "arstechnica.com"
    ],
    "snippets": [
      "A federal judge ruled against breaking up Google, but is barring it from making exclusive deals to make its search engine the default on phones and other devices.",
      "Federal prosecutors pushed a judge to force Google to sell its Chrome browser after the company was ruled as a monopolist in court last year.",
      "Google is barred from having exclusive contracts for its search, Chrome, Google Assistant, and Gemini app products, but doesn't have to sell Chrome.",
      "In a 230-page ruling, U.S. District Court Judge Amit Mehta wrote that \"the emergence of generative AI has changed the course of this case.\"",
      "Google will not have to sell its Chrome browser in order to address its illegal monopoly in online search, DC District Court Judge Amit Mehta ruled on Tuesday. Over a year ago, Judge Mehta found that the search giant had violated the Sherman Antitrust Act; his ruling now determines what Google must ",
      "Google's penalty for being a search monopoly does not include selling Chrome."
    ],
    "image_url": "",
    "titles": [
      "In a major antitrust ruling, a judge lets Google keep Chrome but levies other penalties",
      "Judge Allows Google To Keep Chrome But Orders It To Share Search Data With Competitors",
      "Google can keep Chrome &mdash; but it can't have exclusive search deals, judge rules in antitrust case",
      "Federal judge orders Google to end exclusive search distribution deals, but won’t force Google to sell Chrome",
      "Google gets to keep Chrome, judge rules in search antitrust case",
      "Google won’t have to sell Chrome, judge rules"
    ],
    "score_components": {
      "magnitude": 0.986,
      "recency": 0.941,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.858,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A federal judge ruled that Google, previously found to violate the Sherman Antitrust Act, will not have to sell its Chrome browser. However, the company is prohibited from making exclusive deals for its search engine and other products like Chrome, Google Assistant, and the Gemini app on devices. This decision by U.S. District Court Judge Amit Mehta comes after considering the impact of generative AI on the market.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Moves US Space Command HQ to Alabama, Reversing Biden's Decision",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Tue, 02 Sep 2025 16:09:54 -0400",
    "source": "NPR",
    "sources": [
      "The Verge",
      "CityNews",
      "The Guardian",
      "NPR",
      "Axios"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "www.npr.org",
      "www.theverge.com",
      "news.google.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "President Trump announced he intends to move U.S. Space Command headquarters to Huntsville, Ala., after a protracted battle over whether it would stay in Colorado, as former President Joe Biden advocated.",
      "<a href=\"https://news.google.com/rss/articles/CBMimAFBVV95cUxQRm1nU3A1NmxPd3dtaXFVem1FTnFTOWlBa0Q5cml6Zkd1c0V0aExTTFlGS2ZnckNjaDR4c1pXU2JBQmVGQWZEaWVCazlUbGllOTQ3MDZHVDd4TEROMGRzWXplMkJ6bXBBVmN4RGkxWjhTcHFZYUp2S2s5TVdyOVRhYUVGOEpmdlVOVTFCbHRnYWNpRUdpNXN3Sg?oc=5\" target=\"_blank\">Colorado vows to chal",
      "<a href=\"https://news.google.com/rss/articles/CBMihgFBVV95cUxQMWNVQXhmLVhrd01FMmR6aEFoT2FWTFFDZ2RCUWNXaGliencxc1IzQ2lqRUZueUpOeGFodUdQN0Yza04xX3BHdHMya3RCNThWVGRmVWhxSG1KQk9YSVFNa1lLWmNfMHVIMF9OenVnQ200cHQ4bmJ1TkJSUHJIekdqaVhmUzdOdw?oc=5\" target=\"_blank\">Trump will move U.S. Space Command from Color",
      "<p>President says national security operations in space will be based in state he won comfortably, reversing Biden decision</p><p><a href=\"https://www.theguardian.com/us-news/donaldtrump\">Donald Trump</a> made his first public appearance in a week on Tuesday to announce that the US Space Command (Sp",
      "President Donald Trump is moving US Space Command’s headquarters from Colorado to Alabama, he announced during a press conference on Tuesday. The change reverses former President Joe Biden’s 2023 decision to leave it in Colorado Springs, where its temporary headquarters have been established. During",
      "WASHINGTON (AP) — President Donald Trump announced on Tuesday that U.S. Space Command will be located in Alabama, reversing a Biden-era decision to keep it at its temporary headquarters in Colorado. The long-expected decision from Trump caps a four-year tug of war between two states and opposing adm"
    ],
    "image_url": "",
    "titles": [
      "Trump says Space Command will move to Alabama, after long battle over its HQ",
      "Colorado vows to challenge Space Command move to Alabama - Axios",
      "Trump will move U.S. Space Command from Colorado Springs to Alabama - Axios",
      "Trump announces Space Command HQ will switch to Alabama from Colorado",
      "Trump is moving Space Command to Alabama",
      "Trump announces that Space Command is moving from Colorado to Alabama"
    ],
    "score_components": {
      "magnitude": 0.984,
      "recency": 0.92,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.852,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "President Donald Trump announced the relocation of U.S. Space Command headquarters from Colorado to Huntsville, Alabama, reversing a decision by former President Joe Biden to keep it in Colorado Springs. This move concludes a four-year dispute between the two states over the command's location. The announcement was made during Trump's first public appearance in a week.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "U.S. Strike Kills 11 in Caribbean, Escalating Tensions with Venezuela",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Tue, 02 Sep 2025 19:07:53 -0400",
    "source": "NPR",
    "sources": [
      "Washington Post",
      "Axios",
      "The Guardian",
      "NPR"
    ],
    "domains": [
      "www.washingtonpost.com",
      "news.google.com",
      "www.npr.org",
      "www.theguardian.com"
    ],
    "snippets": [
      "President Trump says the U.S. military has struck a drug-laden vessel in the southern Caribbean after it left Venezuela. The strike comes a week after Washington deployed warships to the region.",
      "<a href=\"https://news.google.com/rss/articles/CBMihAFBVV95cUxOQ0xqSVlJTVlxMW85dkY5U1F5LWdYY0phT0l3Q1JEakRJNUNmNl9Od2xDVFdLTVd5VElTV0RSMVQyWmZFdFBMTHhuTksydTVFTUlCdmVqdnBJdHZoOEY0dEF2VzdYbl94LTRLTUVsS1I5dTdfNEhpTWZVX0RRVjRvMWRkdzc?oc=5\" target=\"_blank\">Trump: U.S. killed 11 \"narcoterrorists\" in strik",
      "<p>Trump says ‘we took it out’ referring to the operation in international waters, amid US-Caracas tensions </p><p>The US military has killed 11 drug traffickers from Venezuela during a “a kinetic strike” in the Caribbean Sea, the US president, Donald Trump, has claimed amid growing tensions between",
      "The attack is a dramatic escalation that coincides with the administration’s growing counternarcotics focus and its intensifying feud with the Venezuelan leader, Nicolas Maduro."
    ],
    "image_url": "",
    "titles": [
      "Trump confirms U.S. strike on alleged Venezuelan drug boat",
      "Trump: U.S. killed 11 \"narcoterrorists\" in strike off Venezuela - Axios",
      "US conducts ‘kinetic strike’ against drug boat from Venezuela, killing 11, Trump says",
      "U.S. kills 11 in strike on alleged drug vessel from Venezuela, Trump says"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.978,
      "consensus": 0.908,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.827,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The U.S. military conducted a strike on a drug-laden vessel in the southern Caribbean, killing 11 \"narcoterrorists\" as it left Venezuela, according to President Trump. This action, described by Trump as taking out the vessel in international waters, escalates tensions between the U.S. and Venezuela. It follows the recent deployment of U.S. warships to the region, aligning with the administration's increased focus on counternarcotics efforts and its ongoing feud with Venezuelan leader Nicolas Maduro.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Landslide in Sudan's Darfur Kills 1,000; Sole Survivor Found",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Tue, 02 Sep 2025 11:16:49 -0400",
    "source": "NPR",
    "sources": [
      "Washington Post",
      "New York Times",
      "The Guardian",
      "NPR"
    ],
    "domains": [
      "www.nytimes.com",
      "www.washingtonpost.com",
      "www.npr.org",
      "www.theguardian.com"
    ],
    "snippets": [
      "Up to 1,000 dead after a landslide levels a village in western Sudan, as displaced residents flee famine and war.",
      "<p>Landslide destroyed a village in the Marra mountains area of western Sudan and left only one survivor</p><p>More than 1,000 people have been killed in a landslide in western Sudan, according to a rebel group that controls the area.</p><p>The landslide on Sunday, which followed heavy rain, destroy",
      "A landslide in a remote area of Darfur destroyed an entire village, a rebel group holding the territory said. Heavy rains are hampering rescue efforts.",
      "The landslide leveled a village in the remote Marra mountains, a local rebel group said. Its leader appealed for urgent help, saying, “This is a nightmare.”"
    ],
    "image_url": "",
    "titles": [
      "As many as 1,000 killed in Sudan landslide",
      "Sudan landslide kills at least 1,000 people, rebel group says",
      "Sudan landslide may have killed scores, U.N. says",
      "Landslide Kills Hundreds in Sudan"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.831,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.78,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A landslide in Sudan's Darfur region, caused by heavy rain, destroyed a village in the Marra Mountains, leaving over 1,000 people dead with only one survivor. The Sudan Liberation Movement/Army, which controls the area, has called for international assistance to recover bodies.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "China Hosts Military Parade with Kim Jong-un, Putin to Mark WWII Anniversary",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 02 Sep 2025 18:01:25 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Deutsche Welle",
      "The Guardian",
      "Financial Times"
    ],
    "domains": [
      "www.dw.com",
      "www.ft.com",
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The \"Victory Day\" parade on Wednesday will see Kim rub shoulders with China's Xi Jinping, Russia's Vladimir Putin and others.",
      "China is holding a massive military parade to commemorate 80 years since Japan surrendered at the end of World War Two. North Korea's Kim and Russia's Putin will be at the event hosted by China's Xi. DW has more.",
      "China’s president will stand ‘side by side’ with Russian and North Korean leaders at anniversary of victory over Japan",
      "<p>Slow but specialised form of transport has been used by the reclusive country’s leaders for decades</p><p>North Korea’s leader, Kim Jong-un, has arrived in Beijing on his signature green train to attend <a href=\"https://www.theguardian.com/world/2025/sep/01/china-military-parade-anti-west-leaders"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/fe58/live/24722d60-8802-11f0-9cf6-cbf3e73ce2b9.jpg",
    "titles": [
      "North Korea's Kim arrives in Beijing with daughter to attend massive military parade",
      "China's Xi, to host Putin, Kim at Beijing military parade",
      "Xi to show solidarity with Putin and Kim at lavish Chinese military parade",
      "Kim Jong-un arrives for Beijing military parade on special armoured train"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.861,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.768,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "China is hosting a military parade to mark 80 years since Japan's WWII surrender, attended by leaders including North Korea's Kim Jong-un, who arrived in Beijing by his signature green train, and Russia's Vladimir Putin. The event will showcase unity among the countries, with China's President Xi Jinping standing alongside his counterparts from Russia and North Korea.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump to Expand National Guard in Cities, Move Space Command to Alabama",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Tue, 02 Sep 2025 22:06:19 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Axios",
      "ABC News"
    ],
    "domains": [
      "abcnews.go.com",
      "news.google.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Amid rumours about his health, Trump has announced he will widen his troop deployment and move Space Command to Alabama.",
      "<a href=\"https://news.google.com/rss/articles/CBMiiAFBVV95cUxON0txcXlwbWhyNkJRMHY4eVZTXzZKVWVBZjVEekhxVDBCS19iLXd4UGtVbFE3WGY3TGREbVRWRzlPSVF5ZWFmTGFKLUowZW9lYTRXSlVDVlhZQVpTTzNXUm1GZDBEd2luZzctbGVLNTU2bEI3bTFnMmszWTRnTzFuc0JJNkFYMmpB?oc=5\" target=\"_blank\">\"We're going in\": Trump amps up calls to de",
      "At least eight people have been killed and 58 others injured in shootings across Chicago over Labor Day weekend, according to police.",
      "US President Donald Trump said he will continue deploying National Guard troops in cities such as Chicago and Baltimore."
    ],
    "image_url": "",
    "titles": [
      "‘We’re going in’: Trump doubles down on sending National Guard to Chicago",
      "\"We're going in\": Trump amps up calls to deploy National Guard to Chicago - Axios",
      "58 shot, 8 dead, in Chicago amid Trump's threat to deploy National Guard",
      "Trump vows to deploy National Guard to more US cities"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.958,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.745,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "President Trump announced plans to expand National Guard troop deployments in cities like Chicago and Baltimore and to relocate Space Command to Alabama. This decision comes amid rumors about his health. Meanwhile, Chicago experienced a violent Labor Day weekend, with eight people killed and 58 injured in shootings.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "US Court Orders Google to Share Search Data, Retain Chrome and Android",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 02 Sep 2025 23:51:46 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Deutsche Welle",
      "Financial Post"
    ],
    "domains": [
      "www.dw.com",
      "financialpost.com",
      "www.bbc.com"
    ],
    "snippets": [
      "A case over the US tech giant's dominance in search allows it to hang on to its Chrome web browser.",
      "A US court ruled the company must share certain information with rival companies to increase competition. Google said the move could result in its rivals having access to its technology.",
      "Allowed to keep Chrome internet browser and Android operating system but will be required to share certain search data with competitors"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/8012/live/a82ab280-7ebb-11f0-83cc-c5da98c419b8.jpg",
    "titles": [
      "Google avoids break-up but must share data with rivals",
      "Google must share search data with competitors, judge rules",
      "Google avoids breakup but faces other sanctions in monopoly case ruling"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.973,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.738,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A US court has ruled that Google must share specific search data with its competitors to boost competition, while allowing the tech giant to retain its Chrome web browser and Android operating system. Google expressed concerns that this decision might lead to rivals accessing its technology.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Alcaraz Advances to US Open Semi-Finals, Dominates Lehecka",
    "domain": "sports",
    "source_domain": "www.nydailynews.com",
    "location": "national",
    "published": "Tue, 02 Sep 2025 23:38:00 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Sky Sports",
      "The Guardian",
      "Yahoo Sports"
    ],
    "domains": [
      "www.nydailynews.com",
      "www.theguardian.com",
      "www.skysports.com"
    ],
    "snippets": [
      "NEW YORK — Carlos Alcaraz placed a finger behind his ear and gazed upward at an astonished Arthur Ashe Stadium crowd. The Spanish superstar had just capped a 21-shot rally against Jiri Lehecka with an incredible backhand winner, making a full-extension stretch to tap the ball over the net and well o",
      "<ul><li><p>Spaniard cruises to emphatic 6-4, 6-2, 6-4 victory</p></li><li><p>Alcaraz reaches last four without dropping a set</p></li></ul><p>It took just seven minutes for Carlos Alcaraz to recognise that he was having another one of those days where he could do whatever he wanted with a tennis bal",
      "Carlos Alcaraz is through to the semi-finals of the US Open after a clinical 6-4 6-2 6-4 victory over&#160;Jiri Lehecka at Arthur Ashe Stadium in New York."
    ],
    "image_url": "",
    "titles": [
      "Carlos Alcaraz rolls into US Open semifinals with highlight-filled victory over Jiri Lehecka",
      "Alcaraz finds dominant best to march past Lehecka and into US Open semi-finals",
      "Alcaraz clinically dispatches Lehecka to make US Open semi-finals"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.989,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.735,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Carlos Alcaraz advanced to the semi-finals of the US Open with a decisive 6-4, 6-2, 6-4 win against Jiri Lehecka at Arthur Ashe Stadium in New York. Demonstrating exceptional skill, Alcaraz impressed the crowd with a stunning backhand winner during a 21-shot rally. He reached the last four without dropping a set, showcasing his dominance in the tournament.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Anthropic Valued at $183B After $13B Series F Funding",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Tue, 02 Sep 2025 16:41:15 GMT",
    "source": "Axios",
    "sources": [
      "CNBC",
      "Axios",
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com",
      "news.google.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMibkFVX3lxTE5EWGgwNmNLRHpIRE1waER3LXVfenZzTllfN0dXZFZJR1owOTJPM3NINTUwZlZRV2NsMkUzSnRXbjRkZ18wMWhfSGZyN2pPTW1BdHNWWnI2YXF2ZmNSMG5QdjU4b0djOGtCUzZabUF3?oc=5\" target=\"_blank\">Anthropic now valued at $183 billion as AI race heats up</a>&nbsp;&nbsp;<font c",
      "Anthropic's valuation has tripled since its last funding round in March",
      "AI firm Anthropic's $13 billion Series F round will be used to grow its enterprise adoption, deepen safety research, and support international expansion."
    ],
    "image_url": "",
    "titles": [
      "Anthropic now valued at $183 billion as AI race heats up - Axios",
      "Anthropic raises $13 billion funding round at $183 billion valuation",
      "Anthropic raises $13B Series F at $183B valuation"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.838,
      "consensus": 0.789,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.724,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Anthropic, an AI company, has seen its valuation reach $183 billion following a $13 billion Series F funding round. The funds will be utilized for expanding its enterprise adoption, enhancing safety research, and supporting its growth internationally. This marks a significant increase in valuation since its last funding round in March.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: research, support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Chris Froome Hospitalized After Training Crash in France",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 02 Sep 2025 16:47:41 GMT",
    "source": "BBC",
    "sources": [
      "Sky Sports",
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "www.skysports.com",
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Chris Froome's wife says the four-time Tour de France winner suffered a life-threatening injury to his heart in last week's bike crash in southern France.",
      "<ul><li><p>Tour de France winner left with a pericardial rupture</p></li><li><p>Kooij wins opening stage of 2025 men’s Tour of Britain</p></li></ul><p>Chris Froome sustained a life-threatening injury to his heart in the training crash in France last week that left him in hospital with a broken back ",
      "Four-time Tour de France champion Chris Froome suffered a life-threatening heart injury during last week's training accident, according to his wife Michelle."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/2b8a/live/b1525470-881c-11f0-9c95-4f9ad5a1a24f.jpg",
    "titles": [
      "Froome suffered life-threatening heart injury in crash",
      "Chris Froome sustained life-threatening injury to his heart in training crash",
      "Froome sustained 'life-threatening heart injury' after 'serious' crash"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.84,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.712,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Chris Froome, a four-time Tour de France champion, suffered a life-threatening heart injury and a broken back during a training crash in southern France last week. His condition resulted in hospitalization, as confirmed by his wife, Michelle.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Gérard Depardieu to Stand Trial for 2018 Rape Charges",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-09-02T11:33:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "New York Times",
      "The Guardian"
    ],
    "domains": [
      "www.dw.com",
      "www.nytimes.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "The French film star is accused of raping and sexually assaulting actor Charlotte Arnould in 2018.",
      "The actress Charlotte Arnould has accused the French movie icon of raping her twice in 2018 at his home in Paris. He denies wrongdoing.",
      "<p>Judge orders case to be heard against French film star after allegations made by Charlotte Arnould about 2018 incidents</p><p>The French actor <a href=\"https://www.theguardian.com/film/gerard-depardieu\">Gérard Depardieu</a> has been ordered to stand trial on charges of raping and sexually assault"
    ],
    "image_url": "",
    "titles": [
      "Gerard Depardieu ordered to stand trial for rape — lawyer",
      "Gérard Depardieu Is Ordered to Stand Trial Over Rape Accusations",
      "Depardieu to stand trial over alleged rape and sexual assault of fellow actor"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.769,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.691,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "French actor Gérard Depardieu has been ordered to stand trial on charges of raping and sexually assaulting Charlotte Arnould in 2018 at his Paris home. Arnould, who has publicly accused Depardieu of raping her twice, expressed relief at the decision. Depardieu denies any wrongdoing.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Judge Rules Trump's National Guard Deployment in LA Illegal",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Tue, 02 Sep 2025 10:22:15 -0400",
    "source": "NPR",
    "sources": [
      "Financial Times",
      "NPR"
    ],
    "domains": [
      "www.ft.com",
      "www.npr.org"
    ],
    "snippets": [
      "President Trump took control of the state's National Guard in June and deployed it to Los Angeles to face anti-immigration protestors and assist officers making detentions and deportations.",
      "Ruling says government violated legislation banning US military from enforcing domestic law"
    ],
    "image_url": "",
    "titles": [
      "A California judge rules that Trump's deployment of the guard to LA was illegal",
      "Judge blocks Trump’s deployment of the National Guard in California"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.815,
      "consensus": 0.591,
      "constructiveness": 0.2,
      "proximity": 0.75
    },
    "score": 0.67,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "In June, President Trump deployed the state's National Guard to Los Angeles to address anti-immigration protests and support detainment and deportation efforts. US District Judge Charles Breyer ruled this action illegal, stating it violated laws preventing US military from engaging in domestic law enforcement. Breyer challenged Trump's classification of the protests as a 'rebellion.'",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: effort, support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Toronto Maple Leafs Extend Goalie Hildeby's Contract for 3 Years",
    "domain": "sports",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Tue, 02 Sep 2025 15:42:31 GMT",
    "source": "NHL",
    "sources": [
      "Sportsnet",
      "NHL"
    ],
    "domains": [
      "www.sportsnet.ca",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMihAFBVV95cUxOcFlMWllQV2ROcEVyNnVGZDZ1YzdIMk1pejVCY3lJTVdSbmNSS29Yd0VzN0pDbWxQRGNpeTVBRDdKQ2N2TFFZc1k5Z3djOUVHSHZVSnZmV1B4UngzampZNG5RT3VEQXIzSzhDZkcwUUEzT1RCdi15RmZhZkNZY3RwWE1HcTA?oc=5\" target=\"_blank\">Maple Leafs Sign Goaltender Dennis Hildeby | Tor",
      "<p>Toronto Maple Leafs goalie Dennis Hildeby agreed to a three-year, $2.525 million contract extension, the team announced on Tuesday.</p>"
    ],
    "image_url": "",
    "titles": [
      "Maple Leafs Sign Goaltender Dennis Hildeby | Toronto Maple Leafs - NHL.com",
      "Maple Leafs sign goalie Dennis Hildeby to three-year contract extension"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.821,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.669,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Toronto Maple Leafs signed goaltender Dennis Hildeby to a three-year, $2.525 million contract extension. The deal was announced on Tuesday, securing Hildeby's future with the team.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Diamondbacks' Gurriel Jr. Injured, Carted Off Field Against Rangers",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 2 Sep 2025 12:18:06 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "All of the important fantasy spin and actionable takeaways resulting from the latest baseball news.",
      "<p>The Arizona Diamondbacks got some bad news after Lourdes Gurriel Jr. had to be carted off in the sixth inning of Monday&#8217;s game against the Texas Rangers.</p>"
    ],
    "image_url": "",
    "titles": [
      "Diamondbacks lose Gurriel; A's still waiting on Kurtz",
      "Diamondbacks’ Lourdes Gurriel Jr. diagnosed with torn ACL"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.849,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.667,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Lourdes Gurriel Jr. of the Arizona Diamondbacks was carted off the field during the sixth inning of a game against the Texas Rangers due to an injury. This development is significant for the team and could impact fantasy baseball decisions.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Belichick's NC Team Faces Major Loss in Season Opener Against TCU",
    "domain": "sports",
    "source_domain": "www.nbcsports.com",
    "location": "national",
    "published": "Tue, 02 Sep 2025 23:25:40 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Sports Illustrated",
      "Yahoo Sports"
    ],
    "domains": [
      "www.nbcsports.com",
      "news.google.com"
    ],
    "snippets": [
      "Patriots coach Mike Vrabel speaks his mind.",
      "<a href=\"https://news.google.com/rss/articles/CBMikAFBVV95cUxPUDZwT3J2ZkYtNmxuN0pqRE1FVEE2YTRnTVJvdjBObjYtRUVNWlEtbGctRFYzRnhQZGJpb3BnaFdGc2FwbTI5ZmFoZFdQZXpZalhmaElNeXNuVlZGSXF6S2UtVlhVVXJWUDBDM1RjTjg2VFFDc0VjX3RZblE0TExEeHllYTRyVzhQNkhsclZEdm0?oc=5\" target=\"_blank\">National reaction after Bill Bel",
      "<a href=\"https://news.google.com/rss/articles/CBMiggFBVV95cUxOS3B6V2cyQ2NnQXpmSHBNeVJBamRsVjFaUVRTVVlxT1FGVWdoYUw4R1dtemprd2E3UTktYzBsV25mUC1OYVZkRzY5eVoyQUhuZVNIWW1VYXN6RjltV2dIOVlYQi1fd1lOSG9qSTBIdFdnZFRRTUtxVzB1VHowX0thVGxR?oc=5\" target=\"_blank\">SP+ Predicts BYU Football vs Stanford</a>&nbsp;&nbs"
    ],
    "image_url": "",
    "titles": [
      "Mike Vrabel has a thought on Bill Belichick's college-football debut",
      "National reaction after Bill Belichick's shocking college football debut - Sports Illustrated",
      "SP+ Predicts BYU Football vs Stanford - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.984,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.659,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Bill Belichick's North Carolina team suffered a significant defeat to TCU in what was described as one of the program's worst season openers. The loss prompted a wide range of reactions and commentary across social media, highlighting the unexpected and disappointing performance of Belichick's squad.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "NAO Unable to Confirm Defence Ministry's £850M Immigration Scheme Cost",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 02 Sep 2025 23:56:06 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Financial Times"
    ],
    "domains": [
      "www.ft.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The National Audit Office says it has not been given enough information to have \"confidence\" a relocation scheme cost £850m.",
      "Defence ministry has not demonstrated that an immigration scheme would have a £850mn price tag, NAO finds"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/b7f2/live/7a4a1370-8833-11f0-9e1d-1123d58de035.png",
    "titles": [
      "Government unable to calculate Afghan data breach cost, watchdog says",
      "UK does not know exact cost of Afghan data breach, watchdog says"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.974,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.65,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The National Audit Office (NAO) reported that it lacks sufficient information to confirm the Defence Ministry's claim that an immigration relocation scheme would cost £850 million.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Google Can Keep Chrome, Must End Exclusive Search Deals: Court Ruling",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Tue, 02 Sep 2025 23:38:35 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "MarketWatch"
    ],
    "domains": [
      "www.marketwatch.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "The ruling comes nearly a year after a U.S. judge ruled that Google holds an illegal monopoly in its core market of internet search.",
      "Google can keep its Chrome browser and continue to enter in revenue-sharing agreements for Apple, but must end exclusive contracts in search and some other businesses."
    ],
    "image_url": "",
    "titles": [
      "Google stock jumps 8% after search giant avoids worst-case penalties in antitrust case",
      "Alphabet and Apple stocks rally after Google antitrust ruling avoids the worst-case scenario"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.968,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.649,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Nearly a year after a U.S. judge found Google had an illegal monopoly in internet search, a new ruling allows Google to retain its Chrome browser and maintain revenue-sharing deals with Apple. However, Google is required to cease exclusive contracts in search and certain other sectors.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Sabalenka Advances to US Open Semis as Vondrousova Withdraws",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 02 Sep 2025 22:37:35 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.bbc.com"
    ],
    "snippets": [
      "Aryna Sabalenka moves into the US Open semi-finals after Marketa Vondrousova withdraws injured - setting up a repeat of last year's final against Jessica Pegula.",
      "<p>Defending champion Aryna Sabalenka got back to the U.S. Open semifinals without hitting a ball on Tuesday when her opponent in the quarterfinals, Marketa Vondrousova, withdrew from their match with an injury.</p>"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/9204/live/9c878980-8843-11f0-8085-3d0f0c8540e1.jpg",
    "titles": [
      "Sabalenka to face Pegula after Vondrousova withdraws",
      "Sabalenka advances to US Open semis after Vondrousova withdraws with injury"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.948,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.645,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Aryna Sabalenka advanced to the U.S. Open semi-finals without playing, as her opponent Marketa Vondrousova withdrew due to injury. Sabalenka, the defending champion, is set to face Jessica Pegula, repeating last year's final matchup.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Calgary Flames Name Dave Lowry New Assistant Coach",
    "domain": "sports",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Tue, 02 Sep 2025 19:00:34 GMT",
    "source": "NHL",
    "sources": [
      "Sportsnet",
      "NHL"
    ],
    "domains": [
      "www.sportsnet.ca",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMihgFBVV95cUxOUE1Vby1LSjlkMFRtcG9nbUxnTnBkZFdEbkgtRUlxM2RLNDliczVuRS1hemVOMU5CMzJ1dFV0ODNjbVFZN0o1dG93NnlRREFCak4yc3p0aWg0Wi1VdHI3R3VfT3BUcFctb3ItRmVJNjBNNmtWTWVzX09VeGRUX2FiWWNGb3E4Zw?oc=5\" target=\"_blank\">Flames Name Dave Lowry Assistant Coach</a>&nb",
      "<p>There will be a new face on the Calgary Flames bench this season.</p>"
    ],
    "image_url": "",
    "titles": [
      "Flames Name Dave Lowry Assistant Coach - NHL.com",
      "Flames hire Dave Lowry as assistant coach, replacing Brad Larsen"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.879,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.641,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Calgary Flames have appointed Dave Lowry as their new assistant coach for the upcoming season. Lowry will join the team's coaching staff, bringing his experience and expertise to support the Flames in their future games.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Starbucks to Add Protein-Rich Options for Health-Conscious Customers",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Tue, 02 Sep 2025 17:27:16 GMT",
    "source": "Axios",
    "sources": [
      "CNBC",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMikAFBVV95cUxObGZ4RFpMUmhZd1YwRVF2UUFjTWJCSmRuZElMZHc0dEFfUlRWT3kxcllmWDg0WjhKb3pySTRiQ25ZTV8wZnRpeElaRWViN19sczJtT0NiTmhWVXRLUFhsMTMwcWNROFFid0JPa18zdmkwSFpDZGhjNFp6U3BMeXg0alFLaGs1TW1odDA3UVpuV0I?oc=5\" target=\"_blank\">Starbucks to launch protein latt",
      "The coffee chain is trying to appeal to customers who want to add more protein to their diets."
    ],
    "image_url": "",
    "titles": [
      "Starbucks to launch protein lattes on National Coffee Day - Axios",
      "Starbucks to launch protein-packed cold foam, lattes later this month"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.851,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.635,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Starbucks announced plans to introduce protein-laden options to its menu, targeting customers seeking to increase their dietary protein intake. This move aims to broaden the coffee chain's appeal by catering to health-conscious consumers.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Federal Judge Rules National Guard's ICE Raid Involvement in LA Illegal",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Tue, 02 Sep 2025 17:48:45 GMT",
    "source": "Axios",
    "sources": [
      "CNBC",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMib0FVX3lxTE8zaHF1QU9SMnFGeFR6bENuTDBOYW02SFFMU3kyRUJQVzRpSUIwYnVZa3hFMjRDVjdqX0ZVQ1lEbElDVEtzQ083WHZOcU5qRG9wZmhCU0xpay1Kcjh1YnQ4THc1X0hGRThpZzlfQ2ZGVQ?oc=5\" target=\"_blank\">National Guard illegally performed law enforcement in LA, judge rules</a>&nbs",
      "The ruling from federal Judge Charles Breyer in San Francisco comes as President Trump mulls deploying National Guard troops to Chicago and other cities."
    ],
    "image_url": "",
    "titles": [
      "National Guard illegally performed law enforcement in LA, judge rules - Axios",
      "Trump can’t use National Guard, military in California to enforce laws, Judge Breyer rules"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.858,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.634,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A federal judge in San Francisco, Charles Breyer, ruled that the National Guard's involvement in law enforcement activities in Los Angeles, specifically accompanying ICE agents on immigration raids, was illegal under federal law. This decision comes amid considerations by the Trump administration to deploy National Guard troops to various cities to address crime.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Jaxson Dart Named Giants' Backup QB After Pre-Season Success",
    "domain": "sports",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Tue, 02 Sep 2025 16:47:43 GMT",
    "source": "Sports Illustrated",
    "sources": [
      "Sports Illustrated",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMicEFVX3lxTE11S29vZkdKd2U5RnR6b1JOWTB1eFA1UW5RYThqSUFfa0ZWMTU0c05aSWt6WU1ncUZ4VXQ2SDgtZ19hb0VyaDdUcURtYW1PUkV6LUxzNXF0cWluY1RtYmQxM00zdlpCWFdGUS1MdzkzYi0?oc=5\" target=\"_blank\">Giants Make Decision on Backup QB to Russell Wilson Ahead of Week 1</a>&nbsp",
      "<p>Jaxson Dart&#8217;s impressive pre-season has earned him the backup job with the New York Giants.</p>"
    ],
    "image_url": "",
    "titles": [
      "Giants Make Decision on Backup QB to Russell Wilson Ahead of Week 1 - Sports Illustrated",
      "Giants list Jaxson Dart as backup to Russell Wilson"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.84,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.633,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Jaxson Dart has been named the backup quarterback for the New York Giants following his strong performance in the pre-season. He will support starting quarterback Russell Wilson as the team prepares for Week 1.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Musk: 80% of Tesla's Future Value in Optimus Robots",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Tue, 02 Sep 2025 18:11:15 GMT",
    "source": "Axios",
    "sources": [
      "CNBC",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMiYEFVX3lxTE8yaDlpUGc3RFFFRWgxazBGQlhZOXBaN2FQdzlNTGJxLWNQZFpUTnIwcVdKUUhGejdHdktFalpfLXBYWDhGQmx5a0g5Y2d6U0NUTUR5VFNvaWlNVGlCOUE1bw?oc=5\" target=\"_blank\">Musk: 80% of Tesla value will be Optimus robots</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Axios</font>",
      "Tesla CEO Elon Musk said on X that about 80% of his automaker's value will come from Optimus humanoid robots, which have yet to hit the market."
    ],
    "image_url": "",
    "titles": [
      "Musk: 80% of Tesla value will be Optimus robots - Axios",
      "Musk looks past Tesla sales slump, says 80% of value will come from Optimus"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.864,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.628,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Elon Musk stated on X that he anticipates approximately 80% of Tesla's future value will be derived from its yet-to-be-released Optimus humanoid robots, signaling a significant shift in the company's valuation focus.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Ohtani Hits 100th Homer at 120 mph; Kershaw to Pitch in Dodgers-Pirates Series",
    "domain": "sports",
    "source_domain": "www.sportsnet.ca",
    "location": "national",
    "published": "Tue, 02 Sep 2025 19:57:18 EDT",
    "source": "Sportsnet",
    "sources": [
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "app"
    ],
    "snippets": [
      "<p>Watch as Los Angeles Dodgers&#8217; Shohei Ohtani hits his 100th homer since joining the club vs. the Pittsburgh Pirates at a scorching 120 m.p.h. cutting into the lead. </p>",
      "<p>Clayton Kershaw takes the mound as the Los Angeles Dodgers open a three-game series against the Pittsburgh Pirates on Tuesday. Live coverage on Sportsnet and Sportsnet+ begins at 6:30 p.m. ET / 3:30 p.m. PT, or follow along with our live tracker.</p>"
    ],
    "image_url": "https://www.sportsnet.ca/wp-content/uploads/2025/09/6378220825112.jpg",
    "titles": [
      "Ohtani crushes his 100th home run in a Dodgers uniform vs. Pirates",
      "MLB on Sportsnet: Dodgers vs. Pirates"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.995,
      "consensus": 0.37,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.472,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Shohei Ohtani hit his 100th homer with the Los Angeles Dodgers at a speed of 120 mph against the Pittsburgh Pirates. Meanwhile, Clayton Kershaw is set to pitch in the opening of a three-game series between the Dodgers and the Pirates, with live coverage starting at 6:30 p.m. ET / 3:30 p.m. PT on Sportsnet and Sportsnet+.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]