[
  {
    "title": "France plans to stop kids under 15 using social media",
    "domain": "politics",
    "source_domain": "dw.com",
    "location": "global",
    "published": "2025-12-31T18:31:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "Reuters",
      "New York Times",
      "SCMP",
      "The Guardian"
    ],
    "domains": [
      "dw.com",
      "news.google.com",
      "nytimes.com",
      "scmp.com",
      "theguardian.com"
    ],
    "snippets": [
      "After Australia's world-first social-media ban for minors, France has drafted a similar law to block under-15s from major platforms, which could take effect from September.",
      "France aims to ban under-15s from social media from September 2026, Le Monde reports Reuters",
      "French lawmakers are expected next month to discuss a ban on social media for children. In his New Year’s Eve address, the French president restated his support for restricting their access.",
      "France will make a fresh attempt to protect children from excessive screen time, proposing a ban on social media access for children under 15 by next September, according to a draft law seen by Agence France-Presse. The initiative is backed by French President Emmanuel Macron, who said earlier this",
      "Draft bill to be submitted for legal checks as France aims to follow Australia’s world-first ban on platforms including Facebook, Snapchat and YouTube France intends to follow Australia and ban social media platforms for children from the start of the 2026 academic year. A draft bill preventing unde"
    ],
    "image_url": "",
    "titles": [
      "France plans social media ban for children under 15: reports",
      "France aims to ban under-15s from social media from September 2026, Le Monde reports - Reuters",
      "Emmanuel Macron Backs Social Media Restrictions for Children",
      "France plans social media ban for children under 15",
      "France targets Australia-style social media ban for children next year"
    ],
    "url": "https://www.dw.com/en/france-plans-social-media-ban-for-children-under-15-reports/a-75352145?maca=en-rss-en-top-1022-rdf",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMisgFBVV95cUxNZFgwUEdaVDdXc1Nub3NwNEpaMDBNc1NtSFkwbFVrbWJ6NzdvS1lWMFRMZ3FidnZOeHBxWVlMU0FpTERRakZvbWVoekdNQXBqbUhpY0NBOUlUZ0M2V3g1S1ZXdWNOMnR1TUMxUU9YOENvaWJuemlZU0swM0RqWDQtcWdiVWVHMGc1T2dpUmdUUzA3WW01VVBqdlItZ0ZQamNWNHlERTU3QUtSZkc0YkF2WGFB?oc=5",
      "https://www.nytimes.com/2025/12/31/world/europe/macron-social-media-children-ban-france.html",
      "https://www.scmp.com/news/world/europe/article/3338346/france-plans-social-media-ban-children-under-15?utm_source=rss_feed",
      "https://www.theguardian.com/world/2025/dec/31/france-plans-social-media-ban-for-under-15s-from-september-2026"
    ],
    "location_scope": "global",
    "link": "https://www.dw.com/en/france-plans-social-media-ban-for-children-under-15-reports/a-75352145?maca=en-rss-en-top-1022-rdf",
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.927,
      "consensus": 0.995,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.88,
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story is constructive as it provides awareness about a new policy in France aimed at protecting children. However, it lacks depth in terms of the reasons behind the policy and its potential impacts.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "France has drafted a law to ban children under 15 from accessing major social media platforms, aiming for the ban to take effect from September 2026. The initiative, supported by President Emmanuel Macron, will be discussed by lawmakers next month and undergo legal checks. The proposed law follows Australia’s earlier implementation of a similar ban.",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "Canada names 25 players for 2026 Olympic hockey team",
    "domain": "sports",
    "source_domain": "cbssports.com",
    "location": "national",
    "published": "Wed, 31 Dec 2025 17:47:53 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Global News",
      "Sportsnet",
      "NHL"
    ],
    "domains": [
      "cbssports.com",
      "globalnews.ca",
      "sportsnet.ca",
      "news.google.com"
    ],
    "snippets": [
      "The Canadians will be as loaded as ever when the Olympics come to Italy",
      "Hockey Canada unveiled its 25-player Olympic men's hockey roster for February's Milan Cortina Games on Wednesday.",
      "Now that the Canadian Olympic men’s hockey roster has been revealed, let the second guessing begin. The country has more than enough candidates to form a formidable B team.",
      "Canada has its Olympic men’s hockey team for Milano Cortina 2026. Hockey Canada unveiled its 25-player roster in Minnesota on Wednesday, more than a month ahead of the team’s first game on Feb. 12 against Czechia. Canada named its first six players in June (marked with *) before completing the list on New Year’s Eve. Goalies Jordan Binnington (St. Louis Blues) Darcy Kuemper (Los Angeles Kings) Logan Thompson (Washington Capitals) Forwards * Connor McDavid (Edmonton Oilers) * Sidney Crosby (Pittsburgh Penguins) * Nathan MacKinnon (Colorado Avalanche) * Brayden Point (Tampa Bay Lightning) * Sam...",
      "Hockey Canada unveiled its 25-player Olympic men’s hockey roster for February’s Milan Cortina Games on Wednesday.",
      "Team Canada hockey roster for 2026 Winter Olympics at a glance NHL.com",
      "Team Canada roster for 2026 Winter Olympics includes Celebrini, Horvat NHL.com"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/12/29/4b4aa67d-6472-4587-8c0e-dbccc297f803/gettyimages-2143885786-2.jpg",
    "titles": [
      "Team Canada 2026 Olympic hockey roster: Connor McDavid, Nathan MacKinnon join forces to lead favorites",
      "Hockey Canada unveils Olympic men’s hockey roster",
      "What would a Canadian Olympic men’s hockey B team look like?",
      "Canada names Olympic men’s hockey roster",
      "Team Canada men’s hockey lineup unveiled for 2026 Winter Olympics",
      "Team Canada hockey roster for 2026 Winter Olympics at a glance - NHL.com",
      "Team Canada roster for 2026 Winter Olympics includes Celebrini, Horvat - NHL.com"
    ],
    "url": "https://www.cbssports.com/nhl/news/team-canada-2026-olympic-hockey-roster/",
    "alternate_urls": [
      "https://globalnews.ca/news/11595415/hockey-canada-unveils-olympic-mens-hockey-roster/",
      "https://globalnews.ca/news/11595410/team-canada-mens-hockey-lineup-2026/",
      "https://news.google.com/rss/articles/CBMigAFBVV95cUxORnVHOVFST0lCR0lCeElvMzVnOEEySGZPOUhCb05tN2VIcWhzbUFzNHFSUk1fMzlxVHNTcEtQS3VzRXpjeVFTSWlQQjUtRWQ4Qy03eGxQZzF1eFRLcjNHNE92N2s0ODh4eEg0dVd4bFZORmZNbGpmOUNpSnZZQ0F2dw?oc=5",
      "https://news.google.com/rss/articles/CBMicEFVX3lxTE1DcEZIYkJpZFpVMVdZYnVHQWFYT0c5aWN1YWJYTTVPWllSVlpENktkYTk2ek1PU0JrMjdBQzZFbDI2SWNIUlhhR0FiOWVDQ2NkeUxfbnVCN3FBbWViQmtUNWpFTDBfWDhWanpFUkMwZlY?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.cbssports.com/nhl/news/team-canada-2026-olympic-hockey-roster/",
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.909,
      "consensus": 0.908,
      "constructiveness": 0.5,
      "proximity": 1.0
    },
    "score": 0.872,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about the composition of Team Canada for the 2026 Olympics. However, it does not delve into any deeper insights or provide any actionable information.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Hockey Canada announced its 25-player men's hockey roster for the 2026 Winter Olympics in Milan Cortina on Wednesday. The roster includes goalies Jordan Binnington, Darcy Kuemper, and Logan Thompson, as well as forwards Connor McDavid, Sidney Crosby, Nathan MacKinnon, Brayden Point, and others. Canada’s first game is scheduled for February 12 against Czechia.",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "Christian Barmore charged with assault after August incident",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Wed, 31 Dec 2025 14:53:03 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Yahoo Sports",
      "Sports Illustrated",
      "CBS Sports"
    ],
    "domains": [
      "espn.com",
      "sports.yahoo.com",
      "news.google.com",
      "cbssports.com"
    ],
    "snippets": [
      "Patriots defensive tackle Christian Barmore is facing a misdemeanor charge of assault and battery on a household/family member stemming from an August incident, according to court documents.",
      "The charge of misdemeanor assault and battery on a household or family member was filed against the 26-year-old on December 16.",
      "New England Patriots defensive lineman Christian J. Barmore is facing a domestic assault and battery charge after his girlfriend told police he threw her to the ground in August at his home outside Boston. A criminal complaint issued Dec. 18 claims Barmore, 26, briefly took the woman's phone, threw",
      "Patriots DT Christian Barmore Facing Domestic Assault Charge Sports Illustrated",
      "Christian Barmore is set to be arraigned just before the Super Bowl.",
      "Patriots lineman Christian Barmore faces a domestic assault charge, one day after similar allegations surfaced against receiver Stefon Diggs.",
      "Barmore is the second standout New England player to face criminal charges in the past two days"
    ],
    "image_url": "",
    "titles": [
      "Pats' Barmore facing assault and battery charge",
      "Patriots defensive tackle Christian Barmore facing domestic assault charge",
      "Patriots defensive lineman Christian Barmore accused of throwing girlfriend to the ground",
      "Patriots DT Christian Barmore Facing Domestic Assault Charge - Sports Illustrated",
      "Patriots DT Christian Barmore reportedly facing domestic-assault charge",
      "Patriots defensive lineman Christian Barmore accused of domestic assault",
      "Patriots 'aware' of Christian Barmore's domestic assault charge"
    ],
    "url": "https://www.espn.com/nfl/story/_/id/47463660/patriots-christian-barmore-facing-assault-battery-charge",
    "alternate_urls": [
      "https://sports.yahoo.com/articles/patriots-defensive-tackle-christian-barmore-173500992.html",
      "https://sports.yahoo.com/articles/patriots-defensive-lineman-christian-barmore-194837648.html",
      "https://news.google.com/rss/articles/CBMihwFBVV95cUxPY2lWZFQ1MGZSQTE0djh4djAwYjFwOWEzVFRyQmhqejBVNDRPaGRlOEU1dkpsNkoyTk9xMGdHeWRya3JlN1RCdElIakRBamszX3E2T2dVRThLU2JOMVFSWF96T0o4M29UNUM4Zk1mcG1qRlBHeXA2czctM3VQY0lHQklDTTh1OTg?oc=5",
      "https://sports.yahoo.com/nfl/breaking-news/article/patriots-dt-christian-barmore-reportedly-facing-domestic-assault-charge-170355443.html",
      "https://sports.yahoo.com/articles/patriots-defensive-lineman-christian-barmore-123309727.html",
      "https://www.cbssports.com/nfl/news/christian-barmore-domestic-assault-charge-patriots/"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/nfl/story/_/id/47463660/patriots-christian-barmore-facing-assault-battery-charge",
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.963,
      "consensus": 0.908,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.843,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about a legal issue involving a professional athlete. However, it lacks depth or insight into the circumstances surrounding the charge, the potential impacts on the team, or broader societal implications.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "New England Patriots defensive lineman Christian Barmore, 26, has been charged with misdemeanor assault and battery on a household or family member related to an August incident involving his girlfriend. The charge was filed in December 2025, and Barmore is scheduled to be arraigned just before the Super Bowl.",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "Finland stops ship and arrests crew after cable damage in sea",
    "domain": "business",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Wed, 31 Dec 2025 19:41:42 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Deutsche Welle",
      "BBC",
      "Reuters",
      "The Guardian",
      "Bloomberg"
    ],
    "domains": [
      "aljazeera.com",
      "dw.com",
      "bbc.com",
      "news.google.com",
      "theguardian.com"
    ],
    "snippets": [
      "New telecommunications cable damage discovered in Finland's exclusive economic zone.",
      "European countries are on high alert following a series of suspected sabotage attacks on underwater cables and pipelines.",
      "Police arrested 14 crew members on the ship sailing from the St Petersburg to the Israeli port of Haifa.",
      "Finland seizes ship sailing from Russia after suspected cable sabotage in Baltic Sea Reuters",
      "Border guards say they found ship with anchor lowered into sea after detection of fault in Helsinki-Tallinn telecoms link Finnish authorities have boarded and seized a cargo vessel sailing from Russia on suspicion of sabotaging two underwater telecommunications cables in the Baltic Sea, where a seri",
      "Finland Takes Control of Ship Suspected of Undersea Cable Damage Bloomberg.com"
    ],
    "image_url": "",
    "titles": [
      "Finland seizes ship sailing from Russia after suspected cable sabotage",
      "Finland seizes vessel suspected of damaging undersea cable",
      "Finnish police seize ship suspected of sabotaging undersea cable",
      "Finland seizes ship sailing from Russia after suspected cable sabotage in Baltic Sea - Reuters",
      "Finnish police seize vessel suspected of damaging underwater cable",
      "Finland Takes Control of Ship Suspected of Undersea Cable Damage - Bloomberg.com"
    ],
    "url": "https://www.aljazeera.com/news/2025/12/31/police-investigating-damage-to-undersea-telecom-cable-in-gulf-of-finland?traffic_source=rss",
    "alternate_urls": [
      "https://www.dw.com/en/finland-seizes-vessel-suspected-of-damaging-undersea-cable/a-75349419?maca=en-rss-en-top-1022-rdf",
      "https://www.bbc.com/news/articles/c62040np372o?at_medium=RSS&at_campaign=rss",
      "https://news.google.com/rss/articles/CBMirAFBVV95cUxPZGRHRHlON0U2dHMxd3VTSGIxR3lwa2dvM1dHdTU3UWJGUVZOMjJOM09BbEFBaUt4YXdselB1N3RKZkRCSzVYZXhPOTZvRXhpejZqdHVKOVd0YmsxRGVxalliRmdja1QzOXplcnRQOEZyOFZwTFdEcTlrQ1FyUWpVbjhleXowa1B2Sl9hY3R6N1hnVGZJTVlCUVNraWNIUVc1Rlc4UjRVUlM0R0Zn?oc=5",
      "https://www.theguardian.com/world/2025/dec/31/finnish-police-seize-vessel-suspected-damaging-underwater-cable",
      "https://news.google.com/rss/articles/CBMitgFBVV95cUxPdnpKdERqWW42Y2VqNjNEMXgzNjZxT2lOLXdMZUdrM1NaaEFvZHJEMXRPSEwwU0dscEg2LU92U052NU9BaVVBbnFZcEZmV0hZMnVpUThsMkFVU3l3d0pnNXFsa0NNWDE2T0ctZE1RbG9ZTUFaZEhiSmZFODdleEwyNTd6T2xIQ3lXOXlzbGQ0d2xCVERhbDh0dFcyWnBOMW5qcjdsOUxaVGl5alhGLVAwY0hwUk8xdw?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2025/12/31/police-investigating-damage-to-undersea-telecom-cable-in-gulf-of-finland?traffic_source=rss",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.958,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.837,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Finnish authorities have seized a cargo ship sailing from Russia and arrested 14 crew members after suspected sabotage of two underwater telecommunications cables in the Baltic Sea. The ship was found with its anchor lowered near the damaged Helsinki-Tallinn cable in Finland's exclusive economic zone. European countries remain on high alert following recent sabotage incidents affecting cables and pipelines. Investigations are ongoing.",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "Israel bans over 24 aid groups from working in Gaza",
    "domain": "general",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Wed, 31 Dec 2025 11:57:54 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Washington Post",
      "CBC News",
      "Deutsche Welle"
    ],
    "domains": [
      "aljazeera.com",
      "washingtonpost.com",
      "cbc.ca",
      "dw.com"
    ],
    "snippets": [
      "Israel's latest move could amplify a deep humanitarian crisis spawned by its genocidal war on Gaza.",
      "Israel, citing security needs, has imposed strict new conditions on international NGOs that the U.N. and aid groups say could cripple the relief effort in Gaza.",
      "Israel is banning more than two dozen humanitarian organizations from Gaza for failing to comply with new registration rules.",
      "Israel has been tightening oversight of humanitarian groups in Gaza, warning that dozens of organizations face suspension for failing to submit lists of their Palestinian employees."
    ],
    "image_url": "",
    "titles": [
      "Which aid groups is Israel banning from Gaza now – and what will it mean?",
      "Israel says it will bar dozens of aid groups from operating in Gaza",
      "Israel will ban dozens of aid groups from Gaza starting on New Year's Day",
      "Israel moves to suspend major aid groups in Gaza"
    ],
    "url": "https://www.aljazeera.com/news/2025/12/31/which-aid-groups-is-israel-banning-from-gaza-now-and-what-will-it-mean?traffic_source=rss",
    "alternate_urls": [
      "https://www.washingtonpost.com/world/2025/12/31/israel-suspends-gaza-aid-groups/",
      "https://www.cbc.ca/radio/asithappens/gaza-aid-groups-suspended-9.7030581?cmp=rss",
      "https://www.dw.com/en/israel-moves-to-suspend-major-aid-groups-in-gaza/a-75347346?maca=en-rss-en-top-1022-rdf"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2025/12/31/which-aid-groups-is-israel-banning-from-gaza-now-and-what-will-it-mean?traffic_source=rss",
    "score_components": {
      "magnitude": 0.932,
      "recency": 0.773,
      "consensus": 0.908,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.823,
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The title suggests that the article will provide insights into the implications of Israel's decision to ban certain aid groups from Gaza. This could be useful for readers who want to understand the impact of this decision on the humanitarian situation in Gaza. However, without the full text, it's hard to assess if it reports on solutions or increases clarity around systems or impacts.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Israel has imposed new regulations on international NGOs operating in Gaza, requiring them to register and submit lists of Palestinian employees. As a result, Israel is banning more than two dozen humanitarian organizations for non-compliance. The U.N. and aid groups warn that these restrictions could severely impact relief efforts in Gaza.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "People around the world celebrate the start of 2026",
    "domain": "business",
    "source_domain": "dw.com",
    "location": "global",
    "published": "2025-12-31T13:03:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "ABC News",
      "New York Times",
      "CBC News",
      "Forbes",
      "The Guardian",
      "Globe and Mail"
    ],
    "domains": [
      "dw.com",
      "abcnews.go.com",
      "nytimes.com",
      "cbc.ca",
      "forbes.com",
      "theguardian.com",
      "news.google.com"
    ],
    "snippets": [
      "DW has all the updates as the world celebrates the end of 2025 and looks forward to 2026.",
      "Countries across the globe are beginning to usher in the new year.",
      "See how people across the globe celebrated.",
      "Here's a look at how countries around the world are ringing in the new year.",
      "It is already 2026 for billions around the globe.",
      "Join our live coverage as we cross the globe to enter the new year Sydney is the self-appointed “world capital of new year’s eve” and arguably rightly so. As always, eyes will be on the Opera House at 13:00 GMT when fireworks will light up the sky in spectacular fashion. But there are also huge crow",
      "New Year’s celebrations in Australia, Hong Kong tempered by recent events as cities ring in 2026 The Globe and Mail"
    ],
    "image_url": "",
    "titles": [
      "New Year's Eve live: World ushers in 2026",
      "New Year's 2026: Celebrations around the world",
      "New Year’s 2026 Celebrations Around the World: Photos and Videos",
      "Here’s what New Year’s celebrations look like as the world rings in 2026",
      "First Photos Of 2026: Global New Year’s Celebrations In Full Swing",
      "New Year’s Eve live:​ Sydney fireworks ring in 2026 as Asia sees in the new year ahead of Europe and the US",
      "New Year’s celebrations in Australia, Hong Kong tempered by recent events as cities ring in 2026 - The Globe and Mail"
    ],
    "url": "https://www.dw.com/en/new-year-s-eve-live-world-ushers-in-2026/live-75348280?maca=en-rss-en-top-1022-rdf",
    "alternate_urls": [
      "https://abcnews.go.com/International/new-years-2026-celebrations-world/story?id=128780581",
      "https://www.nytimes.com/2025/12/31/world/asia/new-years-2026-celebrations-photos.html",
      "https://www.cbc.ca/news/world/new-years-celebrations-around-the-world-2026-9.7031000?cmp=rss",
      "https://www.forbes.com/sites/maryroeloffs/2025/12/31/first-photos-of-2026-global-new-years-celebrations-in-full-swing/",
      "https://www.theguardian.com/lifeandstyle/live/2025/dec/31/new-years-eve-2026-world-ring-in-live-latest",
      "https://news.google.com/rss/articles/CBMilgFBVV95cUxOdVBVUnRDX0NIMFVXQXR4Z2hOOTRQa192VlFSQXlrUmZqbElBQ2o4VGttaXJYLVEtdWZzTmd0eTJrVGd1UzM4V1ozNDlxNDZwM2dKQTZlZmRQZzZRb2JqRDBYM0d0NlJFQTNSWVQ0YWswR01QcGdFam5DU0FMYXhYTDNsRUVMYmpSaTRSV3hsQkVZQnZVelE?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.dw.com/en/new-year-s-eve-live-world-ushers-in-2026/live-75348280?maca=en-rss-en-top-1022-rdf",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.797,
      "consensus": 1.0,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.819,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers basic awareness about the transition into the New Year across the globe. However, it lacks depth or insight, and it doesn't provide actionable information or report on progress, solutions, or empowering knowledge.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Countries around the world are celebrating the arrival of 2026, with major festivities taking place in cities such as Sydney and Hong Kong. Sydney marked the new year with its traditional fireworks display at the Opera House. Some celebrations, particularly in Australia and Hong Kong, were more subdued due to recent events. Billions globally have already welcomed 2026.",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "College football players plan to move to new teams soon",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Wed, 31 Dec 2025 12:27:58 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Yahoo Sports",
      "Sports Illustrated"
    ],
    "domains": [
      "espn.com",
      "sports.yahoo.com",
      "news.google.com"
    ],
    "snippets": [
      "From top targets to top backups, we've tiered QBs ahead of the transfer portal officially opening Jan. 2.",
      "The former Michigan national champion is back in the transfer portal.",
      "Colorado quarterback Ryan Staub is transferring, and he has two seasons of eligibility remaining. His time in Boulder was a mixed bag, with the offense changing often and snaps limited, but he showed enough to believe he can play well in the right spot. This past year, Staub went 30-for-55 for 427 y",
      "OU's Gentry Williams will be entering the transfer portal.",
      "A Michigan State football reserve tight end will reportedly enter the transfer portal",
      "Who Could Oklahoma Add to the Offensive Line in the Transfer Portal? Sports Illustrated"
    ],
    "image_url": "",
    "titles": [
      "26 QBs to watch in the college football transfer portal",
      "DJ Waller enters transfer portal",
      "Buffs quarterback enters transfer portal",
      "Oklahoma DB intends to enter transfer portal",
      "MSU football reserve tight end to reportedly enter transfer portal",
      "Who Could Oklahoma Add to the Offensive Line in the Transfer Portal? - Sports Illustrated"
    ],
    "url": "https://www.espn.com/college-football/story/_/id/47427877/2026-ncaa-football-transfer-portal-26-qbs-watch",
    "alternate_urls": [
      "https://sports.yahoo.com/articles/dj-waller-enters-transfer-portal-194942968.html",
      "https://sports.yahoo.com/articles/buffs-quarterback-enters-transfer-portal-194736215.html",
      "https://sports.yahoo.com/articles/oklahoma-db-intends-enter-transfer-195358673.html",
      "https://sports.yahoo.com/articles/msu-football-tight-end-reportedly-195335581.html",
      "https://news.google.com/rss/articles/CBMiwwFBVV95cUxORXd5YzJFQ1BPX3RjaFUtNDRIM1ZLWi0wV01FbW9MSS0zMngwcEdVVUN0UzU1RHVSaXR5SGV3MmpyZVZKeEZqMGhtQ1laTzE5LVhRQkw3RU11cUNTYWhremRudDAydHZ4YktLVlA0OEVpQlBtdzVwRF93X01WSTJObW5BUzQyMkZnVkhBdVdGaWNZVVdoSTRSSFJkVWJzWWw1WDhxTjdDcnJ5YUlTd1FLdnhlelozWHpCY0xxQktvejJtZEk?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/college-football/story/_/id/47427877/2026-ncaa-football-transfer-portal-26-qbs-watch",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.901,
      "consensus": 0.789,
      "constructiveness": 0.6,
      "proximity": 0.75
    },
    "score": 0.811,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information for college football fans or those interested in the dynamics of player transfers. It could be improved by providing more context about the transfer portal process or the potential impacts of these transfers on the teams involved.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Several college football players have announced plans to enter the transfer portal ahead of its official opening on January 2. Notable names include a former Michigan national champion, Colorado quarterback Ryan Staub, who has two years of eligibility left, Oklahoma's Gentry Williams, and a Michigan State reserve tight end. Teams are evaluating potential additions, including offensive linemen, through the portal.",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "Putin asks Russians to support troops in New Year speech",
    "domain": "politics",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Wed, 31 Dec 2025 14:15:40 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "New York Times",
      "SCMP"
    ],
    "domains": [
      "aljazeera.com",
      "nytimes.com",
      "scmp.com"
    ],
    "snippets": [
      "'We believe in you and our victory,' Putin says in his address, calling on Russians to support the troops.",
      "The Kremlin leader kept his speech short, spoke only briefly about the fighting in Ukraine, and did not mention U.S.-mediated talks on ending the war.",
      "Russian President Vladimir Putin said on Wednesday that his country believed it would win in Ukraine, where Moscow has led an almost four-year offensive. Putin’s traditional New Year’s Eve speech was first aired in the far-eastern Kamchatka peninsula, the first Russian region to enter 2026. He calle"
    ],
    "image_url": "",
    "titles": [
      "Putin says Russia believes it will win in Ukraine in New Year’s Eve address",
      "In New Year’s Speech to Russia, Putin Says Little About Ukraine War or Peace Talks With US",
      "Russia will win in Ukraine, says Putin in New Year address"
    ],
    "url": "https://www.aljazeera.com/news/2025/12/31/putin-says-russia-believes-it-will-win-in-ukraine-in-new-years-eve-address?traffic_source=rss",
    "alternate_urls": [
      "https://www.nytimes.com/2025/12/31/world/europe/russia-putin-new-years-address.html",
      "https://www.scmp.com/news/world/russia-central-asia/article/3338341/russia-will-win-ukraine-says-putin-new-year-address?utm_source=rss_feed"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2025/12/31/putin-says-russia-believes-it-will-win-in-ukraine-in-new-years-eve-address?traffic_source=rss",
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.824,
      "consensus": 0.789,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.765,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness about the ongoing conflict between Russia and Ukraine, but it doesn't provide much depth or insight into the situation, nor does it report on any solutions or improvements.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Russian President Vladimir Putin delivered a brief New Year’s Eve address, urging Russians to support the troops and expressing confidence in victory in Ukraine, where Russia’s offensive has lasted nearly four years. Putin did not mention ongoing U.S.-mediated talks to end the conflict. The speech was first aired in Kamchatka as Russia entered 2026.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Mali and Burkina Faso stop US citizens from entering",
    "domain": "general",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Wed, 31 Dec 2025 09:45:12 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Reuters",
      "Associated Press",
      "New York Times"
    ],
    "domains": [
      "bbc.com",
      "news.google.com",
      "nytimes.com"
    ],
    "snippets": [
      "The two states say they are taking reciprocal measures after the US announced full-entry restrictions on their citizens.",
      "Mali and Burkina Faso announce reciprocal travel ban on US Reuters",
      "Mali and Burkina Faso impose retaliatory travel ban on US nationals AP News",
      "The West African countries said they made the decisions in retaliation against the Trump administration."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/ba2a/live/91cb1be0-e61e-11f0-ba84-11119e07236b.png",
    "titles": [
      "Mali and Burkina Faso impose travel ban on US citizens in tit-for-tat move",
      "Mali and Burkina Faso announce reciprocal travel ban on US - Reuters",
      "Mali and Burkina Faso impose retaliatory travel ban on US nationals - AP News",
      "Mali and Burkina Faso Impose Travel Bans on Americans"
    ],
    "url": "https://www.bbc.com/news/articles/cgrdjx1d1vjo?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiogFBVV95cUxQa2NWWWY1YzJYUDZnaGZNeWRHSHpvNzlhLUJTMUx4Uks5RVpwUkx0WlJYbVYyU3VnTk40b0MtYUxuSThScnlEcllKQTV5WkszQjFvRUVWU1gteUwzdHlwYWpheW9CUEVSQktINXAtajlqUlpvYXMzS0xyVlhteTNfLWx6LUpkWU8tRllabmdaenlhcXNOR2RuZU9Na1FHOVdESVE?oc=5",
      "https://news.google.com/rss/articles/CBMiqgFBVV95cUxOT01SWW1QTEpSaG91bWpDRzVCTURHYnZmWFR0dFpGc0g0SDFfc2p3SG53Vy1UXzBvRkhFTnIwUldGYnpmY0Q0MTZ3cUVybFk1dDVwTDBxTnpSNXZFRm0yNVpVWi0yZEFYZ0VRY2ZXTllUVks0M1ZpVXNXTG5RWVdMSFVzeDNYRFJBc3BrbU9qWGh0X3d3RFVrbjBqaUExLWYwVVVPSENOM1hIQQ?oc=5",
      "https://www.nytimes.com/2025/12/31/world/africa/mali-burkina-faso-us-travel-ban.html"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/news/articles/cgrdjx1d1vjo?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.727,
      "consensus": 0.888,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.763,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story provides basic awareness about the travel bans imposed by Mali and Burkina Faso on US citizens. However, it lacks depth or insight into the reasons behind these actions or the potential impacts on international relations.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Mali and Burkina Faso have imposed travel bans on US nationals in response to full-entry restrictions placed on their citizens by the US. Both West African countries stated the measures are retaliatory actions against the Trump administration’s decision. The bans are effective immediately.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Thieves steal valuables from 3000 bank boxes in Germany",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Wed, 31 Dec 2025 18:14:22 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "Washington Post",
      "New York Times"
    ],
    "domains": [
      "news.google.com",
      "washingtonpost.com",
      "nytimes.com"
    ],
    "snippets": [
      "Thieves drill into German bank vault and make off with millions Reuters",
      "Around 3,000 safe-deposit boxes were breached as thieves drilled through a basement wall and got away undetected, according to police in Gelsenkirchen, Germany.",
      "The robbers stole valuables with an insured value of at least $36 million from a bank in Gelsenkirchen, western Germany."
    ],
    "image_url": "",
    "titles": [
      "Thieves drill into German bank vault and make off with millions - Reuters",
      "Thieves tunnel into bank vault, steal millions from safe-deposit boxes",
      "Thieves Make Off With Millions in German Bank Heist"
    ],
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxQSllYREdWSE52NmNXb190Y1V5NXVKT2FGUVhhRDdrem4xWnBkbGtZWFg5NWFWVHZUTFZIRzhGd2hzVDFSblExVFBTbUNWUW95eGlvVWlHQXNYRHpRWDV0bTJ2US1JeWZ0WlZOZ1VjQU1xeUoyN2N1LWhtNHZiQ25BRVlmT2pvekE4R0M3Ni1VOVM2NnVFR0lsQ2dVZTE5NlVCek5VeFRjSVJFQmliX1lKTVBR?oc=5",
    "alternate_urls": [
      "https://www.washingtonpost.com/world/2025/12/31/germany-bank-vault-theft-gelsenkirchen-sparkasse/",
      "https://www.nytimes.com/2025/12/31/world/europe/germany-heist-bank-robbery.html"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMisgFBVV95cUxQSllYREdWSE52NmNXb190Y1V5NXVKT2FGUVhhRDdrem4xWnBkbGtZWFg5NWFWVHZUTFZIRzhGd2hzVDFSblExVFBTbUNWUW95eGlvVWlHQXNYRHpRWDV0bTJ2US1JeWZ0WlZOZ1VjQU1xeUoyN2N1LWhtNHZiQ25BRVlmT2pvekE4R0M3Ni1VOVM2NnVFR0lsQ2dVZTE5NlVCek5VeFRjSVJFQmliX1lKTVBR?oc=5",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.92,
      "consensus": 0.789,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.762,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story appears to be more sensational than constructive. It might provide basic awareness about a specific crime, but it's unlikely to offer deeper insights or actionable information for the reader, based on the title and summary.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Thieves in Gelsenkirchen, Germany, drilled through a bank's basement wall and accessed about 3,000 safe-deposit boxes, stealing valuables with an insured value of at least $36 million. Police report the robbers escaped undetected, and an investigation is ongoing.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Lamar Jackson joins practice as Ravens get ready for Steelers",
    "domain": "sports",
    "source_domain": "cbssports.com",
    "location": "national",
    "published": "Wed, 31 Dec 2025 15:34:32 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sportsnet",
      "Yahoo Sports"
    ],
    "domains": [
      "cbssports.com",
      "sportsnet.ca",
      "sports.yahoo.com"
    ],
    "snippets": [
      "The Ravens face the Steelers for the AFC North title Sunday night",
      "Lamar Jackson was at practice Wednesday for the Baltimore Ravens as they prepared for this weekend’s showdown at Pittsburgh for the AFC North title.",
      "With the division hanging in the balance, Jackson could be in line for his first full week of practice since Week 10."
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/12/29/bacb28a3-102d-4d5d-8c7a-95a36c58ae8d/lamar-jackson-ravens-6.jpg",
    "titles": [
      "Lamar Jackson expected to practice Wednesday ahead of Ravens' AFC North showdown vs. Steelers",
      "Lamar Jackson at practice for Ravens as Baltimore prepares for Pittsburgh showdown",
      "Lamar Jackson back for start of Ravens' practice week ahead of AFC North title game against Steelers"
    ],
    "url": "https://www.cbssports.com/nfl/news/lamar-jackson-injury-update-ravens-quarterback-steelers-afc-north-nfl-playoffs/",
    "alternate_urls": [
      "https://sports.yahoo.com/nfl/breaking-news/article/lamar-jackson-back-for-start-of-ravens-practice-week-ahead-of-afc-north-title-game-against-steelers-192944168.html"
    ],
    "location_scope": "national",
    "link": "https://www.cbssports.com/nfl/news/lamar-jackson-injury-update-ravens-quarterback-steelers-afc-north-nfl-playoffs/",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.855,
      "consensus": 0.789,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.762,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about an upcoming game and a player's status. However, it lacks depth or insight into the strategic implications of this player's participation, or the broader context of the season.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Lamar Jackson participated in practice Wednesday as the Baltimore Ravens prepared to face the Pittsburgh Steelers on Sunday night. The game will decide the AFC North title. Jackson may complete his first full week of practice since Week 10 ahead of this key matchup.",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "Tatiana Schlossberg dies at 35 from rare leukemia",
    "domain": "politics",
    "source_domain": "dw.com",
    "location": "global",
    "published": "2025-12-30T23:37:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "BBC",
      "Reuters",
      "CBC News",
      "CNBC",
      "Associated Press"
    ],
    "domains": [
      "dw.com",
      "bbc.com",
      "news.google.com",
      "cbc.ca"
    ],
    "snippets": [
      "Tatiana Schlossberg revealed she had been diagnosed with a rare type of leukemia in an essay in The New Yorker last month. She was highly critical of her relative Robert F. Kennedy Jr., the US health secretary.",
      "She shared her cancer diagnosis in an essay last month, writing that she had less than a year to live.",
      "Tatiana Schlossberg, granddaughter of JFK, dies of rare form of leukemia Reuters",
      "Environmental journalist Tatiana Schlossberg, the granddaughter of the late U.S. president John F. Kennedy, has died. She was 35. The environmental journalist revealed in November that she had acute myeloid leukemia",
      "Tatiana Schlossberg, the granddaughter of the late President John F. Kennedy, has died at 35 CNBC",
      "Tatiana Schlossberg, a grandchild of the late President John F. Kennedy, has died at 35 AP News"
    ],
    "image_url": "",
    "titles": [
      "Tatiana Schlossberg, granddaughter of JFK, dies aged 35",
      "Tatiana Schlossberg, granddaughter of John F Kennedy, dies aged 35",
      "Tatiana Schlossberg, granddaughter of JFK, dies of rare form of leukemia - Reuters",
      "Tatiana Schlossberg, granddaughter of the late John F. Kennedy, dead at 35",
      "Tatiana Schlossberg, the granddaughter of the late President John F. Kennedy, has died at 35 - CNBC",
      "Tatiana Schlossberg, a grandchild of the late President John F. Kennedy, has died at 35 - AP News"
    ],
    "url": "https://www.dw.com/en/tatiana-schlossberg-granddaughter-of-jfk-dies-aged-35/a-75346596?maca=en-rss-en-top-1022-rdf",
    "alternate_urls": [
      "https://www.bbc.com/news/articles/c338ne3relzo?at_medium=RSS&at_campaign=rss",
      "https://news.google.com/rss/articles/CBMixAFBVV95cUxOLV9DR3lKLUFIZW5YRVI0bWNSUFEtVzc5Rlp4NERGOTkwUXhkbW9zMmsyeWUzeHhGVXNISlQ2QWZQMHc5Y2NNVzNnelBNZlZVSVJFWWR3enpaUDdYV3VCR0ZfaUtzenVsZ3VVUXRMOGl5N0JnZ0N2OFFEZVNORzZBV2lpN2ZBdF9LTHVkZ3BCLU9BWHV3aTdyN19KOU9ua0lZcVRnLVpwdHRyV2NSd2JMX2l0NnI3VXdxQ2VFbXFSeEFnUHpP?oc=5",
      "https://www.cbc.ca/news/world/tatiana-schlossberg-obit-acute-myeloid-leukemia-9.7030413?cmp=rss",
      "https://news.google.com/rss/articles/CBMihgFBVV95cUxOeHBKeXpzc1liUUZtTkRhUUtOaEpaQlk3dFdTNGdxczZFbXlVQlBWeElzMndMVWFRMHpGMXdPVjRMZy16b3lWSWVTbE0yN3NlcHVhZHJYTDdNOTUxM25kWjJCeWVLNXpIeWZOZU9yaWt6ZkNkRzVjMk1NeV9Wd3VScjZwWmNCQdIBiwFBVV95cUxObU1TdkY3YTBoYWxCSF9qaEEzSXE5cTZXdnBkVUdUWE9ENmduVTI3U2VOVGJuZUtaWXRnRVJ3NnVlZjBBMm5Yb2pYdjBwWkZZSW5hRjZaVUlRZFZPTFk0Zmc5T2NsWlFBZ3Q1ZDJHME43aDdtSUM2dHBaSF9xWXpzU0tWdXRucTBDa2g0?oc=5",
      "https://news.google.com/rss/articles/CBMikgFBVV95cUxOZXgtUjgxYUI2MTU5Tzk5b3hmYlNfMEdmaXFNaUJNWUZfSkxsYVE4WDJaYmdNY1VUaVFEQTJYMW9VRWNSemNfdnNIOG4zV2x3ejJyTk9RRFBWd3Z1UU5UWkwwOHVhcFFOZjRJTHh4WlZvWlZyeVQtVGpEcFFKUnB2T05nY2MwOFRiZmVSU0ZHekVBdw?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.dw.com/en/tatiana-schlossberg-granddaughter-of-jfk-dies-aged-35/a-75346596?maca=en-rss-en-top-1022-rdf",
    "score_components": {
      "magnitude": 0.986,
      "recency": 0.549,
      "consensus": 1.0,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.741,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers basic awareness about a notable person's death but does not provide any deeper understanding, actionable insights, or progress.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Tatiana Schlossberg, an environmental journalist and granddaughter of John F. Kennedy, has died at age 35 from a rare form of leukemia. She revealed her diagnosis of acute myeloid leukemia in November, stating she had less than a year to live. Schlossberg was also publicly critical of her relative, US health secretary Robert F. Kennedy Jr., in a recent essay.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Thailand sends 18 Cambodian soldiers home after border fighting",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Wed, 31 Dec 2025 17:46:44 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "New York Times",
      "SCMP"
    ],
    "domains": [
      "news.google.com",
      "nytimes.com",
      "scmp.com"
    ],
    "snippets": [
      "Thailand frees 18 Cambodian soldiers under new ceasefire deal Reuters",
      "The repatriation of the Cambodian soldiers captured in July comes on the heels of a 72-hour cease-fire that could end months of border skirmishes.",
      "Thailand on Wednesday released 18 Cambodian soldiers held for five months as prisoners of war, days after a fresh truce between the nations ended weeks of deadly fighting along their contested frontier. A decades-old border dispute between the Southeast Asian neighbours erupted into military clashes"
    ],
    "image_url": "",
    "titles": [
      "Thailand frees 18 Cambodian soldiers under new ceasefire deal - Reuters",
      "Thailand Releases 18 Cambodian P.O.W.s",
      "Thailand releases 18 Cambodian soldiers held since July"
    ],
    "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxNV25ZSzlZTnFCUjNQem1LTHhnTXJNb0FhLWdSYktYUW40VDEtX3Nwc01zWHFlTllGcjYwYmZrdHNtV0JJSGJXaWVmQVpSSWlpdUVqZXBySXRBT1J5TURRUmIxMHlKeDFmTkx1dG1BMzlRcTc4WmNIRERidHBac05QM1ludXNNMFY3N3JaZnYwUHRqbXZBZERULUVxX3N5Qk5pZ08tR1pES2k4QWc?oc=5",
    "alternate_urls": [
      "https://www.nytimes.com/2025/12/31/world/asia/thailand-cambodia-pows.html",
      "https://www.scmp.com/news/asia/southeast-asia/article/3338312/thailand-releases-18-cambodian-soldiers-held-july?utm_source=rss_feed"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxNV25ZSzlZTnFCUjNQem1LTHhnTXJNb0FhLWdSYktYUW40VDEtX3Nwc01zWHFlTllGcjYwYmZrdHNtV0JJSGJXaWVmQVpSSWlpdUVqZXBySXRBT1J5TURRUmIxMHlKeDFmTkx1dG1BMzlRcTc4WmNIRERidHBac05QM1ludXNNMFY3N3JaZnYwUHRqbXZBZERULUVxX3N5Qk5pZ08tR1pES2k4QWc?oc=5",
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.909,
      "consensus": 0.789,
      "constructiveness": 0.05,
      "proximity": 0.5
    },
    "score": 0.74,
    "constructiveness_score": 0.05,
    "constructiveness_reason": "semantic: pos_sim=0.20, neg_sim=0.00; semantic_boost=0.05; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Thailand has released 18 Cambodian soldiers who were held as prisoners of war for five months, following a new 72-hour ceasefire agreement. The soldiers were repatriated after recent deadly clashes along the disputed border between Thailand and Cambodia. The ceasefire aims to end months of conflict stemming from a long-standing territorial dispute.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Trump vetoes Colorado water bill and another bipartisan bill",
    "domain": "business",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Wed, 31 Dec 2025 17:44:26 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Axios",
      "CNBC"
    ],
    "domains": [
      "bbc.com",
      "news.google.com",
      "cnbc.com"
    ],
    "snippets": [
      "Trump vetoed a bill on a Colorado water project he said wasn't economically viable, but one of his allies questioned if he had political motives.",
      "Trump shoots down two bipartisan bills in first vetoes of second term Axios",
      "Trump promised retribution after Colorado refused to release Tina Peters, who was convicted by a state court last year."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/2455/live/b9267290-e667-11f0-8e2a-3df90dbf71c4.jpg",
    "titles": [
      "Trump vetoes first bills of his second term",
      "Trump shoots down two bipartisan bills in first vetoes of second term - Axios",
      "Trump’s first vetoes of his second term hit bipartisan infrastructure projects, draw accusations of retribution"
    ],
    "url": "https://www.bbc.com/news/articles/c74vl374mnyo?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMigwFBVV95cUxPTEgxemNmM3FlV1czaUFaMFNyX2YtVFRXeFh0WFMxZUdITnV2UEIzaV9iRnhqdnN3OVoyQlNSZmJWclI3VUREaFFxazBSeE14XzJNcFlsTFpLNzRUcUdmMGJPNXN4VEY1d2hlMEd5bWEwZHJ4R1lvMmpybjRzUnBPcFdUWQ?oc=5",
      "https://www.cnbc.com/2025/12/31/trumps-first-vetoes-hit-bipartisan-infrastructure-projects.html"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/news/articles/c74vl374mnyo?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.908,
      "consensus": 0.789,
      "constructiveness": 0.02,
      "proximity": 0.5
    },
    "score": 0.736,
    "constructiveness_score": 0.02,
    "constructiveness_reason": "semantic: pos_sim=0.08, neg_sim=0.00; semantic_boost=0.02; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Donald Trump vetoed a bill on a Colorado water project, citing economic concerns. He also vetoed a second bipartisan bill, marking his first vetoes of his second term. One ally questioned whether political motives influenced the water project veto. Trump also promised retribution after Colorado declined to release Tina Peters, who was convicted in state court in 2024.",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "People in Germany make New Year goals to improve themselves",
    "domain": "general",
    "source_domain": "dw.com",
    "location": "global",
    "published": "2025-12-31T16:18:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "NPR"
    ],
    "domains": [
      "dw.com",
      "npr.org"
    ],
    "snippets": [
      "Starting off the year with ambitious plans to become a better person is a widespread Western tradition. What are the most popular resolutions in Germany? And here's how the German language can help you deal with yours.",
      "One of the earliest mentions of New Year's resolutions appeared in a Boston newspaper in 1813. But the practice itself can be traced back to the Babylonians."
    ],
    "image_url": "",
    "titles": [
      "A German tip for your New Year's resolutions",
      "Why do we make New Year's resolutions? A brief history of a long tradition"
    ],
    "url": "https://www.dw.com/en/a-german-tip-for-your-new-year-s-resolutions/a-46737262?maca=en-rss-en-top-1022-rdf",
    "alternate_urls": [
      "https://www.npr.org/2025/12/31/nx-s1-5649767/new-years-resolutions-history"
    ],
    "location_scope": "global",
    "link": "https://www.dw.com/en/a-german-tip-for-your-new-year-s-resolutions/a-46737262?maca=en-rss-en-top-1022-rdf",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.872,
      "consensus": 0.591,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.73,
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This article provides useful insights that readers can apply to their New Year's resolutions. It contributes to the reader's understanding and decision-making, even though it doesn't report on a crisis or a problem-solving effort.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "New Year's resolutions are a common tradition in Western countries, including Germany. The concept dates back to the Babylonians and was first mentioned in a Boston newspaper in 1813. In Germany, people often make resolutions to improve themselves, and the German language offers unique ways to approach and maintain these goals.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Trump Media plans to give digital tokens to its shareholders",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Wed, 31 Dec 2025 16:02:09 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "Bloomberg",
      "Globe and Mail"
    ],
    "domains": [
      "news.google.com"
    ],
    "snippets": [
      "Trump Media unveils plan to distribute new cryptocurrency to shareholders Reuters",
      "Trump Firm to Start New Cryptocurrency for Shareholders Bloomberg.com",
      "Trump Media Announces Plans to Distribute Digital Tokens to DJT Shareholders The Globe and Mail"
    ],
    "image_url": "",
    "titles": [
      "Trump Media unveils plan to distribute new cryptocurrency to shareholders - Reuters",
      "Trump Firm to Start New Cryptocurrency for Shareholders - Bloomberg.com",
      "Trump Media Announces Plans to Distribute Digital Tokens to DJT Shareholders - The Globe and Mail"
    ],
    "url": "https://news.google.com/rss/articles/CBMinwFBVV95cUxPMXlYdEF0UlRyTm93V1NTUHhMaDNDQURQYWJpWmJUVHd4bDlqV3piWkM0ZTBWNnNMYXZaal9idHVKMTJpbE1RcU5OLThWS1JWU2VhUXp6eHU5dVJreHZBYjRqU29mZGZHbGV3Y3plcFo1ZVg5Um9BSkNuTUl1MWhYX1Z4XzVqNFplUjdpZGRjS2syUUtGNW9xZlZOTlZjSnM?oc=5",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiqgFBVV95cUxPY0hCQ3A5c21pR3V5cUw2ek1Sd2hBTEZkbW4wYUg3bTNiaWNhZFZjT1FpNTVqaWJEZkF1ZE1LMzhTMGR5SFpkQTV0TmFDeXpUTG1kZjlmZTBValhMN1JuQjUxRmlyY3Bhem5DNTFVd1pEdTRYbk5TQ1RDWFJESmNGTWtyMmY0d1Awb1BOcmdmYlJVcVpVTzdUX2RlZ0JpaFdwaUhMMzU1N2ZMUQ?oc=5",
      "https://news.google.com/rss/articles/CBMi8wFBVV95cUxQV25QUUlSMFk4TkZNU1QycWlzUmFCWlE3S3FlUk9sOEJMelVGMVl4OHdDWWRLdGgza2hELWVoXy1fLXQ4RndqNURCbXp0ZS1ZeEZUR3FWMzdlaDUzeEpvaGo3eVhZOHpNWC14SGkyelIwbk85UDdSOWJMZHU5Yk1rMWJWb2R6SjNYMTRIQ0NlZkZVdlAyLUhIQkRmZzljMHBDWU9HdkRlZ25FdlRmUUh4Mm1QV2hQWm13YmhEMUJfcVR4cDZnT281eGZYM2tQMXc0VVAwM2tMUVVnSGVkckIwZl9CbzRHdzRDQ2VUSXlMejZWU1k?oc=5"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMinwFBVV95cUxPMXlYdEF0UlRyTm93V1NTUHhMaDNDQURQYWJpWmJUVHd4bDlqV3piWkM0ZTBWNnNMYXZaal9idHVKMTJpbE1RcU5OLThWS1JWU2VhUXp6eHU5dVJreHZBYjRqU29mZGZHbGV3Y3plcFo1ZVg5Um9BSkNuTUl1MWhYX1Z4XzVqNFplUjdpZGRjS2syUUtGNW9xZlZOTlZjSnM?oc=5",
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.866,
      "consensus": 0.749,
      "constructiveness": 0.082,
      "proximity": 0.5
    },
    "score": 0.722,
    "constructiveness_score": 0.082,
    "constructiveness_reason": "keywords (1): plan; actions: plan; semantic: pos_sim=0.19, neg_sim=0.00; semantic_boost=0.05; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Trump Media has announced plans to distribute a new cryptocurrency, referred to as digital tokens, to its shareholders. The initiative aims to provide these tokens to individuals holding shares in Trump Media. The company has not yet detailed the distribution process or timeline.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Russia shows video of drone it says attacked president home",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Wed, 31 Dec 2025 17:38:31 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "Global News"
    ],
    "domains": [
      "news.google.com",
      "globalnews.ca"
    ],
    "snippets": [
      "Russia releases video footage to challenge Kyiv over alleged attack Reuters",
      "Russia's defence ministry released video footage on Wednesday of what it said was a downed drone used to attack a presidential residence."
    ],
    "image_url": "",
    "titles": [
      "Russia releases video footage to challenge Kyiv over alleged attack - Reuters",
      "Russia releases video of downed drone after Kyiv denied attack on Putin"
    ],
    "url": "https://news.google.com/rss/articles/CBMixgFBVV95cUxOei1nRDduZmhtMDBmTWExMnNFVFNONFdqa3YzX25ReVVfc2ZGQ08ydWlfNmktdGcwUG1RVEcyS0ZRYlZXVVpUMXFmNHhIdVAtdWNCR3lOaXUzTVVNak9BaGliVDNfcTdmdlBYVjRPRGp4cHZJM242QXBPR3NyMFV1Q3hvQXI4M2pKaXYzOERfQnZQSE1xSHVPbGtRTnlGU2V6MHQ4SW5DR3F4bTNpOVY0ZTRWQnFhb1h2M1FvcmtpR0V5Rl9jSGc?oc=5",
    "alternate_urls": [
      "https://globalnews.ca/news/11595499/russia-release-video-drone-putin-residence-attack/"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMixgFBVV95cUxOei1nRDduZmhtMDBmTWExMnNFVFNONFdqa3YzX25ReVVfc2ZGQ08ydWlfNmktdGcwUG1RVEcyS0ZRYlZXVVpUMXFmNHhIdVAtdWNCR3lOaXUzTVVNak9BaGliVDNfcTdmdlBYVjRPRGp4cHZJM242QXBPR3NyMFV1Q3hvQXI4M2pKaXYzOERfQnZQSE1xSHVPbGtRTnlGU2V6MHQ4SW5DR3F4bTNpOVY0ZTRWQnFhb1h2M1FvcmtpR0V5Rl9jSGc?oc=5",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.905,
      "consensus": 0.591,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.72,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs about a significant international event and provides context about the ongoing conflict between Russia and Ukraine. It does not, however, offer actionable insights or report on solutions or improvements.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Russia's defence ministry released video footage on Wednesday showing what it claims is a downed drone allegedly used in an attack on a presidential residence. The footage was presented to challenge Kyiv's involvement in the incident. No independent verification of the video's authenticity has been reported.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Power outage stops Channel Tunnel trains and leaves travelers stuck",
    "domain": "business",
    "source_domain": "dw.com",
    "location": "global",
    "published": "2025-12-31T09:05:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "New York Times",
      "Financial Times",
      "Reuters"
    ],
    "domains": [
      "dw.com",
      "nytimes.com",
      "ft.com",
      "news.google.com"
    ],
    "snippets": [
      "The operator of the train service connecting Britain with continental Europe has warned that delays may persist as travelers head out in the run-up to the New Year.",
      "The high-speed service between Britain and continental Europe was paralyzed during one of the busiest travel weeks of the year because of a power outage in the Channel Tunnel.",
      "Travel chaos caused by cabling fault and breakdowns left thousands of passengers stranded",
      "Channel tunnel rail passengers face second day of disruption after power failure Reuters"
    ],
    "image_url": "",
    "titles": [
      "Eurostar back on track after Channel Tunnel power fault",
      "Eurostar Trains Face Day of Delays After Power Failure",
      "Eurostar warns of delays after restarting Channel Tunnel services",
      "Channel tunnel rail passengers face second day of disruption after power failure - Reuters"
    ],
    "url": "https://www.dw.com/en/eurostar-back-on-track-after-channel-tunnel-power-fault/a-75348030?maca=en-rss-en-top-1022-rdf",
    "alternate_urls": [
      "https://www.nytimes.com/2025/12/30/world/europe/eurostar-canceled-channel-tunnel-london-paris.html",
      "https://www.ft.com/content/fe0f5cb9-248b-43c6-92a4-020e9768b465",
      "https://news.google.com/rss/articles/CBMiqwFBVV95cUxNUWpNN2VLMUF1bjBUcG1xLTc0OFdzSEVKMGRKRno1bFFyeUxZWW11QTZ5NFhObnA1R0JXRzNGMG45aVRTZUgtS01tSGMxZjgzQVMyTWxuQVFkb1d5aHlWX05fOVJDQW9nMWJqc2hoRWZycW5wbkZ3eWIyZzVEUktsSnpqT3lyNDE5ZW9ET3Rkc3pTNWJ2YURycUkxWm1vVEM0TVVkTXFSU1ZUMzA?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.dw.com/en/eurostar-back-on-track-after-channel-tunnel-power-fault/a-75348030?maca=en-rss-en-top-1022-rdf",
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.714,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.713,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "A power outage in the Channel Tunnel has caused major disruptions to the high-speed train service between Britain and continental Europe, leaving thousands of passengers stranded during a busy travel period. The operator has warned that delays may continue as travelers head into the New Year. This marks a second consecutive day of disruption due to cabling faults and breakdowns.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Eagles will rest Jalen Hurts and start Tanner McKee",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Wed, 31 Dec 2025 14:53:03 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Yahoo Sports"
    ],
    "domains": [
      "espn.com",
      "sports.yahoo.com"
    ],
    "snippets": [
      "Tanner McKee is expected to start at quarterback as the Eagles are planning to rest some starters against the Commanders, a source confirmed to ESPN.",
      "The Eagles are hoping rest is best with the playoffs on the horizon.",
      "The Eagles offense had a rough second half against the Bills in last Sunday's win, but it doesn't look like they'll use Week 18's game against the Commanders as a chance to try to get the unit back on track ahead of the playoffs.",
      "The Eagles appear set to rest some key starters in their Week 18 game against the Commanders on Sunday."
    ],
    "image_url": "",
    "titles": [
      "Source: Eagles plan to rest Hurts, other starters",
      "Eagles will reportedly rest Jalen Hurts and other key starters in Week 18 despite chance at No. 2 seed in NFC",
      "Report: Eagles to sit Jalen Hurts, most starters in Week 18",
      "Eagles will rest key starters in Week 18 against the Commanders"
    ],
    "url": "https://www.espn.com/nfl/story/_/id/47464592/source-eagles-likely-rest-jalen-hurts-others-finale",
    "alternate_urls": [
      "https://sports.yahoo.com/nfl/article/eagles-will-reportedly-rest-jalen-hurts-and-other-key-starters-in-week-18-despite-chance-at-no-2-seed-in-nfc-155008654.html",
      "https://sports.yahoo.com/articles/report-eagles-sit-jalen-hurts-151346056.html",
      "https://sports.yahoo.com/articles/eagles-reportedly-set-rest-key-121009257.html"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/nfl/story/_/id/47464592/source-eagles-likely-rest-jalen-hurts-others-finale",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.963,
      "consensus": 0.591,
      "constructiveness": 0.055,
      "proximity": 0.75
    },
    "score": 0.708,
    "constructiveness_score": 0.055,
    "constructiveness_reason": "keywords (1): plan; actions: plan; semantic: pos_sim=0.08, neg_sim=0.00; semantic_boost=0.02; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The Eagles plan to rest several key starters, including quarterback Jalen Hurts, in their Week 18 game against the Commanders. Tanner McKee is expected to start at quarterback. This decision comes as the team prepares for the upcoming playoffs, opting not to use the game to address recent offensive struggles.",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Damien Martyn in hospital with meningitis in induced coma",
    "domain": "sports",
    "source_domain": "theguardian.com",
    "location": "global",
    "published": "Wed, 31 Dec 2025 14:31:03 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "Sky Sports",
      "BBC Sport"
    ],
    "domains": [
      "theguardian.com",
      "skysports.com",
      "bbc.com"
    ],
    "snippets": [
      "The 54-year-old was admitted to hospital on Boxing Day Martyn played total of 67 Tests between 1992 and 2006 The former Australian Test cricketer Damien Martyn has been admitted to hospital and placed in an induced coma after being diagnosed with meningitis. The sporting community is rallying around",
      "Former Australia batter Damien Martyn has been placed in an induced coma after contracting meningitis.",
      "Former Australia batter Damien Martyn, 54, who played 67 Test matches, is in an induced coma in a Queensland hospital after being diagnosed with meningitis.."
    ],
    "image_url": "https://i.guim.co.uk/img/media/8991a8bfb54fe36234e1e26d4391bd917508cb89/0_291_1312_1049/master/1312.jpg?width=140&quality=85&auto=format&fit=max&s=138924ee2848b8a9f081370adf10ed38",
    "titles": [
      "Damien Martyn, former Australian Test cricketer, in induced coma with meningitis",
      "Former Australia cricketer Martyn in coma with meningitis",
      "Ex-Australia batter Martyn in coma with meningitis"
    ],
    "url": "https://www.theguardian.com/sport/2025/dec/31/former-australian-test-cricketer-damien-martyn-in-induced-coma",
    "alternate_urls": [
      "https://www.skysports.com/cricket/news/12040/13488967/damien-martyn-former-australia-cricketer-in-coma-after-contracting-meningitis",
      "https://www.bbc.com/sport/cricket/articles/c3013de0g88o?at_medium=RSS&at_campaign=rss"
    ],
    "location_scope": "global",
    "link": "https://www.theguardian.com/sport/2025/dec/31/former-australian-test-cricketer-damien-martyn-in-induced-coma",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.83,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.705,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Damien Martyn, 54, who played 67 Test matches for Australia between 1992 and 2006, has been admitted to a Queensland hospital and placed in an induced coma after being diagnosed with meningitis. The sporting community is showing support as he receives treatment.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Josh Giddey will miss games after hurting his left leg",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Wed, 31 Dec 2025 14:41:34 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Yahoo Sports"
    ],
    "domains": [
      "espn.com",
      "sports.yahoo.com"
    ],
    "snippets": [
      "Bulls guard Josh Giddey will miss at least a few weeks after straining his left hamstring in Monday's loss to the Timberwolves, sources told ESPN.",
      "Josh Giddey's career season will be put on pause for a significant amount of time."
    ],
    "image_url": "",
    "titles": [
      "Sources: Bulls' Giddey out at least a few weeks",
      "Bulls All-Star candidate Josh Giddey reportedly out at least a few weeks with hamstring strain"
    ],
    "url": "https://www.espn.com/nba/story/_/id/47459285/bulls-giddey-hamstring-least-weeks",
    "alternate_urls": [
      "https://sports.yahoo.com/nba/article/bulls-all-star-candidate-josh-giddey-reportedly-out-at-least-a-few-weeks-with-hamstring-strain-024743255.html"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/nba/story/_/id/47459285/bulls-giddey-hamstring-least-weeks",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.958,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.701,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Bulls guard Josh Giddey will be sidelined for at least several weeks after straining his left hamstring during Monday’s loss to the Timberwolves, according to sources. This injury interrupts his strong season, and he is expected to miss a significant amount of time.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Dallas Cowboys let go of cornerback Trevon Diggs",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Wed, 31 Dec 2025 14:18:40 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "espn.com",
      "cbssports.com"
    ],
    "snippets": [
      "The Cowboys have released cornerback Trevon Diggs. He will become a free agent if he goes unclaimed on waivers.",
      "Diggs is subject to waivers and no longer a member of the Dallas Cowboys",
      "After Dallas waived the embattled defender, several playoff contenders could make a move"
    ],
    "image_url": "",
    "titles": [
      "Cowboys release two-time Pro Bowl CB Diggs",
      "Cowboys release two-time Pro Bowl cornerback Trevon Diggs",
      "What's next for Trevon Diggs after Cowboys waive Pro Bowl CB? Playoff teams loom"
    ],
    "url": "https://www.espn.com/nfl/story/_/id/47455681/cowboys-release-veteran-cb-trevon-diggs-source-says",
    "alternate_urls": [
      "https://www.cbssports.com/nfl/news/cowboys-release-trevon-diggs-nfl-waivers/",
      "https://www.cbssports.com/nfl/news/trevon-diggs-waived-cowboys-landing-spots/"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/nfl/story/_/id/47455681/cowboys-release-veteran-cb-trevon-diggs-source-says",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.948,
      "consensus": 0.591,
      "constructiveness": 0.017,
      "proximity": 0.75
    },
    "score": 0.7,
    "constructiveness_score": 0.017,
    "constructiveness_reason": "actions: release; semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The Dallas Cowboys have released cornerback Trevon Diggs, making him subject to waivers. Diggs is no longer a member of the Cowboys and will become a free agent if he is not claimed by another team. Several playoff contenders are reportedly interested in acquiring him.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Queen Camilla says she stopped an attack as a teenager",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Wed, 31 Dec 2025 12:58:00 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "Washington Post"
    ],
    "domains": [
      "news.google.com",
      "washingtonpost.com"
    ],
    "snippets": [
      "Queen Camilla describes being assaulted by man as a teenager Reuters",
      "In a radio discussion about violence against women, Queen Camilla for the first time described fighting off an attempted sexual assault as a teenager in Britain."
    ],
    "image_url": "",
    "titles": [
      "Queen Camilla describes being assaulted by man as a teenager - Reuters",
      "Queen Camilla says she was assaulted on a train as a teenager"
    ],
    "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxQaWo1bWlrVU5jUkp1Z1lYZ0xiSEZaUkxiOExtTVNzLWExcUZhT3E3VW51UG93d09na0J2VE5kOFd1bnplUWItTkZ2NjMySjlod1NxNWNhQUdGRDdEa041MGI4T05XVUp5VElkR2xFeHBtMHE1R2Y1TkZqUEFiRkxoTWxNNWRnVFJQTzVoYmRQdC1mOXRrLTZFUE5hc1l5ME5EMHc?oc=5",
    "alternate_urls": [
      "https://www.washingtonpost.com/world/2025/12/31/queen-camilla-attempted-sexual-assault/"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMiogFBVV95cUxQaWo1bWlrVU5jUkp1Z1lYZ0xiSEZaUkxiOExtTVNzLWExcUZhT3E3VW51UG93d09na0J2VE5kOFd1bnplUWItTkZ2NjMySjlod1NxNWNhQUdGRDdEa041MGI4T05XVUp5VElkR2xFeHBtMHE1R2Y1TkZqUEFiRkxoTWxNNWRnVFJQTzVoYmRQdC1mOXRrLTZFUE5hc1l5ME5EMHc?oc=5",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.795,
      "consensus": 0.591,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.687,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story raises awareness about the issue of assault, especially against women, by sharing a personal experience of a prominent figure. However, it does not provide actionable insights or report on solutions to the problem.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Queen Camilla has publicly shared for the first time that she fought off an attempted sexual assault as a teenager in Britain. She discussed the experience during a radio discussion focused on violence against women.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Japan lawmakers ask for more womens toilets in parliament building",
    "domain": "politics",
    "source_domain": "theguardian.com",
    "location": "global",
    "published": "Wed, 31 Dec 2025 08:29:10 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "SCMP"
    ],
    "domains": [
      "theguardian.com",
      "scmp.com"
    ],
    "snippets": [
      "PM Sanae Takaichi joins petition asking for better facilities for women to match improved representation Nearly 60 female lawmakers in Japan, including the prime minister, Sanae Takaichi, have submitted a petition calling for more toilets in the parliament building for women to match their improved",
      "Nearly 60 women lawmakers in Japan, including Prime Minister Sanae Takaichi, have submitted a petition calling for more toilets in the parliament building to match their improved representation. Although the number of women politicians rose at the last election and despite Takaichi becoming the firs"
    ],
    "image_url": "https://i.guim.co.uk/img/media/8421bce660789bf8e5282dd77d32795513892dfe/700_0_3500_2800/master/3500.jpg?width=140&quality=85&auto=format&fit=max&s=e628f225f32092a4bcba387e7ebe7920",
    "titles": [
      "​Two cubicles, 73 women, one long queue: Japan’s female MPs fight for more loos",
      "Japan’s PM, women MPs, call for more toilets"
    ],
    "url": "https://www.theguardian.com/world/2025/dec/31/female-lawmakers-in-japan-lobby-for-more-toilets-in-parliament",
    "alternate_urls": [
      "https://www.scmp.com/news/asia/east-asia/article/3338330/japans-pm-women-mps-call-more-toilets?utm_source=rss_feed"
    ],
    "location_scope": "global",
    "link": "https://www.theguardian.com/world/2025/dec/31/female-lawmakers-in-japan-lobby-for-more-toilets-in-parliament",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.702,
      "consensus": 0.591,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.679,
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it highlights a specific issue faced by female MPs in Japan, providing a deeper understanding of gender inequality in the country. It also suggests a potential solution, which is to increase the number of facilities for women.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Nearly 60 female lawmakers in Japan, including Prime Minister Sanae Takaichi, have submitted a petition requesting more women's toilets in the parliament building. The petition cites an increase in female representation following the most recent election and calls for facilities to reflect this change.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "People around the world celebrate the start of 2026",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Wed, 31 Dec 2025 18:35:40 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "SCMP"
    ],
    "domains": [
      "news.google.com",
      "scmp.com"
    ],
    "snippets": [
      "World bids goodbye to 2025 with fireworks and icy plunges Reuters",
      "As Wednesday turned to Thursday, people around the world said goodbye to a sometimes challenging 2025 and expressed hopes for the ‍new year to come. In Croatia, revels got off to an early start. Since 2000, the town of Fuzine has held its countdown at noon, a tradition that has since spread across t"
    ],
    "image_url": "",
    "titles": [
      "World bids goodbye to 2025 with fireworks and icy plunges - Reuters",
      "World begins to bid goodbye to 2025 with fireworks and icy plunges"
    ],
    "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxOZnlUdFFqYnM3bU5JQ2IwVlVMbE1tVUlVczVXdF9Ba1ZVVzFsazRwNUVCTDdVMTZwczJPcW5WZzhSdFRrZzllS29jX21lX0JERUNobk9Za3NqM25hMncwbTkzcG9fb1ZrSkd2Y3ZaVzVGekNidmNlXzdiX1hUaXBtdThRZ0FjQjRZSmlscEVVdTZ5VDJZQTVjWWZxV3JVVHo0YmpfdXJRMndQd3M?oc=5",
    "alternate_urls": [
      "https://www.scmp.com/news/world/article/3338350/world-begins-bid-goodbye-2025-fireworks-and-icy-plunges?utm_source=rss_feed"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxOZnlUdFFqYnM3bU5JQ2IwVlVMbE1tVUlVczVXdF9Ba1ZVVzFsazRwNUVCTDdVMTZwczJPcW5WZzhSdFRrZzllS29jX21lX0JERUNobk9Za3NqM25hMncwbTkzcG9fb1ZrSkd2Y3ZaVzVGekNidmNlXzdiX1hUaXBtdThRZ0FjQjRZSmlscEVVdTZ5VDJZQTVjWWZxV3JVVHo0YmpfdXJRMndQd3M?oc=5",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.929,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.667,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "People worldwide marked the end of 2025 with celebrations, including fireworks and traditional events. In Croatia, the town of Fuzine continued its tradition of a noon countdown, which began in 2000 and has spread to other areas. Festivities reflected hopes for a better year ahead as communities gathered to welcome 2026.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Michael Burry says he is not betting against Tesla",
    "domain": "business",
    "source_domain": "cnbc.com",
    "location": "national",
    "published": "Wed, 31 Dec 2025 17:40:18 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Bloomberg"
    ],
    "domains": [
      "cnbc.com",
      "news.google.com"
    ],
    "snippets": [
      "In a social media post on X, the Scion Asset Management founder responded to a user asking if he would bet against Tesla by saying: \"I am not short.\"",
      "Famed Investor Michael Burry Says He’s Not Short Tesla Shares Bloomberg.com"
    ],
    "image_url": "",
    "titles": [
      "'Big Short' investor Michael Burry says he's not shorting Tesla",
      "Famed Investor Michael Burry Says He’s Not Short Tesla Shares - Bloomberg.com"
    ],
    "url": "https://www.cnbc.com/2025/12/31/big-short-investor-michael-burry-denies-shorting-tesla-stock.html",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMisgFBVV95cUxNNklxUnBUaExLbi1ZUUZuZUtkQm1UcnhXMW92M0cwR2tSX21PaURGZEo2LUxoVzhTcDl6ZnRBcHZJUG5tTHNmTDNFUEtudzZFYXNUcGxlWEVVQ0VwekRJdXhycU9Gay1kQ3FSRFllSV9Wdlk0d0ttTzhxTkQ3Tkk5MXJYRmdBNjRLcE5OYlRhQzdGZHl5cmR5NERFeWIwMWtnOGc4X0JLdzhxa2M0dmt6QUR3?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.cnbc.com/2025/12/31/big-short-investor-michael-burry-denies-shorting-tesla-stock.html",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.906,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.66,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Michael Burry, founder of Scion Asset Management, stated on social media that he is not shorting Tesla shares. In response to a question on X, Burry replied, \"I am not short,\" clarifying that he currently does not hold a short position against Tesla.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Mamady Doumbouya wins Guinea presidential election with big lead",
    "domain": "politics",
    "source_domain": "dw.com",
    "location": "global",
    "published": "2025-12-31T03:08:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "SCMP"
    ],
    "domains": [
      "dw.com",
      "scmp.com"
    ],
    "snippets": [
      "Mamadi Doumbouya secured almost 87% of the vote, while several opposition figures were either barred from contesting or were in exile. Doumbouya seized power after staging a coup in 2021.",
      "Junta leader General Mamady Doumbouya was declared the winner of Guinea’s presidential election held over the weekend, according to incomplete results released late on Tuesday, the country’s first election since a 2021 coup. Doumbouya won 86.72 per cent of the votes counted so far, according to the"
    ],
    "image_url": "",
    "titles": [
      "Guinea's junta leader declared winner of presidential election",
      "Junta leader declared winner of Guinea’s presidential election"
    ],
    "url": "https://www.dw.com/en/guinea-s-junta-leader-declared-winner-of-presidential-election/a-75346950?maca=en-rss-en-top-1022-rdf",
    "alternate_urls": [
      "https://www.scmp.com/news/world/africa/article/3338254/junta-leader-declared-winner-guineas-presidential-election?utm_source=rss_feed"
    ],
    "location_scope": "global",
    "link": "https://www.dw.com/en/guinea-s-junta-leader-declared-winner-of-presidential-election/a-75346950?maca=en-rss-en-top-1022-rdf",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.605,
      "consensus": 0.591,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.62,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides awareness of the political situation in Guinea. However, it lacks depth and does not provide any actionable insights or report on any solutions or attempts to improve the situation.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "General Mamady Doumbouya has been declared the winner of Guinea’s presidential election, securing nearly 87% of the vote based on incomplete results. The election was the first since Doumbouya led a coup in 2021. Several opposition figures were either barred from participating or remain in exile.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "CIA drone hits dock in Venezuela used by drug cartels",
    "domain": "politics",
    "source_domain": "nytimes.com",
    "location": "global",
    "published": "Tue, 30 Dec 2025 20:12:55 +0000",
    "source": "New York Times",
    "sources": [
      "New York Times",
      "SCMP"
    ],
    "domains": [
      "nytimes.com",
      "scmp.com"
    ],
    "snippets": [
      "The drone attack, said to be on a dock where drugs were being prepared for loading on boats, represented a further escalation of the Trump administration’s campaign against Nicolás Maduro.",
      "The CIA was behind a drone strike last week at a docking area believed to have been used by Venezuelan drug cartels, according to two people familiar with details of the operation who requested anonymity to discuss the classified matter. The first known direct operation on Venezuelan soil since the"
    ],
    "image_url": "https://static01.nyt.com/images/2025/12/30/multimedia/30dc-venez-wwk1-fbhj/30dc-venez-wwk1-fbhj-mediumSquareAt3X.jpg",
    "titles": [
      "The C.I.A. Strike on Venezuela: What to Know",
      "CIA behind drone strike on ‘big facility’ in Venezuela: sources"
    ],
    "url": "https://www.nytimes.com/2025/12/30/us/politics/trump-venezuela-drone-strike-attack.html",
    "alternate_urls": [
      "https://www.scmp.com/news/world/americas/article/3338268/cia-behind-drone-strike-drug-boat-loading-facility-venezuela-sources?utm_source=rss_feed"
    ],
    "location_scope": "global",
    "link": "https://www.nytimes.com/2025/12/30/us/politics/trump-venezuela-drone-strike-attack.html",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.499,
      "consensus": 0.591,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.614,
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful information about the C.I.A. strike on Venezuela, which can contribute to the reader's understanding of the current geopolitical situation. However, without the full text, it's hard to assess if it reports on solutions or increases clarity around systems or impacts.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The CIA conducted a drone strike last week at a dock in Venezuela believed to be used by drug cartels, according to sources familiar with the operation. The attack is part of the Trump administration’s ongoing campaign against Nicolás Maduro and marks the first known direct U.S. operation on Venezuelan soil in this context.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "China holds military drills near Taiwan with ships and planes",
    "domain": "general",
    "source_domain": "dw.com",
    "location": "global",
    "published": "2025-12-31T08:32:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "Reuters"
    ],
    "domains": [
      "dw.com",
      "news.google.com"
    ],
    "snippets": [
      "China had fired rockets and deployed dozens of aircraft and naval vessels in exercises simulating a blockade of Taiwan's ports. Taipei condemned the drills as a threat to regional security.",
      "UK calls for restraint over China's military drills around Taiwan Reuters"
    ],
    "image_url": "",
    "titles": [
      "Taiwan remains on alert as China ends military drills",
      "UK calls for restraint over China's military drills around Taiwan - Reuters"
    ],
    "url": "https://www.dw.com/en/taiwan-remains-on-alert-as-china-ends-military-drills/a-75347891?maca=en-rss-en-top-1022-rdf",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMirAFBVV95cUxObVUwWVpFTnUwR01MZ1lySVF5Y184aUxTdWZoaVR1UmIxSVJmTjhSdnpfSTNoc3YxMUxaV25SUE9ZWTltVHowY3ByWk42T2k4bFRNd0NUaUR1SEtKb1EySW5QSmZsaDAwV0xqM09RZlRtNXhRQ1VUcTFSTThJN2x1dTRENmxZWXMyeHhpamJNVGMzMERtU1diZGxzUXVMNTB3d0J2YkRxWXh1Nmow?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.dw.com/en/taiwan-remains-on-alert-as-china-ends-military-drills/a-75347891?maca=en-rss-en-top-1022-rdf",
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.703,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.612,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "China conducted military exercises near Taiwan, launching rockets and deploying aircraft and naval vessels to simulate a blockade of Taiwan's ports. Taipei condemned the drills, calling them a threat to regional security. The UK urged restraint in response to China's actions around Taiwan.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Two friends of Anthony Joshua die in car crash in Nigeria",
    "domain": "general",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Wed, 31 Dec 2025 18:25:44 GMT",
    "source": "BBC",
    "sources": [
      "BBC"
    ],
    "domains": [
      "bbc.com"
    ],
    "snippets": [
      "Matchroom promoter Eddie Hearn says Anthony Joshua's friends Sina Ghami and Latif \"Latz\" Ayodele, who were killed in a car crash in Nigeria, will be \"deeply missed\"."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/d89b/live/54d56530-e4ff-11f0-bbb4-738620fa9ed1.jpg",
    "titles": [
      "'Deeply missed' - Eddie Hearn pays tribute to Anthony Joshua team members killed in crash",
      "'Deeply missed' - Hearn pays tribute to Ghami and Latz"
    ],
    "url": "https://www.bbc.com/sport/boxing/articles/c4gvd53dqy6o?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [],
    "location_scope": "global",
    "link": "https://www.bbc.com/sport/boxing/articles/c4gvd53dqy6o?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.925,
      "consensus": 0.35,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.539,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "While the story brings awareness to the tragic event, it does not provide any deeper understanding, actionable insights, or solutions. It mainly focuses on the emotional impact of the event.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Anthony Joshua's friends, Sina Ghami and Latif \"Latz\" Ayodele, died in a car crash in Nigeria. Matchroom promoter Eddie Hearn stated that they will be \"deeply missed.\" No further details about the crash or its circumstances have been released.",
    "is_trending": false,
    "trending_score": 0.0
  }
]