[
  {
    "title": "Taylor Swift Talks Masters Ownership, Teases 12th Album on \"New Heights\" Podcast",
    "domain": "sports",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Thu, 14 Aug 2025 00:56:39 GMT",
    "source": "Axios",
    "sources": [
      "The Guardian",
      "CBS Sports",
      "ESPN",
      "Forbes",
      "Axios"
    ],
    "domains": [
      "www.forbes.com",
      "news.google.com",
      "www.theguardian.com",
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMifkFVX3lxTE9FRVJ1ZG91OTlFVFcwWHphNEFGdDNkWjkzWUJRMEN1MTJYaTByUzZ6YmxCOFV6MWNsaW1SNGpnVTVpUlRaOFpGS0lwMmFxS1psSVdlaVFUeVg1dUpfN3d1VFBZLUV4RGRIZHRBcUJldUt0SU9vT2o4bENER3hDdw?oc=5\" target=\"_blank\">Taylor Swift details masters ownership saga on \"New Heigh",
      "The superstar debuted on Jason and Travis Kelce's \"New Heights\" podcast, talked about becoming a football fan",
      "Swift's much-anticipated appearance on the Kelce brothers' podcast lived up to the hype",
      "<p>If you don’t have a spare two hours to listen to Swift talking about The Life of a Showgirl on her boyfriend’s podcast, we did it for you</p><ul><li><p><a href=\"https://www.theguardian.com/newsletters/2019/oct/18/saved-for-later-sign-up-for-guardian-australias-culture-and-lifestyle-email?CMP=cvau",
      "The record marks Swift’s 12th studio album and was teased Tuesday on the “New Heights” podcast, co-hosted by her boyfriend Travis Kelce, and his brother Jason."
    ],
    "image_url": "",
    "titles": [
      "Taylor Swift details masters ownership saga on \"New Heights\" podcast - Axios",
      "🎤 Swift makes 'New Heights' podcast cameo",
      "Taylor Swift on New Heights podcast: Seven things we learned from her appearance with Travis and Jason Kelce",
      "Eight things we learned from Taylor Swift and Travis Kelce’s marathon New Heights podcast",
      "Taylor Swift ‘New Heights’ Podcast Episode Draws 1.2 Million Viewers As Singer Reveals New Album Details"
    ],
    "score_components": {
      "magnitude": 0.9,
      "recency": 0.844,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.784,
    "summary": "Taylor Swift discussed her journey of regaining ownership of her masters during her appearance on the \"New Heights\" podcast, hosted by Jason and Travis Kelce. Swift, who recently became a football fan, also teased her 12th studio album on the show. The episode highlighted her personal and professional experiences, living up to its anticipation.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 54 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Israel Denies Over 100 NGOs Aid Delivery to Palestinians, Sparks Outcry",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 14 Aug 2025 05:42:41 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Al Jazeera",
      "The Guardian"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.bbc.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "More than 100 aid organisations say they are increasingly being told they are \"not authorised\" to deliver aid.",
      "Mass outcry from aid groups as Israel continues to block millions of dollars in aid supplies to starving Palestinians.",
      "<p>More than 100 international NGOs sign letter saying more than 60 requests to bring in food, water and items for shelter were denied by authorities in July alone</p><p><strong>We are just receiving pictures via the wires from inside Nasser Medical Complex, a hospital in Khan Younis, southern Gaza."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/a58e/live/7b9a1420-78be-11f0-a20f-3b86f375586a.jpg",
    "titles": [
      "Humanitarian groups call on Israel to end 'weaponisation of aid' in Gaza",
      "More than 100 groups blast Israel’s ‘weaponisation of aid’ as Gaza starves",
      "NGOs call for end to Israel’s ‘weaponisation’ of aid – Middle East crisis live"
    ],
    "score_components": {
      "magnitude": 0.84,
      "recency": 0.932,
      "consensus": 0.897,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.755,
    "summary": "Over 100 international NGOs have reported being denied authorization by Israeli authorities to deliver crucial aid, including food, water, and shelter items, to Palestinians. In July alone, more than 60 requests were rejected. This situation has sparked significant concern among aid organizations, as evidenced by a collective letter and the mass outcry against the blockade of millions of dollars in aid. Recent images from Nasser Medical Complex in Khan Younis, southern Gaza, highlight the dire situation on the ground.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 79 tokens",
    "image": {
      "src": "icons/israel.svg",
      "thumbnail": "icons/israel.svg",
      "alt": "israel flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "UK Economy Grows 0.3% in Q2, Exceeding Forecasts but Slows Down",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 14 Aug 2025 07:05:17 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Financial Post",
      "Financial Times"
    ],
    "domains": [
      "www.ft.com",
      "www.bbc.com",
      "financialpost.com"
    ],
    "snippets": [
      "The economy expanded by 0.3% between April to June period, ahead of economists' expectations.",
      "Figure marks a sharp slowdown from 0.7% expansion in first three months of the year",
      "The UK economy fared better than expected in the second quarter, bringing some relief for Chancellor of the Exchequer Rachel Reeves but raising the bar to further interest-rate cuts from the Bank of England."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/341c/live/ee39f060-78df-11f0-a975-cb151ca452f4.jpg",
    "titles": [
      "UK economic growth slows but beats forecasts",
      "UK economic growth slows in second quarter",
      "UK Economy Grew Faster-Than-Forecast 0.3% in Second Quarter"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.959,
      "consensus": 0.897,
      "constructiveness": 0.073,
      "proximity": 0.5
    },
    "score": 0.753,
    "summary": "The UK economy grew by 0.3% in the April to June period, surpassing economists' forecasts but showing a deceleration from the 0.7% growth in the first quarter. This performance, better than anticipated, provides some support for Chancellor Rachel Reeves, yet it complicates potential for further interest-rate reductions by the Bank of England.",
    "constructiveness_score": 0.073,
    "constructiveness_reason": "1 constructive keywords out of 55 tokens",
    "image": {
      "src": "icons/uk.svg",
      "thumbnail": "icons/uk.svg",
      "alt": "uk flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "South Korea Court Rules \"Baby Shark\" Not Plagiarized",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 14 Aug 2025 05:35:29 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Deutsche Welle",
      "The Guardian"
    ],
    "domains": [
      "www.bbc.com",
      "www.dw.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "The court rejected a US composer's copyright claim to the inescapable children's song.",
      "The catchy tune known for its \"doo doo doo doo doo doo\" hook was not plagiarized, the court ruled.",
      "<p>Supreme court upholds ruling that there was insufficient evidence of copyright infringement on song that is YouTube’s most viewed video</p><p>South Korea’s top court ruled on Thursday that the globally popular South Korean children’s song Baby Shark was not plagiarised, rejecting a copyright clai"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/c00f/live/9dc6ab30-78d7-11f0-a20f-3b86f375586a.jpg",
    "titles": [
      "Baby Shark did not plagiarise, says South Korea's top court",
      "South Korea's top court rejects 'Baby Shark' copyright claim",
      "Baby Shark song: South Korean court rejects US composer’s claim catchy tune was plagiarised"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.929,
      "consensus": 0.897,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.74,
    "summary": "South Korea's Supreme Court upheld a ruling that the children's song \"Baby Shark,\" known for its \"doo doo doo doo doo doo\" hook and being YouTube’s most viewed video, was not plagiarized. This decision came after a US composer's copyright claim was rejected due to insufficient evidence of copyright infringement.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 54 tokens",
    "image": {
      "src": "icons/south-korea.svg",
      "thumbnail": "icons/south-korea.svg",
      "alt": "south korea flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Taylor Swift, Travis Kelce Confirm Relationship on \"New Heights\" Podcast",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 14 Aug 2025 02:24:36 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "MarketWatch",
      "Business Insider"
    ],
    "domains": [
      "www.marketwatch.com",
      "www.businessinsider.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The pop superstar gives a rare insight into their life together and reveals details of her new album.",
      "Taylor Swift and Travis Kelce sparked dating rumors in 2023, when the NFL star attended the Eras Tour and tried to give Swift a bracelet.",
      "After years of speculation, Taylor Swift finally appeared on Travis and Jason Kelce’s podcast “New Heights,” in an episode released on Wednesday night."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/f32c/live/2371a330-78e1-11f0-a20f-3b86f375586a.jpg",
    "titles": [
      "Relationship and Easter eggs - what we learned from Taylor Swift on Travis Kelce's podcast",
      "A complete timeline of Taylor Swift and Travis Kelce's relationship",
      "The biggest winners of the Taylor Swift-Travis Kelce podcast"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.87,
      "consensus": 0.897,
      "constructiveness": 0.062,
      "proximity": 0.5
    },
    "score": 0.734,
    "summary": "Taylor Swift and Travis Kelce, who sparked dating rumors in 2023 after Kelce attended Swift's Eras Tour and attempted to give her a bracelet, were featured together on the \"New Heights\" podcast hosted by Travis and Jason Kelce. In the episode released Wednesday night, Swift provided rare insights into their relationship and discussed details of her new album, confirming their connection and collaboration.",
    "constructiveness_score": 0.062,
    "constructiveness_reason": "1 constructive keywords out of 64 tokens",
    "image": {
      "src": "icons/briefcase.svg",
      "thumbnail": "icons/briefcase.svg",
      "alt": "business",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Study: ADHD Medications Lower Risk of Substance Misuse, Accidents, Crime",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 13 Aug 2025 23:07:37 GMT",
    "source": "BBC",
    "sources": [
      "New Scientist",
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com",
      "www.newscientist.com"
    ],
    "snippets": [
      "A study has linked ADHD drugs to reduced substance misuse, suicide, transport accidents and criminality.",
      "A study of 150,000 people with ADHD in Sweden confirms that drugs taken to manage the condition have wider benefits beyond improving immediate symptoms",
      "<p>Research also suggests the medication lowers risks of substance misuse, transport accidents and criminality</p><p>Attention deficit hyperactivity disorder medication is linked to significantly lower risk of suicidal behaviours, substance misuse, transport accidents and criminality, according to a"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/f40a/live/6dad2630-7856-11f0-8d1f-b10c011c40aa.jpg",
    "titles": [
      "ADHD drugs cut risk of suicide, car accidents and criminality, study suggests",
      "ADHD drugs reduce risk of criminal behaviour, drug abuse and accidents",
      "ADHD medication linked to lower risk of suicidal behaviours, study suggests"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.812,
      "consensus": 0.897,
      "constructiveness": 0.145,
      "proximity": 0.5
    },
    "score": 0.731,
    "summary": "A study in Sweden involving 150,000 individuals with ADHD found that medications for the condition not only improve symptoms but also significantly reduce the risks of substance misuse, suicidal behaviors, transport accidents, and criminality. This research highlights the broader benefits of ADHD drugs beyond their primary purpose of managing the disorder's immediate symptoms.",
    "constructiveness_score": 0.145,
    "constructiveness_reason": "2 constructive keywords out of 55 tokens",
    "image": {
      "src": "icons/newspaper.svg",
      "thumbnail": "icons/newspaper.svg",
      "alt": "general",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "PSG Rallies from Two-Goal Deficit Against Tottenham in Season Opener",
    "domain": "sports",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Wed, 13 Aug 2025 22:32:11 +0000",
    "source": "Al Jazeera",
    "sources": [
      "CBS Sports",
      "Al Jazeera",
      "Sportsnet"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.sportsnet.ca",
      "www.cbssports.com"
    ],
    "snippets": [
      "Tottenham let slip a two-goal lead as late PSG strikes sent European football&#039;s season opener to penalties in Italy.",
      "Paris Saint-Germain came back from a 2-0 deficit to beat Tottenham Hotspur in penalties on Wednesday, but Spurs showed some real positives",
      "PSG looked down and out, but Luis Enrique's team rallied when it mattered most",
      "<p>Paris Saint-Germain produced a dramatic late rally before beating Tottenham in a penalty shootout to win the UEFA Super Cup on Wednesday, securing a fifth trophy of 2025 for the French club.</p>"
    ],
    "image_url": "",
    "titles": [
      "PSG beat Tottenham on penalties to claim UEFA Super Cup",
      "Tottenham may have lost UEFA Super Cup to PSG, but Thomas Frank's is making his mark in a big way",
      "UEFA Super Cup score, highlights, takeaways: PSG beat Tottenham after dramatic comeback, penalty shootout",
      "PSG beats Tottenham in penalty shootout to win UEFA Super Cup"
    ],
    "score_components": {
      "magnitude": 0.82,
      "recency": 0.819,
      "consensus": 0.897,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.725,
    "summary": "In the European football season opener in Italy, Tottenham lost a two-goal lead to PSG, leading the match to penalties. PSG, despite looking defeated, made a comeback under Luis Enrique's leadership. The outcome of the match was not provided in the summary.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 44 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Trump Warns Putin of Severe Consequences, Proposes Three-Way Summit on Ukraine",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Wed, 13 Aug 2025 17:36:15 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Axios",
      "Al Jazeera",
      "The Guardian"
    ],
    "domains": [
      "www.aljazeera.com",
      "news.google.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "US president issues warning days ahead of high-stakes summit with Russian leader in Alaska.",
      "<a href=\"https://news.google.com/rss/articles/CBMigAFBVV95cUxObzdIY2xiZ3IxeW9PWkZPYld5cER0djkzandnU3pRM2kzMm9xSFFhYnlfZHM4ZmFiX0tCUmpxRXVidkt1YTJFdVlWdkpaYWdHblhKTDNmM2VJVnA4a1BkRFk4aFNGSDBrYVdTR0s2QzA2dnNMeDdoRjFzd0pqX1hERA?oc=5\" target=\"_blank\">Trump: \"Very severe\" consequences for Putin if he ref",
      "<p>US president also says he would push for three-way summit with Volodymyr Zelenskyy if Alaska meeting goes well</p><p>Vladimir Putin will face “very severe consequences” if he does not agree a ceasefire in the war in Ukraine at his summit with Donald Trump in Alaska, the US president said on Wedne"
    ],
    "image_url": "",
    "titles": [
      "Trump threatens ‘severe consequences’ if Putin refuses to end Ukraine war",
      "Trump: \"Very severe\" consequences for Putin if he refuses ceasefire - Axios",
      "Putin faces ‘very severe consequences’ if no Ukraine truce agreed, Trump says"
    ],
    "score_components": {
      "magnitude": 0.86,
      "recency": 0.739,
      "consensus": 0.897,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.723,
    "summary": "During a summit in Alaska, President Donald Trump warned Vladimir Putin of \"very severe consequences\" if a ceasefire in Ukraine is not agreed upon. Trump also expressed intentions to facilitate a three-way summit with Ukrainian President Volodymyr Zelenskyy if the Alaska talks are successful. Additionally, Trump reassured European leaders about the discussions with Putin, emphasizing a focus on achieving a ceasefire and the possibility of a meeting between Putin and Zelenskyy.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 72 tokens",
    "image": {
      "src": "icons/ukraine.svg",
      "thumbnail": "icons/ukraine.svg",
      "alt": "ukraine flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "NBA Approves Celtics Sale to Bill Chisholm Group for Record $6.1 Billion",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Thu, 14 Aug 2025 01:12:36 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "The NBA board of governors unanimously approved the sale of the Celtics to a group led by private equity mogul Bill Chisholm, a deal that values the franchise at more than $6.1 billion.",
      "It's the most expensive sale of an American professional sports team"
    ],
    "image_url": "",
    "titles": [
      "NBA signs off on record-setting sale of Celtics",
      "NBA approves sale of Boston Celtics to Bill Chisholm for record-setting $6.1 billion price tag"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.941,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.679,
    "summary": "The NBA board of governors has unanimously approved the sale of the Boston Celtics to a group led by Bill Chisholm, a private equity mogul. This deal, valuing the franchise at over $6.1 billion, marks the most expensive sale of an American professional sports team to date.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 48 tokens",
    "image": {
      "src": "icons/basketball.svg",
      "thumbnail": "icons/basketball.svg",
      "alt": "nba",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Owen Caissie Promoted to Chicago Cubs, ESPN Reports",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Thu, 14 Aug 2025 03:22:09 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sportsnet"
    ],
    "domains": [
      "www.cbssports.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Caissie was part of the return in the 2020 Yu Darvish trade",
      "<p>Outfielder Owen Caissie has been called up by the Chicago Cubs, ESPN&#8217;s Jesse Rogers reported Wednesday.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/08/14/05a1325d-0a3d-4247-b38c-2f8e5641f108/081325-owencaissie.jpg",
    "titles": [
      "Cubs calling up top prospect Owen Caissie, who could make debut on Thursday, per report",
      "Cubs call up top Canadian outfield prospect Owen Caissie"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.906,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.679,
    "summary": "Outfielder Owen Caissie, who was part of the 2020 trade involving Yu Darvish, has been promoted to the Chicago Cubs, as reported by ESPN's Jesse Rogers.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 27 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Court Upholds Trump's Freeze on Foreign Aid Funds",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Wed, 13 Aug 2025 20:41:50 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.npr.org"
    ],
    "snippets": [
      "A federal appeals court handed President Trump a victory on Wednesday. The court ruled the administration can continue to freeze or terminate billions of dollars that Congress approved in foreign aid.",
      "Critics argue President Trump has overstepped his constitutional authority by slashing congressionally approved aid."
    ],
    "image_url": "",
    "titles": [
      "President Trump can continue to withhold billions in foreign aid, court rules",
      "US appeals court lets Trump slash billions in foreign aid"
    ],
    "score_components": {
      "magnitude": 0.74,
      "recency": 0.857,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.676,
    "summary": "A federal appeals court ruled on Wednesday that President Trump's administration can continue to freeze or terminate billions of dollars in congressionally approved foreign aid. Critics claim this action oversteps his constitutional authority. This decision marks a victory for the Trump administration in its handling of foreign aid funds.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 50 tokens",
    "image": {
      "src": "icons/newspaper.svg",
      "thumbnail": "icons/newspaper.svg",
      "alt": "general",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Twins Beat Yankees 4-1, End Nine-Game Losing Streak; Goldschmidt Injured",
    "domain": "sports",
    "source_domain": "www.northjersey.com",
    "location": "national",
    "published": "Thu, 14 Aug 2025 06:43:55 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Sportsnet",
      "Yahoo Sports"
    ],
    "domains": [
      "www.northjersey.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "After the Twins' 4-1 victory against the Yankees on Wednesday night, it was revealed that Paul Goldschmidt has a low grade right knee sprain.",
      "<p>Joe Ryan allowed a run and four hits in 6.2 innings and the Minnesota Twins beat the Yankees 4-1 on Wednesday night, breaking a nine-game losing streak to New York.</p>"
    ],
    "image_url": "",
    "titles": [
      "Yankees meet their match vs. Twins' Joe Ryan, Paul Goldschmidt dealing with knee issue",
      "Joe Ryan leads Twins to victory over Yankees"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.972,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.66,
    "summary": "The Minnesota Twins ended a nine-game losing streak against the New York Yankees with a 4-1 win on Wednesday night. During the game, Joe Ryan pitched 6.2 innings, allowing only one run and four hits. It was also disclosed that Paul Goldschmidt has sustained a low-grade right knee sprain.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 53 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Liverpool Close to Signing Parma Defender Leoni for £26m",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Wed, 13 Aug 2025 19:21:00 EST",
    "source": "ESPN",
    "sources": [
      "Sky Sports",
      "ESPN"
    ],
    "domains": [
      "www.skysports.com",
      "www.espn.com"
    ],
    "snippets": [
      "Liverpool have verbally agreed to personal terms with Parma defender Giovanni Leoni. Transfer Talk has the latest news, gossip and rumors.",
      "Liverpool have agreed a deal to sign Parma defender Giovanni Leoni."
    ],
    "image_url": "",
    "titles": [
      "Transfer rumors, news: Liverpool agree deal with defender Leoni",
      "Liverpool agree deal to sign defender Leoni"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.833,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.657,
    "summary": "Liverpool is nearing the acquisition of 18-year-old defender Giovanni Leoni from Parma for around £26m. The club has reached a verbal agreement on personal terms with Leoni. Transfer Talk provides updates on the ongoing transfer negotiations.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 38 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Trump signs order to ease commercial spaceflight regulations",
    "domain": "technology",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-08-14T03:29:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "Ars Technica"
    ],
    "domains": [
      "arstechnica.com",
      "www.dw.com"
    ],
    "snippets": [
      "The move is set to remove \"inefficient\" regulations for private space ventures. It could also benefit Trump's former ally and advisor Elon Musk. Meanwhile, environmental groups criticized the order.",
      "The head of the FAA's commercial spaceflight division will become a political appointee."
    ],
    "image_url": "",
    "titles": [
      "Trump signs order to ease commercial spaceflight regulations",
      "Trump orders cull of regulations governing commercial rocket launches"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.908,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.654,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 8 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Brazil's President Lula Launches 'Sovereign Brazil' Plan Amid US Tariffs",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Wed, 13 Aug 2025 21:13:13 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Deutsche Welle",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.dw.com"
    ],
    "snippets": [
      "The plan, called &#039;Sovereign Brazil&#039;, will include credit for businesses that rely on exports.",
      "Brazil's President Lula da Silva said the move is supposed to \"create new things\" out of the crisis resulted by Donald Trump's tariffs. But Lula also said his country is still ready to negotiate."
    ],
    "image_url": "",
    "titles": [
      "Brazil plans aid packages for businesses impacted by Trump tariffs",
      "Brazil announces $5.5B package to counter Trump's tariffs"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.797,
      "consensus": 0.682,
      "constructiveness": 0.182,
      "proximity": 0.5
    },
    "score": 0.65,
    "summary": "Brazil's President Lula da Silva announced the 'Sovereign Brazil' plan, aimed at supporting export-reliant businesses through credit. This initiative is a response to the economic challenges posed by Donald Trump's tariffs. Despite this move, Lula emphasized Brazil's openness to negotiation.",
    "constructiveness_score": 0.182,
    "constructiveness_reason": "2 constructive keywords out of 44 tokens",
    "image": {
      "src": "icons/usa.svg",
      "thumbnail": "icons/usa.svg",
      "alt": "us flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Hong Kong's Jimmy Lai Trial Delayed Amid Weather Warning, Global Concern",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 14 Aug 2025 02:49:05 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "www.bbc.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Lai is accused of colluding with foreign forces under a Beijing-imposed national security law.",
      "<p>Lai has been detained since December 2020, with western nations and rights groups calling for his release</p><p>The closing arguments in the national security trial against jailed Hong Kong media mogul Jimmy Lai were postponed on Thursday after the Asian financial hub issued its highest-level “bl"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/ab02/live/1c6fd9f0-7740-11f0-813c-29678c441e36.jpg",
    "titles": [
      "Jimmy Lai: Trial of Hong Kong's rebel mogul delayed by typhoon",
      "Jimmy Lai trial: closing arguments in Hong Kong delayed by aftermath of Typhoon Podul"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.877,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.648,
    "summary": "Jimmy Lai, a Hong Kong media mogul, faces charges of colluding with foreign forces under a national security law imposed by Beijing. Detained since December 2020, his trial has drawn international concern, with Western nations and rights groups demanding his release. The trial's closing arguments were delayed due to Hong Kong issuing its highest-level weather warning.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 58 tokens",
    "image": {
      "src": "icons/newspaper.svg",
      "thumbnail": "icons/newspaper.svg",
      "alt": "general",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Leaders Meet Ahead of Trump-Putin Summit, Zelenskyy May Join Follow-Up",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Wed, 13 Aug 2025 13:32:45 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "Washington Post"
    ],
    "domains": [
      "www.washingtonpost.com",
      "www.npr.org"
    ],
    "snippets": [
      "European leaders held a high-stakes meeting Wednesday with President Trump, Vice President Vance, Ukraine's Volodymyr Zelenskyy and NATO's chief ahead of Friday's U.S.-Russia summit.",
      "European leaders said a call with President Donald Trump was unifying and that he agreed Ukraine should be part of any negotiations over territory, but some still worry he could give in to Russian President Vladimir Putin."
    ],
    "image_url": "",
    "titles": [
      "Zelenskyy: Trump pursuing Ukraine ceasefire at Putin summit",
      "Europeans, Zelensky cite unity with Trump ahead of Putin summit in Alaska"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.738,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.645,
    "summary": "European leaders, along with President Trump, Vice President Vance, Ukraine's President Zelenskyy, and NATO's chief, convened for a significant meeting before the upcoming U.S.-Russia summit scheduled for Friday. This assembly aimed to strategize ahead of Trump's meeting with Russian President Vladimir Putin in Alaska, where Trump hinted at a potential follow-up meeting that would include President Zelenskyy, contingent on the success of the initial discussions. This series of meetings underscores the intricate diplomatic efforts underway concerning U.S.-Russia relations and Ukraine's involvem",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 90 tokens",
    "image": {
      "src": "icons/newspaper.svg",
      "thumbnail": "icons/newspaper.svg",
      "alt": "general",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "xAI Co-Founder Igor Babuschkin Leaves to Start Own Firm Amid Controversies",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Wed, 13 Aug 2025 23:12:16 GMT",
    "source": "CNBC",
    "sources": [
      "TechCrunch",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "techcrunch.com"
    ],
    "snippets": [
      "Igor Babuschkin, who helped start xAI in 2023, said in a post on X that he's leaving the artificial intelligence startup to launch his own venture firm.",
      "Igor Babuschkin is leaving xAI less than three years after he co-founded the startup with Elon Musk, following a series of scandals at company."
    ],
    "image_url": "",
    "titles": [
      "Elon Musk's xAI loses co-founder Igor Babuschkin, who's leaving to start venture firm",
      "Co-founder of Elon Musk’s xAI departs the company"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.814,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.635,
    "summary": "Igor Babuschkin, a co-founder of xAI with Elon Musk in 2023, is departing the artificial intelligence startup to establish his own venture firm. His decision comes amid controversies surrounding xAI.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 31 tokens",
    "image": {
      "src": "icons/briefcase.svg",
      "thumbnail": "icons/briefcase.svg",
      "alt": "business",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "PSG Wins UEFA Super Cup, Defeats Tottenham on Penalties",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 13 Aug 2025 21:48:42 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Sky Sports"
    ],
    "domains": [
      "www.bbc.com",
      "www.skysports.com"
    ],
    "snippets": [
      "Paris St-Germain produce a stunning late comeback to beat Tottenham Hotspur on penalties and win the Uefa Super Cup in Udine.",
      "Tottenham's late collapse saw them blow a 2-0 UEFA Super Cup lead with five minutes to play as Paris Saint-Germain snatched the first European trophy of the season on penalties in Udine."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/f1d8/live/9a5a1750-788e-11f0-8071-1788c7e8ae0e.jpg",
    "titles": [
      "Spurs squander two-goal lead as PSG win Super Cup on penalties",
      "Tottenham heartbreak as PSG win Super Cup on penalties after late collapse"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.79,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.624,
    "summary": "Paris Saint-Germain secured the UEFA Super Cup title after a remarkable comeback against Tottenham Hotspur, ending the match 2-2 in regular time and winning 4-3 on penalties. The game, held in Udine, saw PSG score two late goals to force a shootout, ultimately claiming their first European trophy of the season and their fifth trophy of 2025.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 60 tokens",
    "image": {
      "src": "icons/soccer.svg",
      "thumbnail": "icons/soccer.svg",
      "alt": "uefa",
      "credit": "Tabler",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "NY Attorney General Sues Zelle Banks Over $1B Fraud Allegations",
    "domain": "business",
    "source_domain": "www.forbes.com",
    "location": "global",
    "published": "Wed, 13 Aug 2025 16:53:23 -0400",
    "source": "Forbes",
    "sources": [
      "The Verge",
      "Forbes"
    ],
    "domains": [
      "www.theverge.com",
      "www.forbes.com"
    ],
    "snippets": [
      "New York Attorney General Letitia James’ office picked up the lawsuit after the Consumer Financial Protection Bureau dropped a similar one in March.",
      "New York Attorney General Letitia James is suing the banks behind Zelle over claims that their payment platform enabled “massive amounts of fraud” that caused customers to lose more than $1 billion between 2017 and 2023. In the lawsuit, James alleges Zelle was rushed to market, resulting in a design"
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/689cfacfaf5cca4eff1f68bb/0x0.jpg?width=960&precrop=892%2C501%2Cx0%2Cy46",
    "titles": [
      "New York Sues Zelle—What To Know About Alleged $1 Billion Scams Over The App",
      "New York claims Zelle&#8217;s shoddy security enabled a billion dollars in scams"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.792,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.624,
    "summary": "New York Attorney General Letitia James is suing the banks responsible for Zelle, alleging the payment platform facilitated over $1 billion in customer fraud from 2017 to 2023. The lawsuit claims Zelle was prematurely launched, leading to its flawed design that enabled fraud. This legal action follows the Consumer Financial Protection Bureau dropping a similar case in March.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 58 tokens",
    "image": {
      "src": "icons/briefcase.svg",
      "thumbnail": "icons/briefcase.svg",
      "alt": "business",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Cleveland Browns Rookie QB Shedeur Sanders Injured in Practice",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Wed, 13 Aug 2025 20:40:03 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sportsnet"
    ],
    "domains": [
      "www.cbssports.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Sanders reportedly suffered an injury early during Wednesday's practice session",
      "<p>The quarterbacks in Cleveland can&#8217;t escape the injury bug. </p>\n<p>Cleveland Browns rookie QB Shedeur Sanders injured his oblique while throwing at practice, ESPN&#8217;s Adam Schefter reported on Wednesday.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/08/13/2608029c-59ef-4fba-b886-3b8435117a6a/sn.jpg",
    "titles": [
      "Browns QB Shedeur Sanders suffers oblique injury that could hold him out of preseason Week 2",
      "Browns QB Shedeur Sanders injured at practice"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.788,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.623,
    "summary": "Cleveland Browns rookie QB Shedeur Sanders suffered an oblique injury during practice on Wednesday. The injury adds to the list of quarterback injuries in Cleveland. The current status of Sanders' injury and recovery timeline is not provided in the sources.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 40 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "New Delivery Service Launches in 1,000+ Cities, Eyes 2,300 by Year-End",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Wed, 13 Aug 2025 20:04:22 GMT",
    "source": "CNBC",
    "sources": [
      "TechCrunch",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "techcrunch.com"
    ],
    "snippets": [
      "The service is launching in more than 1,000 U.S. cities and towns, with plans to expand to at least 2,300 locations by the end of this year.",
      "Shoppers can now order fresh grocery items, including produce, dairy, meat, seafood, baked goods, and more, alongside everyday household products, electronics, and other items available for same-day delivery."
    ],
    "image_url": "",
    "titles": [
      "Amazon launches same-day delivery of meat, eggs, produce in more than 1,000 cities",
      "Amazon rolls out same-day delivery of perishable groceries in 1,000 US cities"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.762,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.618,
    "summary": "A new delivery service has launched in over 1,000 U.S. cities and towns, offering same-day delivery of fresh groceries such as produce, dairy, meat, seafood, and baked goods, in addition to household products and electronics. The service aims to expand to at least 2,300 locations by the end of the year.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 55 tokens",
    "image": {
      "src": "icons/briefcase.svg",
      "thumbnail": "icons/briefcase.svg",
      "alt": "business",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Carolina Hurricanes Owner Expands to Pickleball, Trail Blazers Change Hands",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Wed, 13 Aug 2025 17:49:34 GMT",
    "source": "CNBC",
    "sources": [
      "Sportsnet",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Dundon owns the NHL's Carolina Hurricanes, and he's the majority owner of the Pro Pickleball Association and Major League Pickleball.",
      "<p>The Portland Trail Blazers are the latest NBA franchise to see their ownership change hands.</p>"
    ],
    "image_url": "",
    "titles": [
      "Tom Dundon to buy the Portland Trail Blazers from Paul Allen's estate",
      "Reports: Hurricanes owner Tom Dundon agrees to purchase Portland Trail Blazers"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.727,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.618,
    "summary": "Tom Dundon, the owner of the NHL's Carolina Hurricanes, is also the majority owner of the Pro Pickleball Association and Major League Pickleball. The Portland Trail Blazers are undergoing an ownership change in the NBA.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 36 tokens",
    "image": {
      "src": "icons/briefcase.svg",
      "thumbnail": "icons/briefcase.svg",
      "alt": "business",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Trump Hints at Discussing Russian Hack in Putin Meeting",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Wed, 13 Aug 2025 17:30:41 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMie0FVX3lxTE8xcGZjNXJLMi1hTWtqZjdIVUhDODZteG1FcW9ZZ2ctMk5LY2YzbE5GdU5ZQXdPcEF0Nkp6R0JXTGExWmkxU0o0am45Z2UxZUM5ZzBMVVc5Ukg3eHlWYmpCaVo4VEswNGItQVhNa09oVVd0bGY5VHZBV2F1cw?oc=5\" target=\"_blank\">Trump on suspected Russian court hack: \"Are you surprised?\"</",
      "President Donald Trump said that he \"could\" bring up the hack during his upcoming meeting with Russian President Vladimir Putin in Alaska."
    ],
    "image_url": "",
    "titles": [
      "Trump on suspected Russian court hack: \"Are you surprised?\" - Axios",
      "Trump shrugs off suspected Russian hack of U.S. federal courts: 'Are you surprised?'"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.723,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.617,
    "summary": "President Donald Trump hinted at possibly discussing the suspected Russian court hack during his upcoming meeting with Russian President Vladimir Putin in Alaska. The outcome of the meeting and whether the hack was addressed remains uncertain.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 36 tokens",
    "image": {
      "src": "icons/russia.svg",
      "thumbnail": "icons/russia.svg",
      "alt": "russian flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Perplexity Offers $34.5B for Chrome After Google Monopoly Ruling",
    "domain": "business",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-08-13T11:38:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Fortune",
      "Deutsche Welle"
    ],
    "domains": [
      "fortune.com",
      "www.dw.com"
    ],
    "snippets": [
      "US antitrust officials proposed last year that Google be forced to sell its Chrome web browser, after the company was found guilty of illegally monopolizing the search market. Now a potential buyer has stepped forward.",
      "Perplexity's AI web browser, Comet, is mighty impressive, but the company also made an audacious $34.5 billion unsolicited bid to buy Chrome off Google."
    ],
    "image_url": "",
    "titles": [
      "Google Chrome: AI startup Perplexity wants to buy browser",
      "Is Perplexity the next Google?"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.653,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.596,
    "summary": "US antitrust officials, after finding Google guilty of monopolizing the search market, suggested the company sell its Chrome browser. Perplexity, known for its AI browser Comet, has made an unsolicited offer of $34.5 billion to purchase Chrome from Google.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 40 tokens",
    "image": {
      "src": "icons/briefcase.svg",
      "thumbnail": "icons/briefcase.svg",
      "alt": "business",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Soybean Plants Can Inherit Stress Responses, Study Finds",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Thu, 14 Aug 2025 03:36:31 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "phys.org"
    ],
    "snippets": [
      "When soybean plants survive attacks from insects and periods of drought, they remember. While plants don't remember in the way animals do, research out of the Arkansas Agricultural Experiment Station shows that soybean plants can pass on adaptive responses to stress—like those caused by hungry insec"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/study-soybeans-seem-to.jpg",
    "titles": [
      "Soybeans seem to inherit the bad memories of their parents"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.99,
      "consensus": 0.393,
      "constructiveness": 0.075,
      "proximity": 0.5
    },
    "score": 0.494,
    "summary": "Research from the Arkansas Agricultural Experiment Station reveals that soybean plants can inherit adaptive stress responses to threats such as insect attacks and drought. This means that, although plants do not have memories like animals, they can transfer their experiences of stress to their offspring, enabling future generations to better withstand similar challenges.",
    "constructiveness_score": 0.075,
    "constructiveness_reason": "1 constructive keywords out of 53 tokens",
    "image": {
      "src": "icons/beaker.svg",
      "thumbnail": "icons/beaker.svg",
      "alt": "science",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Cowboy’s e-bikes granted a second life",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-08-14T04:00:00-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "www.theverge.com"
    ],
    "snippets": [
      "After months of speculation over the e-bike maker’s imminent demise, Cowboy says it now has the financial backing it needs to survive. The Brussels-based maker of boutique e-bikes says it has secured short-term financing to keep the lights on and a commitment from Rebirth Group Holding that should “"
    ],
    "image_url": "",
    "titles": [
      "Cowboy’s e-bikes granted a second life"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.998,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.488,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 8 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Climate Change Added 2°C to Nordic Heatwave, Impacting Health and Ecosystems",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Thu, 14 Aug 2025 03:52:51 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "phys.org"
    ],
    "snippets": [
      "Human-caused climate change made a recent Nordic heatwave about 2C hotter, putting a strain on healthcare, ecosystems and indigenous Sami reindeer herders in a region ill-equipped for such events, researchers said on Thursday."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/nordic.jpg",
    "titles": [
      "Climate change made Nordic heatwave 2C hotter: study"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.995,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.487,
    "summary": "Researchers have determined that human-caused climate change increased the temperature of a recent Nordic heatwave by approximately 2°C. This exacerbation has impacted healthcare, ecosystems, and indigenous Sami reindeer herders in an area not well-prepared for such extreme weather conditions.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 42 tokens",
    "image": {
      "src": "icons/leaf.svg",
      "thumbnail": "icons/leaf.svg",
      "alt": "climate",
      "credit": "Tabler",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Colorado Rabbits with Horn-Like Growths Due to Common Virus, No Alarm Needed",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Thu, 14 Aug 2025 03:51:12 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "phys.org"
    ],
    "snippets": [
      "A group of rabbits in Colorado with grotesque, hornlike growths may seem straight out of a low-budget horror film, but scientists say there's no reason to be spooked—the furry creatures merely have a relatively common virus."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/rabbits-with-horns-in.jpg",
    "titles": [
      "Rabbits with 'horns' in Colorado are being called 'Frankenstein bunnies.' Here's why"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.995,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.487,
    "summary": "In Colorado, rabbits have been observed with unusual, horn-like growths, sparking interest and concern. However, scientists have identified these growths as symptoms of a relatively common virus affecting the animals. They assure the public there is no cause for alarm regarding these peculiar appearances.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 45 tokens",
    "image": {
      "src": "icons/beaker.svg",
      "thumbnail": "icons/beaker.svg",
      "alt": "science",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Scientists Uncover How Amaranth Plants Resist Zinc Toxicity",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Thu, 14 Aug 2025 03:36:37 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "phys.org"
    ],
    "snippets": [
      "Scientists from Immanuel Kant Baltic Federal University, together with researchers from St. Petersburg State University and K.A.Timiryazev Institute of Plant Physiology RAS, have defined key changes in the metabolism of amaranth plants that help them to resist the toxic influence of zinc."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/sugars-and-organic-aci.jpg",
    "titles": [
      "Sugars and organic acids save amaranth from zinc poisoning"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.99,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.486,
    "summary": "Researchers from Immanuel Kant Baltic Federal University, St. Petersburg State University, and K.A.Timiryazev Institute of Plant Physiology RAS have identified significant metabolic adjustments in amaranth plants that enable them to withstand the toxic effects of zinc. This discovery contributes to the understanding of plant resilience to heavy metal stress.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 51 tokens",
    "image": {
      "src": "icons/beaker.svg",
      "thumbnail": "icons/beaker.svg",
      "alt": "science",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Study Analyzes Astrobiology Portrayal 1996-2024",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Thu, 14 Aug 2025 03:36:12 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "phys.org"
    ],
    "snippets": [
      "Astrobiology poses fundamental questions about life in the universe: How did it emerge? Is there life beyond Earth? In a recently published study in PLOS One, researchers from Leiden University investigated how the field was portrayed in the public sphere from 1996 to 2024 by shining light on what s"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/speculations-about-ext.jpg",
    "titles": [
      "Speculations about extraterrestrial life peak in news articles—and in scientist quotes"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.989,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.486,
    "summary": "A study published in PLOS One by Leiden University researchers analyzed the public portrayal of astrobiology from 1996 to 2024. The study focused on understanding the field's key questions, such as the origins of life and the possibility of extraterrestrial existence.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 42 tokens",
    "image": {
      "src": "icons/beaker.svg",
      "thumbnail": "icons/beaker.svg",
      "alt": "science",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "AI Tool HEAT-ML Identifies Safe Zones in Fusion Reactors to Boost Safety",
    "domain": "science",
    "source_domain": "www.sciencedaily.com",
    "location": "global",
    "published": "Wed, 13 Aug 2025 22:16:06 EDT",
    "source": "ScienceDaily",
    "sources": [
      "ScienceDaily"
    ],
    "domains": [
      "www.sciencedaily.com"
    ],
    "snippets": [
      "Scientists have developed a lightning-fast AI tool called HEAT-ML that can spot hidden “safe zones” inside a fusion reactor where parts are protected from blistering plasma heat. Finding these areas, known as magnetic shadows, is key to keeping reactors running safely and moving fusion energy closer"
    ],
    "image_url": "",
    "titles": [
      "AI finds hidden safe zones inside a fusion reactor"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.885,
      "consensus": 0.393,
      "constructiveness": 0.073,
      "proximity": 0.5
    },
    "score": 0.48,
    "summary": "Scientists have created HEAT-ML, an AI tool designed to identify \"safe zones\" or \"magnetic shadows\" within fusion reactors. These zones are crucial for protecting reactor parts from extreme plasma heat, thereby enhancing reactor safety and advancing fusion energy technology. This development represents a significant step towards the operational efficiency and longevity of fusion reactors.",
    "constructiveness_score": 0.073,
    "constructiveness_reason": "1 constructive keywords out of 55 tokens",
    "image": {
      "src": "icons/robot.svg",
      "thumbnail": "icons/robot.svg",
      "alt": "ai",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Otter Habits May Aid in Detecting Environmental Health Risks",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Thu, 14 Aug 2025 00:00:01 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "phys.org"
    ],
    "snippets": [
      "North American river otters have terrible hygiene when it comes to their food. They eat, play and defecate in the same place. But their unhealthy habits make them ideal for detecting future health threats in the environment, according to scientists."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/river-otters-unfazed-b-3.jpg",
    "titles": [
      "How river otters' terrible food hygiene benefits ecosystem health monitoring"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.918,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.479,
    "summary": "Scientists have found that North American river otters exhibit poor hygiene habits by eating, playing, and defecating in the same area. Despite this, researchers believe these habits make otters well-suited for detecting potential health risks in the environment. This behavior could help scientists monitor and identify future health threats.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 50 tokens",
    "image": {
      "src": "icons/beaker.svg",
      "thumbnail": "icons/beaker.svg",
      "alt": "science",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Apple&#8217;s plan for AI could make Siri the animated center of your smart home",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-08-13T15:41:23-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "www.theverge.com"
    ],
    "snippets": [
      "Apple is developing a bunch of products and features to deliver its vision of AI, including multiple robots, a smart home display, and a revamped version of Siri with new technology powering it, according to an extensive report from Bloomberg. The company’s generative AI efforts lag those from other"
    ],
    "image_url": "",
    "titles": [
      "Apple&#8217;s plan for AI could make Siri the animated center of your smart home"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.772,
      "consensus": 0.393,
      "constructiveness": 0.25,
      "proximity": 0.5
    },
    "score": 0.475,
    "constructiveness_score": 0.25,
    "constructiveness_reason": "1 constructive keywords out of 16 tokens",
    "image": {
      "src": "icons/robot.svg",
      "thumbnail": "icons/robot.svg",
      "alt": "ai",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "UC Berkeley Study: Oxytocin Key to Fast Friendship Formation",
    "domain": "science",
    "source_domain": "www.sciencedaily.com",
    "location": "global",
    "published": "Wed, 13 Aug 2025 23:01:14 EDT",
    "source": "ScienceDaily",
    "sources": [
      "ScienceDaily"
    ],
    "domains": [
      "www.sciencedaily.com"
    ],
    "snippets": [
      "UC Berkeley scientists found oxytocin is key for quickly forming strong friendships, but less critical for mate bonds. In prairie voles, a lack of oxytocin receptors delayed bonding and reduced partner selectivity, changing how the brain releases oxytocin and affecting social behavior."
    ],
    "image_url": "",
    "titles": [
      "The surprising brain chemistry behind instant friendships"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.899,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.468,
    "summary": "UC Berkeley researchers discovered that oxytocin plays a crucial role in quickly developing strong friendships, though it's less important for creating mate bonds. In studies with prairie voles, the absence of oxytocin receptors led to slower bonding and less selectivity in choosing partners. This finding highlights how oxytocin influences brain activity and social interactions.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 55 tokens",
    "image": {
      "src": "icons/beaker.svg",
      "thumbnail": "icons/beaker.svg",
      "alt": "science",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Stripe apologizes for customer service agents claiming LGBTQ products were banned",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-08-13T16:39:15-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "www.theverge.com"
    ],
    "snippets": [
      "Stripe, a financial services company that acts as a payment processor for millions of businesses including itch.io, has issued an apology following reports that members of its support team told callers the business does not support the sale of LGBTQ content. \"We apologize: the information given by o"
    ],
    "image_url": "",
    "titles": [
      "Stripe apologizes for customer service agents claiming LGBTQ products were banned"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.788,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.453,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 11 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Tesla&#8217;s graphics are about to get Unreal",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-08-13T18:28:25-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "www.theverge.com"
    ],
    "snippets": [
      "Tesla’s in-car visualizations for features like Autopilot and Full Self-Driving might be getting an upgrade with a switch to Epic Games’ Unreal Engine. As reported by Not a Tesla App, Tesla hacker greentheonly says they found evidence of the change in Tesla’s 2025.20 firmware for Tesla Model S and M"
    ],
    "image_url": "",
    "titles": [
      "Tesla&#8217;s graphics are about to get Unreal"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.818,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.452,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 9 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Microplastics are everywhere — including in the air around plastic treaty negotiations",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-08-13T16:11:38-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "www.theverge.com"
    ],
    "snippets": [
      "Thousands of delegates have descended upon Geneva this week for what's supposed to be the culmination of years of negotiations that, if successful, are supposed to end in a groundbreaking global plastics treaty. They might be breathing in the very thing they're trying to clean up as they negotiate. "
    ],
    "image_url": "",
    "titles": [
      "Microplastics are everywhere — including in the air around plastic treaty negotiations"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.78,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.451,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 11 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Report: Apple’s smart home ambitions include “tabletop robot,” cameras, and more",
    "domain": "technology",
    "source_domain": "arstechnica.com",
    "location": "global",
    "published": "Wed, 13 Aug 2025 21:38:49 +0000",
    "source": "Ars Technica",
    "sources": [
      "Ars Technica"
    ],
    "domains": [
      "arstechnica.com"
    ],
    "snippets": [
      "Apple has purportedly been working on new smart home devices for years now."
    ],
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/06/apple-placeholder-wwdc-2025-1152x648.jpeg",
    "titles": [
      "Report: Apple’s smart home ambitions include “tabletop robot,” cameras, and more"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.804,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.449,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 12 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Kodak says it’ll figure things out and won’t shut down",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-08-13T16:52:22-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "www.theverge.com"
    ],
    "snippets": [
      "In a regulatory filing on Monday, Kodak warned investors that the 133-year-old photography company didn’t have the financing it would need to pay around $500 million of debt obligations that were coming due, raising doubts about the company’s ability to continue. But in a statement shared with The V"
    ],
    "image_url": "",
    "titles": [
      "Kodak says it’ll figure things out and won’t shut down"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.791,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.446,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 12 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  }
]