[
  {
    "title": "Packers QB Jordan Love to Undergo Thumb Surgery, Expected for Season Opener",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 12 Aug 2025 11:39:03 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "Yahoo Sports",
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "www.freep.com",
      "www.cbssports.com",
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "Jordan Love will undergo a procedure to repair a ligament injury to his left thumb, but the Packers expect the star QB to be ready for their season opener.",
      "Love has a ligament issue in his non-throwing hand",
      "The procedure on his non-throwing hand is not expected to keep him out of the season opener, per the team's general manager.",
      "<p>After an injury marred the beginning of his 2024 season, Jordan Love is facing another minor setback.</p>"
    ],
    "image_url": "",
    "titles": [
      "Packers QB Love to have left thumb procedure",
      "Packers QB Jordan Love will have procedure on left thumb ligament, hopes to return to practice next week",
      "Green Bay Packers QB `Jordan Love, who opens season against Lions, has thumb procedure",
      "Packers QB Jordan Love has thumb procedure, expected to be ready Week 1"
    ],
    "score_components": {
      "magnitude": 0.9,
      "recency": 0.99,
      "consensus": 0.985,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.834,
    "summary": "Jordan Love, the Packers' quarterback, will have surgery to fix a ligament injury in his left thumb, his non-throwing hand. Despite this setback, the team's general manager has confirmed that Love is expected to recover in time for the season opener. This follows an earlier injury that affected the start of his 2024 season.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 56 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Trump Extends Tariff Pause on Chinese Imports for 90 Days",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Tue, 12 Aug 2025 05:47:35 -0400",
    "source": "NPR",
    "sources": [
      "Axios",
      "Al Jazeera",
      "CNBC",
      "Global News",
      "New York Times",
      "NPR"
    ],
    "domains": [
      "www.cnbc.com",
      "news.google.com",
      "globalnews.ca",
      "www.npr.org",
      "www.aljazeera.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "President Trump's executive order extends a reprieve from the threat of rising tariffs between the world's two largest economies.",
      "US president extends deadline on higher Chinese tariffs hours before agreement was due to expire.",
      "<a href=\"https://news.google.com/rss/articles/CBMicEFVX3lxTE9FNnZTQUw0dlRTUjdpTmpCTmRfWHJnbnNGTEtsVjhwVEdRaTRjOXVjV0FsbGFxQXVnUVJ1NHl1Sl85WmpxZERIeVFxRXo0Vk9wZFFoZW5xZ1ZMYnFNN1NRMjJXdU9ieElRbXZZS3VpMFU?oc=5\" target=\"_blank\">U.S., China extend tariff pause another 90 days</a>&nbsp;&nbsp;<font color=\"",
      "President Donald Trump has signed an executive order that will prevent U.S. tariffs on Chinese goods from spiking for another 90 days.",
      "President Trump’s order continues a reprieve from the threat of escalating tariffs and export controls, which rocked the global economy earlier this year.",
      "Trump posted on his Truth Social platform that he signed the executive order for the extension, and that “all other elements of the Agreement will remain the same.”"
    ],
    "image_url": "",
    "titles": [
      "U.S. and China extend tariff truce deadline for another 3 months",
      "Trump extends China tariff deadline for the second time. What does it mean?",
      "U.S., China extend tariff pause another 90 days - Axios",
      "Trump extends China tariff deadline by 90 days",
      "Trump Extends China Tariff Truce by Three Months",
      "U.S., China extend tariff deadline for 90 days just hours before expiration"
    ],
    "score_components": {
      "magnitude": 0.94,
      "recency": 0.876,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.829,
    "summary": "President Donald Trump signed an executive order extending the pause on increasing tariffs against Chinese imports for another 90 days, just before the previous pause was set to expire at midnight in Beijing. This action prevents the expected rise in tariffs that was scheduled for Tuesday.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 46 tokens",
    "image": {
      "src": "icons/china.svg",
      "thumbnail": "icons/china.svg",
      "alt": "chinese flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Taylor Swift Announces 12th Album \"The Life of a Showgirl\"",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 12 Aug 2025 09:36:18 GMT",
    "source": "BBC",
    "sources": [
      "Forbes",
      "ESPN",
      "BBC",
      "The Guardian",
      "Global News"
    ],
    "domains": [
      "www.bbc.com",
      "www.theguardian.com",
      "globalnews.ca",
      "www.espn.com",
      "www.forbes.com"
    ],
    "snippets": [
      "The Life of a Showgirl revealed as the popstar's latest album after intense speculation from fans.",
      "After a teaser post with a Taylor Swift-shaped silhouette fueled rumors, it was confirmed that the pop star will make her first appearance on the Kelce brothers' podcast.",
      "<p>Singer announced her 12th album at 12.12am on 12 August after a countdown, mysterious posts and teasing an appearance on her boyfriend Travis Kelce’s New Heights podcast</p><p>Taylor Swift has announced her next album, The Life of a Showgirl.</p><p>Swift is known for dropping hints and clues for ",
      "'This is my brand-new album, \"The Life of a Showgirl,\"' Taylor Swift teased on her boyfriend's podcast as she held up the blurred-out vinyl.",
      "Taylor Swift’s new Spotify playlist features songs all co-created with Max Martin and Shellback, fueling speculation they’re behind her new album The Life of a Showgirl."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/0834/live/9e8de000-775c-11f0-89ee-73563f6604dd.jpg",
    "titles": [
      "Taylor Swift announces new album on boyfriend Travis Kelce's podcast",
      "👀 Taylor Swift teases new album on Kelce pod",
      "Taylor Swift announces new album The Life of a Showgirl",
      "Taylor Swift announces new album, ‘The Life of a Showgirl’",
      "Taylor Swift Shares A Major Hint About Her New Album"
    ],
    "score_components": {
      "magnitude": 0.9,
      "recency": 0.855,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.786,
    "summary": "Taylor Swift has announced her 12th studio album titled \"The Life of a Showgirl,\" with details and the release date yet to be disclosed. The announcement came after a series of teasers, including a countdown and mysterious posts, culminating in a reveal at 12.12 am on 12 August. Swift also shared a clip from an upcoming appearance on her boyfriend Travis Kelce’s podcast, 'New Heights,' where more information about the album is expected to be unveiled.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 78 tokens",
    "image": {
      "src": "icons/newspaper.svg",
      "thumbnail": "icons/newspaper.svg",
      "alt": "general",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "July Inflation Rises 2.7%, Trump Attributes Success to Policies",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Tue, 12 Aug 2025 08:46:07 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "Financial Times",
      "Global News"
    ],
    "domains": [
      "www.npr.org",
      "globalnews.ca",
      "www.ft.com"
    ],
    "snippets": [
      "Inflation remained elevated last month as President Trump's tariffs continued to make their way into the prices that consumers pay. The average cost of living in July was up 2.7%.",
      "President slams Goldman Sachs as he hails data as evidence his policies are working",
      "Consumer prices rose 2.7 per cent in July from a year earlier, the Labor Department said Tuesday. Excluding the volatile food and energy categories, core prices rose 3.1 per cent."
    ],
    "image_url": "",
    "titles": [
      "Inflation remains elevated as Trump's tariffs take hold",
      "US inflation holds steady at 2.7% in July despite Trump’s tariffs",
      "U.S. inflation holds steady at 2.7% as consumer prices rise"
    ],
    "score_components": {
      "magnitude": 0.84,
      "recency": 0.932,
      "consensus": 0.897,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.78,
    "summary": "In July, consumer prices increased by 2.7% compared to the previous year, with core prices, excluding food and energy, rising by 3.1%, according to the Labor Department. This inflation rise is partially attributed to the impact of President Trump's tariffs. Despite the elevated inflation, President Trump praised the economic data, suggesting his policies are effective, and criticized Goldman Sachs.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 62 tokens",
    "image": {
      "src": "icons/banknotes.svg",
      "thumbnail": "icons/banknotes.svg",
      "alt": "inflation",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Trump Criticizes Fed Chair Powell Over Renovation Costs, Urges Rate Cut",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Tue, 12 Aug 2025 15:36:32 GMT",
    "source": "CNBC",
    "sources": [
      "Forbes",
      "CNBC",
      "Fortune"
    ],
    "domains": [
      "www.forbes.com",
      "www.cnbc.com",
      "fortune.com"
    ],
    "snippets": [
      "President Trump blasted Federal Reserve Chair Jerome Powell over the multi-billion-dollar renovation of the central bank's headquarters.",
      "Trump and his allies have accused the Federal Reserve of mismanaging the reconstruction of its headquarters.",
      "Trump returned to his sharp critiques of the Fed chair, saying \"Jerome 'Too Late' Powell must NOW lower the rate\" after the inflation report came in a bit cooler than expected."
    ],
    "image_url": "",
    "titles": [
      "Trump threatens Fed chair Powell with 'major lawsuit,' demands interest rate cut",
      "Trump Might Greenlight ‘Major Lawsuit’ Against Fed Chair Jerome Powell",
      "Trump threatens legal action against Powell over Fed HQ, demands immediate rate cuts as inflation holds steady"
    ],
    "score_components": {
      "magnitude": 0.84,
      "recency": 0.969,
      "consensus": 0.897,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.762,
    "summary": "President Trump criticized Federal Reserve Chair Jerome Powell regarding the costly renovation of the Fed's headquarters, accusing the Federal Reserve of mismanagement. Trump also called for Powell to lower interest rates following a cooler-than-expected inflation report, continuing his pattern of public critiques against the Fed chair.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 49 tokens",
    "image": {
      "src": "icons/percent.svg",
      "thumbnail": "icons/percent.svg",
      "alt": "rate",
      "credit": "Feather",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Trump Orders Federal Takeover of DC Police, Deploys 800 National Guard Troops",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Tue, 12 Aug 2025 05:00:00 -0400",
    "source": "NPR",
    "sources": [
      "Al Jazeera",
      "NPR",
      "Axios"
    ],
    "domains": [
      "www.npr.org",
      "news.google.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Some residents are skeptical that President Trump's use of tough police tactics will work to solve complex social ills.",
      "Donald Trump announced a federal takeover of Washington, DC’s police and the deployment of 800 National Guard troops.",
      "<a href=\"https://news.google.com/rss/articles/CBMihgFBVV95cUxPMXVFQ3BrTTNsbHRfNkVTcENlVC12RUZJRFJRR2R2QnNTU2otLXRweUM3N0pRZEpFQ1ZOYndJUmJMeHFNbzBWcTU3SDJwSjlqYk1JcGZ1VXFzZGhPaUNjQUdkOGg1YXQ5N0RBdHBaTEplaGxYeEtKdmowOEdMWUxZbjIxZndydw?oc=5\" target=\"_blank\">Photos: Scenes from Trump's takeover of D.C.<"
    ],
    "image_url": "",
    "titles": [
      "Trump's Washington, D.C., takeover targets a host of groups, many of them vulnerable",
      "What is Trump’s Washington, DC security takeover plan?",
      "Photos: Scenes from Trump's takeover of D.C. - Axios"
    ],
    "score_components": {
      "magnitude": 0.82,
      "recency": 0.862,
      "consensus": 0.897,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.759,
    "summary": "President Donald Trump has announced a federal takeover of Washington, D.C.'s police force and the deployment of 800 National Guard troops in response to complex social issues. This move has led to skepticism among some residents about its effectiveness. Current efforts to address these challenges now include increased federal involvement and military presence in the capital.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 58 tokens",
    "image": {
      "src": "icons/newspaper.svg",
      "thumbnail": "icons/newspaper.svg",
      "alt": "general",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Al Jazeera Reporter and Colleagues Killed in Israeli Airstrike in Gaza",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 12 Aug 2025 11:49:16 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Axios",
      "New York Times"
    ],
    "domains": [
      "www.bbc.com",
      "news.google.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "Prominent reporter Anas al-Sharif and six other journalists were killed when Israel targeted a tent used by media, the broadcaster said.",
      "<a href=\"https://news.google.com/rss/articles/CBMiggFBVV95cUxOZDVCbzJPY1l5dGFEU2EzaVZQWG42NXJGQldYMGpMeDdXSHB5b2pDS0JjR0VYZHVtM0xuZHpCTHc5ODJrc1VsOGV3U0NWRzFOajFab2VQNlhEMklicDRIc1l0Y1RiTjRPU2haWWtpUndyVDlSZjY1U2tPVFh5SjVJbWN3?oc=5\" target=\"_blank\">What to know about the 6 journalists killed coverin",
      "Officials accused Anas al-Sharif of being a Hamas operative posing as a reporter. Al Jazeera says he and the other four victims all worked for the network.",
      "Anas al-Sharif, a well-known correspondent, was among those killed. Israel said it had targeted Mr. al-Sharif, claiming he worked for Hamas, which he had denied."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/b9f7/live/32f24d10-7773-11f0-8071-1788c7e8ae0e.jpg",
    "titles": [
      "Who were the Al Jazeera journalists killed by Israel in Gaza?",
      "What to know about the 6 journalists killed covering Israel's war in Gaza - Axios",
      "Who Were the Al Jazeera Journalists Killed in an Israeli Strike in Gaza?",
      "Israeli Strike Kills 5 Al Jazeera Journalists, Network Says"
    ],
    "score_components": {
      "magnitude": 0.86,
      "recency": 0.895,
      "consensus": 0.897,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.754,
    "summary": "Anas al-Sharif, a 28-year-old Al Jazeera reporter with a significant social media following, and four colleagues were killed in an Israeli airstrike targeting a media tent in northern Gaza. Israel has accused al-Sharif of being a Hamas operative, a claim disputed by Al Jazeera. This incident is part of a broader conflict in which nearly 270 journalists and media workers have been killed since Israel launched its war on Gaza.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 74 tokens",
    "image": {
      "src": "icons/israel.svg",
      "thumbnail": "icons/israel.svg",
      "alt": "israeli flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Spirit Airlines Warns of Uncertain Future Amid Losses",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Tue, 12 Aug 2025 14:43:04 GMT",
    "source": "CNBC",
    "sources": [
      "Fortune",
      "CNBC",
      "Business Insider"
    ],
    "domains": [
      "www.cnbc.com",
      "www.businessinsider.com",
      "fortune.com"
    ],
    "snippets": [
      "Spirit AIrlines issued a going-concern warning in its quarterly report.",
      "Spirit Airlines said there was \"substantial doubt\" about its ability to continue as a going concern, as travel demand has weakened and losses mounted.",
      "“There is substantial doubt as to the Company’s ability to continue as a going concern within 12 months.”"
    ],
    "image_url": "",
    "titles": [
      "Spirit Airlines warns it might not be able to survive without more cash",
      "Spirit Airlines warns it may not survive another year after huge losses",
      "Spirit Airlines warns it might not be able to survive the next year"
    ],
    "score_components": {
      "magnitude": 0.82,
      "recency": 0.951,
      "consensus": 0.897,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.751,
    "summary": "Spirit Airlines issued a warning in its quarterly report, expressing \"substantial doubt\" about its ability to continue operating over the next 12 months due to weakened travel demand and increasing losses. This statement indicates concerns about the airline's future viability.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 41 tokens",
    "image": {
      "src": "icons/briefcase.svg",
      "thumbnail": "icons/briefcase.svg",
      "alt": "business",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Everton Secures Jack Grealish on Loan from Man City with Buy Option",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 12 Aug 2025 15:58:56 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Yahoo Sports",
      "Sky Sports"
    ],
    "domains": [
      "www.bbc.com",
      "onefootball.com",
      "www.skysports.com"
    ],
    "snippets": [
      "Everton sign Manchester City and England winger Jack Grealish on a season-long loan.",
      "Manchester City and Everton have announced the transfer of Jack Grealish to the Hill Dickinson Stadium on a season-long loan agreement for the 2025/26 campaign.The deal concludes a summer of intense s...",
      "Jack Grealish has joined Everton on a season-long loan from Manchester City, with the deal including an option to make the move permanent for around £50 million (€57.7m).City originally paid a Brit...",
      "Everton have completed the signing of Jack Grealish from Manchester City on a season-long loan."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/47c1/live/8821d870-7794-11f0-907d-6ff0082c2def.jpg",
    "titles": [
      "Everton complete loan deal for Man City's Grealish",
      "Everton and Manchester City announce Jack Grealish loan transfer",
      "Everton announce Jack Grealish's arrival",
      "Grealish signs for Everton on loan"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.976,
      "consensus": 0.897,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.749,
    "summary": "Everton has secured Jack Grealish on a season-long loan from Manchester City for the 2025/26 season. The agreement, announced by both clubs, includes an option for Everton to make the transfer permanent for approximately £50 million. This move concludes a summer of significant transfer activity.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 47 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Cristiano Ronaldo and Georgina Rodriguez Announce Engagement",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 11 Aug 2025 20:47:10 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "www.cbssports.com",
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "Cristiano Ronaldo's bride-to-be Georgina Rodriguez revealed her engagement to the soccer star with a post showing her ring on Instagram.",
      "Rodriguez made the announcement in an Instagram post on Monday",
      "<p>Soccer great Cristiano Ronaldo and his long-term partner Georgina Rodriguez are engaged.</p>"
    ],
    "image_url": "",
    "titles": [
      "Cristiano Ronaldo, Georgina Rodriguez share engagement news with dazzling ring",
      "Cristiano Ronaldo, Georgina Rodriguez announce engagement after eight years together",
      "Cristiano Ronaldo, partner Georgina Rodriguez announce engagement"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.726,
      "consensus": 0.897,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.724,
    "summary": "Soccer star Cristiano Ronaldo's partner, Georgina Rodriguez, announced their engagement on Instagram by sharing a photo of her engagement ring. The couple, who have been together for a long time, are now engaged.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 34 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "China Hits Canadian Canola with 75.8% Duty, Escalating Trade Tensions",
    "domain": "general",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Tue, 12 Aug 2025 14:16:50 +0000",
    "source": "Global News",
    "sources": [
      "CityNews",
      "Global News"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "globalnews.ca"
    ],
    "snippets": [
      "China escalated trade disputes with Canada on Tuesday by announcing a preliminary anti-dumping duty on Canadian canola imports of more than 75 per cent.",
      "China has announced preliminary tariffs on Canadian canola following an anti-dumping investigation launched last year in response to Canada&#8217;s tax on Chinese electric vehicles. Canadian canola exports to China will face a 75.8 per cent duty beginning on Thursday. The move comes nearly a year af"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/03/715211f4f3ceec986b94a8f7d96548ef61ec92e3865256f18cf0758e936568c7.jpg?quality=65&strip=all",
    "titles": [
      "China adds ‘additional pressure’ with new tariffs on Canadian canola",
      "China announces 75.8% tariffs on Canadian canola"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.962,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.715,
    "summary": "China has imposed a preliminary anti-dumping duty of 75.8% on Canadian canola imports, effective Thursday. This action escalates trade tensions between the two nations, following an investigation that China began last year after Canada implemented a tax on Chinese electric vehicles.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 43 tokens",
    "image": {
      "src": "icons/canada.svg",
      "thumbnail": "icons/canada.svg",
      "alt": "canadian flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "UFC Plans Fight Night at White House, Awaits Trump's View on Paramount Deal",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 12 Aug 2025 11:39:03 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "UFC CEO Dana White said a fight night at the White House on the Fourth of July next year is \"absolutely going to happen.\"",
      "<p>Hours after Paramount and UFC announced a billion-dollar rights deal, Dana White said he had yet to hear from his friend, President Donald Trump, on his thoughts about the fight company’s new streaming home.</p>"
    ],
    "image_url": "",
    "titles": [
      "White: UFC fight at White House 'going to happen'",
      "A UFC fight at the White House? Dana White says it’s happening"
    ],
    "score_components": {
      "magnitude": 0.74,
      "recency": 0.99,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.703,
    "summary": "UFC CEO Dana White announced plans for a UFC fight night at the White House on July 4th next year, following a billion-dollar rights deal between Paramount and UFC. Despite the announcement, White mentioned he had not yet received feedback from President Donald Trump, a friend, about UFC's new streaming partnership with Paramount.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 55 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Royals Near .500 Despite Witt Jr.'s Efforts, Pitching Strength",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 12 Aug 2025 11:28:42 EST",
    "source": "ESPN",
    "sources": [
      "Forbes",
      "ESPN"
    ],
    "domains": [
      "www.forbes.com",
      "www.espn.com"
    ],
    "snippets": [
      "All of the important fantasy spin and actionable takeaways resulting from the latest baseball news.",
      "The Royals are stuck near .500 despite another excellent season from Bobby Witt Jr. and a good pitching staff. They failed to build a lineup around their star shortstop."
    ],
    "image_url": "",
    "titles": [
      "Bobby Witt Jr. returns for Royals; Astros' closer ailing",
      "Bobby Witt Jr. Can’t Do It All By Himself For The Stagnant Royals"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.986,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.688,
    "summary": "The Kansas City Royals are hovering around a .500 win-loss record for the season, despite strong performances from star shortstop Bobby Witt Jr. and their pitching staff. The team has struggled to assemble a supportive lineup around Witt, impacting their overall success.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 43 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Trump to Deploy National Guard, Control D.C. Police Amid Crime Concerns",
    "domain": "general",
    "source_domain": "www.bbc.co.uk",
    "location": "global",
    "published": "Mon, 11 Aug 2025 18:42:00 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Axios",
      "Deutsche Welle"
    ],
    "domains": [
      "www.bbc.co.uk",
      "news.google.com",
      "www.dw.com"
    ],
    "snippets": [
      "And how JD Vance’s English holiday is causing havoc in the Cotswolds",
      "US President Donald Trump claimed the city had been taken over by criminals and gangs. But police statistics show that violent crimes have decreased significantly in recent years.",
      "<a href=\"https://news.google.com/rss/articles/CBMiiwFBVV95cUxQakxHQVgzZ19lVkx0YVpKYVlud28zb0F0bmh3UGlRU1ZRenNzNmVKNXpFcmE3NE56RjNTRklVTktLU0RSR2dfaVY5UlZMZUlORWFwWWlsNWJ0SnpkQ1V5cUt6QzZ0LWN0UDZlVUNHX2xOWXlyUFBpYzhsNm8yMmdSeS1Tc2FpU2ExTlZv?oc=5\" target=\"_blank\">Trump to deploy National Guard to D.C. "
    ],
    "image_url": "https://ichef.bbci.co.uk/images/ic/240x135/p0j72y80.jpg",
    "titles": [
      "Americanswers…on 5 Live! Why is Donald Trump deploying the National Guard to Washington DC?",
      "Trump announces National Guard deployment in Washington, DC",
      "Trump to deploy National Guard to D.C. and federalize city police - Axios"
    ],
    "score_components": {
      "magnitude": 0.82,
      "recency": 0.627,
      "consensus": 0.897,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.687,
    "summary": "President Donald Trump announced plans to deploy the National Guard and take control of Washington D.C.'s Metropolitan Police Department, citing concerns over crime and homelessness. Despite Trump's claims of the city being \"overtaken\" by criminals and gangs, police statistics indicate a significant decrease in violent crimes in recent years. D.C.'s mayor has criticized the comparison to a war-torn country as exaggerated and misleading. Trump's actions are based on invoking section 740 of the District of Columbia Home Rule Act.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 86 tokens",
    "image": {
      "src": "icons/uk.svg",
      "thumbnail": "icons/uk.svg",
      "alt": "uk flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Liverpool, Arsenal Lead in 2025/26 Premier League; Historic Sky Sports Broadcast",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 12 Aug 2025 07:41:32 EST",
    "source": "ESPN",
    "sources": [
      "Sky Sports",
      "ESPN"
    ],
    "domains": [
      "www.skysports.com",
      "www.espn.com"
    ],
    "snippets": [
      "Liverpool and Arsenal dominate the list, but Man United managed some spots, too.",
      "The 2025/26 Premier League season will be the biggest ever on Sky Sports."
    ],
    "image_url": "",
    "titles": [
      "Ranked: The top 50 players going into the new Premier League season﻿",
      "What's new on Sky Sports this Premier League season"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.911,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.673,
    "summary": "Liverpool and Arsenal have a strong presence in the upcoming 2025/26 Premier League season, with Manchester United also securing some spots. The season is set to be the largest ever broadcast on Sky Sports.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 35 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "EU Leaders Back Ukraine's Sovereignty, Orbán Excluded",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 12 Aug 2025 15:19:36 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "www.bbc.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "The EU says \"the people of Ukraine must have the freedom to decide their future\".",
      "<p>Statement on Ukrainian sovereignty signed by all EU leaders except for Viktor Orbán before call with Trump</p><ul><li><p><a href=\"https://www.theguardian.com/world/ukraine\">Read all our coverage of the Ukraine war</a></p></li></ul><p>European Union leaders made a rallying call to defend Ukraine’s"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/107a/live/00afd280-777f-11f0-a975-cb151ca452f4.jpg",
    "titles": [
      "Ukraine's borders must not be redrawn by force, EU leaders warn ahead of Trump-Putin summit",
      "EU leaders defend Ukraine’s freedom to decide future ahead of Trump-Putin summit"
    ],
    "score_components": {
      "magnitude": 0.74,
      "recency": 0.963,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.672,
    "summary": "The European Union has issued a statement supporting Ukraine's sovereignty and the right of its people to determine their future. This declaration was signed by all EU leaders, with the exception of Viktor Orbán, ahead of a call with former President Trump. This move underscores the EU's unified stance on defending Ukraine amidst ongoing conflicts.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 57 tokens",
    "image": {
      "src": "icons/ukraine.svg",
      "thumbnail": "icons/ukraine.svg",
      "alt": "ukraine flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "James Cook Returns to Practice Amid Contract Talks",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Tue, 12 Aug 2025 14:47:38 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sportsnet"
    ],
    "domains": [
      "www.cbssports.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "The two-time Pro Bowler who is still seeking a contract extension took reps at practice Tuesday",
      "<p> Buffalo Bills coach Sean McDermott anticipates James Cook will practise Tuesday in what would be the running back’s first session since beginning his contract standoff by declining to participate on Aug. 3.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/08/12/cc72ec7c-dae0-4f94-a778-bb11bc35f925/ja.jpg",
    "titles": [
      "Bills' James Cook ends hold-in amid contract standoff: Sean McDermott says 'things have changed' for RB",
      "Bills’ Cook resumes practising after weeklong ‘hold-in’ as part of contract standoff"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.972,
      "consensus": 0.682,
      "constructiveness": 0.089,
      "proximity": 0.5
    },
    "score": 0.669,
    "summary": "Buffalo Bills running back and two-time Pro Bowler, James Cook, returned to practice on Tuesday for the first time since August 3, amid ongoing negotiations for a contract extension. Coach Sean McDermott confirmed Cook's participation, signaling a potential progress in his contract standoff.",
    "constructiveness_score": 0.089,
    "constructiveness_reason": "1 constructive keywords out of 45 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Trump to Nominate Heritage Foundation Economist as BLS Commissioner",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Tue, 12 Aug 2025 13:40:09 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMif0FVX3lxTE9yNXNQcUpRYTkwc3VRRlgyTzZzSmJrYjFMSjJDRmJKdDVCYVlITF81bGZlQWRRVk1xbWFBM3IzMGF5b3lYdkZmZUd2QUp0Z091d3g1RGRXcV9fQ0JseEJUZUQ1YWRjQ1VrTUVlTkVkR2hSaXBzS1d4akhQMjI3RXc?oc=5\" target=\"_blank\">Trump names Heritage's E.J. Antoni to lead Bureau of Lab",
      "President Trump, who claimed former BLS Commissioner Erika McEntarfer manipulated jobs data, said Antoni would release \"honest and accurate\" numbers."
    ],
    "image_url": "",
    "titles": [
      "Trump names Heritage's E.J. Antoni to lead Bureau of Labor Statistics - Axios",
      "Trump says he's nominating E.J. Antoni as Bureau of Labor Statistics commissioner"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.93,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.659,
    "summary": "President Donald Trump announced his intention to nominate E.J. Antoni, a chief economist at the conservative Heritage Foundation, as the new commissioner of the Bureau of Labor Statistics (BLS). This decision follows Trump's firing of the previous commissioner, Erika McEntarfer, citing dissatisfaction with a recent jobs report and accusing her of manipulating data. Trump asserts that Antoni will provide \"honest and accurate\" employment data.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 66 tokens",
    "image": {
      "src": "icons/briefcase.svg",
      "thumbnail": "icons/briefcase.svg",
      "alt": "business",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Former Uber Freight CEO Joins Waabi as COO Ahead of Autonomous Truck Launch",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Tue, 12 Aug 2025 15:35:48 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "TechCrunch"
    ],
    "domains": [
      "www.cnbc.com",
      "techcrunch.com"
    ],
    "snippets": [
      "Uber Freight CEO Lior Ron is joining autonomous trucking startup Waabi as COO and says the era of self-driving big rigs across U.S. roads is near.",
      "Self-driving truck maker Waabi has hired autonomous vehicle industry veteran and Uber Freight CEO Lior Ron to step in as chief operating officer, as the startup looks to scale its commercial operations ahead of its planned launch of driverless trucks on public highways later this year."
    ],
    "image_url": "",
    "titles": [
      "Uber Freight CEO joins self-driving truck company Waabi, says era of autonomous big rigs on U.S. roads is here",
      "Uber Freight CEO Lior Ron leaves to join self-driving startup Waabi as COO"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.968,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.659,
    "summary": "Lior Ron, previously CEO of Uber Freight, has been appointed as COO of Waabi, an autonomous trucking startup. This move comes as Waabi prepares to launch self-driving trucks on public highways later this year, signaling a significant step towards the commercialization of autonomous big rigs in the U.S.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 50 tokens",
    "image": {
      "src": "icons/briefcase.svg",
      "thumbnail": "icons/briefcase.svg",
      "alt": "business",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Liverpool Advances Talks for Crystal Palace's Marc Guehi",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 12 Aug 2025 14:29:16 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Sky Sports"
    ],
    "domains": [
      "www.bbc.com",
      "www.skysports.com"
    ],
    "snippets": [
      "Liverpool step up their bid to sign Crystal Palace and England centre-back Marc Guehi.",
      "Liverpool are in talks with Crystal Palace over the signing of Marc Guehi."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/3c33/live/d1e440d0-767a-11f0-8cce-85ad8ee5156e.jpg",
    "titles": [
      "Liverpool stepping up bid to sign Palace's Guehi",
      "Liverpool in talks with Palace to sign Guehi"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.946,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.655,
    "summary": "Liverpool is intensifying efforts to acquire Crystal Palace and England center-back Marc Guehi. The club is currently engaged in negotiations with Crystal Palace regarding the potential transfer of Guehi.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 30 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Apple Integrates ChatGPT Amid Musk's Antitrust Criticism",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Tue, 12 Aug 2025 13:18:03 GMT",
    "source": "CNBC",
    "sources": [
      "Financial Times",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "www.ft.com"
    ],
    "snippets": [
      "ChatGPT was ranked No. 1 in the top free apps section of the American iOS store. Apple has tied up with OpenAI to integrate ChatGPT into its products.",
      "Billionaire accuses tech group of unfairly favouring rival OpenAI"
    ],
    "image_url": "",
    "titles": [
      "Musk threatens 'immediate' legal action against Apple over alleged antitrust violations",
      "Musk threatens to sue Apple over App Store rankings"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.923,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.65,
    "summary": "Apple has partnered with OpenAI to incorporate ChatGPT into its iPhone, iPad, and Mac devices. Elon Musk criticized Apple, alleging it committed an \"unequivocal antitrust violation.\" The outcome of this situation is ongoing, with Apple's integration of ChatGPT being the current focus.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 43 tokens",
    "image": {
      "src": "icons/briefcase.svg",
      "thumbnail": "icons/briefcase.svg",
      "alt": "business",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Supreme Court May Revisit Same-Sex Marriage Case, No Decision Yet",
    "domain": "business",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Mon, 11 Aug 2025 20:51:38 -0400",
    "source": "ABC News",
    "sources": [
      "Forbes",
      "ABC News"
    ],
    "domains": [
      "www.forbes.com",
      "abcnews.go.com"
    ],
    "snippets": [
      "Ten years after the U.S. Supreme Court extended marriage rights to same-sex couples, the justices will consider for the first time whether to take up a case that asks them to overturn that decision.",
      "The court has been asked to reconsider its decision in Obergefell v. Hodges, but there’s so far no indication that they’ll actually hear the case."
    ],
    "image_url": "https://s.abcnews.com/images/US/250811_abc_social_scotus_same_sex2_hpMain_4x3_384.jpg",
    "titles": [
      "WATCH:  Supreme Court formally asked to overturn landmark same-sex marriage ruling",
      "Will The Supreme Court Overturn Same-Sex Marriage? Maybe—But It Hasn’t Done Anything Yet."
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.727,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.611,
    "summary": "A decade after the U.S. Supreme Court granted marriage rights to same-sex couples in Obergefell v. Hodges, the Court may consider a case seeking to overturn this decision. However, there is currently no indication that the justices will agree to hear the case.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 45 tokens",
    "image": {
      "src": "icons/briefcase.svg",
      "thumbnail": "icons/briefcase.svg",
      "alt": "business",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Study: Full-Time Work Post-Retirement Boosts Well-being, Varies by Gender",
    "domain": "science",
    "source_domain": "www.newscientist.com",
    "location": "global",
    "published": "Mon, 11 Aug 2025 20:00:56 +0100",
    "source": "New Scientist",
    "sources": [
      "New Scientist",
      "Phys.org"
    ],
    "domains": [
      "www.newscientist.com",
      "phys.org"
    ],
    "snippets": [
      "Having a full-time job in later life has been linked to improved emotional, financial and general life satisfaction - but the results vary a lot between men and women",
      "Work can be a boon or a burden, depending on who you ask. For many, the thought of having nothing to fill their days after retirement is distressing, while others might look forward to filling their days with all the activities they never had time for before. But what is the reality of life after re"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/08/11142344/SEI_261412988.jpg",
    "titles": [
      "Working past the age of retirement may improve your life satisfaction",
      "Working after retirement associated with higher life satisfaction—especially for men"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.644,
      "consensus": 0.682,
      "constructiveness": 0.053,
      "proximity": 0.5
    },
    "score": 0.6,
    "summary": "Research indicates that maintaining a full-time job in later life can lead to better emotional, financial, and overall life satisfaction. However, the impact varies significantly between men and women. While some individuals view post-retirement work positively, seeing it as a way to stay active and engaged, others anticipate retirement as a time for leisure and personal pursuits. The study highlights the diverse perspectives on work and retirement and their effects on well-being.",
    "constructiveness_score": 0.053,
    "constructiveness_reason": "1 constructive keywords out of 75 tokens",
    "image": {
      "src": "icons/beaker.svg",
      "thumbnail": "icons/beaker.svg",
      "alt": "science",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Poshmark CEO and founder to step down",
    "domain": "technology",
    "source_domain": "techcrunch.com",
    "location": "global",
    "published": "Mon, 11 Aug 2025 19:38:57 +0000",
    "source": "TechCrunch",
    "sources": [
      "Ars Technica",
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com",
      "arstechnica.com"
    ],
    "snippets": [
      "After nearly 15 years, Manish Chandra will transition to being a member of the board of directors. Namsun Kim, who has served as executive chairman since April, has been appointed as his successor.",
      "The move comes as GitHub is facing growing competition from companies like Google and Cursor over AI tools for programmers.",
      "Microsoft bought GitHub for $7.5 billion in 2018."
    ],
    "image_url": "",
    "titles": [
      "Poshmark CEO and founder to step down",
      "GitHub CEO to step down",
      "GitHub will be folded into Microsoft proper as CEO steps down"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.653,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.596,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 7 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Canada's Oil Province Premier Visits Mexico to Boost Energy Ties",
    "domain": "business",
    "source_domain": "financialpost.com",
    "location": "national",
    "published": "Tue, 12 Aug 2025 15:08:39 +0000",
    "source": "Financial Post",
    "sources": [
      "Financial Post"
    ],
    "domains": [
      "financialpost.com"
    ],
    "snippets": [
      "The leader of Canada’s main oil-producing province visited Mexico in a bid to help reset relations with Latin America’s second-largest economy, with a particular eye to promoting energy projects."
    ],
    "image_url": "",
    "titles": [
      "Alberta Bolsters Canada-Mexico Energy Ties as Trump Upends Trade"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.979,
      "consensus": 0.393,
      "constructiveness": 0.151,
      "proximity": 1.0
    },
    "score": 0.549,
    "summary": "The Premier of Canada's main oil-producing province traveled to Mexico to improve ties with the country and focus on advancing energy projects. The visit aimed to strengthen relations with Latin America's second-largest economy. The outcome of the trip was to promote collaboration on energy initiatives between the two nations.",
    "constructiveness_score": 0.151,
    "constructiveness_reason": "2 constructive keywords out of 53 tokens",
    "image": {
      "src": "icons/canada.svg",
      "thumbnail": "icons/canada.svg",
      "alt": "canada flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "New DNA Editing Technique Combines AI, Advances Genetic Research",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Tue, 12 Aug 2025 11:23:04 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "phys.org"
    ],
    "snippets": [
      "A research team headed by the University of Zurich has developed a powerful new method to precisely edit DNA by combining cutting-edge genetic engineering with artificial intelligence. The work has been published in Nature Biotechnology."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/ai-meets-crispr-for-pr-1.jpg",
    "titles": [
      "AI meets CRISPR for precise gene editing"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.984,
      "consensus": 0.393,
      "constructiveness": 0.279,
      "proximity": 0.5
    },
    "score": 0.52,
    "summary": "A research team led by the University of Zurich has created a new technique for precise DNA editing, merging advanced genetic engineering with artificial intelligence. This innovation has been detailed in Nature Biotechnology, marking a significant advancement in the field of genetic research.",
    "constructiveness_score": 0.279,
    "constructiveness_reason": "3 constructive keywords out of 43 tokens",
    "image": {
      "src": "icons/dna.svg",
      "thumbnail": "icons/dna.svg",
      "alt": "dna",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "New Study Explores Sustainable Solutions for Global Food Security",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Tue, 12 Aug 2025 11:28:24 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "phys.org"
    ],
    "snippets": [
      "As the global population rises and environmental stressors pile up, the question of how to ensure food security for all grows increasingly pressing. A new study led by Tufts Research Technician, and incoming Ph.D. student, Edward B. Gordon and co-authored by Stern Family Professor David Kaplan explo"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/maintaining-a-healthy.jpg",
    "titles": [
      "Biomaterials offer sustainable path for future foods and global food security"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.986,
      "consensus": 0.393,
      "constructiveness": 0.19,
      "proximity": 0.5
    },
    "score": 0.511,
    "summary": "A new study by Tufts Research Technician Edward B. Gordon and Stern Family Professor David Kaplan explores solutions for global food security amid rising population and environmental challenges. The research aims to address how to sustainably feed the world's growing population.",
    "constructiveness_score": 0.19,
    "constructiveness_reason": "2 constructive keywords out of 42 tokens",
    "image": {
      "src": "icons/beaker.svg",
      "thumbnail": "icons/beaker.svg",
      "alt": "science",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "AI Advances Boost Orthopedic Implants and Battery Efficiency",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Tue, 12 Aug 2025 10:42:20 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "phys.org"
    ],
    "snippets": [
      "Advances in artificial intelligence for porous materials design could impact a wide variety of fields, from orthopedic implants to next-generation batteries."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/predictions-under-pres.jpg",
    "titles": [
      "Predictions under pressure: Using AI to study porous materials"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.971,
      "consensus": 0.393,
      "constructiveness": 0.16,
      "proximity": 0.5
    },
    "score": 0.505,
    "summary": "Recent advancements in artificial intelligence (AI) for designing porous materials are poised to benefit numerous sectors, including the development of orthopedic implants and the creation of more efficient batteries. This technological progress marks a significant step forward in materials science, potentially leading to innovations across healthcare and energy storage solutions.",
    "constructiveness_score": 0.16,
    "constructiveness_reason": "2 constructive keywords out of 50 tokens",
    "image": {
      "src": "icons/robot.svg",
      "thumbnail": "icons/robot.svg",
      "alt": "ai",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Weaver Ants Work Harder in Larger Groups, Study Finds",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Tue, 12 Aug 2025 11:50:01 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "phys.org"
    ],
    "snippets": [
      "Weaver ants have solved a problem that has plagued human teams for centuries: individuals contribute less to tasks when more people join in. New research published in Current Biology on 12 August shows individual weaver ants instead get stronger as their group grows."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/tiny-ants-crack-the-se.jpg",
    "titles": [
      "Weaver ants reveal secrets of superefficient teamwork for robot design"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.994,
      "consensus": 0.393,
      "constructiveness": 0.14,
      "proximity": 0.5
    },
    "score": 0.501,
    "summary": "New research published in Current Biology on August 12 reveals that unlike humans, who tend to contribute less to tasks in larger groups, individual weaver ants increase their effort as their group size grows. This finding challenges long-held beliefs about group dynamics and could have implications for understanding social behavior and teamwork in species beyond humans.",
    "constructiveness_score": 0.14,
    "constructiveness_reason": "2 constructive keywords out of 57 tokens",
    "image": {
      "src": "icons/beaker.svg",
      "thumbnail": "icons/beaker.svg",
      "alt": "science",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Finnish Study Finds Lignin Effective Against Viruses, Bacteria",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Tue, 12 Aug 2025 10:39:03 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "phys.org"
    ],
    "snippets": [
      "Research from the Nanoscience Center of the University of Jyväskylä, Finland, has revealed that lignin, a polyphenol important for plant structure, has antimicrobial activity against viruses and bacteria. The results highlight that lignin, which is also an important byproduct of the wood industry, h"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/lignin-is-effective-ag.jpg",
    "titles": [
      "Wood industry byproduct lignin found effective against viruses and bacteria"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.969,
      "consensus": 0.393,
      "constructiveness": 0.091,
      "proximity": 0.5
    },
    "score": 0.498,
    "summary": "Research from the University of Jyväskylä's Nanoscience Center in Finland has discovered that lignin, a significant plant structure component and wood industry byproduct, possesses antimicrobial properties effective against viruses and bacteria. This finding could have implications for its use in enhancing antimicrobial applications.",
    "constructiveness_score": 0.091,
    "constructiveness_reason": "1 constructive keywords out of 44 tokens",
    "image": {
      "src": "icons/beaker.svg",
      "thumbnail": "icons/beaker.svg",
      "alt": "science",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Terraform co-founder Do Kwon pleads guilty over $40 billion crypto collapse",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-08-12T11:57:29-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "www.theverge.com"
    ],
    "snippets": [
      "Terraform Labs co-founder Do Kwon has pleaded guilty to conspiracy and wire fraud three years after his collapsed cryptocurrency firm wiped out $40 billion in funds, according to a report from Bloomberg. Kwon entered his plea in a New York court on Tuesday as part of a deal reached with prosecutors "
    ],
    "image_url": "",
    "titles": [
      "Terraform co-founder Do Kwon pleads guilty over $40 billion crypto collapse"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.996,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.494,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 12 tokens",
    "image": {
      "src": "icons/bitcoin.svg",
      "thumbnail": "icons/bitcoin.svg",
      "alt": "crypto",
      "credit": "Simple Icons",
      "license": "CC0-1.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Anthropic takes aim at OpenAI, offers Claude to ‘all three branches of government’ for $1",
    "domain": "technology",
    "source_domain": "techcrunch.com",
    "location": "global",
    "published": "Tue, 12 Aug 2025 15:37:50 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com"
    ],
    "snippets": [
      "Anthropic’s escalation – a response to OpenAI’s attempt to undercut the competition – is a strategic play meant to broaden the company’s foothold in federal AI usage."
    ],
    "image_url": "",
    "titles": [
      "Anthropic takes aim at OpenAI, offers Claude to ‘all three branches of government’ for $1"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.989,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.493,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 15 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "China tells Alibaba, ByteDance to justify purchases of Nvidia AI chips",
    "domain": "technology",
    "source_domain": "arstechnica.com",
    "location": "global",
    "published": "Tue, 12 Aug 2025 13:30:05 +0000",
    "source": "Ars Technica",
    "sources": [
      "Ars Technica"
    ],
    "domains": [
      "arstechnica.com"
    ],
    "snippets": [
      "Move comes after negotiating an export agreement with the US."
    ],
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2022/09/nvidia_china_hero_1.jpg",
    "titles": [
      "China tells Alibaba, ByteDance to justify purchases of Nvidia AI chips"
    ],
    "score_components": {
      "magnitude": 0.44,
      "recency": 0.946,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.491,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 11 tokens",
    "image": {
      "src": "icons/china.svg",
      "thumbnail": "icons/china.svg",
      "alt": "china flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Pebblebee’s AirTag alternative can now share your real-time location in an emergency",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-08-12T11:00:00-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "www.theverge.com"
    ],
    "snippets": [
      "In July, Pebblebee announced a new safety feature for its Clip location tracker. Called Alert, it turns the Apple AirTag alternative into a panic alarm. Rapidly pressing the Clip’s button activates a flashing light and loud 97-decibel siren while also triggering Pebblebee’s mobile app to send a brow"
    ],
    "image_url": "",
    "titles": [
      "Pebblebee’s AirTag alternative can now share your real-time location in an emergency"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.976,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.49,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 14 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Blackwater’s founder would like to sell you a privacy phone made in the USA",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-08-12T12:00:00-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "www.theverge.com"
    ],
    "snippets": [
      "Unplugged, a company cofounded and backed by Erik Prince, who is also the founder of infamous private military contractor Blackwater, has just released a new version of its \"privacy-first\" UP Phone that will be made in the US - at some point. The original UP Phone was described by the company as \"th"
    ],
    "image_url": "",
    "titles": [
      "Blackwater’s founder would like to sell you a privacy phone made in the USA"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.997,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.488,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 15 tokens",
    "image": {
      "src": "icons/usa.svg",
      "thumbnail": "icons/usa.svg",
      "alt": "usa flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "In a world of vibe coding startups, Uno Platform is targeting enterprise developers",
    "domain": "technology",
    "source_domain": "techcrunch.com",
    "location": "global",
    "published": "Tue, 12 Aug 2025 16:00:00 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com"
    ],
    "snippets": [
      "And its finding customers and investors, including $2.54 million in seed funding."
    ],
    "image_url": "",
    "titles": [
      "In a world of vibe coding startups, Uno Platform is targeting enterprise developers"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.997,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.488,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 13 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Over 11,000 Satellites and 1.2M Debris Pieces Crowd Earth's Orbit",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Tue, 12 Aug 2025 11:52:03 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "phys.org"
    ],
    "snippets": [
      "Earth orbit is becoming increasingly crowded. With more than 11,000 active satellites and many thousands more expected in the coming years, as well as more than 1.2 million pieces of space debris greater than 1 cm, the risk of in-orbit collisions has turned into a daily operational concern. ESA is i"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/cream-avoiding-collisi.jpg",
    "titles": [
      "CREAM: Avoiding collisions in space through automation"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.994,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.487,
    "summary": "Earth's orbit is now crowded with over 11,000 active satellites, and the number is expected to rise. Additionally, there are over 1.2 million pieces of space debris larger than 1 cm, increasing the risk of in-orbit collisions. This has become a daily concern for satellite operations.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 50 tokens",
    "image": {
      "src": "icons/beaker.svg",
      "thumbnail": "icons/beaker.svg",
      "alt": "science",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Prince Rupert's Legacy: Naming of Bay and Land in 1670",
    "domain": "business",
    "source_domain": "financialpost.com",
    "location": "national",
    "published": "Tue, 12 Aug 2025 15:31:25 +0000",
    "source": "Financial Post",
    "sources": [
      "Financial Post"
    ],
    "domains": [
      "financialpost.com"
    ],
    "snippets": [
      "Name is a reference to Prince Rupert, the Bay's first governor, and Rupert's Land, a vast swath of wilderness Hudson's Bay was given control over in 1670"
    ],
    "image_url": "",
    "titles": [
      "Hudson’s Bay changes name to Rupert Legacy after selling IP to Canadian Tire"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.987,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.486,
    "summary": "The name \"Prince Rupert\" refers to the Bay's first governor, Prince Rupert, and \"Rupert's Land\" denotes the extensive area of wilderness over which Hudson's Bay Company was granted control in 1670. This historical context highlights the significant influence Prince Rupert had on the region's early European exploration and trade.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 53 tokens",
    "image": {
      "src": "icons/briefcase.svg",
      "thumbnail": "icons/briefcase.svg",
      "alt": "business",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Trump screwed over Nvidia’s Chinese sales, then let them happen",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-08-12T10:00:00-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "www.theverge.com"
    ],
    "snippets": [
      "Hello there, world! Welcome to the first issue of Regulator, a newsletter about the collision between Big Tech and Washington. If you enjoy this, consider subscribing to get this newsletter weekly and everything The Verge has to offer. For anyone who subscribed via our Instagram announcement: I am s"
    ],
    "image_url": "",
    "titles": [
      "Trump screwed over Nvidia’s Chinese sales, then let them happen"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.956,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.486,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 11 tokens",
    "image": {
      "src": "icons/china.svg",
      "thumbnail": "icons/china.svg",
      "alt": "chinese flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "NASA's Curiosity Rover Gets Upgrade for Better Mars Navigation",
    "domain": "science",
    "source_domain": "scitechdaily.com",
    "location": "global",
    "published": "Tue, 12 Aug 2025 14:28:12 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "scitechdaily.com"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/nasas-curiosity-mars-rover-just-got-a-big-brain-upgrade/\" rel=\"nofollow\" title=\"NASA’s Curiosity Mars Rover Just Got a Big Brain Upgrade\"><img alt=\"NASA Curiosity Rover Tracks\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"437\" src=\"https://scitechdaily.com/i"
    ],
    "image_url": "",
    "titles": [
      "NASA’s Curiosity Mars Rover Just Got a Big Brain Upgrade"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.966,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.481,
    "summary": "NASA's Curiosity Mars Rover has received a significant software upgrade to enhance its autonomous capabilities, allowing it to navigate the Martian terrain more efficiently. This update improves the rover's ability to identify and avoid potential hazards on its own, thereby increasing its operational safety and efficiency in exploring the Martian surface.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 53 tokens",
    "image": {
      "src": "icons/telescope.svg",
      "thumbnail": "icons/telescope.svg",
      "alt": "nasa",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  }
]