[
  {
    "title": "Asian Bakeries Thrive by Blending Global Flavors with French Pastries",
    "domain": "general",
    "location": "global",
    "published": "Wed, 11 Jun 2025 23:57:26 GMT",
    "source": "BBC",
    "sources": [
      "BBC"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "Asian bakeries are seeing success at home and abroad by bringing global flavours to traditional French pastries."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/736a/live/b7aea030-45b4-11f0-a32b-edd3a7eb5f9e.jpg",
    "titles": [
      "The Korean bakery chain that says croissants don't have to be French"
    ],
    "summary": "Asian bakeries have gained popularity both domestically and internationally by incorporating global flavors into traditional French pastries. This fusion approach has led to their success in the market.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it provides useful insights into the success of Asian bakeries by incorporating global flavors into traditional French pastries. However, it doesn't explicitly discuss solutions, improvements, or attempts to solve problems, limiting its score.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.715,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.385
  },
  {
    "title": "BBC Documents Family's Ambulance Journey from Gaza to Amman",
    "domain": "general",
    "location": "global",
    "published": "Wed, 11 Jun 2025 23:43:11 GMT",
    "source": "BBC",
    "sources": [
      "BBC"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "The BBC travels in an ambulance from the Gaza border to Amman with Siwar and her family"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/a1a5/live/5396a3f0-475c-11f0-84b6-6bf0f66205f1.jpg",
    "titles": [
      "A frail cry and relief: Malnourished baby Siwar evacuated from Gaza"
    ],
    "summary": "The BBC reported on a journey with Siwar and her family in an ambulance from the Gaza border to Amman. This coverage highlights the family's experience and the circumstances surrounding their travel. The current status or outcome of the family's situation following their arrival in Amman was not detailed in the provided content.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the family's experience and the circumstances of their journey, which could increase understanding of the situation in Gaza. However, it lacks progress or solutions, and the lack of follow-up on the family's situation in Amman limits its usefulness.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.711,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.364
  },
  {
    "title": "Newsom Criticizes Trump's Military Move, Gains Social Media Following",
    "domain": "general",
    "location": "national",
    "published": "Wed, 11 Jun 2025 22:37:01 GMT",
    "source": "LA Times",
    "sources": [
      "LA Times"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "<p>Millions of people watched Gov. Gavin Newsom's address denouncing President Trump and his military presence, and hundreds of thousands have followed him on TikTok and other social media platforms.</p>"
    ],
    "image_url": "",
    "titles": [
      "Chabria: Newsom's 'Democracy is under assault' speech could turn the tables on Trump"
    ],
    "summary": "Gov. Gavin Newsom delivered an address criticizing President Trump and his decision to deploy the military, drawing millions of viewers. Following the speech, Newsom's following on TikTok and other social media platforms surged by hundreds of thousands.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about a political event and its social media impact. However, it lacks depth or insight into the reasons behind the criticism, the implications of the military move, or how it affects the public.",
    "score_components": {
      "magnitude": 0.079,
      "recency": 0.695,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.365
  },
  {
    "title": "Immigration Raids Near LA Middle School Graduation Spark Fear",
    "domain": "general",
    "location": "national",
    "published": "Wed, 11 Jun 2025 22:11:57 GMT",
    "source": "LA Times",
    "sources": [
      "LA Times"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "<p>Continued federal immigration enforcement actions have disrupted lives across greater Los Angeles, including a middle school graduation where teachers and families were left hunkering down in fear.</p>"
    ],
    "image_url": "https://ca-times.brightspotcdn.com/dims4/default/44d10d8/2147483647/strip/false/crop/5088x3392+0+0/resize/1500x1000!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Ff8%2Fc0%2Fa40d9dfb4aedb10c03d85c7a4fef%2F1509776-me-0610-ice-activity-scavenger-hunt-gem-002.jpg",
    "titles": [
      "Fears of ICE raids upend life in L.A. County, from schools to Home Depot parking lots"
    ],
    "summary": "Federal immigration enforcement operations in greater Los Angeles have significantly impacted the community, notably disturbing a middle school graduation. Teachers and families at the event were forced into a state of fear, seeking shelter from the actions taking place.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story raises awareness about the impact of immigration enforcement operations in Los Angeles, but it does not provide any actionable insights or deeper understanding for the reader. It also does not report on any solutions or improvements, and its primary focus appears to be on generating fear.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.689,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.337
  },
  {
    "title": "Beach Boys' Brian Wilson Dies at 82, Leaves Musical Legacy",
    "domain": "general",
    "location": "global",
    "published": "Wed, 11 Jun 2025 22:07:28 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "<p>He was the Beach Boys’ resident genius, seeping melancholy into even peppy teenybopper hits. Beyond all the myths about his life, that brilliance is still intoxicating</p><ul><li><p><a href=\"https://www.theguardian.com/music/2025/jun/11/brian-wilson-beach-boys-dies\">Brian Wilson, visionary creative spirit for the Beach Boys, dies aged 82</a></p></li><li><p><a href=\"https://www.theguardian.com/music/2025/jun/11/brian-wilson-greatest-songs\">Twelve of Brian Wilson’s greatest songs – from surf to psychedelia and beyond</a></p></li><li><p><a..."
    ],
    "image_url": "https://i.guim.co.uk/img/media/06e963480eafb7d63bdee5f77985d42d3ca54610/427_0_3136_2510/master/3136.jpg?width=140&quality=85&auto=format&fit=max&s=3700b064bdc624e2cb0d3a29ed92be1d",
    "titles": [
      "Whether wistful or euphoric, Brian Wilson made pop’s most overwhelmingly beautiful music"
    ],
    "summary": "Brian Wilson, the creative genius behind the Beach Boys, has passed away at the age of 82. Recognized for infusing melancholy into the band's hits, his musical brilliance has left a lasting impact. Wilson's work spanned from surf music to psychedelia, marking him as a pivotal figure in music history.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about Brian Wilson's death and his musical legacy. It does not offer any actionable insights or deeper understanding, and it does not report on any solutions or improvements. However, it does provide some context about his impact on music history.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.688,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.349
  },
  {
    "title": "Spain, Gibraltar Continue Border Talks; Gibraltar Hikes Sales Tax",
    "domain": "general",
    "location": "global",
    "published": "Wed, 11 Jun 2025 21:24:08 GMT",
    "source": "BBC",
    "sources": [
      "Financial Times",
      "BBC"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "Talks on rules governing the border of Spain and Gibraltar have been ongoing since Britain left the EU.",
      "The Rock will also raise sales tax to avoid unfair competition"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/4b69/live/9c6adfb0-46da-11f0-b10e-bf0cd4fce580.jpg",
    "titles": [
      "UK agrees post-Brexit deal over Gibraltar",
      "Goods for Gibraltar must pass through Spain under post-Brexit deal"
    ],
    "summary": "Negotiations between Spain and Gibraltar have been in progress since Britain exited the European Union, focusing on establishing regulations for their shared border. Additionally, Gibraltar has decided to increase its sales tax to prevent unfair competitive advantages.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it provides useful information about ongoing negotiations between Spain and Gibraltar, contributing to readers' understanding of international relations post-Brexit. However, it does not report on specific solutions or improvements, nor does it offer deep insight into the causes or trends.",
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.678,
      "consensus": 0.682,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.653
  },
  {
    "title": "Yair Yaakov Killed in Hamas Attack, Netanyahu Confirms",
    "domain": "general",
    "location": "global",
    "published": "Wed, 11 Jun 2025 21:11:28 GMT",
    "source": "BBC",
    "sources": [
      "New York Times",
      "BBC"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "One of the two hostages was Yair Yaakov, who was killed in the Hamas-led attack on 7 October 2023, Benjamin Netanyahu says.",
      "Yair Yaakov was kidnapped by Islamic Jihad in the Oct. 7, 2023, attacks on Israel, Prime Minister Benjamin Netanyahu said. The other hostage will be named later, the Israeli military said."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/c657/live/42b27cc0-46f9-11f0-bbaa-4bc03e0665b7.jpg",
    "titles": [
      "Israeli forces recover bodies of two hostages in Gaza, PM says",
      "Israel Says It Recovered the Remains of Two Hostages in Gaza"
    ],
    "summary": "On October 7, 2023, Yair Yaakov was killed during a Hamas-led attack, as confirmed by Israeli Prime Minister Benjamin Netanyahu. Yaakov had been kidnapped by Islamic Jihad during the same series of attacks on Israel. The identity of the other hostage involved will be disclosed at a later time, according to the Israeli military.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness of a tragic event, but does not provide much depth or insight beyond the immediate news. It does not offer actionable insights, report on solutions or improvements, or increase clarity around systems, causes, or impacts.",
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.675,
      "consensus": 0.632,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.59
  },
  {
    "title": "Study: Financial Insecurity Key to Declining Global Birthrates",
    "domain": "general",
    "location": "global",
    "published": "Wed, 11 Jun 2025 21:02:31 +0000",
    "source": "New York Times",
    "sources": [
      "New York Times"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "Policymakers in many countries assume that birthrates have fallen because people want fewer children, but a global study says financial insecurity is driving those decisions."
    ],
    "image_url": "https://static01.nyt.com/images/2025/06/11/multimedia/11int-un-families-ktqv/11int-un-families-ktqv-mediumSquareAt3X.jpg",
    "titles": [
      "U.N. Report Says We’re Missing the Real Fertility Crisis"
    ],
    "summary": "A global study has revealed that the decline in birthrates across many countries is primarily due to financial insecurity, challenging the common assumption among policymakers that people desire fewer children. This finding underscores the impact of economic factors on family planning decisions.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive. It offers actionable insights by challenging a common assumption and highlighting the impact of economic factors on family planning decisions. This could potentially inform policy-making and contribute to solutions for the declining birthrates.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.672,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.386
  },
  {
    "title": "Alex Carey Misses Key Catch of Wiaan Mulder in Cricket Match",
    "domain": "sports",
    "location": "global",
    "published": "Wed, 11 Jun 2025 16:44:00 BST",
    "source": "Sky Sports",
    "sources": [
      "Sky Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Alex Carey drops a sitter of a catch in what could of seen Wiaan Mulder dismissed for one."
    ],
    "image_url": "https://e1.365dm.com/25/06/1920x1080/skysports-cricket-test_6939505.jpg?20250611164858",
    "titles": [
      "'An absolute sitter!' | Horrible drop from Carey!"
    ],
    "summary": "Alex Carey missed a crucial catch that would have dismissed Wiaan Mulder when he was at one run. This incident occurred during a cricket match, highlighting a significant missed opportunity for Carey's team.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness of a specific event in a cricket match, but offers no deeper insight or understanding of its broader implications or context. It does not provide actionable insights, report on solutions or improvements, or increase clarity around systems, causes, trends, or impacts that matter.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.615,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.315
  },
  {
    "title": "Emma Raducanu to Become British No 1 in Tennis After Boulter's Exit",
    "domain": "sports",
    "location": "global",
    "published": "Thu, 12 Jun 2025 16:00:00 BST",
    "source": "Sky Sports",
    "sources": [
      "Sky Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Emma Raducanu will become British No 1 on Monday after Katie Boulter bowed out at Queen's with a 2-6 6-3 6-2 second-round defeat to Russian fifth-seed Diana Shnaider."
    ],
    "image_url": "https://e1.365dm.com/25/06/1920x1080/skysports-katie-boulter-emma-raducanu_6940289.jpg?20250612154517",
    "titles": [
      "Raducanu to return to British No 1 after Boulter bows out at Queen's Club"
    ],
    "summary": "Emma Raducanu is set to become the British No 1 in tennis following Katie Boulter's exit from Queen's. Boulter was defeated 2-6, 6-3, 6-2 in the second round by Russian fifth seed Diana Shnaider. This change in ranking will officially take place on Monday.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story informs readers about a change in the ranking of British tennis players, providing useful context about the reasons behind this change. However, it does not report on solutions, improvements, or innovations, nor does it significantly increase clarity around systems, causes, trends, or impacts.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.998,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.421
  },
  {
    "title": "Napoli Signs Kevin De Bruyne as Free Agent from Manchester City",
    "domain": "sports",
    "location": "national",
    "published": "Thu, 12 Jun 2025 15:55:00 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Sky Sports",
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Napoli have officially confirmed the signing of Kevin De Bruyne as a free agent following his contractual expiry at Manchester City.The 33-year-old was confirmed as the first major departure ahead of ...",
      "Napoli have confirmed the signing of Kevin De Bruyne on a free transfer following his exit from Manchester City at the end of his contract."
    ],
    "image_url": "",
    "titles": [
      "Contract length, first reactions, shirt number: Napoli sign Kevin De Bruyne from Manchester City",
      "Napoli confirm De Bruyne deal"
    ],
    "summary": "Napoli has officially signed Kevin De Bruyne as a free agent after his contract with Manchester City expired. The 33-year-old midfielder's move marks the first major departure from Manchester City ahead of the new season.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about a significant event in football, giving readers an understanding of player transfers. However, it does not report on solutions or improvements, nor does it significantly increase clarity around systems, causes, trends, or impacts.",
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.996,
      "consensus": 0.632,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.677
  },
  {
    "title": "Zakai Zeigler Sues NCAA Over Player Season Participation Limits",
    "domain": "sports",
    "location": "national",
    "published": "Thu, 12 Jun 2025 15:52:46 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Zakai Zeigler sued the NCAA on May 20 over its rules limiting him to four seasons in a five-year window."
    ],
    "image_url": "",
    "titles": [
      "Judge denies Zeigler’s request for preliminary injunction trying to play 5th season"
    ],
    "summary": "On May 20, Zakai Zeigler filed a lawsuit against the NCAA, challenging its regulations that restrict a player to participating in only four seasons within a five-year period. This legal action seeks to contest the NCAA's limitations on player eligibility and playing time.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story informs readers about a legal challenge to NCAA regulations, providing useful context about player eligibility and playing time. However, it doesn't report on a solution or improvement, nor does it offer deep insights into the impacts or trends of such regulations.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.996,
      "consensus": 0.393,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.438
  },
  {
    "title": "Cardinals Reflect on Legacy of No. 87 Jersey Ahead of Season Opener",
    "domain": "sports",
    "location": "national",
    "published": "Thu, 12 Jun 2025 15:51:52 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "With 87 days till the Cardinals open the season against the Saints, we look at the players who have worn No. 87."
    ],
    "image_url": "",
    "titles": [
      "87 days till the Arizona Cardinals' 2025 season opener: Who has worn No. 87?"
    ],
    "summary": "With 87 days left until the Cardinals' season opener against the Saints, the focus turns to the history of players who have donned the No. 87 jersey for the team. This retrospective highlights the contributions and careers of various athletes who have worn this number while playing for the Cardinals, offering fans a look back at the team's legacy through the lens of jersey No. 87.",
    "constructiveness_score": 0.4,
    "constructiveness_reason": "While this story provides basic awareness about the history of players who wore the No. 87 jersey, it lacks depth and doesn't offer actionable insights or deeper understanding. It also doesn't report on solutions, improvements, or attempts to solve problems.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.995,
      "consensus": 0.393,
      "constructiveness": 0.4,
      "proximity": 0.5
    },
    "score": 0.401
  },
  {
    "title": "Nick Chubb Joins Texans, Cites Ideal Fit for Career Advancement",
    "domain": "sports",
    "location": "national",
    "published": "Thu, 12 Jun 2025 15:49:13 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Houston Texans running back Nick Chubb gave his thoughts on why Houston was the perfect fit for the next stage of his career."
    ],
    "image_url": "",
    "titles": [
      "Nick Chubb explains why he signed with Texans over other teams this offseason"
    ],
    "summary": "Nick Chubb, the running back for the Houston Texans, shared his perspective on joining the team, stating that Houston was the ideal place for him to advance his career. He emphasized the fit with the team's direction and his role within their strategy as key reasons for his decision.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness about Nick Chubb's decision to join the Texans, but doesn't provide deeper insights into why this might be an ideal fit for his career advancement. It doesn't highlight a solution or improvement, nor does it increase clarity around systems, causes, trends, or impacts that matter.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.994,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.411
  },
  {
    "title": "Yelp Releases Ratings for MLB Stadiums Including Citizens Bank Park",
    "domain": "sports",
    "location": "national",
    "published": "Thu, 12 Jun 2025 15:44:56 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Yelp has ratings on every Major League Baseball stadium. See how Citizens Bank Park fared."
    ],
    "image_url": "",
    "titles": [
      "Here are the Yelp ratings for all the MLB ballparks. See how Citizens Bank Park fared"
    ],
    "summary": "Yelp has published ratings for every Major League Baseball stadium, including Citizens Bank Park. The summary does not specify how Citizens Bank Park was rated compared to other stadiums. For detailed ratings and comparisons, one would need to refer directly to Yelp's website.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about Yelp's new feature of rating MLB stadiums, but it lacks depth or insight as it does not provide any specific information or comparisons about Citizens Bank Park or other stadiums. The reader would need to go to Yelp's website for more information.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.993,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.391
  },
  {
    "title": "Multiple Pitchers Issue High Number of Walks in Today's Baseball Games",
    "domain": "sports",
    "location": "national",
    "published": "Thu, 12 Jun 2025 15:42:00 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Which Starting Pitchers Are Issuing Multiple Free Passes Today?"
    ],
    "image_url": "",
    "titles": [
      "Wild Things — Walk Prop Cheat Sheet, 6/12"
    ],
    "summary": "Today's baseball games featured several starting pitchers who issued multiple free passes, indicating a higher number of walks given to opposing batters. The specific names of these pitchers and the exact number of walks issued were not provided. This trend highlights a potential challenge for the teams involved, as allowing more batters to reach base without hitting can increase the opposing team's chances of scoring.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story offers basic awareness about a trend in today's baseball games, but it does not provide detailed information such as the names of the pitchers or the exact number of walks issued. This lack of detail limits the reader's ability to gain a deeper understanding or make informed decisions.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.992,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.41
  },
  {
    "title": "Chime to Go Public, Joining Recent Fintech IPO Wave",
    "domain": "business",
    "location": "national",
    "published": "Wed, 11 Jun 2025 22:58:10 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Investopedia"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Chime's debut set for Thursday follows recent listings from eToro and Circle, with investors watching closely to gauge broader appetite for fintech offerings.",
      "<figure><img alt=\"Smith Collection / Gado / Getty Images Chime priced its IPO at $27 per share, above the expected range of $24 to $26.\" src=\"https://www.investopedia.com/thmb/WJoZgILrJBbAhkyr-K5xwiKcW7k=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2203243918-a9a1b1475fb04c099c71900150ebd05a.jpg\" title=\"Facade featuring green Chime logo on a light stone building exterior, San Francisco\" /><figcaption><i><p>Smith Collection / Gado / Getty Images</p> Chime priced its IPO at $27 per share, above the expected range of $24 to $26.</i></figcaption></figure><br..."
    ],
    "image_url": "",
    "titles": [
      "Chime prices IPO at $27 per share, valuing fintech company at $11.6 billion ahead of Nasdaq debut",
      "Chime Prices IPO Above Expected Range"
    ],
    "summary": "Chime is set to debut on the public market on Thursday, following recent public listings from other fintech companies like eToro and Circle. This move comes after a period where fintech IPOs were rare, and it reflects a broader trend of such companies going public with reduced valuations and moderated expectations. Investors are keenly observing these listings to assess the overall interest in fintech offerings.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story informs readers about the trend of fintech companies going public and provides context about the market's interest in such offerings. However, it doesn't highlight any solutions or progress in the fintech industry.",
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.7,
      "consensus": 0.632,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.638
  },
  {
    "title": "Shaquille O’Neal Settles $1.8M Lawsuit Over FTX Promotion Claims",
    "domain": "business",
    "location": "national",
    "published": "Wed, 11 Jun 2025 21:45:38 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Shaquille O’Neal has agreed to pay $1.8 million to settle a class action suit accusing him of misleading investors by promoting crypto exchange FTX."
    ],
    "image_url": "",
    "titles": [
      "Shaquille O’Neal to pay $1.8 million to settle FTX investor lawsuit"
    ],
    "summary": "Shaquille O’Neal has settled a class action lawsuit for $1.8 million, after being accused of misleading investors through his promotion of the crypto exchange FTX.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story informs readers about the legal consequences of misleading promotions in the crypto industry. It provides useful information about the responsibility of public figures in promoting investments, even though the topic is negative.",
    "score_components": {
      "magnitude": 0.189,
      "recency": 0.683,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.411
  },
  {
    "title": "Sundar Pichai Speaks at Google I/O 2025, Unveils New Tech",
    "domain": "business",
    "location": "global",
    "published": "Wed, 11 Jun 2025 21:30:57 GMT",
    "source": "Investopedia",
    "sources": [
      "Investopedia"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "<figure><img alt=\"CAMILLE COHEN / Getty Images CEO Sundar Pichai addresses a crowd during Google's annual I/O developers conference on May 20, 2025\" src=\"https://www.investopedia.com/thmb/6snbbWuNmZ-ONp8oY5MRZRS6MWk=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2215577822-47a75431e5254defb1dd57019a2c8389.jpg\" title=\"CEO Sundar Pichai addresses the crowd during Google's annual I/O developers conference.\" /><figcaption><i><p>CAMILLE COHEN / Getty Images</p> CEO Sundar Pichai addresses a crowd during Google's annual I/O developers conference on May 20,..."
    ],
    "image_url": "https://www.investopedia.com/thmb/6snbbWuNmZ-ONp8oY5MRZRS6MWk=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2215577822-47a75431e5254defb1dd57019a2c8389.jpg",
    "titles": [
      "Google Buyouts Could Point to More Tech Layoffs, as Sector Faces Heavy Job Losses"
    ],
    "summary": "On May 20, 2025, Sundar Pichai, CEO of Google, delivered a speech at the company's annual I/O developers conference. The event was documented and shared by CAMILLE COHEN / Getty Images, showcasing Pichai addressing a large audience. This conference is known for revealing Google's latest technological advancements and future plans.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides a useful insight into the future plans and technological advancements of Google. However, without specific details on the innovations or solutions presented, it doesn't fully highlight progress or provide empowering knowledge.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.679,
      "consensus": 0.393,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.375
  },
  {
    "title": "Oil Prices Hit Four-Year Low Amid Tariff-Driven Uncertainty",
    "domain": "business",
    "location": "global",
    "published": "Wed, 11 Jun 2025 21:30:09 GMT",
    "source": "Investopedia",
    "sources": [
      "Investopedia"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "<figure><img alt=\"Brandon Bell / Getty Images Oil prices fell to a 4-year low in April amid tariff-induced economic uncertainty.\" src=\"https://www.investopedia.com/thmb/fmJXtNQGgG1wlQaZ-tJ1EYpOk90=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2209442497-f490bd34df764f9e8f66fba5da2994a8.jpg\" title=\"An oil pumpjack is seen in a field on April 09, 2025 in Close City, Texas.\" /><figcaption><i><p>Brandon Bell / Getty Images</p> Oil prices fell to a 4-year low in April amid tariff-induced economic uncertainty.</i></figcaption></figure><p>Oil prices rose as a..."
    ],
    "image_url": "https://www.investopedia.com/thmb/fmJXtNQGgG1wlQaZ-tJ1EYpOk90=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2209442497-f490bd34df764f9e8f66fba5da2994a8.jpg",
    "titles": [
      "Oil Prices Jump to 2-Month High on Middle East Concerns, Trade Optimism"
    ],
    "summary": "In April, oil prices dropped to a four-year low due to economic uncertainty caused by tariffs. This was visually captured in a photo by Brandon Bell for Getty Images, showing an oil pumpjack in Texas.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs readers about the current state of oil prices and the impact of tariffs, providing context to the economic landscape. However, it doesn't offer solutions or insights into how this situation might be resolved or mitigated.",
    "score_components": {
      "magnitude": 0.079,
      "recency": 0.679,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.372
  },
  {
    "title": "Papa John's Shares Surge Amid Talks of Going Private, Hits $1.6B Cap",
    "domain": "business",
    "location": "global",
    "published": "Wed, 11 Jun 2025 21:22:05 GMT",
    "source": "Investopedia",
    "sources": [
      "Investopedia"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "<figure><img alt=\"Brandon Bell / Getty Images Papa John’s market capitalization is around $1.6 billion\" src=\"https://www.investopedia.com/thmb/tpXOLPDofWYFveSLR7HiPdy6f64=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2152235607-d9959181bac047818de6d4efc1c64d63.jpg\" title=\"A Papa John's store in Austin, Texas, in May 2024\" /><figcaption><i><p>Brandon Bell / Getty Images</p> Papa John’s market capitalization is around $1.6 billion</i></figcaption></figure><p>Shares of Papa John’s jumped Wednesday on the news that the pizza chain might be taken private. </p><p>Papa..."
    ],
    "image_url": "https://www.investopedia.com/thmb/tpXOLPDofWYFveSLR7HiPdy6f64=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2152235607-d9959181bac047818de6d4efc1c64d63.jpg",
    "titles": [
      "Papa John's Stock Jumps on News of Possible Go-Private Deal"
    ],
    "summary": "Shares of Papa John's experienced a significant increase on Wednesday following reports that the pizza chain may be considering a move to go private. This news has contributed to the company's market capitalization reaching approximately $1.6 billion.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story gives readers an understanding of current market trends and the potential strategic direction of Papa John's. However, it lacks depth in explaining the implications of the company going private or how it might affect stakeholders.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.677,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.357
  },
  {
    "title": "NYSE Activity Captured in Bloomberg Photo by Michael Nagle",
    "domain": "business",
    "location": "global",
    "published": "Wed, 11 Jun 2025 21:06:38 GMT",
    "source": "Investopedia",
    "sources": [
      "Investopedia"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "<figure><img alt=\"Michael Nagle / Bloomberg via Getty Images Traders work on the floor of the New York Stock Exchange (NYSE) on July 11.\" src=\"https://www.investopedia.com/thmb/W5kCeXIJuX8Z8m63-9yNmu204vU=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2219068298-3ba5e1e2a62847249a9407fea15b928c.jpg\" title=\"Stock market traders working on computer monitors and writing notes\" /><figcaption><i><p>Michael Nagle / Bloomberg via Getty Images</p> Traders work on the floor of the New York Stock Exchange (NYSE) on July 11.</i></figcaption></figure><br /><h3>Key..."
    ],
    "image_url": "https://www.investopedia.com/thmb/W5kCeXIJuX8Z8m63-9yNmu204vU=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2219068298-3ba5e1e2a62847249a9407fea15b928c.jpg",
    "titles": [
      "S&P 500 Gains and Losses Today: Nucor Stock Falls as US, Mexico Negotiate on Steel Tariffs"
    ],
    "summary": "On July 11, traders were active on the floor of the New York Stock Exchange (NYSE), as captured in a photograph by Michael Nagle for Bloomberg via Getty Images. The image shows traders engaging with computer monitors and taking notes, highlighting the day-to-day operations within the NYSE. This visual representation provides insight into the bustling environment of the stock market.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides a useful visual insight into the day-to-day operations within the NYSE. However, it does not provide any specific information about the market trends or the impact of the activities captured in the photo. It helps to contextualize the environment of the stock market, but does not provide actionable insights or deeper understanding.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.673,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.356
  },
  {
    "title": "Voyager Technologies IPO Marks Positive Market Trend",
    "domain": "business",
    "location": "global",
    "published": "Wed, 11 Jun 2025 20:54:24 GMT",
    "source": "Investopedia",
    "sources": [
      "Investopedia"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "<figure><img alt=\"Bloomberg / Contributor / Getty Images Voyager’s debut comes after a string of strong IPOs, suggesting improving investor appetite for new listings.\" src=\"https://www.investopedia.com/thmb/HtsUppFzrcMaeuGcpOdzHklPmSw=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2219047458-ef51078bf08e4b31bf51b41d074c4e70.jpg\" title=\"Voyager Technologies\" /><figcaption><i><p>Bloomberg / Contributor / Getty Images</p> Voyager’s debut comes after a string of strong IPOs, suggesting improving investor appetite for new listings.</i></figcaption></figure><p>Shares..."
    ],
    "image_url": "https://www.investopedia.com/thmb/HtsUppFzrcMaeuGcpOdzHklPmSw=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2219047458-ef51078bf08e4b31bf51b41d074c4e70.jpg",
    "titles": [
      "Space Tech Firm Voyager’s Stock Soars in Trading Debut"
    ],
    "summary": "Voyager Technologies made its public debut, indicating a positive trend in the market as it follows a series of successful IPOs. This suggests an increasing interest from investors in new stock listings.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "The story provides useful information about the current trend in the market, particularly in relation to IPOs. However, it doesn't provide a deep understanding of why this trend is occurring or what it could mean for the future.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.671,
      "consensus": 0.393,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.366
  },
  {
    "title": "US Treasury Secretary Discusses Pause in Tariffs at 2025 Hearing",
    "domain": "business",
    "location": "global",
    "published": "Wed, 11 Jun 2025 20:33:57 GMT",
    "source": "Investopedia",
    "sources": [
      "Investopedia"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "<figure><img alt=\"Eric Lee / Bloomberg via Getty Images\" src=\"https://www.investopedia.com/thmb/ymty7A6ilMGhjU3PjBkZsTYGyWk=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2219050149-364deb278e2b475b8a196ebdec1b302d.jpg\" title=\"Scott Bessent, US treasury secretary, during a House Ways and Means Committee hearing in Washington, DC, US, on Wednesday, June 11, 2025\" /><figcaption><i><p>Eric Lee / Bloomberg via Getty Images</p></i></figcaption></figure><p>President Donald Trump's 90-day pause on \"reciprocal\" tariffs against trading partners is likely to be extended as..."
    ],
    "image_url": "https://www.investopedia.com/thmb/ymty7A6ilMGhjU3PjBkZsTYGyWk=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2219050149-364deb278e2b475b8a196ebdec1b302d.jpg",
    "titles": [
      "Trump's Tariff Deals Deadline 'Highly Likely' To Be Delayed, Treasury Secretary Says"
    ],
    "summary": "In June 2025, during a House Ways and Means Committee hearing in Washington, DC, US Treasury Secretary Scott Bessent discussed President Donald Trump's decision to pause \"reciprocal\" tariffs against trading partners for 90 days. This pause is likely to be extended, indicating a temporary halt in the imposition of new tariffs.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story informs readers about a significant decision made by the US government that could impact global trade. It provides context about the decision, but does not delve into the potential impacts or solutions to the issue.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.666,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.382
  },
  {
    "title": "Hollywood Studios Sue Midjourney Over AI Copyright Infringement",
    "domain": "science",
    "location": "global",
    "published": "Wed, 11 Jun 2025 21:58:37 +0100",
    "source": "New Scientist",
    "sources": [
      "New Scientist"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Two huge movie studios are suing Midjourney, claiming the firm’s AI has been trained on their copyrighted material – the entrance of the Hollywood giants into this legal fight could be a watershed moment for AI and copyright"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/06/11204709/SEI_255170916.jpg",
    "titles": [
      "Disney and Universal lawsuit may be killing blow in AI copyright wars"
    ],
    "summary": "Two major Hollywood studios have filed a lawsuit against Midjourney, alleging that the company's artificial intelligence was trained using their copyrighted content. This legal action marks a significant moment in the ongoing debate over AI and copyright laws, highlighting the entertainment industry's involvement in the issue.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "The story clearly highlights an ongoing issue in the intersection of AI and copyright laws. It provides awareness of the problem and the involvement of major industry players, contributing to the reader's understanding of this complex issue.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.672,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.393
  },
  {
    "title": "New Study Suggests DNA Separation Requires More Force",
    "domain": "science",
    "location": "global",
    "published": "Wed, 11 Jun 2025 20:56:01 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/a-more-realistic-look-at-dna-reveals-surprising-new-behaviors/\" rel=\"nofollow\" title=\"A More Realistic Look at DNA Reveals Surprising New Behaviors\"><img alt=\"DNA Functions Concept\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/DNA-Functions-Concept-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>Researchers at Northwestern University found that DNA strand separation may require more force than previously thought when modeled in a more true-to-life environment. In most..."
    ],
    "image_url": "",
    "titles": [
      "A More Realistic Look at DNA Reveals Surprising New Behaviors"
    ],
    "summary": "Researchers at Northwestern University discovered that separating DNA strands might necessitate more force than previously believed, based on new models simulating a more realistic environment. This finding challenges earlier understandings of DNA behavior.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it provides useful information about a new scientific discovery related to DNA behavior, contributing to the reader's understanding of the topic. However, it doesn't explicitly report on solutions, improvements, or attempts to solve problems.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.671,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.376
  },
  {
    "title": "Expert Claims EPA Shifting Focus Away from Climate Change",
    "domain": "science",
    "location": "global",
    "published": "Wed, 11 Jun 2025 20:36:25 +0000",
    "source": "Wired",
    "sources": [
      "Wired"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "\"The EPA is trying to get out of the climate change business,” says one expert."
    ],
    "image_url": "https://media.wired.com/photos/68495fddf966af23d5c7150b/master/pass/GettyImages-1360241786.jpg",
    "titles": [
      "The EPA Wants to Roll Back Emissions Controls on Power Plants"
    ],
    "summary": "An expert claims the Environmental Protection Agency (EPA) is attempting to distance itself from addressing climate change. This statement suggests a shift in the agency's focus or priorities regarding environmental policies and actions related to climate change. However, the summary does not provide details on the EPA's specific actions or policies that support this claim.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story raises awareness about a potential shift in the EPA's focus, but it does not provide any actionable insights or deeper understanding. It lacks details on the specific actions or policies that support the claim, and does not report on solutions or improvements.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.666,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.332
  },
  {
    "title": "Study Challenges Theory on Origins of Life, Questions Ancient Proteins",
    "domain": "science",
    "location": "global",
    "published": "Wed, 11 Jun 2025 20:31:53 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/new-research-challenges-a-key-theory-about-lifes-origins/\" rel=\"nofollow\" title=\"New Research Challenges a Key Theory About Life’s Origins\"><img alt=\"Luminous Sphere Fish Egg Crop\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Luminous-Sphere-Fish-Egg-Crop-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>What if one of the most iconic building blocks of life was misunderstood all along? A new study challenges long-standing assumptions about ancient proteins and their role..."
    ],
    "image_url": "",
    "titles": [
      "New Research Challenges a Key Theory About Life’s Origins"
    ],
    "summary": "A recent study has called into question long-held beliefs about ancient proteins, suggesting that our understanding of these fundamental components of life may have been incorrect. This research challenges a key theory regarding the origins of life, potentially altering our comprehension of how life on Earth began.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it provides useful insights into a new study that challenges long-held beliefs about ancient proteins and the origins of life, enhancing the reader's understanding of the subject. However, it doesn't report on specific solutions or improvements.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.665,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.375
  },
  {
    "title": "New Cat1 Protein Expands CRISPR's Viral Defense Capabilities",
    "domain": "science",
    "location": "global",
    "published": "Wed, 11 Jun 2025 20:06:06 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/its-capable-of-even-more-than-we-thought-scientists-discover-crisprs-new-secret-weapon/\" rel=\"nofollow\" title=\"It’s Capable of Even More Than We Thought: Scientists Discover CRISPR’s New Secret Weapon\"><img alt=\"Medical Doctor Geneticist Hands DNA\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Medical-Doctor-Geneticist-Hands-DNA-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>A newly discovered bacterial defense protein named Cat1 reveals an extraordinary method of viral..."
    ],
    "image_url": "",
    "titles": [
      "It’s Capable of Even More Than We Thought: Scientists Discover CRISPR’s New Secret Weapon"
    ],
    "summary": "Scientists have discovered a new bacterial defense protein, Cat1, which showcases an advanced method of viral defense, expanding our understanding of CRISPR technology beyond its known genetic editing capabilities. This breakthrough, revealing CRISPR's additional potential in combating viruses, marks a significant advancement in the field of genetic research.",
    "constructiveness_score": 1.0,
    "constructiveness_reason": "This story is highly constructive. It not only provides useful information about a significant advancement in genetic research, but also reports on the discovery of a new bacterial defense protein that could potentially enhance CRISPR's viral defense capabilities. This could empower readers by providing them with knowledge about the progress being made in the field.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.659,
      "consensus": 0.393,
      "constructiveness": 1.0,
      "proximity": 0.5
    },
    "score": 0.394
  },
  {
    "title": "New Tent Range Features Revolutionary Waterproofing Technology",
    "domain": "science",
    "location": "global",
    "published": "Wed, 11 Jun 2025 19:00:00 +0100",
    "source": "New Scientist",
    "sources": [
      "New Scientist"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Feedback is tickled by a marketing email touting a new range of tents, which promises revolutionary waterproofing technology"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/06/10123303/SEI_255005319.jpg",
    "titles": [
      "Does this new tent repel both water and the laws of physics?"
    ],
    "summary": "A marketing email has introduced a new range of tents, highlighting their revolutionary waterproofing technology. This innovation in tent design aims to enhance outdoor experiences by offering improved protection against water.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it introduces an innovation in tent design, providing readers with useful information about a new product that could enhance their outdoor experiences. It highlights progress in the field of outdoor gear.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.631,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.378
  },
  {
    "title": "Advocate Proposes Renaming Female Anatomy Named After Men",
    "domain": "science",
    "location": "global",
    "published": "Wed, 11 Jun 2025 19:00:00 +0100",
    "source": "New Scientist",
    "sources": [
      "New Scientist"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "From Fallopian tubes to the G-spot, long-dead men have left their mark on women's anatomy. It's time to turf them out, says Adam Taor"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/06/09104508/SEI_254533923.jpg",
    "titles": [
      "A woman's body is a man's world. Just ask an anatomist..."
    ],
    "summary": "Adam Taor argues for renaming anatomical parts of women's bodies that were named after men, such as the Fallopian tubes and the G-spot, to reflect a more contemporary and inclusive understanding of women's health and anatomy.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful context on a proposal to rename certain anatomical parts, contributing to a deeper understanding of contemporary discussions on women's health and anatomy. However, it does not report on any progress or solutions, or provide actionable insights.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.631,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.375
  },
  {
    "title": "Tiffany Jenkins Explores Privacy Shift in \"Strangers and Intimates\"",
    "domain": "science",
    "location": "global",
    "published": "Wed, 11 Jun 2025 19:00:00 +0100",
    "source": "New Scientist",
    "sources": [
      "New Scientist"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "How did we lose the sense that some parts of life should be off-limits rather than open to commodification? Tiffany Jenkins's thoughtful new book Strangers and Intimates explores"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/06/09152042/SEI_254151403.jpg",
    "titles": [
      "A compelling book asks if we are killing off the idea of private life"
    ],
    "summary": "Tiffany Jenkins's new book, \"Strangers and Intimates,\" delves into the question of why society has moved away from the belief that certain aspects of life should remain private and not be subject to commodification. The book provides a thoughtful exploration of this shift in cultural norms and values.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The story provides useful insights into the shift in societal attitudes towards privacy and commodification, contributing to a deeper understanding of contemporary cultural norms and values. However, it does not explicitly highlight solutions or progress in addressing the issue.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.631,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.368
  }
]