[
  {
    "title": "Trump Deploys National Guard to Chicago, Faces Legal Challenge Over Portland",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sun, 05 Oct 2025 17:49:51 -0400",
    "source": "NPR",
    "sources": [
      "Forbes",
      "NPR",
      "Al Jazeera",
      "LA Times",
      "Fortune",
      "Axios"
    ],
    "domains": [
      "www.aljazeera.com",
      "news.google.com",
      "www.latimes.com",
      "www.npr.org",
      "www.forbes.com",
      "fortune.com"
    ],
    "snippets": [
      "The White House said Trump \"authorized\" the deployment of 300 Illinois National Guard members, after vowing to send troops into Chicago. Meanwhile, Guard members arrived in Oregon from California.",
      "The deployment would mark the latest escalation of Donald Trump’s use of US federal intervention in Democrat-led cities.",
      "<a href=\"https://news.google.com/rss/articles/CBMieEFVX3lxTE1SNEQwYU1yYjl5Z2JlOXhkTWVGR0V1QXVXNTZXZTlOdEhPNU50MXlkOHNBcE5hVDBKeV9uYmJaUGxjLVZjdjFoaVUwbk91WTZvSkY0QjlSR0VINGF3R0tXZTNWZjFSempoclpWblNGcktuNERETmVJZw?oc=5\" target=\"_blank\">Newsom says Trump sent California National Guard troops to Oregon",
      "<p>The California governor says 300 of the state's Guard troops are being sent to Portland and calls it a 'breathtaking abuse' of power.</p>",
      "A federal judge already temporarily blocked the Trump administration from deploying the Oregon National Guard.",
      "“This action circumvents the court’s decision and threatens to inflame a community that has remained peaceful,” Portland's mayor said."
    ],
    "image_url": "",
    "titles": [
      "Trump federalizes the National Guard in Chicago, while troops arrive in Oregon",
      "Gov Newsom says Trump is sending California National Guard troops to Oregon",
      "Newsom says Trump sent California National Guard troops to Oregon - Axios",
      "Newsom to seek court order stopping Trump's deployment of California National Guard to Oregon",
      "Trump Sending California National Guard To Portland After Judge Blocked Oregon Guard Deployment, Newsom Says",
      "Trump sends California National Guard to Oregon after judge blocks him from using that state’s troops in Portland"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.876,
      "consensus": 1.0,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.86,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "President Trump authorized the deployment of 300 Illinois National Guard members to Chicago as part of his immigration and crime crackdown, while also attempting to send troops to Portland, Oregon. However, the deployment to Portland was blocked by a federal judge. In response, Trump is trying to send 300 California National Guard members instead, leading California Governor Newsom to announce plans to sue the White House. This marks an escalation in Trump's use of federal intervention in Democrat-led cities.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Yesavage's No-Hit Game and Guerrero's Slam Propel Blue Jays to 2-0 ALDS Lead",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sun, 05 Oct 2025 23:55:45 +0000",
    "source": "CBS Sports",
    "sources": [
      "Sportsnet",
      "Global News",
      "Yahoo Sports",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "www.sportsnet.ca",
      "globalnews.ca",
      "sports.yahoo.com"
    ],
    "snippets": [
      "Yesavage allowed no hits and struck out 11 of the 18 batters he faced on Sunday",
      "Rookie Trey Yesavage set a Blue Jays postseason record by striking out 11 in 5 1/3 no-hit innings, Vladimir Guerrero Jr. hit the first postseason grand slam in team history and Toronto beat the New York Yankees 13-7 on Sunday to take a 2-0 lead in the ALDS.  Daulton Varsho had two home runs among hi",
      "Trey Yesavage said he was built for this kind of opportunity. On Sunday afternoon, he went out and proved it.",
      "Vladimir Guerrero Jr. hit a grand slam, Daulton Varsho hit two of Toronto's five homers and Trey Yesavage was masterful in his fourth career big-league start as the Blue Jays defeated the New York Yankees 13-7 on Sunday to take a 2-0 lead in the American League Division Series.",
      "Blue Jays manager John Schneider tinkered with his lineup for Game 2 of the American League Division Series against star left-hander Max Fried and the New York Yankees on Sunday afternoon.",
      "<p>Trey Yesavage recorded a franchise-best 11 strikeouts through 5.1 hitless innings, Vladimir Guerrero Jr. hit a grand slam, and Daulton Varsho recorded two homers and two doubles to lead the Toronto Blue Jays to a 13-7 win over the New York Yankees.</p>",
      "<p>In the midst of their second straight offensive explosion against the New York Yankees, Toronto is entering historic territory.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/10/05/b507578d-88bc-4ab1-a6b8-1e7cd3ce0061/yesavage-getty-1.png",
    "titles": [
      "Trey Yesavage shuts down Yankees in ALDS Game 2 as Blue Jays rookie sets franchise strikeout record",
      "Blue Jays ride rookie Yesavage’s 11 Ks to 13-7 win over Yankees in Game 2 of the ALDS",
      "Blue Jays outscore Yankees 13-7 in Game 2 of ALDS",
      "Blue Jays beat Yankees 13-7 in Game 2 of ALDS",
      "Blue Jays manager tinkers with lineup for Game 2",
      "MLB Game 2 Highlights: Blue Jays 13, Yankees 7",
      "Blue Jays set playoff franchise record with five home runs in Game 2"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.915,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.772,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Trey Yesavage delivered a no-hit performance with 11 strikeouts in his fourth big-league start, leading the Toronto Blue Jays to a 13-7 victory over the New York Yankees. This win gave the Blue Jays a 2-0 lead in the ALDS. Vladimir Guerrero Jr. contributed with a grand slam, while Daulton Varsho hit two of Toronto's five home runs. The team's performance has been historically significant, matching their home run tally (eight) with fewer strikeouts (seven) across two games.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Patriots Upset Unbeaten Bills in Week 5 NFL Action",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sun, 5 Oct 2025 23:33:08 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Yahoo Sports",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "www.masslive.com",
      "www.espn.com"
    ],
    "snippets": [
      "Our NFL Nation reporters answer the biggest questions out of each game. Here's what we learned from Week 5.",
      "The Patriots shocked the previously unbeaten Bills on Sunday night.",
      "Here are the Week 5 grades for every team that played"
    ],
    "image_url": "",
    "titles": [
      "Questions, takeaways off every NFL Week 5 game: Patriots shock Bills, Bucs and Titans win thrillers",
      "Rewind: Patriots shock Bills on the road",
      "NFL Week 5 grades: Patriots earn 'A-' for upset win over Bills, Ravens get a big 'F' for ugly loss"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.987,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.759,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In Week 5 of the NFL, the New England Patriots defeated the previously unbeaten Buffalo Bills, marking a significant upset. NFL Nation reporters provided insights and grades for every team that played during the week, highlighting key performances and outcomes from the games.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Syria Holds First Parliamentary Elections Post-Assad Era",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sun, 05 Oct 2025 04:20:44 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "The Guardian",
      "CityNews",
      "New York Times"
    ],
    "domains": [
      "www.nytimes.com",
      "ottawa.citynews.ca",
      "www.theguardian.com",
      "www.npr.org"
    ],
    "snippets": [
      "Syria is holding parliamentary elections on Sunday for the first time since the fall of the country's longtime autocratic leader, Bashar Assad, who was unseated in a rebel offensive in December.",
      "<p>After more than a decade of civil war, committee members will choose transitional parliament</p><p>Syria is holding its first parliamentary elections since the fall of its longtime ruler Bashar al-Assad, in a tentative step towards democratic polls that have been criticised as biased in favour of",
      "Syrians are voting indirectly, and President Ahmed al-Shara is appointing a third of the lawmakers. Still, some see this as a step forward after decades of dictatorship.",
      "DAMASCUS, Syria (AP) — Syria on Sunday held its first parliamentary elections, nearly a year after a rebel-led offensive unseated longtime autocratic leader Bashar Assad. The People’s Assembly will be tasked with passing a new elections law and constitution as the country moves through its post-Assa"
    ],
    "image_url": "",
    "titles": [
      "What to expect as Syria holds first parliamentary elections since Assad's ouster",
      "Syria holds first elections since fall of Bashar al-Assad",
      "Syria Chooses Its First Parliament Since End of Civil War",
      "Syria holds first elections since Assad’s ouster, marking a cautious step in political transition"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.662,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.747,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Syria conducted its first parliamentary elections since the ousting of Bashar Assad in December. President Ahmed al-Shara is appointing one-third of the lawmakers in these indirect elections. Despite the unconventional voting process, some view it as progress following years of autocratic rule.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Masked Figures Spotted at Mosque Before Fire Amid Manchester Tensions",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 05 Oct 2025 16:56:15 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian",
      "New York Times",
      "Al Jazeera"
    ],
    "domains": [
      "www.bbc.com",
      "www.nytimes.com",
      "www.theguardian.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "The images are of two people in balaclavas seen outside the mosque before the large blaze spread.",
      "The attack in East Sussex comes as Britain sees a wave of protests demonising Muslims and asylum seekers.",
      "<p>Fire at mosque in Peacehaven on Saturday night left front entrance damaged and a car burnt out</p><p>A suspected arson attack on a mosque in an English seaside town is being investigated by police as a hate crime.</p><p>The front entrance to the mosque in Peacehaven, East Sussex, was damaged and ",
      "The attack came at a time of heightened anxiety after a deadly terrorist attack at a synagogue in Manchester."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/ab75/live/689ba000-a1fe-11f0-947b-6b8b23372a50.jpg",
    "titles": [
      "Police release photos of mosque arson suspects",
      "UK police probe suspected arson attack on mosque as ‘hate crime’",
      "Suspected arson attack at East Sussex mosque investigated as hate crime",
      "Fire at Peacehaven Mosque Is Being Treated as Hate Crime, UK Police Say"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.775,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.744,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A video shows two individuals wearing balaclavas at a mosque before a significant fire erupts. This incident occurred amidst increased tension following a fatal terrorist attack at a Manchester synagogue.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UCLA Upsets Penn State, Week 6 Sees Top Teams Fall",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sun, 5 Oct 2025 18:32:46 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Bleacher Report",
      "Yahoo Sports"
    ],
    "domains": [
      "news.google.com",
      "www.espn.com",
      "www.usatoday.com"
    ],
    "snippets": [
      "A summary of Week 5's best and worst fantasy performances, biggest storylines and historical perspective.",
      "Carolina RB Rico Dowdle turned a spot start into the season's first 200-yard rushing week, lifting many opportunistic fantasy teams to victory.",
      "<a href=\"https://news.google.com/rss/articles/CBMinAFBVV95cUxOdllhc2RJUjZJZGExUkx0NkhRVVJ0RVFBeUNIVkZXaGxUYVU3UWNwU1NKMjNnWV9KTVBLOGljSVBfc0NpQ0hQVVY0cF9XNS1OWG14enM5amU0RUVpeUxDWFR0TVYtbG1mUEtLRHZHS2I5OEpGVDBtZ2ZOczJWTnVkaEtsaVQ4UEQxZlh3V1g4M1NaWWVuakk3b1lVa0Y?oc=5\" target=\"_blank\">B/R's 2025 Colle"
    ],
    "image_url": "",
    "titles": [
      "Ranking Week 5 fantasy football winners and losers and injury impacts from Sunday",
      "9 biggest fantasy football winners and losers from Week 5",
      "B/R's 2025 College Football Winners and Losers from Week 6 - Bleacher Report"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.889,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.74,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "UCLA achieved a notable upset victory over Penn State on Saturday, surprising many. Following the game, UCLA engaged in celebratory trolling. Additionally, both No. 7 Penn State and No. 9 Texas experienced unexpected defeats to unranked teams during Week 6 of college football. These upsets are anticipated to significantly impact the upcoming AP Top 25 poll rankings.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Seattle Ties Series 1-1 Against Detroit, Rodríguez Clutch in Game 2",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Mon, 06 Oct 2025 03:19:12 +0000",
    "source": "CBS Sports",
    "sources": [
      "Sportsnet",
      "Yahoo Sports",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "www.sportsnet.ca",
      "www.nbcsports.com"
    ],
    "snippets": [
      "Seattle and Detroit are meeting for the first time ever in the postseason",
      "New York and Toronto will continue their best-of-five series on Tuesday",
      "RHP Logan Gilbert is set to start for Seattle in Game 3 against Tigers RHP Jack Flaherty.",
      "<p>Julio Rodríguez hit a tiebreaking RBI double in the eighth inning and the Seattle Mariners beat the Detroit Tigers 3-2 in Game 2 of their AL Division Series on Saturday to even the series.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/10/06/0aaa92c9-7c37-4d89-a4e4-dc20bea2e88e/100525-jorgepolanco.jpg",
    "titles": [
      "Mariners vs. Tigers ALDS schedule, prediction, odds, TV channel as Seattle evens up series with Game 2 win",
      "Yankees vs. Blue Jays ALDS schedule, prediction, odds, TV channel as AL East foes face off",
      "Julio Rodríguez lifts Mariners over Tigers 3-2, Seattle takes Game 2 of ALDS to even series",
      "Mariners beat Tigers, Skubal to tie series"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.982,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.74,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Seattle and Detroit faced off in the postseason for the first time, with their series now tied 1-1 after Seattle's 3-2 win in Game 2 of the AL Division Series. Julio Rodríguez delivered a tiebreaking RBI double in the eighth inning. The series continues with RHP Logan Gilbert starting for Seattle against Detroit's RHP Jack Flaherty in Game 3. New York and Toronto are also set to continue their best-of-five series on Tuesday.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "White House Advisor Hopes for Deal to End Shutdown Amid Tax Credit Dispute",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Sun, 05 Oct 2025 15:30:20 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "Business Insider",
      "CNBC"
    ],
    "domains": [
      "news.google.com",
      "www.businessinsider.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMihwFBVV95cUxNU0pXd1FFQ2xva1lRY3Y5WGNlbjkyekVyY184TGdRZjNiMmxEajk2ZFdUcFRqYmtpQ1gxb1QxYVd4akVnMUluUC1GWDBuckdpQ2ZLQ016eGJxOExQSnJBVThjUHAwdGdHcnhiWVduc0xuV3hnSEd0SG54QzV3bEI4VlA5ZTFiZ00?oc=5\" target=\"_blank\">Trump adviser: Layoffs will start if shutdow",
      "Democrats are holding firm on their health-care demands, pushing to include a permanent extension of enhanced premium tax credits in funding legislation.",
      "Top White House economic advisor Kevin Hassett said he's hopeful lawmakers can reach an agreement to end the government shutdown before layoffs begin."
    ],
    "image_url": "",
    "titles": [
      "Trump adviser: Layoffs will start if shutdown negotiations are \"going nowhere\" - Axios",
      "'There will start to be layoffs' if Trump decides shutdown talks have stalled, Hassett says",
      "Kevin Hassett says 'there will be layoffs' if Trump decides shutdown talks are not progressing"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.752,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.694,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Top White House economic advisor Kevin Hassett expressed hope for an agreement to end the government shutdown and prevent layoffs. The deadlock persists as Democrats demand a permanent extension of enhanced premium tax credits in the funding legislation.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Taylor Swift's Album Movie Earns $33M in U.S. Opening",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Sun, 05 Oct 2025 15:17:22 GMT",
    "source": "CNBC",
    "sources": [
      "Forbes",
      "CNBC",
      "MarketWatch"
    ],
    "domains": [
      "www.forbes.com",
      "www.marketwatch.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "Taylor Swift's \"The Life of a Showgirl\" album movie generated an estimated $33 million domestically.",
      "The film, tied to Swift’s newly released “The Life of a Showgirl” album, grossed $15.8 million Friday alone.",
      "Swift’s new album represents an epic event for the music business, with sales of her music driving the fortunes of the entire industry."
    ],
    "image_url": "",
    "titles": [
      "Taylor Swift's 'The Life of a Showgirl' album release party snares $33 million domestically",
      "Taylor Swift’s ‘Official Release Party Of A Showgirl’ Hits No. 1 And Dominates Box Office During Single Weekend Run",
      "The release of Taylor Swift’s ‘The Life of a Showgirl’ is like Super Bowl Sunday for the music industry"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.749,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.687,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Taylor Swift's \"The Life of a Showgirl\" album movie earned around $33 million in the U.S., with $15.8 million coming in on its opening day. The film is linked to Swift's latest album release.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Quebec's New \"Right-to-Repair\" Law Takes Effect to Protect Consumers",
    "domain": "business",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sun, 05 Oct 2025 21:47:30 +0000",
    "source": "Global News",
    "sources": [
      "Financial Post",
      "Global News"
    ],
    "domains": [
      "globalnews.ca",
      "financialpost.com"
    ],
    "snippets": [
      "A new Quebec law came into effect Sunday aimed at protecting consumers against products intentionally designed with shorter lifespans while ensuring they have the information needed to repair and maintain goods they buy.",
      "MONTREAL &#8212; A new Quebec law came into effect Sunday aimed at protecting consumers against products intentionally designed with shorter lifespans while ensuring they have the information needed to repair and maintain goods they buy. Quebec&#8217;s so-called &#8220;right-to-repair&#8221; law, pa",
      "MONTREAL &#8212; A new Quebec law came into effect Sunday aimed at protecting consumers against products intentionally designed with shorter lifespans while ensuring they have the information needed to repair and maintain goods they buy. Quebec&#8217;s so-called &#8220;right-to-repair&#8221; law, pa"
    ],
    "image_url": "",
    "titles": [
      "Quebec durable goods law comes into effect",
      "Quebec law to promote the sustainability of goods comes into force",
      "Quebec law to promote the sustainability of goods come into force"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.876,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.687,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A new \"right-to-repair\" law in Quebec came into effect on Sunday, aimed at protecting consumers from products designed with intentionally shorter lifespans. It ensures consumers have the necessary information to repair and maintain their purchases.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Yesavage Sets Blue Jays Record, Guerrero Hits 1st Postseason Grand Slam in 13-7 ",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sun, 5 Oct 2025 23:53:43 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "Rookie Trey Yesavage set a franchise-postseason record by striking out 11 in 5⅓ no-hit innings, Vladimir Guerrero Jr. hit the first postseason grand slam in team history and the Toronto Blue Jays beat the New York Yankees 13-7 to take a 2-0 ALDS lead.",
      "<p>Toronto’s Vladimir Guerrero Jr. speaks to Sportsnet’s Hazel Mae after his Game 2 performance that saw three hits, including the first grand slam in Blue Jays postseason history, while praising Trey Yesavage’s historic outing on the mound.</p>"
    ],
    "image_url": "",
    "titles": [
      "'Built for this': Yesavage, 22, shuts down Yankees",
      "‘He’s built for this’: Guerrero Jr. praises Yesavage after historic outing"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.994,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.679,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Trey Yesavage struck out 11 over 5⅓ no-hit innings, setting a franchise postseason record for the Toronto Blue Jays. Vladimir Guerrero Jr. hit the team's first postseason grand slam, contributing to a 13-7 victory over the New York Yankees. This win gives the Blue Jays a 2-0 lead in the ALDS. Guerrero's performance included three hits, highlighted by his historic grand slam, while Yesavage received praise for his remarkable pitching.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Pukpuk Treaty Aims to Boost Military Cooperation Between Neighbors",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Mon, 06 Oct 2025 03:24:55 +0000",
    "source": "Al Jazeera",
    "sources": [
      "The Guardian",
      "Al Jazeera"
    ],
    "domains": [
      "www.theguardian.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Pukpuk treaty commits the two neighbours to greater military cooperation, although the text is yet to be released.",
      "<p>Pukpuk treaty described as an agreement to ‘support each other’s defence and contribute to a region that is peaceful, stable and prosperous’. Follow today’s news live</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https",
      "<p>Pukpuk treaty described as an agreement to ‘support each other’s defence and contribute to a region that is peaceful, stable and prosperous’. Follow today’s news live</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https"
    ],
    "image_url": "",
    "titles": [
      "Australia, Papua New Guinea sign mutual defence treaty",
      "News live: Australia and PNG sign defence treaty; Allan says Melbourne’s Metro line to open this year",
      "News live: Australia and PNG sign defence treaty; Broncos double in market value after $50m grand final boost"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.984,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.669,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Pukpuk treaty, an agreement between two neighboring countries, aims to enhance military cooperation and support each other's defense to foster a peaceful, stable, and prosperous region. The full text of the treaty has not been released yet.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Judge Blocks Trump's Bid to Deploy National Guard in Portland",
    "domain": "business",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-10-06T01:51:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Fortune",
      "Deutsche Welle"
    ],
    "domains": [
      "www.dw.com",
      "fortune.com"
    ],
    "snippets": [
      "A judge has temporarily struck down Donald Trump's attempts to send all National Guard to Portland. Trump says the troops are needed to crack down on protests against federal immigration operations in the city.",
      "“The President’s determination was simply untethered to the facts,” Immergut wrote."
    ],
    "image_url": "",
    "titles": [
      "Judge blocks Trump's attempts to deploy troops to Portland",
      "Trump-appointed judge blocks administration from deploying troops in Portland. ‘This is a nation of Constitutional law, not martial law’"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.953,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.663,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A judge has temporarily blocked Donald Trump's efforts to deploy all National Guard troops to Portland, aiming to quell protests against federal immigration actions. Judge Immergut ruled the decision was not based on factual grounds, indicating the president's determination lacked a factual basis.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Manchester United Eyes Barcelona's Ter Stegen: Transfer Talk Report",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sun, 5 Oct 2025 15:42:14 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sports Illustrated"
    ],
    "domains": [
      "news.google.com",
      "www.espn.com"
    ],
    "snippets": [
      "Manchester United are among the Premier League clubs eyeing Barcelona goalkeeper Marc-André ter Stegen. Transfer Talk has the latest news and rumors.",
      "<a href=\"https://news.google.com/rss/articles/CBMifkFVX3lxTE1UU3pJSkdFODU0QVVWVHpsVzhZWnNZVE5UZVdBNGtIWWJ4aFJuc0tSQlhLdm9PVnIwSUtOeF9xN1hjeS1laDl0NS1nYm1xRjNmaFZXQUNBSVJTamhpYXpERVpCUEg2SXl1VnZNUkVrWkctSndJalVZQ1hfYndtUQ?oc=5\" target=\"_blank\">Man Utd ‘Enquire’ About Barcelona Goalkeeper Marc-Andre t"
    ],
    "image_url": "",
    "titles": [
      "Transfer rumors, news: Man United eye Barcelona keeper Ter Stegen",
      "Man Utd ‘Enquire’ About Barcelona Goalkeeper Marc-Andre ter Stegen - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.838,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.658,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Manchester United is reportedly interested in Barcelona goalkeeper Marc-André ter Stegen, according to Transfer Talk. This development is part of the latest news and rumors circulating in the football world.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Macron Forms New French Government Amid Political Crisis and Criticism",
    "domain": "general",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Mon, 06 Oct 2025 03:19:27 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "New York Times"
    ],
    "domains": [
      "www.nytimes.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "<p>Rivals say president’s latest cabinet represents unwelcome continuity and hard-left party vows to file no-confidence motion amid fraught budget talks</p><p>French president Emmanuel Macron has named a new government as he struggles to pull the country out of a political crisis, while rivals threa",
      "There were significant holdovers from the previous cabinet, but President Emmanuel Macron also named several newcomers, including Bruno Le Maire, a veteran centrist politician, as defense minister."
    ],
    "image_url": "https://i.guim.co.uk/img/media/fd6f69ffd837f78cf7c5038237d7a607747474aa/388_0_3411_2730/master/3411.jpg?width=140&quality=85&auto=format&fit=max&s=6c2941ce0442df8060a5b50da8ceedf7",
    "titles": [
      "Macron appoints new French government in attempt to end political deadlock",
      "Macron Appoints French Cabinet, but Doubts Over Government’s Stability Persist"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.962,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.657,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "French President Emmanuel Macron has formed a new government, aiming to navigate France out of a political crisis. Despite introducing new members like centrist Bruno Le Maire as defense minister, the cabinet has faced criticism for maintaining significant continuity from its predecessor. Amidst fraught budget negotiations, a hard-left party has announced plans to file a no-confidence motion against Macron's administration.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "California, Oregon Sue Trump Admin Over Troop Deployment in Portland",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 06 Oct 2025 00:24:34 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Axios"
    ],
    "domains": [
      "www.bbc.com",
      "news.google.com"
    ],
    "snippets": [
      "The move appears aimed at circumventing a court order that barred deploying troops in Portland.",
      "<a href=\"https://news.google.com/rss/articles/CBMiiwFBVV95cUxPa0pMb0ZjWVdmWDFGNEdoNGdaZ2FIT3ZkSkxyV2lPS01rX1hfYW9YQ3lXMFNTX2oyWFE1dnRHbGR2dFp5UERRMmZWeDV0dGRadnBTa0ctVWdlSFdfc0Z3dlRmS19tQkVXUTBkYnFCMUxEVi1IM0p5anVzaEdEb2ZLT1BTZy1nMTVZMDF3?oc=5\" target=\"_blank\">California, Oregon sue Trump in bid to "
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/4846/live/fcbf6450-a245-11f0-98b7-cdc4bf2f32f3.jpg",
    "titles": [
      "Trump sends troops from California to Portland after court denies deployment",
      "California, Oregon sue Trump in bid to stop troop deployment to Portland - Axios"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.906,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.653,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "California and Oregon filed a lawsuit against the Trump administration, challenging its attempt to deploy troops in Portland despite a court order prohibiting such action. This legal move underscores the states' opposition to the administration's efforts to use military forces in response to protests, aiming to uphold the court's restriction.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Nikkei 225 Surges 4.6% on Fiscal Spending Hopes; Yen Declines",
    "domain": "business",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-10-06T03:27:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Financial Times",
      "Deutsche Welle"
    ],
    "domains": [
      "www.dw.com",
      "www.ft.com"
    ],
    "snippets": [
      "The Nikkei 225 Index was up 4.6% while the yen slumped. Takaichi is considered to have an expansionary fiscal agenda for the world's fourth-largest economy.",
      "Investors expect more fiscal spending and pressure on central bank to keep interest rates low"
    ],
    "image_url": "",
    "titles": [
      "Japan's stocks surge after Takaichi wins party vote",
      "Japanese stocks soar and yen weakens after Takaichi wins ruling party race"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.985,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.652,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Nikkei 225 Index rose by 4.6% amid expectations of increased fiscal spending and continued low interest rates, following indications of an expansionary fiscal agenda by Takaichi for Japan, the world's fourth-largest economy. Concurrently, the yen experienced a decline.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Bad Bunny Hosts SNL Season 51 Premiere, Addresses Super Bowl Criticism",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sun, 05 Oct 2025 14:38:49 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "Forbes"
    ],
    "domains": [
      "www.forbes.com",
      "www.npr.org"
    ],
    "snippets": [
      "Bad Bunny returned to <em>SNL </em>as a host for the second time, and the musician addressed criticism over his upcoming Super Bowl performance.",
      "Saturday Night Live kicked off its 51st season with host Bad Bunny and musical guest Doja Cat."
    ],
    "image_url": "",
    "titles": [
      "SNL roasts Trump in season premiere, as Bad Bunny addresses Super Bowl criticism",
      "Bad Bunny Hosts ‘SNL’ Season 51 Premiere With Doja Cat And Jon Hamm"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.82,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.644,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Bad Bunny hosted \"Saturday Night Live\" (SNL) for the second time as it launched its 51st season, with Doja Cat as the musical guest. During the episode, Bad Bunny addressed criticism regarding his upcoming Super Bowl performance.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Week 6 Fantasy Sports: Top Waiver Wire Pickups Revealed",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sun, 05 Oct 2025 23:19:55 +0000",
    "source": "CBS Sports",
    "sources": [
      "Yahoo Sports",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "www.sportingnews.com"
    ],
    "snippets": [
      "These players need to be on your Fantasy radar now",
      "Need help finding some hidden gems on the waiver wire? Click here to read more about our favorite pickups ahead of Week 6."
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/21/753e804a-d4dd-4c03-b19e-da30ff2972e6/usatsi-26813670.jpg",
    "titles": [
      "Fantasy Football Week 5 breakouts: Get Ryan Flournoy, Kendrick Bourne, Mason Taylor, more on Waiver Wire radar",
      "Fantasy Waiver Wire Week 6: FAAB pickup tips for Rico Dowdle, Kendrick Bourne, Sean Tucker, more"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.904,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.643,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "This article provides recommendations for fantasy sports players seeking to strengthen their teams through waiver wire pickups ahead of Week 6. It highlights hidden gems that could be valuable additions.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Titans Score Unusual TD After Cardinals Fumble Interception",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sun, 05 Oct 2025 23:47:47 +0000",
    "source": "CBS Sports",
    "sources": [
      "Sportsnet",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "The football gods looked favorably upon Tennessee multiple times in Week 5",
      "<p>Watch as Tennessee Titans quarterback Cam Ward throws an interception which is fumbled by the Arizona Cardinals and then recovered by Tyler Lockett in the end zone for a wild touchdown score.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/10/05/9f5be22a-2729-45d7-ba10-f346e7359c5d/titans.jpg",
    "titles": [
      "Titans turn Cardinals' interception into Tennessee touchdown in one of the wildest plays of the year",
      "Titans score TD after Cardinals interception turns into fumble recovery"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.913,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.638,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "In Week 5, the Tennessee Titans experienced a remarkable play when quarterback Cam Ward's interception was fumbled by the Arizona Cardinals and subsequently recovered by Tyler Lockett in the end zone, resulting in an unexpected touchdown for the Titans.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Georgia PM Vows Crackdown on Protesters, Accuses EU Envoy of Coup Support",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-10-05T19:34:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "The Guardian",
      "Deutsche Welle"
    ],
    "domains": [
      "www.dw.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Prime Minister Kobakhidze vowed \"no one will go unpunished\" after Saturday's clashes between police and anti-government protesters. The EU has rejected claims it backed overthrowing him as \"disinformation.\"",
      "<p>Irakli Kobakhidze accused EU ambassador of supporting ‘attempt to overthrow constitutional order’ </p><p>Georgia’s prime minister, Irakli Kobakhidze, has announced a sweeping crackdown on dissent, accusing demonstrators who tried to storm the presidential palace of aiming to topple his government"
    ],
    "image_url": "",
    "titles": [
      "Georgia's prime minister promises crackdown on dissent",
      "Georgia’s prime minister announces crackdown on dissent after Tbilisi protests"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.836,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.632,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Georgia's Prime Minister Irakli Kobakhidze has pledged a strict crackdown following clashes between police and anti-government protesters, accusing them of trying to overthrow the government. He also accused the EU ambassador of supporting this alleged coup, a claim the EU has labeled as disinformation. Kobakhidze emphasized that \"no one will go unpunished\" in response to the Saturday protests.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Israeli Forces Detain and Deport Gaza-Bound Activists; Allegations of Mistreatme",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sun, 05 Oct 2025 16:26:31 +0000",
    "source": "Al Jazeera",
    "sources": [
      "The Guardian",
      "Al Jazeera"
    ],
    "domains": [
      "www.theguardian.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Activists deported from Israel following their arrest in the aid flotilla to Gaza say they were treated &#039;like monkeys&#039;.",
      "Activists from the Global Sumud Flotilla who hoped to reach Gaza have been deported after being intercepted and detained",
      "<p>One tells consular officials his arm was dislocated and head slammed into ground while another fears she may have a stroke</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/oct/06/australia-news-live-queensland-bushfire-danger-warnings-moreton-island-croydon-park-shootin"
    ],
    "image_url": "",
    "titles": [
      "More Gaza flotilla activists allege mistreatment in Israeli detention",
      "Freed flotilla activists describe mistreatment in Israeli detention",
      "Australian Gaza flotilla activists detained by Israel complain of ‘degrading and humiliating’ treatment"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.783,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.626,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Activists from the Global Sumud Flotilla, attempting to reach Gaza, were intercepted, detained, and deported by Israeli forces. Upon returning, Italian journalist Saverio Tommasi and others claimed they were mistreated and deprived of medicines by Israeli soldiers, allegations that Israel denies. Some 450 activists were involved in the incident.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Russell Martin Sacked as Rangers Coach, Gerrard Considered for Role",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 05 Oct 2025 20:45:18 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "www.bbc.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Russell Martin is sacked as Rangers head coach after 17 games in charge in the wake of Sunday's 1-1 draw with Falkirk.",
      "<ul><li><p>Martin dismissed after fans surround team bus at Falkirk</p></li><li><p>Former Ibrox manager under strong consideration</p></li></ul><p>Steven Gerrard is under strong consideration for a return to Rangers after the Scottish club confirmed the sacking of Russell Martin.</p><p>Martin’s ill-"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/4060/live/241bbf50-a235-11f0-92db-77261a15b9d2.jpg",
    "titles": [
      "Rangers sack head coach Russell Martin after 17 games",
      "Steven Gerrard in frame for Rangers return after Russell Martin is sacked"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.839,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.623,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Russell Martin was sacked as Rangers head coach after 17 games, following a 1-1 draw with Falkirk. His dismissal came after fans surrounded the team bus. Steven Gerrard is now under strong consideration for the role.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Rockets' Substitute Awaits Contract, Center Enhances Scoring Skills",
    "domain": "business",
    "source_domain": "www.forbes.com",
    "location": "global",
    "published": "Sun, 05 Oct 2025 21:42:32 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes"
    ],
    "domains": [
      "www.forbes.com"
    ],
    "snippets": [
      "The Rockets super sub still remains without a contract extension.",
      "The Rockets big man made major improvements defensively last season; now he must regain his scoring touch."
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/68e312076d88942d9ec2cfd7/0x0.jpg?width=960",
    "titles": [
      "What’s Ahead For Tari Eason In 2025-2026?",
      "What’s Ahead For Alperen Sengun In 2025-2026?"
    ],
    "score_components": {
      "magnitude": 0.393,
      "recency": 0.95,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.465,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Rockets' key substitute player has not yet secured a contract extension. Meanwhile, the team's prominent center has shown significant defensive improvement last season and is now focused on improving his scoring abilities.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]