[
  {
    "title": "Europa League final fever builds in Bilbao before Tottenham v Manchester United – live",
    "domain": "general",
    "location": "global",
    "published": "Wed, 21 May 2025 15:55:25 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "snippets": [
      "<ul><li>All the latest news before the final, 8pm BST kick-off</li><li><a href=\"https://www.theguardian.com/football/2025/may/20/europa-league-final-mocked-spurs-manchester-united\">Jonathan Wilson: why this game matters</a> | <a href=\"mailto:will.unwin.freelancer@theguardian.com\">Email Will</a></li></ul><p><strong>Right</strong>, time to play a searching 40-yard crossfield pass to Will Unwin, who’ll talk you through the rest of the morning. Bye.</p><p><strong>Elsewhere, Nick Ames has been in Kyiv</strong> reporting on how amputee football is helping Ukraine’s war-wounded.</p><p>“It’s about emotional gain, helping them rediscover this will to live. In some cases they’re now doing something they weren’t able to before their injuries. The key thing is that we don’t kick anyone out of a team. If you want to play, come to training and let’s do it. Everyone can try, we’ll always encourage each other.”</p> <a href=\"https://www.theguardian.com/football/live/2025/may/21/tottenham-manchester-united-europa-league-final-bilbao-buildup-live\">Continue reading...</a>"
    ],
    "image_url": "https://i.guim.co.uk/img/media/67fa6bec6cbe8c8ccd724fa44f41de733a2f33d6/201_0_1791_1433/master/1791.jpg?width=140&quality=85&auto=format&fit=max&s=0e8969cf26ce96513654df28668aeeec",
    "titles": [
      "Europa League final fever builds in Bilbao before Tottenham v Manchester United – live"
    ],
    "summary": "The Europa League final between Tottenham and Manchester United is set for an 8pm BST kick-off. Coverage includes insights from Jonathan Wilson on the significance of the match and reports from Nick Ames in Kyiv on amputee football aiding Ukraine's war-wounded. The program emphasizes emotional recovery and inclusivity, encouraging all interested to participate in the sport.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful insights into the significance of the match and the role of amputee football in aiding Ukraine's war-wounded. It increases awareness about the importance of emotional recovery and inclusivity in sports. However, it does not clearly highlight solutions or progress, limiting its score.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.997,
      "consensus": 0.2,
      "constructiveness": 0.7
    },
    "score": 0.565,
    "normalized_score": 5.54
  },
  {
    "title": "Could Pope Leo mediate between Russia and Ukraine? Trump thinks so.",
    "domain": "general",
    "location": "global",
    "published": "Wed, 21 May 2025 15:55:12 +0000",
    "source": "Washington Post",
    "sources": [
      "Washington Post"
    ],
    "snippets": [
      "The Vatican has a long history of conflict mediation, with varying degrees of success.  An effort by the pope to end the war in Ukraine would face long odds."
    ],
    "image_url": "",
    "titles": [
      "Could Pope Leo mediate between Russia and Ukraine? Trump thinks so."
    ],
    "summary": "The Vatican, known for its historical role in conflict mediation, is considering an effort to end the war in Ukraine. Despite its experience, such an initiative would encounter significant challenges given the complex nature of the ongoing conflict.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful context about the Vatican's historical role in conflict mediation and the challenges it might face in the Ukraine conflict. However, it does not provide actionable insights for the reader or report on concrete solutions or progress, hence the score.",
    "score_components": {
      "magnitude": 0.449,
      "recency": 0.997,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.579,
    "normalized_score": 6.49
  },
  {
    "title": "There’s no shame in being beaten by the best. And Gary Lineker showed us fellow sport presenters just how to do it | Adrian Chiles",
    "domain": "general",
    "location": "global",
    "published": "Wed, 21 May 2025 15:55:08 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "snippets": [
      "<p>Through dedication and sheer graft, the football legend transformed himself from a hopeless presenter into an elite one. It’s unlikely we will ever see that happen again</p><p>Amid the controversy around Gary Lineker’s exit from the BBC, a couple of points need making, entirely unrelated to the circumstances of his departure. First, how vanishingly unlikely it is we’ll ever again see an elite footballer become an elite presenter. Second, that when he started out on the road to being a consummate broadcaster, he was absolutely hopeless.</p><p>I say this as someone whose broadcasting career covers roughly the same period. Someone who played a distant second fiddle to Lineker’s first violin at BBC Sport, before becoming his rival and opposite number when I took on the role of lead sports presenter at ITV. In that contest, there turned out to be only one winner. And it wasn’t me. I must admit, I did occasionally give in to annoyance and bitterness along the way, but whatever. I know when I’m beaten. There’s no shame in being beaten by the best. And I wasn’t alone: naming ITV football presenters seen off by Lineker is a bit like remembering failed US presidential candidates. I’ll be Mitt Romney.</p> <a href=\"https://www.theguardian.com/commentisfree/2025/may/21/gary-lineker-was-once-my-rival-i-feel-no-shame-in-saying-i-was-beaten-by-the-best\">Continue reading...</a>"
    ],
    "image_url": "https://i.guim.co.uk/img/media/f3b0b89c96ac0d1a37102dc6d774749413cee1cb/97_0_3694_2956/master/3694.jpg?width=140&quality=85&auto=format&fit=max&s=9f7af7b2f05edc3e3f28cb62931c4f8a",
    "titles": [
      "There’s no shame in being beaten by the best. And Gary Lineker showed us fellow sport presenters just how to do it | Adrian Chiles"
    ],
    "summary": "Gary Lineker, a former elite footballer, has been recognized for his exceptional transformation into an elite sports presenter, a journey marked by significant improvement from his initial struggles. His departure from the BBC has sparked discussions, highlighting the rarity of such a career transition in sports broadcasting. A fellow broadcaster and former rival at ITV acknowledges Lineker's unparalleled skills in the field, despite personal challenges and competition, ultimately conceding defeat to Lineker's superior talent.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides a deep understanding of the career transition in sports broadcasting, highlighting Gary Lineker's journey from an elite footballer to an elite sports presenter. It offers insights into personal challenges and competition in the field, making it useful for readers interested in sports broadcasting. However, it doesn't clearly highlight progress or solutions, hence the score.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.997,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.575,
    "normalized_score": 6.22
  },
  {
    "title": "Israel-Gaza war live: more than 80 killed in latest strikes as aid deliveries condemned as ‘ridiculously inadequate’",
    "domain": "general",
    "location": "global",
    "published": "Wed, 21 May 2025 15:52:24 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "snippets": [
      "<p>Doctors Without Borders says deliveries are just ‘a smokescreen to pretend the siege is over’</p><ul><li><strong><a href=\"https://www.theguardian.com/world/2025/may/20/israel-still-blocking-aid-for-gaza-despite-promise-to-lift-siege-says-un\">Israel still blocking aid for Gaza despite promise to lift siege, says UN</a></strong></li></ul><p>Reuters has spoken to Mahmoud al-Haw at one of the soup kitchens in <strong>Gaza</strong>. The father-of-four says he has been regularly waiting in crowds for up to six hours to obtain food, and sometimes returns empty-handed.</p><p>“I have a sick daughter. I can’t provide her with anything. There is no bread, there is nothing,” the 39-year-old told the news agency.</p> <a href=\"https://www.theguardian.com/world/live/2025/may/21/israel-gaza-blockade-aid-hamas-netanyahu-middle-east-crisis-live-news-updates\">Continue reading...</a>",
      "<p>Doctors Without Borders says deliveries are just ‘a smokescreen to pretend the siege is over’</p><ul><li><strong><a href=\"https://www.theguardian.com/world/2025/may/20/israel-still-blocking-aid-for-gaza-despite-promise-to-lift-siege-says-un\">Israel still blocking aid for Gaza despite promise to lift siege, says UN</a></strong></li></ul><p>Reuters has spoken to Mahmoud al-Haw at one of the soup kitchens in <strong>Gaza</strong>. The father-of-four says he has been regularly waiting in crowds for up to six hours to obtain food, and sometimes returns empty-handed.</p><p>“I have a sick daughter. I can’t provide her with anything. There is no bread, there is nothing,” the 39-year-old told the news agency.</p> <a href=\"https://www.theguardian.com/world/live/2025/may/21/israel-gaza-blockade-aid-hamas-netanyahu-middle-east-crisis-live-news-updates\">Continue reading...</a>"
    ],
    "image_url": "https://i.guim.co.uk/img/media/b5adcf87df0f66d705ab7449b30b0643adc088df/92_0_2500_2000/master/2500.jpg?width=140&quality=85&auto=format&fit=max&s=a70925528b6c0d7223b55fc6f93fd13c",
    "titles": [
      "Israel-Gaza war live: more than 80 killed in latest strikes as aid deliveries condemned as ‘ridiculously inadequate’",
      "Israel-Gaza war live: more than 80 killed in latest strikes as aid deliveries condemned as ‘ridiculously inadequate’"
    ],
    "summary": "Doctors Without Borders criticized Israel for still blocking aid to Gaza, calling deliveries a \"smokescreen\" despite promises to lift the siege, as reported by the UN. Residents, including Mahmoud al-Haw, a father of four, face severe shortages, with some waiting up to six hours for food, often in vain. Al-Haw highlighted his inability to provide for his sick daughter, underscoring the dire humanitarian situation in Gaza.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides a useful context about the ongoing conflict and humanitarian crisis in Gaza. It raises awareness about the severity of the situation, the obstacles to aid delivery, and the impact on civilians. However, it lacks a focus on solutions or progress towards resolving the crisis.",
    "score_components": {
      "magnitude": 0.579,
      "recency": 0.997,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.631,
    "normalized_score": 10.0
  },
  {
    "title": "Putin Visits Kursk for First Time Since Russia Drove Out Ukrainian Forces",
    "domain": "general",
    "location": "global",
    "published": "Wed, 21 May 2025 15:50:58 +0000",
    "source": "New York Times",
    "sources": [
      "New York Times"
    ],
    "snippets": [
      "The Russian leader traveled to the region in the west of the country where a surprise incursion last year embarrassed Moscow."
    ],
    "image_url": "https://static01.nyt.com/images/2025/05/21/multimedia/21int-russia-putin-mlpv/21int-russia-putin-mlpv-mediumSquareAt3X.jpg",
    "titles": [
      "Putin Visits Kursk for First Time Since Russia Drove Out Ukrainian Forces"
    ],
    "summary": "The Russian leader visited a region in western Russia that experienced an unexpected incursion last year, which caused embarrassment for Moscow. This visit underscores the significance of the incident and Moscow's response to it.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story offers basic awareness about Putin's visit to Kursk and its significance in the context of a previous incident. However, it does not provide deeper insights, actionable knowledge, or a clear picture of progress or solutions to any ongoing issues.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.996,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.552,
    "normalized_score": 4.66
  },
  {
    "title": "NFL world reacts to Packers' failed attempt at getting the Eagles' 'Tush Push' banned",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 21 May 2025 15:57:39 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "snippets": [
      "The NFL world is buzzing after the Packers' proposal to ban the 'Tush Push' only received 22 of the necessary 24 votes to ban the Eagles' short-yardage play"
    ],
    "image_url": "",
    "titles": [
      "NFL world reacts to Packers' failed attempt at getting the Eagles' 'Tush Push' banned"
    ],
    "summary": "The Packers' proposal to ban the 'Tush Push,' a short-yardage play used by the Eagles, failed to pass after receiving only 22 of the necessary 24 votes in the NFL. This decision means the play will continue to be allowed in the league.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers minimal depth or insight. While it informs readers about a specific event in the NFL, it does not provide actionable insights, report on solutions or improvements, or increase clarity around systems, causes, trends, or impacts that matter.",
    "score_components": {
      "magnitude": 0.359,
      "recency": 0.998,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.513,
    "normalized_score": 2.03
  },
  {
    "title": "Do you know these 2 Shasta Family YMCA Athletes of the Week?",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 21 May 2025 15:56:20 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "snippets": [
      "Meet the two Shasta Family YMCA Athletes of the Week from Enterprise and Foothill high schools."
    ],
    "image_url": "",
    "titles": [
      "Do you know these 2 Shasta Family YMCA Athletes of the Week?"
    ],
    "summary": "The Shasta Family YMCA recognized two high school athletes as Athletes of the Week, representing Enterprise and Foothill high schools. These students were celebrated for their outstanding achievements in their respective sports, showcasing their dedication and skill. This acknowledgment highlights their contribution to high school athletics and their schools' sports programs.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about the achievements of two high school athletes. However, it doesn't provide deeper insights or actionable information for the reader, nor does it report on solutions or improvements. The story doesn't increase clarity around systems or impacts that matter.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.998,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.525,
    "normalized_score": 2.84
  },
  {
    "title": "Kansas City Chiefs officially sign DB Nohl Williams to a rookie contract",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 21 May 2025 15:55:38 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "snippets": [
      "Kansas City Chiefs officially signed defensive back Nohl Williams to a rookie contract | @EdEastonJr"
    ],
    "image_url": "",
    "titles": [
      "Kansas City Chiefs officially sign DB Nohl Williams to a rookie contract"
    ],
    "summary": "The Kansas City Chiefs have officially signed defensive back Nohl Williams to a rookie contract, as reported by Ed Easton Jr. This move adds Williams to the team's roster, bolstering their defensive lineup for the upcoming season.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers basic awareness of a new player signing to the Kansas City Chiefs. However, it doesn't provide deeper understanding, actionable insights, or report on solutions or improvements. It also doesn't increase clarity around systems, trends, or impacts that matter.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.997,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.505,
    "normalized_score": 1.49
  },
  {
    "title": "NFL teams can keep using the tush push after ban proposal fails at owners meetings, AP source says",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 21 May 2025 15:54:40 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "snippets": [],
    "image_url": "",
    "titles": [
      "NFL teams can keep using the tush push after ban proposal fails at owners meetings, AP source says"
    ],
    "summary": "I'm sorry, but you haven't provided any specific news content for me to summarize. Could you please provide the details of the news story you'd like summarized?",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "There's not enough information provided to evaluate the constructiveness of this story. Based on the title, it seems to provide basic awareness of a decision made at the owners meetings, but without more information, it's impossible to determine if it offers deeper understanding, actionable insights, or reports on solutions or improvements.",
    "score_components": {
      "magnitude": 0.359,
      "recency": 0.997,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.483,
    "normalized_score": 0.0
  },
  {
    "title": "Manny Pacquiao unretiring at 46 to fight WBC welterweight champion Mario Barrios in Las Vegas",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 21 May 2025 15:53:29 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "snippets": [
      "Manny Pacquiao is coming out of retirement.  The 46-year-old boxing great is scheduled to face WBC welterweight champion Mario Barrios at the MGM Grand in Las Vegas on July 19, nearly four years after his last professional fight.  “I’m back,” Pacquiao posted Wednesday on social media."
    ],
    "image_url": "",
    "titles": [
      "Manny Pacquiao unretiring at 46 to fight WBC welterweight champion Mario Barrios in Las Vegas"
    ],
    "summary": "Manny Pacquiao, the 46-year-old boxing legend, announced his return from retirement to fight WBC welterweight champion Mario Barrios on July 19 at the MGM Grand in Las Vegas. This marks Pacquiao's first fight in nearly four years, a comeback he confirmed with a social media post stating, \"I’m back.\"",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about Manny Pacquiao's return to boxing, but it doesn't provide much depth or insight beyond that. It doesn't contribute to the reader's understanding or decision-making in a significant way, nor does it report on solutions, improvements, or innovations.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.997,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.505,
    "normalized_score": 1.49
  },
  {
    "title": "Bitcoin jumps to new all-time high, surpassing prior record in January",
    "domain": "business",
    "location": "national",
    "published": "Wed, 21 May 2025 15:56:12 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "snippets": [
      "Bitcoin rose to a new all-time high on Wednesday, breaking its January record."
    ],
    "image_url": "",
    "titles": [
      "Bitcoin jumps to new all-time high, surpassing prior record in January"
    ],
    "summary": "On Wednesday, Bitcoin reached a new all-time high, surpassing its previous record set in January. This marks a significant milestone for the cryptocurrency, indicating a notable increase in its value.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story informs readers about the latest development in the cryptocurrency market, specifically the new record high for Bitcoin. This could be useful for those interested or invested in cryptocurrencies. However, it does not provide solutions or highlight progress beyond the new record.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.998,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.555,
    "normalized_score": 4.86
  },
  {
    "title": "Mali’s literacy project taught thousands of young people to read and write. Trump’s USAID cuts shut it all down",
    "domain": "business",
    "location": "global",
    "published": "Wed, 21 May 2025 15:55:40 +0000",
    "source": "Fortune",
    "sources": [
      "Fortune"
    ],
    "snippets": [
      "Thousands of people who now find themselves stranded in Mali, a country ravaged by high poverty where 70% of the population can't read or write."
    ],
    "image_url": "https://fortune.com/img-assets/wp-content/uploads/2025/05/AP25140456686165-e1747842867316.jpg?w=2048",
    "titles": [
      "Mali’s literacy project taught thousands of young people to read and write. Trump’s USAID cuts shut it all down"
    ],
    "summary": "Thousands of individuals are currently stranded in Mali, a nation grappling with severe poverty levels. The situation is exacerbated by a literacy crisis, with 70% of the population being unable to read or write.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful information about the impact of policy decisions on literacy programs in Mali. It increases awareness about the literacy crisis in Mali and the effects of foreign aid cuts. However, it doesn't highlight any solutions or progress being made to address the situation.",
    "score_components": {
      "magnitude": 0.429,
      "recency": 0.997,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.591,
    "normalized_score": 7.3
  },
  {
    "title": "Senate passed a surprise 'no tax on tips' bill. Here's what it could mean for workers",
    "domain": "business",
    "location": "national",
    "published": "Wed, 21 May 2025 15:54:42 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "snippets": [
      "Senate passed a surprise 'no tax on tips' bill. If enacted, here's how could qualify for the deduction."
    ],
    "image_url": "",
    "titles": [
      "Senate passed a surprise 'no tax on tips' bill. Here's what it could mean for workers"
    ],
    "summary": "The Senate recently passed a bill that, if enacted, would exempt tips from being taxed. To qualify for this deduction, individuals must report their tips accurately. This legislative move aims to alleviate some of the financial burdens on workers who rely heavily on tips for income. The bill's current status is pending further approval before it can become law.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it not only informs readers about a recent legislative development, but also explains its potential implications for workers who rely on tips. It provides actionable insights and increases awareness about the financial challenges of tipped workers.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.997,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.585,
    "normalized_score": 6.89
  },
  {
    "title": "Bitcoin passes January peak to hit new record high",
    "domain": "business",
    "location": "global",
    "published": "Wed, 21 May 2025 15:50:53 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times"
    ],
    "snippets": [
      "Price rises to $109,481 on hopes US lawmakers will soon agree first digital assets regulations"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Fa06cb7c5-ad98-4c77-8bc3-02c92282fa64.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Bitcoin passes January peak to hit new record high"
    ],
    "summary": "Bitcoin's price increased to $109,481 amid optimism that US lawmakers are close to agreeing on the country's first regulations for digital assets. This significant price movement reflects the market's positive reaction to the potential regulatory clarity in the digital currency space.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the current state of Bitcoin and the potential impact of US regulations on digital assets. However, it doesn't offer a deep understanding of the broader implications or trends in digital currency regulation.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.996,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.554,
    "normalized_score": 4.8
  },
  {
    "title": "Cardiac arrests on the job are rising and often fatal. Workers and employers are not prepared for the risk",
    "domain": "business",
    "location": "national",
    "published": "Wed, 21 May 2025 15:48:29 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "snippets": [
      "Cardiac arrests occur each year in workplaces not prepared for the emergencies, with fatal consequences. ADP, American Heart Association are teaming on it."
    ],
    "image_url": "",
    "titles": [
      "Cardiac arrests on the job are rising and often fatal. Workers and employers are not prepared for the risk"
    ],
    "summary": "ADP and the American Heart Association are collaborating to address the issue of cardiac arrests in the workplace, which annually result in fatalities due to a lack of preparedness for such emergencies. This partnership aims to improve readiness and response to cardiac emergencies in work environments to save lives.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive as it raises awareness about a critical health issue in workplaces, reports on a solution being implemented by ADP and the American Heart Association, and implicitly encourages employers to prepare for such emergencies.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.996,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.584,
    "normalized_score": 6.82
  },
  {
    "title": "Weight Loss Breakthrough: Scientists Discover Key to Fat-Burning Power in Human Cells",
    "domain": "science",
    "location": "global",
    "published": "Wed, 21 May 2025 15:56:53 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/weight-loss-breakthrough-scientists-discover-key-to-fat-burning-power-in-human-cells/\" rel=\"nofollow\" title=\"Weight Loss Breakthrough: Scientists Discover Key to Fat-Burning Power in Human Cells\"><img alt=\"Overweight Man Belly Measuring Tape\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Overweight-Man-Belly-Measuring-Tape-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>Blocking Mitch, a protein that regulates energy control, prevents fat from accumulating in human cells. About a decade ago, a new generation of weight-loss drugs promised a slimmer, healthier future. But there was a catch: while these medications helped shed fat, they also led to a loss of muscle mass. Now, scientists may be on [...]"
    ],
    "image_url": "",
    "titles": [
      "Weight Loss Breakthrough: Scientists Discover Key to Fat-Burning Power in Human Cells"
    ],
    "summary": "Scientists have discovered that blocking a protein named Mitch can prevent fat accumulation in human cells, potentially offering a new avenue for weight loss treatments. This finding addresses a significant drawback of previous weight-loss drugs, which, although effective in reducing fat, also led to undesirable muscle mass loss. This breakthrough could pave the way for developing more effective and balanced weight-loss therapies.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it provides the reader with a deeper understanding of a new scientific discovery that has potential implications for weight loss treatments. It highlights progress in the field of weight loss research and offers actionable insights for those interested in the development of new therapies.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.998,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.585,
    "normalized_score": 6.89
  },
  {
    "title": "Scientists Discover Powerful Anti-Cancer Benefits of Popular Weight Loss Drugs",
    "domain": "science",
    "location": "global",
    "published": "Wed, 21 May 2025 15:31:03 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/scientists-discover-powerful-anti-cancer-benefits-of-popular-weight-loss-drugs/\" rel=\"nofollow\" title=\"Scientists Discover Powerful Anti-Cancer Benefits of Popular Weight Loss Drugs\"><img alt=\"Medically Accurate Cancer Cell Rendering\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Medically-Accurate-Cancer-Cell-Rendering-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>After adjusting for the weight loss benefits of surgery, GLP-1 drugs were linked to a 41% lower risk of obesity-related cancer. New research presented at the European Congress on Obesity (ECO) in Malaga, Spain, and published in the journal eClinicalMedicine, suggests that some widely used weight-loss medications may do more than just help people slim [...]"
    ],
    "image_url": "",
    "titles": [
      "Scientists Discover Powerful Anti-Cancer Benefits of Popular Weight Loss Drugs"
    ],
    "summary": "Researchers have found that GLP-1 weight loss drugs may significantly reduce the risk of obesity-related cancers by 41%, even after adjusting for the benefits of weight loss through surgery. This discovery was presented at the European Congress on Obesity in Malaga, Spain, and published in eClinicalMedicine.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive because it reports on a significant discovery that links weight loss drugs to a reduced risk of obesity-related cancers. It increases awareness about the potential benefits of these drugs beyond weight loss, and provides useful information for those considering their use.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.992,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.583,
    "normalized_score": 6.76
  },
  {
    "title": "Better Than Ozempic: Scientists Reveal Most Effective Weight Loss Drug",
    "domain": "science",
    "location": "global",
    "published": "Wed, 21 May 2025 15:06:23 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/better-than-ozempic-scientists-reveal-most-effective-weight-loss-drug/\" rel=\"nofollow\" title=\"Better Than Ozempic: Scientists Reveal Most Effective Weight Loss Drug\"><img alt=\"Woman Holding Insulin Semaglutide Pen\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Woman-Holding-Insulin-Semaglutide-Pen-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>A new head-to-head study reveals tirzepatide achieves 47% more weight loss than semaglutide in people with obesity but without diabetes, highlighting its superior effectiveness and cardiometabolic benefits. A groundbreaking new study has revealed that tirzepatide leads to significantly greater weight loss than semaglutide in people living with obesity but without diabetes. Over the course of [...]"
    ],
    "image_url": "",
    "titles": [
      "Better Than Ozempic: Scientists Reveal Most Effective Weight Loss Drug"
    ],
    "summary": "A recent study has shown that tirzepatide is significantly more effective for weight loss than semaglutide, achieving 47% more weight loss in individuals with obesity but without diabetes. This finding highlights tirzepatide's superior effectiveness and its cardiometabolic benefits, marking a noteworthy advancement in obesity treatment options.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it provides valuable information about the effectiveness of different weight loss drugs. However, it could be more constructive if it provided more context or insight into how these drugs work, their potential side effects, or how they compare to other weight loss strategies.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.986,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.571,
    "normalized_score": 5.95
  },
  {
    "title": "Unveiling the secrets of planet formation in environments of high UV radiation",
    "domain": "science",
    "location": "global",
    "published": "Wed, 21 May 2025 11:59:04 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "snippets": [
      "The fundamental building blocks for planet formation can exist even in environments with extreme ultraviolet radiation, according to a new study by an international collaboration led by Penn State astronomers."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/unveiling-the-secrets.jpg",
    "titles": [
      "Unveiling the secrets of planet formation in environments of high UV radiation"
    ],
    "summary": "A study led by Penn State astronomers has found that the essential elements needed for planet formation can survive in areas with intense ultraviolet radiation. This international research expands our understanding of where planets could potentially form in the universe.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it provides deeper understanding about the conditions necessary for planet formation, highlighting a scientific advancement in our knowledge of the universe. It contributes to reader's awareness of space science and potentially influences their perspective on the possibilities of extraterrestrial life.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.943,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.569,
    "normalized_score": 5.81
  },
  {
    "title": "Yeast reveals how species adapt to a warmer climate",
    "domain": "science",
    "location": "global",
    "published": "Wed, 21 May 2025 11:57:03 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "snippets": [
      "How do organisms adapt to climate change? A new study reveals the complex interplay between genetic diversity and temperature tolerance evolution."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/yeast-reveals-how-spec.jpg",
    "titles": [
      "Yeast reveals how species adapt to a warmer climate"
    ],
    "summary": "A recent study has uncovered the intricate relationship between genetic diversity and the evolution of temperature tolerance in organisms, highlighting how they adapt to climate change. This research emphasizes the importance of genetic variation in enabling species to survive changing environmental conditions.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story informs readers about the relationship between genetic diversity and climate change adaptation, increasing awareness of this important environmental issue. However, it doesn't clearly highlight any solutions or specific actions that can be taken based on this information, which is why it doesn't score a perfect 1.0.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.942,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.558,
    "normalized_score": 5.07
  }
]