[
  {
    "title": "What will the IMF and World Bank do in the latest economic crisis?",
    "domain": "general",
    "location": "global",
    "published": "Wed, 23 Apr 2025 21:55:06 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Global financial institutions meet as turmoil brings fears worldwide."
    ],
    "image_url": "",
    "titles": [
      "What will the IMF and World Bank do in the latest economic crisis?"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.3,
      "recency": 0.971,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.483,
    "normalized_score": 8.94,
    "summary": "Global financial institutions convened amid global fears of financial instability. The meeting aimed to address and mitigate widespread concerns over potential economic turmoil. The current status or outcomes of these discussions have not been specified, indicating ongoing efforts to manage the situation."
  },
  {
    "title": "Trump criticises Zelensky as Ukraine refuses Russian control of Crimea",
    "domain": "general",
    "location": "global",
    "published": "Wed, 23 Apr 2025 23:38:09 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Ukrainian president has consistently rejected the suggestion that his country give up its claim to the Crimean Peninsula."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/5106/live/31183d90-209a-11f0-9c65-a5c3dc449bf3.jpg",
    "titles": [
      "Trump criticises Zelensky as Ukraine refuses Russian control of Crimea"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.26,
      "recency": 0.995,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.477,
    "normalized_score": 8.67,
    "summary": "The Ukrainian president has firmly maintained Ukraine's stance on not relinquishing its claim to the Crimean Peninsula, consistently rejecting any suggestions to do so. This position underscores Ukraine's commitment to its territorial integrity and sovereignty over Crimea."
  },
  {
    "title": "Nine killed in Russian attack on Ukraine bus",
    "domain": "general",
    "location": "global",
    "published": "Wed, 23 Apr 2025 12:30:49 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "At least 30 were injured in the city of Marhanets in central-south Ukraine."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/338a/live/82309870-200a-11f0-b39a-65fa3ab53b91.jpg",
    "titles": [
      "Nine killed in Russian attack on Ukraine bus"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.34,
      "recency": 0.84,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.462,
    "normalized_score": 7.98,
    "summary": "At least 30 people were injured in Marhanets, a city in central-south Ukraine. The current status of those injured or the cause of the incident has not been specified in the provided information."
  },
  {
    "title": "Air pollution still plagues nearly half of Americans. That does a number on our health",
    "domain": "general",
    "location": "national",
    "published": "Wed, 23 Apr 2025 17:56:11 -0400",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Despite improvements in air quality in past decades, 156 million Americans still breathe in too much soot or ozone, says the annual State of the Air report from the American Lung Association."
    ],
    "image_url": "",
    "titles": [
      "Air pollution still plagues nearly half of Americans. That does a number on our health"
    ],
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The story provides useful information about the prevalence of air pollution and its health impacts. It helps raise awareness about an important environmental and public health issue.",
    "score_components": {
      "magnitude": 0.22,
      "recency": 0.971,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.459,
    "normalized_score": 7.84,
    "summary": "The American Lung Association's annual State of the Air report highlights that, despite decades of air quality improvements, 156 million Americans are exposed to unhealthy levels of soot or ozone."
  },
  {
    "title": "Five cards China holds in a trade war with the US",
    "domain": "general",
    "location": "global",
    "published": "Wed, 23 Apr 2025 21:50:09 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "From rare earths to billions in US debt, here's what China has in its arsenal - and how strong they are."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/f017/live/1a4c4200-1f2d-11f0-9612-0d839e1e9bdc.jpg",
    "titles": [
      "Five cards China holds in a trade war with the US"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.22,
      "recency": 0.97,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.459,
    "normalized_score": 7.84,
    "summary": "China possesses significant assets that bolster its global position, including extensive reserves of rare earth metals crucial for technology and manufacturing, as well as holding a substantial portion of US debt, amounting to billions of dollars. These assets are key elements of China's economic and strategic strength on the international stage."
  },
  {
    "title": "Lions Lock in Kerby Joseph with Record-Breaking $86M Deal",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 23 Apr 2025 23:44:37 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Kerby Joseph is staying in Detroit and currently is holding the title of highest paid safety in the league"
    ],
    "image_url": "",
    "titles": [
      "Lions Lock in Kerby Joseph with Record-Breaking $86M Deal"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.996,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.379,
    "normalized_score": 4.17,
    "summary": "Kerby Joseph has secured his position with the Detroit Lions, becoming the highest-paid safety in the NFL. This development confirms his value to the team and sets a new benchmark for player compensation in his position."
  },
  {
    "title": "Deep, talented South Aiken boys' tennis team poised for playoff run",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 23 Apr 2025 23:47:00 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Apr. 23—Senior Night had a celebratory feel to it Tuesday for the South Aiken boys' tennis team, as six of the team's 12 players were honored for their contributions to the program ahead of their upcoming graduation. The T-Breds are hopeful that celebration was the first of many. The Class AAAA playoffs start next week, and South Aiken will be one of the favorites to bring home a state title. ..."
    ],
    "image_url": "",
    "titles": [
      "Deep, talented South Aiken boys' tennis team poised for playoff run"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.12,
      "recency": 0.997,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.355,
    "normalized_score": 3.07,
    "summary": "On April 23, the South Aiken boys' tennis team celebrated Senior Night, honoring six of its 12 players before their graduation. The event marked the beginning of a hopeful period for the team as they enter the Class AAAA playoffs next week. South Aiken is considered a favorite to win the state title, reflecting their strong performance and potential as the postseason approaches."
  },
  {
    "title": "Marcelo Mayer homers again, racks up sixth-straight multi-hit game",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 23 Apr 2025 23:46:09 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Mayer has hit four home runs and driven in 16 runs in his last six games."
    ],
    "image_url": "",
    "titles": [
      "Marcelo Mayer homers again, racks up sixth-straight multi-hit game"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.12,
      "recency": 0.996,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.355,
    "normalized_score": 3.07,
    "summary": "Mayer has achieved a significant milestone in baseball by hitting four home runs and driving in 16 runs over his last six games. This performance highlights his exceptional skill and contribution to his team's offense during this period."
  },
  {
    "title": "Out of nowhere on NFL draft eve a new favorite has emerged for Raiders top pick",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 23 Apr 2025 23:36:00 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A new first-round favorite could very well be emerging on NFL draft eve for the Raiders."
    ],
    "image_url": "",
    "titles": [
      "Out of nowhere on NFL draft eve a new favorite has emerged for Raiders top pick"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.12,
      "recency": 0.994,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.355,
    "normalized_score": 3.07,
    "summary": "On the eve of the NFL draft, there is growing speculation that the Raiders may have a new favorite for their first-round pick. However, the specific details about the potential pick or the reasons behind the emerging favorite are not provided in the available information."
  },
  {
    "title": "Gabriel Landeskog injury update: Latest news on Colorado Avalanche captain",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 23 Apr 2025 23:21:28 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Colorado Avalanche captain Gabriel Landeskog looks like he could be returning from a three-year injury absence Wednesday against the Dallas Stars."
    ],
    "image_url": "",
    "titles": [
      "Gabriel Landeskog injury update: Latest news on Colorado Avalanche captain"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.12,
      "recency": 0.991,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.354,
    "normalized_score": 3.03,
    "summary": "Colorado Avalanche captain Gabriel Landeskog is expected to return to the ice Wednesday against the Dallas Stars after being sidelined for three years due to an injury. This marks a significant comeback for the team's leader."
  },
  {
    "title": "Trump attacks Ukraine for not recognising Russian occupation of Crimea",
    "domain": "business",
    "location": "global",
    "published": "Wed, 23 Apr 2025 22:47:11 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "US president says Kyiv’s position is ‘very harmful to the peace negotiations with Russia’"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F503e3ff1-d3c0-4b5d-86bf-2a5182363fed.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Trump attacks Ukraine for not recognising Russian occupation of Crimea"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.26,
      "recency": 0.983,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.474,
    "normalized_score": 8.53,
    "summary": "The US President has labeled Kyiv's stance as significantly detrimental to the ongoing peace negotiations with Russia. This statement highlights concerns about the potential impact of Ukraine's position on the efforts to resolve the conflict."
  },
  {
    "title": "S&P 500 Gains and Losses Today: Tech Stocks Jump as Trump Softens Stance on Fed and Trade",
    "domain": "business",
    "location": "global",
    "published": "Wed, 23 Apr 2025 20:58:18 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "<figure><img alt=\"Michael Nagle / Bloomberg via Getty Images\" src=\"https://www.investopedia.com/thmb/RkuFLvD2YA7_tgmXrGHT-oLNzq8=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2211015975-632b5997db41423b8c8f113022742431.jpg\" title=\"The floor at the New York Stock Exchange (NYSE) in New York, US, on Wednesday, April 23, 2025.\" /><figcaption><i><p>Michael Nagle / Bloomberg via Getty Images</p></i></figcaption></figure><br /><h3>Key Takeaways</h3><ul><li>The S&amp;P 500 advanced 1.7% on Wednesday, April 23, as comments from the White House pointed to stability at the Fed and the possibility of easing trade tensions.</li><li>Antenna and high-speed cable manufacturer Amphenol reported strong quarterly results, and its shares pushed higher.<br /></li><li>Enphase Energy shares dropped after the solar technology firm missed quarterly estimates and indicated that tariffs could weigh on its upcoming performance.<br /></li></ul><br /><br /><p>Major U.S. equities indexes pushed higher after President Trump indicated that he <a href=\"https://www.investopedia.com/trump-says-he-has-no-intention-of-firing-fed-chair-powell-despite-criticism-11720202\">does not intend to fire Jerome Powell</a> from his role as Federal Reserve chair. White House officials also indicated that the U.S. could adopt a more measured approach to <a href=\"https://www.investopedia.com/trump-s-top-economic-advisor-sees-de-escalation-of-unsustainable-china-trade-war-11719849\">tariffs on imports from China</a>, suggesting a potential easing of trade tensions between the world's two largest economies.</p><p>The S&amp;P 500 added 1.7% in the midweek trading session, while the Dow closed 1.1% higher. The tech-heavy Nasdaq soared 2.5%. </p><p>Amphenol (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;aph\">APH</a>), a manufacturer of antennas and high-speed electronic cables, <a href=\"https://www.investopedia.com/high-speed-cable-maker-amphenol-stock-soars-on-strong-results-rosy-outlook-11720396\">topped revenue and adjusted earnings per share (EPS) estimates</a> in its first-quarter earnings report. The company also provided an upbeat forecast for the current quarter, noting opportunities across end markets and highlighting how innovation and strategic acquisitions have helped expand its product offering. Amphenol shares surged 8.2% to secure the top performance in the S&amp;P 500 on Wednesday.</p><p>The technology sector outperformed on Wednesday, bolstered by increased optimism for improvements in the U.S.-China trade relationship. Super Micro Computer (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;smci\">SMCI</a>) announced an expansion of its collaboration with Japanese tech firm Fujitsu, which will deploy a new Supermicro server as part of its large language model (LLM) project. Supermicro shares jumped 7.6%.</p><p>Meanwhile, Palantir Technologies (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;pltr\">PLTR</a>) shares gained 7.3%. The data analytics software firm said it will partner with defense contractor Northrop Grumman (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;noc\">NOC</a>) to develop combat vehicles that leverage artificial intelligence (AI) technology. Northrop Grumman shares edged 1.9% higher on Wednesday, marking a minor recovery from the heavy decline posted in the prior session following a lackluster earnings report.</p><p>Shares of solar technology firm Enphase Energy (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;enph\">ENPH</a>) plunged 15.7%, losing the most of any S&amp;P 500 stock. The company posted <a href=\"https://www.investopedia.com/enphase-energy-stock-sinks-on-weaker-than-expected-results-expected-tariffs-hit-11720283\">lower-than-expected sales and profits</a> for the first quarter, and Enphase's CEO noted that tariffs could weigh on future results. In particular, the company sources battery cell packs from China and anticipates that levies on these imports will pressure its gross margins in upcoming quarters.</p><p>Although heating, ventilation, and air conditioning (HVAC) specialist Lennox International (<a class=\"pseudoStyle\" href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;lii\">LII</a>) topped quarterly sales and profit estimates, its full-year guidance fell short of consensus forecasts, and its shares fell 9.0%. The CEO stressed that Lennox is adapting to the challenging economic environment with pricing adjustments as it aims to maintain the stability of its supply chain.</p><p>Shares of oilfield services and energy technology firm Baker Hughes (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;bkr\">BKR</a>) sank 6.4% on Wednesday following a mixed quarterly earnings release. Although profits topped forecasts, revenues came in below expectations. The company faces an uncertain macroeconomic backdrop and softness in oil prices that could hinder its clients' production activities.<br /></p>"
    ],
    "image_url": "https://www.investopedia.com/thmb/RkuFLvD2YA7_tgmXrGHT-oLNzq8=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2211015975-632b5997db41423b8c8f113022742431.jpg",
    "titles": [
      "S&P 500 Gains and Losses Today: Tech Stocks Jump as Trump Softens Stance on Fed and Trade"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.24,
      "recency": 0.958,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.462,
    "normalized_score": 7.98,
    "summary": "On April 23, 2025, the S&P 500 rose 1.7% following statements from the White House indicating stability at the Federal Reserve and potential easing of U.S.-China trade tensions. Amphenol's strong quarterly results led its shares to jump 8.2%, marking the top performance in the S&P 500 for the day. In contrast, Enphase Energy's shares fell 15.7% due to lower-than-expected sales and profits, along with concerns over future tariffs affecting its gross margins. The technology sector saw significant gains, with optimism around U.S.-China trade relations contributing to the positive movement. Other "
  },
  {
    "title": "Trump to exempt carmakers from some US tariffs",
    "domain": "business",
    "location": "global",
    "published": "Wed, 23 Apr 2025 20:55:42 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "President’s latest retreat follows intense lobbying by industry executives"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Fc1f969da-0fbe-425b-90b0-cff2801a294f.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Trump to exempt carmakers from some US tariffs"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.24,
      "recency": 0.957,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.461,
    "normalized_score": 7.94,
    "summary": "Following intense lobbying efforts from industry executives, the President has decided to retreat from a previously announced policy decision. This marks a significant change in direction for the administration, influenced directly by the business sector's input."
  },
  {
    "title": "Bessent warns mutual de-escalation required in US-China trade war",
    "domain": "business",
    "location": "global",
    "published": "Wed, 23 Apr 2025 22:30:47 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Treasury secretary denies reports Washington will make unilateral cuts to tariffs"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Fb576f70f-8a32-469c-aaf5-f9299767c543.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Bessent warns mutual de-escalation required in US-China trade war"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.22,
      "recency": 0.979,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.461,
    "normalized_score": 7.94,
    "summary": "The Treasury Secretary has officially denied reports claiming that Washington plans to unilaterally reduce tariffs. This statement clarifies the current stance of the U.S. government regarding tariff policy, indicating no such cuts will be made independently."
  },
  {
    "title": "Uncertainty About Tariffs Has Become 'Pervasive' In The Economy, Fed Finds",
    "domain": "business",
    "location": "global",
    "published": "Wed, 23 Apr 2025 19:56:12 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "<figure><img alt=\"Saul Loeb / AFP via Getty Images\" src=\"https://www.investopedia.com/thmb/7McRBluuMgl1SSjfupDMHYQPzY4=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2210995126-6333440e8efd43cdaf5fa1e4d5f58671.jpg\" title=\"US President Donald Trump speaks with reporters outside the White House in Washington, DC, on April 23, 2025.\" /><figcaption><i><p>Saul Loeb / AFP via Getty Images</p></i></figcaption></figure><br /><h3>Key Takeaways</h3><ul><li>Uncertainty about tariffs became \"pervasive\" among business and community leaders around the country in April, according to a report by the Federal Reserve.<br /></li><li>Business leaders said uncertainty is making it hard to invest and plan for the future.<br /></li><li>The report highlighted the \"on the ground\" consequences of President Donald Trump's rapidly shifting trade war.<br /></li></ul><br /><br /><p>Everyone is talking about tariffs, and no one quite knows what to make of them.<br /><br />That's according to the Federal Reserve's \"<a class=\"recommendation-inline-link\" href=\"https://www.investopedia.com/terms/b/beigebook.asp\">Beige Book</a>\" published Wednesday. The report showed that among business and community leaders around the country, uncertainty about tariffs intensified in April as President Donald Trump <a href=\"https://www.investopedia.com/trump-s-tariffs-could-be-at-their-peak-but-there-are-some-caveats-11720442\">steered his trade war in unpredictable directions</a>. Some businesses braced for price increases from the import taxes, some prepared for layoffs, and some found themselves unable to make plans.<span class=\"ql-inline-citation\"></span><br /><br />The Beige Book, a compilation of reports from business, nonprofit, and community leaders in local Fed districts around the country, gave a snapshot of how Trump's trade policies are affecting Main Street.<br /><br />\"Economic activity was little changed since the previous report, but uncertainty around international trade policy was pervasive across reports,\" Fed economists wrote.<br /><br />April's report showed worries about tariffs have ramped up from an already high level in March. The reports mentioned \"uncertainty\" or a variation 89 times in April, up from 47 in March. \"Tariffs\" came up 107 times, up from 49. By contrast, in April 2024, when tariffs were just a gleam in then-candidate Trump's eye, \"uncertainty\" came up 13 times and tariffs not at all.<br /><br />Experts have long warned that Trump's on-again, off-again campaign of imposing import taxes could <a href=\"https://www.investopedia.com/why-uncertainty-corrodes-the-economy-11698581\">stifle the economy</a> by forcing businesses to delay making investments, and the report showed that those warnings are starting to come true, especially in the Richmond district.<br /><br />\"Several contacts put investments on hold due to increased uncertainty,\" the report said. \"A military equipment manufacturer reported conditions being 'too chaotic' to make any decisions on future investments.\"<br /><br />In Atlanta, \"Contacts in lumber and wood products manufacturing experienced slowing demand amid ambiguity surrounding tariffs—one firm noted having 'zero faith in even a 6-month forecast,' and that the biggest hurdle to expansion and mergers and acquisitions was not knowing how trade policy will settle out.\"<br /><br />It was the same story all across the country, with people in the construction and real estate business in Minnesota telling the Fed: “New projects have dried up completely in the first quarter. ...Uncertainty and chaos at the federal level has frozen pretty much all activity.” Another said \"clients are hesitant to proceed with design until some sort of certainty and predictability comes back.”<br /></p>"
    ],
    "image_url": "https://www.investopedia.com/thmb/7McRBluuMgl1SSjfupDMHYQPzY4=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2210995126-6333440e8efd43cdaf5fa1e4d5f58671.jpg",
    "titles": [
      "Uncertainty About Tariffs Has Become 'Pervasive' In The Economy, Fed Finds"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.24,
      "recency": 0.943,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.458,
    "normalized_score": 7.8,
    "summary": "In April 2025, a Federal Reserve report, known as the Beige Book, highlighted widespread uncertainty among U.S. business and community leaders regarding tariffs, attributing this to President Donald Trump's unpredictable trade policies. This uncertainty has made it difficult for businesses to invest and plan for the future, with some preparing for price increases, layoffs, and putting investments on hold. The report, summarizing feedback from various sectors across the country, noted a significant increase in mentions of \"uncertainty\" and \"tariffs\" compared to previous months, indicating growi"
  },
  {
    "title": "Engineers print synthetic 'metamaterials' that are both strong and stretchy",
    "domain": "science",
    "location": "global",
    "published": "Wed, 23 Apr 2025 11:21:35 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Engineers have fabricated a metamaterial that is not only strong but also stretchy. Their new method could enable stretchable ceramics, glass, and metals, for tear-proof textiles or stretchy semiconductors."
    ],
    "image_url": "",
    "titles": [
      "Engineers print synthetic 'metamaterials' that are both strong and stretchy"
    ],
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story highlights an innovation in the field of engineering. It provides empowering knowledge about the potential applications of this new technology.",
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.824,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.506,
    "normalized_score": 10.0,
    "summary": "Engineers developed a new metamaterial with both strength and elasticity, opening possibilities for creating stretchable ceramics, glass, metals, and tear-proof textiles. This advancement could also lead to the development of stretchable semiconductors, enhancing the durability and flexibility of materials in various applications."
  },
  {
    "title": "World on course to trigger multiple climate 'tipping points' unless action accelerates",
    "domain": "science",
    "location": "global",
    "published": "Wed, 23 Apr 2025 11:26:34 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Multiple climate 'tipping points' are likely to be triggered if global policies stay on their current course, new research shows."
    ],
    "image_url": "",
    "titles": [
      "World on course to trigger multiple climate 'tipping points' unless action accelerates"
    ],
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides valuable information about the urgency of climate action. It increases awareness about the potential catastrophic impacts of climate change.",
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.825,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.496,
    "normalized_score": 9.54,
    "summary": "New research indicates that if global policies do not change, several climate 'tipping points' are likely to be reached. These tipping points represent critical thresholds that, once crossed, could lead to significant and potentially irreversible changes in the climate system."
  },
  {
    "title": "Can climate science attribute economic damage to major polluters?",
    "domain": "science",
    "location": "global",
    "published": "Wed, 23 Apr 2025 20:00:18 +0100",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Climate researchers argue their science has advanced enough to directly link emissions from particular companies to damages from specific extreme weather events"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/04/23192642/sei248428083.jpg",
    "titles": [
      "Can climate science attribute economic damage to major polluters?"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.93,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.443,
    "normalized_score": 7.11,
    "summary": "Climate researchers have developed their science to the point where they can now directly associate emissions from specific companies with damages caused by certain extreme weather events. This advancement allows for a more precise understanding of the impact of individual corporate activities on climate-related disasters."
  },
  {
    "title": "First evidence of gladiator fight with lion seen in Roman-era skeleton",
    "domain": "science",
    "location": "global",
    "published": "Wed, 23 Apr 2025 20:00:30 +0100",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A man who lived in Roman-occupied Britain was bitten by a big cat, probably in a gladiator arena, an analysis of his remains has revealed"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/04/23104753/SEI_248513444.jpg",
    "titles": [
      "First evidence of gladiator fight with lion seen in Roman-era skeleton"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.93,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.443,
    "normalized_score": 7.11,
    "summary": "An analysis of remains has shown that a man from Roman-occupied Britain was likely bitten by a large cat, possibly during a gladiator event. This conclusion is based on the examination of his injuries."
  },
  {
    "title": "Lyme disease treated with antibiotic that doesn't harm gut microbiome",
    "domain": "science",
    "location": "global",
    "published": "Wed, 23 Apr 2025 20:00:14 +0100",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Mice overcame a Lyme disease infection after being given an antibiotic that is often used for pneumonia, and its effect on their gut microbiomes was negligible"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/04/23144143/SEI_2485343251.jpg",
    "titles": [
      "Lyme disease treated with antibiotic that doesn't harm gut microbiome"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.93,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.443,
    "normalized_score": 7.11,
    "summary": "Mice infected with Lyme disease were successfully treated with an antibiotic commonly used for pneumonia, showing minimal impact on their gut microbiomes. This indicates the antibiotic's effectiveness against Lyme disease with little to no adverse effects on the gut's microbial balance."
  },
  {
    "title": "Trump attacks Ukraine for not recognising Russian occupation of Crimea",
    "domain": "business",
    "location": "global",
    "published": "Wed, 23 Apr 2025 22:47:11 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "US president says Kyiv’s position is ‘very harmful to the peace negotiations with Russia’"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F503e3ff1-d3c0-4b5d-86bf-2a5182363fed.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Trump attacks Ukraine for not recognising Russian occupation of Crimea"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.26,
      "recency": 0.983,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.474,
    "normalized_score": 8.53,
    "summary": "The US President has labeled Kyiv's stance as significantly detrimental to the ongoing peace negotiations with Russia. This statement highlights concerns about the potential impact of Ukraine's position on the efforts to resolve the conflict."
  },
  {
    "title": "S&P 500 Gains and Losses Today: Tech Stocks Jump as Trump Softens Stance on Fed and Trade",
    "domain": "business",
    "location": "global",
    "published": "Wed, 23 Apr 2025 20:58:18 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "<figure><img alt=\"Michael Nagle / Bloomberg via Getty Images\" src=\"https://www.investopedia.com/thmb/RkuFLvD2YA7_tgmXrGHT-oLNzq8=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2211015975-632b5997db41423b8c8f113022742431.jpg\" title=\"The floor at the New York Stock Exchange (NYSE) in New York, US, on Wednesday, April 23, 2025.\" /><figcaption><i><p>Michael Nagle / Bloomberg via Getty Images</p></i></figcaption></figure><br /><h3>Key Takeaways</h3><ul><li>The S&amp;P 500 advanced 1.7% on Wednesday, April 23, as comments from the White House pointed to stability at the Fed and the possibility of easing trade tensions.</li><li>Antenna and high-speed cable manufacturer Amphenol reported strong quarterly results, and its shares pushed higher.<br /></li><li>Enphase Energy shares dropped after the solar technology firm missed quarterly estimates and indicated that tariffs could weigh on its upcoming performance.<br /></li></ul><br /><br /><p>Major U.S. equities indexes pushed higher after President Trump indicated that he <a href=\"https://www.investopedia.com/trump-says-he-has-no-intention-of-firing-fed-chair-powell-despite-criticism-11720202\">does not intend to fire Jerome Powell</a> from his role as Federal Reserve chair. White House officials also indicated that the U.S. could adopt a more measured approach to <a href=\"https://www.investopedia.com/trump-s-top-economic-advisor-sees-de-escalation-of-unsustainable-china-trade-war-11719849\">tariffs on imports from China</a>, suggesting a potential easing of trade tensions between the world's two largest economies.</p><p>The S&amp;P 500 added 1.7% in the midweek trading session, while the Dow closed 1.1% higher. The tech-heavy Nasdaq soared 2.5%. </p><p>Amphenol (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;aph\">APH</a>), a manufacturer of antennas and high-speed electronic cables, <a href=\"https://www.investopedia.com/high-speed-cable-maker-amphenol-stock-soars-on-strong-results-rosy-outlook-11720396\">topped revenue and adjusted earnings per share (EPS) estimates</a> in its first-quarter earnings report. The company also provided an upbeat forecast for the current quarter, noting opportunities across end markets and highlighting how innovation and strategic acquisitions have helped expand its product offering. Amphenol shares surged 8.2% to secure the top performance in the S&amp;P 500 on Wednesday.</p><p>The technology sector outperformed on Wednesday, bolstered by increased optimism for improvements in the U.S.-China trade relationship. Super Micro Computer (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;smci\">SMCI</a>) announced an expansion of its collaboration with Japanese tech firm Fujitsu, which will deploy a new Supermicro server as part of its large language model (LLM) project. Supermicro shares jumped 7.6%.</p><p>Meanwhile, Palantir Technologies (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;pltr\">PLTR</a>) shares gained 7.3%. The data analytics software firm said it will partner with defense contractor Northrop Grumman (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;noc\">NOC</a>) to develop combat vehicles that leverage artificial intelligence (AI) technology. Northrop Grumman shares edged 1.9% higher on Wednesday, marking a minor recovery from the heavy decline posted in the prior session following a lackluster earnings report.</p><p>Shares of solar technology firm Enphase Energy (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;enph\">ENPH</a>) plunged 15.7%, losing the most of any S&amp;P 500 stock. The company posted <a href=\"https://www.investopedia.com/enphase-energy-stock-sinks-on-weaker-than-expected-results-expected-tariffs-hit-11720283\">lower-than-expected sales and profits</a> for the first quarter, and Enphase's CEO noted that tariffs could weigh on future results. In particular, the company sources battery cell packs from China and anticipates that levies on these imports will pressure its gross margins in upcoming quarters.</p><p>Although heating, ventilation, and air conditioning (HVAC) specialist Lennox International (<a class=\"pseudoStyle\" href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;lii\">LII</a>) topped quarterly sales and profit estimates, its full-year guidance fell short of consensus forecasts, and its shares fell 9.0%. The CEO stressed that Lennox is adapting to the challenging economic environment with pricing adjustments as it aims to maintain the stability of its supply chain.</p><p>Shares of oilfield services and energy technology firm Baker Hughes (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;bkr\">BKR</a>) sank 6.4% on Wednesday following a mixed quarterly earnings release. Although profits topped forecasts, revenues came in below expectations. The company faces an uncertain macroeconomic backdrop and softness in oil prices that could hinder its clients' production activities.<br /></p>"
    ],
    "image_url": "https://www.investopedia.com/thmb/RkuFLvD2YA7_tgmXrGHT-oLNzq8=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2211015975-632b5997db41423b8c8f113022742431.jpg",
    "titles": [
      "S&P 500 Gains and Losses Today: Tech Stocks Jump as Trump Softens Stance on Fed and Trade"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.24,
      "recency": 0.958,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.462,
    "normalized_score": 7.98,
    "summary": "On April 23, 2025, the S&P 500 rose 1.7% following statements from the White House indicating stability at the Federal Reserve and potential easing of U.S.-China trade tensions. Amphenol's strong quarterly results led its shares to jump 8.2%, marking the top performance in the S&P 500 for the day. In contrast, Enphase Energy's shares fell 15.7% due to lower-than-expected sales and profits, along with concerns over future tariffs affecting its gross margins. The technology sector saw significant gains, with optimism around U.S.-China trade relations contributing to the positive movement. Other "
  },
  {
    "title": "Trump to exempt carmakers from some US tariffs",
    "domain": "business",
    "location": "global",
    "published": "Wed, 23 Apr 2025 20:55:42 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "President’s latest retreat follows intense lobbying by industry executives"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Fc1f969da-0fbe-425b-90b0-cff2801a294f.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Trump to exempt carmakers from some US tariffs"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.24,
      "recency": 0.957,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.461,
    "normalized_score": 7.94,
    "summary": "Following intense lobbying efforts from industry executives, the President has decided to retreat from a previously announced policy decision. This marks a significant change in direction for the administration, influenced directly by the business sector's input."
  },
  {
    "title": "Bessent warns mutual de-escalation required in US-China trade war",
    "domain": "business",
    "location": "global",
    "published": "Wed, 23 Apr 2025 22:30:47 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Treasury secretary denies reports Washington will make unilateral cuts to tariffs"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Fb576f70f-8a32-469c-aaf5-f9299767c543.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Bessent warns mutual de-escalation required in US-China trade war"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.22,
      "recency": 0.979,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.461,
    "normalized_score": 7.94,
    "summary": "The Treasury Secretary has officially denied reports claiming that Washington plans to unilaterally reduce tariffs. This statement clarifies the current stance of the U.S. government regarding tariff policy, indicating no such cuts will be made independently."
  },
  {
    "title": "Uncertainty About Tariffs Has Become 'Pervasive' In The Economy, Fed Finds",
    "domain": "business",
    "location": "global",
    "published": "Wed, 23 Apr 2025 19:56:12 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "<figure><img alt=\"Saul Loeb / AFP via Getty Images\" src=\"https://www.investopedia.com/thmb/7McRBluuMgl1SSjfupDMHYQPzY4=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2210995126-6333440e8efd43cdaf5fa1e4d5f58671.jpg\" title=\"US President Donald Trump speaks with reporters outside the White House in Washington, DC, on April 23, 2025.\" /><figcaption><i><p>Saul Loeb / AFP via Getty Images</p></i></figcaption></figure><br /><h3>Key Takeaways</h3><ul><li>Uncertainty about tariffs became \"pervasive\" among business and community leaders around the country in April, according to a report by the Federal Reserve.<br /></li><li>Business leaders said uncertainty is making it hard to invest and plan for the future.<br /></li><li>The report highlighted the \"on the ground\" consequences of President Donald Trump's rapidly shifting trade war.<br /></li></ul><br /><br /><p>Everyone is talking about tariffs, and no one quite knows what to make of them.<br /><br />That's according to the Federal Reserve's \"<a class=\"recommendation-inline-link\" href=\"https://www.investopedia.com/terms/b/beigebook.asp\">Beige Book</a>\" published Wednesday. The report showed that among business and community leaders around the country, uncertainty about tariffs intensified in April as President Donald Trump <a href=\"https://www.investopedia.com/trump-s-tariffs-could-be-at-their-peak-but-there-are-some-caveats-11720442\">steered his trade war in unpredictable directions</a>. Some businesses braced for price increases from the import taxes, some prepared for layoffs, and some found themselves unable to make plans.<span class=\"ql-inline-citation\"></span><br /><br />The Beige Book, a compilation of reports from business, nonprofit, and community leaders in local Fed districts around the country, gave a snapshot of how Trump's trade policies are affecting Main Street.<br /><br />\"Economic activity was little changed since the previous report, but uncertainty around international trade policy was pervasive across reports,\" Fed economists wrote.<br /><br />April's report showed worries about tariffs have ramped up from an already high level in March. The reports mentioned \"uncertainty\" or a variation 89 times in April, up from 47 in March. \"Tariffs\" came up 107 times, up from 49. By contrast, in April 2024, when tariffs were just a gleam in then-candidate Trump's eye, \"uncertainty\" came up 13 times and tariffs not at all.<br /><br />Experts have long warned that Trump's on-again, off-again campaign of imposing import taxes could <a href=\"https://www.investopedia.com/why-uncertainty-corrodes-the-economy-11698581\">stifle the economy</a> by forcing businesses to delay making investments, and the report showed that those warnings are starting to come true, especially in the Richmond district.<br /><br />\"Several contacts put investments on hold due to increased uncertainty,\" the report said. \"A military equipment manufacturer reported conditions being 'too chaotic' to make any decisions on future investments.\"<br /><br />In Atlanta, \"Contacts in lumber and wood products manufacturing experienced slowing demand amid ambiguity surrounding tariffs—one firm noted having 'zero faith in even a 6-month forecast,' and that the biggest hurdle to expansion and mergers and acquisitions was not knowing how trade policy will settle out.\"<br /><br />It was the same story all across the country, with people in the construction and real estate business in Minnesota telling the Fed: “New projects have dried up completely in the first quarter. ...Uncertainty and chaos at the federal level has frozen pretty much all activity.” Another said \"clients are hesitant to proceed with design until some sort of certainty and predictability comes back.”<br /></p>"
    ],
    "image_url": "https://www.investopedia.com/thmb/7McRBluuMgl1SSjfupDMHYQPzY4=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2210995126-6333440e8efd43cdaf5fa1e4d5f58671.jpg",
    "titles": [
      "Uncertainty About Tariffs Has Become 'Pervasive' In The Economy, Fed Finds"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.24,
      "recency": 0.943,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.458,
    "normalized_score": 7.8,
    "summary": "In April 2025, a Federal Reserve report, known as the Beige Book, highlighted widespread uncertainty among U.S. business and community leaders regarding tariffs, attributing this to President Donald Trump's unpredictable trade policies. This uncertainty has made it difficult for businesses to invest and plan for the future, with some preparing for price increases, layoffs, and putting investments on hold. The report, summarizing feedback from various sectors across the country, noted a significant increase in mentions of \"uncertainty\" and \"tariffs\" compared to previous months, indicating growi"
  },
  {
    "title": "What will the IMF and World Bank do in the latest economic crisis?",
    "domain": "general",
    "location": "global",
    "published": "Wed, 23 Apr 2025 21:55:06 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Global financial institutions meet as turmoil brings fears worldwide."
    ],
    "image_url": "",
    "titles": [
      "What will the IMF and World Bank do in the latest economic crisis?"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.3,
      "recency": 0.971,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.483,
    "normalized_score": 8.94,
    "summary": "Global financial institutions convened amid global fears of financial instability. The meeting aimed to address and mitigate widespread concerns over potential economic turmoil. The current status or outcomes of these discussions have not been specified, indicating ongoing efforts to manage the situation."
  },
  {
    "title": "Trump criticises Zelensky as Ukraine refuses Russian control of Crimea",
    "domain": "general",
    "location": "global",
    "published": "Wed, 23 Apr 2025 23:38:09 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Ukrainian president has consistently rejected the suggestion that his country give up its claim to the Crimean Peninsula."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/5106/live/31183d90-209a-11f0-9c65-a5c3dc449bf3.jpg",
    "titles": [
      "Trump criticises Zelensky as Ukraine refuses Russian control of Crimea"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.26,
      "recency": 0.995,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.477,
    "normalized_score": 8.67,
    "summary": "The Ukrainian president has firmly maintained Ukraine's stance on not relinquishing its claim to the Crimean Peninsula, consistently rejecting any suggestions to do so. This position underscores Ukraine's commitment to its territorial integrity and sovereignty over Crimea."
  },
  {
    "title": "Nine killed in Russian attack on Ukraine bus",
    "domain": "general",
    "location": "global",
    "published": "Wed, 23 Apr 2025 12:30:49 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "At least 30 were injured in the city of Marhanets in central-south Ukraine."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/338a/live/82309870-200a-11f0-b39a-65fa3ab53b91.jpg",
    "titles": [
      "Nine killed in Russian attack on Ukraine bus"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.34,
      "recency": 0.84,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.462,
    "normalized_score": 7.98,
    "summary": "At least 30 people were injured in Marhanets, a city in central-south Ukraine. The current status of those injured or the cause of the incident has not been specified in the provided information."
  },
  {
    "title": "Air pollution still plagues nearly half of Americans. That does a number on our health",
    "domain": "general",
    "location": "national",
    "published": "Wed, 23 Apr 2025 17:56:11 -0400",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Despite improvements in air quality in past decades, 156 million Americans still breathe in too much soot or ozone, says the annual State of the Air report from the American Lung Association."
    ],
    "image_url": "",
    "titles": [
      "Air pollution still plagues nearly half of Americans. That does a number on our health"
    ],
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The story provides useful information about the prevalence of air pollution and its health impacts. It helps raise awareness about an important environmental and public health issue.",
    "score_components": {
      "magnitude": 0.22,
      "recency": 0.971,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.459,
    "normalized_score": 7.84,
    "summary": "The American Lung Association's annual State of the Air report highlights that, despite decades of air quality improvements, 156 million Americans are exposed to unhealthy levels of soot or ozone."
  },
  {
    "title": "Five cards China holds in a trade war with the US",
    "domain": "general",
    "location": "global",
    "published": "Wed, 23 Apr 2025 21:50:09 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "From rare earths to billions in US debt, here's what China has in its arsenal - and how strong they are."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/f017/live/1a4c4200-1f2d-11f0-9612-0d839e1e9bdc.jpg",
    "titles": [
      "Five cards China holds in a trade war with the US"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.22,
      "recency": 0.97,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.459,
    "normalized_score": 7.84,
    "summary": "China possesses significant assets that bolster its global position, including extensive reserves of rare earth metals crucial for technology and manufacturing, as well as holding a substantial portion of US debt, amounting to billions of dollars. These assets are key elements of China's economic and strategic strength on the international stage."
  },
  {
    "title": "Engineers print synthetic 'metamaterials' that are both strong and stretchy",
    "domain": "science",
    "location": "global",
    "published": "Wed, 23 Apr 2025 11:21:35 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Engineers have fabricated a metamaterial that is not only strong but also stretchy. Their new method could enable stretchable ceramics, glass, and metals, for tear-proof textiles or stretchy semiconductors."
    ],
    "image_url": "",
    "titles": [
      "Engineers print synthetic 'metamaterials' that are both strong and stretchy"
    ],
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story highlights an innovation in the field of engineering. It provides empowering knowledge about the potential applications of this new technology.",
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.824,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.506,
    "normalized_score": 10.0,
    "summary": "Engineers developed a new metamaterial with both strength and elasticity, opening possibilities for creating stretchable ceramics, glass, metals, and tear-proof textiles. This advancement could also lead to the development of stretchable semiconductors, enhancing the durability and flexibility of materials in various applications."
  },
  {
    "title": "World on course to trigger multiple climate 'tipping points' unless action accelerates",
    "domain": "science",
    "location": "global",
    "published": "Wed, 23 Apr 2025 11:26:34 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Multiple climate 'tipping points' are likely to be triggered if global policies stay on their current course, new research shows."
    ],
    "image_url": "",
    "titles": [
      "World on course to trigger multiple climate 'tipping points' unless action accelerates"
    ],
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides valuable information about the urgency of climate action. It increases awareness about the potential catastrophic impacts of climate change.",
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.825,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.496,
    "normalized_score": 9.54,
    "summary": "New research indicates that if global policies do not change, several climate 'tipping points' are likely to be reached. These tipping points represent critical thresholds that, once crossed, could lead to significant and potentially irreversible changes in the climate system."
  },
  {
    "title": "Can climate science attribute economic damage to major polluters?",
    "domain": "science",
    "location": "global",
    "published": "Wed, 23 Apr 2025 20:00:18 +0100",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Climate researchers argue their science has advanced enough to directly link emissions from particular companies to damages from specific extreme weather events"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/04/23192642/sei248428083.jpg",
    "titles": [
      "Can climate science attribute economic damage to major polluters?"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.93,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.443,
    "normalized_score": 7.11,
    "summary": "Climate researchers have developed their science to the point where they can now directly associate emissions from specific companies with damages caused by certain extreme weather events. This advancement allows for a more precise understanding of the impact of individual corporate activities on climate-related disasters."
  },
  {
    "title": "First evidence of gladiator fight with lion seen in Roman-era skeleton",
    "domain": "science",
    "location": "global",
    "published": "Wed, 23 Apr 2025 20:00:30 +0100",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A man who lived in Roman-occupied Britain was bitten by a big cat, probably in a gladiator arena, an analysis of his remains has revealed"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/04/23104753/SEI_248513444.jpg",
    "titles": [
      "First evidence of gladiator fight with lion seen in Roman-era skeleton"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.93,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.443,
    "normalized_score": 7.11,
    "summary": "An analysis of remains has shown that a man from Roman-occupied Britain was likely bitten by a large cat, possibly during a gladiator event. This conclusion is based on the examination of his injuries."
  },
  {
    "title": "Lyme disease treated with antibiotic that doesn't harm gut microbiome",
    "domain": "science",
    "location": "global",
    "published": "Wed, 23 Apr 2025 20:00:14 +0100",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Mice overcame a Lyme disease infection after being given an antibiotic that is often used for pneumonia, and its effect on their gut microbiomes was negligible"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/04/23144143/SEI_2485343251.jpg",
    "titles": [
      "Lyme disease treated with antibiotic that doesn't harm gut microbiome"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.93,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.443,
    "normalized_score": 7.11,
    "summary": "Mice infected with Lyme disease were successfully treated with an antibiotic commonly used for pneumonia, showing minimal impact on their gut microbiomes. This indicates the antibiotic's effectiveness against Lyme disease with little to no adverse effects on the gut's microbial balance."
  },
  {
    "title": "Lions Lock in Kerby Joseph with Record-Breaking $86M Deal",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 23 Apr 2025 23:44:37 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Kerby Joseph is staying in Detroit and currently is holding the title of highest paid safety in the league"
    ],
    "image_url": "",
    "titles": [
      "Lions Lock in Kerby Joseph with Record-Breaking $86M Deal"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.996,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.379,
    "normalized_score": 4.17,
    "summary": "Kerby Joseph has secured his position with the Detroit Lions, becoming the highest-paid safety in the NFL. This development confirms his value to the team and sets a new benchmark for player compensation in his position."
  },
  {
    "title": "Deep, talented South Aiken boys' tennis team poised for playoff run",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 23 Apr 2025 23:47:00 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Apr. 23—Senior Night had a celebratory feel to it Tuesday for the South Aiken boys' tennis team, as six of the team's 12 players were honored for their contributions to the program ahead of their upcoming graduation. The T-Breds are hopeful that celebration was the first of many. The Class AAAA playoffs start next week, and South Aiken will be one of the favorites to bring home a state title. ..."
    ],
    "image_url": "",
    "titles": [
      "Deep, talented South Aiken boys' tennis team poised for playoff run"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.12,
      "recency": 0.997,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.355,
    "normalized_score": 3.07,
    "summary": "On April 23, the South Aiken boys' tennis team celebrated Senior Night, honoring six of its 12 players before their graduation. The event marked the beginning of a hopeful period for the team as they enter the Class AAAA playoffs next week. South Aiken is considered a favorite to win the state title, reflecting their strong performance and potential as the postseason approaches."
  },
  {
    "title": "Marcelo Mayer homers again, racks up sixth-straight multi-hit game",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 23 Apr 2025 23:46:09 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Mayer has hit four home runs and driven in 16 runs in his last six games."
    ],
    "image_url": "",
    "titles": [
      "Marcelo Mayer homers again, racks up sixth-straight multi-hit game"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.12,
      "recency": 0.996,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.355,
    "normalized_score": 3.07,
    "summary": "Mayer has achieved a significant milestone in baseball by hitting four home runs and driving in 16 runs over his last six games. This performance highlights his exceptional skill and contribution to his team's offense during this period."
  },
  {
    "title": "Out of nowhere on NFL draft eve a new favorite has emerged for Raiders top pick",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 23 Apr 2025 23:36:00 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A new first-round favorite could very well be emerging on NFL draft eve for the Raiders."
    ],
    "image_url": "",
    "titles": [
      "Out of nowhere on NFL draft eve a new favorite has emerged for Raiders top pick"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.12,
      "recency": 0.994,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.355,
    "normalized_score": 3.07,
    "summary": "On the eve of the NFL draft, there is growing speculation that the Raiders may have a new favorite for their first-round pick. However, the specific details about the potential pick or the reasons behind the emerging favorite are not provided in the available information."
  },
  {
    "title": "Gabriel Landeskog injury update: Latest news on Colorado Avalanche captain",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 23 Apr 2025 23:21:28 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Colorado Avalanche captain Gabriel Landeskog looks like he could be returning from a three-year injury absence Wednesday against the Dallas Stars."
    ],
    "image_url": "",
    "titles": [
      "Gabriel Landeskog injury update: Latest news on Colorado Avalanche captain"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.12,
      "recency": 0.991,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.354,
    "normalized_score": 3.03,
    "summary": "Colorado Avalanche captain Gabriel Landeskog is expected to return to the ice Wednesday against the Dallas Stars after being sidelined for three years due to an injury. This marks a significant comeback for the team's leader."
  }
]