[
  {
    "title": "Hundreds mourn Palestinian-American teen killed by Israeli forces",
    "domain": "general",
    "location": "global",
    "published": "Mon, 07 Apr 2025 20:44:30 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Footage shows the moment 14-year-old Palestinian teen Omar Mohammad Rabea was allegedly fatally shot by Israeli forces."
    ],
    "image_url": "",
    "summary": "Footage has been released showing the incident where 14-year-old Palestinian teen Omar Mohammad Rabea was allegedly shot and killed by Israeli forces. The video captures the moment leading up to his death.",
    "titles": [
      "Hundreds mourn Palestinian-American teen killed by Israeli forces"
    ],
    "score_components": {
      "magnitude": 0.32,
      "recency": 0.955,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.48475,
    "normalized_score": 10.0
  },
  {
    "title": "Trump threatens new 50% tariffs on China",
    "domain": "general",
    "location": "global",
    "published": "Mon, 07 Apr 2025 21:47:08 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The US president says he will introduce the additional tax unless Beijing withdraws its own 34% counter-tariff on American goods."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/29c1/live/1dc16be0-1406-11f0-ac9f-c37d6fd89579.jpg",
    "summary": "The US President announced plans to impose an additional tax on imports from China unless Beijing removes its 34% counter-tariff on American products. This move aims to address the ongoing trade tensions between the two countries.",
    "titles": [
      "Trump threatens new 50% tariffs on China"
    ],
    "score_components": {
      "magnitude": 0.26,
      "recency": 0.969,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.47024999999999995,
    "normalized_score": 9.36
  },
  {
    "title": "Targeted, killed, burned alive: Journalists in Gaza attacked by Israel",
    "domain": "general",
    "location": "global",
    "published": "Mon, 07 Apr 2025 15:37:38 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "In latest attack on reporters in Gaza, a journalist burns alive and others are wounded in strike on media tent."
    ],
    "image_url": "",
    "summary": "In a recent incident in Gaza, a journalist was killed by burning alive and several others were injured following a strike on a media tent. This attack is part of a series of assaults on reporters in the area.",
    "titles": [
      "Targeted, killed, burned alive: Journalists in Gaza attacked by Israel"
    ],
    "score_components": {
      "magnitude": 0.32,
      "recency": 0.884,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.46699999999999997,
    "normalized_score": 9.21
  },
  {
    "title": "Billionaire on trial in Azerbaijan who risks being left behind by peace deal",
    "domain": "general",
    "location": "global",
    "published": "Mon, 07 Apr 2025 23:48:01 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Ethnic Armenian Ruben Vardanyan's fortune is of little use now that he is facing a possible life term in jail."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/8071/live/7b430ba0-1151-11f0-87ca-a3e7c76bfb02.png",
    "summary": "Ruben Vardanyan, an ethnic Armenian, is currently facing the possibility of a life sentence in jail. Despite his significant wealth, Vardanyan's financial resources are unlikely to impact his legal situation.",
    "titles": [
      "Billionaire on trial in Azerbaijan who risks being left behind by peace deal"
    ],
    "score_components": {
      "magnitude": 0.22,
      "recency": 0.997,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.46525000000000005,
    "normalized_score": 9.13
  },
  {
    "title": "Ukrainians doubt potential of Trump’s peace plan amid deadly Russia attacks",
    "domain": "general",
    "location": "global",
    "published": "Mon, 07 Apr 2025 12:45:21 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Ukrainian servicemen and civilian survivors of deadly attacks say a ceasefire seems a distant prospect."
    ],
    "image_url": "",
    "summary": "Ukrainian servicemen and civilian survivors of recent deadly attacks express skepticism about the possibility of a ceasefire in the near future. Their experiences and observations suggest that any cessation of hostilities remains unlikely at this time.",
    "titles": [
      "Ukrainians doubt potential of Trump’s peace plan amid deadly Russia attacks"
    ],
    "score_components": {
      "magnitude": 0.34,
      "recency": 0.844,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.46299999999999997,
    "normalized_score": 9.03
  },
  {
    "title": "Canucks' Lankinen To Receive Special Budweiser Can To Celebrate Alex Ovechkin's Record-Setting Goal",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 07 Apr 2025 22:53:30 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Over the weekend, Alex Ovechkin became the NHL's all-time leader in goals. The Washington Capitals captain scored his 895th on Sunday against the New York Islanders, breaking Wayne Gretzky's record. Over his 20-year career, Ovechkin has scored on almost every goaltender he faced, except a select few, who are now being recognized."
    ],
    "image_url": "",
    "summary": "Alex Ovechkin, captain of the Washington Capitals, set a new NHL record by scoring his 895th goal on Sunday against the New York Islanders, surpassing Wayne Gretzky's previous record. Achieving this milestone over his 20-year career, Ovechkin has scored against nearly every goalie he has faced, highlighting his consistent performance across two decades. This achievement establishes Ovechkin as the NHL's all-time leading goal scorer.",
    "titles": [
      "Canucks' Lankinen To Receive Special Budweiser Can To Celebrate Alex Ovechkin's Record-Setting Goal"
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.984,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.376,
    "normalized_score": 5.17
  },
  {
    "title": "Jurić exits Southampton after PL relegation record",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 7 Apr 2025 19:18:52 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Southampton have sacked manager Ivan Jurić after the club's relegation from the Premier League, the club confirmed on Monday."
    ],
    "image_url": "",
    "summary": "Southampton FC announced on Monday that they have dismissed manager Ivan Jurić following the team's relegation from the Premier League.",
    "titles": [
      "Jurić exits Southampton after PL relegation record"
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.935,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.36375,
    "normalized_score": 4.62
  },
  {
    "title": "Kompany: Total 'faith' in Bayern amid injury crisis",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 7 Apr 2025 16:31:15 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Bayern Munich will be missing several key players in Tuesday's Champions League quarterfinal first leg clash at home to Inter Milan, but manager Vincent Kompany has complete faith in those that are available."
    ],
    "image_url": "",
    "summary": "Bayern Munich will face Inter Milan in the Champions League quarterfinal first leg without several key players. Despite these absences, manager Vincent Kompany has expressed full confidence in the available squad for the upcoming match at home.",
    "titles": [
      "Kompany: Total 'faith' in Bayern amid injury crisis"
    ],
    "score_components": {
      "magnitude": 0.22,
      "recency": 0.896,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.3600000000000001,
    "normalized_score": 4.46
  },
  {
    "title": "Cavaliers star Donovan Mitchell will miss Tuesday's game due to sprained left ankle",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 07 Apr 2025 23:19:12 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Donovan Mitchell will miss the Cleveland Cavaliers' game against the Chicago Bulls on Tuesday night after the all-star guard sprained his left ankle during the second half of Sunday's game against Sacramento.  Mitchell stepped on the foot of Sacramento’s Keon Ellis near midcourt before losing his balance and rolling his left ankle.  Mitchell eventually returned after missing nearly seven minutes of game action."
    ],
    "image_url": "",
    "summary": "Donovan Mitchell, an all-star guard for the Cleveland Cavaliers, will not play in Tuesday's game against the Chicago Bulls due to a left ankle sprain. He sustained the injury during Sunday's game against Sacramento after stepping on Keon Ellis's foot and rolling his ankle. Although Mitchell returned to the game after being sidelined for nearly seven minutes, the decision was made for him to miss the upcoming game for recovery.",
    "titles": [
      "Cavaliers star Donovan Mitchell will miss Tuesday's game due to sprained left ankle"
    ],
    "score_components": {
      "magnitude": 0.12,
      "recency": 0.99,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.35350000000000004,
    "normalized_score": 4.17
  },
  {
    "title": "Alabama basketball's Mo Dioubate is off to Kentucky: How did he do against the Wildcats?",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 07 Apr 2025 23:09:27 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Alabama basketball's second player to hit the transfer portal has exchanged the new blood for a blueblood. How has Mo Dioubate fared against Kentucky?"
    ],
    "image_url": "",
    "summary": "Mo Dioubate, a player from Alabama basketball, has entered the transfer portal and subsequently joined Kentucky, a team often referred to as a \"blueblood\" in college basketball due to its prestigious history. The move marks him as the second player from Alabama to transfer recently. Details on Dioubate's performance against Kentucky prior to the transfer were not provided.",
    "titles": [
      "Alabama basketball's Mo Dioubate is off to Kentucky: How did he do against the Wildcats?"
    ],
    "score_components": {
      "magnitude": 0.12,
      "recency": 0.988,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.353,
    "normalized_score": 4.14
  },
  {
    "title": "Trump threatens extra 50% tariff on China in day of wild market swings",
    "domain": "business",
    "location": "global",
    "published": "Mon, 07 Apr 2025 23:01:47 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "US president sticks with plan to ‘reset’ global trade but sends mixed signals about negotiations"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Ffbbfb992-63a0-4dc3-b246-1e29c3dec35f.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "summary": "The US President remains committed to a plan to 'reset' global trade, despite sending mixed signals regarding ongoing negotiations. This approach aims to reform international trade practices, although specific details about the negotiations and the mixed signals have not been disclosed.",
    "titles": [
      "Trump threatens extra 50% tariff on China in day of wild market swings"
    ],
    "score_components": {
      "magnitude": 0.26,
      "recency": 0.986,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.47450000000000003,
    "normalized_score": 9.54
  },
  {
    "title": "Trump says he is ‘not looking’ at a pause in tariffs to allow trade negotiations",
    "domain": "business",
    "location": "global",
    "published": "Mon, 07 Apr 2025 23:32:21 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Markets swing as Washington says it will kick off trade talks with Japan"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Fee54ac38-df7c-423f-86f8-7dd058a4e954.png?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "summary": "The U.S. government announced it will initiate trade discussions with Japan, leading to fluctuations in the market. This development marks a significant step in bilateral relations between the two nations, though specific details of the talks have not been disclosed. The announcement has impacted financial markets, indicating investor sensitivity to trade negotiations.",
    "titles": [
      "Trump says he is ‘not looking’ at a pause in tariffs to allow trade negotiations"
    ],
    "score_components": {
      "magnitude": 0.24,
      "recency": 0.993,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.47024999999999995,
    "normalized_score": 9.36
  },
  {
    "title": "Trump Tariff Uncertainty Could Make for a Bumpy Q1 Earnings Season",
    "domain": "business",
    "location": "global",
    "published": "Mon, 07 Apr 2025 20:13:30 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "<figure><img alt=\"Michael Nagle / Bloomberg via Getty Images\" src=\"https://www.investopedia.com/thmb/oqNFBguft5nyUofQh5M1aoXG-98=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2208451972-a1e95bd5bd09471eade522883a48fc6b.jpg\" title=\"raders work on the floor of the New York Stock Exchange.\" /><figcaption><i><p>Michael Nagle / Bloomberg via Getty Images</p></i></figcaption></figure><p>Tariff uncertainty continued to wreak havoc on global markets as businesses and investors braced for tariffs that are expected to lift the U.S. tariff rate to <a href=\"https://www.investopedia.com/trump-s-trade-policy-turns-back-the-clock-to-the-days-of-hawley-smoot-11708706\">its highest level in more than a century</a>. </p><p>That uncertainty is likely to remain high when S&amp;P 500 companies begin reporting first-quarter results later this week. Wall Street analysts have been increasingly <a href=\"https://www.investopedia.com/a-new-earnings-season-is-almost-here-analysts-are-growing-cautious-11709586\">cautious with their outlooks</a>, and some market watchers are forecasting a sharp drop in the number of companies issuing guidance for the current quarter and the remainder of the year. </p><p>The tariff outlook remained murky Monday, with U.S. stocks <a href=\"https://www.investopedia.com/dow-jones-today-04072025-11710097\">wavering between gains and losses</a> as Trump threatened to slap <a href=\"https://www.investopedia.com/trump-threatens-further-tariffs-on-china-discusses-japan-trade-talks-11710276\">an additional 50% tariff</a> on Chinese goods in response to <a href=\"https://www.investopedia.com/china-retaliates-with-34-percent-tariff-on-us-imports-11709024\">China's retaliatory tariffs</a>. The White House also today quashed rumors that Trump was mulling a 90-day pause on reciprocal tariffs.</p><p>The tariffs outlined by Trump last week could <a href=\"https://www.investopedia.com/china-retaliates-with-34-percent-tariff-on-us-imports-11709024\">scramble global supply chains</a>, <a href=\"https://www.investopedia.com/economists-see-greater-chance-of-recession-with-trump-tariffs-11710261\">raise the risk of a recession</a>, and stoke inflation. In a sign of the times, 421 sell-side broker reports published last week mentioned the word “chaos,” more than twice the prior week’s total, according to AlphaSense. In just the last two days, “chaos” has cropped up in more than 100 such reports.</p><p>Companies may choose caution as they report results; ones that have already offered first-quarter guidance have been <a href=\"https://www.investopedia.com/more-s-and-p-500-companies-are-giving-downbeat-outlooks-11706496\">increasingly wary</a>.</p><p>“We will see an upcoming earnings season for 1Q in which it would not surprise us if many companies/mgmt teams did not give guidance,” Wedbush analysts wrote last week.<span class=\"ql-inline-citation\"></span> They expect this coming earnings season to resemble early 2020 when uncertainty about the spread of Covid-19 and the longevity of lockdowns caused the number of S&amp;P 500 companies issuing guidance to plummet by more than 50% year-over-year, according to data from FactSet Research.</p><p>Market participants are already struggling to make sense of Trump’s tariffs and the impact they could have on their investments. Less guidance would likely reduce investors’ visibility even further, making it more difficult to model earnings growth and, thus, value debt and equity. </p><p>\"At a minimum, we will likely see companies give more conservative guidance or wider ranges than normal for guidance,\" said John Butters, Vice President and Senior Earnings Analyst at FactSet.</p><p>White House National Economic Council Director Kevin Hassett on Sunday said more than 50 countries had initiated talks with the administration, seeking relief from the tariffs set to take effect on Wednesday.<span class=\"ql-inline-citation\"></span> </p>"
    ],
    "image_url": "https://www.investopedia.com/thmb/oqNFBguft5nyUofQh5M1aoXG-98=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2208451972-a1e95bd5bd09471eade522883a48fc6b.jpg",
    "summary": "Tariff uncertainty is impacting global markets as the U.S. is expected to impose tariffs, potentially raising the tariff rate to its highest in over a century. This has led to a cautious outlook from Wall Street analysts ahead of S&P 500 companies reporting first-quarter results, with expectations of fewer companies issuing guidance due to the murky tariff situation. U.S. stocks showed instability as President Trump threatened additional tariffs on Chinese goods, countering China's retaliatory tariffs. Analysts predict a cautious approach in upcoming earnings reports, with many companies possi",
    "titles": [
      "Trump Tariff Uncertainty Could Make for a Bumpy Q1 Earnings Season"
    ],
    "score_components": {
      "magnitude": 0.26,
      "recency": 0.947,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.46475,
    "normalized_score": 9.11
  },
  {
    "title": "BoE asks banks whether clients have funding problems after Trump-induced market rout",
    "domain": "business",
    "location": "global",
    "published": "Mon, 07 Apr 2025 23:16:52 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Central bank’s Prudential Regulation Authority has so far found little sign of serious financial distress"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Fd2f17181-d33a-48d6-b52e-6b491292a9cf.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "summary": "The Prudential Regulation Authority, operated by the central bank, has conducted investigations and reported minimal evidence of significant financial distress. This indicates that, as of their latest assessment, the financial sector is relatively stable without major issues detected.",
    "titles": [
      "BoE asks banks whether clients have funding problems after Trump-induced market rout"
    ],
    "score_components": {
      "magnitude": 0.22,
      "recency": 0.99,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.4635,
    "normalized_score": 9.06
  },
  {
    "title": "Apple Plans To Ship More iPhones From India Amid Steep China Tariffs, Report Says",
    "domain": "business",
    "location": "global",
    "published": "Mon, 07 Apr 2025 21:23:00 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "<figure><img alt=\"CFOTO / Getty Images\" src=\"https://www.investopedia.com/thmb/od_FGA59_KgUG63OKa--Na5w00s=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2208409846-8e2bcd391e694d5cbc2c45315c286771.jpg\" title=\"Person interacts with iPhone display.\" /><figcaption><i><p>CFOTO / Getty Images</p></i></figcaption></figure><br /><h3>Key Takeaways</h3><ul><li>Apple intends to send more iPhones to the U.S. from India in response to high tariffs on goods from China, according to a <em>Wall Street Journal</em> report Monday.</li><li>The measure is thought to be temporary while the company tries to win a tariff exemption from the Trump administration.</li><li>Apple shares have lost about a fifth of their value since the Trump administration announced sweeping new tariffs last Wednesday.</li></ul><br /><br /><p>Apple (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;AAPL\">AAPL</a>) plans to send more iPhones to the U.S. from India in response to the Trump administration’s steep tariffs on goods from China, according to a <em>Wall Street Journal </em>report Monday.<span class=\"ql-inline-citation\"></span></p><p>The move is reportedly considered a short-term measure as Apple works to secure an exemption from the tariffs, like the one it received from the tariffs President Trump imposed during his first administration. </p><p>Apple did not immediately respond to a request for comment. </p><p>Trump announced a 34% tariff on goods from China <a href=\"https://www.investopedia.com/trump-imposes-sweeping-reciprocal-tariffs-11707935\">last week</a>, on top of a 20% import tax imposed earlier in the year. Tariffs on Chinese goods could also rise further, <a href=\"https://www.investopedia.com/trump-threatens-further-tariffs-on-china-discusses-japan-trade-talks-11710276\">Trump warned Monday</a>, if the administration responds to China’s decision Friday to institute a <a href=\"https://www.investopedia.com/china-retaliates-with-34-percent-tariff-on-us-imports-11709024\">34% tariff</a> on U.S. goods with a higher rate. Trump had announced a <a href=\"https://www.investopedia.com/how-much-reciprocal-tariff-will-be-for-each-country-trump-trade-11708072\">26% tariff</a> on goods from India, by comparison. </p><p>Apple manufactures 90% of its hardware in China, and the company would need to <a class=\"pseudoStyle\" href=\"https://www.investopedia.com/apple-leads-magnificent-7-stocks-lower-as-higher-than-expected-trump-tariffs-land-11708306\">raise prices</a> 6% in order to offset the impact of tariffs if it isn't granted an exemption, JPMorgan analysts said last week. Potentially helping Apple's case is an announcement in February that it plans to invest more than <a href=\"https://www.investopedia.com/apple-plans-investment-in-us-in-next-four-years-on-texas-ai-factory-11685001\">$500 billion</a> in the U.S. over the next four years, the analysts said.</p><p>Shares of the iPhone maker dropped close to 4% in Monday's session and have lost about a fifth of their value since the tariffs were announced last Wednesday through Monday’s close.<br /></p>"
    ],
    "image_url": "https://www.investopedia.com/thmb/od_FGA59_KgUG63OKa--Na5w00s=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2208409846-8e2bcd391e694d5cbc2c45315c286771.jpg",
    "summary": "Apple is increasing iPhone shipments from India to the U.S. as a response to the Trump administration's high tariffs on Chinese goods, aiming to mitigate costs while seeking a tariff exemption. This strategy follows a significant 34% tariff imposed by the U.S. on Chinese imports, exacerbating the financial strain on Apple, which produces most of its hardware in China. The company's stock has fallen approximately 20% since the announcement of the new tariffs. Apple's move to shift some production to India is seen as a temporary solution to avoid the tariff impact, which could necessitate a 6% p",
    "titles": [
      "Apple Plans To Ship More iPhones From India Amid Steep China Tariffs, Report Says"
    ],
    "score_components": {
      "magnitude": 0.24,
      "recency": 0.963,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.46275,
    "normalized_score": 9.02
  },
  {
    "title": "Experimental medication helps treat cocaine addiction",
    "domain": "science",
    "location": "global",
    "published": "Mon, 07 Apr 2025 20:30:08 +0100",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A recently developed medication encourages people with cocaine use disorder to reduce their intake of the stimulant – a step towards the first approved drugs to treat the problem"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/04/07172220/SEI_246656352.jpg",
    "summary": "A new medication designed to help individuals with cocaine use disorder has shown promise in encouraging them to lower their cocaine intake. This development represents progress towards potentially the first approved drugs aimed at treating this specific disorder.",
    "titles": [
      "Experimental medication helps treat cocaine addiction"
    ],
    "score_components": {
      "magnitude": 0.22,
      "recency": 0.937,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.45025000000000004,
    "normalized_score": 8.47
  },
  {
    "title": "No, the dire wolf has not been brought back from extinction",
    "domain": "science",
    "location": "global",
    "published": "Mon, 07 Apr 2025 20:45:32 +0100",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Colossal Biosciences claims three pups born recently are dire wolves, but they are actually grey wolves with genetic edits intended to make them resemble the lost species"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/04/07192142/sei246690536.jpg",
    "summary": "Colossal Biosciences recently announced the birth of three pups, initially claimed to be dire wolves. However, it was clarified that these are actually grey wolves genetically edited to mimic the extinct dire wolf species. The genetic modifications were intended to reproduce characteristics of the ancient animals, not to resurrect the species itself.",
    "titles": [
      "No, the dire wolf has not been brought back from extinction"
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.941,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.44525000000000003,
    "normalized_score": 8.24
  },
  {
    "title": "DOGE ditching tape storage could put data at risk, say experts",
    "domain": "science",
    "location": "global",
    "published": "Mon, 07 Apr 2025 18:49:22 +0100",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "President Trump's DOGE team, headed by Elon Musk, claims to have saved $1 million by ditching 70-year-old tape data storage. But experts say the move will likely end up costing more in the long term and could put data at risk"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/04/07173657/SEI_246690152.jpg",
    "summary": "President Trump's DOGE team, led by Elon Musk, announced they saved $1 million by replacing 70-year-old tape data storage. However, experts caution that this decision may lead to higher costs over time and potentially jeopardize data security.",
    "titles": [
      "DOGE ditching tape storage could put data at risk, say experts"
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.914,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.4385,
    "normalized_score": 7.94
  },
  {
    "title": "Saturn's moon Titan could harbor life, but only a tiny amount, study finds",
    "domain": "science",
    "location": "global",
    "published": "Mon, 07 Apr 2025 17:29:10 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Despite its uniquely rich inventory of organic molecules, Saturn's largest moon, Titan, may be able to support only a minuscule amount of biomass, if life exists on the moon, according to a study using bioenergetic modeling."
    ],
    "image_url": "",
    "summary": "A study utilizing bioenergetic modeling suggests that Titan, Saturn's largest moon, known for its diverse organic molecules, could potentially support a very small amount of biomass if life were to exist there. This finding highlights the challenges of sustaining life on Titan despite its rich organic inventory.",
    "titles": [
      "Saturn's moon Titan could harbor life, but only a tiny amount, study finds"
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.909,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.43725,
    "normalized_score": 7.89
  },
  {
    "title": "Bacteria-inspired robot uses 12 spinning flagella to roam underwater",
    "domain": "science",
    "location": "global",
    "published": "Mon, 07 Apr 2025 17:35:58 +0100",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "An underwater drone with long, spinning arms like the flagella of bacteria could survey the seas without endangering marine life, its creators claim"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/04/03155756/SEI_246037261.jpg",
    "summary": "Scientists have developed an underwater drone designed to resemble bacteria with long, spinning arms, aimed at conducting ocean surveys while minimizing harm to marine life. The creators assert that this innovative design allows for safer interactions with ocean ecosystems during research activities.",
    "titles": [
      "Bacteria-inspired robot uses 12 spinning flagella to roam underwater"
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.897,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.43425,
    "normalized_score": 7.76
  }
]