[
  {
    "title": "US Airstrikes Target Iran's Nuclear Sites, Escalate Regional Tensions",
    "domain": "general",
    "location": "global",
    "published": "Mon, 23 Jun 2025 16:00:55 GMT",
    "source": "BBC",
    "sources": [
      "Washington Post",
      "The Guardian",
      "Business Insider",
      "Investopedia",
      "LA Times",
      "Financial Times",
      "Fortune",
      "ABC News",
      "Axios",
      "Al Jazeera",
      "CityNews",
      "Bloomberg",
      "CBC News",
      "New York Times",
      "CNBC",
      "Global News",
      "Forbes",
      "Financial Post",
      "BBC"
    ],
    "domains": [
      "business",
      "general"
    ],
    "snippets": [
      "A steady stream of Iranians are crossing into Armenia by foot, laden with luggage and pets.",
      "The risk of a spiraling conflagration that pulls the U.S. in deeper flies in the face of Trump’s own rhetoric about righting the wrongs of an earlier era of U.S. overreach.",
      "President Donald Trump on Monday declared the “12 day war” between Israel and Iran as likely ending in a ceasefire, validating the strategic gamble of a devastating U.S. airstrike this weekend on three Iranian nuclear sites. “It has been fully agreed by and between Israel and Iran that there will be",
      "The ceasefire would start with Iran and then joined by Israel 12 hours later, with Trump saying the respective sides would “remain PEACEFUL and RESPECTFUL.”",
      "Oil extended a slump as US President Donald Trump announced a tentative ceasefire between Iran and Israel.",
      "Iran retaliates as US president hints at regime change",
      "<p>The US president has posted on social media that both Israel and Iran have agreed to a ‘Complete and Total CEASEFIRE’ that should begin in about six hours. Follow the day’s news live</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>",
      "24/7 coverage of breaking news and live events",
      "Iran and Israel have agreed to a ceasefire, President Trump announced on Truth Social, adding that it would go into effect Tuesday morning local time.",
      "Trump suggested there won't be any escalation in the military conflict between Tehran and Washington.",
      "<p>Trump announced a ceasefire on social media. The attack earlier Monday on Al Udeid Air Base in Qatar comes two days after the U.S. used 'bunker buster' bombs on Iranian nuclear sites.</p>",
      "Airlines diverted flights in the Middle East on Monday after Iran's armed forces said the country launched a missile strike on a U.S. military base in Qatar.",
      "<p>Foreign affairs minister Penny Wong said there had been ‘disruptions to flights with temporary airspace closures in the region’</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/jun/24/australia-news-live-albanese-iran-us-trump-nsw-qld-act-budget-economy-treasurer-labor-",
      "Thousands of passengers have faced disruption after airlines around the world canceled some flights to hubs like Dubai and Qatar.",
      "Qatar was the “obvious choice” for Iranian retaliation against the US, Al Jazeera’s Dorsa Jabbari explains.",
      "“Historical precedent of markets selling off initially, only to recover and make new highs, has led investors to be a bit more level-headed about their reaction,” says one analyst.",
      "<a href=\"https://news.google.com/rss/articles/CBMiekFVX3lxTE1NNXlGMTFpQzZpWE4tMl82em1Zc3lBOV9CODVyblRhQ1NHd0FDaEpTRlVVOGFwUWFDdWZnUlowZHNzb2hxemFEajAzb3VjeVV1OWxSUUZJXzBxeTFCU3V5OHI0c3JYQzZrTkV2U24zLU9XWFJRdVRmb1V3?oc=5\" target=\"_blank\">Live: Iran Launches Missiles Toward US Base in Qatar</a>&nbsp;&",
      "<a href=\"https://news.google.com/rss/articles/CBMingFBVV95cUxQdktTODVEc2g0MExxYlR0YVNlbXVTSEg0S0ZJTmlRbDBuRXJmME83NjYwT2ZyRUdhay1BbEtQNDdLeHBuSkktNUw4M2JVMU1pSFQ5bW9jZ2M3NWR5NVQyS2FXbnJ6bFVHMzVNNWx3THlpS1hBeW1SNllxVkVFZ2Q4aTJIT1A4ZVR1NWNYQWFhX0swenprQ0RSM1UxWmpTdw?oc=5\" target=\"_blank\">China Is More",
      "<a href=\"https://news.google.com/rss/articles/CBMibEFVX3lxTE9MU1hTT3ByYUxMaUJHZ3Zac3Zia1JBRjNNMmtWT1M4MUVCMnFhV0UyelJ3aDR2aU16dTVudVd6d1ViRjRGR1Vfb0FtLTJGNjRseUhXMGpQQmYwLUJTVjRaVExCbm1NLWpjclBZbQ?oc=5\" target=\"_blank\">The 2025 Climate Leaders to Watch</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Bloomberg.",
      "<a href=\"https://news.google.com/rss/articles/CBMijwFBVV95cUxOOUQtMVZ3aWRheURVQk1QX0plVndnQXV5V3M5dkQ3VEdmVUVHSHlxR0FPSlFCbHVVd3lvSmQ2MU1LbUQwcHpqZ0NHMml6a0NmX042LUMxRGtwd291TnAxallaME1rTkNfRVFsUW84YjRtVXZ3WE5kMnlwQXo1TklueVVSTVZoazJxb0lrMFZKUQ?oc=5\" target=\"_blank\">Malaysian Fryer Oil Arbitrage</a>",
      "<a href=\"https://news.google.com/rss/articles/CBMikwFBVV95cUxNcjk3c3dtTk15OUQ2RTlBRWljZms1eDhza3pXU05UN2EzMUhXNFhFc1BRVEYzdWF6bmx3aGRyTkc1MDBQVGJWNDZfamZrQ3BVQjJDX29tMUVtSlVLMW1mTk9YNTV6elE4Y1pCSWJGUGl1dmM5aXdnN0hpN0pwUlNRWFQzNDVEN1RJTGUxcTd0d0M4dUE?oc=5\" target=\"_blank\">Trump Doesn’t Always Chicken",
      "<a href=\"https://news.google.com/rss/articles/CBMinAFBVV95cUxPQ0hiVk1PVlFHUGdrN2RwSEFxR05ESmRxV1dYc3lPWkt0c3A5cnJMTUJIVWppTzgzM0NPbTM3ZmRrVDJoLU8xT052V0dGSk0zZHVNZkdoNjF3Y1NPRjl5UDMySWozeS1idThaM1FiU0p3S1ZzZHpNa2Y4QlFic2t4WnpyeExfcVVVSWNGeWs4WmxPeFFzR0tDZFR3cWY?oc=5\" target=\"_blank\">Musk Finally Lau",
      "Qatari officials said its air defenses had intercepted the missiles that were fired at Al Udeid Air Base.",
      "Plus, the 100 best movies of the 21st century.",
      "About 10,000 troops are stationed at the base, which serves as the regional headquarters for the U.S. Central Command.",
      "Israel’s military struck entrances to the detention facility in Tehran, where dissidents and political prisoners are held. Human rights groups say the prison is a symbol of repression.",
      "President Trump avoided asking Congress for permission before striking Iran, despite the Constitution saying only the legislature can declare war.",
      "<a href=\"https://news.google.com/rss/articles/CBMihwFBVV95cUxQdktuVDhIeTJjY2N4dkhja3F5ZFRnVG1xVjJWc2FXNzVsNUUzcWNZb1RKWnBESXB2OHlGVGpUZkxNRTZPYUR1eDRpWjNHR1M4YjdNTGNvZUd0OG1pRGZNQzQtcnhWMnlhN2x3eEhXUVVBZHNtZkZ0dXNEUVlzZDlUNHV3YjZ2czg?oc=5\" target=\"_blank\">Jeffries fumes at Trump for blindsiding Cong",
      "The latest survey, released June 23, found 41% approve of Trump's job performance.",
      "Most Trump voters contacted by ABC News support strikes on Iran and say they trust Trump to protect American interests while keeping the U.S. out of a prolonged conflict.",
      "See which sites the United States, Iran and Israel have hit in the escalating conflict.",
      "The State Department warned of the potential for demonstrations against Americans overseas because of U.S. intervention in the Israel-Iran conflict. What you need to know.",
      "Russia called the US strikes on Iran &#039;unjustified&#039; and &#039;unprovoked&#039;, while China warned they &#039;set a bad precedent&#039;.",
      "<p>Oil prices could rise if Iran goes ahead with threat to shut down shipping in the strait of Hormuz</p><p></p><p>US strikes on Iran could damage global economic growth, the head of the International Monetary Fund has warned.</p><p>Director Kristalina Georgieva told Bloomberg TV that the IMF was wa",
      "The rhetoric belies a more complicated reality, as Beijing has been one of Tehran’s biggest backers.",
      "European allies meeting in the Hague confront the prospect of another U.S.-led war. At the summit, some hope to press Trump against a wider escalation with Iran.",
      "Iran’s foreign minister is in Moscow seeking support, but other than condemning the attack, Putin has not made any major moves to back Iran.",
      "<p>Penny Wong refuses to say whether Pine Gap communications facility in NT was used in US bombing of three Iranian nuclear sites</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> ",
      "President Vladimir V. Putin met with Iran’s foreign minister on Monday, but did not explicitly call out Israel or the United States for their strikes on Russia’s longtime ally.",
      "NATO leaders gather Tuesday in The Hague for what could be a historic summit, or one marred by divisions.",
      "The attacks on Iran&#039;s nuclear enrichment facilities have not increased radioactivity so far.",
      "New satellite imagery reveals damage at three nuclear facilities in Iran after the US military bombed the sites early Sunday morning.",
      "In interviews, Trump supporters expressed a range of emotions — anger, wariness and avid support. But the dominant theme? Anxiety about what comes next.",
      "F.B.I. and D.H.S. officials cautioned state and local law enforcement of the possibility of threats to U.S. communities.",
      "Vice President JD Vance's remarks come after Defense Secretary Pete Hegseth said Iran's \"nuclear ambitions have been obliterated\" following Saturday's strikes.",
      "<p>Why does a country with large oil reserves feel such a need to have home-grown civil nuclear energy?</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/jun/23/israel-iran-war-live-updates-us-trump-regime-change-middle-east-gaza-latest-news\">Middle East crisis – live updates</a></p",
      "<p>Even if there is a regime change in Iran, no new government there will survive unless it sustains and perhaps surpasses the current leadership's belligerence.</p>",
      "Through revolution and upheaval, the program has become intertwined with the country’s security and national identity.",
      "President Trump said air strikes on Fordo and two other facilities at Natanz and Isfahan, \"completely obliterated\" Iran's major nuclear enrichment sites.",
      "The amount of damage the targeted sites of Iran's nuclear program sustained may be unclear, based on conflicting statements from officials and experts.",
      "Tehran says its nuclear technical know-how can&#039;t be destroyed.",
      "<a href=\"https://news.google.com/rss/articles/CBMiggFBVV95cUxOZVRxeGlXdHJDSXl5aXU1VjhfVEF2dmRYWXlGalVxR0pTVHZWWEplWGFZV1ZPMWJ5RTVHc3lGRjZUQ3pneFVSajNZWmtDY216MTY5cFVaNmVzSWdoS0FQbUdSTTNFeE90YUx0V3RqdUZnazgtR1FPbUZueU9GcGEzUzVn?oc=5\" target=\"_blank\">How past U.S. presidents have approached Iran's nuc",
      "<a href=\"https://news.google.com/rss/articles/CBMic0FVX3lxTFBGN2pLeEFCWHU3c1hQdG1yOTlzaXpyb1Z1Y3kyZlFDVUdYWEc1Q1NFOHNRdk5XaTc3M1lDUVB0WnZUd2o3c2xpbmFETTVSODc3MU1xTmw4YklkcFhMUDJOdXZKQlZqRG9zNFZIQnoyQjI0MlU?oc=5\" target=\"_blank\">MAGA unites around Trump over Iran strikes — for now</a>&nbsp;&nbsp;<fon",
      "<a href=\"https://news.google.com/rss/articles/CBMie0FVX3lxTE1zTEFvazFLblpzaENEZ3JNWU0xZGZ5VG9hal9GY00xNjluVnVpVmhPYXd1V1JfMWwzUGRGMks4RlB5bjI2YTdtQVI0OWJPaE5Fcm1sVkxpNm5tYkpHUzFleVJpeW5rMV9KbTNJNUVxbFlxWVd1N192emJFMA?oc=5\" target=\"_blank\">\"It was a headfake\": Inside Trump's secret orders to strike I",
      "<a href=\"https://news.google.com/rss/articles/CBMiggFBVV95cUxPcEE4WmduSW1hVUJoVV9JbnhtMV9SYXgzUk5VcWlFbDJ3c0RZUlM4ZU0xdGhrajNfQng3dGp5b2NGN29BMWQzMTBGWDNaa2VUdHAwYzdhcWl3aXVPRDEwZnBhNWtrWHl4V0pvak9tVXdDUERaT3c1b2hwZ1BuUE1ZR053?oc=5\" target=\"_blank\">MTG accuses Trump of \"bait and switch\" over Iran st",
      "White House press secretary Karoline Leavitt joins “GMA” to discuss the White House’s message following U.S. strikes targeting Iran’s nuclear program.",
      "The joint attacks against Iran aim to sow chaos and instability in order to secure regional domination.",
      "Here's what we know about 'bunker-busters,' the 30,000-pound bombs the US is using to strike nuclear sites in Iran.",
      "ABC News’ military analyst, former Marine Col. Steve Ganyard discusses the U.S. using \"bunker buster\" bombs for the first time on Iran and the damage they caused.",
      "Iran has enriched a large amount of uranium to 60% enrichment and possibly higher, so that only days are needed for producing bomb fuel. Iran has no civilian use for this, so its existence is rightly considered a true proliferation threat.",
      "Medvedev over the weekend warned “a number of countries are ready to directly supply Iran with their own nuclear warheads.”",
      "Trump's nuclear saber-rattling could suggest he feels emboldened after ordering the bomb attacks against Iranian nuclear sites.",
      "Israel also launched wide-ranging strikes on Tehran, a day after the United States attacked three Iranian nuclear sites.",
      "President Trump warned Iran against retaliation several times after the U.S. struck Tehran's nuclear facilities. On Monday, Tehran targeted a U.S. military base.",
      "From fighter jets and surface-to-air missile batteries to warships and aircraft carriers, the US military has a large Middle East presence.",
      "<a href=\"https://news.google.com/rss/articles/CBMidkFVX3lxTE5VWTZQZlBCLVR5Y1BlS0pHem91NUpaVjFqdkl1WG1zV0F1YlUzalRLN3ZmWlBwTkZEWjFOdTMwWnlPWDlfci1pV09kMDBnUzI3NWlkSmxNWmdMdVN3ZXBlWU5jWEdRM3dOV29uc05ub2x3aE9pMmc?oc=5\" target=\"_blank\">Trump calls for ending war after Iran's \"very weak\" retaliatory miss",
      "Tuesday&#039;s election has drawn nationwide attention for its close race and use of ranked choice voting.",
      "On \"Forbes Newsroom,\" Emerson College Polling senior director Matt Taglia discussed a recent poll about the NYC mayoral Democratic primary election.",
      "<p>An estimated 3 million rats live in New York City – so members of the ‘Rat Pack’ are working to ease human-rodent relations</p><p>I am standing near a tree bed in a bustling Brooklyn park, with only a few feet of dirt separating me from a “small” family of rats – that’s usually around eight of th",
      "<a href=\"https://news.google.com/rss/articles/CBMidkFVX3lxTFBES2RreWtON200V3dyck9sYnJTLXlsVFlyRks4ZDhLQnBmU2EwVmJtZGJsNUNYTTV5UFh6MDY1SGpuSW50bGJFUWJQX25fbUNWdU5zeDQxZ3U2bWtLOUZ4WmxlUVZTLWpFbnluSWM4djNsSjZJaHc?oc=5\" target=\"_blank\">U.S. braces for heightened threats in wake of Iran strikes</a>&nbsp;",
      "It remained to be seen whether the attack would ignite a regional war or provide the U.S. and Iran with an off-ramp from their intensifying confrontation.",
      "<p>Doha attack follows strikes between Israel and Iran as Donald Trump raises prospect of regime change in Tehran</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/jun/23/israel-iran-war-live-updates-us-trump-regime-change-middle-east-gaza-latest-news\">Middle East crisis: live updat",
      "Oil markets are reacting to the effect of a U.S. decision to directly enter the Iran-Israel conflict.",
      "Oil prices fell after Iran’s missile strike on a U.S. base, as markets interpreted the move as symbolic rather than escalatory—pricing in a pause, not a war.",
      "On today’s Big Take podcast: How a US oil boom upended global markets and reduced the market risk of war in the Middle East.",
      "Brent slides most in three years after attack by Tehran on US air base near Doha",
      "<img alt=\"An oil tanker in flat waters\" height=\"349\" src=\"https://i.cbc.ca/1.7568507.1750692210!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_620/oil-shipping-hormuz.JPG\" title=\"Oil tankers pass through the Strait of Hormuz, Dec. 21, 2018. REUTERS/Hamad I Mohammed/File Photo\" width=\"620\" /><p>",
      "It's a vital transport route for major Middle East oil and LNG producers",
      "About 20 million barrels of oil a day flow through the Strait of Hormuz, or the equivalent of 20% of global petroleum liquids consumption.",
      "Iranian officials have threatened to mine the waterway, which is a key shipping route for oil and gas.",
      "RBN Energy executive Rusty Braziel told CNBC's Jim Cramer on Monday that he doubts Iran will close off the Strait of Hormuz.",
      "<figure><img alt=\"Sudipta Das / NurPhoto / Getty Images Oil could climb above $100 a barrel if Iran closes the Strait of Hormuz, a key lane in the global oil trade.\" src=\"https://www.investopedia.com/thmb/6hA6aAT-eZjYwVefiyYkx-aHZis=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/Ge",
      "<a href=\"https://news.google.com/rss/articles/CBMib0FVX3lxTE11NldzRS1CR2dBVFFCdWo4bGxYWTJ6WGliUGQ0NURBNm15ZmczWnI5N3I0Y3FzQUhqcXV4WFE4N0RaNnVNN01yOXFhLUdDa1BWUENPY3c4RXJ3QmFVVXFRZS1mOWRVVzRsZ1JhckNSWQ?oc=5\" target=\"_blank\">Iran parliament reportedly backs closing Strait of Hormuz, which could spike ",
      "<p>UK foreign secretary wants Iran to return to negotiating table but refuses to endorse strikes by US and Israel</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/jun/23/israel-iran-war-live-updates-us-trump-regime-change-middle-east-gaza-latest-news\">Middle East crisis – live upda",
      "Iran's threat to block the world's most vital oil transit point has raised fears of major global economic consequences.",
      "Following days of tension in the wake of a U.S. attack on Iran's nuclear facilities, oil markets appear to have de-risked after Tehran's token retaliation.",
      "<p>Crude oil prices dropped by 7% on hopes that the conflict would not immediately disrupt region’s oil supplies</p><p>Oil prices dropped sharply after Iran’s retaliatory missile strike on a US airbase reduced concern that the country was poised to strain energy markets by closing off a vital trade ",
      "Military aircraft were pulled out of the base days ago. Qatar says it intercepted the missiles and that there were no casualties.",
      "Prior to attack on biggest US military base in Middle East, US had already started taking ‘force protection’ measures.",
      "Qatari base is Washington’s largest and arguably most important military outpost in the Middle East",
      "Iran&#039;s attack targeting the Al Udeid Air Base draws sharp rebukes from several states in the Gulf region.",
      "The Iranian military confirms it launched missiles in retaliation for American strikes against its nuclear sites.",
      "Iran says it has responded to the US attacks on its nuclear facilities by targeting the US military base in Qatar.",
      "<a href=\"https://news.google.com/rss/articles/CBMidEFVX3lxTE8wNjdNUlpiS1o3UFp3RVNQd1JxUUU5Znh2aHNWMWNPNGtCSkdaS3hmTU45SlhlNzRaOWpwbG90LUVlT18wZVlWT0hLLTZRNVp2aFNtand0VWJwSWVfdGVLcXh1c0RTZVFocXNNSjBiZk5JR3BH?oc=5\" target=\"_blank\">No casualties reported after Iran missile attack on U.S. base in Qatar<",
      "The Iranian attack on Al Udeid airbase caused no injuries, with Qatar saying missiles were intercepted.",
      "Iran fired missiles at a US base in Qatar, saying it was retaliation for recent US strikes on Iran&#039;s nuclear facilities.",
      "Service members, veterans and their families expressed differing views on the airstrikes but shared concern over the safety of American troops.",
      "The latest barrage hit a notorious prison in Iran and a building near a humanitarian aid facility.",
      "Experts looking at satellite images of Fordo, Isfahan and Natanz give a first damage assessment",
      "The last-minute demonstrations drew hundreds of people in some cities, fewer in others. Many expressed displeasure with the Iranian leadership but were against any more U.S. involvement in another war.",
      "Prime Minister Benjamin Netanyahu said the bombing campaign aimed to end the threats from Tehran’s nuclear program and ballistic missiles. He did not give a timetable for stopping the strikes.",
      "The Israeli prime minister had set in motion plans to attack Iran long before President Trump began efforts to resolve nuclear concerns through negotiations.",
      "The Pentagon said there were no reports of casualties after the strike on Al Udeid Air Base in Qatar, and President Trump said it was time for peace.",
      "The president’s assertion on social media came hours after an Iranian missile attack on the largest American military installation in the Middle East, and days after U.S. strikes on Iranian nuclear facilities.",
      "Trump addressed the nation on Saturday night after the U.S. carried out airstrikes on Iran's nuclear facility, which he called \"a spectacular military success.\"",
      "The European Union and Canada struck a defense agreement on Monday, a step toward closer military cooperation as relations with the United States have soured.",
      "<img alt=\"one woman and two men stand shaking hands in front of Canadian and EU flags\" height=\"349\" src=\"https://i.cbc.ca/ais/1d86cda2-3ce3-44da-bda3-788904638434,1750704831293/full/max/0/default.jpg?im=Crop%2Crect%3D%280%2C900%2C8640%2C4860%29%3BResize%3D%28620%29\" title=\"Canadian Prime Minister Ma",
      "BRUSSELS — Canada and the European Union opened a new era of transatlantic co-operation Monday by signing a security and defence partnership at a joint summit in Brussels. The agreement commits Canada and Europe to collaborating on defence and is a step toward Canada participating in the continent&#",
      "<p>Amid Trump’s disrespect of old allies, EU and Canada vow more support for Ukraine and joint work on climate crisis</p><p>Canada has signed a wide-ranging defence pact with the EU, as Donald Trump and global instability prompt traditional US allies to deepen their alliances.</p><p>Canadian prime m",
      "Iran launched missiles at al-Udeid Air Base Monday. Qatar said it intercepted the strike and the Pentagon said it was not aware of any U.S. casualties.",
      "<p>In a post on social media the US president claimed that the agreement had been made, hours after Iran launched an attack on a US base in Qatar</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/jun/23/iran-launches-missiles-at-us-base-in-qatar-in-retaliation-for-bombing-of-nuclear-site",
      "US president makes statement just hours after Tehran launched missiles at American base in Qatar",
      "US president outlines plans to end hostilities within hours",
      "Israel and Iran have agreed to a complete and total ceasefire, set to begin at about midnight, President Donald Trump announced social media.",
      "U.S. aircraft attacked three facilities in Iran related to the country's nuclear program on Saturday.",
      "<a href=\"https://news.google.com/rss/articles/CBMibEFVX3lxTE1aelNLUXpmTFFjVkRabzZDa1ZKX0t2aWRHNE42WnVJVm1uUDlwM3o0N2g1dW9HTGoyZ1dKbHNkSm4zbkp0UXRtX1AxZlB3bktuTkR1bXZjSXZlRl9sdVI1V2xJRHhSUi12ZHlfQQ?oc=5\" target=\"_blank\">Trump announces Iran-Israel ceasefire</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Axios<",
      "US president congratulates Iran and Israel on truce deal, but neither country has confirmed agreement to end war.",
      "Some lawmakers have called Trump's strikes on Iran \"unconstitutional\" - so did he have the authority to order them?",
      "Trump said the U.S. hit the Fordow, Natanz and Isfahan nuclear sites. Iran’s foreign minister called it a “dangerous military operation” against his country.",
      "<p>President on Truth Social says ceasefire will start in coming hours but no immediate response from Israel or Iran</p><p>Donald Trump has claimed that Israel and Iran have negotiated a ceasefire, halting a two-week-old war that has killed hundreds in tit-for-tat strikes by Israeli warplanes and Ir",
      "<a href=\"https://news.google.com/rss/articles/CBMidkFVX3lxTE5BWWhOa1oyTURGNnpWLXdWQlVid3h6NUpUbGhjQ1dWbmlPM2o0MVZKOGt4NzV0MHM4ejd2NDUwcDJNXzN6UEZWUXIwREt3VlNHYWhFYkxqSzBaeVJkY2MxMnNTVERteVdBRlJNOV9YcG5fZERwY1E?oc=5\" target=\"_blank\">Trump administration says U.S. does not seek regime change in Iran</",
      "The ruling overturns an order issued in May after the Trump administration tried to deport several migrants convicted of serious crimes to South Sudan.",
      "The divided court lifted for now a lower court order requiring migrants get a chance to challenge their deportations to countries other than their homeland.",
      "<p>The conservative majority set aside the rulings of a judge who said the detained men deserved a 'meaningful opportunity' to object to being sent to a strange country where they may be tortured or abused.</p>",
      "The ruling applies immediately to a group of men the government has sought to send to South Sudan.",
      "<p>Supreme court decision – in which three liberal justices dissented – represents significant win for president</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/2025/jun/23/supreme-court-trump-deportations\">US supreme court clears way for Trump to deport migrants to countries not their ow",
      "<p>Justices lift judicial order, handing victory to US president in his aggressive pursuit of mass deportations</p><p>The <a href=\"https://www.theguardian.com/us-news/us-supreme-court\">US supreme court</a> on Monday paved the way for the <a href=\"https://www.theguardian.com/us-news/trump-administrat",
      "Plaintiffs in the case want the right to challenge deportations to countries other than their own because of the risk of persecution, torture or death.",
      "<a href=\"https://news.google.com/rss/articles/CBMijwFBVV95cUxNVlRuWFYzd2V2WTFRalh1UlZ3d0t6VlM3LXNpOU9zTGN1NXhGZXcwYzc0QmktajJjeWhfQzBWMWhDeWZ0dzZFei0tSVA1dExoOExtNHJmR1c3ZUJESlJOaVdvbjFxSkJjQ2hnbU50c3p3dFVOZkVESDFPRVJLdmZEX2U3Xzd0VFFNZFhRSGNDMA?oc=5\" target=\"_blank\">Supreme Court allows Trump to res",
      "Dissenting justice warns court actions expose &#039;thousands to the risk of torture or death&#039;.",
      "<img alt=\"Demonstrators hold signs protesting against U.S. Immigration and Customs Enforcement.\" height=\"349\" src=\"https://i.cbc.ca/1.7559085.1750720259!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/ice-protest-new-york.jpg\" title=\"Demonstrators hold signs and chant during a protest agains",
      "The US bombing of Iran’s nuclear sites raises fears of wider regional war."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/fe31/live/c70d0390-5050-11f0-8c47-237c2e4015f5.jpg",
    "titles": [
      "Talk of regime change resonates with Iranians fleeing across border",
      "Trump bombs Iran, talks regime change, raises the ghosts of Iraq",
      "Trump says Iran and Israel to have a phased-in ceasefire over 24 hours",
      "Trump announces phased-in ceasefire between Iran and Israel",
      "Oil Extends Slump as Trump Announces Ceasefire in Middle East",
      "Americanswers... Has Trump triggered all out war in the Middle East?",
      "Australia news live: Albanese welcomes Trump’s announcement of ceasefire between Israel and Iran",
      "LIVE:  ABC News Live",
      "Trump says an Israel-Iran ceasefire is imminent, declaring an end to what he's calling the '12 Day War'",
      "Trump Says Israel And Iran Have Agreed To Ceasefire (Live Updates)",
      "Trump announces Israel-Iran ceasefire hours after Iran attacks largest U.S. base in Middle East",
      "Airlines divert, cancel more Middle East flights after Iran attacks U.S. military base",
      "Australian passenger disruption as airlines delay or cancel flights after Iran’s attack on US base in Qatar",
      "Qatar shut its airspace hours before Iran's attack",
      "Qatar says it has ‘right to respond’ to Iranian missile attack",
      "Markets edge higher Monday after Iran fires missiles at U.S. base in Qatar",
      "Live: Iran Launches Missiles Toward US Base in Qatar - Bloomberg.com",
      "China Is More Than Ready for US Stablecoins - Bloomberg.com",
      "The 2025 Climate Leaders to Watch - Bloomberg.com",
      "Malaysian Fryer Oil Arbitrage - Bloomberg.com",
      "Trump Doesn’t Always Chicken Out - Bloomberg.com",
      "Musk Finally Launched His Robotaxi — Kind Of - Bloomberg.com",
      "Iran attacked a U.S. base in Qatar that typically houses 10,000 troops.",
      "Tuesday Briefing: Iran Struck a U.S. Base in Qatar",
      "What to Know about Al Udeid Air Base in Qatar",
      "What to Know About Iran’s Notorious Evin Prison",
      "Is the U.S. at War With Iran? What to Know About Trump, Congress and War Powers",
      "Jeffries fumes at Trump for blindsiding Congress on Iran strikes - Axios",
      "Trump Rating Tracker: Approval Hits New Low Amid Iran Strikes",
      "Trump voters say Iran strikes don't conflict with his America First agenda",
      "Mapping strikes in the Israel-Iran conflict",
      "What to Know About U.S. Warning to Citizens Abroad Amid Israel-Iran Conflict",
      "US attacks on Iran risk global conflict, Russia and China warn",
      "US strikes on Iran could damage global growth, says IMF chief",
      "China Says the U.S. Damaged Its Own Credibility by Striking Iran",
      "U.S. strikes on Iran upstage NATO leaders summit tailored for Trump",
      "Russia condemns U.S. strikes on Iran but takes no concrete actions",
      "PM backs Iran strikes but says Australia is ‘deeply concerned about any escalation’",
      "Putin Condemns Strikes on Iran but Stops Short of Offering Concrete Support",
      "Trump’s budget demands, Iran to split NATO summit focus",
      "US, Israeli strikes on Iran nuclear sites: How big are radiation risks?",
      "Satellite images show damage at Iran's nuclear facilities after US strikes",
      "6 Trump Voters React to the U.S.’s Bombing of Nuclear Sites in Iran",
      "F.B.I. Warns of Possible Retaliation by Iran After Bombing of Nuclear Sites",
      "U.S. isn't at war with Iran, 'we're at war with Iran's nuclear program,' Vance says",
      "Why is Iran’s nuclear programme so essential to its identity?",
      "Contributor: Why 'bunker busters' won't end Iran's nuclear ambitions",
      "Iran’s Nuclear Dreams May Survive Even a Devastating American Blow",
      "U.S. intel found Iran did not move nuclear material from Fordo ahead of attack, Sen. Mullin says",
      "Is Iran's nuclear program 'obliterated'? What we know so far about the damage done",
      "Is dropping bombs the answer to Iran’s nuclear programme?",
      "How past U.S. presidents have approached Iran's nuclear program - Axios",
      "MAGA unites around Trump over Iran strikes — for now - Axios",
      "\"It was a headfake\": Inside Trump's secret orders to strike Iran - Axios",
      "MTG accuses Trump of \"bait and switch\" over Iran strikes - Axios",
      "WATCH:  Karoline Leavitt discusses US strikes on Iran",
      "What the US and Israel really want from Iran",
      "What are 'bunker buster' bombs, and how is the US using them against Iran?",
      "WATCH:  Analyzing ‘bunker buster’ bombs in combat",
      "Could Iran Really Make A Nuclear Weapon?",
      "Trump Slams Russian Official Who Floated Iran Getting Nuclear Weapon From Other Countries",
      "Trump slams Russia's Medvedev for claiming countries will give Iran nuclear warheads",
      "What to Know About the U.S. Strike on Iran, and Iran’s Retaliation",
      "Trump calls Iran's retaliation 'very weak,' doesn't say US will respond militarily",
      "Trump called Iran's retaliatory attack 'very weak.' Here's a look at US firepower in the region should it fight back.",
      "Trump calls for ending war after Iran's \"very weak\" retaliatory missile attack - Axios",
      "What to know about New York’s mayoral primary and ranked choice voting",
      "SHOCK POLL: Democratic Socialist Mamdani Beats Out Cuomo In Ranked Choice Voting In NYC Mayoral Race",
      "Know thine enemy: my ‘rat walk’ with New York’s rat czar made me rethink vermin",
      "U.S. braces for heightened threats in wake of Iran strikes - Axios",
      "Iran fires on U.S. air base as Israel broadens strikes on Tehran",
      "Iran launches missiles at US base in Qatar in retaliation for bombing of nuclear sites",
      "Oil prices fall 7% after Iran strike on U.S. base in Qatar leaves no reported casualties",
      "Why Oil Prices Fell After Iran's Missile Strike",
      "Why Fighting Between the US and Iran Hasn’t Sent Oil Prices Soaring",
      "Oil tumbles as traders bet on ‘major de-escalation’ between US and Iran",
      "What is the Strait of Hormuz and what could happen to oil prices if Iran shuts it down?",
      "What is the Strait of Hormuz and why is it so important for oil markets?",
      "The Strait of Hormuz is a critical choke point for global energy markets, but there are ways to get around it",
      "What Is the Strait of Hormuz and Why Is It Important?",
      "RBN Energy executive explains why Iran isn't likely to close the Strait of Hormuz",
      "What's the Chance that Oil Prices Top $100? And What Might Happen If They Did?",
      "Iran parliament reportedly backs closing Strait of Hormuz, which could spike oil prices - Axios",
      "Iranian closure of strait of Hormuz would be monumental act of self-harm, says Lammy",
      "What is the Strait of Hormuz and why does it matter?",
      "Oil Prices Slump 8% After Iran’s Muted Response To U.S. Attack",
      "Oil prices sink after Iranian strike on US airbase reduces fears of market disruption",
      "Iran says it fired on a US base. Qatar says air defenses shot down the missiles.",
      "What to know about the US’s Al Udeid Air Base in Qatar after Iran’s attack",
      "Al Udeid: Iran attacks nerve centre of US air power in Gulf",
      "What have countries said about Iran’s strike on a US base in Qatar?",
      "What we know about Iran's attack on US base in Qatar",
      "Iran attacks US air base in Qatar: What we know so far",
      "No casualties reported after Iran missile attack on U.S. base in Qatar - Axios",
      "Tehran attacks US base in Qatar, hours later Trump states Israel-Iran truce",
      "Iran attacks US military base in Qatar",
      "Around Military Bases in the U.S., Unease Over What Comes Next",
      "The Israeli military escalated attacks on Tehran.",
      "Experts break down satellite imagery of US attack on Iran",
      "Small Protests Against the U.S. Attack in Iran Sprouted Up Over the Weekend",
      "Netanyahu Says Israel Is ‘Very, Very Close’ to Achieving Its Goals in Iran War",
      "Netanyahu decided on Iran war last year, then sought to recruit Trump",
      "Trump Says ‘Time for Peace’ After Iran Gives Warning Before Firing on U.S. Base",
      "Live Updates: Trump Says Cease-Fire Is Imminent; No Word From Iran or Israel",
      "Trump admin live updates: Trump meets with national security team in Situation Room",
      "Canada and EU Sign Defense Agreement as Trump Promises to Reduce International Security",
      "Canada signs deal deepening European defence and security partnership",
      "Canada signs new security and defence partnership with Europe",
      "Canada and EU sign defence pact amid strained US relations and global instability",
      "Live updates: Trump says Iran and Israel have agreed to ceasefire",
      "Trump announces ‘complete and total ceasefire’ between Israel and Iran to start in coming hours – live updates",
      "Trump promises end to ‘12 day war’ between Israel and Iran",
      "Trump claims Israel and Iran have agreed ceasefire",
      "Israel and Iran agree to ceasefire to bring end to '12 DAY WAR,' Trump says",
      "Israel-Iran updates: Israel and Iran agree to ceasefire, Trump says",
      "Trump announces Iran-Israel ceasefire - Axios",
      "Trump claims ceasefire reached between Israel and Iran",
      "Did Trump have the legal authority to strike Iran?",
      "Officials assess damage from U.S. strikes; Trump raises possibility of regime change in Iran",
      "Trump says Israel and Iran have negotiated ‘complete’ ceasefire",
      "Trump administration says U.S. does not seek regime change in Iran - Axios",
      "Trump Administration Can Resume Deportations To Third Countries, Supreme Court Rules",
      "U.S. Supreme Court allows Trump to restart deportations to 3rd countries",
      "Supreme Court, ruling for Trump, says criminal migrants may be deported to South Sudan",
      "Supreme Court Lets Trump Deport Migrants to Countries to Which They Have No Connection",
      "US supreme court allows Trump officials to deport migrants to countries other than their own – live",
      "US supreme court clears way for Trump to deport migrants to countries not their own",
      "'Fire up the deportation planes': Trump official praises Supreme Court ruling",
      "Supreme Court allows Trump to restart deportations to non-origin countries - Axios",
      "Supreme Court lets Trump restart deporting migrants to ‘third countries’",
      "Trump administration can resume deporting migrants to 3rd countries, U.S. Supreme Court rules",
      "After Donald Trump bombs Iran, what comes next?"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.843,
      "consensus": 1.0,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.879,
    "summary": "The United States conducted airstrikes on three nuclear sites in Iran, marking a significant escalation in the conflict between Israel and Iran. The operation, named \"Operation Midnight Hammer,\" involved B-2 stealth bombers, fighter aircraft, and submarine-launched cruise missiles targeting the Fordo, Natanz, and Isfahan sites. The strikes have led to widespread reactions, including fear and anger within Iran, international calls for de-escalation, and varied responses from global leaders. Initial assessments suggest the attacks caused massive damage to Iran's nuclear capabilities. President D",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about a significant international event, offering readers some insight into the geopolitical situation. However, it does not suggest any solutions, improvements, or innovations, and it does not provide a comprehensive understanding of the causes or impacts of the situation."
  },
  {
    "title": "Manchester City Beats Al Ain 6-0, Advances to Club World Cup Last 16",
    "domain": "general",
    "location": "national",
    "published": "Mon, 23 Jun 2025 09:17:40 -0400",
    "source": "ABC News",
    "sources": [
      "Sky Sports",
      "NHL",
      "ESPN",
      "Sports Illustrated",
      "The Guardian",
      "ABC News",
      "Yahoo Sports",
      "Forbes",
      "Sportsnet",
      "CBS Sports"
    ],
    "domains": [
      "sports",
      "business",
      "general"
    ],
    "snippets": [
      "The Oklahoma City Thunder made history to become the 2025 champions, dominating the Indiana Pacers 103-91 in Game 7 of the NBA Finals.",
      "<p>With Oklahoma City&#8217;s championship season now cemented, here are some of the sports world&#8217;s best reactions to the Thunder finally hoisting the Larry O&#8217;Brien Trophy.</p>",
      "<a href=\"https://news.google.com/rss/articles/CBMigAFBVV95cUxPM1htamQtampfdld6QWVFckljS3pDbWdOa0NTZmVaTkVtcmFuNzM0VXdhVUU0ZlpNTWdCeEpLVWE1aEJ2VEowdnVoZ19OZWhESDBTUkZYdWhIRHJ1ZTNDRWk4X3hraGlMVjZ5ZnI1b3B6WldDQlp6ZVRZNGZQOXZjTQ?oc=5\" target=\"_blank\">How to Watch Oklahoma City Thunder NBA Finals Parade<",
      "<a href=\"https://news.google.com/rss/articles/CBMickFVX3lxTE5OUEV6N2doREtGOUItX3pkY09UTFRWVGdsZzlnZU5kSkM0REVRaDZDMWxqUUdVb0h2cGlqRmRVRkpqN2hpSEZSUTViT1E3RXVObWRvRlJndEVmSFZnT0t6S2FsbWxHa0ZuT3FtWTFOaVRqdw?oc=5\" target=\"_blank\">Jalen Williams Made Sure Thunder Staffers Got to Have Moment With Champio",
      "<a href=\"https://news.google.com/rss/articles/CBMid0FVX3lxTE1PeDJNNUVsajFsMG5xTTRscG1NdGF1cUx5Q216cDZlNUlDXzZrVEwxZmNKUEtzcVkyOFpBSWY4TUxVVkY4aWxvX0o2UzV1TlRzdkxidDhjME5zem42Vlh1QzVjUDFENllqR0JDSEZKbURwSEswSlRN?oc=5\" target=\"_blank\">‘Not Giving Up’—Barcelona Suffer Blow in Nico Williams Transfer Rac",
      "<a href=\"https://news.google.com/rss/articles/CBMimwFBVV95cUxNME1HNWVYcFNYaVY2Z2Q2NTdISFQtdXczYjlaNDVUaHk2WGVfUGFyQ3A1aXVLV18zNDhSZk9MdWQwYVpQQjM2aVhpa1lBOGZ1akNXT1pEQnppS01OMVFra1BYc3AyN25XWWlJQ3kwZ1lFSUVhY2twOHJoR0taellTc0kyQmhCSWRRc19sMmVVVUp2V21HU1ljdUIwYw?oc=5\" target=\"_blank\">Ranking the AFC E",
      "<a href=\"https://news.google.com/rss/articles/CBMimAFBVV95cUxPb3RpTlFHR2xIRFAtelZqcGV0Mlg2WDdHZ3FqVG1sZ0dvQXY4U1VLcnlrdnZHZEZPTU8yQ2lqS004UUUzdHc5RGVBQ0dxQTdIX3gwVU1Hc1c3bzhqdmVHSS1GdTU2eTM5d0xhWTFSS0N2aUcxczFzeEY1REQzOXN5djJiSE5GaldhSXB4ZVh4TVRhNm1QZklkTw?oc=5\" target=\"_blank\">Rockets New Look Star",
      "<a href=\"https://news.google.com/rss/articles/CBMiggFBVV95cUxOeXFra1hjX000dFdzZE9zcTV1SmFCcV9sNjBZNGNBa0ZZdndrSHEzVHI5Sk1peTg3bUxvY3lOS2VjWkdvWndNQUlrTzZfel8wb00zWFFuTlpzdXhWa0VvbE90bWV2LXdPalBfWlJ1VmJZWjBDWUgwaDlmYzcwNGFrQmt3?oc=5\" target=\"_blank\">Ranking Every Player on Packers’ Roster, Part 5: Th",
      "<a href=\"https://news.google.com/rss/articles/CBMihAFBVV95cUxOb1FFVUk4ajIyZUlwVk5Nd3pORzJDOXIzVHhTRmlLdTh5Z1lua3U5RFlqNWt5Z0JraC1tZkRtcGxfcXdXSDh5RFNIcXdudHA0WHNyaTBqcmRPM0V2MzVkdFA4emhzTmc2RjdWTmxEYWVJbElxYjZDT2Z1WjgxTVBQd1gtQUo?oc=5\" target=\"_blank\">‘He Can Play Anywhere’—Xabi Alonso Compares Real",
      "<a href=\"https://news.google.com/rss/articles/CBMiiAFBVV95cUxPMTR4LWNjdDhPbkpMTjRBY2xQRlo5TmFrUzI3YjItVXp2aEpBTXpqUHAwSWtMVTZ3Nm8tQVVDV3B3MnRsNTgxRTlONURsWEQ5MFZNLVNSUFpvaG1feTc2Y3NsTENHMTFITTd4anJhNTBFSC1zZE1Qc2FkelJucURqNVZobU9GTC1F?oc=5\" target=\"_blank\">Xabi Alonso Makes Bold Rodrygo Decision in ",
      "Atletico Madrid's campaign came to a quiet end even with a win over Botafogo, making them the first big team to go home early. Here's what you need to know from Monday's Club World Cup action.",
      "<p>Atlético Madrid was eliminated from the Club World Cup on goal differential Monday despite beating Botafogo 1-0 on Antoine Griezmann&#8217;s dramatic late goal.</p>",
      "Ilkay Gundogan scored twice as Manchester City thrashed Al Ain 6-0 to secure their place in the last 16 of the Club World Cup.",
      "<p>Paris Saint-Germain didn&#8217;t allow a single shot on goal as the European powerhouse beat the Seattle Sounders 2-0 on Monday and advanced to the Club World Cup round of 16.</p>",
      "<ul><li><p>PSG could meet Lionel Messi and Inter Miami in round of 16</p></li><li><p>Sounders finish winless at home in Club World Cup finale</p></li></ul><p>It took nearly the entire second half, but relentless attacks on goal paid off for Antoine Griezmann in the 87th minute on Monday.</p><p>After",
      "Little more than a week into the summer of soccer, and some of the defining images of the Club World Cup and Gold Cup have been seas of empty seats.",
      "<a href=\"https://news.google.com/rss/articles/CBMijwFBVV95cUxNdVVZb3RIMnl3Y0dnY3JyZ0U0QUp2WG53cG5rUEhnLWM0cG5tc0tJaERKVlJfN1FxaEs5a256Q182M2premprcUxDaHl6dnVlQXhaYk5TSlZaMkhBQ3JweFo1T0dFNGcwZVMxWkkwRmc5Rl9TT3pJdzQzeTdZTURvcmsxWXFobk4xQWRRc2JZWQ?oc=5\" target=\"_blank\">What Real Madrid Need to Qualify ",
      "<a href=\"https://news.google.com/rss/articles/CBMimwFBVV95cUxQZXVNOGZ3eWpCdnJ6LXZnSnNKX1J3UUE2M09XZklQV3I4RXBPNW1xZ0JtN3BJOTJlUWNZQWtyTTBIYmtwTUI2dWlpU0hncHRFZ2FLQ29ZMzhWYWNNWERrTDlTYWVxMElMdHk0bk9NUWI2X2M4ckR5bkJjTnZGRElEV1NsbXBYLTF6LTVWbUVfeXdSVnhGRG9Kd2JITQ?oc=5\" target=\"_blank\">Miami Marlins Lin",
      "<a href=\"https://news.google.com/rss/articles/CBMiiAFBVV95cUxNZEE4MnZad3U2WXR3R0o2Qlg3QlhEUjdPRGJ0NFI2U2pkTlJ4bk1rY0ZLUlpiZC1UYm90bDFKZkVZX2hUZVV4ZDhzMDN6Ml9UeWZ4WmdySGRTdm1sVzZoS2Rsekg1M25KaWs3d2YwUFozX0UwOTZUMVFoUVRiWm5ITzJ6R2U3ZkdC?oc=5\" target=\"_blank\">Joe Burrow, Jared Goff Ready to Star in Sea",
      "<a href=\"https://news.google.com/rss/articles/CBMigAFBVV95cUxPczZnamFpSGxWSjJKVHlnWExfbFVFc19SRWNRZlZxWTlOX2dCWXFpTFNaU2V4dURiZkgzX3psZ1JQM09QWkplUC1MLUx1Rl9CREhfTUxRU2JGOGtRTFlqRi1nVGN5dWlmdnNWSlhCWU1nWDh0dm5lYmdqV29BYnNhMA?oc=5\" target=\"_blank\">Flyers Acquire Trevor Zegras in Blockbuster Trade Wit",
      "<p>The Anaheim Ducks are trading forward Trevor Zegras to the Flyers for centre Ryan Poehling, a 2025 second-round pick and a 2026 fourth-round pick.</p>",
      "<a href=\"https://news.google.com/rss/articles/CBMidEFVX3lxTE50X2pZRGZoNnJiVDNvVHpMdnpBcmloc01rM3RYYW9ZU3dVUVg2Y1A5M0thdGM5b0Y0ZjFJMUhGaTRQMHl6YVpjZTV4eks0aFMxcEQyNjByYUFRVTVZMGo4Vjl3SUxLalUydjB5VlBqNnZ3RzU4?oc=5\" target=\"_blank\">Zegras traded to Flyers by Ducks for Poehling, draft picks</a>&nbsp;&nb",
      "<a href=\"https://news.google.com/rss/articles/CBMifkFVX3lxTE1jQjZTY0M1RE53RUM2WS14ZVNuVjNCVnplM2ZfcUN0eTJjYktscUJhekhNdkVreFJjRGZ2ZDhOWEROLXk2MEg5bHRydXcycjNzNC00VVNBNFpXaHJ1S3k3TFpldFdBUTdwMjBINW9TU0FMVXI4c0tQbHgwNkEtUQ?oc=5\" target=\"_blank\">Flyers Acquire Trevor Zegras From Anaheim</a>&nbsp;&nbsp;",
      "<a href=\"https://news.google.com/rss/articles/CBMifkFVX3lxTE1HU3lzdXMxWlJ0SGtiOWxDQjlraXlfMkJzcTNXTV8yZjdfMFAyODR5QmZLdDMtUktFWTZjTjU0TDdMYTRtcTlBQmNkb0ZEQ2dWVDZ6Wk1DekF5XzdnTnNRX29Fcy1xMHJlQlZoSlpZNlVRN1VOVEYzYU00MTFtUQ?oc=5\" target=\"_blank\">Rangers Agree to Terms with Adam Edstrom</a>&nbsp;&nbsp;<",
      "<p>The New York Rangers are re-upping with one of their big-bodied forwards. </p>",
      "<a href=\"https://news.google.com/rss/articles/CBMikAFBVV95cUxQVEZza0NadlNWUjZEb0FCcFE4MllXVVNwX1ZKMFdDWTRWRmtkUkFFUUFlRFFPWTRFQUx6UmZNeHU4UVNMd19PVXI5cVVJQkRiNllKcW1Bc2t4N2padlhabVYxN000bHJHWkVxZktETnpyMHZ1RjVrc3RxWUZrUmdWTnlNb3FGQTRFWXZCbUxiQko?oc=5\" target=\"_blank\">Bruins Sign Mason Lohrei to Two-",
      "<p>The Boston Bruins are locking up one of their young blue-liners before he hits restricted free agency. </p>",
      "<a href=\"https://news.google.com/rss/articles/CBMihAFBVV95cUxQOGJmQ05sR3gyaE4xemhub2ZsSkZJSzNjVFF2VXZvWDNmTmpSUXEyUTVKRFAzalE2LUNQVl9udi1sME5Jc3FSSDNVRHg5Y2FqT01IYXJuRHNaWkoySFNMZkc2dC1HOU5Td2k3OHBGeDNvM0doSFZ6RGFpYy1tQjBKNmhpMGM?oc=5\" target=\"_blank\">Lohrei signs 2-year, $6.4 million contract with ",
      "<a href=\"https://news.google.com/rss/articles/CBMilwFBVV95cUxOc0R2Z1YzR2h1UW9HXzVfUTNSY3RfQjZrMjd2Tkc4V2VBdDBMZTc2Y3V6NzVTNTE1bENULVRSQk5KRUNSb3dMQnFRVC04TXNzOEc3RkxMZHRGUUVDRVZRVzNMVm5ERGZrX2VEWFpGMmpPNmNoelRENEVqZ181SkpJV1c4aHAxWXdmOGtvb2dJLVBXOWtORWZR?oc=5\" target=\"_blank\">EDGE stats: Zegras’ out",
      "<a href=\"https://news.google.com/rss/articles/CBMilgFBVV95cUxPQ21tUFZKSmQ3M203bGhsbUJDeFA2RFIzbUNCaEhSYmFhdEhlZGllM3NwTG1sY2RjZGEyYTBEYXJ4Um0xYjRGRTBCSVR1NnVsVlh6cGgyQnNUNjI2Y09YejJWaGxCM2dlaXZZQTg1TWJxc1NiVnUwemxLVlpITEtOLWx4OHl2dVZqZE5kSGtLd2xMMDluaFE?oc=5\" target=\"_blank\">EDGE stats: Toews' outlo",
      "<a href=\"https://news.google.com/rss/articles/CBMid0FVX3lxTE1GNEtESW8wVXFSdVlQcWc2N1lEb05GZjRZVDB5NDRhR0pCeE1lamJvN0tWS1FfRzI1Q0lWNzY3RklCcElZbjhxR01ETlRoVV92MkhQaHFyby1rd3dSQnpaV0s0bU4wa2htdlZOV2NHMFpEVTVjR1dB?oc=5\" target=\"_blank\">Order of selection for 2025 NHL Draft</a>&nbsp;&nbsp;<font color=\"#",
      "<a href=\"https://news.google.com/rss/articles/CBMidkFVX3lxTFBUWmNsQ0hSVi15cUFuVnZqXzFYUHRwYjdPLXNEY0lqY1gxWmtvNWV0ZUxNME9BNXBTMzVTa04yOGg1WEFRdFVnTTB2eFJVTnJRZEdibFljT2lBNzJtWDhFcmNTc1ZfT3FOQ1RvZ0xMZUhLc045Z2c?oc=5\" target=\"_blank\">2025 NHL Draft: Metropolitan Division needs</a>&nbsp;&nbsp;<font col",
      "<a href=\"https://news.google.com/rss/articles/CBMidEFVX3lxTE01ZTl6SlY4UURnX0pPeUdaQThOV0UyNEdfSmtUVnFrNkpsc2JiRXNOZzRiMEFIZFlHOThxTlF1WGJJUFJyR2k1UmZ2V0J6TlhuOFF5aEZjc3RhXzdaTW5UV1NVcGU4Ml9DSEsyaVAyNVIyUkRa?oc=5\" target=\"_blank\">Draft Prep: What You Need to Know</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">",
      "<a href=\"https://news.google.com/rss/articles/CBMib0FVX3lxTE9kWllCQkVEWGFLOTA5dEtZdVByZ0RCaW10d25JZHFiNVZERHdORUt6WXFmNG5YbjJtQ3hBOGo1Vk1uZWwxckwtSDVFNFAtUnVrV1lqMEF5dHl2ekJndUJETk1CbFhqVkJRVXBUX1d0cw?oc=5\" target=\"_blank\">2025 NHL Draft: Central Division needs</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">N",
      "<a href=\"https://news.google.com/rss/articles/CBMilAFBVV95cUxOcVJaNFZlS09QRkJJMHo3bmlJYlEweU16UVozZDF2LW9TZzJSUHBzZlRxOWU3NHlzREd4ZVJVX2kwWXFSNmNMeHI0TnRUaEIwNlQ4RkdoVGZvMkplTHYtYVRJT0lRdUh2Y0J4ZXcta1VfV1p0Vm1KXzJsdUFDRFp2TW1mZk1MbnRXZkNjOGwzRHhpaDZX?oc=5\" target=\"_blank\">'Welcome to the NHL' to rev",
      "We have everything you need to know about the 2025 NBA draft.",
      "There's a lot of hidden value to find in the late lottery of the 2025 NBA Draft, as well as outside of it, starting with a trio of big men.",
      "Find out where top experts are projecting the Texas Longhorns phenom to land in the first round of the 2025 NBA Draft.",
      "How will Zegras fit in with the new-look Flyers?",
      "The former breakout star is getting a fresh start in Philly. Here's how both GMs did on the swap.",
      "<a href=\"https://news.google.com/rss/articles/CBMiigFBVV95cUxNUW45VENoNGVNTjB0X2JhM2hHa3BBMkV1R2toZUhoS0NUNHNVQTlieFlrMDh4ZXItUDJrSGYxMDVxLVk2OGR3cjNRdmdmTUtrZ1lOU0ZYc2NoTnBrdFMtNE41Y2lGQmFDenVPYllJc0RyZ0RsNXNDcnVwSkx3QWh3SlpMTnNHUk5GNWc?oc=5\" target=\"_blank\">LeBron James Reacted to Tyrese Haliburto",
      "<p>Indiana Pacers guard Tyrese Haliburton suffered a torn right Achilles in Game 7 of the NBA Finals on Sunday night, the team announced on Monday.</p>",
      "<p>Michael Grange joins Martine Gaillard from Oklahoma City to break down the biggest stories out of Game 7 of the NBA Finals, including Shai Gilgeous-Alexander&#8217;s dominant season and Tyrese Haliburton&#8217;s injury.</p>",
      "Haliburton went down in the first quarter as the Pacers ultimately fell to the Thunder in NBA Finals Game 7",
      "Pacers star Tyrese Haliburton sustained a torn right Achilles tendon in Game 7 of the NBA Finals against Oklahoma City, the team confirmed on Monday.",
      "More will be expected from players like Andrew Nembhard, Pascal Siakam and Bennedict Mathurin.",
      "The entire league landscape changed when the Pacers star went down in Game 7 on Sunday night",
      "The NBA Finals MVP had kind words for Haliburton after his devastating Game 7 injury",
      "<a href=\"https://news.google.com/rss/articles/CBMikAFBVV95cUxPY0J0VVpyQnZ0RnZyVC00NV9EZ2I3ZGRvMnJYUG8tOURWcFE2UHlMVGZyZEphbVhOTVF6NGktMTVmb29ja09oUU9BYW11RG1OVzdhMVhJenh3aUhaT1FoV3djV2dmM2dHWm5jMWtKZzZMZHlla1JKTGVmSzBmS3JoekJ6bWRHWTdnNHNtM2EzN2E?oc=5\" target=\"_blank\">Former Lions QB Is Set to Reach ",
      "<a href=\"https://news.google.com/rss/articles/CBMijgFBVV95cUxPY2RqaFNCRTBjeGtUVEFmRVR3bzMzMDJ2cldYb01xWS0yRjVJSXJaQk1LTjdkZUFOUWV0WXQ4MGtoZTVsWFQ3TmZVYVczMDQ4aDVlX0E3dXd1eS14bzBSYmJKbTJCUEZmVlJ3SXkzY1ZtNWhHdUpFQWVqVTgwM3duS3gwdHN3REpoOGhwTzRn?oc=5\" target=\"_blank\">Crafting Various Lineups for Louisv",
      "<a href=\"https://news.google.com/rss/articles/CBMieEFVX3lxTE85NkR2ZjZQaExEM0pvUG52V3NQNlVSQnA1aHdwaXJLZThnLTFTME1pVmhqVGcyVDJyUEtvTE1NTjZhSmNyVmlIN293QXZ1Y2JkTnFpR2hyQkUtRjdmSU1yRm5Zd3F3dFBwMHBQVUJIUXhVaFZidzM1Yw?oc=5\" target=\"_blank\">‘Be Smarter’—Thibaut Courtois Slams Real Madrid Teammate</a>&nbsp",
      "<a href=\"https://news.google.com/rss/articles/CBMigwFBVV95cUxPMkZnMEE4MXR1V1lEcXRTbzhQOU15MndXU3ZHX3g3dzRYZURpcnNDaEZWaWxNQXBycWtjeTBRSElZYmZhS1lGbGQxTVFubURnOHdscWpqVnRkMEthSUxXbkYwcnotamxkYkNzZFNPWG12YjRUYy12YlRfVVJrMnUwenE0QQ?oc=5\" target=\"_blank\">New York Knicks Must Respond After Kevin Durant T",
      "<a href=\"https://news.google.com/rss/articles/CBMijAFBVV95cUxNMG9ySjNhaEtvWjYzMml5UkhBQlM0eEdDSVQ4V2JRckdrTlc4VmdGNzdhSnp4THktU0lmNFhkcHFaUXM1My1UOTZDQ0ExaU03ejZwTEFEMzJqYW9SV2stc19qbmFXemhsN05tVUxsOV9pNGVua2x4Q2lBc0M2R24xdmZfRlpPYTREMEc0Wg?oc=5\" target=\"_blank\">New York Jets Co-Owner Agrees to Buy ",
      "New York Jets owner Woody Johnson has agreed on a £190 million deal ($254m) to buy a 43% stake in Premier League team Crystal Palace from American businessman John Textor, the club announced on Monday.",
      "<p>ew York Jets owner Woody Johnson is finally set to get his hands on an English soccer team.</p>",
      "A Phoenix Suns insider took a shot at the Miami Heat after their failed trade talks for Kevin Durant.",
      "The Houston Rockets took his advice.",
      "<a href=\"https://news.google.com/rss/articles/CBMilgFBVV95cUxPNWt5R0ZUblppd3haeExkNUl6d2R1N1NMdHg3M0RoTjBZU1NJd29NYThEcnVRT2s4bGV3eUpUTnNlLUtOek54Z2Fxb0xQbkxaY1FvYTN6UW0xYkZDc3ZySzlaaG10MjlOZ0VMcDVETE90UEdqaVlmOTNMamV1NXRmeFlOV3pVWTFnQU5nYmtUQTRTUlhrQWc?oc=5\" target=\"_blank\">New York Yankees Have Co",
      "<a href=\"https://news.google.com/rss/articles/CBMiiwFBVV95cUxONTRMWXJRd2ZoeTJJal9FWGFHbzV3eWRaVjJnSnZ2TGdSUlV4NUZEQkZfUUlYR0lNOGowa21PZVhTLXYxWG93azg0NDc5Mk51R3d4QWdjY2wtbkdXUERxX3JIZFdPdldaRmgxV3FDUFc3bTlYQWVzZHp5Y0Iza3puMmRYdzdKOFZDX2hn?oc=5\" target=\"_blank\">What Man City Need to Qualify for Club ",
      "<a href=\"https://news.google.com/rss/articles/CBMiXEFVX3lxTFB3bVFYajdBWmxaWExSUVViUExRQUpPekE3TnViNnozWnpFR2Njam1ZOUxDOG9EOV9CZWt2VTZ6WUtLN1VVMVJuLXlhYWpNakRyNUphSHVPNWtCMDBZ?oc=5\" target=\"_blank\">SI:AM | Thunderous Applause</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Sports Illustrated</font>",
      "<a href=\"https://news.google.com/rss/articles/CBMie0FVX3lxTE5QU01HOXJnM0dUUlFjWXlaa0wtUklKcUpIZ1pGRmdBU1VkWkpZZGlsYnhWclRWUkpMckR2ZnVzUkVHa0lWeHVKNE1IZ0g2MXc4M1FuV2tFaWdGNmozNGhzbDhUWC1aa09RX203a19Ea1pYWVpTN3VCVVg4OA?oc=5\" target=\"_blank\">2025 Rocket Classic Full Field: Rickie Fowler Among Past Cham",
      "SportsLine's model simulated the 2025 Rocket Classic 10,000 times and revealed its PGA Tour golf longshots",
      "SportsLine golf expert Eric Cohen just locked in his PGA Tour best bets for the 2025 Rocket Classic at Detroit Golf Club",
      "SportsLine golf expert Eric Cohen locked in a $10 seven-leg PGA Tour parlay that pays nearly $1.3 million for the Rocket Mortgage Classic 2025",
      "<a href=\"https://news.google.com/rss/articles/CBMigAFBVV95cUxNZTFJWFVld1EtUVdXRjJlX2NLaFBVNi1vbXRzQi1GMk9nWEc5YTJ4WE5PcmZYYjJfYm9Xd3N0T1BDbjJxYkgzeHFvRmdocmhsSFdldEtPOFc1ZHNMWnlEaU5KR3BKc0J1TjZRaTF1NXFSMkpGTEdhbkFSLWNJY2hIZA?oc=5\" target=\"_blank\">NFL Takeaways: Jayden Daniels and Commanders Building",
      "Washington Commanders principal owner Josh Harris spent half a million dollars to buy a Jayden Daniels rookie card at Fanatics Fest.",
      "<a href=\"https://news.google.com/rss/articles/CBMic0FVX3lxTFBsUE9uLTI2Xy04ckRrYXMtYjBCODRtYVFGcklVX0VMbjJILXowTmpwWHN1RW02RWtPS3czcHJYNU5sMlpGWXNGMVEyMUpKdE5yNnl5RHNiX0ZLQmZPdDFxYVBNQlVSMUs3UDlKcGt4VW4zRHM?oc=5\" target=\"_blank\">Thunder Match Michael Jordan's Bulls With Rare Achievement En Route to N",
      "<a href=\"https://news.google.com/rss/articles/CBMikgFBVV95cUxPWllycUJ5Z0JseGd3dmpHbVZtRS1KUUFGRkwyd1p2b3FFanNpdk56LWlsODdpdTNTUGFIcWl4Qjlyd2xvdDNKd2tmSUE0b3R2Ymo5SFpUY0JFZGFNczFwV3Bfc1lMN3R4RVFTVFFEbmk1YU1wSzB5bExYQ0xEN3FicDZnQnpEWU5rczN1NUhoY2xVZw?oc=5\" target=\"_blank\">Prosecutors Want Five-Year Pr",
      "<p>Dominican prosecutors requested on Monday that suspended Tampa Bay Rays player Wander Franco, who faces charges of sexual abuse involving a girl who was 14 years old at the time of the alleged crimes, be sentenced to five years in prison.</p>",
      "<a href=\"https://news.google.com/rss/articles/CBMifkFVX3lxTE9WT0RCNU1MT28zVjFoa0lOY00xNUhNbjBORjFwdkNkNmUzVFlTdHE2emI4Nl9Rc25VS25Xa1hRU2RJM21HM3JtMWw4bU9NR3FXSGpOdmpSVzNFM2VPTHBRMnBMMG5NQTNhY3UxN20xblQ4X1dxcWIwYzU3R1hudw?oc=5\" target=\"_blank\">Chet Holmgren Sent Classy Four-Word Message to Tyrese Hal",
      "<a href=\"https://news.google.com/rss/articles/CBMilAFBVV95cUxQeWduSWp6b3E2QWtZV1VFVWFnZHFiZEFJcDlpV3VKVGlCd1ZVSERhN29KSEpzS2VPZTY1QjlRYmhTVGtyUUJ2c1Z1Y0l2VnNPcjB2dzQtaDhTbHZoTy0ydHdQLTA3Rms5blAxR2hYOEhmM0JJWURndmliTS1yV0lqVTVkMFhDaGE3UWtWRUk0UWJvb3B0?oc=5\" target=\"_blank\">Payton Hints at Broncos' Pl",
      "The Thunder didn't waste any time with their change.",
      "<p>The list of Canadians to win the NBA title has just added two new names. </p>",
      "<p>Shai Gilgeous-Alexander cemented his legacy as perhaps the best Canadian basketball player of all time, capping off a 68-win season by leading the Thunder to their first NBA championship.</p>",
      "84 total wins, a record point differential, an elite defense and the MVP, the list goes on and on"
    ],
    "image_url": "https://s.abcnews.com/images/GMA/250623_gma_ally_oklahomacity1_0731_hpMain_4x3_384.jpg",
    "titles": [
      "WATCH:  OKC Thunder storm their way to 1st NBA title",
      "‘Start of a dynasty?’: Sports world reacts to Thunder winning NBA title",
      "How to Watch Oklahoma City Thunder NBA Finals Parade - Sports Illustrated",
      "Jalen Williams Made Sure Thunder Staffers Got to Have Moment With Championship Trophy - Sports Illustrated",
      "‘Not Giving Up’—Barcelona Suffer Blow in Nico Williams Transfer Race - Sports Illustrated",
      "Ranking the AFC East Wide Receiver Situations - Sports Illustrated",
      "Rockets New Look Starting Lineup Likely Set for 2025-2026. - Sports Illustrated",
      "Ranking Every Player on Packers’ Roster, Part 5: Three Draft Picks - Sports Illustrated",
      "‘He Can Play Anywhere’—Xabi Alonso Compares Real Madrid Star to Steven Gerrard - Sports Illustrated",
      "Xabi Alonso Makes Bold Rodrygo Decision in Real Madrid’s First Club World Cup Victory - Sports Illustrated",
      "Atletico Madrid are first big Club World Cup exit: updates",
      "Atlético Madrid bounced from Club World Cup despite win over Botafogo",
      "Man City score six to reach Club World Cup last 16",
      "Paris Saint-Germain beats Seattle Sounders to reach Club World Cup round of 16",
      "Atlético Madrid eliminated from Club World Cup as PSG and Botafogo advance from Group B",
      "Why empty seats litter Club World Cup, Gold Cup",
      "What Real Madrid Need to Qualify for Club World Cup Knockout Stages - Sports Illustrated",
      "Miami Marlins Linked to Two Potential Trades With Los Angeles Dodgers - Sports Illustrated",
      "Joe Burrow, Jared Goff Ready to Star in Season 2 of Netflix’s ‘Quarterback’ Trailer - Sports Illustrated",
      "Flyers Acquire Trevor Zegras in Blockbuster Trade With Ducks - Sports Illustrated",
      "Ducks trade forward Trevor Zegras to Flyers for Poehling, picks",
      "Zegras traded to Flyers by Ducks for Poehling, draft picks - NHL.com",
      "Flyers Acquire Trevor Zegras From Anaheim - NHL.com",
      "Rangers Agree to Terms with Adam Edstrom - NHL.com",
      "Rangers agree to two-year, $1.95M extension with F Adam Edstrom",
      "Bruins Sign Mason Lohrei to Two-Year Contract Extension - NHL.com",
      "Bruins sign Mason Lohrei to two-year, $6.4 million contract extension",
      "Lohrei signs 2-year, $6.4 million contract with Bruins - NHL.com",
      "EDGE stats: Zegras’ outlook after trade to Flyers - NHL.com",
      "EDGE stats: Toews' outlook for NHL return with Jets - NHL.com",
      "Order of selection for 2025 NHL Draft - NHL.com",
      "2025 NHL Draft: Metropolitan Division needs - NHL.com",
      "Draft Prep: What You Need to Know - NHL.com",
      "2025 NHL Draft: Central Division needs - NHL.com",
      "'Welcome to the NHL' to reveal behind-the-scenes look at Draft - NHL.com",
      "Our one-stop shop for the 2025 NBA draft: Mocks, order and big questions",
      "Under-The-Radar NBA Draft Prospects - Big Men",
      "Tre Johnson's Final NBA Mock Draft Predictions Revealed",
      "Trevor Zegras traded to Flyers: Grades for Philadelphia, Anaheim Ducks with deal made just before NHL Draft",
      "Grading the Flyers, Ducks on the Trevor Zegras trade",
      "LeBron James Reacted to Tyrese Haliburton Injury With One NSFW Word - Sports Illustrated",
      "Pacers’ Tyrese Haliburton sustained torn Achilles in Game 7",
      "Did Haliburton injury turn Game 7 into an all-time NBA what-if?",
      "Tyrese Haliburton injury: Torn Achilles confirmed for Pacers star, who could miss entire 2025-26 NBA season",
      "Pacers confirm Haliburton has torn Achilles",
      "Fantasy: How Haliburton's injury impacts Pacers",
      "Tyrese Haliburton just suffered the most devastating injury in NBA history, and it impacts the whole league",
      "Tyrese Haliburton injury: Shai Gilgeous-Alexander laments Pacers star's 'unfair' torn Achilles tendon",
      "Former Lions QB Is Set to Reach Historic Career Earnings - Sports Illustrated",
      "Crafting Various Lineups for Louisville Men's Basketball in 2025-26 - Sports Illustrated",
      "‘Be Smarter’—Thibaut Courtois Slams Real Madrid Teammate - Sports Illustrated",
      "New York Knicks Must Respond After Kevin Durant Trade - Sports Illustrated",
      "New York Jets Co-Owner Agrees to Buy £190 Million Stake in Premier League Club - Sports Illustrated",
      "Jets owner Johnson agrees to buy Palace stake",
      "Jets owner Woody Johnson buys 43 per cent stake in Crystal Palace",
      "Suns Insider Takes Jab at Heat After Failed Kevin Durant Trade Talks",
      "Key Person Encouraged Rockets to Trade for Kevin Durant",
      "New York Yankees Have Competition for Pirates Infielder - Sports Illustrated",
      "What Man City Need to Qualify for Club World Cup Knockout Stages - Sports Illustrated",
      "SI:AM | Thunderous Applause - Sports Illustrated",
      "2025 Rocket Classic Full Field: Rickie Fowler Among Past Champions to Return to Detroit - Sports Illustrated",
      "2025 Rocket Classic predictions, odds, free picks: Hideki Matsuyama, Luke Clanton among longshots to back",
      "2025 Rocket Classic expert picks, predictions: Golf insider fading Collin Morikawa at Detroit Golf Club",
      "2025 Rocket Classic longshot picks, odds, PGA props: This golf parlay pays nearly $1.3 million on a $10 bet",
      "NFL Takeaways: Jayden Daniels and Commanders Building on Last Season’s Success - Sports Illustrated",
      "Commanders owner buys Jayden Daniels rookie card for $500,000",
      "Thunder Match Michael Jordan's Bulls With Rare Achievement En Route to NBA Title - Sports Illustrated",
      "Prosecutors Want Five-Year Prison Sentence for Rays' Wander Franco - Sports Illustrated",
      "Dominican prosecutors in Wander Franco trial seek five-year prison sentence",
      "Chet Holmgren Sent Classy Four-Word Message to Tyrese Haliburton After Thunder Won Title - Sports Illustrated",
      "Payton Hints at Broncos' Plan to Use LB Drew Sanders as a Weapon - Sports Illustrated",
      "Thunder Make Change Immediately After Winning NBA Title",
      "Gilgeous-Alexander, Dort join growing list of Canadians to win NBA title",
      "Gilgeous-Alexander, Thunder cement legacy with NBA championship",
      "By the numbers: OKC Thunder just put together one of the greatest single seasons in NBA history"
    ],
    "score_components": {
      "magnitude": 0.82,
      "recency": 0.797,
      "consensus": 1.0,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.816,
    "summary": "Manchester City advanced to the last 16 of the Club World Cup after defeating Al Ain 6-0, with Ilkay Gundogan scoring twice. The article also touches on the needs and qualifications of various football clubs, including PSG, Real Madrid, and Inter Miami, and mentions the potential for Al Hilal and Sundowns to still qualify. It highlights the passion and heritage of Brazilian clubs Flamengo, Botafogo, Palmeiras, and Fluminense, despite their financial disparities with European teams, underscoring a cautionary note from Botafogo manager Renato Paiva about underestimating teams with heart.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "The story provides useful context about the Club World Cup and the status of various football clubs. It also increases awareness about the financial disparities between clubs and the importance of passion and heritage in the sport. However, it does not provide actionable insights or report on solutions or improvements."
  },
  {
    "title": "UK to Ban Palestine Action Group Under Anti-Terror Laws After RAF Base Attack",
    "domain": "general",
    "location": "global",
    "published": "Mon, 23 Jun 2025 20:19:42 GMT",
    "source": "BBC",
    "sources": [
      "Al Jazeera",
      "The Guardian",
      "BBC",
      "New York Times"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "It comes after what she called a \"disgraceful attack\" on an RAF base and as a protest took place in central London.",
      "<p>Home secretary to ignore warning from group’s lawyers that doing so would be ‘unlawful, dangerous and ill thought out’</p><ul><li><p><a href=\"https://www.theguardian.com/politics/live/2025/jun/23/david-lammy-us-strikes-iran-labour-keir-starmer-uk-politics-latest-updates-news\">UK politics live – l",
      "The British government announced plans to proscribe Palestine Action after members broke into a military air base.",
      "British government will use antiterrorism laws to ban campaign organisation in wake of damage to planes by activists."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/a7a2/live/02b500e0-5039-11f0-8c47-237c2e4015f5.jpg",
    "titles": [
      "Palestine Action to be banned under anti-terror law, home secretary confirms",
      "Yvette Cooper vows to ban Palestine Action under anti-terrorism laws",
      "U.K. to Ban Palestine Action Group as Terrorist Organization",
      "UK to ban Palestine Action, police clash with group’s supporters in London"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.923,
      "consensus": 0.935,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.808,
    "summary": "The British government has announced its intention to ban the campaign group Palestine Action, using anti-terrorism laws, following a break-in and damage to planes at a military airbase. This decision comes despite warnings from the group's lawyers that such a move would be \"unlawful, dangerous, and ill thought out.\" The announcement was made after what was described as a \"disgraceful attack\" on an RAF base, coinciding with a protest in central London.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the British government's decision to ban the Palestine Action group, providing context about the reasons behind this decision. However, it doesn't offer any solutions or improvements, nor does it provide a deep understanding of the systems or causes behind the issue."
  },
  {
    "title": "Tesla Launches Robotaxi in Texas, T-Mobile Unveils Satellite Messaging",
    "domain": "general",
    "location": "national",
    "published": "Mon, 23 Jun 2025 04:45:24 GMT",
    "source": "Axios",
    "sources": [
      "TechCrunch",
      "Ars Technica",
      "Axios",
      "CNBC",
      "Forbes",
      "The Verge"
    ],
    "domains": [
      "technology",
      "business",
      "general"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMimgFBVV95cUxPbWhMeTJCcGRObkhOOTR2dzNGZkh2MlFaVTBhZ0dtOVMxRVh3VzVfcjF1WFFGczhucVBIc0VkVnhYdVpUSWI5Q0dTUWJUQVNqZF9KRE1WendBRWMtcThXaExMZzhwemllY2lRY0gxV1JKcWxnMng0WmVnSXFUNUFsWnk3UmVudjlINl9SYy1WTTBEYlZFTFF3TlFR?oc=5\" target=\"_blank\">Delta-8 THC will st",
      "<a href=\"https://news.google.com/rss/articles/CBMicEFVX3lxTE1HVzBvU3pmSmNucGlRS2hnR1hxUEdNYTlzTnJQeWFfbXN3SV9lZTBkTFptQm44YVN2WnNKbXIyUWdzZTNyb201T3JaT0ViUF92WUl3cFFvcnZSNHFQakhpc2RRaTFEUlo5TUJFSUNPVmk?oc=5\" target=\"_blank\">Tesla's robotaxi service begins cautiously in Texas</a>&nbsp;&nbsp;<font col",
      "Self-driving technology on which Elon Musk has staked future of his company debuts in Texas.",
      "After spending the first half of the year in beta testing, T-Mobile’s Starlink-powered satellite service will go public on July 23rd. While it will only include messaging at launch, the company has some ambitious plans to expand the service before the end of the year. When it goes live next month, “",
      "The launch puts Tesla head-to-head with Alphabet-backed Waymo, which is already operating a fleet of robotaxis in several cities.",
      "Tesla stock has officially recovered all losses from the falling out between Elon Musk and Donald Trump, wiping out what was once a 14% slide.",
      "NHTSA pressed Tesla for more information about robotaxi incidents caught on camera and shared widely on social media.",
      "Federal safety regulators have reached out to Tesla a day after the automaker began providing rides in its branded robotaxis in Austin."
    ],
    "image_url": "",
    "titles": [
      "Delta-8 THC will stay legal in Texas - Axios",
      "Tesla's robotaxi service begins cautiously in Texas - Axios",
      "Tesla launches robotaxi service in Austin",
      "T-Mobile’s satellite service officially launches in July",
      "Tesla stock pops 8% as Musk touts 'successful' robotaxi Austin launch",
      "Tesla Stock’s 8% Robotaxi Boost Lifts Elon Musk’s Net Worth By $15 Billion",
      "Tesla robotaxi incidents caught on camera in Austin draw regulators' attention",
      "Tesla’s robotaxis have already caught the attention of federal safety regulators"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.667,
      "consensus": 1.0,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.803,
    "summary": "Delta-8 THC regulations are under scrutiny, while Tesla has cautiously launched its robotaxi service in Texas, marking a significant milestone for Elon Musk's vision for the future of transportation. The service, which directly competes with Alphabet's Waymo, began after Tesla's stock recovered from a previous slide. Meanwhile, T-Mobile is set to launch a Starlink-powered satellite messaging service on July 23, aiming for expansion by year's end. Additionally, the National Highway Traffic Safety Administration (NHTSA) has requested more information from Tesla regarding incidents involving its ",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive as it provides useful insights into the advancements made by Tesla and T-Mobile in the transportation and communication sectors respectively. It also reports on the progress and innovation in these fields, contributing to the reader's understanding of the current trends in technology."
  },
  {
    "title": "UK to Raise Defense Spending to 5% of GDP by 2035, Ahead of NATO Summit",
    "domain": "general",
    "location": "global",
    "published": "Mon, 23 Jun 2025 21:40:04 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC",
      "Financial Times"
    ],
    "domains": [
      "business",
      "general"
    ],
    "snippets": [
      "The announcement comes ahead of a two-day Nato summit in the Netherlands.",
      "<p>Keir Starmer says investment in national security will also deepen Britain’s commitment to Nato</p><p>Britain will commit to spending 5% of its GDP on defence by 2035 after weeks of diplomatic pressure and intense negotiations with allies.</p><p>The decision came as Keir Starmer, the prime minist",
      "<p>This blog has now closed, please read our report <a href=\"https://www.theguardian.com/world/2025/jun/23/zelenskyy-calls-russia-iran-and-north-korea-a-coalition-of-murderers\">here</a></p><p>For <strong>more updates on the Israel-Iran war</strong>, including US president Donald Trump’s call to “mak",
      "Berlin plans a 70% increase in military spending to €162bn by 2029, according to leaked paper",
      "New target includes 1.5% of spending on security related infrastructure such as cyber and border protection"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/da43/live/c437e760-504c-11f0-932e-09e4445146f3.jpg",
    "titles": [
      "UK vows to spend 5% of GDP on national security by 2035",
      "UK will commit to spending 5% of GDP on defence by 2035",
      "Defence spending target of 5% GDP a ‘quantum leap’ in security, says Nato’s Rutte– Europe live",
      "Germany to boost defence spending at faster rate than France or UK",
      "UK defence funding will hit 5% of GDP by 2035, Starmer to tell Nato summit"
    ],
    "score_components": {
      "magnitude": 0.74,
      "recency": 0.949,
      "consensus": 0.897,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.803,
    "summary": "Britain has committed to increasing its defense spending to 5% of GDP by 2035, as announced by Prime Minister Keir Starmer. This decision, aimed at deepening the UK's commitment to NATO, comes ahead of a NATO summit in the Netherlands and follows diplomatic pressures and negotiations with allies. Concurrently, Berlin plans to boost its military expenditure by 70% to €162 billion by 2029, with 1.5% of this spending dedicated to security-related infrastructure, including cyber and border protection.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The story informs about the UK's decision to increase its defense spending and the reasons behind it. It also provides context about the upcoming NATO summit and Germany's plans for military expenditure. However, it does not clearly highlight any solutions or improvements, which is why it doesn't score a full 1.0."
  },
  {
    "title": "Khris Middleton Opts for $33.3M Option, Stays with Wizards for 2025-26",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 23 Jun 2025 19:45:16 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Wizards three-time NBA All-Star Khris Middleton has picked up his $33.3 million player option for the 2025-26 season, sources told ESPN.",
      "<p>Three-time All-Star Khris Middleton won&#8217;t be testing the waters of free agency. </p>",
      "The veteran wing could interest hopeful contenders on the trade market"
    ],
    "image_url": "",
    "titles": [
      "Sources: Wiz's Middleton picks up $33.3M option",
      "Report: Wizards’ Khris Middleton picks up $33.3 million player option for 2025-26",
      "Khris Middleton picking up $33 million player option with Wizards makes him trade candidate to watch"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.991,
      "consensus": 0.847,
      "constructiveness": 0.6,
      "proximity": 0.75
    },
    "score": 0.79,
    "summary": "Khris Middleton, a three-time NBA All-Star and player for the Wizards, has chosen not to enter free agency by picking up his $33.3 million player option for the 2025-26 season, according to sources cited by ESPN. This decision keeps him with the Wizards, although it also makes him a potential trade target for teams looking to contend.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about a significant decision made by a high-profile NBA player. It informs readers about the dynamics of player contracts and free agency, contributing to a deeper understanding of how the NBA works. However, it doesn't report on solutions or improvements, and its value is mainly for basketball fans."
  },
  {
    "title": "East Coast Heat Wave Hits 104°F; Study Touts Urban Trees for Cooling",
    "domain": "general",
    "location": "national",
    "published": "Mon, 23 Jun 2025 19:05:49 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "CBC",
      "Phys.org"
    ],
    "domains": [
      "science",
      "general"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMiVEFVX3lxTE80MEVRNzRsSmJTSC10M29hZ0FTaGxtMEUxRzVWdk1nanBwdGI5Z19Bb0N6clFhVTlEdjQ3UWVTUnhjVDNicWtZU2N0Y2NGVFZtVXpHdw?oc=5\" target=\"_blank\">Millions at risk amid widespread heat wave</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Axios</font>",
      "A potentially life-threatening heat wave hit the East Coast of the United States on Monday, with temperatures expected to climb to 40 degrees Celsius (104 F) in the New York metropolitan area.",
      "<img alt=\"Three paddleboards are on a river. People are on two of the boards and a kid is swimming next to the third.\" height=\"349\" src=\"https://i.cbc.ca/1.7305185.1724697326!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_620/heat-weather-summer-renfrew-county.JPG\" title=\"People float in the Ma",
      "Plane trees in cities have an important cooling effect even in extreme heat, according to a new study conducted by the Swiss Federal Institute for Forest, Snow and Landscape Research (WSL) and EPFL published in Urban Forestry & Urban Greening. The next step is to identify which tree species are part"
    ],
    "image_url": "",
    "titles": [
      "Millions at risk amid widespread heat wave - Axios",
      "US hit by first extreme heat wave of the year",
      "Extreme heat wave expected to peak with record-breaking Monday",
      "City trees provide cooling even in extreme heat"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.899,
      "consensus": 0.897,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.789,
    "summary": "A severe heat wave struck the East Coast of the U.S., with temperatures forecasted to reach 104°F in the New York area, posing significant health risks. Concurrently, a study by the Swiss Federal Institute for Forest, Snow, and Landscape Research and EPFL highlighted the cooling benefits of plane trees in urban areas during extreme heat, suggesting further research into effective tree species for heat mitigation.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it provides useful information about the impact of heat waves and the potential health risks associated with them. It also highlights a solution to mitigate heat in urban areas, increasing awareness about the benefits of urban trees. The story contributes to the reader's understanding of the issue and offers actionable insights for urban planning."
  },
  {
    "title": "Labour MPs Rebel Against Welfare Reform Bill with Amendment",
    "domain": "general",
    "location": "global",
    "published": "Mon, 23 Jun 2025 21:18:15 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC",
      "Financial Times"
    ],
    "domains": [
      "business",
      "general"
    ],
    "snippets": [
      "MPs including senior Labour figures sign an amendment that could sink the welfare reform bill.",
      "<p>Amendment intended to kill off legislation that would cut benefits could be backed by up to 100 Labour MPs including senior figures</p><p>Labour MPs have launched a significant rebellion against the government’s ​benefit cuts with an amendment that could kill its ​welfare bill, spearheaded by sen",
      "Opponents of the government’s bill that would cut benefits want to pressure ministers into making changes"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/b574/live/71bc59d0-506a-11f0-936a-8785af5d425f.jpg",
    "titles": [
      "Labour MPs mount major bid to block benefits changes",
      "Labour MPs launch major rebellion to stop welfare bill",
      "Dozens of rebel Labour MPs seek to stop Starmer’s welfare reforms"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.941,
      "consensus": 0.897,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.774,
    "summary": "A group of up to 100 Labour MPs, including senior members, have signed an amendment aimed at blocking the government's welfare reform bill, which proposes cuts to benefits. This move represents a significant rebellion within the Labour Party against the proposed benefit cuts. The amendment is intended to force the government to reconsider or alter the legislation.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides basic awareness about the rebellion within the Labour Party against the proposed welfare reform bill. It informs about the amendment and its intended purpose. However, it lacks depth and does not provide a detailed insight into the impact of this rebellion or the potential consequences of the welfare reform bill."
  },
  {
    "title": "Antonio Filosa Named New CEO of Stellantis Amid Challenges, Share Decline",
    "domain": "business",
    "location": "national",
    "published": "Mon, 23 Jun 2025 13:53:56 GMT",
    "source": "CNBC",
    "sources": [
      "Investopedia",
      "CNBC",
      "Ottawa Citizen"
    ],
    "domains": [
      "business",
      "general"
    ],
    "snippets": [
      "Antonio Filosa, a 51-year-old Italian native, is taking over as CEO as the automaker deals with fractured relationships, regulatory uncertainty and more.",
      "Even with funding guaranteed, a new school in central Ottawa is a decade away. A little co-operation between school boards could provide a temporary fix, but there's little sign of it.",
      "<figure><img alt=\"Kent Nishimura / Bloomberg via Getty Images Shares of Jeep parent Stellantis have lost nearly 30% of their value this year.\" src=\"https://www.investopedia.com/thmb/pb_fOCn7SkwLB6-f903bRXZ65BA=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2217020329-91"
    ],
    "image_url": "",
    "titles": [
      "New Stellantis CEO faces slew of challenges, vows to avoid 'mediocrity'",
      "Mault: New Ottawa French-language high school still faces challenges",
      "New Stellantis CEO Shakes Up Executive Team in First Day on the Job"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.807,
      "consensus": 0.897,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.741,
    "summary": "Antonio Filosa, 51, has been appointed as the new CEO of Stellantis, an automaker facing challenges including fractured relationships and regulatory uncertainty. Meanwhile, in central Ottawa, despite funding, a new school's construction is delayed by a decade due to lack of cooperation between school boards. Additionally, Stellantis, the parent company of Jeep, has seen its shares decline by nearly 30% this year, as reported by Bloomberg via Getty Images.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information about the change in leadership at Stellantis and the challenges the company is facing. However, it does not offer any solutions or improvements being made to address these issues, nor does it provide a deep understanding of the causes or impacts of the company's current situation."
  },
  {
    "title": "Rahul, Pant Centuries Set England 371 to Win in Thrilling Test Finale",
    "domain": "general",
    "location": "global",
    "published": "Mon, 23 Jun 2025 18:14:50 GMT",
    "source": "BBC",
    "sources": [
      "Sky Sports",
      "BBC",
      "Al Jazeera"
    ],
    "domains": [
      "sports",
      "general"
    ],
    "snippets": [
      "KL Rahul hits 137 whilst Rishabh Pant adds 118 as India make 364 in their second innings, setting England 371 to win the opening Test at Headingley, with the home side closing on 21-0 at stumps on day four.",
      "India was all out for 364, opening door for England to stage a dramatic Test cricket win at Headingley on final day.",
      "Contrasting, classy centuries from KL Rahul and Rishabh Pant combined to set England a stiff target of 371 to win the first Test against India at Headingley, with a thrilling fifth and final day in store.",
      "England are hunting for another Bazball-esque Headingley miracle and their first Test against India hangs in the balance."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/ff96/live/16622730-505c-11f0-a466-d54f65b60deb.jpg",
    "titles": [
      "Rahul and Pant star as India set England big target to chase on final day",
      "India’s Pant, Rahul score centuries to set England 371 to win",
      "England chasing 371 to win first Test after classy Rahul and Pant centuries",
      "First Test hangs in balance as England hunt final-day Bazball-esque win vs India"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.883,
      "consensus": 0.897,
      "constructiveness": 0.4,
      "proximity": 0.5
    },
    "score": 0.736,
    "summary": "KL Rahul and Rishabh Pant scored centuries, 137 and 118 respectively, leading India to a total of 364 in their second innings against England at Headingley. This set a challenging target of 371 runs for England to win the opening Test. At the close of day four, England had made 21 without loss, setting the stage for a potentially thrilling final day as they pursue a significant victory.",
    "constructiveness_score": 0.4,
    "constructiveness_reason": "While this story offers basic awareness about a cricket match, it doesn't provide much depth or insight beyond the game's current status. It doesn't contribute to a deeper understanding of the sport, decision-making, or a sense of agency. It is primarily of interest to cricket fans."
  },
  {
    "title": "Reds Reinstate, Then Designate Candelario for Assignment",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 23 Jun 2025 19:45:16 EST",
    "source": "ESPN",
    "sources": [
      "Yahoo Sports",
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "The Reds reinstated infielder Jeimer Candelario from the injured list Monday and designated him for assignment.",
      "Candelario signed a three-year, $45 million contract before the 2024 season."
    ],
    "image_url": "",
    "titles": [
      "Reds DFA Candelario halfway through $45M deal",
      "Reds designate Jeimer Candelario for assignment, still owing him $22.5 million through 2026"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.991,
      "consensus": 0.632,
      "constructiveness": 0.6,
      "proximity": 0.75
    },
    "score": 0.701,
    "summary": "The Cincinnati Reds reinstated infielder Jeimer Candelario from the injured list on Monday and then designated him for assignment. Candelario, who had signed a three-year, $45 million contract with the team before the 2024 season, is now in a position where the Reds have a set period to trade him, release him, or place him on waivers.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the status of a player in the Cincinnati Reds team, which can be valuable for fans or those interested in the dynamics of the team. However, it doesn't provide any insights into why this decision was made, or what the potential impacts might be, limiting its depth."
  },
  {
    "title": "Space Weather's Impact on Earth Highlights Need for Advanced Monitoring",
    "domain": "business",
    "location": "global",
    "published": "Mon, 23 Jun 2025 14:22:00 -0400",
    "source": "Forbes",
    "sources": [
      "Phys.org",
      "Forbes"
    ],
    "domains": [
      "science",
      "business"
    ],
    "snippets": [
      "Consider weather as a proving ground for the Hybrid Space Architecture - where fast refresh rates, precision, and global coverage are essential to mission success.",
      "The impacts of space weather such as extreme solar winds and magnetic waves are not limited to outer space. Bursts of plasma emanating from the sun, for instance, can temporarily intensify electric and magnetic fields on the ground when they arrive at Earth, causing geomagnetically induced currents "
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/685996c4e4911cbe689338f2/0x0.jpg?width=960",
    "titles": [
      "The Hybrid Space Imperative: Weather As The First Mission",
      "UK space weather prediction system goes operational"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.886,
      "consensus": 0.682,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.698,
    "summary": "The Hybrid Space Architecture, crucial for weather forecasting, requires rapid updates, accuracy, and worldwide reach for effectiveness. Space weather, including extreme solar winds and magnetic waves, impacts Earth by intensifying ground-level electric and magnetic fields through plasma bursts from the sun, leading to geomagnetically induced currents. This demonstrates the interconnectedness of space weather with terrestrial conditions and the importance of advanced monitoring systems.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive as it provides a deeper understanding of the impact of space weather on Earth and the importance of monitoring systems. It increases awareness about the interconnectedness of space and terrestrial conditions, and highlights the need for progress in the form of advanced monitoring systems."
  },
  {
    "title": "Curiosity Rover Sends First Close-Up Images of Martian Region",
    "domain": "science",
    "location": "global",
    "published": "Mon, 23 Jun 2025 15:42:03 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org",
      "NASA"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "New images from NASA's Curiosity Mars rover show the first close-up views of a region scientists had previously observed only from orbit. The images and data being collected are already raising new questions about how the Martian surface was changing billions of years ago.",
      "The rover recently drilled a sample from a new region with features that could reveal whether Mars’ subsurface once provided an environment suitable for life. New images from NASA’s Curiosity Mars rover show the first close-up views of a region scientists had previously observed only from orbit. The"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/curiosity-mars-rover-s.jpg",
    "titles": [
      "Curiosity Mars rover starts unpacking the planet's boxwork formations",
      "NASA’s Curiosity Mars Rover Starts Unpacking Boxwork Formations"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.911,
      "consensus": 0.632,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.69,
    "summary": "NASA's Curiosity Mars rover has provided the first close-up images of a Martian region previously only seen from orbit. These images are part of a new collection of data aimed at understanding the planet's surface changes billions of years ago. The rover also drilled a sample from this region, which may help determine if Mars' subsurface was once habitable for life. This marks a significant step in the ongoing exploration of Mars, as scientists seek to unravel the planet's past environmental conditions.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive as it provides useful insights into the ongoing exploration of Mars. It increases awareness about the planet's surface changes and potential habitability in the past, contributing to the reader's understanding of space exploration and its progress."
  },
  {
    "title": "Orcas Use Kelp for Massage in First Marine Mammal Tool Use Discovery",
    "domain": "science",
    "location": "global",
    "published": "Mon, 23 Jun 2025 17:00:43 +0100",
    "source": "New Scientist",
    "sources": [
      "The Guardian",
      "New Scientist"
    ],
    "domains": [
      "science",
      "general"
    ],
    "snippets": [
      "Drone footage has captured killer whales breaking off stalks of kelp and rubbing the pieces on other orcas, a rare case of tool use in marine animals",
      "<p>Behavior in orca population off coast of US and Canada captured by scientists using drone observation</p><p>Killer whales have been observed mutually grooming each other with a type of seaweed, the first known instance of a marine animal using tools in a way that was previously thought to be the "
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/06/23153208/SEI_256536375.jpg",
    "titles": [
      "Orcas scrub each other clean with bits of kelp",
      "Killer whales seen grooming each other with kelp in first for marine tool use"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.843,
      "consensus": 0.682,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.689,
    "summary": "Scientists have observed killer whales off the coast of the US and Canada using kelp as a tool for mutual massage, marking the first evidence of tool use for grooming in marine mammals. The orcas detach kelp stalks and use them to roll between their bodies and those of their partners, a behavior captured through drone observations. This discovery challenges previous assumptions about tool use in marine animals.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story clearly highlights a new discovery in marine biology, providing empowering knowledge about orcas' behavior. It increases clarity around animal behavior, challenging previous assumptions about tool use in marine animals. This new understanding could potentially impact future research and conservation efforts."
  },
  {
    "title": "Trump Media Launches $400M Buyback as Shares Plunge; Trump Remains Top Holder",
    "domain": "business",
    "location": "national",
    "published": "Mon, 23 Jun 2025 18:03:50 GMT",
    "source": "CNBC",
    "sources": [
      "Investopedia",
      "CNBC"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "President Donald Trump indirectly owns more than 114 million shares of the company through a revocable trust and is the largest shareholder.",
      "<figure><img alt=\"Beata Zawrzel / NurPhoto via Getty Images Shares of Trump Media &amp; Technology Group have lost nearly half of their value in 2025\" src=\"https://www.investopedia.com/thmb/zADKMFq6AhkjKtr7s733eu1YNos=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-21999"
    ],
    "image_url": "",
    "titles": [
      "Trump Media approves $400 million stock buyback",
      "Trump Media Stock Gains as Truth Social Parent Plans $400M Stock Buyback"
    ],
    "score_components": {
      "magnitude": 0.64,
      "recency": 0.88,
      "consensus": 0.632,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.678,
    "summary": "President Donald Trump, through a revocable trust, indirectly owns over 114 million shares, making him the largest shareholder of Trump Media & Technology Group, the parent company of Truth Social. The company's shares have significantly dropped in value by nearly half in 2025. In response, Trump Media announced a $400 million stock-repurchase program aimed at reducing the shares outstanding by 10%.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story informs readers about the significant drop in the value of Trump Media & Technology Group's shares and the company's response to this situation. It provides actionable insights for shareholders and potential investors. However, it does not delve into the reasons behind the share plunge or the potential impacts of the buyback program."
  },
  {
    "title": "Rockets to Negotiate New Deal with VanVleet After Not Picking Up Option",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 23 Jun 2025 19:58:23 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sportsnet"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Houston won't pick up the third year of VanVleet's deal, but the plan is to sign him to a new long-term contract",
      "<p>After a breakout campaign for the young core and a blockbuster trade for Kevin Durant, the Houston Rockets are hoping to keep one of their veteran leaders around for the long haul.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/06/23/1b418405-3c0f-4b89-940c-b54cb960727e/fvv.jpg",
    "titles": [
      "Rockets to decline Fred VanVleet team option, 'strong expectation' they re-sign him long-term, per report",
      "Report: Rockets unlikely to pick up team option on VanVleet, will work on extension"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.916,
      "consensus": 0.632,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.671,
    "summary": "The Houston Rockets have decided not to pick up the third year of Fred VanVleet's deal. However, following a successful season and a major trade for Kevin Durant, the team intends to retain VanVleet by negotiating a new long-term contract with him, aiming to maintain leadership and experience within their roster.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful information about the Houston Rockets' plans for a player, which can be valuable for fans or those interested in the team's strategy. It also offers a bit of context about the player's performance and the team's recent trade, which helps to explain the decision. However, it doesn't delve into the potential impacts or implications of this decision, limiting its depth."
  },
  {
    "title": "Novo Nordisk Claims Hims & Hers Illegally Sold Compounded Drugs",
    "domain": "business",
    "location": "national",
    "published": "Mon, 23 Jun 2025 20:01:26 GMT",
    "source": "CNBC",
    "sources": [
      "Investopedia",
      "CNBC"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Novo Nordisk said Hims & Hers has \"failed to adhere to the law which prohibits mass sales of compounded drugs\" under the \"false guise\" of personalization.",
      "<figure><img alt=\"Shelby Knowles / Bloomberg / Getty Images The decision comes after Hims &amp; Hers Health and Novo Nordisk in April announced a collaboration to provide Wegovy through Hims &amp; Hers' platform\" src=\"https://www.investopedia.com/thmb/6e66BTJ5IxOG2zGZqtWlWhq0vjk=/filters:no_upscale("
    ],
    "image_url": "",
    "titles": [
      "Novo Nordisk ends deal with Hims & Hers over sales of Wegovy copycats; HIMS drops 34%",
      "Hims & Hers Stock Plunges 35% as Novo Nordisk Ends Partnership, Citing 'Illegal' Practices"
    ],
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.917,
      "consensus": 0.632,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.668,
    "summary": "Novo Nordisk has accused Hims & Hers of violating laws against mass sales of compounded drugs by falsely claiming personalization. This dispute follows their April announcement of a collaboration to distribute Wegovy via Hims & Hers' platform. Novo Nordisk's allegations challenge the partnership's legal adherence.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs readers about a legal dispute between two companies in the pharmaceutical industry. It could be useful for those interested in the industry or the companies involved, but it doesn't provide a broader understanding of the issue or potential solutions."
  },
  {
    "title": "Super Micro Announces $2 Billion Convertible Notes Offering for 2030",
    "domain": "business",
    "location": "national",
    "published": "Mon, 23 Jun 2025 20:00:23 GMT",
    "source": "CNBC",
    "sources": [
      "Investopedia",
      "CNBC"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Super Micro said on Monday that it is offering $2 billion in convertible notes due 2030.",
      "<figure><img alt=\"Bloomberg / Getty Images The San Jose, Calif.-based server maker said the bonds will mature on June 15, 2030.\" src=\"https://www.investopedia.com/thmb/67MrjiCWTyJygh1LmF3yuigqmGo=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-21875412062-e2e0016b56bd4d9"
    ],
    "image_url": "",
    "titles": [
      "Super Micro shares fall on planned $2 billion convertible debt offering",
      "Supermicro Stock Drops After Company Announces Convertible Notes Offering"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.916,
      "consensus": 0.632,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.661,
    "summary": "Super Micro, a server maker based in San Jose, California, announced on Monday its plan to offer $2 billion in convertible notes, set to mature on June 15, 2030. This financial move aims to raise capital through debt that can be converted into equity under specific conditions.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about Super Micro's financial move, which could be useful for investors or those interested in the company. However, it doesn't offer much in terms of progress, solutions, or empowering knowledge beyond the specific context of this company."
  },
  {
    "title": "Calgary Flames Re-Sign Justin Kirkland to One-Year $900K Deal",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 23 Jun 2025 17:58:30 GMT",
    "source": "NHL",
    "sources": [
      "NHL",
      "Sportsnet"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMie0FVX3lxTE96Tmo0OURqcE1fbGh0dE9tWWcwb0lBcVJkT3c4eGxQb01HRkNxemZ1Zkdfamt4YXl0alZ2TTFSbDNkRF9oM3F5dXRMNGpaaTBaYWlCeUVlT3hqbl9IY0ZkRzZoSW9TazVzMW1vZXF4WmdYV0Jqemx3MV9vMA?oc=5\" target=\"_blank\">Flames Re-Sign Justin Kirkland</a>&nbsp;&nbsp;<font color=\"#6",
      "<p>The Flames have re-signed forward Justin Kirkland one a one-year, $900,000 contract after he played a career-high 21 games with the side in the 2024-25 season, the team announced Monday. </p>"
    ],
    "image_url": "",
    "titles": [
      "Flames Re-Sign Justin Kirkland - NHL.com",
      "Flames re-sign Justin Kirkland to one-year, $900,000 contract"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.878,
      "consensus": 0.632,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.654,
    "summary": "The Calgary Flames have re-signed forward Justin Kirkland to a one-year contract valued at $900,000. This announcement came after Kirkland played a career-high 21 games for the Flames in the 2024-25 season. The team made the announcement on Monday.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information for fans about a significant contract renewal in the Calgary Flames team. However, it does not offer insights into the implications of this decision or how it might affect the team's performance in the future."
  },
  {
    "title": "Yankees vs. Reds Compete in Series Opener; Watch Burns, Top Prospect",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 23 Jun 2025 19:28:57 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sportsnet"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Burns has been one of the top pitching prospects in the minors this year",
      "<p>The New York Yankees and the Cincinnati Reds fight to take the series lead in the first game of this three game series. </p>\n<p>Watch live on Sportsnet+ or follow along with every play on our live tracker.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/06/22/455eccb1-d568-4d45-b0d8-d3d5e854668b/burns-getty.png",
    "titles": [
      "Chase Burns called up for MLB debut: Reds to promote No. 2 draft pick to face Yankees",
      "MLB on Sportsnet: Yankees vs. Reds"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.906,
      "consensus": 0.632,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.649,
    "summary": "The New York Yankees and the Cincinnati Reds are currently competing to take the lead in the first game of their three-game series. Fans can watch the game live on Sportsnet+ or follow each play through a live tracker. Burns, noted as one of the top pitching prospects in the minors this year, is a player to watch during this series.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness about an ongoing game and highlights a player to watch, which can be useful for fans. However, it doesn't provide any deeper insights or context about the game, the teams, or the player, limiting its depth and usefulness."
  },
  {
    "title": "New York’s getting a new nuclear power plant",
    "domain": "technology",
    "location": "global",
    "published": "2025-06-23T15:45:24-04:00",
    "source": "The Verge",
    "sources": [
      "TechCrunch",
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "New York Governor Kathy Hochul announced plans today to develop a new nuclear power plant, the first to be built in the state in decades.&#160; It’s the latest signal that nuclear energy could see a comeback in the US thanks to wide-ranging support from some strange bedfellows: the Trump administrat",
      "Gov. Kathy Hochul is directing the New York Power Authority, which owns and operates two dozen power plants — mostly dams and gas turbines — to develop the new facility. The plans are still in their infancy: NYPA, a state government entity, has yet to pick a location or a design."
    ],
    "image_url": "",
    "titles": [
      "New York’s getting a new nuclear power plant",
      "New York State wants more nuclear power in a big way"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.912,
      "consensus": 0.632,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.63,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "The story offers basic awareness about a new nuclear power plant in New York. However, without a summary or further details, it's hard to determine if it provides deeper understanding, reports on solutions, or increases clarity around systems or impacts."
  },
  {
    "title": "Google adds AI features to Chromebook Plus devices",
    "domain": "technology",
    "location": "global",
    "published": "Mon, 23 Jun 2025 13:00:00 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch",
      "Ars Technica"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Google's adding a slew of AI features to the Chromebook Plus line, including a search and text capture tool, NotebookLM, and a tool for simplifying text.",
      "Google is bringing its AI obsession to Chrome OS."
    ],
    "image_url": "",
    "titles": [
      "Google adds AI features to Chromebook Plus devices",
      "Google brings new Gemini features to Chromebooks, debuts first on-device AI"
    ],
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.792,
      "consensus": 0.632,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.613,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "The story provides basic awareness about Google adding AI features to Chromebook Plus devices. However, without a summary or further details, it's hard to determine if it provides deeper understanding, reports on solutions, or increases clarity around systems or impacts."
  },
  {
    "title": "MLS Star Saliba Shines for Canada in Concacaf Gold Cup",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 23 Jun 2025 17:48:12 EDT",
    "source": "Sportsnet",
    "sources": [
      "Sportsnet"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "<p>On a national team filled with veterans who play for some big European clubs, young MLS star Nathan Saliba has perhaps shone the brightest for Canada at the Concacaf Gold Cup.  He&#8217;ll look to keep rolling Tuesday night against El Salvador.</p>"
    ],
    "image_url": "https://www.sportsnet.ca/wp-content/uploads/2025/06/saliba.jpg",
    "titles": [
      "Young Nathan Saliba giving Canada huge boost at Gold Cup"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.951,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 1.0
    },
    "score": 0.482,
    "summary": "Nathan Saliba, a young star from Major League Soccer (MLS), has emerged as a standout player for Canada's national team during the Concacaf Gold Cup, despite the team being comprised mainly of veterans from major European clubs. Saliba aims to continue his impressive performance in the upcoming match against El Salvador on Tuesday night.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story informs readers about the emerging talent of Nathan Saliba and his impact on Canada's national team. It provides context about the team's composition and the upcoming match. However, it does not delve into the systems or trends that have allowed this young star to shine."
  },
  {
    "title": "Keegan Bradley Eyes Potential as First Playing-Captain in 60 Years After Win",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 23 Jun 2025 19:45:16 EST",
    "source": "ESPN",
    "sources": [
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "After winning the Travelers Championship, will Keegan Bradley be a playing captain for the U.S. at the Ryder Cup in September? That's a decision only he can make."
    ],
    "image_url": "",
    "titles": [
      "Bradley win 'opens the door' as playing captain"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.991,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.75
    },
    "score": 0.472,
    "summary": "Keegan Bradley, following his victory at the Travelers Championship, has positioned himself as a potential playing captain for the U.S. Ryder Cup team in September. This win propelled him into the top 10 of both the U.S. Ryder Cup standings and world rankings, intensifying speculation about whether he will select himself as part of the 12-man team. Bradley acknowledges the possibility of becoming the first playing-captain in over 60 years, but the final decision rests solely with him.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful information about Keegan Bradley's potential role in the U.S. Ryder Cup team and the implications of his recent win. It increases awareness about the rarity of a playing-captain in the sport. However, it does not report on solutions or improvements, nor does it give the reader actionable insights."
  },
  {
    "title": "Canada Basketball CEO Supports Players in NBA Finals Game 7",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 23 Jun 2025 17:03:42 EDT",
    "source": "Sportsnet",
    "sources": [
      "Sportsnet"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "<p>Like many Canadians, Michael Bartlett watched Game 7 of the NBA Finals with bated breath. But as Canada Basketball’s president and CEO, he had a unique rooting interest, with players on both teams.</p>"
    ],
    "image_url": "https://www.sportsnet.ca/wp-content/uploads/2025/06/SGA-2-1.jpg",
    "titles": [
      "Gilgeous-Alexander’s NBA crown could spark Canada basketball’s next boom"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.937,
      "consensus": 0.393,
      "constructiveness": 0.7,
      "proximity": 1.0
    },
    "score": 0.469,
    "summary": "Michael Bartlett, the president and CEO of Canada Basketball, had a vested interest in the outcome of Game 7 of the NBA Finals, as players from both competing teams were Canadians. This unique position highlighted his dual support during the game, reflecting the national pride in Canadian athletes' participation at this high level of international basketball competition.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "The story provides useful context about the CEO of Canada Basketball's interest in the NBA Finals due to Canadian players' participation. It highlights the national pride in these athletes. However, it does not offer deeper insights into the role of Canadian athletes in international basketball or how this might influence the sport in Canada."
  },
  {
    "title": "New AI Model Diagnoses Brain Tumors with 99% Accuracy Non-Invasively",
    "domain": "science",
    "location": "global",
    "published": "Mon, 23 Jun 2025 22:03:32 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/new-ai-model-diagnoses-brain-tumors-with-99-accuracy-without-surgery/\" rel=\"nofollow\" title=\"New AI Model Diagnoses Brain Tumors With 99% Accuracy, Without Surgery\"><img alt=\"AI Cancer Detection Art\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"htt"
    ],
    "image_url": "",
    "titles": [
      "New AI Model Diagnoses Brain Tumors With 99% Accuracy, Without Surgery"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.956,
      "consensus": 0.393,
      "constructiveness": 1.0,
      "proximity": 0.5
    },
    "score": 0.46,
    "summary": "Researchers have developed a new AI model capable of diagnosing brain tumors with 99% accuracy without the need for surgical intervention. This breakthrough technology aims to significantly improve the speed and safety of brain tumor diagnosis, potentially transforming current medical practices by providing a non-invasive alternative.",
    "constructiveness_score": 1.0,
    "constructiveness_reason": "This story is very constructive. It reports on a significant innovation in the medical field, providing actionable insights into the potential transformation of brain tumor diagnosis. It also enhances the reader's understanding of the role of AI in healthcare and its potential to improve patient care."
  },
  {
    "title": "New Sustainable Farming Method Boosts Food Security in Senegal",
    "domain": "science",
    "location": "global",
    "published": "Mon, 23 Jun 2025 16:25:03 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "A new study published in the Journal of Cleaner Production presents a novel approach to sustainable agricultural intensification, with promising implications for food security and land conservation in Senegal. Conducted by researchers at the International Food Policy Research Institute (IFPRI), the "
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/smarter-cropland-alloc-1.jpg",
    "titles": [
      "Smarter cropland allocation could support sustainable agricultural intensification in Senegal"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.924,
      "consensus": 0.393,
      "constructiveness": 1.0,
      "proximity": 0.5
    },
    "score": 0.454,
    "summary": "A study in the Journal of Cleaner Production by the International Food Policy Research Institute reveals a new method for sustainable agricultural intensification in Senegal. This approach shows potential for enhancing food security and conserving land, addressing key challenges in the region's agricultural sector.",
    "constructiveness_score": 1.0,
    "constructiveness_reason": "This story is highly constructive as it reports on a new method for sustainable agricultural intensification. It provides actionable insights and increases awareness about the potential for enhancing food security and conserving land in Senegal. It clearly highlights progress and potential solutions to key challenges in the region's agricultural sector."
  },
  {
    "title": "Meta Bolsters AI Team with High-Profile Tech Hires",
    "domain": "business",
    "location": "national",
    "published": "Mon, 23 Jun 2025 22:25:03 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Meta CEO Mark Zuckerberg has been working to bolster his company's AI efforts with the hiring of Daniel Gross, Nat Friedman and Scale AI founder Alex Wang."
    ],
    "image_url": "",
    "titles": [
      "Meta approached AI startup Runway about a takeover bid before Scale deal"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.964,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.452,
    "summary": "Meta CEO Mark Zuckerberg is enhancing the company's AI capabilities by hiring notable figures in the tech industry. Daniel Gross, Nat Friedman, and Alex Wang, the founder of Scale AI, have joined Meta to advance its artificial intelligence projects. This move signifies Meta's commitment to strengthening its position in AI technology.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story clearly highlights progress in the field of AI technology, specifically within Meta. It provides empowering knowledge about the company's strategic moves, which could be useful for readers interested in AI, technology trends, or Meta's business strategy."
  },
  {
    "title": "New \"Delete-to-Recruit\" Gene Therapy Simplifies Disease Fight",
    "domain": "science",
    "location": "global",
    "published": "Mon, 23 Jun 2025 23:13:30 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/delete-to-recruit-scientists-discover-simpler-approach-to-gene-therapy/\" rel=\"nofollow\" title=\"“Delete-To-Recruit” – Scientists Discover Simpler Approach to Gene Therapy\"><img alt=\"Illustration of Red Blood Cells\" class=\"webfeedsFeaturedVisual wp-post-image\" height="
    ],
    "image_url": "",
    "titles": [
      "“Delete-To-Recruit” – Scientists Discover Simpler Approach to Gene Therapy"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.98,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.448,
    "summary": "Scientists have developed a new gene therapy technique termed \"Delete-to-Recruit.\" This method simplifies the process of gene editing by removing specific DNA sequences to enhance the body's natural ability to fight diseases. Unlike traditional gene therapy, which often involves adding or replacing genetic material, this approach focuses on deleting harmful genes. The discovery could lead to more efficient and potentially safer treatments for various genetic disorders, marking a significant advancement in the field of gene therapy.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it reports on a new technique in gene therapy that could lead to more efficient treatments for genetic disorders. It provides useful insights into the progress being made in the field of gene therapy and increases awareness about the potential benefits of this new approach."
  },
  {
    "title": "Court filings reveal OpenAI and io’s early work on an AI device",
    "domain": "technology",
    "location": "global",
    "published": "Mon, 23 Jun 2025 23:44:38 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Legal filings submitted earlier this month from lawyers representing OpenAI and Jony Ive&#8217;s io reveal new details about the companies&#8217; efforts to build a mass-market AI hardware device. The filings are part of a trademark dispute lawsuit filed this month by iyO, a Google-backed hardware s"
    ],
    "image_url": "",
    "titles": [
      "Court filings reveal OpenAI and io’s early work on an AI device"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.991,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.447,
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story offers useful insight into the development of AI technology, potentially aiding readers' understanding of the field. However, it doesn't clearly highlight progress or solutions, nor does it provide actionable insights."
  },
  {
    "title": "Oil Prices Fall, US Stock Futures Rise Amid Israel-Iran Ceasefire News",
    "domain": "business",
    "location": "national",
    "published": "Mon, 23 Jun 2025 22:59:38 +0000",
    "source": "Financial Post",
    "sources": [
      "Financial Post"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Oil sank and US stock-index futures climbed after President Donald Trump announced a tentative ceasefire between Israel and Iran, raising hopes that the worst of the Middle East conflict has passed."
    ],
    "image_url": "",
    "titles": [
      "Oil Drops, Stocks Look Up on Trump Truce Talk: Markets Wrap"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.975,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.444,
    "summary": "Oil prices dropped and U.S. stock-index futures rose following President Donald Trump's announcement of a tentative ceasefire between Israel and Iran. This development has sparked optimism that the major tensions in the Middle East may be subsiding.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The story provides useful information about the impact of geopolitical events on financial markets, which could aid readers in making investment decisions. However, it does not delve into potential solutions or improvements to the geopolitical situation."
  },
  {
    "title": "Study Finds Life Purpose Key to Meaningful Existence",
    "domain": "science",
    "location": "global",
    "published": "Mon, 23 Jun 2025 22:38:22 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/according-to-scientists-this-belief-is-key-to-a-meaningful-life/\" rel=\"nofollow\" title=\"According to Scientists, This Belief Is Key to a Meaningful Life\"><img alt=\"Happiness Sun Celebration\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scit"
    ],
    "image_url": "",
    "titles": [
      "According to Scientists, This Belief Is Key to a Meaningful Life"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.968,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.435,
    "summary": "Scientists have identified that believing one's life has purpose is key to experiencing a meaningful existence. This conclusion comes from research analyzing how personal beliefs and attitudes contribute to life satisfaction. The study emphasizes the importance of purposeful living in enhancing overall well-being.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides actionable insights on how personal beliefs and attitudes contribute to life satisfaction. It increases awareness about the importance of purposeful living for enhancing overall well-being. However, it does not highlight any specific solutions or progress."
  },
  {
    "title": "Apple heard your complaints about the Liquid Glass Control Center",
    "domain": "technology",
    "location": "global",
    "published": "2025-06-23T16:34:27-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "My biggest complaint with Liquid Glass in the first iOS 26 developer beta was that it sometimes made Control Center nearly unreadable, but Apple has seemingly fixed that with the second beta, which is out now. In the first beta, the glassiness of everything meant that you could still see a fair amou"
    ],
    "image_url": "",
    "titles": [
      "Apple heard your complaints about the Liquid Glass Control Center"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.927,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.434,
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story informs readers that Apple is responding to complaints, providing useful context about the company's customer service approach. However, it doesn't clearly highlight any progress or solutions."
  },
  {
    "title": "Yale’s new Google Home smart lock is here — but it costs more thanks to tariffs",
    "domain": "technology",
    "location": "global",
    "published": "2025-06-23T20:02:17-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "The Yale Smart Lock with Matter is launching tomorrow, June 24th, for $189.99 — $20 more than when it was first announced in March. Yale tells The Verge the price increase is due to the impact of tariffs.&#160;The lock will be available on Amazon and Yale’s website. According to Yale, the new smart ",
      "Smart lighting company Hue has released a new version of its Smart Button, one of the simplest ways of controlling Hue’s colorful smart lights. The new Smart Button has a bigger design and a bit of price hike — in the U.S., at least, where it now costs $32.99 compared to $29.99 for its predecessor. "
    ],
    "image_url": "",
    "titles": [
      "Yale’s new Google Home smart lock is here — but it costs more thanks to tariffs",
      "Hue’s new smart button is bigger and more expensive"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.997,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.428,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information about a new product and the impact of tariffs on its price. However, it does not offer solutions or delve into the causes or impacts of the tariff situation."
  },
  {
    "title": "Reassessment Shows Hatshepsut Statues Not Vandalized, But Traditionally Treated",
    "domain": "science",
    "location": "global",
    "published": "Mon, 23 Jun 2025 19:00:01 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Re-assessment of damaged statues depicting the famous female pharaoh Hatshepsut questions the prevailing view that they were destroyed as an act of defilement, indicating Hatshepsut was treated similarly to earlier pharaohs in death."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/reconstructing-the-sha.jpg",
    "titles": [
      "Reconstructing the shattered visage of Queen Hatshepsut"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.975,
      "consensus": 0.393,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.427,
    "summary": "Recent re-evaluation of damaged statues of Pharaoh Hatshepsut suggests that the destruction was not an act of defilement but rather a treatment consistent with that of earlier pharaohs after their death. This challenges the long-held belief that the statues were intentionally vandalized in a bid to erase her legacy.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful insights into the historical treatment of Pharaoh Hatshepsut's statues, challenging long-held beliefs and offering a deeper understanding of the subject. However, it does not report on progress, solutions, or improvements."
  },
  {
    "title": "U.S. Evaluates Key Sectors: Manufacturing to Cybersecurity",
    "domain": "business",
    "location": "global",
    "published": "Mon, 23 Jun 2025 23:34:00 GMT",
    "source": "MarketWatch",
    "sources": [
      "MarketWatch"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Take a close look now at U.S. manufacturers, semiconductor producers, agricultural exporters, cybersecurity firms and defense contractors."
    ],
    "image_url": "https://images.mktw.net/im-77645510",
    "titles": [
      "Trump’s Iran strike is a major win for your stock portfolio. Here’s how to play it."
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.987,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.419,
    "summary": "The news content highlights the current focus on various key sectors within the United States, including manufacturers, semiconductor producers, agricultural exporters, cybersecurity firms, and defense contractors. This overview suggests an examination or evaluation of these industries, possibly for their economic health, security implications, or contributions to the U.S. economy and infrastructure. However, without specific details or outcomes mentioned, the precise context or purpose of this focus remains unspecified.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides some useful context about the U.S. government's focus on key sectors, which could impact readers involved in those industries. However, it lacks specific details or outcomes, which limits its usefulness and depth."
  },
  {
    "title": "Nintendo’s GameCube controller for the Switch 2 is available once again",
    "domain": "technology",
    "location": "global",
    "published": "2025-06-23T18:51:31-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "If you missed the chance to pick up Nintendo’s new GameCube Controller for the Switch 2, your time has come. It’s back in stock for $64.99 at the My Nintendo Store. To add one to your collection, you’ll need to have a Nintendo Switch Online subscription, which starts at $19.99 a year for individuals"
    ],
    "image_url": "",
    "titles": [
      "Nintendo’s GameCube controller for the Switch 2 is available once again"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.972,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.413,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "While this story informs readers about the availability of a product, it doesn't provide deeper understanding or actionable insights. It also doesn't report on solutions, improvements, or attempts to solve problems."
  },
  {
    "title": "American Eels Found in Japanese Processed Eel Products, Study Reveals",
    "domain": "science",
    "location": "global",
    "published": "Mon, 23 Jun 2025 15:44:05 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Research led by Hiromi Shiraishi, researcher at Chuo University, has revealed that, in addition to Japanese eel (Anguilla japonica), American eel (Anguilla rostrata) is now widely distributed in processed eel products sold in retail stores across Japan."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/nearly-40-of-grilled-e.jpg",
    "titles": [
      "Nearly 40% of grilled eel products in Japanese retail market identified as American eel"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.911,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.404,
    "summary": "Research conducted by Hiromi Shiraishi from Chuo University has discovered that processed eel products in Japan now commonly contain American eel (Anguilla rostrata), alongside the traditionally used Japanese eel (Anguilla japonica). This finding indicates a significant shift in the species composition of eel products available in Japanese retail stores.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides a deeper understanding of a shift in the species composition of eel products in Japan. However, it does not report on any solutions or improvements, nor does it provide actionable insights for the reader."
  },
  {
    "title": "Samsung confirms Unpacked for early July",
    "domain": "technology",
    "location": "global",
    "published": "2025-06-23T19:00:00-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Samsung’s summer Unpacked is officially on, starting at 10AM ET on Wednesday, July 9th. The invitation features a jazzy little bop and the words “Ultra Unfolds,” so I think it’s safe to assume we’re getting that foldable Ultra phone the company previously hinted at. The event is set to take place in"
    ],
    "image_url": "",
    "titles": [
      "Samsung confirms Unpacked for early July"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.975,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.387,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about an upcoming event, but it doesn't provide any depth or insight into what to expect or why it matters."
  },
  {
    "title": "Trump&#8217;s FTC will approve an ad merger — with a gift to Elon Musk’s X",
    "domain": "technology",
    "location": "global",
    "published": "2025-06-23T16:48:09-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "The all-Republican Federal Trade Commission agreed to approve a $13.5 billion ad merger if it includes a ban on steering ad dollars away from platforms or publishers based on &#8220;political or ideological viewpoints.&#8221; The order, which was reported by The New York Times earlier this month, wo"
    ],
    "image_url": "",
    "titles": [
      "Trump&#8217;s FTC will approve an ad merger — with a gift to Elon Musk’s X"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.932,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.355,
    "constructiveness_score": 0.0,
    "constructiveness_reason": ""
  }
]