[
  {
    "title": "US Faces Potential Government Shutdown Over Funding Crisis",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 30 Sep 2025 22:57:08 GMT",
    "source": "BBC",
    "sources": [
      "Phys.org",
      "Al Jazeera",
      "BBC",
      "Financial Post",
      "Business Insider",
      "Axios",
      "Deutsche Welle",
      "Financial Times",
      "The Guardian",
      "MarketWatch",
      "CNBC",
      "Forbes"
    ],
    "domains": [
      "www.bbc.com",
      "www.marketwatch.com",
      "www.dw.com",
      "phys.org",
      "www.forbes.com",
      "www.aljazeera.com",
      "www.theguardian.com",
      "financialpost.com",
      "www.cnbc.com",
      "www.businessinsider.com",
      "news.google.com",
      "www.ft.com"
    ],
    "snippets": [
      "Government funding will be cut off after Republicans and Democrats failed to agree on a spending bill.",
      "Experts say furloughs and layoffs could slow consumer spending in the months to come.",
      "The US federal government is lurching toward a shutdown after Democrats and Republicans failed to agree on a stopgap funding bill. Follow DW for more.",
      "The United States is facing yet another government shutdown. What happens and who is impacted when the government can't pay its bills? And could the Trump administration use it as an excuse for more layoffs?",
      "<a href=\"https://news.google.com/rss/articles/CBMibEFVX3lxTE5DTUs5dG1xWFdidzQ4cUpraUlhbUozYVNPdDRLLWRBVVFYZUJTVnduR2hYRXdNYTY4U1l5VVdKMU5TRXRKSWY0eTZMaElnWTMyX2RVQUtnOVNvUHNtQUhUdE5kQ0NHS1I0WnZDaA?oc=5\" target=\"_blank\">IPO market poised to freeze with government shutdown</a>&nbsp;&nbsp;<font color=\"",
      "Republicans and Democrats unable to break gridlock in votes on Tuesday evening",
      "<p>Senate sinks Democratic and Republican plans to extend government funding beyond midnight and avert shutdown</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/live/2025/sep/30/us-government-shutdown-funding-trump-vance-portland-hegseth-latest-updates\">US politics – latest updates</a></p>",
      "<p>Thousands of park workers set to be furloughed amid warnings that leaving parks open and unstaffed could cause lasting damage</p><p>On Tuesday evening, in the final hours before a now imminent US government shutdown, the National Park Service (NPS) began preparations to close down parts of popula",
      "The U.S. government faces a shutdown on Oct. 1 unless Congress passes a spending bill to keep the government funded.",
      "Shares were mixed in Asia on Wednesday, with Chinese markets closed for a weeklong holiday, as a U.S. government shutdown loomed. Japan&#8217;s Nikkei 225 index shed 1.2% to 44,411.26 after the Bank of Japan reported a slight improvement in business sentiment among major manufacturers. The BOJ&#8217",
      "In Asia, investors will look toward the Reserve Bank of India's rate decision.",
      "The IRS says there will be no changes to its operations for the first five days of a government shutdown, thanks to a reallocation of money from the Inflation Reduction Act (IRA).",
      "A government shutdown could disrupt flights, extend security wait times, and slow safety functions, creating a stressful travel experience for flyers.",
      "Millions of Americans are poised to pay more for their health insurance next year.",
      "Federal workers may end up missing paychecks, depending on how long the shutdown lasts. Members of Congress won't have to worry about that."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/ee8d/live/32dbf5d0-9e4a-11f0-928c-71dbb8619e94.jpg",
    "titles": [
      "What could happen during the US government shutdown?",
      "Will a government shutdown hurt the US economy?",
      "US updates: Federal government facing a shutdown",
      "What does a US government shutdown actually mean?",
      "IPO market poised to freeze with government shutdown - Axios",
      "US on brink of government shutdown as lawmakers remain deadlocked",
      "US on brink of government shutdown after Senate rejects funding plans",
      "Uncertainty lingers over US national parks as government shutdown looms",
      "Q&A: What happens during a government shutdown?",
      "Asian shares are mixed as markets shrug off a likely US government shutdown",
      "Asia markets trade mixed after Wall Street shrugs off U.S. government shutdown concerns",
      "IRS Plans To Stay Open For The First Five Days Of A Government Shutdown",
      "How a US government shutdown could impact your next flight",
      "Here’s how much your health insurance could go up next year — whether there’s a government shutdown or not",
      "Yes, Congress still gets paid during a government shutdown"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.877,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.825,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The United States is on the brink of a federal government shutdown due to funding issues, which could have widespread effects across the country. NPR's member stations detail the nationwide impacts, including potential layoffs. The current status is that the government may shut down by Tuesday night if a resolution is not reached.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Warriors, Kuminga End Stalemate with $48.5M Two-Year Deal",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 30 Sep 2025 23:35:09 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Forbes",
      "CBS Sports",
      "Sportsnet"
    ],
    "domains": [
      "www.forbes.com",
      "www.sportsnet.ca",
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "Jonathan Kuminga and the Warriors ended a monthslong stalemate Tuesday, reaching agreement on a two-year deal worth $48.5 million.",
      "The Kuminga contract saga is finally over",
      "After months of negotiations going nowhere, Jonathan Kuminga and the Golden State Warriors have finally agreed to a new contract according to ESPN’s Shams Charania.",
      "<p>Restricted free agent forward Jonathan Kuminga has signed a two-year, $48.5 million contract to return to the Golden State Warriors, ESPN&#8217;s Shams Charania reported Tuesday. </p>"
    ],
    "image_url": "",
    "titles": [
      "Kuminga, Warriors end stalemate with 2-year deal",
      "Jonathan Kuminga, Warriors end contract standoff as forward signs two-year deal with Golden State, per report",
      "Jonathan Kuminga Signs Two-Year Deal With Golden State Warriors",
      "Report: Jonathan Kuminga signs two-year, $48.5M contract with Warriors"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.986,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.811,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Jonathan Kuminga and the Golden State Warriors have ended a prolonged negotiation by agreeing to a two-year contract worth $48.5 million. The deal, which includes a team option for the second year, was finalized after the Warriors increased their financial offer. This resolution comes after a public and extended stalemate between the forward and the team.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UN Security Council Votes to Expand Haiti Mission with 5,500 Troops",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Tue, 30 Sep 2025 21:02:10 +0000",
    "source": "Al Jazeera",
    "sources": [
      "New York Times",
      "Washington Post",
      "The Guardian",
      "Al Jazeera"
    ],
    "domains": [
      "www.nytimes.com",
      "www.aljazeera.com",
      "www.washingtonpost.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "International mission would surge personnel in Haiti, with mandate to &#039;neutralise, isolate, and deter&#039; gangs.",
      "<p>Unit will have up to 5,500 soldiers and police officers who will tackle the violence that has overwhelmed the country</p><p>The United Nations has adopted a resolution to transform a security mission in gang-dominated Haiti into a larger, fully fledged force with military troops.</p><p>The new un",
      "The Security Council vote was an acknowledgment that the police mission it once backed had failed to wrest back control of the beleaguered Caribbean nation.",
      "The vote on Tuesday would establish a force of up to 5,500 soldiers and police officers. It was unclear what countries were willing to contribute personnel or money."
    ],
    "image_url": "",
    "titles": [
      "UN Security Council approves ‘Gang Suppression Force’ for Haiti",
      "UN security council approves new military force to fight Haiti gangs",
      "U.N. approves militarized force to take on Haiti’s gangs",
      "U.N. Security Council Approves Larger Force to Fight Gangs in Haiti"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.86,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.768,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The United Nations Security Council has voted to expand a security mission in Haiti into a larger force with up to 5,500 soldiers and police officers. This decision aims to neutralize, isolate, and deter gangs that have overwhelmed the country. The move acknowledges the failure of the previous police mission to control the situation in Haiti. However, the contributing countries and funding details remain unspecified.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Administration Strikes Deal to Lower U.S. Drug Prices",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Tue, 30 Sep 2025 18:55:59 -0400",
    "source": "NPR",
    "sources": [
      "Axios",
      "NPR",
      "CNBC"
    ],
    "domains": [
      "news.google.com",
      "www.cnbc.com",
      "www.npr.org"
    ],
    "snippets": [
      "The Trump administration says it is making deals with drug companies to lower prices U.S. consumers pay for medicines. But key details are missing on how the initiative would work.",
      "<a href=\"https://news.google.com/rss/articles/CBMibkFVX3lxTE94Qzh2QXRTMUlzSW1FeVplcjY1QUxfTDhWNkFETUdOUy0xaWRjSnJieVlRbGw5bXdOdWVSaDN5RFlnQ0FyaVk4WVZkRkpNWnk2Vm5fRFZpX2lkTnJMeWgzdVA0anhOVXZ6OVpGTkx3?oc=5\" target=\"_blank\">Trump and Pfizer announce deal to lower drug prices, launch \"Trump Rx\" website<",
      "The deal comes after Trump sent letters to Pfizer and 16 other drugmakers calling on them to take steps to lower drug prices by Sept. 29."
    ],
    "image_url": "",
    "titles": [
      "President announces TrumpRx website for drugs, and pricing deal with Pfizer",
      "Trump and Pfizer announce deal to lower drug prices, launch \"Trump Rx\" website - Axios",
      "Trump, Pfizer agree to lower U.S. drug prices, exempt company from pharma tariffs"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.895,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.765,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Trump administration announced a deal with Pfizer and other drugmakers aimed at lowering U.S. drug prices. Details on how the initiative will work are unclear, but it follows Trump's letters to 17 drug companies urging price reductions by Sept. 29. The outcome or effectiveness of this agreement remains unspecified.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: initiative",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "WNBA Coaching Changes in Five Cities; Reeve Fined for Conduct",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 30 Sep 2025 22:33:09 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Forbes",
      "CBS Sports"
    ],
    "domains": [
      "www.forbes.com",
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "The WNBA coaching carousel starts with openings at Dallas, Seattle and New York, plus new teams Portland and Toronto.",
      "The Storm also let Noelle Quinn go",
      "Recent WNBA news has Minnesota Lynx Cheryl Reeve assessed unprecedented fine for comments and on court behavior and Dallas Wings relieves Chris Koclanes after one season."
    ],
    "image_url": "",
    "titles": [
      "WNBA coaching tracker for 2026: Wings part with Chris Koclanes",
      "WNBA coaching tracker: Liberty fire Sandy Brondello; Wings part ways with Chris Koclanes after one season",
      "WNBA News: Lynx Cheryl Reeve Fined & Dallas Wings Chris Koclanes Fired"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.965,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.755,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The WNBA has coaching vacancies in Dallas, Seattle, New York, Portland, and Toronto. Seattle's Noelle Quinn and Dallas's Chris Koclanes were let go. Additionally, Minnesota Lynx's Cheryl Reeve faced a significant fine for her comments and behavior.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Senate Fails to Pass Funding Bill, U.S. Nears Shutdown",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Wed, 01 Oct 2025 01:56:04 GMT",
    "source": "Axios",
    "sources": [
      "Forbes",
      "Axios",
      "The Guardian"
    ],
    "domains": [
      "www.forbes.com",
      "www.theguardian.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMijwFBVV95cUxNZzRkYlFKVVZnakpUZlZJVjJ3U2ZfTmZxRDBiRTQtVnlDaTdvdTV1VGpCMFRpWnBBNXhzeGJXSVVKRFdNWVY2ZUdwRWtvdi02S3JPSGhORS1MX3JSMEI4NV8xTmdZUG1HdmZVRzZXcFJXVHlIQTQ2VHFEUUdGTEVIWkpWNmxGY1RmR19hZENvbw?oc=5\" target=\"_blank\">Senate rejects 11th-hour governme",
      "<p>Resolution that would keep current levels of funding until 21 November failed to reach the 60 votes needed to pass</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/2025/sep/30/us-government-shutdown-congress-trump-republicans\">US heads toward first government shutdown in nearly seven ye",
      "The government will shut down at midnight Tuesday if Congress doesn't approve a new spending plan."
    ],
    "image_url": "",
    "titles": [
      "Senate rejects 11th-hour government funding bill - Axios",
      "Senate fails to pass stopgap funding bill as government heads for midnight shutdown – live",
      "Government Shutdown Watch: Senate Rejects Eleventh-Hour Bid To Keep Government Open"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.933,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.747,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The U.S. Senate failed to pass a resolution to maintain current government funding levels until November 21, falling short of the 60 votes required. This failure leads the U.S. towards its first government shutdown in nearly seven years, set to occur if a new spending plan is not approved by Congress before midnight Tuesday.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Ex-Congo President Kabila Sentenced to Death in Absentia for Multiple Crimes",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Tue, 30 Sep 2025 16:30:06 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Deutsche Welle",
      "The Guardian",
      "New York Times",
      "Al Jazeera"
    ],
    "domains": [
      "www.nytimes.com",
      "www.aljazeera.com",
      "www.dw.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Head of military tribunal says Kabila convicted of several crimes, including treason, murder and torture.",
      "Former Congolese President Joseph Kabila was sentenced to death in absentia by a military court. He was found guilty of treason and complicity with the M23 militia.",
      "<p>Military court convicts Kabila of war crimes, treason and other offences in verdict that could fuel enduring tensions</p><p>A military court in the Democratic Republic of the Congo has sentenced the country’s former president Joseph Kabila to death in absentia after convicting him of war crimes, ",
      "Joseph Kabila, who was president of the Democratic Republic of Congo for 18 years, was convicted of treason by a court in Kinshasa."
    ],
    "image_url": "",
    "titles": [
      "DR Congo’s ex-President Joseph Kabila sentenced to death in absentia",
      "Congo: Death sentence for former leader Joseph Kabila",
      "Former DRC president Joseph Kabila sentenced to death in absentia",
      "Congo’s Former President Sentenced to Death in Absentia"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.783,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.746,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Former Congolese President Joseph Kabila was sentenced to death in absentia by a military court in the Democratic Republic of the Congo. He was convicted of several crimes, including treason, murder, torture, and complicity with the M23 militia. This verdict comes after Kabila's 18-year presidency and could escalate tensions in the region.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Nicole Kidman Files for Divorce from Keith Urban After 19 Years",
    "domain": "general",
    "source_domain": "www.nytimes.com",
    "location": "global",
    "published": "Tue, 30 Sep 2025 21:55:55 +0000",
    "source": "New York Times",
    "sources": [
      "The Guardian",
      "New York Times",
      "CityNews"
    ],
    "domains": [
      "www.nytimes.com",
      "ottawa.citynews.ca",
      "www.theguardian.com"
    ],
    "snippets": [
      "The couple married in Australia in 2006. Their breakup surprised many fans.",
      "<p>Divorce papers filed in Nashville court include detailed plan for shared childcare of their daughters</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/oct/01/australia-news-live-nicole-kidman-divorce-keith-urban-sussan-ley-coalition-andrew-hastie-anthony-albanese-housin",
      "Oscar winner Nicole Kidman has filed for divorce from country music star Keith Urban after 19 years of marriage, according to multiple media reports. The news comes nearly 24 hours after TMZ reported that the couple had been living “apart since the beginning of summer.”&#160; Last month, Kidman was "
    ],
    "image_url": "https://static01.nyt.com/images/2025/09/30/multimedia/30xp-nicolekeith1-fbvc/30xp-nicolekeith1-fbvc-mediumSquareAt3X.jpg",
    "titles": [
      "Nicole Kidman Files for Divorce From Keith Urban After Nearly 20 Years",
      "Nicole Kidman files for divorce from Keith Urban citing ‘marital difficulties and irreconcilable differences’",
      "Nicole Kidman files for divorce from Keith Urban after 19 years of marriage: reports"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.877,
      "consensus": 0.789,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.732,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Nicole Kidman has filed for divorce from Keith Urban after 19 years of marriage, with divorce papers filed in Nashville court detailing a shared childcare plan for their daughters. The couple, married in 2006, had reportedly been living apart since the beginning of summer. This development has surprised many of their fans.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: development, plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Democrats Seek ACA Tax Credit Extension Amid Shutdown Threat",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Wed, 01 Oct 2025 01:59:30 GMT",
    "source": "CNBC",
    "sources": [
      "Forbes",
      "MarketWatch",
      "CNBC"
    ],
    "domains": [
      "www.forbes.com",
      "www.marketwatch.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "Democrats insist that any stopgap funding bill included an extension of enhance Affordable Care Act tax credits due to expire at the end of 2025.",
      "Are you prepared for the 2025 government shutdown? As the clock ticks toward midnight, the U.S. government will shut down on Wednesday October 1.  How will it affect you?",
      "The country appears to be headed for a partial government shutdown for the first time in about seven years, after a White House meeting with the top four congressional leaders ended with acrimony rather than agreement."
    ],
    "image_url": "",
    "titles": [
      "U.S. government will shut down after midnight as Congress fails to pass funding bills",
      "With The U.S. Government Shutting Down At Midnight, What Does It Mean For You?",
      "A government shutdown at midnight looks likely. What it means for Social Security and unemployment checks, the IRS, markets and more."
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.934,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.731,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Democrats are pushing for an extension of enhanced Affordable Care Act tax credits in any stopgap funding bill to prevent them from expiring at the end of 2025. Amidst these negotiations, the U.S. is on the brink of a partial government shutdown, the first in approximately seven years, as discussions among top congressional leaders and the White House have failed to produce an agreement. The potential shutdown is set to begin on October 1 if a resolution is not reached.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "6.9 Earthquake in Philippines Kills 60, Injures 140 in Cebu and Bogo",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-10-01T02:30:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "The Guardian",
      "New York Times"
    ],
    "domains": [
      "www.nytimes.com",
      "www.theguardian.com",
      "www.dw.com"
    ],
    "snippets": [
      "The death toll is likely to rise as rescuers work to find survivors among the debris. Videos show people panicking in darkness after the earthquake.",
      "<p>Rescuers search for casualties in coastal city of Bogo, where power was knocked out and buildings and roads damaged</p><p>The death toll from a magnitude 6.9 earthquake that struck central Philippines has risen to 60, a civil defence official said on Wednesday.</p><p>“We are receiving additional ",
      "The 6.9-magnitude earthquake shook the province of Cebu, killing at least 26 people and injuring more than 140. Heavy rainfall has hampered rescue efforts."
    ],
    "image_url": "",
    "titles": [
      "Philippines hit by 6.9 magnitude earthquake, dozens dead",
      "Philippines earthquake: dozens dead as rescuers search through wreckage",
      "Earthquake in Philippines Kills Dozens, Officials Say"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.964,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.73,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A magnitude 6.9 earthquake hit central Philippines, affecting the province of Cebu and the coastal city of Bogo, resulting in at least 60 deaths and over 140 injuries, according to a civil defence official. The quake caused widespread power outages, building and road damage, and hampered rescue operations due to heavy rainfall. Rescuers continue to search for survivors amidst the debris.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "US President Sets Ceasefire Deadline for Hamas, Backed by Canada",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Tue, 30 Sep 2025 18:22:34 +0000",
    "source": "Al Jazeera",
    "sources": [
      "CityNews",
      "Axios",
      "Al Jazeera"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "www.aljazeera.com",
      "news.google.com"
    ],
    "snippets": [
      "US president says Hamas has &#039;three or four days&#039; to respond to his Gaza ceasefire proposal.",
      "<a href=\"https://news.google.com/rss/articles/CBMijAFBVV95cUxNd2MweHlKVzZIOXJ1SWQxYk84VTN2Q3lEOHdEeGhOc2Zsd001N1lTcVlvaVRJRmVxNlN6TGM0cGlubldsblhRbFV1VXBUeXlTQ05kcWVPazNLRDN2azBCN3REVWp0bzJ2ak9rNHlaRVN4SS1neG03X0MwVDVuV3cweWRlQXVNZ0VuZVRtVg?oc=5\" target=\"_blank\">The scramble to shape Trump's Gaza pl",
      "OTTAWA — Prime Minister Mark Carney says Canada welcomes U.S. President Donald Trump&#8217;s &#8220;historic new Middle East peace plan,&#8221; which Washington has asked Ottawa to sell to other nations. Trump&#8217;s plan to put the Gaza Strip and its 2.1 million Palestinians under an international"
    ],
    "image_url": "",
    "titles": [
      "Can Trump’s plan end the war in Gaza?",
      "The scramble to shape Trump's Gaza plan is just beginning - Axios",
      "PM Carney welcomes Trump’s peace plan proposal for Israel and Gaza"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.814,
      "consensus": 0.789,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.72,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "US President has given Hamas a deadline of \"three or four days\" to respond to his Gaza ceasefire proposal. This move is part of a broader Middle East peace plan that has received support from Canadian Prime Minister Mark Carney, who has committed to promoting the plan to other nations. The plan aims to address the long-standing conflict in the Gaza Strip, home to 2.1 million Palestinians.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: plan, support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump, Netanyahu Agree on Gaza Peace Deal; Hamas Approval Pending",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Tue, 30 Sep 2025 19:24:09 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Washington Post",
      "New York Times",
      "Al Jazeera"
    ],
    "domains": [
      "www.nytimes.com",
      "www.aljazeera.com",
      "www.washingtonpost.com"
    ],
    "snippets": [
      "Details are key in any peace agreement. Donald Trump’s 20-point plan for Gaza is notably lacking in them.",
      "The Israeli premier’s reluctance to fully withdraw troops or make way for a Palestinian state, combined with Hamas’s reluctance to disarm, may result in a fragile deal, analysts say.",
      "It would end the war and secure the release of all hostages. Hamas would give up its arms and its power, while a transitional government is set up. Hamas has not agreed and the terms will be hard for it to swallow."
    ],
    "image_url": "",
    "titles": [
      "Trump’s Gaza peace plan has 20 points but few details",
      "Netanyahu tries to sell Trump’s Gaza peace plan to a skeptical right wing",
      "Trump’s Gaza Plan: What We Know"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.832,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.71,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "US President Donald Trump and Israeli Prime Minister Benjamin Netanyahu have agreed on a new Gaza peace deal, lacking detailed information. The deal aims to end the war and secure the release of all hostages by having Hamas disarm and relinquish power for a transitional government. However, challenges arise from Netanyahu's reluctance to withdraw troops or allow a Palestinian state, and Hamas's hesitation to disarm. The outcome remains uncertain as Hamas has yet to agree to the terms.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "South African Ambassador to France Found Dead in Paris",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Tue, 30 Sep 2025 18:58:22 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Deutsche Welle",
      "New York Times",
      "Al Jazeera"
    ],
    "domains": [
      "www.nytimes.com",
      "www.aljazeera.com",
      "www.dw.com"
    ],
    "snippets": [
      "South African Ambassador Nkosinathi Emmanuel &quot;Nathi&quot; Mthethwa was found dead outside of a high-rise hotel in Paris.",
      "Ambassador Nkosinathi Emmanuel \"Nathi\" Mthethwa's body was discovered outside a Paris hotel. His death is being treated as a possible suicide, the local presecutor's office says.",
      "The police are investigating the death of the ambassador, Nkosinathi Emmanuel Mthethwa, as a possible suicide."
    ],
    "image_url": "",
    "titles": [
      "South African Ambassador to France found dead outside Paris hotel",
      "South Africa's ambassador to France found dead in Paris",
      "South African Ambassador to France Is Found Dead in Paris"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.824,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.702,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "South African Ambassador Nkosinathi Emmanuel \"Nathi\" Mthethwa was found dead outside a high-rise hotel in Paris. French authorities are investigating the circumstances of his death, with police considering it a possible suicide.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump, Netanyahu Agree on Gaza Peace Deal; Hamas Approval Pending",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Tue, 30 Sep 2025 16:24:31 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Axios",
      "The Guardian",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "news.google.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "US president says it will be &#039;a very sad end&#039; if Palestinian group does not agree to his 20-point Gaza plan.",
      "US President Donald Trump says Hamas has three or four days to respond to his proposed plan to end the war in Gaza.",
      "<a href=\"https://news.google.com/rss/articles/CBMiigFBVV95cUxOeHlpLWZjbFpUazZha2YxampoeWJfUktad1haSV9tMC1LdTZjNVdqUkR1OElXbmxkeG9uODl3MGlMUFBuTDlwQnJPbzRpMG02MGdKakVDcjUzY1RoVFFSVTlYcC1VSTl5dFYwUDNCTlVkOXZnTUJhZjRuNWxjdGJULU1MODFjRWNKaGc?oc=5\" target=\"_blank\">Qatar, Egypt and Turkey urge Hamas to ac",
      "<p>US president warns militant group will ‘pay in hell’ if it rejects the deal, which seeks to end two-year-long war</p><p>Donald Trump has given Hamas an ultimatum of “three or four days” to respond to his proposed peace and reconstruction plan in Gaza, warning the militant group would “pay in hell"
    ],
    "image_url": "",
    "titles": [
      "Trump says Hamas has ‘three or four days’ to respond to Gaza proposal",
      "Trump sets deadline for Hamas to respond to his Gaza peace plan",
      "Qatar, Egypt and Turkey urge Hamas to accept Trump's Gaza peace plan - Axios",
      "Trump gives Hamas ‘three or four days’ to respond to his peace plan for Gaza"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.781,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.7,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "US President Donald Trump and Israeli Prime Minister Benjamin Netanyahu have agreed on a new Gaza peace deal, lacking detailed information. The deal aims to end the war and secure the release of all hostages by having Hamas disarm and relinquish power for a transitional government. However, challenges arise from Netanyahu's reluctance to withdraw troops or allow a Palestinian state, and Hamas's hesitation to disarm. The outcome remains uncertain as Hamas has yet to agree to the terms.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Deepti Sharma Leads India to Win Over Sri Lanka in World Cup Opener",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 30 Sep 2025 18:22:26 GMT",
    "source": "BBC",
    "sources": [
      "Sky Sports",
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.theguardian.com",
      "www.skysports.com"
    ],
    "snippets": [
      "Watch highlights from a rain-affected opening game of the Women's World Cup as India fight back following a middle-order collapse to defeat Sri Lanka by 59 runs.",
      "<ul><li><p>India, 269-8, beat Sri Lanka, 211, by 59 runs (DLS)</p></li><li><p>Sharma scores 53 and takes three wickets in Guwahati</p></li></ul><p>Deepti Sharma impressed with bat and ball as India defeat fellow co-hosts Sri Lanka by 59 runs (Duckworth-Lewis-Stern method) in the rain-affected openin",
      "Amanjot Kaur scored her maiden Women's Cricket World Cup half-century as India began their campaign with a 59-run victory (DLS Method) over Sri Lanka in a rain-affected opening encounter in Guwahati."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/1f4d/live/3b0b7d80-9e26-11f0-b741-177e3e2c2fc7.jpg",
    "titles": [
      "India secure opening-day World Cup win over Sri Lanka",
      "Deepti Sharma leads India rally to deny Sri Lanka in Cricket World Cup opener",
      "Amanjot impresses as India beat Sri Lanka in rain-affected World Cup opener"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.797,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.696,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Deepti Sharma starred with a half-century and three wickets, leading India to a 59-run victory over Sri Lanka under the Duckworth-Lewis-Stern method in the rain-affected Women's World Cup opener in Guwahati. Amanjot Kaur also scored her maiden World Cup half-century, contributing to India's total of 269-8 before restricting Sri Lanka to 211.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump, Hegseth Urge Military to Use Cities for 'Warrior Ethos'",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Tue, 30 Sep 2025 16:06:29 GMT",
    "source": "Axios",
    "sources": [
      "Financial Times",
      "Axios",
      "Fortune"
    ],
    "domains": [
      "news.google.com",
      "fortune.com",
      "www.ft.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMiiAFBVV95cUxQcC1PNlc2cUh6ZnZCTmMwdHRYbldaRWpVU3NwTnhycElLbFZGUW1qSlFmNGpiaUtRYkNrQ1VxRW0wYUM1UFhSTXRKMllSN19RUkc2bFYtSGpjWEkyMDY1djlXRk5PWU8zWGM3cktSQUVGTmkyY0E4U2Q4NFBpRDNlZDBBV3BuMWlW?oc=5\" target=\"_blank\">Trump says military should use U.S. cities ",
      "Defence secretary Pete Hegseth also tells admirals and generals they must restore ‘warrior ethos’",
      "The military leaders sat mostly stone-faced through Trump’s politicized remarks."
    ],
    "image_url": "",
    "titles": [
      "Trump says military should use U.S. cities as \"training grounds\" - Axios",
      "Trump says US cities should be used as military ‘training grounds’",
      "Trump says U.S. cities should be ‘training grounds’ for the military to fight an ‘invasion from within’ during unusual speech to generals"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.76,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.696,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "President Trump and Defense Secretary Pete Hegseth addressed hundreds of generals and admirals, advocating for the military's use of U.S. cities to restore 'warrior ethos.' Their speeches, described as incendiary, aimed to influence military leadership amidst current U.S. political dynamics.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Jets Trim Training Camp Roster to 35, NHL Teams Adjust Lineups",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Tue, 30 Sep 2025 22:47:41 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "NHL"
    ],
    "domains": [
      "globalnews.ca",
      "news.google.com"
    ],
    "snippets": [
      "The Jets made five more cuts on Tuesday, leaving the team with 35 players left in training camp.",
      "<a href=\"https://news.google.com/rss/articles/CBMigAFBVV95cUxPVmdqV3BxUFFhTGgxNlloMEsydFUtN1FmU1gyQUJtYU56ay1RRmJsMU1DSFh1eGVDMnZ2UVp6VHdkVk1EaG5IaUJBNUhadWJqbEhCS3ZEUHAxSEphU1M5UExZTm9FTDBELTl0R0NCbk9acFk3bHpfb1ZOZ2tjOHJaWQ?oc=5\" target=\"_blank\">Flames Reduce Training Camp Roster</a>&nbsp;&nbsp;<fo",
      "<a href=\"https://news.google.com/rss/articles/CBMimgFBVV95cUxNb1VCOWRDdmpoQmtuOXA1cXJMeDEzOGFQOV94eHNrUFlxbFBwdExaZ2cxZi11YUcyalFBRV96SWMzZDFOWUEzcDY4N2RCWUVHQ1ltYXd1X3k4VkpLaVJTVXhkajZyZS1DcWJzVVZVUXdobDJNZzJidmJZRGN4Vk13eU5xVmI4ZktXd2M5bERTRnBLRUphZ1dDekdn?oc=5\" target=\"_blank\">Flyers Make Changes",
      "<a href=\"https://news.google.com/rss/articles/CBMilwFBVV95cUxNM1VTbU5xSS0xdHQzVTFfRWYyNWtIZnNlWGI4dGhIQ09NbEw4VjJ2QzJZUjF2SGh4REhFV0lueUZKa3h0SzMtWU1IWkoxdUd5V1Vlc1hLMy1GZ042dVZaQTJxMDh6Z3paMmtrMk1ZaFA0RFVmamlWLXYwOGxZdzYyNGhqdXJSLTVVaGlfS0ROVHpFd0V2MlVV?oc=5\" target=\"_blank\">LA Kings Announce Addit"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/JETS-CAMP.jpg?quality=65&strip=all",
    "titles": [
      "Winnipeg Jets trim training camp roster by 5",
      "Flames Reduce Training Camp Roster - NHL.com",
      "Flyers Make Changes to Training Camp Roster - NHL.com",
      "LA Kings Announce Additional Training Camp Roster Moves - NHL.com"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.892,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.69,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Jets have reduced their training camp roster to 35 players after making five cuts on Tuesday. This move is part of the team's preparation for the upcoming season. Meanwhile, other teams like the Flames and Flyers are also making adjustments to their training camp rosters, indicating a common practice among NHL teams as they finalize their lineups.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Kelsey Mitchell Injured in WNBA Semifinal, Out for Game",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 30 Sep 2025 23:35:09 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Yahoo Sports"
    ],
    "domains": [
      "www.sportingnews.com",
      "www.usatoday.com",
      "www.espn.com",
      "sports.yahoo.com"
    ],
    "snippets": [
      "Fever star Kelsey Mitchell suffered what appeared to be a leg injury in the third quarter of Game 5 and was quickly ruled out.",
      "Indiana Fever star Kelsey Mitchell suffered an apparent left leg injury in the third quarter of Tuesday night's decisive Game 5 of the WNBA semifinal series against the Las Vegas Aces.  Mitchell seemed to sustain the non-contact injury with 5:05 left in the period.  A stretcher was brought out, but ",
      "Kelsey Mitchell, who fueled the Indiana Fever's WNBA playoff run, is out for the final minutes of a tight Game 5 against the Las Vegas Aces.",
      "The injury-ravaged Fever saw Kelsey Mitchell go down with a scary injury in Tuesday's Game 5 against the Aces.",
      "Kelsey Mitchell was down under the basket for quite some time on Tuesday night in Las Vegas before she was helped off the court."
    ],
    "image_url": "",
    "titles": [
      "Fever's Mitchell helped off, ruled out of Game 5",
      "Fever's Kelsey Mitchell sustains apparent leg injury in Game 5 of semifinal series vs. Aces",
      "What happened to Kelsey Mitchell? Injury takes Fever star out of WNBA playoff game vs. Aces",
      "Kelsey Mitchell injury update: Latest news after Fever star helped off vs. Aces",
      "WNBA playoffs: Fever star Kelsey Mitchell helped off the floor in Game 5 vs. Aces with apparent knee injury"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.986,
      "consensus": 0.631,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.687,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Indiana Fever's Kelsey Mitchell suffered an apparent left leg injury during the third quarter of Game 5 in the WNBA semifinal against the Las Vegas Aces. The injury occurred with 5:05 left in the period, leading to Mitchell being helped off the court. She was quickly ruled out for the remainder of the game, impacting the Fever's performance in a crucial match.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "LeBron James Misses Lakers Camp Due to Nerve Irritation, Expected to Recover",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 30 Sep 2025 23:35:09 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "LeBron James was sidelined to open training camp Tuesday with what the Lakers are calling \"a little bit of nerve irritation in the glute.\"",
      "James wasn't a participant at practice but the Lakers intend to have him ready for opening night"
    ],
    "image_url": "",
    "titles": [
      "LeBron out to start camp; eyeing longer ramp-up",
      "LeBron James sidelined to start training camp: Lakers plan 'longer ramp up' for star amid glute injury"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.986,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.687,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "LeBron James missed the Lakers' opening training camp on Tuesday due to nerve irritation in his glute. Despite not practicing, the team plans for him to be ready for the season's opening night.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "49ers' Saleh Admits Misstep in Words Against Jaguars' Coach After Loss",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 30 Sep 2025 23:35:09 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "San Francisco 49ers defensive coordinator Robert Saleh told reporters on Tuesday that he \"could have found a better choice of words\" during his argument with Jacksonville coach Liam Coen on Sunday, following the Jaguars' 26-21 victory at Levi's Stadium.",
      "<p>San Francisco 49ers defensive coordinator Robert Saleh said Tuesday his choice of words was poor when he said Jacksonville coach Liam Coen&#8217;s staff was elite at sign-stealing in a legal fashion.</p>"
    ],
    "image_url": "",
    "titles": [
      "Saleh rues 'wrong choice of words' in Coen spat",
      "Saleh regrets ‘bad choice of words’ in sign-stealing comment about Jags"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.986,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.684,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "San Francisco 49ers defensive coordinator Robert Saleh admitted to poorly choosing his words during a dispute with Jacksonville coach Liam Coen after the Jaguars' 26-21 win on Sunday. Saleh had accused Coen's staff of being exceptionally good at legally stealing signs.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Kaprizov Stands Out in Wild's History Amid NHL Contract Discussions",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 30 Sep 2025 22:55:24 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "Here's how Connor McDavid, Mikko Rantanen, Kyle Connor and others should feel after the winger's new pact.",
      "<p>Over the quarter-century that covers the Minnesota Wild&#8217;s modest existence in the NHL, Kirill Kaprizov has made himself one of a kind.</p>"
    ],
    "image_url": "",
    "titles": [
      "Winners and losers of Kirill Kaprizov's NHL record-setting contract",
      "Wild sign star Kirill Kaprizov to record-setting contract extension"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.973,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.675,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Kirill Kaprizov has distinguished himself as a unique player in the Minnesota Wild's 25-year history, according to discussions around the impact of a new contract for a fellow NHL winger. This contract has implications for players like Connor McDavid, Mikko Rantanen, and Kyle Connor, suggesting a benchmark or point of comparison for their own negotiations or contracts.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "U.S. Government to Acquire 5% Stake in Lithium Americas for Nevada Project",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Wed, 01 Oct 2025 01:10:34 GMT",
    "source": "CNBC",
    "sources": [
      "TechCrunch",
      "CNBC"
    ],
    "domains": [
      "techcrunch.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "U.S. Energy Secretary Chris Wright told Bloomberg TV that the U.S. government will take a 5% stake in the company.",
      "The U.S. Department of Energy has taken equity stakes in Canadian company Lithium Americas and its Nevada mining joint venture with General Motors as part of a renegotiation of a federal loan. Under the new terms, the U.S. government will take a 5% equity ownership in Lithium Americas and a 5% owner"
    ],
    "image_url": "",
    "titles": [
      "Lithium Americas stock pops 35% as government takes a stake to boost Nevada project",
      "U.S. government takes stake in Canadian lithium miner and its Nevada mining project"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.918,
      "consensus": 0.591,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.659,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The U.S. government has agreed to acquire a 5% stake in Lithium Americas Corp., as announced by Energy Secretary Chris Wright. This move supports the Canadian company's development of the Thacker Pass lithium project in Nevada, aiming to boost lithium production.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: development, support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Kaprizov Signs Record $136M, 8-Year Deal with Minnesota Wild",
    "domain": "business",
    "source_domain": "www.forbes.com",
    "location": "global",
    "published": "Tue, 30 Sep 2025 23:25:59 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes",
      "Sportsnet"
    ],
    "domains": [
      "www.forbes.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Why Kirill Kaprizov’s 8-year, $136M contract with the Wild reset the free agent market, establishing a new standard that will shape negotiations for years to come.",
      "<p>Kirill Kaprizov&#8217;s long-term extension with the Minnesota Wild set a new benchmark in a few ways for this year&#8217;s pending UFAs, and those to come in years ahead.</p>"
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/68dc9e8e422d1ce46f45bc62/0x0.jpg?width=960",
    "titles": [
      "Wild In Multiple Ways: How Kirill Kaprizov’s Deal Reshapes The Market",
      "Cap comparables: How Kirill Kaprizov’s contract begins to reset the market"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.983,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.652,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Kirill Kaprizov signed an 8-year, $136M contract with the Minnesota Wild, setting a new benchmark in the NHL's free agent market. This deal is expected to influence future negotiations for upcoming unrestricted free agents (UFAs), establishing a new standard for long-term contracts in the league.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Queensland Extends Coal Plant Operations, One to Close Early",
    "domain": "business",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Wed, 01 Oct 2025 03:27:17 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "Financial Post"
    ],
    "domains": [
      "www.theguardian.com",
      "financialpost.com"
    ],
    "snippets": [
      "<p>Crisafulli government wants coal plants to run longer – reversing previous Queensland Labor government’s plans to end reliance on coal power by 2035</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/oct/01/australia-news-live-nicole-kidman-divorce-keith-urban-sussan-ley-",
      "One of Australia’s biggest coal-fired power plants is set to close six years earlier than previously announced."
    ],
    "image_url": "https://i.guim.co.uk/img/media/7c50f66ecad91ba3ef219fda1dd6b9c70377143e/170_0_3241_2592/master/3241.jpg?width=140&quality=85&auto=format&fit=max&s=862b713b41d45582ba91e2770471ad83",
    "titles": [
      "Queensland’s biggest coal-fired power station could close six years early",
      "Major Australian Coal-Fired Station Gladstone Set to Close Six Years Early"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.963,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.648,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Crisafulli government in Queensland, Australia, aims to extend the operation of coal plants beyond the former Labor government's 2035 deadline for ending coal power reliance. Meanwhile, one of Australia's largest coal-fired power stations is now scheduled to close six years ahead of its initial timeline.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Scientists Develop Technique to Create Eggs from Skin Cells for Infertility Trea",
    "domain": "science",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 30 Sep 2025 15:01:42 GMT",
    "source": "BBC",
    "sources": [
      "Wired",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.wired.com"
    ],
    "snippets": [
      "US scientists testing the technique say it could help people overcome infertility and potentially allow same-sex couples to have a genetically related child.",
      "The embryos weren’t used to try to establish a pregnancy, but the researchers behind the technique say it could one day be used to address infertility."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/19ca/live/e7051760-9dd9-11f0-9f23-2534d63ace40.jpg",
    "titles": [
      "Scientists make embryos from human skin DNA for first time",
      "Scientists Made Human Eggs From Skin Cells and Used Them to Form Embryos"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.743,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.604,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Scientists have developed a technique to create eggs from the DNA of adult skin cells, offering a potential future treatment for infertility. This method could also enable gay couples to have genetically related children. However, the embryos created were not used to attempt pregnancy. The researchers believe this approach could one day help address infertility issues.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]