[
  {
    "title": "Israel Airstrike Targets Hamas Leaders in Qatar, Sparks International Criticism",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Tue, 09 Sep 2025 09:47:50 -0400",
    "source": "NPR",
    "sources": [
      "Financial Times",
      "Bloomberg",
      "New York Times",
      "NPR",
      "Global News",
      "Al Jazeera",
      "LA Times",
      "ABC News",
      "CNBC",
      "Deutsche Welle"
    ],
    "domains": [
      "www.ft.com",
      "www.dw.com",
      "www.cnbc.com",
      "www.nytimes.com",
      "www.latimes.com",
      "globalnews.ca",
      "news.google.com",
      "www.aljazeera.com",
      "www.npr.org",
      "abcnews.go.com"
    ],
    "snippets": [
      "The Israeli military says it carried out an airstrike in the capital of Qatar targeting senior leaders of Hamas, prompting strong criticism from the country that's been a key mediator.",
      "Spokesperson for Qatar’s foreign ministry slams ‘criminal’ Israeli attack, condemns it &#039;in the strongest terms&#039;.",
      "The Israeli military says it attacked Hamas' leadership in Qatar's capital, Doha, where the militant group's political leaders and negotiators are based. Follow DW for more",
      "The strike took place in Doha, according to the Ministry of Foreign Affairs, which condemned the attack.",
      "The U.S. Embassy in Doha issued a shelter-in-place order at its facilities in response to reports of the Israeli strike on Hamas leaders in the capital city.",
      "Explosions heard as political leadership of Palestinian militant group targeted in Gulf state for first time",
      "The Gulf nation of Qatar has been trying to negotiate a cease-fire in the conflict. The attack threatened to destabilize those peace efforts.",
      "Hamas’ exiled leadership has long been based in Qatar, which has served as a mediator in talks between Hamas and Israel for several years.",
      "<a href=\"https://news.google.com/rss/articles/CBMilgFBVV95cUxPT0Y0Zy1nS21zUVR0NkNwczEtYjZaUkhaWHhLQ3VPTlBYdWloaDFVTU1BTUlIcjBST2JTN2V0Ymozc2F6UHJpcTU2ZFpJNV9yZVllekZvY05NOWZfQzVVZE1pXzM1X1VqSWN3ZjVCQUFnbER1Qm9MRWlvSE02NkJpU1RuQjNTajhZQzNlSnJfX24yLVRPanc?oc=5\" target=\"_blank\">Israel Says It Conducted",
      "<p>Israel launched attack on Hamas leadership in Doha, the capital of Qatar.</p>"
    ],
    "image_url": "",
    "titles": [
      "Israel says it targeted senior Hamas leaders in a strike in Qatar",
      "Israeli military says it attacked Hamas leaders in Qatar’s Doha",
      "Israeli military strikes Hamas leaders in Qatar",
      "Israel conducts 'precise strike' on Hamas leadership in Qatar: Officials",
      "Israel targets top Hamas officials in Qatar strike",
      "Israel launches attack on Hamas in Qatar",
      "Israel Targeted Hamas Leadership in Qatar Strike",
      "Israel says it targeted Hamas leadership in Qatar, explosions heard in Doha",
      "Israel Says It Conducted a ‘Precise Strike’ on Hamas Leadership - Bloomberg.com",
      "Israeli military extends regional campaign with strike on Hamas in Qatar"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.949,
      "consensus": 1.0,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.875,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Israel conducted an airstrike in Doha, Qatar, targeting senior Hamas leaders, sparking criticism from Qatar, which condemned the attack as 'criminal' and a threat to peace efforts. The U.S. Embassy in Doha responded with a shelter-in-place order. This action marks a significant escalation, as Hamas' exiled leadership, involved in long-standing negotiations with Israel facilitated by Qatar, was targeted.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Nepal PM Resigns Amid Protests Over Social Media Ban and Corruption Allegations",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Tue, 09 Sep 2025 01:15:16 -0400",
    "source": "NPR",
    "sources": [
      "Washington Post",
      "TechCrunch",
      "New York Times",
      "NPR",
      "The Guardian",
      "Global News",
      "Al Jazeera",
      "Deutsche Welle"
    ],
    "domains": [
      "www.dw.com",
      "www.nytimes.com",
      "globalnews.ca",
      "www.aljazeera.com",
      "www.theguardian.com",
      "www.npr.org",
      "techcrunch.com",
      "www.washingtonpost.com"
    ],
    "snippets": [
      "Nepal's prime minister resigned Tuesday following violent protests against a ban on social media platforms and government corruption.",
      "Nepal’s Prime Minister Khadga Prasad Sharma Oli has resigned, says his aide, after ministers quit over the mass",
      "Protests continued in Kathmandu on Tuesday despite the lifting of a social media ban, with the houses of several senior politicians reportedly set on fire. Prime Minister KP Sharma Oli has resigned.",
      "<p>KP Sharma Oli resigns as police meet protests with deadly force, leaving 19 dead, and federal parliament is set alight </p><p>Nepal’s prime minister has resigned after some of the worst unrest in decades rocked the country this week, set off by a ban on social media and discontent at political co",
      "K.P. Sharma Oli stepped down hours after a ban on social media was overturned, amid demonstrations dubbed “Gen Z protests” due to the youth of many participants.",
      "The demonstrations in Nepal over government corruption and restrictions to apps such as WhatsApp and Facebook were driven by widespread anger among young people.",
      "A day after violent clashes left at least 19 people dead, Prime Minister K.P. Sharma Oli and other ministers quit, with no clear path to assuaging young protesters in the capital.",
      "As the protests against a social media ban in Nepal intensified, Prime Minister Khadga Prasad Oli said he was stepping down immediately.",
      "Nepal has reversed its social media ban following nationwide “Gen Z” protests and public backlash."
    ],
    "image_url": "",
    "titles": [
      "Nepal's prime minister resigns after protests against corruption and social media ban",
      "Nepal prime minister resigns after mass protests and deaths",
      "Nepal PM resigns as anti-corruption protests escalate",
      "Nepal prime minister quits after deaths at protests sparked by social media ban",
      "Nepal’s prime minister resigns after deadly protests over social media ban",
      "At least 19 killed, hundreds injured in protests after Nepal social media ban",
      "Nepal’s Prime Minister Resigns as Protesters Set Fire to Leaders’ Houses",
      "Nepal prime minister resigns after 19 killed in protest crackdown",
      "Nepal reverses social media ban as protests turn deadly"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.794,
      "consensus": 1.0,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.844,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Nepal's Prime Minister K.P. Sharma Oli resigned after widespread protests sparked by a social media ban and allegations of government corruption. The demonstrations, largely driven by the country's youth, continued even after the ban was lifted, leading to violent clashes that resulted in at least 19 deaths. The unrest, one of the worst in decades, also saw the federal parliament and the homes of several politicians set on fire. Oli's resignation came in the wake of his cabinet members quitting and no immediate solution to the crisis.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: solution",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Record Downward Revision: U.S. Economy Added 911K Fewer Jobs in 2024-2025",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Tue, 09 Sep 2025 15:22:30 GMT",
    "source": "Axios",
    "sources": [
      "ABC News",
      "MarketWatch",
      "Axios",
      "Forbes"
    ],
    "domains": [
      "news.google.com",
      "www.marketwatch.com",
      "www.forbes.com",
      "abcnews.go.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMia0FVX3lxTE9NMEN1R3lpenhzMlNtVWJMWVpSYTExUWdOSW53cnBhTzV6MHAzcHgxWV9NWks2UHdQQl9WVE1wcnhfeko4TU5jVVhSbXp3dFo1UFFNOXZ4c3VhMEJZb29wVzJibTZaWTRFdktJ?oc=5\" target=\"_blank\">U.S. added 911,000 fewer jobs than first estimated in 2024-2025, BLS says</a>&nbsp;",
      "The downward revision appears to be the largest ever recorded.",
      "President Donald Trump criticized job reports featuring downward revisions in recent months.",
      "The economy created 911,000 few jobs in the waning months of the Biden presidency and early stages of the Trump administration, indicating the labor market began to weaken much sooner than previously reported."
    ],
    "image_url": "",
    "titles": [
      "U.S. added 911,000 fewer jobs than first estimated in 2024-2025, BLS says - Axios",
      "US economy added 911,000 fewer jobs than previously reported",
      "US Added Nearly A Million Fewer Jobs Than Reported",
      "Economy created 911,000 fewer jobs in 2024-25 than reported. It’s more ammo for Fed rate cut."
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.96,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.781,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The U.S. Bureau of Labor Statistics (BLS) reported that the economy added 911,000 fewer jobs than initially estimated in 2024-2025, marking the largest downward revision on record. This correction indicates that the labor market began to weaken earlier than previously thought, during the late Biden presidency and into the Trump administration. President Trump has criticized recent job reports featuring such downward revisions.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Israeli Military Targets Hamas Leaders in Doha Strikes",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Tue, 09 Sep 2025 14:14:20 +0000",
    "source": "Al Jazeera",
    "sources": [
      "ABC News",
      "Washington Post",
      "Al Jazeera"
    ],
    "domains": [
      "www.washingtonpost.com",
      "www.aljazeera.com",
      "abcnews.go.com"
    ],
    "snippets": [
      "The Israeli military said it carried out ‘targeted strikes’ on Hamas officials in Doha.",
      "Israel has conducted a precise strike in Doha targeting senior Hamas leadership, according to separate statements from the Israel Defense Forces and Qatar's Ministry of Foreign Affairs.",
      "The IDF said Tuesday that it carried out a strike targeting Hamas senior leadership. Qatar’s Foreign Ministry confirmed an attack on Hamas political leaders in Doha."
    ],
    "image_url": "",
    "titles": [
      "Video: Explosions in Doha after Israel ‘targets Hamas’ leadership",
      "WATCH:  Explosions in Qatar as IDF targets Hamas leadership",
      "Live updates: Israel’s attack in Qatar targets senior Hamas leadership"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.957,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.742,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Israeli military executed targeted strikes on senior Hamas officials in Doha, as confirmed by both the Israel Defense Forces and Qatar's Ministry of Foreign Affairs. These operations specifically aimed at the leadership of Hamas.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Flotilla Ship Hit by Drone in Tunisia, Mission to Gaza Continues",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Tue, 09 Sep 2025 13:57:34 +0000",
    "source": "Al Jazeera",
    "sources": [
      "New York Times",
      "The Guardian",
      "Al Jazeera"
    ],
    "domains": [
      "www.nytimes.com",
      "www.aljazeera.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Activists on the Global Sumud Flotilla to Gaza say their main vessel was hit by a drone attack in Tunisia.",
      "<p>Global Sumud Flotilla shares video showing vessel being hit by flaming object at port, but says its mission will go ahead</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/sep/09/israel-gaza-city-evacuation-order-idf-military-offensive-live-updates-middle-east-crisis-latest-news\"",
      "The Global Sumud Flotilla planned to use the ship and others to bring humanitarian goods to Gaza."
    ],
    "image_url": "",
    "titles": [
      "What we know about Gaza flotilla ‘drone attack’",
      "Greta Thunberg flotilla says Gaza aid boat hit by drone attack in Tunisia",
      "Gaza-Bound Flotilla Struck by Drone in Tunisia, Aid Group Says"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.952,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.727,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Activists from the Global Sumud Flotilla reported their main vessel was struck by a drone in Tunisia. A video shared by the group shows the ship being hit by a flaming object while docked. Despite the attack, the flotilla, which aims to deliver humanitarian goods to Gaza, affirmed their mission will proceed.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "House Democrats Release Trump's Alleged Epstein Birthday Message Photo",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Tue, 09 Sep 2025 01:52:30 GMT",
    "source": "Axios",
    "sources": [
      "The Guardian",
      "CNBC",
      "Axios"
    ],
    "domains": [
      "www.theguardian.com",
      "news.google.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMijwFBVV95cUxONHJIWWJzekFWT3BfNWhqTTJUZUVXOE5zbExkeHZoWUdYZHJfanUtektMVFRZbWlHVzgtLURtTkM2T0ppa29oVWNSb1Rkeklka0lyeC1TdElyOXgycVc2WEMyWFBjdXlzSExVZUNZMGdWMlJ1eV8wRWFxRkdYZ2VTQTZGTHFmYTczenFnWHpSZw?oc=5\" target=\"_blank\">House Democrats post 2nd Epstein ",
      "<a href=\"https://news.google.com/rss/articles/CBMiekFVX3lxTE9tX3lhTF9FR1B4SFNDc1VnNmtWUXB3VXl4REZOUnZmM1pqSDd2d3EtLW9vRkM3WlR6Yi0zUk5NLTRXdmgxMmp1cGpYcUptMVNfblhVTUt6UTJ5WlRmM1BtWVY2dTBTY2tIa21QZXJfaFlHenBvbWY2MzJB?oc=5\" target=\"_blank\">MAGA claims Trump signature in Epstein birthday book is fake</a",
      "<a href=\"https://news.google.com/rss/articles/CBMigwFBVV95cUxPYWtsR2xIUW1aaVE0QkVDVUF1VkdodnFHTC1nY2xBdnUydlh2WUFoYjdKLVh2WGhBemJQSUI0ZWJwLWJoV0hEUUxpZzlIQU15TmFXcE5KaThDQVg2clBZM0tyaTlzOTJac3Z2R2pHRmhxaUZpUlA3Qm5EYUViRHVQMWVfYw?oc=5\" target=\"_blank\">House panel releases birthday book and other reco",
      "<a href=\"https://news.google.com/rss/articles/CBMihwFBVV95cUxQNGp4U3EwY3A3VkdiaVUySWxidmFHeEtHcGFzNW5DWGVERUpuc2RPNGxFeEtGX3BpVkVIM182d1hwcWJZeVJlclZLV29nSUQyWE5WVkR1Ny1mRlhfM243X2ZhMVdTZWlab1hqNDNxRXBVTkhLMGEyWFlfMkZvblZGUTd5T2dILW8?oc=5\" target=\"_blank\">Trump's alleged drawing in Epstein birthday ",
      "<a href=\"https://news.google.com/rss/articles/CBMikgFBVV95cUxPVjFnbVptdExuSDkwdWRsV1oxeW1uSTVlb2dZbDliWHNwSEczTEdFM01UNnU4cTFEUkFSYUVsdmdqb0FvT3JkTjllMFZLblowSlowWm1wRTZIcWpBYzdSMlNzNUdmYmNRT180YmFWbmk0ODVVUnZ0cEMtNWY3Y0ZuT215YlM2V2NVYmM2ZzlkZE5DZw?oc=5\" target=\"_blank\">House Oversight Committee rec",
      "President Donald Trump sued The Wall Street Journal for defamation over its report revealing the existence of the letter to Jeffrey Epstein.",
      "<p>Several Trump allies including Charlie Kirk, Laura Loomer and Karoline Leavitt push back on alleged note Trump wrote to Epstein for his 50th birthday</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/2025/sep/09/trump-epstein-photo-check-woman\">Photo of novelty check suggests Epstein ‘so",
      "<p>House oversight committee posts images of greeting from president to sex offender in 50th birthday album</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/2025/sep/09/president-trump-administration-news-updates-today\">Trump news at a glance: Epstein case haunts Trump as alleged birthday "
    ],
    "image_url": "",
    "titles": [
      "House Democrats post 2nd Epstein birthday book page referencing Trump - Axios",
      "MAGA claims Trump signature in Epstein birthday book is fake - Axios",
      "House panel releases birthday book and other records from Epstein estate - Axios",
      "Trump's alleged drawing in Epstein birthday book released by House Democrats - Axios",
      "House Oversight Committee receives Epstein birthday book - Axios",
      "Trump Epstein letter and drawing from 'birthday book' released",
      "Maga loyalists claim Trump note to Epstein is ‘fake’ after House committee releases images of ‘birthday book’ – live",
      "Release of sexually suggestive Epstein ‘birthday book’ piles pressure on Trump"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.725,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.689,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Democrats on the House Oversight Committee published a photo of a birthday message allegedly signed by Donald Trump to Jeffrey Epstein, which Trump had previously denied existed. The White House and Trump's press secretary claim he did not create or sign the drawing. Following the Wall Street Journal's report on the letter, Trump sued the publication for $10 billion for defamation. The image was released after a subpoena was issued for information from Epstein's estate.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Ryan Staub Named Starting QB for Buffaloes Against Houston",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 9 Sep 2025 11:40:04 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "The Colorado Buffaloes are expected to start Ryan Staub at quarterback for Friday's game at Houston, sources told ESPN.",
      "Staub impressed in Colorado's Week 2 win against Delaware and earned a bigger opportunity"
    ],
    "image_url": "",
    "titles": [
      "Sources: Colorado expected to start Staub at QB",
      "Colorado to start QB Ryan Staub in Week 3 Big 12 opener against Houston, per report"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.986,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.684,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Ryan Staub is set to start as quarterback for the Colorado Buffaloes in their upcoming game against Houston, following his noteworthy performance in the team's Week 2 victory over Delaware. This decision was reported by sources to ESPN.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Tyreek Hill's Estranged Wife Accuses Him of Domestic Violence in Divorce Filings",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 9 Sep 2025 11:40:04 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Tyreek Hill's estranged wife has alleged in court filings that he committed domestic violence, which the Dolphins receiver has vehemently denied.",
      "Keeta Vaccaro alleged eight instances of domestic violence in court filings related to divorce proceedings"
    ],
    "image_url": "",
    "titles": [
      "Dolphins star Hill accused of domestic violence",
      "Tyreek Hill accused of multiple instances of domestic violence in court filings by estranged wife"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.986,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.677,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Tyreek Hill's estranged wife, Keeta Vaccaro, has accused him of domestic violence in eight instances within divorce proceedings, according to court filings. Hill, a Dolphins receiver, has strongly denied these allegations.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "J.J. McCarthy Leads Historic NFL Debut Comeback, Vikings Beat Bears 27-24",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 9 Sep 2025 11:40:04 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "In thrilling fashion Monday night, Minnesota quarterback J.J. McCarthy authored a late comeback, becoming the first quarterback in NFL history to account for three touchdowns in the fourth quarter of his NFL debut, as the Vikings outlasted the Bears.",
      "J.J. McCarthy struggled early, but his run game helped spur a come-from-behind win over the Bears.",
      "<p>J.J. McCarthy threw two fourth-quarter touchdown passes and ran for another in his long-awaited NFL debut, and the Minnesota Vikings rallied for a season-opening 27-24 win over the Chicago Bears on Monday night.</p>"
    ],
    "image_url": "",
    "titles": [
      "McCarthy rallies Vikings in 4th quarter of debut",
      "McCarthy, Vikings spoil Ben Johnson's Bears debut",
      "J.J. McCarthy takes over late in debut as Vikings best Bears in opener"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.986,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.677,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "In his NFL debut, J.J. McCarthy led a remarkable fourth-quarter comeback, scoring three touchdowns to secure a 27-24 victory for the Minnesota Vikings against the Chicago Bears. This made him the first quarterback in NFL history to achieve such a feat in his debut. The game, held at Soldier Field, saw the Bears lose a third-quarter lead in their first regular-season game under coach Ben Johnson, ending in a thrilling 27-24 win for the Vikings.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "NFL Teams Inspired by Hunter's Dual-Role; Eye 2028 QB Prospect",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 9 Sep 2025 11:32:28 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "There won't be another player like Hunter. But his play has inspired other teams to look for two-way stars.",
      "An early look at a top-flight QB prospect in the 2028 NFL Draft class?"
    ],
    "image_url": "",
    "titles": [
      "Travis Hunter effect is alive in the 2025 college football season",
      "10 college football transfers turning heads early in the 2025 season"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.984,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.677,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Hunter's unique two-way playing style has influenced other NFL teams to seek similar versatile players. Additionally, attention is turning towards a promising quarterback prospect for the 2028 NFL Draft.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "U.S. Job Growth Revised Down by 900,000 in Latest Labor Report",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Tue, 09 Sep 2025 10:25:54 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "Financial Times"
    ],
    "domains": [
      "www.npr.org",
      "www.ft.com"
    ],
    "snippets": [
      "The U.S. likely added 900,000 fewer jobs in the 12 months ending in March than had been reported, according to a preliminary Labor Department report.",
      "Updated figures from Bureau of Labor Statistics are based on more comprehensive employment data"
    ],
    "image_url": "",
    "titles": [
      "BLS revision shows hiring was overstated by 911,000 jobs in past year",
      "US hiring growth revised down by 911,000 jobs in year to March"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.961,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.672,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The U.S. added approximately 900,000 fewer jobs in the year ending in March than previously reported, based on a preliminary report from the Labor Department. This update comes from the Bureau of Labor Statistics, which utilized more comprehensive employment data for its revision.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Final NFL Power Rankings: Top 13 Teams as Season Ends",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 9 Sep 2025 09:55:22 EST",
    "source": "ESPN",
    "sources": [
      "Sports Illustrated",
      "ESPN"
    ],
    "domains": [
      "news.google.com",
      "www.espn.com"
    ],
    "snippets": [
      "The hottest team and the top team aren't the always same. See our final 1-13 as the regular season wraps.",
      "<a href=\"https://news.google.com/rss/articles/CBMilwFBVV95cUxNcEZuakh3RzdBcHByZ2dMdmZ3UE5CRzdySFA3TGlhMk42YjNmbEhoR2xiOHBYMXh4ZVUxVGZHTEVTSUpTdE5SZFVDZk04NUwyRHRmX0s2YURkNmcyXzZycnBBZGU2SEtCbHlQY2RYUEU4YzBfNHRYbkpRdEMzaEt6NjBjclpTYmxUdk1fRWxLelFXVjFWdERz?oc=5\" target=\"_blank\">NFL Power Rankings: Rav"
    ],
    "image_url": "",
    "titles": [
      "WNBA Power Rankings: A new No. 1 -- and highlights for every team in final edition",
      "NFL Power Rankings: Ravens’ Collapse Produces New No. 1 Team - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.951,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.67,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The final NFL Power Rankings for the regular season have been published, ranking teams from 1 to 13. This list indicates that the team with the best record isn't necessarily considered the \"hottest\" or in the best form as the season concludes. The rankings provide a snapshot of team performance and momentum heading into the postseason.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Russia's Nightly Attacks on Ukraine Kill Hundreds, Zelensky Calls for Action",
    "domain": "general",
    "source_domain": "www.washingtonpost.com",
    "location": "global",
    "published": "Tue, 09 Sep 2025 15:00:11 +0000",
    "source": "Washington Post",
    "sources": [
      "New York Times",
      "Washington Post"
    ],
    "domains": [
      "www.nytimes.com",
      "www.washingtonpost.com"
    ],
    "snippets": [
      "Since June, Russia has attacked Ukrainian cities nightly, launching at times hundreds of attack drones and dozens of missiles, and killing hundreds of civilians.",
      "President Volodymyr Zelensky said that the strike on older people picking up their pensions should prompt a global response."
    ],
    "image_url": "",
    "titles": [
      "Russia strikes eastern Ukraine village, killing 23, many retirees",
      "Russian Bomb Hits Crowd of Retirees, Killing at Least 23, Ukraine Says"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.973,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.664,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Since June, Russia has launched nightly attacks on Ukrainian cities, using hundreds of drones and dozens of missiles, resulting in the deaths of hundreds of civilians. President Volodymyr Zelensky highlighted a strike on elderly individuals collecting pensions as necessitating a global response.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "J.J. McCarthy Bounces Back from Tough NFL Debut, Earns Team Praise",
    "domain": "business",
    "source_domain": "www.forbes.com",
    "location": "global",
    "published": "Tue, 09 Sep 2025 09:53:30 -0400",
    "source": "Forbes",
    "sources": [
      "Sports Illustrated",
      "Forbes"
    ],
    "domains": [
      "news.google.com",
      "www.forbes.com"
    ],
    "snippets": [
      "J.J. McCarthy was not about to accept defeat. After looking like an overmatched rookie in his NFL regular-season debut and throwing a pick-six, he rose to the occasion.",
      "<a href=\"https://news.google.com/rss/articles/CBMihAFBVV95cUxOTzY3RnRrV2FSckFOQ2ZwU2hOaDFvWVhhOHNDck5QQ3k3VE5XazctNEJLZTBQYzh4SWdYM2Z5V0lqUjdLRXR3NHRnRzNYY1ZxS2t0SUc2WDB2RXRtbmN5MXdMT0ljckVmcm9WbUYwVzRsaWVzQUNJUFlvRFBqRi1oVTVZeEM?oc=5\" target=\"_blank\">Vikings Locker Room Went Nuts for J.J. McCarthy "
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/68c02fc89283bcfc1f42a785/0x0.jpg?width=960",
    "titles": [
      "Vikings Storm Back In 4th, Pay Off O’Connell’s Faith In J.J. McCarthy",
      "Vikings Locker Room Went Nuts for J.J. McCarthy After Kevin O'Connell's Fiery Speech - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.951,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.662,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "J.J. McCarthy, after a challenging NFL debut where he threw a pick-six, significantly improved his performance. His resilience was celebrated in the Vikings' locker room, indicating a strong comeback and positive team support despite initial difficulties.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "U.S. Informed Before Israel's Strike on Hamas in Qatar, Source Says",
    "domain": "general",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Tue, 09 Sep 2025 15:05:28 GMT",
    "source": "The Guardian",
    "sources": [
      "CityNews",
      "The Guardian"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "www.theguardian.com"
    ],
    "snippets": [
      "<p>Israeli officials say US notified before attack, which Doha calls cowardly and a flagrant violation of international law</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/sep/09/israel-gaza-city-evacuation-order-idf-military-offensive-live-updates-middle-east-crisis-latest-news\">",
      "DUBAI, United Arab Emirates (AP) — The U.S. had some forewarning that Israel intended to carry out the strike on Hamas in Qatar, according to a person familiar with the matter who was not authorized to comment publicly about the sensitive matter. Pentagon officials referred questions about coordinat"
    ],
    "image_url": "https://i.guim.co.uk/img/media/52c59e33ee6f6f589155fd0f5fe6e097a37a68bc/125_0_3722_2978/master/3722.jpg?width=140&quality=85&auto=format&fit=max&s=846e55009a8dd32e8c7887c83b7d41de",
    "titles": [
      "Israel launches airstrikes against top Hamas members in Qatar for Gaza ceasefire talks",
      "Israeli strike targets Hamas leaders in US-allied Qatar as they weigh Gaza ceasefire proposal"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.955,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.66,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The U.S. was informed before Israel conducted a strike on Hamas in Qatar, described by Doha as a cowardly act and a violation of international law. This information comes from a source familiar with the situation but not authorized to speak publicly. The Pentagon has not commented on the matter.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Johnson Criticized for Key Error Well Before Bears' Loss Finale",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Tue, 09 Sep 2025 15:54:27 +0000",
    "source": "CBS Sports",
    "sources": [
      "Yahoo Sports",
      "CBS Sports"
    ],
    "domains": [
      "sports.yahoo.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Johnson mismanaged the end of Chicago's Week 1 loss to the Vikings in more ways than one",
      "Johnson is taking heat for what happened in the final two minutes of the Bears loss to the Vikings, but the real error came 20 minutes earlier."
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/09/6592bf89-18ff-4623-b519-2500d8df48b6/john.jpg",
    "titles": [
      "How Ben Johnson bungled the end of Bears coaching debut with timeout usage and kickoff decision",
      "Bears' Ben Johnson stumbled in his head coaching debut, yes, but so did his players"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.991,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.653,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Johnson faced criticism for poor management during the final moments of the Bears' Week 1 loss to the Vikings. However, analysis suggests his significant mistake occurred 20 minutes before the game's conclusion. Critics are focusing on his decisions towards the end, but the earlier error had a more impactful role in the loss.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Jaguars Climb ESPN Power Rankings After Week 1 Victory",
    "domain": "sports",
    "source_domain": "jaguarswire.usatoday.com",
    "location": "national",
    "published": "Tue, 09 Sep 2025 15:53:53 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Bleacher Report",
      "Yahoo Sports"
    ],
    "domains": [
      "jaguarswire.usatoday.com",
      "news.google.com"
    ],
    "snippets": [
      "After a Week 1 win, where do the Jacksonville Jaguars now land in ESPN's latest power rankings?",
      "<a href=\"https://news.google.com/rss/articles/CBMiiAFBVV95cUxOb2RPT0ZSR0c3STRLYkh4RGtkeHd1MU8yZW5LaW1yTms4cFk2X2dpVWIxczVuTVBjZWpyTHFheVZGbUdpNDJQNmJfWlVEaElMb204anNVWkJyaUZURnVwNWNKU2NSOXF5RUp2Mk5meHYyUi0xdkp6NDN0eFhkMEZDUTlYMjQ0Q0FS?oc=5\" target=\"_blank\">B/R Experts' Week 2 NFL Power Rankings</a>&"
    ],
    "image_url": "",
    "titles": [
      "Where do Jaguars land in Week 2 power rankings after 1-0 start?",
      "B/R Experts' Week 2 NFL Power Rankings - Bleacher Report"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.991,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.653,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Following their Week 1 win, the Jacksonville Jaguars have moved up in ESPN's latest power rankings. The team's performance has earned them a higher position in the rankings, reflecting their strong start to the season.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Russian Strike Kills 24 Civilians in Ukraine; Zelenskyy Seeks Stronger Response",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Tue, 09 Sep 2025 10:08:57 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Financial Post",
      "Al Jazeera"
    ],
    "domains": [
      "financialpost.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "&#039;The Russians continue to destroy lives but avoid new strong sanctions,&#039; President Zelenskyy says.",
      "A Russian strike killed at least 24 people as they collected pension payments in eastern Ukraine, prompting Ukrainian President Volodymyr Zelenskiy to renew calls on the US and Western allies to respond to a spike in attacks on civilians."
    ],
    "image_url": "",
    "titles": [
      "At least 21 civilians killed in Russian attack in eastern Ukraine’s Donetsk",
      "Zelenskiy Says At Least 20 Killed in Russian Strike on Donetsk Town"
    ],
    "score_components": {
      "magnitude": 0.795,
      "recency": 0.879,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.652,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A Russian strike in eastern Ukraine killed at least 24 civilians at a pension payment collection point. Ukrainian President Zelenskyy has called on the US and Western allies for a stronger response to the increasing attacks on civilians, criticizing the lack of new, strong sanctions against Russia.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Macron to Appoint New PM After Government Collapse",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Tue, 09 Sep 2025 12:00:47 GMT",
    "source": "CNBC",
    "sources": [
      "New York Times",
      "CNBC"
    ],
    "domains": [
      "www.nytimes.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "CNBC takes a look at what could happen next in France after the ousting of yet another prime minister.",
      "President Emmanuel Macron said he would appoint a new prime minister, the fifth in less than two years, after the government collapsed in a no-confidence vote."
    ],
    "image_url": "",
    "titles": [
      "France's political crisis deepens as another PM is axed: Here's what happens next",
      "France’s Political Crisis"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.895,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.651,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Following the collapse of the French government due to a no-confidence vote, President Emmanuel Macron announced plans to appoint a new prime minister, marking the fifth appointment in less than two years.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Perseverance Rover Explores Boulders Near Soroya Ridge on Mars",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Tue, 09 Sep 2025 11:20:03 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org",
      "NASA"
    ],
    "domains": [
      "phys.org",
      "science.nasa.gov"
    ],
    "snippets": [
      "Last week, the Perseverance rover began an exciting new journey. Driving northwest of the Soroya ridge, Perseverance entered an area filled with a diverse range of boulders that the science team believes could hold clues to Mars's early history.",
      "Written by By Henry Manelski, Ph.D. student at Purdue University Last week, the Perseverance rover began an exciting new journey. Driving northwest of the Soroya ridge, Perseverance entered an area filled with a diverse range of boulders that the science team believes could hold clues to Mars’ early"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/perseverance-meets-the.jpg",
    "titles": [
      "Perseverance meets the megabreccia",
      "Perseverance Meets the Megabreccia"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.98,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.651,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Perseverance rover embarked on a new exploration northwest of the Soroya ridge last week, entering a region rich with diverse boulders. Scientists believe this area could reveal significant insights into Mars' early history.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Nepal Faces Turmoil as PM Resigns After Clashes and Protests",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-09-09T15:04:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "New York Times",
      "Deutsche Welle"
    ],
    "domains": [
      "www.dw.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "Nepal could face prolonged political and constitutional chaos unless there's an agreement to form a national unity government, say experts.",
      "A day after violent clashes left at least 19 people dead, young demonstrators defied a curfew and targeted symbols of the governing elite. Prime Minister K.P. Sharma Oli and other ministers resigned as security chiefs pleaded for calm."
    ],
    "image_url": "",
    "titles": [
      "What's next for Nepal after deadly protests force PM out?",
      "Live Updates: Parliament Burns in Nepal as Protests Force Prime Minister to Quit"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.974,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.65,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In Nepal, experts warn of potential political and constitutional turmoil without a national unity government. Following violent clashes that killed 19, protesters breached a curfew, targeting the elite's symbols. Prime Minister K.P. Sharma Oli and ministers resigned amid calls for calm from security officials.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Pittsburgh Bolsters Secondary with Notable Addition",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Tue, 09 Sep 2025 14:59:28 +0000",
    "source": "CBS Sports",
    "sources": [
      "Yahoo Sports",
      "CBS Sports"
    ],
    "domains": [
      "www.northjersey.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Pittsburgh adds another notable name to its secondary",
      "Former North Jersey football star Jabrill Peppers has reportedly agreed to a deal with the Pittsburgh Steelers."
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/09/012cd265-546e-4c61-9583-a4f91c27d55d/peppers.jpg",
    "titles": [
      "Steelers to sign Jabrill Peppers: Pittsburgh reportedly adding veteran former Patriots DB, first round pick",
      "Report: Jabrill Peppers agrees to deal with Pittsburgh Steelers"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.973,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.65,
    "summary_source": "snippet",
    "summary_reason": "retry_exhausted",
    "summary": "Pittsburgh adds another notable name to its secondary",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "House Dems Release Epstein's 50th Birthday Scrapbook with Notable Figures",
    "domain": "business",
    "source_domain": "www.ft.com",
    "location": "global",
    "published": "Tue, 09 Sep 2025 14:15:01 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times",
      "The Guardian"
    ],
    "domains": [
      "www.ft.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Document released by House Democrats has apparent contributions from Trump, Clinton, Mandelson and Leon Black",
      "<p>Figures including Donald Trump, Bill Clinton and the UK ambassador to US, Peter Mandelson, apparently contributed</p><p>Democratic politicians have released a 238-page scrapbook given to Jeffrey Epstein as a present on his 50th birthday, with contributions attributed to high-profile figures inclu"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Fd8da0bd8-f072-4af2-8085-1248b6d6f64d.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Who’s who in Jeffrey Epstein’s birthday book",
      "Epstein 50th birthday book: who is in it and what did they say?"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.938,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.643,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "House Democrats released a 238-page scrapbook gifted to Jeffrey Epstein for his 50th birthday, featuring contributions from notable figures like Donald Trump, Bill Clinton, UK Ambassador Peter Mandelson, and Leon Black. This document highlights the connections between Epstein and various high-profile individuals.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "EU Lawmakers Pass Law to Cut Food Waste, Curb Fast Fashion Impact",
    "domain": "science",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-09-09T12:55:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Phys.org",
      "Deutsche Welle"
    ],
    "domains": [
      "phys.org",
      "www.dw.com"
    ],
    "snippets": [
      "EU lawmakers are set to give a final green light to a law on slashing the mountains of food wasted in Europe each year, and curbing the environmental impact of fast fashion.",
      "EU lawmakers gave a final green light Tuesday to a law on slashing back the mountains of food wasted in Europe each year, and curbing the environmental impact of so-called fast fashion."
    ],
    "image_url": "",
    "titles": [
      "EU to slash food and fast fashion waste",
      "EU clamps down on food waste, fast fashion"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.931,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.641,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "EU lawmakers approved a law aimed at significantly reducing food waste across Europe and minimizing the environmental impact of fast fashion. This legislation received its final endorsement on Tuesday, marking a major step towards more sustainable consumption practices within the EU.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Court Upholds $83.3M Defamation Judgment Against Trump",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Tue, 09 Sep 2025 02:34:55 GMT",
    "source": "Axios",
    "sources": [
      "CNBC",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMidkFVX3lxTE5OOGRLNC1ZTzFESHYwc1pGSVdLdmw5STlNSVdHOXhVTUJCaWFWWVVkdkxyWUd3eGpsMWpLQXdsRkJnb0RKNnoyR3pmM25wYjdodWVDSVp5Z2V0UFQ0QnBsXy1id25Ybkc1YzdaTV9XV2Y3dlNGaXc?oc=5\" target=\"_blank\">E. Jean Carroll's $83 million judgment against Trump upheld by appea",
      "Carroll has accused Trump of defaming her in statements denying her accusation that he raped her decades earlier in a New York City department store."
    ],
    "image_url": "",
    "titles": [
      "E. Jean Carroll's $83 million judgment against Trump upheld by appeals court - Axios",
      "Trump loses bid to overturn $83.3 million judgment in E. Jean Carroll defamation case"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.736,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.616,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A federal appeals court upheld an $83.3 million judgment against former President Trump for defaming E. Jean Carroll, who accused him of rape. The court rejected Trump's immunity claim. With interest, the judgment exceeds $89 million.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]