[
  {
    "title": "Sarah Mullally Appointed First Female Archbishop of Canterbury",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Fri, 03 Oct 2025 05:48:38 -0400",
    "source": "NPR",
    "sources": [
      "The Guardian",
      "Financial Times",
      "Washington Post",
      "NPR",
      "New York Times",
      "BBC",
      "CityNews"
    ],
    "domains": [
      "www.nytimes.com",
      "www.npr.org",
      "www.washingtonpost.com",
      "www.bbc.com",
      "www.ft.com",
      "www.theguardian.com",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "Sarah Mullally has been named as the new Archbishop of Canterbury, becoming the first woman to be chosen to lead the world's 85 million Anglicans.",
      "Dame Sarah, a former chief nursing officer, was previously the first female Bishop of London.",
      "Historic appointment comes after months of deliberation following resignation of Justin Welby last year",
      "Sarah Mullally, previously the bishop of London, is the first woman to serve as spiritual leader of the Church of England in its nearly 500-year history.",
      "Sarah Mullally, the bishop of London, will lead the Church of England. She has been a vocal supporter of the rights of women in the church.",
      "<p>Former chief nursing officer for England will legally assume role at Canterbury Cathedral ceremony in January</p><p>Dame Sarah Mullally has been named as the first female leader in the history of the Church of England as Downing Street announced the 106th archbishop of Canterbury nearly a year on",
      "LONDON (AP) — Bishop of London Sarah Mullally was announced Friday as the next Archbishop of Canterbury, the first time in 1,400 years that a woman has been chosen as the spiritual leader of the Church of England. Mullally, 63, a former chief nursing officer for England, will face serious challenges"
    ],
    "image_url": "",
    "titles": [
      "Sarah Mullally named first woman Archbishop of Canterbury",
      "'Hatred and racism cannot tear us apart,' first woman Archbishop of Canterbury Sarah Mullally says",
      "Sarah Mullally named first female Archbishop of Canterbury",
      "First woman is named archbishop of Canterbury, leader of Church of England",
      "Sarah Mullally Is Named as First Female Archbishop of Canterbury",
      "Sarah Mullally is named as first female archbishop of Canterbury",
      "Sarah Mullally named the first female Archbishop of Canterbury in history of Church of England"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.951,
      "consensus": 1.0,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.875,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Sarah Mullally has been appointed as the new Archbishop of Canterbury, marking the first time a woman will lead the Church of England and its 85 million Anglicans globally. Previously the Bishop of London and a former chief nursing officer, Mullally's historic appointment follows Justin Welby's resignation last year. She is recognized for her support of women's rights within the church. Mullally will officially assume her role in a ceremony at Canterbury Cathedral in January, becoming the 106th archbishop in the Church's history.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Terror Attack at Manchester Synagogue on Yom Kippur Kills Two",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Fri, 03 Oct 2025 05:03:46 -0400",
    "source": "NPR",
    "sources": [
      "The Guardian",
      "Deutsche Welle",
      "Financial Times",
      "NPR",
      "Al Jazeera",
      "New York Times",
      "BBC"
    ],
    "domains": [
      "www.nytimes.com",
      "www.npr.org",
      "www.bbc.co.uk",
      "www.aljazeera.com",
      "www.bbc.com",
      "www.ft.com",
      "www.theguardian.com",
      "www.dw.com"
    ],
    "snippets": [
      "Greater Manchester Police named Adrian Daulby, 53, and Melvin Cravitz, 66 as the victims of Thursday's attack. Three more remain hospitalized in serious condition.",
      "Jihad Al-Shamie was a weightlifting enthusiast who rarely spoke to his neighbours, one resident said.",
      "Keir Starmer says Britain must defeat rising antisemitic hatred.",
      "UK police have confirmed the identity of a man who was shot by police after attacking a synagogue in Manchester. Three other people have been arrested in connection with what police have called a 'terrorist incident.\"",
      "A second person injured was also hit by officers, Greater Manchester Police say",
      "<p>Faraj al-Shamie ‘fully distances’ family and expresses ‘deep shock and sorrow’ at actions of son, Jihad al-Shamie</p><ul><li><p><a href=\"https://www.theguardian.com/uk-news/live/2025/oct/03/manchester-synagogue-attack-victims-adrian-daulby-melvin-cravitz-attacker-jihad-al-shamie-latest-news-updat",
      "<p>Residents come together to insist their diverse neighbourhood will stick together</p><ul><li><p><a href=\"https://www.theguardian.com/uk-news/live/2025/oct/03/manchester-synagogue-attack-victims-adrian-daulby-melvin-cravitz-attacker-jihad-al-shamie-latest-news-updates\">Manchester synagogue attack:",
      "<p>Police say families of Adrian Daulby, 53, and 66-year-old Melvin Cravitz have been informed</p><ul><li><p><a href=\"https://www.theguardian.com/uk-news/live/2025/oct/03/manchester-synagogue-attack-victims-adrian-daulby-melvin-cravitz-attacker-jihad-al-shamie-latest-news-updates\">Manchester synagog",
      "In the hours after an attack, a blanket of fear and grief fell over synagogues and Jewish community centers across the country.",
      "<ul><li><p><a href=\"https://guardianprintshop.com/collections/ben-jennings\"><strong>Discover and buy more of Ben’s cartoons here</strong></a></p></li><li><p><a href=\"https://guardianprintshop.com/collections/ben-jennings/products/3rd-october-2025\"><strong>Order your own print of this cartoon from th",
      "Protest group Defend Our Juries has said in response a planned demonstration for this weekend will still take place.",
      "Officials said that one of the men killed at the Heaton Park Congregation synagogue in northwestern England had been hit by police gunfire.",
      "The stabbing in Manchester, England, came on Yom Kippur, the holiest day in the Jewish calendar."
    ],
    "image_url": "",
    "titles": [
      "UK police release names of the 2 victims of the Manchester synagogue attack",
      "Who was the Manchester synagogue attacker?",
      "Manchester Synagogue Attack: What We Know So Far",
      "Manchester: 2 killed in synagogue car, knife attack",
      "Victim killed in Manchester synagogue attack was shot by police",
      "Father of Manchester synagogue attacker condemns ‘heinous act’",
      "‘We are one community, this will not break us’: Manchester reacts to synagogue attack",
      "Manchester synagogue attack: police name two victims killed",
      "Manchester Synagogue Attack Fuels Fears of Antisemitism in Britain",
      "Ben Jennings on the Manchester synagogue attack – cartoon",
      "UK police urge cancellation of Palestine protest after Manchester attack",
      "Police Accidentally Shot and Killed a Victim During Manchester Terrorist Attack",
      "4 People Injured After Stabbing Outside Manchester Synagogue, UK Police Say"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.936,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.862,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A terrorist attack occurred outside the Heaton Park Hebrew Congregation synagogue in Manchester, England, on Yom Kippur, Judaism's holiest day. A man rammed a car into pedestrians and stabbed others, resulting in two fatalities and several serious injuries. The attacker was shot dead by police within minutes. Prime Minister Keir Starmer described the incident as \"appalling\" and left a European summit in Copenhagen early in response. UK authorities have increased security at Jewish sites following the attack. Two additional suspects were arrested in connection with the incident.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Munich Airport Halts Flights Amid Drone Sightings, Affects Oktoberfest",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 04:04:17 +0000",
    "source": "Al Jazeera",
    "sources": [
      "The Guardian",
      "Deutsche Welle",
      "Washington Post",
      "Al Jazeera",
      "New York Times"
    ],
    "domains": [
      "www.nytimes.com",
      "www.washingtonpost.com",
      "www.aljazeera.com",
      "www.theguardian.com",
      "www.dw.com"
    ],
    "snippets": [
      "The sightings follow similar incidents in Denmark and Norway last week.",
      "The disruption comes as Munich hosts its world-famous Oktoberfest beer festival, which runs until Sunday. Last week, Denmark and Norway closed airports due to drones.",
      "<p>Travel disrupted for thousands on eve of national holiday in latest drone incident to hit European aviation</p><p>Munich airport has reopened after drone sightings over the facility on Thursday evening forced air traffic control to suspend operations, leading to the cancellation of 17 flights and",
      "The E.U. is planning to build a “drone wall” to counter threats after airspace breaches in Poland, Estonia and other countries.",
      "The airport in Germany was the latest in Europe to shut because of drone sightings. Officials have blamed Russia, which has denied being behind the drone incursions."
    ],
    "image_url": "",
    "titles": [
      "Munich airport resumes flights after drone sightings; passengers stranded",
      "Germany: Drone sightings disrupt Munich airport",
      "Munich airport reopens after halting flights because of drone sightings",
      "Drones sightings shut down Munich airport overnight",
      "Flights Are Briefly Halted at Munich Airport After Drone Sightings"
    ],
    "score_components": {
      "magnitude": 0.964,
      "recency": 0.844,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.805,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Munich airport suspended operations due to drone sightings on Thursday evening, affecting the Oktoberfest beer festival. This led to 17 flight cancellations and disrupted nearly 3,000 travelers. This incident is part of a series of drone disruptions in European aviation, with officials blaming Russia, which has denied the accusations.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Yankees Beat Red Sox 2-1, Advance to ALDS Against Blue Jays",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Fri, 3 Oct 2025 07:50:12 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "Global News",
      "ESPN"
    ],
    "domains": [
      "globalnews.ca",
      "www.espn.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "The entire LDS field is set! Here's how every showdown stacks up.",
      "The New York Yankees will face the Toronto Blue Jays in an American League Division Series after dispatching the archrival Boston Red Sox in a Wild Card Series.",
      "The New York Yankees will face the Toronto Blue Jays in an American League Division Series after defeating the archrival Boston Red Sox 4-0 to win their wild-card series 2-1.",
      "<p>Arden Zwelling joins Evanka Osmak and Ken Reid to set up the Blue Jays&#8217; ALDS matchup against the Yankees, who we should expect to start Game 1 for both teams, New York&#8217;s improved defence, who gets left off Toronto&#8217;s ALDS roster, and more.</p>"
    ],
    "image_url": "",
    "titles": [
      "Yankees or Blue Jays? Cubs or Brewers? First look at every division series matchup",
      "Blue Jays to face division rival Yankees in ALDS",
      "NewsAlert: Blue Jays to face Yankees in ALDS",
      "Breaking down top storylines ahead of Blue Jays vs. Yankees ALDS tilt"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.992,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.767,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The New York Yankees advanced to the American League Division Series (ALDS) to face the Toronto Blue Jays after winning their wild-card series against the Boston Red Sox 2-1, with a final game score of 4-0. Discussions are ongoing about game strategies, including starting pitchers for Game 1, the Yankees' defense improvements, and roster decisions for the Blue Jays.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Israel Navy Stops Aid Flotilla to Gaza, Arrests Activists Including Thunberg",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 11:42:09 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "New York Times",
      "Washington Post"
    ],
    "domains": [
      "www.nytimes.com",
      "www.washingtonpost.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Israeli forces intercepted and boarded the Marinette, the last boat of the Global Sumud Flotilla that was still sailing.",
      "Crowds in Europe, South America and beyond rally to support Gaza, which faces famine after two years of bombardment.",
      "The Marinette is the last vessel of the Global Sumud Flotilla still heading towards Gaza.",
      "Israel&#039;s army issues &#039;final warning&#039; for hundreds of thousands of people to flee Gaza City as attacks escalate.",
      "Israel says it has deported four Italian citizens from the flotilla and is preparing to deport the rest of the activists",
      "Israel said its navy intercepted all but one of the boats in the Global Sumud Flotilla, an international convoy that was attempting to break the siege of Gaza.",
      "The Israeli government said it had detained activists who were trying to take humanitarian aid to the blockaded enclave."
    ],
    "image_url": "",
    "titles": [
      "Israeli military intercepts last Gaza Flotilla boat",
      "Global protests erupt over Israeli interception of Gaza aid flotilla",
      "Last Gaza Flotilla boat ‘still sailing strong’",
      "LIVE: Israel bombs Gaza homes; military intercepts last flotilla boat",
      "Last boat in Gaza humanitarian flotilla intercepted by Israel",
      "Israel intercepts Gaza aid flotilla, detains Thunberg and other activists",
      "Israel Detains Activists After Intercepting Flotilla Headed to Gaza: What to Know"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.989,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.749,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Israel's navy intercepted the Global Sumud Flotilla, aiming to deliver aid to Gaza, arresting activists including Greta Thunberg. The Marinette, the last of the flotilla's vessels, was presumed stopped in Palestinian waters, marking the interception of all boats involved.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Terror Attack at Manchester Synagogue on Yom Kippur Kills Two",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 11:39:48 GMT",
    "source": "BBC",
    "sources": [
      "New York Times",
      "BBC",
      "Washington Post"
    ],
    "domains": [
      "www.nytimes.com",
      "www.washingtonpost.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Two men killed in an attack on a synagogue in Manchester have been named by police as Adrian Daulby, 53, and Melvin Cravitz, 66",
      "Officers fatally shot a man who had rammed a car into some people and stabbed others outside the Heaton Park Hebrew Congregation, police said.",
      "Two people were killed on Yom Kippur after a driver rammed a vehicle into people in Manchester and stabbed others. One man who died was accidentally shot by police, who also killed the attacker."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/1578/live/c2933620-a02f-11f0-9eee-8f8d46a446f2.jpg",
    "titles": [
      "Two Jewish men killed in attack named",
      "Two killed in attack at synagogue on Yom Kippur in England",
      "Synagogue Attack on Yom Kippur in Manchester, UK: What We Know"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.968,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.73,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A terrorist attack occurred outside the Heaton Park Hebrew Congregation synagogue in Manchester, England, on Yom Kippur, Judaism's holiest day. A man rammed a car into pedestrians and stabbed others, resulting in two fatalities and several serious injuries. The attacker was shot dead by police within minutes. Prime Minister Keir Starmer described the incident as \"appalling\" and left a European summit in Copenhagen early in response. UK authorities have increased security at Jewish sites following the attack. Two additional suspects were arrested in connection with the incident.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Taylor Swift Drops 12th Album, Eyes 1M First-Week Sales",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 07:13:26 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "CityNews",
      "Forbes"
    ],
    "domains": [
      "www.forbes.com",
      "www.aljazeera.com",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "Showgirl breaks Spotify records as Taylor Swift&#039;s most pre-saved album, highlighting her enduring popularity.",
      "The new Taylor Swift release 'The Life of a Showgirl' could join the less than 30 albums to sell more than 1 million copies in their first week. She has done it before.",
      "Who is Taylor Swift’s heir apparent? Her 12th album, “The Life of a Showgirl,” offers an answer. It’s Taylor Swift. Her last album, “The Tortured Poets Department,” ended with the cautionary “Clara Bow,” an allegory that seemed to suggest her tenure atop the cultural mainstream was inherited from st"
    ],
    "image_url": "",
    "titles": [
      "Taylor Swift’s 12th studio album Showgirl shatters Spotify record",
      "Taylor Swift ‘Life Of A Showgirl’ Sales Prediction: Will New Album Set A Record?",
      "On Taylor Swift’s ‘The Life of a Showgirl,’ love and reputation are on the line"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.901,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.717,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Taylor Swift released her 12th album, \"The Life of a Showgirl,\" featuring a mix of pop and country music, along with themes of love, rivalry, and fame. The album, celebrated for its joyful pop records, has been uniquely promoted with global releases and exclusive cinema events for fans. It is anticipated to sell over 1 million copies in its first week, a milestone Swift has achieved before. The release underscores Swift's continued dominance in the music industry.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Apple Pulls ICEBlock App Over Safety Concerns, Following DOJ Demands",
    "domain": "business",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-10-03T06:17:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "CNBC",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "www.cnbc.com",
      "www.dw.com"
    ],
    "snippets": [
      "The Justice Department reportedly reached out to Apple to take down ICEBlock and similar apps, citing security risks to immigration enforcement officers.",
      "<a href=\"https://news.google.com/rss/articles/CBMib0FVX3lxTE9Eb3BJYnU3dk5GR1lkQjdRaGNTR0Jub3lkeXloUFJrUVdqU2VGNU84RHFBQVRhVlIxZ29BOW1CMS1uNjRrOUV0QzItNnp4OEZCU3h5NXRBQlhFNGFBQUZocVo0b29zN2FVQU91S1FSdw?oc=5\" target=\"_blank\">Apple drops ICE tracking apps from its store after Trump DOJ demand</a>&nbsp;",
      "Joshua Aaron has said he created ICEBlock after seeing the Trump administration's deportation efforts, which he said evoked events in Nazi Germany."
    ],
    "image_url": "",
    "titles": [
      "Apple pulls ICE tracking apps after Trump admin request",
      "Apple drops ICE tracking apps from its store after Trump DOJ demand - Axios",
      "Apple removes ICE tracking apps after Trump AG pressure"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.883,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.713,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Apple removed the ICEBlock app, designed to track immigration enforcement activities, from its App Store, citing safety concerns. This action follows demands from the Trump-era Department of Justice. The app's creator, Joshua Aaron, developed ICEBlock in response to the Trump administration's deportation policies, which he compared to events in Nazi Germany.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Admin Claims \"Armed Conflict\" Justifies Strikes on Venezuelan Drug Boats",
    "domain": "general",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 00:05:23 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "New York Times",
      "Washington Post"
    ],
    "domains": [
      "www.nytimes.com",
      "www.washingtonpost.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "<p>Administration attempts to justify strikes on alleged Venezuelan drug boats by claiming US under ‘armed attack’</p><p>The Trump administration is trying to justify strikes on alleged Venezuelan drug boats by advancing a novel legal theory that the US is now in a “non-international armed conflict”",
      "President Donald Trump has determined the U.S. is in “armed conflict” with drug cartels who are distributing narcotics, according to a notification to Congress.",
      "A notice calls the people the U.S. military recently killed on suspicion of drug smuggling in the Caribbean Sea “unlawful combatants.”"
    ],
    "image_url": "https://i.guim.co.uk/img/media/b6e16c1c91aa3f917c815100914be1bb254c6530/418_0_4164_3333/master/4164.jpg?width=140&quality=85&auto=format&fit=max&s=90dcff67bc88d491bbace822388cfa86",
    "titles": [
      "Trump officials push claim that US in ‘armed conflict’ with drug cartels",
      "U.S. in ‘armed conflict’ with drug cartels, Trump tells Congress",
      "Trump ‘Determined’ the U.S. Is Now in a War With Drug Cartels, Congress Is Told"
    ],
    "score_components": {
      "magnitude": 0.887,
      "recency": 0.76,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.71,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Trump administration has attempted to justify strikes on alleged Venezuelan drug boats by claiming the U.S. is in a \"non-international armed conflict\" with drug cartels, based on a novel legal theory. This justification, aimed at allowing military action against narcotics distributors, has been reported by US media and critiqued by experts as likely illegal. President Trump has notified Congress of this determination, framing it as a response to an \"armed attack\" by drug cartels on the United States.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Administration Cancels 300+ Clean Energy Awards, Targets Democrat States",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Fri, 03 Oct 2025 00:38:47 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "TechCrunch",
      "New York Times"
    ],
    "domains": [
      "www.nytimes.com",
      "www.cnbc.com",
      "techcrunch.com"
    ],
    "snippets": [
      "The Energy Department's cancellations of projects directly affected 16 states won by Kamala Harris in the 2024 presidential election.",
      "The cuts largely affect Democratic-led states as the two parties fight over the shutdown of the federal government.",
      "The Trump administration canceled over 300 awards related to clean energy on October 1. The states most affected by the cuts voted for Democrat presidential candidate Kamala Harris."
    ],
    "image_url": "",
    "titles": [
      "Shutdown fallout: Energy Dept. axes billions for green projects in blue states",
      "Energy Dept. Cancels $7.5 Billion for Hundreds of Projects, Mostly in Blue States",
      "Department of Energy cancels $7.5B of clean energy projects in mostly blue states"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.769,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.708,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "On October 1, the Trump administration canceled more than 300 clean energy awards, predominantly impacting Democratic-led states. This action comes amid a broader political conflict between the two parties regarding the federal government shutdown. The states most affected by these cancellations had supported Democratic presidential candidate Kamala Harris.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Nevada Supreme Court Rules Against NFL in Jon Gruden Case",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Fri, 3 Oct 2025 07:55:21 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Thursday's unanimous ruling by the Nevada Supreme Court means the last option for the NFL is to appeal to the U.S. Supreme Court, which sources told ESPN is likely.",
      "Gruden sued the NFL and Roger Goodell in November 2021"
    ],
    "image_url": "",
    "titles": [
      "Nev. court rejects NFL plea for Gruden rehearing",
      "Jon Gruden vs. NFL lawsuit: Nevada Supreme Court rejects league's petition in latest legal win for ex-coach"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.994,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.686,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Nevada Supreme Court ruled unanimously on Thursday against the NFL in a case involving Jon Gruden, who sued the NFL and Commissioner Roger Goodell in November 2021. This decision leaves the NFL with the option to appeal to the U.S. Supreme Court, a step sources told ESPN is likely.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Cubs Beat Padres 3-1, Advance to NL Division Series Against Brewers",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Fri, 3 Oct 2025 07:55:21 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "The Cubs held off a ninth-inning rally by the Padres for a clinching 3-1 victory Thursday night that sends them to the NL Division Series against the Brewers.",
      "<p>The Chicago Cubs downed the San Diego Padres in Game 3 of the wild-card round on Thursday to advance in the MLB playoffs, setting up a best-of-five against the Milwaukee Brewers.</p>",
      "<p>Michael Busch had three hits and a solo home run, Pete Crow-Armstrong added three hits of his own and drove in a run, and the Chicago Cubs took Game 3 and the Wild Card Series win over the Chicago Cubs 3-1.</p>"
    ],
    "image_url": "",
    "titles": [
      "Cubs quash Padres' threat in 9th to make NLDS",
      "Cubs down Padres in Game 3 to reach NLDS vs. Brewers",
      "MLB Game 3 Highlights: Cubs 3, Padres 1"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.994,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.686,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Chicago Cubs defeated the San Diego Padres 3-1 on Thursday night, overcoming a ninth-inning rally to advance to the NL Division Series. They will face the Milwaukee Brewers in a best-of-five series.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "India, China Seek to Normalize Relations, Strengthen Ties Post-Tensions",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 08:57:35 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Fortune"
    ],
    "domains": [
      "fortune.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Latest move underscores efforts to normalise ties and draw closer in wake of Trump&#039;s policies, stiff tariffs.",
      "Passenger flights between India and China were suspended after the COVID-19 pandemic and never resumed  following border clashes in 2020."
    ],
    "image_url": "",
    "titles": [
      "India, China to resume direct flights after 5 years as relations thaw",
      "India, China to start direct flights this month as ties warm"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.934,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.659,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "India and China are taking steps to normalize relations and strengthen ties, following a period of tension due to former U.S. President Trump's policies and stiff tariffs. This effort comes after passenger flights between the two countries were halted due to the COVID-19 pandemic and remained suspended following border clashes in 2020.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UFC 320 Weigh-Ins Conclude, Final Faceoffs Set for Fight Week",
    "domain": "sports",
    "source_domain": "mmajunkie.usatoday.com",
    "location": "national",
    "published": "Fri, 03 Oct 2025 11:45:25 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Sportsnet",
      "Yahoo Sports"
    ],
    "domains": [
      "mmajunkie.usatoday.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "UFC 320 fight week wraps up at Friday's ceremonial weigh-ins with final faceoffs for all 14 bouts.",
      "Check out the results from the official UFC 320 fighter weigh-ins.",
      "<p>Fans can watch a live UFC 320 weigh-in show with Aaron Bronsteter and Diana Belbita on Sportsnet.ca, Sportsnet+ and Sportsnet’s YouTube channel Friday beginning at approximately 11:55 a.m. ET / 8:55 a.m. PT.</p>"
    ],
    "image_url": "",
    "titles": [
      "Video: UFC 320 ceremonial weigh-ins live stream from Las Vegas",
      "UFC 320 weigh-in results, live video stream",
      "Watch Live Friday: UFC 320 Official Weigh-in Show on Sportsnet"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.99,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.653,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "UFC 320 concluded its fight week with ceremonial weigh-ins for all 14 bouts on Friday, marking the final faceoffs. Fans could catch the live weigh-in show featuring Aaron Bronsteter and Diana Belbita on Sportsnet.ca, Sportsnet+, and Sportsnet’s YouTube channel. The event started around 11:55 a.m. ET / 8:55 a.m. PT.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Kartal Becomes UK's No. 2 Despite Loss to Noskova at China Open",
    "domain": "sports",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 10:04:58 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "Sky Sports"
    ],
    "domains": [
      "www.skysports.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "<ul><li><p>Briton overwhelmed 6-3, 6-4 by the Czech world No 27</p></li><li><p>Kartal leapfrogs Boulter as GB No 2 after tournament</p></li></ul><p>Sonay Kartal’s impressive breakthrough run in Beijing came to a difficult end as she was overpowered by Linda Noskova, who eviscerated every last ball a",
      "Highlights of Sonay Kartal against Linda Noskova from the China Open."
    ],
    "image_url": "https://i.guim.co.uk/img/media/d20fce7de068d366bec4a193e21abb0421baf246/216_76_1588_1271/master/1588.jpg?width=140&quality=85&auto=format&fit=max&s=cb55d0d082da97e805b8acae38781f68",
    "titles": [
      "Sonay Kartal’s breakthrough China Open run halted by stellar Noskova",
      "Kartal's brilliant China Open run ends with quarter-final defeat"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.936,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.649,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In the China Open, British tennis player Sonay Kartal was defeated by Czech player Linda Noskova with scores of 6-3, 6-4. Following this tournament, Kartal advanced to become Great Britain's No. 2 ranked player, despite the loss to the world No 27, Noskova.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Patricia Routledge, Beloved British Actress, Passes Away",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 11:36:19 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "She also starred in Alan Bennett's TV monologues and played the BBC's amateur sleuth Hetty Wainthropp.",
      "<p>The actor was best known for her role as the pretentious housewife Hyacinth Bucket, and for the series Hetty Wainthropp Investigates</p><ul><li><p><a href=\"https://www.theguardian.com/stage/2025/oct/03/patricia-routledge-brought-humanity-to-an-array-of-eccentrics-from-hyacinth-bucket-to-lady-brac"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/ee0e/live/494a7460-a041-11f0-af31-9d0b79382753.jpg",
    "titles": [
      "Keeping Up Appearances star Patricia Routledge dies at 96",
      "Keeping Up Appearances actor Patricia Routledge dies aged 96"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.967,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.648,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Patricia Routledge, celebrated for her role as Hyacinth Bucket in the sitcom and as the lead in Hetty Wainthropp Investigates, passed away. Her career was marked by her versatile portrayals of characters, from the pretentious Hyacinth to various roles in Alan Bennett's TV monologues, showcasing her wide-ranging talent in bringing eccentric characters to life with humanity and depth.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Sean \"Diddy\" Combs Faces Sentencing in NY, Risks 20-Year Maximum",
    "domain": "general",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Fri, 03 Oct 2025 06:26:21 -0400",
    "source": "ABC News",
    "sources": [
      "The Guardian",
      "ABC News"
    ],
    "domains": [
      "abcnews.go.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "\"In my life, I have made many mistakes, but I am no longer running from them,\" Combs wrote on Thursday in a letter to the judge overseeing his case.",
      "<p>Music mogul could face lengthy prison sentence after being convicted of some charges in July; court proceedings to begin at 10am eastern time</p><ul><li><p><a href=\"https://www.theguardian.com/music/2025/oct/03/sean-diddy-combs-sentencing\">Sean ‘Diddy’ Combs sentencing: what to know</a></p></li><",
      "<p>Rapper to be sentenced on two counts that each carry maximum 10-year term – what might the judge decide?</p><p><a href=\"https://www.theguardian.com/music/diddy\">Sean “Diddy” Combs</a> is scheduled to be sentenced on Friday morning by a federal judge in New York, following his conviction earlier t"
    ],
    "image_url": "https://s.abcnews.com/images/US/diddy-1-rt-er-251002_1759445855773_hpMain_4x3t_384.jpg",
    "titles": [
      "Sean 'Diddy' Combs faces sentencing after conviction on prostitution-related charges",
      "Sean ‘Diddy’ Combs to be sentenced after conviction on federal prostitution-related charges – live updates",
      "Sean ‘Diddy’ Combs sentencing: what to know"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.963,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.648,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Sean \"Diddy\" Combs is set to be sentenced on Friday in New York after being convicted on charges that could lead to a maximum of 20 years in prison. Combs acknowledged his past mistakes in a letter to the judge ahead of his sentencing. The court proceedings are scheduled to begin at 10 am Eastern time.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UK Home Secretary Criticizes Pro-Palestinian Protests, Urges Rally Cancellation",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 11:31:43 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Financial Times"
    ],
    "domains": [
      "www.bbc.com",
      "www.ft.com"
    ],
    "snippets": [
      "The home secretary told BBC Breakfast she was disappointed pro-Palestinian protests went ahead.",
      "Shabana Mahmood calls on Defend Our Juries to call off London rally in wake of Thursday’s terrorist incident"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/0584/live/4189b710-a044-11f0-b741-177e3e2c2fc7.jpg",
    "titles": [
      "Pro-Palestinian protests 'un-British' after Manchester attack, home secretary says",
      "Home secretary urges activists to cancel Palestine Action protest after Manchester attack"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.965,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.648,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The UK Home Secretary expressed disappointment on BBC Breakfast over the continuation of pro-Palestinian protests. Additionally, Shabana Mahmood urged the group Defend Our Juries to cancel a planned rally in London following a terrorist incident on Thursday.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Tuchel Excludes Trio from England Squad for Tactical Reasons",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 11:11:55 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Sky Sports"
    ],
    "domains": [
      "www.bbc.com",
      "www.skysports.com"
    ],
    "snippets": [
      "Thomas Tuchel says he has \"no problem\" with Jude Bellingham, Phil Foden or Jack Grealish after leaving them out of his England squad.",
      "Following the announcement of his most recent England squad for the upcoming 2026 World Cup qualifiers, England boss Thomas Tuchel explains his reasoning for omitting players such as Jude Bellingham, Phil Foden and Jack Grealish."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/2c74/live/a5e9eeb0-a043-11f0-92db-77261a15b9d2.png",
    "titles": [
      "No problem with Bellingham, Foden or Grealish - Tuchel",
      "'A straightforward decision' | Tuchel explains Bellingham and Foden omissions"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.958,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.647,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "England manager Thomas Tuchel stated he has \"no problem\" with players Jude Bellingham, Phil Foden, and Jack Grealish despite excluding them from the England squad for the 2026 World Cup qualifiers. Tuchel clarified his decision was based on tactical reasons, not personal issues with the players.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Alonso Tops Singapore GP Practice, Albon's Car Catches Fire",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 10:45:13 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Sky Sports"
    ],
    "domains": [
      "www.bbc.com",
      "www.skysports.com"
    ],
    "snippets": [
      "Aston Martin's Fernando Alonso sets the pace from Ferrari's Charles Leclerc and Red Bull's Max Verstappen in Singapore Grand Prix first practice.",
      "Aston Martin's Fernando Alonso was fastest from Ferrari's Charles Leclerc in first practice for the Singapore Grand Prix as Alex Albon's Williams caught fire early on."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/1625/live/6df425f0-a045-11f0-af31-9d0b79382753.jpg",
    "titles": [
      "Alonso fastest in Singapore first practice",
      "Alonso fastest as Albon's car catches fire in Singapore first practice"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.95,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.645,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Fernando Alonso of Aston Martin led the first practice session for the Singapore Grand Prix, followed by Charles Leclerc of Ferrari and Max Verstappen of Red Bull. During the session, Alex Albon's Williams car caught fire.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "World's First EEHV Vaccine Trial in Elephants Shows Promise",
    "domain": "science",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 09:04:24 GMT",
    "source": "BBC",
    "sources": [
      "Phys.org",
      "BBC"
    ],
    "domains": [
      "phys.org",
      "www.bbc.com"
    ],
    "snippets": [
      "A vaccine against a deadly disease that affects young elephants is shown to be effective in a world-first trial.",
      "The world's first vaccine trial against elephant endotheliotropic herpesvirus (EEHV)—a leading cause of death in young Asian elephants—is safe and triggers a strong virus-fighting immune response, according to an international team led by the University of Surrey, in collaboration with Chester Zoo a"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/dfef/live/3a627f30-9e19-11f0-928c-71dbb8619e94.jpg",
    "titles": [
      "Vaccine breakthrough for deadly elephant virus",
      "Vaccine for deadly elephant herpesvirus found safe and effective in early trial"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.917,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.638,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "An international team, including the University of Surrey and Chester Zoo, has successfully conducted the world's first vaccine trial against elephant endotheliotropic herpesvirus (EEHV), a major cause of death in young Asian elephants. The vaccine is safe and elicits a strong immune response against the virus.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "U.S. Government Shuts Down as Congress Misses Funding Deadline",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 06:53:22 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "ABC News"
    ],
    "domains": [
      "abcnews.go.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "White House says it plans to cut &#039;thousands&#039; of federal jobs as it freezes funding to Democratic states.",
      "The next vote on bills that could get federal money flowing again is not scheduled until Friday, as thousands of workers remain furloughed and many government services are at a standstill.",
      "ABC News' senior White House correspondent Selina Wang answers the most searched questions on the first day of the government shutdown."
    ],
    "image_url": "",
    "titles": [
      "US government shutdown enters third day, expected to last past weekend",
      "WATCH:  Government shutdown enters day 2",
      "WATCH:  What does the government shutdown mean for you and your family?"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.895,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.634,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The U.S. government officially shut down on Oct. 1 after Congress failed to reach a funding agreement. ABC News' Selina Wang, as the senior White House correspondent, addressed the most searched questions regarding the shutdown on its first day.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Red Sox Season Ends with Loss to Yankees in Wild Card Series Game 3",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Fri, 03 Oct 2025 05:25:14 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.cbssports.com"
    ],
    "snippets": [
      "The Red Sox gave up four runs in the fourth in their season-ending loss",
      "<p>Watch as the Boston Red Sox make a pair of defensive miscues leading to a massive four-run fourth inning from the New York Yankees in Game 3 of their Wild Card Series.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/10/03/3d655032-dbf0-4c38-b86a-ec257199c0b1/red-sox-getty.png",
    "titles": [
      "How the Red Sox's season slipped away: Defensive lapses cost Boston in fateful fourth inning vs. Yankees",
      "Red Sox’s pair of defensive miscues lead to massive inning for Yankees"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.868,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.629,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Boston Red Sox suffered a season-ending loss after conceding four runs in the fourth inning due to defensive errors, during Game 3 of their Wild Card Series against the New York Yankees.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Gateway Church Founder Admits to 1980s Sexual Abuse of Minor",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Fri, 03 Oct 2025 04:19:47 GMT",
    "source": "Axios",
    "sources": [
      "New York Times",
      "Axios"
    ],
    "domains": [
      "www.nytimes.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMikwFBVV95cUxQUk1GRkJJUlJtWE1DYWtGTDNzaS1ZSGRZUnItak9VU0xmM2hGcmlTeXVRTjJQLXFtR0xhR21JZDBZcTU4ZHFScUEyaVAza25uYndKbVlqcnBxc041WDdVTnlLd21WSktQb2pUMXlmZWg1RF84VThZTlJuYkhia1NucTRPdHlkUUU5RVdScVJOZnVPSEU?oc=5\" target=\"_blank\">Texas megachurch pastor plea",
      "Robert Morris, the founder of Gateway Church, which has one of the nation’s largest congregations, admitted to sexually abusing a child in the 1980s."
    ],
    "image_url": "",
    "titles": [
      "Texas megachurch pastor pleads guilty to child sexual abuse charges - Axios",
      "Texas Megachurch Pastor Pleads Guilty to Child Sex Abuse"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.831,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.621,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Robert Morris, founder of Gateway Church, a major US megachurch, admitted to sexually abusing a 12-year-old girl in the 1980s. This admission has brought significant attention to his actions and the church.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Perplexity's Comet Browser Now Free, Aims to Elevate Content Quality",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Thu, 02 Oct 2025 19:56:13 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "Perplexity initially launched Comet in July to Perplexity Max subscribers for $200 a month",
      "AI search startup Perplexity is making its new Comet browser available to everyone in the world for free as it works to position the product against big browsers and search engines. For certain paid subscribers, the startup has also launched a new ‘background assistant’ to handle multiple tasks via "
    ],
    "image_url": "",
    "titles": [
      "Perplexity AI rolls out Comet browser for free worldwide",
      "Perplexity’s Comet AI browser now free; Max users get new ‘background assistant’"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.697,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.601,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Perplexity launched its Comet browser in July for $200 a month to Perplexity Max subscribers. Now, the AI startup has made Comet free for all users, aiming to combat low-quality content and collaborating with publishers like CNN and The Washington Post. This move positions Comet as a competitor to major browsers and includes a 'background assistant' feature for certain paid subscribers.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]