[
  {
    "title": "President Aims to Cut Overseas Military Role, Sparks Trade Conflict",
    "domain": "general",
    "location": "global",
    "published": "Sun, 15 Jun 2025 23:08:20 +0000",
    "source": "New York Times",
    "sources": [
      "New York Times"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "In 2018, the president called for the group to embrace Russia and stormed out of the summit. Now he is seeking to shrink America’s military role abroad and embarking on a more expansive trade war."
    ],
    "image_url": "https://static01.nyt.com/images/2025/06/15/multimedia/15dc-trump-g7-02-zvwb/15dc-trump-g7-02-zvwb-mediumSquareAt3X.jpg",
    "titles": [
      "As Trump Returns to G7, Rift With Allies Is Even Deeper"
    ],
    "summary": "In 2018, the U.S. President urged for Russia's inclusion in a summit and exited the meeting abruptly. Presently, he is aiming to reduce the United States' military involvement overseas while initiating a broader trade conflict.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness of the President's actions and their potential impacts on international relations and trade. However, it lacks depth or insight into the reasons behind these actions, the potential consequences, or any proposed solutions to the conflict.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.829,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.385
  },
  {
    "title": "MPs Criticize Thames Water Over Bonuses, Suggest Non-Profit Model for Utilities",
    "domain": "general",
    "location": "global",
    "published": "Sun, 15 Jun 2025 23:01:30 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "<p>Report says billpayer funds are being used irresponsibly, after news that Thames Water paid bonuses from £3bn loan</p><p>Bonuses and dividends for water company bosses and shareholders should be approved by the regulator before they are paid, as billpayer funds are being used irresponsibly, MPs have said.</p><p>They also recommended that the government consider ending the profit-driven water company model and making English companies non-profit, similar to how the system works in Wales, in the report by the Environment, Food and Rural Affairs (Efra) select committee.</p> <a..."
    ],
    "image_url": "https://i.guim.co.uk/img/media/d7250bc437765a6ce403a8d87495b4639492e382/673_0_3743_2995/master/3743.jpg?width=140&quality=85&auto=format&fit=max&s=5e1d9e5b6788aae671954205667277d7",
    "titles": [
      "Ofwat should have to approve water firms’ bonuses and dividends, say MPs"
    ],
    "summary": "A report by the Environment, Food and Rural Affairs (Efra) select committee criticized Thames Water for paying bonuses from a £3bn loan, deeming it an irresponsible use of billpayer funds. MPs recommended that bonuses and dividends for water company executives and shareholders require regulatory approval before distribution. Additionally, they suggested the UK government explore transitioning English water companies to a non-profit model, akin to the system in Wales, to ensure more responsible financial practices.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive. It provides useful information about the misuse of funds by Thames Water, raises awareness about the potential benefits of a non-profit model for utilities, and reports on proposed solutions to the problem.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.827,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.417
  },
  {
    "title": "Netflix Documentary Explores Grenfell Tower Tragedy and Systemic Failures",
    "domain": "general",
    "location": "global",
    "published": "Sun, 15 Jun 2025 23:01:29 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "<p>The maker of Netflix documentary about the fire reflects on a very avoidable tragedy and the injustices attested to by former PM, Theresa May</p><p>Over the course of 100 minutes, a new documentary on the Grenfell Tower disaster splices footage from the night and the subsequent public inquiry with testimony from survivors and the bereaved.</p><p>And at its heart is a universal story: classism, the prioritisation of individual profit over public safety, and a lack of accountability for the decision-makers behind it.</p> <a..."
    ],
    "image_url": "https://i.guim.co.uk/img/media/d0edf18f4bdd339fd4cb8db77a392e2148fe333a/2666_0_10000_8000/master/10000.jpg?width=140&quality=85&auto=format&fit=max&s=8b710e4b5b6cacb26b191843c85cbd87",
    "titles": [
      "‘Grenfell should make us all uncomfortable’: Olaide Sadiq on making Grenfell: Uncovered"
    ],
    "summary": "A new Netflix documentary delves into the Grenfell Tower disaster, blending night-of footage, public inquiry clips, and survivor testimonies over 100 minutes. It highlights the tragedy as avoidable, emphasizing themes of classism, profit over safety, and a lack of accountability among decision-makers. Former PM Theresa May comments on the injustices, underscoring the documentary's focus on systemic failures leading to the disaster.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful context about the Grenfell Tower disaster and the systemic failures that led to it. It increases awareness about the impact of classism and profit-driven decision-making on public safety. However, it does not highlight any progress, solutions, or improvements.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.827,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.414
  },
  {
    "title": "Search for Missing Person After Vehicle Incident Ends in Failure",
    "domain": "general",
    "location": "national",
    "published": "Sun, 15 Jun 2025 22:54:07 +0000",
    "source": "Global News",
    "sources": [
      "Global News"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "Officers, firefighters and search-and-rescue crews tried to locate both the vehicle and the missing person, but failed. Three other occupants were able to get to safety."
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/05/74eead2db3f8ee6c3cfac2fb59c4a0b7b0bcdb7cb9e7b446d7b6ba2cdea61c5e_0ec517.jpg?quality=85&strip=all",
    "titles": [
      "Person still missing after vehicle crashes into Squamish River: B.C. RCMP"
    ],
    "summary": "After an incident involving a vehicle, officers, firefighters, and search-and-rescue teams were deployed to find a missing person associated with the event. Despite their efforts, they were unable to locate the individual. Three other occupants of the vehicle managed to reach safety on their own.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "The story provides basic awareness about an incident and the subsequent search for a missing person. However, it does not offer any deeper understanding, actionable insights, or report on solutions or improvements. The story is reactive and does not contribute much to the reader's understanding or decision-making.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.825,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 1.0
    },
    "score": 0.414
  },
  {
    "title": "G7 Summit Protests in Calgary; Separate Homicide Investigation Underway",
    "domain": "general",
    "location": "national",
    "published": "Sun, 15 Jun 2025 22:53:12 +0000",
    "source": "Global News",
    "sources": [
      "Global News"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "As world leaders attending the G7 summit in Kananaskis began to arrive, hundreds of protesters gathered in downtown Calgary on Sunday, hoping to send a message.",
      "The Calgary police homicide unit was called to investigate after a woman was reported in distress in downtown Calgary Saturday evening. She was later pronounced dead in hospital."
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/06/protest-sidee-wide-shot_1.jpg?quality=85&strip=all",
    "titles": [
      "Hundreds of protesters rally in downtown Calgary ahead of G7 summit",
      "Calgary police investigate suspicious death downtown on Saturday"
    ],
    "summary": "During the G7 summit in Kananaskis, hundreds of protesters convened in downtown Calgary to voice their concerns as global leaders arrived. Concurrently, in a separate incident in downtown Calgary, the police homicide unit is investigating the death of a woman who was reported in distress on Saturday evening and later pronounced dead at the hospital.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story provides awareness about the G7 summit and the related protests, as well as a separate homicide investigation. However, it does not provide much depth or insight into the reasons for the protests or the details of the homicide investigation. It does not report on solutions or improvements and does not offer actionable insights.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.824,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 1.0
    },
    "score": 0.427
  },
  {
    "title": "Summit in Kananaskis Boosts Security Against Grizzly Bear Threats",
    "domain": "general",
    "location": "national",
    "published": "Sun, 15 Jun 2025 22:50:48 GMT",
    "source": "Globe and Mail",
    "sources": [
      "Globe and Mail"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMinwFBVV95cUxOVFd4Q1BTVFI4bWdOM2lCUjMycmhXNnA3S291Q2pnV1JYVkF0SVE1OFNjUkxsRUJZTlpRdGl3ZS02V1k0dXd4U2FRVHZXeEhKbHFHMnE5cGQydTlkZVh5MWVaeENRX1Q5MEhWRGNKdDlpMnRvalJPN1h4WlBJQjdHcnQtdXEzMkExYkJlQkJYQmpIWmVpV3B5SmJBN3llODQ?oc=5\" target=\"_blank\">In Kananaskis, a special security challenge: How to keep world leaders safe from grizzlies</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">The Globe and Mail</font>"
    ],
    "image_url": "",
    "titles": [
      "In Kananaskis, a special security challenge: How to keep world leaders safe from grizzlies - The Globe and Mail"
    ],
    "summary": "In Kananaskis, a unique security challenge emerged during a summit to ensure the safety of world leaders from potential grizzly bear encounters. The situation required specialized measures beyond the usual security protocols to protect these high-profile individuals in the wilderness setting.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story informs about a unique security challenge during a summit and the measures taken to ensure safety from potential grizzly bear encounters. It provides useful information about the situation and the solutions implemented, contributing to the reader's understanding and awareness. However, it could provide more in-depth insights or actionable knowledge to score higher.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.824,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.414
  },
  {
    "title": "Nuclear Powers Expand Arsenals; Sarkozy Loses Legion of Honour",
    "domain": "general",
    "location": "global",
    "published": "Sun, 15 Jun 2025 22:31:52 GMT",
    "source": "Reuters",
    "sources": [
      "Fortune",
      "Reuters",
      "Financial Times"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMi1wFBVV95cUxNNV84QmhnMkNnTGNITnJRanhIdVF2bV9VWjVfR2V1RDlfTFZJUEpaQS1XdXY4Qko4VjQ3MzBjWE9ydURJc1V3a1dhbGdCTm1SRmFUa1dBT1U0VWcxUnlOVGVtOFl4cTl5VVhFSE1PWnVrUnNyMVJxck9qbDlBbW10aENHVS1hZXhkX0JLeU9hd3ZFVFN0V21YTVlIcy01OGVZcTlDajNWMFNJcWhfVDN3ZHVjS0l4U1laWU1WYzBRaVlPTDFxU2lzdnpabWJTbGRpZXI5aVVQSQ?oc=5\" target=\"_blank\">World entering new era as nuclear powers build up arsenals, SIPRI think tank says</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Reuters</font>",
      "Israel has targeted Iran's stockpile of missiles as well as its ability to launch them, according to the Institute for the Study of War.",
      "<a href=\"https://news.google.com/rss/articles/CBMisAFBVV95cUxNVFJSdXNIWUdQczlyTXV5U2xwVTVKVXB6WlcyZEp1d2kzRmI2X0dpMm9PR3g0T1FvSjh5bnNfMk5Tb3A5WWFKU0t5TzBGVk1TWWVIZ0ZhdlFxUFdoOVJtRjRzWHNxQVhNTG8xR1NEUnotdnlXakhXNWViUjl2Y2JnelpGNDh1Q1V5aUprZENRbkROLTNhN2xvdVVxUVZwbnBsekJRQ21CYjNYMGMwZERWag?oc=5\" target=\"_blank\">Iranian president says Tehran does not seek nuclear weapons</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Reuters</font>",
      "Experts question Israel’s claim Tehran had begun an atomic bomb programme but warn it has become a ‘threshold’ state",
      "<a href=\"https://news.google.com/rss/articles/CBMipAFBVV95cUxPcnY4ZVJMTjZNQXIzNkJOTDE4OXhlS2x6aFVtSmliQkpiRThwSDhlS3RBN0lLRHNGTEwzQ0g0eDhaX3Eya1FNNFAtVF95dGw4RFRfTWM4Qjl0bDF3SUF0UnBKSWFJU1FYS2UzS1ZNY3UxNHgyVGZ3dTRfYUplY29vRFlBR1dsYkVKVFV1SUNUN0x6ZWFCOERhcFpLblhXc0RjMWxIRw?oc=5\" target=\"_blank\">Former French president Sarkozy stripped of Legion of Honour medal</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Reuters</font>"
    ],
    "image_url": "",
    "titles": [
      "World entering new era as nuclear powers build up arsenals, SIPRI think tank says - Reuters",
      "Is Iran running out of missiles? Its rate of attack on Israel is already slowing down, think tank says",
      "Iranian president says Tehran does not seek nuclear weapons - Reuters",
      "Was Iran really developing nuclear weapons?",
      "Former French president Sarkozy stripped of Legion of Honour medal - Reuters"
    ],
    "summary": "The SIPRI think tank reports a new era as nuclear powers expand their arsenals. Israel has targeted Iran's missile capabilities, amid claims Tehran is nearing a 'threshold' nuclear state, though Iran asserts it does not seek nuclear weapons. Meanwhile, former French President Sarkozy has been stripped of his Legion of Honour medal, marking a significant fall from grace.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information about the current state of nuclear powers and their expansion, as well as the political situation involving Sarkozy. However, it does not offer solutions, improvements, or attempts to solve the problem of nuclear proliferation. It also does not provide enough depth or insight into the systems, causes, trends, or impacts of these issues.",
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.818,
      "consensus": 0.897,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.743
  },
  {
    "title": "Washington Post Probes Journalist Email Hack; Victoria's Secret Faces Activist C",
    "domain": "general",
    "location": "global",
    "published": "Sun, 15 Jun 2025 22:05:35 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMirwFBVV95cUxOQ1MwQ2MxMGlJQzh2ZjZqUXNnR0VWMEdsZkpLZzVSZFJKaUdndkhoaXZoNXRKTDNweFQyakRQdmYtd2ZSbGhVa2hCVldiZDdDQXp3MGNGRlAtSUY2OWtya0NaVU9vRE1TNVd1SXVWc0ZjenBrTDhtZEJ4SEstTEFBSGU0OG5pRGY2R0ZxY2hzbU54QnJLcGgyQ1BkRzJSMmtxQ1haV3lhanFwT1NtLXdJ?oc=5\" target=\"_blank\">Washington Post investigating cyberattack on journalists' email accounts, source says</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Reuters</font>",
      "<a href=\"https://news.google.com/rss/articles/CBMi6gFBVV95cUxQeVRrNUpRczJMOWNDNThvZUYtckhFaXBVTW1lUXcwUHpteFNRRW1wY2VTVXNjcDVQYWZGU0lHRjA0TmNDdF9sZW53dzFWclAtMk9mSS1tbkNnQ0hIMWtxQ3hWN0c3UTlMUEw2dzhqTklFRmdsd25xTXRqTVRZbjVBZ21KTWFneC01MllmZ0dKa0lYS1ZWMXlVWjNvUjlxeXZkeTNyaUhTVC1MaHg2aTZfdE5zazFhS1BCdE1sVHR2S2ZhQUtIVG8wUFRiRTNadUluQUFERHZyaEdLQWdaWGlmMDZyQndLRzRncVE?oc=5\" target=\"_blank\">Victoria's Secret faces fresh activist fight from Barington Capital, source says</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Reuters</font>"
    ],
    "image_url": "",
    "titles": [
      "Washington Post investigating cyberattack on journalists' email accounts, source says - Reuters",
      "Victoria's Secret faces fresh activist fight from Barington Capital, source says - Reuters"
    ],
    "summary": "The Washington Post is currently investigating a cyberattack targeting journalists' email accounts, according to a source. In a separate story, Victoria's Secret is facing a new activist challenge from Barington Capital, also reported by a source. Both cases are ongoing and have drawn attention to the security and management practices of the organizations involved.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story offers basic awareness about cyberattacks and corporate activism, but it does not provide actionable insights or deeper understanding. It does not report on solutions or improvements, and it does not increase clarity around the systems, causes, trends, or impacts of these issues.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.811,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.381
  },
  {
    "title": "NBA Stars Shine in Fashion and Basketball",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 15 Jun 2025 23:55:54 EST",
    "source": "ESPN",
    "sources": [
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "From clutch performances to fashion icons, Shai Gilgeous-Alexander's and Tyrese Haliburton's closets contain the magic."
    ],
    "image_url": "",
    "titles": [
      "'The secret sauce': Inside the closets of superstars SGA and Tyrese Haliburton"
    ],
    "summary": "Shai Gilgeous-Alexander and Tyrese Haliburton are recognized not only for their standout performances on the basketball court but also for their distinctive fashion sense. Their wardrobes are highlighted as a source of both their on-court magic and off-court style, showcasing their dual roles as top athletes and fashion icons.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "While the story provides some awareness about the dual roles of athletes as sports and fashion icons, it does not provide actionable insights, solutions, or deeper understanding. It does not increase clarity around systems, causes, trends, or impacts that matter.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.916,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.4
  },
  {
    "title": "Hamilton's Race Impacted by Groundhog Collision at Canadian Grand Prix",
    "domain": "sports",
    "location": "global",
    "published": "Sun, 15 Jun 2025 23:45:00 BST",
    "source": "Sky Sports",
    "sources": [
      "Sky Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Lewis Hamilton has revealed he hit a groundhog during the Canadian Grand Prix which affected his performance."
    ],
    "image_url": "https://e0.365dm.com/25/06/1920x1080/skysports-f1-lewis-hamilton_6943155.jpg?20250615232626",
    "titles": [
      "'Devastated' Hamilton reveals he hit groundhog during Canadian GP"
    ],
    "summary": "During the Canadian Grand Prix, Lewis Hamilton reported that his performance was impacted after colliding with a groundhog on the track. This incident played a role in his results for the race.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about an incident that occurred during a race. However, it lacks depth or insight into how such incidents could be prevented in the future, or what the implications might be for the sport or the athlete's career.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.839,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.36
  },
  {
    "title": "Father's Day Bond: OU Signee and Dad Reflect on Strengthening Ties Through Sport",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 15 Jun 2025 23:20:31 EST",
    "source": "ESPN",
    "sources": [
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "With Father's Day here, the OU signee and her dad reflect on a relationship forged through tough practices together -- a bond that might not have otherwise existed."
    ],
    "image_url": "",
    "titles": [
      "How Aaliyah Chavez and her dad bonded through basketball"
    ],
    "summary": "On Father's Day, an OU signee and her father shared reflections on their unique relationship, which was strengthened through rigorous practice sessions. These shared experiences in training not only improved her athletic skills but also fostered a deep bond between them, a connection they believe might not have developed under different circumstances.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story clearly highlights the positive influence of sports on family relationships, providing readers with a deeper understanding of the personal aspects of athletics. It also empowers readers with the knowledge of how sports can be used to strengthen family bonds.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.905,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.75
    },
    "score": 0.458
  },
  {
    "title": "Ward Credits Father's Dedication for Career Success",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 15 Jun 2025 23:20:31 EST",
    "source": "ESPN",
    "sources": [
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Ward credits his dad for emailing coaches and driving him all over Texas just to get him a chance."
    ],
    "image_url": "",
    "titles": [
      "Cam Ward gives thanks to dad, who helped him reach his dreams"
    ],
    "summary": "Ward attributes his success to his father's dedication, highlighting how his dad played a crucial role in his career by proactively contacting coaches via email and transporting him across Texas to ensure he had opportunities to showcase his talent. This familial support was instrumental in advancing Ward's career.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful context about the importance of familial support in career success. However, it does not report on solutions, improvements, or innovations, which limits its score. Still, it offers a meaningful takeaway for readers about the potential impacts of parental involvement on career development.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.905,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.75
    },
    "score": 0.448
  },
  {
    "title": "Fantasy Football Week 13: Top Player Picks for Every Position",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 15 Jun 2025 22:55:52 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Targets at every position to help you in Week 13 and beyond"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2023/06/30/f0a72a17-e88a-4a97-b0d1-3ef2d56e48f1/brayan-bello-1400-us.jpg",
    "titles": [
      "Fantasy Baseball Week 13 Waiver-Wire: Could a new cutter unlock Brayan Bello's upside? Plus top prospects!"
    ],
    "summary": "This article provides recommendations on players to target for fantasy football teams in Week 13 and beyond, covering every position. It aims to assist fantasy football participants by identifying potential additions to their teams that could improve their chances of success in the competition. The piece likely includes analysis based on recent performances, matchups, and other relevant factors that could influence a player's future contributions.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story is constructive as it provides actionable insights for readers who participate in fantasy football. It offers a deeper understanding of which players to target based on analysis of recent performances and other relevant factors, aiding in decision-making for their teams.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.825,
      "consensus": 0.393,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.397
  },
  {
    "title": "Tillman Scores Twice in US 5-0 Win Over Trinidad in Gold Cup Opener",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 15 Jun 2025 22:51:16 EST",
    "source": "ESPN",
    "sources": [
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Malik Tillman scored twice as the United States built a three-goal, first-half lead and ended a four-game losing streak by routing Trinidad and Tobago 5-0 on Sunday in a Concacaf Gold Cup opener."
    ],
    "image_url": "",
    "titles": [
      "USMNT ends skid, nets 5 in Gold Cup opening win"
    ],
    "summary": "Malik Tillman scored two goals, helping the United States secure a 5-0 victory over Trinidad and Tobago in their Concacaf Gold Cup opener. This win ended the U.S. team's four-game losing streak, with the team establishing a three-goal lead in the first half of the match.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness of a specific sports event, reporting on the outcome and highlighting individual performance. However, it lacks depth or insight into the strategies used, the significance of the win, or the implications for future games.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.896,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.75
    },
    "score": 0.416
  },
  {
    "title": "Angel Reese Secures First Triple-Double in Sky's 78-66 Win Over Sun",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 15 Jun 2025 22:51:16 EST",
    "source": "ESPN",
    "sources": [
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Angel Reese had 11 points, 11 assists and 13 rebounds for her first career triple-double in the Sky's 78-66 win over the Sun on Sunday."
    ],
    "image_url": "",
    "titles": [
      "Sky's Reese 2nd youngest to record triple-double"
    ],
    "summary": "Angel Reese achieved her first career triple-double with 11 points, 11 assists, and 13 rebounds, leading the Sky to a 78-66 victory over the Sun on Sunday. This performance marked a significant milestone for Reese in her basketball career.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness of a specific player's achievement and the game outcome. However, it does not provide much depth or insight into the player's journey, the significance of the achievement, or how it impacts the team's standing or future games.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.896,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.75
    },
    "score": 0.416
  },
  {
    "title": "Aaron Judge Blames Self for Yankees' Series Loss to Red Sox",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 15 Jun 2025 22:51:16 EST",
    "source": "ESPN",
    "sources": [
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Aaron Judge blamed himself for swinging at pitches outside the strike zone as the Yankees were swept in a three-game series at the Red Sox."
    ],
    "image_url": "",
    "titles": [
      "Judge 1-for-12 as NY swept: Got to swing at strikes"
    ],
    "summary": "Aaron Judge attributed the Yankees' series loss to the Red Sox to his own performance, specifically criticizing himself for swinging at pitches outside the strike zone during the three-game sweep.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "This story is primarily reactive, focusing on a specific event and individual's performance. It does not provide actionable insights or deeper understanding of the sport, nor does it report on solutions or improvements. It offers basic awareness of the event but minimal depth or insight.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.896,
      "consensus": 0.393,
      "constructiveness": 0.2,
      "proximity": 0.75
    },
    "score": 0.386
  },
  {
    "title": "\"How to Train Your Dragon\" Live-Action Soars in Opening Weekend",
    "domain": "business",
    "location": "global",
    "published": "Sun, 15 Jun 2025 23:33:54 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "The live-action version of “How to Train Your Dragon,” starring Mason Thames, Nico Parker and Gerard Butler, scored big at its opening weekend at the box office — but what does that mean for the prospects of a sequel?"
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/684f87915bafb0b56eebfe57/0x0.jpg?width=960",
    "titles": [
      "Hoping For ‘How To Train Your Dragon 2’? Here’s Some Good News"
    ],
    "summary": "The live-action adaptation of \"How to Train Your Dragon,\" featuring Mason Thames, Nico Parker, and Gerard Butler, achieved significant success during its opening weekend at the box office. This strong performance may indicate potential for a sequel, although no official announcement has been made regarding future installments.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness of the success of the movie during its opening weekend. However, it does not provide deeper insights or actionable information for the reader. The possibility of a sequel is mentioned, which indicates a potential future trend, but without concrete information, it remains speculative.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.909,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.401
  },
  {
    "title": "Infrastructure Repair Program Targets Bridges and Tunnels",
    "domain": "business",
    "location": "global",
    "published": "Sun, 15 Jun 2025 23:01:10 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Strategy will start with programme to repair crumbling bridges, flyovers and tunnels"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Fff5b043e-3a8e-4b63-a117-aa392aaa7be5.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Reeves to set out 10-year UK infrastructure plan"
    ],
    "summary": "The strategy announced focuses on initiating a program aimed at repairing deteriorating infrastructure, specifically targeting bridges, flyovers, and tunnels. This program represents the initial phase in a broader plan to address and improve the condition of critical infrastructure.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive. It informs readers about a new program aimed at improving infrastructure, providing actionable insights about the government's plans. It highlights a solution to a problem (deteriorating infrastructure), and increases clarity around a system (infrastructure repair and improvement).",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.827,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.424
  },
  {
    "title": "Red Sox Trade Rafael Devers to Giants After Yankees' Rough Weekend",
    "domain": "business",
    "location": "global",
    "published": "Sun, 15 Jun 2025 22:28:03 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "The best news to emerge for the Yankees out of a lost weekend in Fenway Park was the Red Sox trading Rafael Devers to the Giants hours later."
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/684f7606a6c2d6a191342c28/0x0.jpg?width=960",
    "titles": [
      "Yankees Experience Lost Weekend In Boston And Then See Rafael Devers Moved Out Of The AL East"
    ],
    "summary": "The New York Yankees experienced a disappointing weekend at Fenway Park, but a significant development occurred shortly after when the Boston Red Sox traded their player Rafael Devers to the San Francisco Giants. This move is seen as the most positive news for the Yankees following their recent performance.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers basic awareness of a recent event in the sports world, but it doesn't provide any actionable insights or deeper understanding for the reader. It also doesn't report on solutions, improvements, or attempts to solve problems.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.888,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.369
  },
  {
    "title": "Xi Jinping Visits Kazakhstan to Boost China's Influence in Central Asia",
    "domain": "business",
    "location": "global",
    "published": "Sun, 15 Jun 2025 22:00:00 GMT",
    "source": "Bloomberg",
    "sources": [
      "Bloomberg"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMitAFBVV95cUxQT1pia2hJelExMVNhOWFIcXVBNzVCQnhXU1dUU0U4MTc1RS1DVW8wYkFTYURyVHBGdTJCc3ZOelFpOEN5c0NFeS0wYW5uS19DaGRQU3AzekZ0M0I3VGVGQ3JwNG5fUjJwVUhGMGxoVGhRb0JtdWp6RVRqSFJ6VWp4UmR0UkJPNHFWTnNPMTlpWU8taDR4S1hvTGNCMDk5Q250bjhXa0UzWUp2UTc2NzgtbjcyWk4?oc=5\" target=\"_blank\">Xi Takes Push for Global Sway to Central Asia With Kazakh Visit</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Bloomberg</font>"
    ],
    "image_url": "",
    "titles": [
      "Xi Takes Push for Global Sway to Central Asia With Kazakh Visit - Bloomberg"
    ],
    "summary": "Chinese President Xi Jinping visited Kazakhstan as part of his efforts to extend China's global influence, particularly in Central Asia. This visit underscores China's strategic interest in strengthening ties with Kazakhstan, a key partner in the region.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This news story informs and contextualizes the reader about China's geopolitical strategies and its interest in strengthening ties with Kazakhstan. However, it doesn't offer any solutions or improvements, nor does it provide actionable insights for the reader.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.809,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.391
  },
  {
    "title": "Asia Cup Cricket Tournament Set for UAE Amid India-Pakistan Tensions",
    "domain": "business",
    "location": "global",
    "published": "Sun, 15 Jun 2025 21:54:17 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "The lucrative Asia Cup is set to be played in the United Arab Emirates with officials remaining hopeful a cancellation can be avoided amid India and Pakistan tension."
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/684f4247e6b24ec76a72a5e5/0x0.jpg?width=960",
    "titles": [
      "UAE To Host Cricket’s Asia Cup, But India-Pakistan Tensions Jeopardize Lucrative Event"
    ],
    "summary": "The Asia Cup, a significant cricket tournament, is scheduled to take place in the United Arab Emirates. Despite tensions between India and Pakistan, officials are optimistic that the event will proceed without cancellation. This reflects efforts to maintain sports events despite geopolitical challenges.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful information about the Asia Cup cricket tournament and the geopolitical challenges surrounding it. It also increases awareness about the efforts to maintain sports events despite tensions between countries. However, it doesn't highlight any specific solutions or improvements.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.878,
      "consensus": 0.393,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.407
  },
  {
    "title": "Rare Earth Elements Spark Global Strategic Competition",
    "domain": "business",
    "location": "global",
    "published": "Sun, 15 Jun 2025 20:00:30 GMT",
    "source": "Bloomberg",
    "sources": [
      "Bloomberg"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMiqAFBVV95cUxNb1BvelQxOGdWU3NMX3hzLVM1aWFaNTJlUFhjTENMVGQ2NVdTRlFyVmZsOFgxa2JuQUxCcDZmRmg3MHRWblNEYnpxQTVaQXVMaHpySFBaeEthYlA1VmZ6dUs5SkVwd3pfSG1JbnZlSERDbEJnbld3d2JMLU1XLVQ1RTh1ZXJ0bmVHYWVHZkRXVE1yV004c2QxWHNnTEJwOEtHSWhLZmFpX2U?oc=5\" target=\"_blank\">Chips Won the Cold War. Rare Earths May Win the Next</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Bloomberg</font>"
    ],
    "image_url": "",
    "titles": [
      "Chips Won the Cold War. Rare Earths May Win the Next - Bloomberg"
    ],
    "summary": "Rare earth elements, crucial for modern electronics and military technologies, are at the center of strategic competition, akin to the role of microchips in the Cold War. The current status highlights their importance in global geopolitical dynamics, with nations vying for control and access to these resources to secure technological and military advantages.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides a deeper understanding of the geopolitical dynamics related to the control of rare earth elements. It is useful in contextualizing the importance of these resources in modern electronics and military technologies. However, it does not report on any solutions or improvements.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.776,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.397
  },
  {
    "title": "Topuria to Fight Oliveira for UFC Lightweight Title at UFC 317",
    "domain": "business",
    "location": "global",
    "published": "Sun, 15 Jun 2025 19:02:01 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "We look at the history of the beef between Ilia Topuria and Paddy Pimblett. Topuria fights Charles Oliveira in the main event of UFC 317 for the UFC lightweight title"
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/683b889312aff49e44cb566b/0x0.jpg?width=960",
    "titles": [
      "Ilia Topuria Wants To Fight Paddy Pimblett: “I Hate Him”"
    ],
    "summary": "Ilia Topuria and Paddy Pimblett have a notable rivalry in the UFC, highlighted by their ongoing beef. Topuria is set to fight Charles Oliveira in the main event of UFC 317 for the UFC lightweight title, marking a significant moment in his career amidst this rivalry.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "The story provides basic awareness about an upcoming UFC fight and the rivalry between the fighters. However, it lacks depth or insight into the broader implications of this event, and it does not provide actionable insights or solutions.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.827,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.357
  },
  {
    "title": "Conservative Commentator Stranded in Israel Amid War with Iran",
    "domain": "business",
    "location": "global",
    "published": "Sun, 15 Jun 2025 18:52:14 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "The conservative commentator describes being stranded in Israel as war erupts with Iran. \"Booming in distance. Right above me.\""
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/684f488b07cba904691b70be/0x0.jpg?width=960",
    "titles": [
      "CNN’s Scott Jennings Shares Tense Firsthand Account From Israel"
    ],
    "summary": "A conservative commentator reported being stranded in Israel amid an outbreak of war with Iran, detailing experiences of hearing explosions. The situation underscores the immediate impacts of the conflict on individuals in the affected areas.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness about the immediate impacts of the war between Israel and Iran on individuals in the affected areas. It provides a personal perspective but lacks depth or insight into the broader geopolitical context. It does not provide actionable insights or report on solutions.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.824,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.384
  },
  {
    "title": "Material Transformed from Insulator to Semiconductor by Atom Adjustment",
    "domain": "science",
    "location": "global",
    "published": "Sun, 15 Jun 2025 21:40:14 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/new-material-breaks-the-rules-scientists-turn-insulator-into-a-semiconductor/\" rel=\"nofollow\" title=\"New Material Breaks the Rules: Scientists Turn Insulator Into a Semiconductor\"><img alt=\"Silicone Copolymers Tubes\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"488\" src=\"https://scitechdaily.com/images/Silicone-Copolymers-Tubes-777x488.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>Once considered merely insulating, a change in the angle between silicon and oxygen atoms opens a pathway for electrical charge to flow. A..."
    ],
    "image_url": "",
    "titles": [
      "New Material Breaks the Rules: Scientists Turn Insulator Into a Semiconductor"
    ],
    "summary": "Scientists have successfully transformed an insulating material into a semiconductor by altering the angle between silicon and oxygen atoms. This adjustment allows electrical charge to flow through the material, which was previously thought to only possess insulating properties. This breakthrough could have significant implications for the development of electronic devices.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it reports on a scientific innovation that could potentially change the development of electronic devices. It provides actionable insights into the field of material science and deepens the reader's understanding of how atomic adjustments can alter the properties of a material.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.804,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.413
  },
  {
    "title": "AI Study Finds Dead Sea Scrolls Older Than Thought",
    "domain": "science",
    "location": "global",
    "published": "Sun, 15 Jun 2025 21:15:11 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/new-ai-model-reveals-biblical-dead-sea-scrolls-are-far-older-than-we-thought/\" rel=\"nofollow\" title=\"New AI Model Reveals Biblical Dead Sea Scrolls Are Far Older Than We Thought\"><img alt=\"Dead Sea Scroll Number 28a\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"648\" src=\"https://scitechdaily.com/images/Dead-Sea-Scroll-Number-28a-777x648.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>Using artificial intelligence and radiocarbon dating to determine the age of ancient manuscripts. Since their discovery, the Dead Sea..."
    ],
    "image_url": "",
    "titles": [
      "New AI Model Reveals Biblical Dead Sea Scrolls Are Far Older Than We Thought"
    ],
    "summary": "A new study utilizing artificial intelligence alongside radiocarbon dating techniques has revealed that the Dead Sea Scrolls, ancient biblical manuscripts discovered in the mid-20th century, are significantly older than previously believed. This breakthrough in research methods provides a more accurate estimation of the scrolls' age, offering deeper insights into their historical context and origins.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it informs readers about a new application of artificial intelligence in historical research. It provides a deeper understanding of the Dead Sea Scrolls' historical context and origins, but it does not explicitly report on solutions or improvements.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.797,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.408
  },
  {
    "title": "\"Australian Fossil Tracks May Rewrite Vertebrate Land History\"",
    "domain": "science",
    "location": "global",
    "published": "Sun, 15 Jun 2025 20:50:31 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/shocking-scientists-ancient-fossil-tracks-could-rewrite-the-history-of-life-on-land/\" rel=\"nofollow\" title=\"Shocking Scientists: Ancient Fossil Tracks Could Rewrite the History of Life on Land\"><img alt=\"Annotated Fossil Slab From Australia Showing Two Trackways With Labeled Manus and Pes Prints and Interpreted Movement Paths\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"728\" src=\"https://scitechdaily.com/images/Annotated-Fossil-Slab-From-Australia-Showing-Two-Trackways-With-Labeled-Manus-and-Pes-Prints-and-Interpreted-Movement-Paths-777x728.jpg\"..."
    ],
    "image_url": "",
    "titles": [
      "Shocking Scientists: Ancient Fossil Tracks Could Rewrite the History of Life on Land"
    ],
    "summary": "Scientists have discovered ancient fossil tracks in Australia that could significantly alter the current understanding of the history of life on land. These tracks, believed to be the oldest evidence of vertebrates living on land, suggest that such creatures existed millions of years earlier than previously thought. The fossil slab, annotated to show two distinct trackways with labeled manus and pes prints, along with interpreted movement paths, provides concrete evidence that challenges established timelines for the emergence of vertebrates on terrestrial landscapes.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.79,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.32
  },
  {
    "title": "NASA's PUNCH Mission Captures 3D Solar Storm, Enhances Space Weather Insight",
    "domain": "science",
    "location": "global",
    "published": "Sun, 15 Jun 2025 15:58:14 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/watch-a-massive-solar-storm-unfold-in-3d-captured-by-nasas-punch-mission/\" rel=\"nofollow\" title=\"Watch a Massive Solar Storm Unfold in 3D – Captured by NASA’s PUNCH Mission\"><img alt=\"Solar Activity PUNCH Narrow Field Imager\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"583\" src=\"https://scitechdaily.com/images/Solar-Activity-PUNCH-Narrow-Field-Imager-777x583.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>NASA&#8217;s PUNCH mission, unveiled at an astronomical meeting, uses a four-satellite system to deliver stunning..."
    ],
    "image_url": "",
    "titles": [
      "Watch a Massive Solar Storm Unfold in 3D – Captured by NASA’s PUNCH Mission"
    ],
    "summary": "NASA's PUNCH mission, using a four-satellite system, captured a massive solar storm in 3D. This achievement, unveiled at an astronomical meeting, marks a significant advancement in our ability to observe solar activities and their impacts on space weather. The detailed imagery provides unprecedented insights into the dynamics of solar storms.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it reports on a significant advancement in our ability to observe solar activities. The information provided is useful in understanding the dynamics of solar storms and their impact on space weather, thus contributing to a deeper understanding of the subject.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.714,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.395
  },
  {
    "title": "Astronomers Discover 11 Billion-Year-Old Black Hole Jet",
    "domain": "science",
    "location": "global",
    "published": "Sun, 15 Jun 2025 15:33:10 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/nasa-detects-11-billion-year-old-black-hole-jet-lit-by-the-big-bang/\" rel=\"nofollow\" title=\"NASA Detects 11-Billion-Year-Old Black Hole Jet Lit by the Big Bang\"><img alt=\"Strong Black Hole Jet\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Strong-Black-Hole-Jet-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>Astronomers have found a remarkably powerful jet shooting out from a black hole that formed just 3 billion years after the Big Bang. This jet is so distant that it..."
    ],
    "image_url": "",
    "titles": [
      "NASA Detects 11-Billion-Year-Old Black Hole Jet Lit by the Big Bang"
    ],
    "summary": "Astronomers have discovered a powerful jet emanating from a black hole that was formed approximately 3 billion years after the Big Bang, making it around 11 billion years old. This discovery provides insight into the early universe's phenomena and the formation of black holes.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is informative and provides useful insights into the early universe's phenomena and the formation of black holes. However, it does not clearly highlight progress or solutions, which is why it doesn't score a perfect 1.0.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.708,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.384
  },
  {
    "title": "Nice Hosts Global Ocean Science and Politics Summit",
    "domain": "science",
    "location": "global",
    "published": "Sun, 15 Jun 2025 15:20:01 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "For the past fortnight, the city of Nice in France has been the global epicenter of ocean science and politics."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/new-zealand-shoreline.jpg",
    "titles": [
      "NZ has a vast sea territory but lags behind other nations in protecting the ocean"
    ],
    "summary": "Over the past two weeks, Nice, France, has become the worldwide focal point for discussions and developments in ocean science and politics. This gathering has united international experts and policymakers to address and advance key issues related to the marine environment.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story increases awareness about the global discussions and developments in ocean science and politics. However, it lacks depth as it does not provide specific details about the key issues addressed or the solutions proposed at the summit.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.766,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.375
  },
  {
    "title": "Hubble Telescope Reveals Uranus' Moons Darker on Far Side",
    "domain": "science",
    "location": "global",
    "published": "Sun, 15 Jun 2025 15:08:11 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/hubbles-dusty-surprise-why-uranus-moons-are-darker-on-the-wrong-side/\" rel=\"nofollow\" title=\"Hubble’s Dusty Surprise: Why Uranus’ Moons Are Darker on the “Wrong” Side\"><img alt=\"Two Faces of Uranus (Hubble)\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"437\" src=\"https://scitechdaily.com/images/Two-Faces-of-Uranus-Hubble-777x437.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>New surface data from largest Uranian moons are contrary to expectations. Astronomers using NASA’s Hubble Space Telescope set out to study how..."
    ],
    "image_url": "",
    "titles": [
      "Hubble’s Dusty Surprise: Why Uranus’ Moons Are Darker on the “Wrong” Side"
    ],
    "summary": "Astronomers using NASA's Hubble Space Telescope have discovered that the largest moons of Uranus are darker on the side facing away from the planet, contrary to expectations. This unexpected finding suggests that these moons are being coated by a layer of dark material, possibly from micrometeoroid impacts or other sources, leading to their surprising appearance. This discovery challenges previous understandings of the moons' surfaces and their interactions with the space environment.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The story provides useful insights into the new discovery about Uranus' moons, enhancing the reader's understanding of astronomy. It also increases awareness about the space environment and the interactions of celestial bodies within it. However, it doesn't report on any solutions, improvements, or innovations.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.702,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.382
  },
  {
    "title": "UCLA Engineers Develop New 3D Point Spread Function Framework",
    "domain": "science",
    "location": "global",
    "published": "Sun, 15 Jun 2025 11:40:08 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Engineers at the UCLA Samueli School of Engineering have introduced a universal framework for point spread function (PSF) engineering, enabling the synthesis of arbitrary, spatially varying 3D PSFs using diffractive optical processors. The research is published in the journal Light: Science & Applications."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/universal-programming.jpg",
    "titles": [
      "Universal framework enables custom 3D point spread functions for advanced imaging"
    ],
    "summary": "Engineers at UCLA have developed a new framework for point spread function (PSF) engineering, allowing for the creation of diverse, 3D PSFs that vary spatially through diffractive optical processors. This advancement, detailed in the journal Light: Science & Applications, marks a significant step in optical engineering, providing a method to synthesize arbitrary PSFs for various applications.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story reports on an innovation in the field of optical engineering, contributing to the reader's understanding and awareness of advancements in this field. It also provides actionable insights for those in the field who might benefit from using this new framework. However, it could provide more context about the potential impacts or applications of this development.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.709,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.394
  }
]