[
  {
    "title": "Court Rules Trump Can't Fire Fed Governor Cook, Cites Due Process Rights",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Mon, 15 Sep 2025 20:57:53 -0400",
    "source": "NPR",
    "sources": [
      "Axios",
      "Al Jazeera",
      "Fortune",
      "Forbes",
      "NPR"
    ],
    "domains": [
      "fortune.com",
      "news.google.com",
      "www.npr.org",
      "www.aljazeera.com",
      "www.forbes.com"
    ],
    "snippets": [
      "A federal appeals court blocked President Trump from firing Federal Reserve governor Lisa Cook, just ahead of a key vote on interest rates.",
      "Cook&#039;s claim that she was denied due process has a &#039;strong likelihood of success&#039;, court rules",
      "<a href=\"https://news.google.com/rss/articles/CBMiY0FVX3lxTE41NFhYeDhtdTdXZW1DTEVxX3V2a2lyYXpHY0hUSFhZQm82YjMxZXB3a1J1M29fcjRGNGoyTmtGbklrMGxtWlVwRnJsYnIzM1NtRFEyZS05LWNuTk9HekZOU0pNMA?oc=5\" target=\"_blank\">Appeals court rules Fed governor Cook can continue to serve</a>&nbsp;&nbsp;<font color=\"#6f6f",
      "The ruling comes on the same day the Senate voted along party lines to approve Trump’s economic adviser Stephen Miran’s nomination for the Federal Reserve board.",
      "In a 2-1 decision, the appeals court found that Cook's due process rights were violated because the administration did not give her a formal opportunity to respond to the charges."
    ],
    "image_url": "",
    "titles": [
      "Appeals court says Lisa Cook can stay on the Federal Reserve board -- for now",
      "US appeals court blocks Trump’s bid to fire Lisa Cook from Federal Reserve",
      "Appeals court rules Fed governor Cook can continue to serve - Axios",
      "Federal Appeals Court Blocks Trump’s Bid To Fire Fed Governor Lisa Cook Ahead Of Rate Cut Meeting",
      "Appeals court rejects Trump’s bid to oust Lisa Cook from the Fed ahead of crucial interest rate decision"
    ],
    "score_components": {
      "magnitude": 0.964,
      "recency": 0.86,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.833,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A federal appeals court ruled that President Trump cannot fire Federal Reserve governor Lisa Cook, citing a 'strong likelihood of success' for Cook's due process claim. The court's 2-1 decision highlighted that Cook was not given a formal chance to respond to charges, violating her due process rights. This ruling came as the Senate approved Trump’s nominee Stephen Miran for the Federal Reserve board. Cook can continue to serve on the Federal Reserve.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Sues NY Times for $15B, Alleging Defamation in Epstein Note Coverage",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 16 Sep 2025 04:57:35 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Deutsche Welle",
      "Business Insider",
      "Financial Times",
      "CNBC",
      "The Guardian"
    ],
    "domains": [
      "www.cnbc.com",
      "www.dw.com",
      "www.theguardian.com",
      "www.businessinsider.com",
      "www.ft.com",
      "www.bbc.com"
    ],
    "snippets": [
      "He has accused the paper of defamation and libel, saying it served as a \"mouthpiece\" for Democrats.",
      "The US president has filed a multi-billion dollar lawsuit against the paper. The filing comes a week after it published a suggestive note that Trump allegedly wrote to Jeffrey Epstein.",
      "Trump has initiated a flurry of defamation lawsuits against media companies, accusing them of false or misleading coverage.",
      "US president accuses media organisation of being ‘mouthpiece’ for Democratic party",
      "<p>US president announces defamation and libel action in Florida, accusing title of being ‘virtual mouthpiece’ for Democrats</p><p>Donald Trump has filed a $15bn defamation lawsuit against the New York Times and four of its journalists.</p><p>The lawsuit, filed in a US district court in Florida on M",
      "Trump said he is filing a $15 billion defamation and libel lawsuit against The Times in Florida."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/2832/live/710c7e40-92b7-11f0-84c8-99de564f0440.jpg",
    "titles": [
      "Trump says he will sue New York Times for $15bn",
      "Trump sues The New York Times for defamation",
      "Trump sues The New York Times for $15 billion, alleging defamation and libel",
      "Trump files $15bn defamation lawsuit against New York Times",
      "Donald Trump says he is bringing $15bn lawsuit against New York Times",
      "Trump says he is bringing a $15 billion lawsuit against The New York Times"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.915,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.833,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Donald Trump has filed a $15 billion defamation and libel lawsuit against The New York Times and four of its journalists in Florida, accusing the newspaper of being a \"mouthpiece\" for the Democratic party. This legal action follows a recent publication by the newspaper of a note Trump allegedly wrote to Jeffrey Epstein, which Trump claims is false. This lawsuit is part of Trump's broader campaign of litigation against media organizations over their coverage.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Phillies Clinch NL East Title Again with 6-5 Win Over Dodgers",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 16 Sep 2025 01:30:02 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN",
      "Sportsnet",
      "Yahoo Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "www.sportingnews.com",
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "Kyle Schwarber, Weston Wilson and Bryce Harper homered, and the Phillies wrapped up their second straight National League East title with a thrilling 6-5 victory over the Dodgers on Monday night.",
      "The Phillies pulled away from the Mets in September",
      "The Philadelphia Phillies have officially clinched the NL East after a close victory against the Los Angeles Dodgers.",
      "<p>J.T. Realmuto drove in the go-ahead run on a sacrifice fly in the 10th inning, capping a wild 6-5 comeback victory by the Philadelphia Phillies over the Los Angeles Dodgers that clinched the NL East title in the series opener between division leaders.</p>"
    ],
    "image_url": "",
    "titles": [
      "Phillies clinch NL East with wild win vs. Dodgers",
      "Phillies win NL East for second straight season, beat Dodgers in extras in clinching victory",
      "Phillies clinch NL East after extra-inning win",
      "Phillies clinch NL East title in wild 10th-inning comeback against Dodgers"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.945,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.81,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Philadelphia Phillies clinched their second consecutive National League East title with a 6-5 win over the Los Angeles Dodgers, highlighted by home runs from Kyle Schwarber, Weston Wilson, and Bryce Harper. The victory, secured by J.T. Realmuto's go-ahead sacrifice fly in the 10th inning, marked a significant comeback in the series opener between the division leaders. This win also solidified the Phillies' position ahead of the Mets in September.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Orders National Guard to Memphis, Citing Crime Concerns",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Tue, 16 Sep 2025 04:32:48 +0000",
    "source": "Al Jazeera",
    "sources": [
      "The Guardian",
      "Deutsche Welle",
      "Al Jazeera",
      "Axios"
    ],
    "domains": [
      "www.dw.com",
      "www.aljazeera.com",
      "www.theguardian.com",
      "news.google.com"
    ],
    "snippets": [
      "The city&#039;s Democratic mayor, Paul Young, says the &#039;decision has been made&#039; but does not think it will drive down crime.",
      "Donald Trump claims crime is out of control in Memphis. Critics argue that the National Guard deployment is another example of the US president's authoritarianism.",
      "<a href=\"https://news.google.com/rss/articles/CBMihAFBVV95cUxOV0VlOU1CZEVvVUZhYmpsOEtZUGN4WTJfckdiaEdKT3U4c1dtanVQMVM4S2wxV1N5RmYxbG1EZ0ZuMURWSmtpTUxOWUJvN3l4YWI5YW56TmlfNW9yaHNJaXNycFZMdG81dGp6Qm00ZmhOWWkzaUlWSEhKN1dwWXBHM2h3VEg?oc=5\" target=\"_blank\">Trump sending National Guard to Memphis, says Ch",
      "<p>Move is latest push by administration to expand military-led response to urban crime in  Democratic-run cities</p><p>Donald Trump on Monday signed an executive order that would send national guard troops into Memphis, in a “replica” of the administration’s expanding military-led response to urban"
    ],
    "image_url": "",
    "titles": [
      "Trump orders National Guard troops to Memphis in latest military deployment",
      "Trump deploys National Guard to Memphis, vows Chicago next",
      "Trump sending National Guard to Memphis, says Chicago's \"probably next\" - Axios",
      "Trump to send national guard to Memphis and says Chicago is ‘probably next’"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.927,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.782,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "President Donald Trump signed an executive order to deploy National Guard troops to Memphis, citing high crime rates. This action is part of his administration's broader strategy to address urban crime in Democratic-run cities. Memphis Mayor Paul Young, a Democrat, acknowledged the decision but expressed doubts about its effectiveness in reducing crime. Critics of the move view it as an example of Trump's authoritarian approach.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "US, China Near TikTok Deal, Trump and Xi to Finalize Soon",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-09-15T14:38:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "New York Times",
      "Axios",
      "Deutsche Welle",
      "TechCrunch",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "www.nytimes.com",
      "www.dw.com",
      "techcrunch.com",
      "news.google.com"
    ],
    "snippets": [
      "US President Donald Trump and his Chinese counterpart Xi Jinping could finalize the deal on the Chinese-owned video platform TikTok in the coming days.",
      "<a href=\"https://news.google.com/rss/articles/CBMicEFVX3lxTE1POG81aXZRMHhPSlpOdlBvMXZpVC1JUkN1OVUtaVk2aEdOVTVNVEpKaDNVSm9oRGVRTDJmaWQxZUNXazdINHc1YzIyV0I4bmpYX3lTQ2xXTjhabk1VVWJfTzFxVENQUWUzWlAtV2NzaGQ?oc=5\" target=\"_blank\">Trump suggests TikTok deal, will talk to China's Xi on Friday</a>&nbsp;&nbsp",
      "The U.S. and China have a 'framework' deal for social media platform TikTok in place, Treasury Secretary Scott Bessent said Monday.",
      "Top economic officials met in Madrid for a second day, with deadlines looming on tariffs and a ban on TikTok in the United States if it is not sold by its Chinese owner, ByteDance.",
      "The \"framework\" deal with China is\n\"between two private parties, but the commercial terms have been agreed upon,\" CNBC quoted Bessent as saying on the sidelines of a meeting between the two countries in Madrid on Monday."
    ],
    "image_url": "",
    "titles": [
      "US reaches 'framework' TikTok deal with China, Trump and Xi to speak",
      "Trump suggests TikTok deal, will talk to China's Xi on Friday - Axios",
      "Bessent: TikTok deal 'framework' reached with China, Trump and Xi will finalize it Friday",
      "U.S. and China Reach ‘Framework’ for a TikTok Sale",
      "US, China reach ‘framework’ deal for TikTok"
    ],
    "score_components": {
      "magnitude": 0.984,
      "recency": 0.694,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.782,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "US President Donald Trump and Chinese President Xi Jinping are nearing a deal on TikTok, as announced by Treasury Secretary Scott Bessent. They have established a 'framework' agreement aimed at resolving the long-standing dispute over the video platform's ownership due to security concerns. Bessent, speaking from Madrid, noted the progress during trade talks with China. Trump also mentioned that discussions have been successful and anticipates a call with Xi Jinping within the week to finalize the agreement.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Tom Brady to Play in Flag Football Event in Riyadh with NFL Stars",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Tue, 16 Sep 2025 03:12:05 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sportsnet",
      "Sky Sports",
      "Yahoo Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "www.skysports.com",
      "www.sportsnet.ca",
      "www.bbc.com"
    ],
    "snippets": [
      "The seven-time Super Bowl champ is getting back on the football field next year",
      "Tom Brady says he &quot;couldn't be more excited to return to the field&quot; as he announces he will play in a flag football tournament in Saudi Arabia next year.",
      "Tom Brady plans to play alongside current and former NFL stars in a three-team flag football tournament in Saudi Arabia next year, the seven-time Super Bowl-winning quarterback said on Monday.",
      "<p>Tom Brady plans to play alongside current and former NFL stars in a three-team flag football tournament in Saudi Arabia next year, the seven-time Super Bowl-winning quarterback and Fox Sports analyst said Monday.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/15/c87ff194-2026-47e6-b1d5-9d417f706de3/brady2025.jpg",
    "titles": [
      "Tom Brady to join several current NFL stars in 2026 competitive flag football tournament",
      "NFL great Brady to play in flag football event",
      "Brady to play alongside NFL stars in Saudi flag football tournament",
      "Tom Brady to play in Saudi flag football tournament with current and former NFL stars"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.901,
      "consensus": 0.908,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.779,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Tom Brady announced his participation in \"The Fanatics Flag Football Classic,\" a three-team flag football tournament in Riyadh, Saudi Arabia, scheduled for March 21. The event, in collaboration with Fanatics, Fox Sports, and OBB Media, will feature Brady playing alongside current and former NFL stars, including retired Patriots player Rob Gronkowski. Brady referred to his involvement as \"coming out of retirement\" for this occasion.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: collaboration",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "US Strikes Drug Cartel Vessel, 3 Dead; Trump Signals More Actions Ahead",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Tue, 16 Sep 2025 01:31:04 -0400",
    "source": "NPR",
    "sources": [
      "Washington Post",
      "Deutsche Welle",
      "NPR"
    ],
    "domains": [
      "www.dw.com",
      "www.washingtonpost.com",
      "www.npr.org"
    ],
    "snippets": [
      "President Trump said the U.S. military on Monday again targeted a boat allegedly carrying drugs from Venezuela, killing three aboard the vessel.",
      "The strike comes two weeks after the US targeted what the Trump administration said was a drug vessel from Venezuela. The Venezuelan president has vowed to defend against Washington's \"aggression.\"",
      "The president also signaled that his administration was preparing to take military action against Latin American cartels that move narcotics over land.",
      "Nearly two weeks after a deadly U.S. strike on a boat in the Caribbean, questions loom over Trump’s new war on terror and drugs. This afternoon, Trump announced another strike on a boat from Venezuela."
    ],
    "image_url": "",
    "titles": [
      "Trump says the U.S. military targeted a boat allegedly carrying drugs from Venezuela",
      "Trump says US hit another drug boat from Venezuela",
      "U.S. kills 3 in strike on alleged drug boat from Venezuela, Trump says",
      "Why the U.S. military is striking boats from Venezuela"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.946,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.775,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The US conducted a strike against a vessel in international waters, which President Trump described as targeting \"extraordinarily violent drug trafficking cartels\" bound for the US. This action follows a recent operation against a drug vessel from Venezuela and comes amidst tensions with Venezuelan President Maduro, who has promised to defend against US \"aggression.\" The strike resulted in the deaths of three individuals. Additionally, President Trump has indicated plans for further military actions against Latin American cartels involved in narcotics trafficking.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "US Strikes Drug Cartel Vessel, 3 Dead; Trump Signals More Actions Ahead",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 15 Sep 2025 22:21:43 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The attack came after the Venezuelan president said Caracas would defend itself against US \"aggression\".",
      "Attack targeted US-bound &#039;extraordinarily violent drug trafficking cartels&#039; in international waters, Trump says.",
      "<p>President says three people killed in strike against vessel he said was transporting drugs ‘headed to the US’</p><p><a href=\"https://www.theguardian.com/us-news/donaldtrump\">Donald Trump</a> said on Monday that the United States had carried out a strike on a second <a href=\"https://www.theguardia"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/3f40/live/3bfcd330-9271-11f0-b8e5-3be75a11e2ba.png",
    "titles": [
      "US destroys alleged Venezuelan drug boat, killing three",
      "Trump says US struck second Venezuelan drug vessel, killing three",
      "Trump announces deadly US strike on another alleged Venezuelan drug boat"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.798,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.72,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The US conducted a strike against a vessel in international waters, which President Trump described as targeting \"extraordinarily violent drug trafficking cartels\" bound for the US. This action follows a recent operation against a drug vessel from Venezuela and comes amidst tensions with Venezuelan President Maduro, who has promised to defend against US \"aggression.\" The strike resulted in the deaths of three individuals. Additionally, President Trump has indicated plans for further military actions against Latin American cartels involved in narcotics trafficking.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "JD Vance to Host \"The Charlie Kirk Show\" in Tribute to Friend on Monday",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Mon, 15 Sep 2025 15:51:28 -0400",
    "source": "NPR",
    "sources": [
      "The Guardian",
      "NPR",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "www.theguardian.com",
      "www.npr.org"
    ],
    "snippets": [
      "The broadcast was a striking reminder of Kirk's influence, both as a leader in the young conservative space and a behind-the-scenes political player who helped shape President Trump's agenda.",
      "<a href=\"https://news.google.com/rss/articles/CBMieEFVX3lxTE5ONGk0RFRJWVFaM09FYnpKOW93Q0NjWGJFbElOU1dGbnFXWXdaVjN2bVBnUDEwU2J1OXFnNGI4RVV6R2ljN1ptVkJCcEprc3lFcXdjMDZ2dTZOZEU3WGFlRGQxRHRMdGNiQk05LTNuM2NKbFd0V3o4dQ?oc=5\" target=\"_blank\">JD Vance takes the mic to host \"The Charlie Kirk Show\" Monday</a>",
      "<p>Vice-president says White House will pursue those who praise Kirk’s death and groups that ‘promote terrorism’</p><p><a href=\"https://www.theguardian.com/us-news/jd-vance\">JD Vance</a> has assailed what he called the “far left” and its increased tolerance for violence while guest-hosting Charlie K"
    ],
    "image_url": "",
    "titles": [
      "JD Vance hosts 'The Charlie Kirk Show,' paying tribute with top White House officials",
      "JD Vance takes the mic to host \"The Charlie Kirk Show\" Monday - Axios",
      "JD Vance threatens crackdown on ‘far-left’ groups after Charlie Kirk shooting"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.773,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.716,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "JD Vance announced he will host \"The Charlie Kirk Show\" on Monday, inviting people to join him in paying tribute to his friend. This news was shared by Vance on the social media platform X.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "China Finds Nvidia's Mellanox Buyout Violates Anti-Monopoly Laws",
    "domain": "technology",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Mon, 15 Sep 2025 21:06:58 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Ars Technica",
      "TechCrunch",
      "Al Jazeera"
    ],
    "domains": [
      "techcrunch.com",
      "www.aljazeera.com",
      "arstechnica.com"
    ],
    "snippets": [
      "The claim came as the US and China held trade talks in Madrid that concluded on Monday.",
      "China is investigating Nvidia's 2020 acquisition of Mellanox Technologies as trade tensions between the U.S. and China heat up.",
      "Regulator’s statement comes as US and Chinese officials meet in Madrid for trade talks."
    ],
    "image_url": "",
    "titles": [
      "China accuses Nvidia of violating anti-monopoly laws",
      "China says Nvidia violated antitrust regulations",
      "China rules that Nvidia violated its antitrust laws"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.794,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.713,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "China's market regulator declared on Monday that Nvidia breached the nation's anti-monopoly laws through its 2020 acquisition of Mellanox. This development occurs amidst escalating tensions between the US and China, with both countries' officials currently engaged in trade discussions in Madrid.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Blue Jays' Yesavage Sets Franchise Record in MLB Debut, Beats Rays 2-1",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Mon, 15 Sep 2025 20:44:30 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sportsnet",
      "Yahoo Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "clutchpoints.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Yesavage was the Blue Jays' first-round pick in 2024",
      "Trey Yesavage razzled and dazzled in his first career start for the Blue Jays en route to a 2-1 win over the Rays.",
      "<p>Toronto Blue Jays top prospect Trey Yesavage discusses his MLB debut after setting a franchise record with nine strikeouts and watching his team rally for a 2-1 victory over the Tampa Bay Rays.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/14/82623a86-9334-45b9-892a-f7f4c4114a47/091325-treyyesavage.jpg",
    "titles": [
      "Blue Jays calling up top pitching prospect Trey Yesavage for MLB debut, will start Monday vs. Rays",
      "Blue Jays’ Trey Yesavage shares true feelings after 9-K MLB debut",
      "Blue Jays’ Yesavage on impressive debut: ‘Feeling of peace out there’"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.788,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.694,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Trey Yesavage, the Toronto Blue Jays' first-round pick in 2024, made a remarkable MLB debut by setting a franchise record with nine strikeouts in his first career start, leading the Blue Jays to a 2-1 victory over the Tampa Bay Rays.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Tom Brady Spotted in Coaching Booth During Raiders-Chargers Game",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 16 Sep 2025 01:30:02 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "Raiders minority owner Tom Brady was seen wearing a headset in the team's coaching booth during Monday's game vs. the Chargers.",
      "Brady is juggling life as a broadcaster and minority owner"
    ],
    "image_url": "",
    "titles": [
      "Brady shown in Raiders' coaching booth on MNF",
      "Tom Brady joins Raiders coaches in booth on 'MNF' as involvement in offensive game planning comes to light"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.945,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.676,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Tom Brady, a minority owner of the Raiders, was observed wearing a headset in the coaching booth during the team's Monday game against the Chargers. This action highlights his dual role as both a broadcaster and a minority owner of the team.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Astros' Yordan Alvarez Exits Game with Left Ankle Sprain",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 16 Sep 2025 01:30:02 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "Astros All-Star left fielder Yordan Alvarez left Monday's game against the Rangers because of a left ankle sprain.",
      "Alvarez sprained his left ankle while crossing the plate"
    ],
    "image_url": "",
    "titles": [
      "Astros' Alvarez set for MRI after injury at plate",
      "Yordan Alvarez injury update: Astros slugger leaves pivotal game vs. Rangers after slipping on plate"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.945,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.676,
    "summary_source": "snippet",
    "summary_reason": "retry_exhausted",
    "summary": "Astros All-Star left fielder Yordan Alvarez left Monday's game against the Rangers because of a left ankle sprain.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Week 2 Waiver Wire Picks Identified Amid Injury Wave",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 16 Sep 2025 01:30:02 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "Highlighting available signal-callers after an injury-filled weekend, as well as other helpful options ahead of Week 3.",
      "The Inside the Lines team has powered CBS Fantasy Projections for well over a decade and has identified the top waiver wire pickups heading into Week 2 based on the players with the highest projected rest of season position ranking (PPR) but rostered in under 70% of leagues."
    ],
    "image_url": "",
    "titles": [
      "🧐 Fantasy football free agent pickups",
      "Inside the Lines' fantasy football top waiver wire pickups: Rattler at QB, Hunt RB, Shaheed WR, Fannin TE"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.945,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.676,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Inside the Lines team, known for powering CBS Fantasy Projections for over a decade, has identified key waiver wire pickups for Week 2. These recommendations are based on players with the highest projected rest of season rankings in PPR leagues but are rostered in under 70% of leagues. This comes after a weekend marked by significant injuries, highlighting the need for strategic pickups, especially among signal-callers, ahead of Week 3.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Buccaneers Clinch 20-19 Victory Over Texans in Final Seconds",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 16 Sep 2025 02:26:46 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "Tampa Bay put together an 11-play drive to steal the win, with Rachaad White punching in the winner.",
      "<p>Baker Mayfield led an 11-play, 80-yard drive capped by Rachaad White’s two-yard touchdown run with six seconds left, and the Tampa Bay Buccaneers rallied past the Houston Texans 20-19 on Monday night.</p>"
    ],
    "image_url": "",
    "titles": [
      "Baker Mayfield leads late drive as Buccaneers stun Texans in Houston",
      "Baker Mayfield, Rachaad White rally Buccaneers to win over Texans"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.964,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.673,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Baker Mayfield led the Tampa Bay Buccaneers on an 11-play, 80-yard drive, culminating in a two-yard touchdown run by Rachaad White with six seconds remaining, to secure a 20-19 victory over the Houston Texans on Monday night.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UN Report Accuses Israel of Genocide in Gaza; Spain Calls for Sporting Sanctions",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 16 Sep 2025 07:01:46 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.bbc.com"
    ],
    "snippets": [
      "A new report accuses Israel of committing genocide in Gaza, in \"the strongest and most authoritative UN finding to date\".",
      "This is a breaking news story.",
      "Spanish Prime Minister Pedro Sanchez says Israel must face the same sporting sanctions as Russia did after Ukraine war."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/b3dd/live/7a273a60-92c1-11f0-aabe-7b11bbfd55ab.jpg",
    "titles": [
      "Jeremy Bowen: UN genocide report a blunt indictment of Israel's actions in Gaza",
      "UN inquiry finds Israel’s war on Gaza to be genocide",
      "Spanish PM calls for Israel’s ban from sporting events over Gaza genocide"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.956,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.66,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A UN report has accused Israel of committing genocide in Gaza, marking the most authoritative finding of its kind to date. Concurrently, Spanish Prime Minister Pedro Sanchez has called for Israel to face sporting sanctions similar to those imposed on Russia following the Ukraine war.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Champions League Focuses on Teens; Tudor Picks Trio for Dortmund Clash",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 16 Sep 2025 05:10:06 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Yahoo Sports"
    ],
    "domains": [
      "onefootball.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The Champions League is back this week and BBC Sport has taken a look at 10 teenagers who will be aiming to impress this season.",
      "La Gazzetta dello SportIt’s our turnStadium, h.21:00. Tudor picks Yildiz and two strikers (Openda and David favourites) for the assault on Dortmund.Inter at Ajax’s home, Chivu to make at least fou..."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/0efa/live/2241b9e0-89a4-11f0-9cf6-cbf3e73ce2b9.png",
    "titles": [
      "Ten teenage stars to look out for in Champions League",
      "Today’s Papers – Champions League, it’s our turn"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.919,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.639,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Champions League resumed this week, with a spotlight on 10 promising teenagers featured by BBC Sport. In related news, La Gazzetta dello Sport reported on Tudor's selection of Yildiz and two forwards, Openda and David, for the upcoming match against Dortmund. Additionally, Inter is set to play at Ajax's home, with Chivu aiming for a positive outcome.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "RFK Jr. Appoints New CDC Vaccine Advisers Ahead of Key Meeting",
    "domain": "technology",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Mon, 15 Sep 2025 17:04:32 -0400",
    "source": "NPR",
    "sources": [
      "Ars Technica",
      "NPR"
    ],
    "domains": [
      "arstechnica.com",
      "www.npr.org"
    ],
    "snippets": [
      "Health Secretary Robert F. Kennedy Jr. picks more new vaccine advisers to the Centers for Disease Control and Prevention, days before a two-day meeting to consider COVID and hepatitis B shots.",
      "The panel will meet this week and could limit access to measles, Hep B, COVID vaccines."
    ],
    "image_url": "",
    "titles": [
      "5 new members added to CDC vaccine advisory panel ahead of key meeting",
      "RFK Jr. adds more anti-vaccine members to CDC vaccine advisory panel"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.793,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.639,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Health Secretary Robert F. Kennedy Jr. appointed new vaccine advisers to the CDC ahead of a meeting to discuss COVID and hepatitis B vaccines. The panel, meeting this week, may consider changes to the availability of measles, Hepatitis B, and COVID vaccines.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Google President Optimistic About UK, Opens First Data Centre",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 16 Sep 2025 04:00:15 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Google's president and chief investment officer Ruth Porat tells the BBC there are \"profound opportunities in the UK\".",
      "<p>Rachel Reeves says move is a ‘vote of confidence’ in British economy as she prepares to open firm’s first UK datacentre</p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/sep/16/uk-wage-growth-slows-jobs-market-cools-business-live-news-updates\">Business live – latest updates</a"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/389b/live/674d8820-9287-11f0-a951-dbb92f84a2fc.jpg",
    "titles": [
      "Google owner reveals £5bn AI investment in UK ahead of Trump visit",
      "Google announces £5bn AI investment in UK before Trump visit"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.897,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.634,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Google's president, Ruth Porat, expressed optimism about the UK, highlighting \"profound opportunities.\" Concurrently, Rachel Reeves views Google's decision to open its first UK data centre as a strong vote of confidence in the British economy. This move signifies Google's commitment to expanding its presence and investment in the UK.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Meta Advances AI with New Smart Glasses and Wristband Tech",
    "domain": "business",
    "source_domain": "www.businessinsider.com",
    "location": "global",
    "published": "2025-09-16T00:08:54Z",
    "source": "Business Insider",
    "sources": [
      "Business Insider",
      "The Verge"
    ],
    "domains": [
      "www.theverge.com",
      "www.businessinsider.com"
    ],
    "snippets": [
      "Meta's CEO, Mark Zuckerberg, believes smart glasses will be key for future AI interactions.",
      "An unlisted and now-removed video from Meta showed off a new pair of Ray-Ban branded smart glasses with a display and a wristband to help control them, as reported by UploadVR. The video also features a new pair of wraparound “Sphaera” Oakley smart glasses with a camera on the nose, meaning that Met"
    ],
    "image_url": "https://i.insider.com/68c89bc357d362d375e8358c?format=jpeg",
    "titles": [
      "Meta leaked its own announcement about its new smart glasses display",
      "Meta leaks its new smart glasses with a display"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.846,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.631,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Meta, led by CEO Mark Zuckerberg, is focusing on smart glasses for future AI interactions. A leaked video, now removed, revealed new Ray-Ban smart glasses with a display and control wristband, and Oakley's \"Sphaera\" smart glasses featuring a camera. This indicates Meta's ongoing commitment to developing wearable tech for enhancing user interaction with AI.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Delta, Aeromexico Joint Venture to End by Jan. 1",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Tue, 16 Sep 2025 02:24:18 GMT",
    "source": "CNBC",
    "sources": [
      "MarketWatch",
      "CNBC"
    ],
    "domains": [
      "www.marketwatch.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "Delta Air Lines and Aeromexico would have to end their joint venture by Jan. 1.",
      "The Trump administration late Monday ordered Delta Air Lines Inc. and Mexico’s Grupo Aeromexico to end their joint venture, claiming it is “anticompetitive.”"
    ],
    "image_url": "",
    "titles": [
      "Trump administration orders Delta, Aeromexico to unwind joint venture by Jan. 1",
      "Trump administration orders Delta to unwind joint venture with Aeromexico"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.868,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.629,
    "summary_source": "snippet",
    "summary_reason": "retry_exhausted",
    "summary": "Delta Air Lines and Aeromexico would have to end their joint venture by Jan. 1.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Senate Confirms Christopher Waller to Federal Reserve Board",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Tue, 16 Sep 2025 01:08:11 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "Financial Times"
    ],
    "domains": [
      "www.ft.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMicEFVX3lxTE9NN0dHR093c1QzLVZZdzFrNVdTM0NobjV1aVZWN1BRYnFQejRaRWo1c0JTQ01VWFdxc2tJVVRSZTB1VHozUTZwSTdVZHdTZVo5THdVZzV6ZVNNZjFFaWp4TUV4YjJrV0Y0WTBsZkFyUUQ?oc=5\" target=\"_blank\">Trump nominee Miran confirmed to Fed ahead of rate decision</a>&nbsp;&nbsp;<",
      "Court ruling comes as Senate confirms president’s pick for US central bank’s board"
    ],
    "image_url": "",
    "titles": [
      "Trump nominee Miran confirmed to Fed ahead of rate decision - Axios",
      "Trump fails to oust Lisa Cook from Fed ahead of rates decision"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.845,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.624,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "President Trump's nominee, Christopher Waller, has been confirmed to the Federal Reserve Board. This confirmation comes ahead of the Fed's upcoming rate decision. Waller's confirmation was approved by the Senate, solidifying his position on the central bank's board.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "CoreWeave Expands Nvidia Partnership, Easing Investor Concerns",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Mon, 15 Sep 2025 21:15:19 GMT",
    "source": "CNBC",
    "sources": [
      "MarketWatch",
      "CNBC"
    ],
    "domains": [
      "www.marketwatch.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "CoreWeave has secured more business from Nvidia, which is an investor in the company and its main source of chips for running AI models.",
      "The deal offers some reassurance to CoreWeave investors in light of the company’s heavy customer concentration and rampant competition for cloud offerings."
    ],
    "image_url": "",
    "titles": [
      "CoreWeave's stock rallies on disclosure of $6.3 billion order from Nvidia",
      "What CoreWeave’s new $6.3 billion contract with Nvidia says about the AI trade"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.78,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.621,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "CoreWeave, benefiting from an investment by Nvidia, its primary chip provider, has expanded its business dealings with Nvidia. This development provides reassurance to CoreWeave's investors, addressing concerns related to the company's reliance on a limited customer base and the competitive cloud services market.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Maurene Comey Sues Trump Admin for Reinstatement",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Mon, 15 Sep 2025 21:04:19 GMT",
    "source": "Axios",
    "sources": [
      "CNBC",
      "Axios"
    ],
    "domains": [
      "www.cnbc.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMijAFBVV95cUxQWG5fVEN6SWhLTTh4QzJuTzlUTWNhck02Wjluak5VZDE3cUVQcko1cmdyUTdlUlNsamo4Qk9YNV9IQXFNSVdoa1p0Z1huWFRWcDVGUDRrYjNuT0hGVm12T21ZMmp6enZJSm9ZbFlnLTI1ZllscU4zenh6a21oOUdzbTJBLXZRNWxTR3Y4LQ?oc=5\" target=\"_blank\">Ex-Epstein prosecutor sues Trump admi",
      "Maurene Comey, a federal prosecutor involved in criminal cases against Jeffrey Epstein and Ghislaine Maxwell, sued the Trump administration to get her job back."
    ],
    "image_url": "",
    "titles": [
      "Ex-Epstein prosecutor sues Trump administration over firing - Axios",
      "Trump DOJ sued by Epstein prosecutor Maurene Comey over 'illegal' firing"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.777,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.617,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Maurene Comey, a former federal prosecutor linked to cases against Jeffrey Epstein and Ghislaine Maxwell, has filed a lawsuit against the Trump administration seeking reinstatement to her position.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "VP Vance Criticizes Celebration of Kirk's Death, Suggests Reporting Offenders",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 15 Sep 2025 21:51:52 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Business Insider"
    ],
    "domains": [
      "www.businessinsider.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The vice-president's remarks come amid a wave of firings over posts deemed inappropriate about Kirk's death.",
      "\"When you see someone celebrating Charlie's murder, call them out,\" Vance said on Monday. \"And hell, call their employer.\""
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/cf16/live/039922e0-9272-11f0-84c8-99de564f0440.jpg",
    "titles": [
      "Report those who celebrate Charlie Kirk death to employers, Vance says",
      "JD Vance says if you see someone celebrating Charlie Kirk's death, tell their employer"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.79,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.613,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Vice-President Vance condemned the celebration of Charlie Kirk's death, urging the public to confront those who do so and even suggest contacting their employers. This statement follows a series of firings related to inappropriate comments about Kirk's death.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Alphabet's Market Value Soars After Court Decision",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Mon, 15 Sep 2025 20:19:54 GMT",
    "source": "CNBC",
    "sources": [
      "TechCrunch",
      "CNBC"
    ],
    "domains": [
      "techcrunch.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "Google's parent company added hundreds of billions of dollars in value in September following a favorable ruling.",
      "Investors continue to reward Alphabet's stock after a judge declined to break up Google earlier this month."
    ],
    "image_url": "",
    "titles": [
      "Alphabet becomes fourth company to reach $3 trillion market cap",
      "With no DOJ breakup, Alphabet becomes a $3 trillion company"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.765,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.608,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "In September, Alphabet, Google's parent company, saw a significant increase in its market value, adding hundreds of billions of dollars after a judge ruled against breaking up the company. This favorable decision led to a surge in investor confidence, resulting in a continued rise in Alphabet's stock price.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump: Foreign Workers \"Welcome\" in US Amid South Korea Outrage",
    "domain": "technology",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Mon, 15 Sep 2025 10:06:17 GMT",
    "source": "Axios",
    "sources": [
      "The Verge",
      "Axios"
    ],
    "domains": [
      "www.theverge.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMiekFVX3lxTFBCVEZRblZWTWNZTlNUa3RCTlp5Rmt5YjlFSzJnaEZKWlVDVTgtbm9ZMWR2X2VHR3pDdkRtcmxDYTZGaGxLajdOT29qMUhudnEzNkViSkljV0dLeUxiYUJOWm9ndWIwR29TUU1FbjFKcHRtNVlhU0ljU0NR?oc=5\" target=\"_blank\">Trump says foreign experts welcome after South Korean outrage o",
      "President Donald Trump is trying to smooth things over with South Korea after his administration arrested hundreds of workers at a Hyundai plant in Georgia earlier this month. Just hours after reports indicated that South Korea would open a human rights investigation into the detention of Korean emp"
    ],
    "image_url": "",
    "titles": [
      "Trump says foreign experts welcome after South Korean outrage over raid - Axios",
      "Trump says foreign workers are &#8216;welcome&#8217; after ICE raid in Georgia targets hundreds of South Koreans"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.618,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.586,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "President Donald Trump stated that foreign workers are \"welcome\" in the United States, addressing concerns after images of South Korean workers chained and handcuffed sparked outrage. He emphasized not wanting to \"disincentivize investment\" following the incident, which had caused widespread alarm in South Korea.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "\"Game Controllers Advance; Smartphone Market Seeks Reliability Over Innovation\"",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-09-15T18:00:00-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "www.theverge.com"
    ],
    "snippets": [
      "We live in a golden age of controllers. The gamepads on the market now are of higher quality, more versatile, and more customizable than anything from even one console generation ago. If you play games on an Xbox Series X or Series S (or a Windows PC), you have the unenviable task of choosing betwee",
      "Haven’t you heard? Phones are boring now. And that’s just fine! Most people buying a new phone just want something familiar that works better than the device they’re replacing. If that’s your MO, then you’re sure to find something reliable in my recommendations below. But even if you’re looking for "
    ],
    "image_url": "",
    "titles": [
      "The best Xbox controller to buy right now",
      "The best phone to buy right now"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.809,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.43,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The current market offers high-quality, versatile, and customizable game controllers, surpassing those from previous generations. This variety presents a challenge for Xbox Series X or S and Windows PC gamers in choosing the best option. Meanwhile, the smartphone market has reached a point where new models are considered boring by some, focusing instead on reliability and performance improvements over previous devices. Both segments highlight a consumer preference for familiarity and enhanced functionality in their tech choices.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "TechCrunch Disrupt 2025 Set for Oct 27-29, Adds Tables Amid High Demand",
    "domain": "technology",
    "source_domain": "techcrunch.com",
    "location": "global",
    "published": "Mon, 15 Sep 2025 16:05:17 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com"
    ],
    "snippets": [
      "TechCrunch Disrupt 2025 takes place October 27–29 at Moscone West in San Francisco, and we’re looking for motivated, curious, and energetic volunteers to help make it all happen.",
      "Back by overwhelming demand, we’ve added 10 more exhibit tables to TechCrunch Disrupt 2025 — and this will be the final release before they sell out.",
      "Zoom CEO Eric Yuan and Emergence Capital general partner Santi Subotovsky will join the Going Public Stage at Disrupt 2025 in a session called \"What Comes After Breakout Success?\" Join 10,000+ tech and VC leaders from October 27-29 in San Francisco."
    ],
    "image_url": "",
    "titles": [
      "Time’s running out to volunteer at TechCrunch Disrupt 2025",
      "By popular demand: 10 extra exhibit tables open at TechCrunch Disrupt 2025",
      "Zoom’s Eric Yuan and Emergence’s Santi Subotovsky on navigating the second act, at TechCrunch Disrupt 2025"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.715,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.411,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "TechCrunch Disrupt 2025 is scheduled for October 27-29 at Moscone West in San Francisco, seeking volunteers for the event. Due to high demand, an additional 10 exhibit tables have been added, marking the last chance before selling out. The conference will feature Zoom CEO Eric Yuan and Emergence Capital's Santi Subotovsky, discussing \"What Comes After Breakout Success?\" on the Going Public Stage. Over 10,000 tech and VC leaders are expected to attend.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]