[
  {
    "title": "Bill Belichick Misses Hall of Fame in First Year",
    "domain": "politics",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Wed, 28 Jan 2026 13:53:31 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports",
      "Sports Illustrated",
      "Sportsnet",
      "Yahoo Sports",
      "Bleacher Report",
      "Sky Sports"
    ],
    "domains": [
      "espn.com",
      "cbssports.com",
      "news.google.com",
      "sportsnet.ca",
      "sports.yahoo.com",
      "skysports.com"
    ],
    "snippets": [
      "Tom Brady joined the chorus of voices questioning Bill Belichick's snub from the Pro Football Hall of Fame, saying the voting committee's decision is \"completely ridiculous.\"",
      "Brady and Kraft came to Belichick's defense after his stunning exclusion from the 2026 Pro Football Hall of Fame class",
      "Could Tom Brady be the next Patriots icon to feel the wrath of the Hall of Fame voters?",
      "Bill Belichick’s Snub Is a Watershed Moment for the Hall of Fame Sports Illustrated",
      "From voting mechanics to scandals to post-Brady narratives, tracing how the greatest coaching résumé in NFL history still came up short.",
      "The failure to elect Belichick on the first ballot exposes a voting system that hides accountability and risks turning football's highest honor into a farce.",
      "Tom Brady is backing his former coach after a surprising snub by the Pro Football Hall of Fame. “I don’t understand it,” Brady said Wednesday on ESPN Radio in Seattle , one day after reports that Bill Belichick was not elected into the Pro Football Hall of Fame in his first year of eligibility. “I was with him every day. If he’s not a first-ballot Hall of Famer, then there’s really no coach that should ever be a first-ballot Hall of Famer. Which is completely ridiculous because people deserve it.” Brady and Belichick won a record six Super Bowls over their 19 seasons together. Belichick...",
      "Tom Brady said no NFL coach should ever be a first-ballot Hall of Famer if Bill Belichick was snubbed.",
      "The Hall of Fame coach took to social media today to argue against Belichick being omitted from the 2026 class.",
      "The Tom Brady and Bill Belichick pairing was responsible for six Super Bowl wins in nine appearances with the Patriots. Here's what the QB had to say.",
      "The legendary head coach will not be a first-ballot Hall of Famer, and we may know who to blame",
      "Voter Explains Bill Belichick Snub for 2026 Hall of Fame Class, Bill Polian's Reported Role Bleacher Report",
      "Bill Belichick Reportedly Not a 1st-Ballot Hall of Famer, 8-Time Super Bowl Champ's Reaction Leaked Bleacher Report",
      "Deion Sanders Reacts to Bill Belichick's Reported 2026 Hall of Fame Class Snub, 'IGNORANT!' Bleacher Report",
      "Bill Belichick, the eight-time Super Bowl-winning coach, will not be a first-ballot Hall of Famer, sources told ESPN.",
      "Eight-time Super Bowl champion coach Bill Belichick reportedly isn't part of the NFL Hall of Fame Class of 2026",
      "Six-time Super Bowl champion head coach Bill Belichick didn't get voted into the Pro Football Hall of Fame in his first year of eligibility, according to a report from ESPN.",
      "Plus No. 1 Arizona is 21-0 and only getting better with each game",
      "The NFL world was shocked after Belichick fell short of the votes required to be a first-ballot Hall of Famer",
      "Belichick fell short of the votes required to be a first-ballot Hall of Famer",
      "A Complicated Voting System Muddled Bill Belichick’s Hall of Fame Case Sports Illustrated",
      "Lost in the news that the Hall of Fame voters snubbed Bill Belichick is that it shouldn't have been news."
    ],
    "image_url": "",
    "titles": [
      "Brady latest to slam Belichick Hall of Fame snub",
      "Tom Brady, Robert Kraft denounce Bill Belichick's first-ballot Hall of Fame snub: 'I don't understand it'",
      "Bill Belichick snubbed by Hall of Fame: We now can't rule out the possibility of Tom Brady meeting same fate",
      "Bill Belichick’s Snub Is a Watershed Moment for the Hall of Fame - Sports Illustrated",
      "The clues behind Bill Belichick's baffling first-ballot Hall of Fame miss",
      "Bill Belichick's snub demands a Hall of Fame reckoning",
      "Tom Brady on Bill Belichick Hall of Fame snub: ‘I don’t understand it’",
      "Tom Brady on Bill Belichick's reported Hall of Fame snub: 'If he's not a first-ballot Hall of Famer, there's really no coach that should ever be'",
      "Jimmy Johnson sounds off on Bill Belichick's Hall of Fame snub: 'I'm pissed'",
      "Tom Brady on Bill Belichick Hall of Fame snub: 'I don't understand it'",
      "Breaking down Bill Polian's alleged role in Bill Belichick not being a first-ballot Hall of Fame inductee",
      "Voter Explains Bill Belichick Snub for 2026 Hall of Fame Class, Bill Polian's Reported Role - Bleacher Report",
      "Bill Belichick Reportedly Not a 1st-Ballot Hall of Famer, 8-Time Super Bowl Champ's Reaction Leaked - Bleacher Report",
      "Deion Sanders Reacts to Bill Belichick's Reported 2026 Hall of Fame Class Snub, 'IGNORANT!' - Bleacher Report",
      "Sources: Belichick not a 1st-ballot Hall of Famer",
      "Why Wasn’t Bill Belichick Inducted Into the NFL Hall of Fame? Inside the Surprising Decision",
      "Belichick 'snubbed by Pro Football Hall of Fame' in first year of eligibility",
      "Bill Belichick snubbed in first Pro Football Hall of Fame voting; Bills hire Joe Brady as next coach",
      "Patrick Mahomes, LeBron James among stars stunned by Bill Belichick being snubbed by Pro Football Hall of Fame",
      "Legendary former Patriots coach Bill Belichick falls short of Pro Football Hall of Fame on first ballot",
      "A Complicated Voting System Muddled Bill Belichick’s Hall of Fame Case - Sports Illustrated",
      "Who leaked that Bill Belichick didn't make it to the Hall of Fame?"
    ],
    "url": "https://www.espn.com/nfl/story/_/id/47756553/tom-brady-latest-slam-bill-belichick-hall-fame-snub",
    "alternate_urls": [
      "https://www.cbssports.com/nfl/news/tom-brady-bill-belichick-pro-football-hall-of-fame-patriots/",
      "https://www.cbssports.com/nfl/news/bill-belichick-hall-of-fame-snub-tom-brady/",
      "https://news.google.com/rss/articles/CBMilAFBVV95cUxOT2FnVDFuVzRvYnZpdzFGYWtiY2hseC1KNjRUMTlhT0xmcThKd0FISkhudXA5MEtrcTBpT0U4UVVCenY3akNPX2QzZmdLRXdBMHpSRkpFVHkzQVQtOUp5WWUxNWZYYW1xeTFjTl9KSFU1aTFYalhyQW5BZ0lRdXhUWng2bml6MG5GcGNjZXJfMkhvRWVs?oc=5",
      "https://www.cbssports.com/nfl/news/why-bill-belichick-did-not-make-hall-of-fame-first-try/",
      "https://www.cbssports.com/nfl/news/bill-belichick-hall-of-fame-snub/",
      "https://sports.yahoo.com/nfl/article/tom-brady-on-bill-belichicks-reported-hall-of-fame-snub-if-hes-not-a-first-ballot-hall-of-famer-theres-really-no-coach-that-should-ever-be-175936312.html",
      "https://sports.yahoo.com/articles/jimmy-johnson-sounds-off-bill-174436542.html",
      "https://sports.yahoo.com/articles/tom-brady-bill-belichick-hall-172424404.html",
      "https://www.cbssports.com/nfl/news/bill-polians-alleged-role-bill-belichick-hall-of-fame-inductee-snub/",
      "https://news.google.com/rss/articles/CBMixgFBVV95cUxPZ0xUT2lEVnU1MmdrbVQwbTgxMERFNmRXQXZFZUJKcXZWc2d2amx5YTkyRWFIWmZNYkF6bzJkSmpFSjFBUk1xWXR6dGR3YW1RdldhTHJ2bnppaVBCUldxSFlGbTl3dHpMZkU5VWQtNFFzZ0k1Mi1Ta1BuRWhOdml2b1RnaFRWRlFWQmNjSVBaUGJyTGlXMk1BWnlwSmx1VHloajVuX2g2OWFTbmJVNkxsaHhtM2JkNDBiR2Q3dFlfOUNyQ19vOWc?oc=5",
      "https://news.google.com/rss/articles/CBMi0wFBVV95cUxNbkFpbGxZYXhDNnU2T0t5QXo5djJGMzlqNlRLcWRQc01mc25tSFlmRExrQUdKcUFXMkZwSEFvTEtTZHpxak9aM2V1R3h3bjAwU2MySXNxQnpFT0JYM2h0VFlJTXFqLWI0czAyQWlnaENidThpYXM1TEY4SlpGdVBES282Tk9yYVJWb3VQdUlQeXJqLU4yQ2dYVXVzbDQ5c1pCWEJSTmxad0FtMTNSTFB4RnlJQnRsMEliWThJazN6bldFeWp2cHRpNkd0cHpBUHhaMTdr?oc=5",
      "https://news.google.com/rss/articles/CBMiwwFBVV95cUxPZnNHQTItaUpTV2hlRFRDemhHMzIwTzM3NEdBeFZoVFVGNF9rLWpoYXRpRlg1Y3dsNTZ3aGh3c2FTNTBjMUt4djVFVDZaVEJVVFhxaFBHb2tOeHVMME1ocV9RVExoMnVuWEduOHBWdjh1M3FzME1odTFjbFlESmQ3ZlE5WDIzYlpTcEFNU093NGduVVNtazhhdWdLVEdMM3RudTRGTjlMVlV1NjZNNjVJSEVNWXd5blN1NTdXbG1mVlAydEE?oc=5",
      "https://www.espn.com/nfl/story/_/id/47747076/belichick-not-first-ballot-hall-famer",
      "https://sports.yahoo.com/articles/why-wasn-t-bill-belichick-195645647.html",
      "https://www.skysports.com/nfl/news/12040/13499993/bill-belichick-outcry-as-eight-time-super-bowl-champion-reportedly-snubbed-by-pro-football-hall-of-fame-in-first-year-of-eligibility",
      "https://www.cbssports.com/nfl/news/football-hall-of-fame-bill-belichick-nfl-bills-joe-brady/",
      "https://www.cbssports.com/nfl/news/patrick-mahomes-lebron-james-bill-belichick-hall-of-fame-snub-reaction/",
      "https://www.cbssports.com/nfl/news/patriots-coach-bill-belichick-pro-football-hall-of-fame-first-ballot/",
      "https://news.google.com/rss/articles/CBMikwFBVV95cUxORmJJVHV1ekM5TC1oSmozN1hGSUdiYk40djdMWWlRR0tQenVEOWpYMXV0cGQ4cTNYa2J5MUtLUlVPUnpnSXpKQWNUdUNYYzQtYS1ZdE55SWprUGN0U1lfRmt4d3BhemFVYk9LVUZMaERmd1BaYzE3ZWo5VndKNjR3SHJ2VHVHb0lFZHM5b3hQLTJoQzQ?oc=5",
      "https://sports.yahoo.com/articles/leaked-bill-belichick-didnt-hall-190859639.html"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/nfl/story/_/id/47756553/tom-brady-latest-slam-bill-belichick-hall-fame-snub",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.916,
      "consensus": 1.0,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.88,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "The story is mostly reactive, focusing on a conflict between two individuals. It provides minimal depth or insight into the broader context of the sports world or the Hall of Fame selection process.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Bill Belichick, an eight-time Super Bowl-winning coach, was not elected to the Pro Football Hall of Fame in his first year of eligibility for the 2026 class. The decision drew strong reactions from supporters, including Tom Brady, who publicly criticized the voting committee for the exclusion.",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "Browns Hire Todd Monken as New Head Coach",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Wed, 28 Jan 2026 13:53:31 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports",
      "Bleacher Report",
      "Sky Sports",
      "Sports Illustrated",
      "Yahoo Sports"
    ],
    "domains": [
      "espn.com",
      "cbssports.com",
      "news.google.com",
      "skysports.com",
      "sports.yahoo.com"
    ],
    "snippets": [
      "The Browns have hired former Ravens offensive coordinator Todd Monken as their next head coach.",
      "Cleveland tabs the former Ravens OC to become the franchise's 11th coach since 1999. Here's what we know.",
      "Cleveland is betting on Lamar Jackson's former play-caller, but history suggests it's a risky move",
      "A decision is in for Cleveland, and Todd Monken of Baltimore will replace Kevin Stefanski",
      "Grading Todd Monken to Browns and Every New NFL Head Coach Hiring of 2026 Bleacher Report",
      "The Cleveland Browns are naming Todd Monken as their next head coach, NFL Network reported on Wednesday.",
      "Browns to Hire Former Ravens OC Todd Monken As Next Head Coach Sports Illustrated",
      "The Cleveland Browns have hired one of their former coordinators to be the team's head coach. The Browns hired Todd Monken as the franchise's 19th full-time head coach on Wednesday, wrapping up a three-week search. This is Monken's first NFL head coaching job after 11 years in the league as an assis",
      "Only the Cleveland Browns could pull this off.",
      "The Browns are hiring Todd Monken.",
      "The AFC North will look a lot different in 2026.",
      "Todd Monken's hire by the Browns leaves only two NFL head-coaching vacancies left. But which additions were the best moves?",
      "Jim Schwartz Reportedly 'Said Goodbyes' to Browns, Was 'Visibly Upset' After Todd Monken Hire Bleacher Report"
    ],
    "image_url": "",
    "titles": [
      "Sources: Browns hiring Monken as new coach",
      "Browns hire Todd Monken as head coach: Who is he a...",
      "The Browns' Todd Monken hire makes sense in some ways, but the risks are hard to ignore",
      "Cleveland Browns hire ex-Ravens OC Todd Monken as coach",
      "Grading Todd Monken to Browns and Every New NFL Head Coach Hiring of 2026 - Bleacher Report",
      "Browns hiring Monken as head coach",
      "Browns to Hire Former Ravens OC Todd Monken As Next Head Coach - Sports Illustrated",
      "Todd Monken hired as the Cleveland Browns head coach",
      "Browns hire Todd Monken as head coach; Hilarious fallout ensues with Jim Schwartz",
      "Browns hire former Ravens OC Todd Monken as head coach",
      "AFC North head coaches set for 2026 as Browns hire Todd Monken",
      "Ranking every NFL coaching hire in 2026 after Browns add Todd Monken",
      "Jim Schwartz Reportedly 'Said Goodbyes' to Browns, Was 'Visibly Upset' After Todd Monken Hire - Bleacher Report"
    ],
    "url": "https://www.espn.com/nfl/story/_/id/47754909/browns-hiring-todd-monken-new-coach",
    "alternate_urls": [
      "https://www.espn.com/nfl/story/_/id/47755045/cleveland-browns-hire-todd-monken-head-coach-answering-questions-whats-next",
      "https://www.cbssports.com/nfl/news/browns-todd-monken-head-coach-hire-pros-cons/",
      "https://www.cbssports.com/nfl/news/todd-monken-browns-coaching-search-ravens/",
      "https://news.google.com/rss/articles/CBMisgFBVV95cUxPV19McU8yRV81MEdLOGs1ZXpnRkxHSnNyNUg2cHN2LS0zaDd4OFBSaHNpLUFQZW1EVW5ZOTFyM2FmSE1yU2hnVy16TFhtU0wwOWVhVUwwbmkxcEY1dkJJaS1ub1llZnJFcTFxeFhMc0xzakRaQ3pwajdGS09PRDU4TERQamdLb3dESlBlaElSMU1lUUZVQnhWVUN4ODJTeHUtVWZlSGxvYVhBMjdjeGlHTXNn?oc=5",
      "https://www.skysports.com/nfl/news/12040/13500239/todd-monken-cleveland-browns-hire-former-baltimore-ravens-offensive-coordinator-as-head-coach",
      "https://news.google.com/rss/articles/CBMijwFBVV95cUxOUXd1RXB6QTJPcy04amdaX2Z2eDZWeC1HUmgyT2ZJOHpxaEM4T0N0SHlvQmFrTk5iWVgwdThObDlaMUxkYktDZkhZNld3UVJBLU1CR2NkX1lDaVZTU1BHZlloWUFYb0VsWks2TzZTS1RSbXFURnIzemRranlTaFE4U1R1R2ppWm4xN2JMTGlYNA?oc=5",
      "https://sports.yahoo.com/articles/todd-monken-next-cleveland-browns-160819580.html",
      "https://sports.yahoo.com/articles/browns-hire-todd-monken-head-183717152.html",
      "https://sports.yahoo.com/nfl/breaking-news/article/browns-hire-former-ravens-oc-todd-monken-as-head-coach-154932446.html",
      "https://sports.yahoo.com/articles/afc-north-head-coaches-set-191448107.html",
      "https://sports.yahoo.com/articles/ranking-every-nfl-coaching-hire-181454994.html",
      "https://news.google.com/rss/articles/CBMiygFBVV95cUxPMjYzWGZTcm5GcFZOblNjNUFzajAzbi0yOUE1Tjk4MjM3dHhWdmk4b0Q3Q0d4dllMR0R6WGtUR1BjbWxUX0VrMFNJOHBhYzI3M3A0bTZLTjc5UEExWWRSTHQ2UFRwSlRkY2wwQ2t4cmRBbnNHTnk3M2JpMWFRU2RCbl93ZG5XbUFTaWZ0WEFIYjNvV2RtTVMwcW5FWVJLRXZ5ZC0yYzl6S0kzZnYwZm1DdkNCTk5jZHNnRF9maHFHR0VKYzBDd3B4dFF3?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/nfl/story/_/id/47754909/browns-hiring-todd-monken-new-coach",
    "score_components": {
      "magnitude": 0.986,
      "recency": 0.916,
      "consensus": 1.0,
      "constructiveness": 0.05,
      "proximity": 0.75
    },
    "score": 0.851,
    "constructiveness_score": 0.05,
    "constructiveness_reason": "semantic: pos_sim=0.20, neg_sim=0.00; semantic_boost=0.05; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The Cleveland Browns have hired former Ravens offensive coordinator Todd Monken as their next head coach, replacing Kevin Stefanski. This marks Monken's first NFL head coaching position. The decision was reported on Wednesday, concluding a three-week search for the Browns' 19th full-time head coach.",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "Patrick Reed Leaves LIV Golf",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Wed, 28 Jan 2026 13:53:31 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports",
      "Forbes",
      "Bleacher Report",
      "Sky Sports",
      "BBC Sport",
      "Sportsnet",
      "Yahoo Sports",
      "The Guardian"
    ],
    "domains": [
      "espn.com",
      "cbssports.com",
      "forbes.com",
      "news.google.com",
      "skysports.com",
      "bbc.com",
      "sportsnet.ca",
      "sports.yahoo.com",
      "theguardian.com"
    ],
    "snippets": [
      "Former Masters champion Patrick Reed is leaving the LIV Golf league and plans to return to the PGA Tour later this season, he announced Wednesday.",
      "Reed informed the PGA Tour of his desire to return after his LIV Golf contract expired",
      "Reed was with LIV Golf for four seasons.",
      "Patrick Reed Seeks PGA Tour Reinstatement, Latest on Timeline to Return from LIV Golf Bleacher Report",
      "Patrick Reed is set to make a return to the PGA Tour after announcing his decision to quit LIV Golf.",
      "American Patrick Reed announces he is leaving the LIV Golf series to make a return to the PGA Tour, who will allow him to play from August.",
      "SAN DIEGO — Patrick Reed is the second major champion to leave Saudi-funded LIV Golf, announcing Wednesday he will spend the rest of the year on the European tour with an eye on returning to the PGA Tour as early as September. His stunning decision, just three days after he won the Dubai Desert Classic, comes the same week that five-time major champion Brooks Koepka returns to the PGA Tour at Torrey Pines. “I’m a traditionalist at heart, and I was born to play on the PGA Tour, which is where my story began with my wife, Justine,” Reed said. “I am very fortunate for the opportunities that have...",
      "Patrick Reed is the second major champion to leave Saudi-funded LIV Golf, announcing Wednesday he will spend the rest of the year on the European tour with an eye on returning to the PGA Tour as early as September. “I’m a traditionalist at heart, and I was born to play on the PGA Tour, which is wher",
      "American becomes latest major winner to exit 2018 Masters champion will be eligible for PGA Tour Patrick Reed has delivered the ­latest high-profile blow to LIV Golf by announcing he will leave the circuit before the start of its 2026 season. The 35-year-old American former Masters champion joins Br"
    ],
    "image_url": "",
    "titles": [
      "Reed planning return to PGA Tour from LIV Golf",
      "Patrick Reed sets return to PGA Tour in 2027: Nine-time winner aims for reinstatement after leaving LIV Golf",
      "Patrick Reed Is Quitting LIV Golf, Returning To PGA Tour In 2027",
      "Patrick Reed Seeks PGA Tour Reinstatement, Latest on Timeline to Return from LIV Golf - Bleacher Report",
      "Reed set for PGA Tour return after quitting LIV Golf",
      "Reed leaves LIV Golf to make PGA Tour return",
      "Patrick Reed leaves LIV Golf, set to return to PGA Tour",
      "Patrick Reed is leaving LIV Golf. He can return to the PGA Tour in September",
      "Patrick Reed quits rebel LIV Golf tour in latest blow to Saudi-backed breakaway"
    ],
    "url": "https://www.espn.com/golf/story/_/id/47754948/patrick-reed-planning-return-pga-tour-liv-golf-august",
    "alternate_urls": [
      "https://www.cbssports.com/golf/news/patrick-reed-return-pga-tour-reinstatement-2027-liv-golf-dp-world-tour/",
      "https://www.forbes.com/sites/maryroeloffs/2026/01/28/patrick-reed-is-quitting-liv-golf-returning-to-pga-tour-in-2027/",
      "https://news.google.com/rss/articles/CBMiugFBVV95cUxONjVRdVkyTHlBYndPTm13dVZTWTJ6cXZtWTRvYTd4eVNlajFnbXoxR0hLUHhIU19VcnNDNnVpN2RxQTEyVFdWOGR2aktubXBpaFJNQ3dOWkN0NlRCQWw2akI5RFBfR0JXUTJ3dTcySk1fb05aX05FX29EN2dwR05xZjZSQXlVTFNncEZSZjdLMTN2NkxVa1NuUW5seFV1TlMwRUd4Y3BEZ1FFVld3djlnRHJ3d29OZjFYOGc?oc=5",
      "https://www.skysports.com/golf/news/12040/13500248/patrick-reed-former-masters-champion-set-for-pga-tour-return-after-announcing-decision-to-quit-liv-golf",
      "https://www.bbc.com/sport/golf/articles/c07xye18ndyo?at_medium=RSS&at_campaign=rss",
      "https://sports.yahoo.com/articles/patrick-reed-leaving-liv-golf-170246414.html",
      "https://www.theguardian.com/sport/2026/jan/28/patrick-reed-quits-liv-tour-blow-saudi-backed-breakaway-golf"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/golf/story/_/id/47754948/patrick-reed-planning-return-pga-tour-liv-golf-august",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.916,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.85,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.10; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Patrick Reed announced he is leaving LIV Golf and will spend the rest of 2026 on the European tour, with plans to return to the PGA Tour as early as August. Reed informed the PGA Tour of his intention after his LIV Golf contract expired. He is the second major champion to exit LIV Golf, following Brooks Koepka's return to the PGA Tour the same week.",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "Federal Officers Placed on Leave After Fatal Shooting in Minneapolis",
    "domain": "politics",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Wed, 28 Jan 2026 14:12:54 -0500",
    "source": "ABC News",
    "sources": [
      "ABC News",
      "The Guardian",
      "CBC News",
      "Forbes"
    ],
    "domains": [
      "abcnews.go.com",
      "theguardian.com",
      "cbc.ca",
      "forbes.com"
    ],
    "snippets": [
      "The Trump administration is grappling with the fallout from the Minneapolis shooting.",
      "Two officers involved have been placed on administrative leave in standard protocol, says CBP spokesperson Two agents who shot Minnesota man on leave as Trump says he will ‘de-escalate’ Lawmakers condemn ‘disgusting’ attack on Ilhan Omar at Minneapolis town hall Two federal officers fired their guns",
      "Fallout from second fatal shooting amid immigration operation in city dogs White House, though raids continue Federal agents involved in fatal shooting of Alex Pretti placed on administrative leave – live The two agents who fatally shot a man in Minneapolis over the weekend have been placed on admin",
      "Two federal agents who were involved in ​Saturday's fatal shooting of a U.S. citizen in Minneapolis have been placed on administrative leave, according to a U.S. Customs and Border Protection spokesperson.",
      "Two federal officers fired shots during the encounter that killed ICU nurse Alex Pretti in Minneapolis, a U.S. Customs and Border Protection official told Congress in a notice sent Tuesday.",
      "Customs and Border Patrol commander Greg Bovino said Sunday the agents continued work in another city after Alex Pretti’s fatal shooting."
    ],
    "image_url": "https://s.abcnews.com/images/US/cbp-minneapolis-pretti-rt-jef-260128_1769614958525_hpMain_4x3t_384.jpg",
    "titles": [
      "Minneapolis live updates: 2 officers involved in Pretti shooting placed on leave",
      "Federal agents involved in fatal shooting of Alex Pretti placed on administrative leave – live",
      "Two agents who shot Minnesota man on leave as Trump says he will ‘de-escalate’",
      "2 federal agents involved in shooting of Alex Pretti in Minneapolis have been placed on leave",
      "2 federal agents fired shots when Alex Pretti was killed in Minneapolis: U.S. official",
      "Border Patrol Agents Involved In Alex Pretti Shooting Put On Administrative Leave"
    ],
    "url": "https://abcnews.go.com/US/live-updates/minneapolis-ice-shooting-live-updates-doj-investigating-apparent/?id=129340693",
    "alternate_urls": [
      "https://www.theguardian.com/us-news/live/2026/jan/28/ilhan-omar-attack-trump-minneapolis-ecuador-embassy-rubio-venezuela-machado-iran-iraq-latest-news-updates",
      "https://www.theguardian.com/us-news/2026/jan/28/trump-minnesota-immigration-enforcement-raids",
      "https://www.cbc.ca/news/world/agents-pretti-shooting-leave-9.7065333?cmp=rss",
      "https://www.cbc.ca/news/world/alex-pretti-shooting-two-federal-agents-shot-9.7064190?cmp=rss",
      "https://www.forbes.com/sites/antoniopequenoiv/2026/01/28/border-patrol-agents-involved-in-alex-pretti-shooting-put-on-administrative-leave/"
    ],
    "location_scope": "national",
    "link": "https://abcnews.go.com/US/live-updates/minneapolis-ice-shooting-live-updates-doj-investigating-apparent/?id=129340693",
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.924,
      "consensus": 0.908,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.836,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about an ongoing investigation, which could contribute to readers' understanding of police accountability measures. However, it does not appear to offer solutions or delve into the systemic issues at play.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Two federal officers who fatally shot ICU nurse Alex Pretti in Minneapolis have been placed on administrative leave, according to U.S. Customs and Border Protection. The shooting occurred during an immigration operation. The officers have continued work in another city, and the Trump administration is addressing the aftermath.",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "Federal Reserve Keeps Interest Rates Unchanged Amid Economic",
    "domain": "business",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Wed, 28 Jan 2026 14:51:16 -0500",
    "source": "ABC News",
    "sources": [
      "ABC News",
      "Al Jazeera",
      "NPR",
      "CNBC",
      "Financial Times",
      "The Guardian",
      "Global News",
      "Globe and Mail",
      "Bloomberg",
      "Financial Post"
    ],
    "domains": [
      "abcnews.go.com",
      "aljazeera.com",
      "npr.org",
      "cnbc.com",
      "ft.com",
      "theguardian.com",
      "globalnews.ca",
      "news.google.com",
      "financialpost.com"
    ],
    "snippets": [
      "President Donald Trump has called for significantly lower interest rates.",
      "The central bank will maintain rates at 3.5 to 3.75 percent and warned of 'elevated' economic uncertainty.",
      "The central bank cut rates at its three previous meetings in an effort to support the job market. But with inflation still elevated, the Fed is cautious about additional rate cuts.",
      "The Federal Reserve on Wednesday released its decision on interest rates.",
      "From mortgage rates and auto loans to credit cards and savings accounts, here's a look at how the January Fed decision could affect your finances.",
      "Governors Christopher Waller and Stephen Miran dissented against the decision, calling for a reduction",
      "Fed voted to pause cuts to interest rate, which currently sits between 3.5% and 3.75%, after slashing it three times in fall The US Federal Reserve left interest rates unchanged after its first rate-setting meeting of the year on Wednesday, resisting enormous pressure from the White House to lower r",
      "The Federal Reserve pushed the pause button on its interest rate cuts Wednesday, leaving its key rate unchanged at about 3.6 per cent after lowering it three times last year.",
      "Live updates: U.S. Federal Reserve, Bank of Canada keep key interest rates steady as expected The Globe and Mail",
      "New statement highlights ‘solid’ economic activity and ‘signs of stabilisation’ in the labour market",
      "Fed Holds Rates Steady, Nods to ‘Stabilization’ in Jobless Rate Bloomberg",
      "Officials voted 10-2 Wednesday to hold the benchmark federal funds rate in a range of 3.5% to 3.75%"
    ],
    "image_url": "https://s.abcnews.com/images/US/jerome-powell-1-rt-gmh-260128_1769629189220_hpMain_4x3t_384.jpg",
    "titles": [
      "Federal Reserve holds interest rates steady",
      "US Federal Reserve holds interest rates steady despite political pressure",
      "Fed holds interest rates steady, taking a pause from rate cuts to assess the economy",
      "Fed holds key interest rate steady as economic view improves",
      "Fed holds interest rates steady: What that means for mortgages, credit cards and loans",
      "Federal Reserve holds rates steady following three straight cuts",
      "Federal Reserve holds interest rates as Trump piles on pressure",
      "U.S. Federal Reserve holds interest rates as pressure from Trump mounts",
      "Live updates: U.S. Federal Reserve, Bank of Canada keep key interest rates steady as expected - The Globe and Mail",
      "Federal Reserve holds rates and removes dovish guidance",
      "Fed Holds Rates Steady, Nods to ‘Stabilization’ in Jobless Rate - Bloomberg",
      "Fed holds rates steady, points to improvements in the unemployment rate"
    ],
    "url": "https://abcnews.go.com/Business/federal-reserve-expected-hold-interest-rates-steady-defying/story?id=129594261",
    "alternate_urls": [
      "https://www.aljazeera.com/economy/2026/1/28/us-federal-reserve-holds-interest-rates-steady-despite-political-pressure?traffic_source=rss",
      "https://www.npr.org/2026/01/28/nx-s1-5690136/federal-reserve-interest-rates-jobs-labor-inflation",
      "https://www.cnbc.com/2026/01/28/fed-rate-decision-january-2026.html",
      "https://www.cnbc.com/2026/01/28/fed-decision-mortgage-rates-credit-cards-loans.html",
      "https://www.ft.com/content/beaa0532-6c99-4a4d-b029-d1b5c8dccf51",
      "https://www.theguardian.com/business/2026/jan/28/federal-reserve-holds-rates-powell-trump",
      "https://globalnews.ca/news/11641753/federal-reserve-rate-announcement-january-2026/",
      "https://news.google.com/rss/articles/CBMipAFBVV95cUxNZVE1cTBWR2VQQUxYMms4Q3lHS3M1dkFBSVd3RFV5dFk4cl9URWhycjVJVEVwbmh6Qm0zcU9CLTVaTDgtcklYS0gxRElXV0hrNldlbGxPWkRhcENqYW9YN0ZEUHZrcER1ZEtZUVZOdXpKWEp1WGNnVklNZm1Ld2J2YU9BY0NGeXhMbERFVDJRSWVmZFgwT1J6WlhNMzFuSGNUdnJhTQ?oc=5",
      "https://www.ft.com/content/c329cb7f-ca5a-405a-a24a-e907bc600932",
      "https://news.google.com/rss/articles/CBMisAFBVV95cUxNX2pfTEp0dUJhWXQ1RF94SFNCQmhmdUVnZ0VpLXNVbnVzY1N4MkEyTk0xb1hTM09NMk03RFczRjJGM2VKRkVtOWJTMURxN1ZJc3NPcjNyM0lPTHFlNHhEazFNaDBJTU0yRUtqVllrd2h3bUFaUktYQkpQTDlvMHVFb08xLW5vdm5TR0gtQXQ1RVU5UlVMdW1EdHB2dWxTOGE4dEdURENIQXFGc1Y3WlBHZg?oc=5",
      "https://financialpost.com/news/economy/fed-holds-rates-steady"
    ],
    "location_scope": "national",
    "link": "https://abcnews.go.com/Business/federal-reserve-expected-hold-interest-rates-steady-defying/story?id=129594261",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.941,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.832,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "snippet",
    "summary_reason": "invalid_roles",
    "headline_source": "gpt",
    "summary": "President Donald Trump has called for significantly lower interest rates.",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "FBI Searches Atlanta Election Office Over 2020 Presidential Vote",
    "domain": "politics",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Wed, 28 Jan 2026 19:19:43 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Reuters",
      "Forbes"
    ],
    "domains": [
      "aljazeera.com",
      "news.google.com",
      "forbes.com"
    ],
    "snippets": [
      "FBI searches Fulton County election office in Georgia over 2020 election concerns linked to Trump-Biden contest.",
      "FBI searches Atlanta election office related to 2020 US presidential vote Reuters",
      "The FBI, led by Kash Patel, is searching the site after Donald Trump has repeatedly falsely claimed the 2020 election was stolen."
    ],
    "image_url": "",
    "titles": [
      "FBI executes search warrant at Georgia election office over 2020 US vote",
      "FBI searches Atlanta election office related to 2020 US presidential vote - Reuters",
      "FBI Reportedly Executes Search Warrant At Election Center Near Atlanta"
    ],
    "url": "https://www.aljazeera.com/news/2026/1/28/fbi-executes-search-warrant-at-georgia-election-office-over-2020-us-vote?traffic_source=rss",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiwgFBVV95cUxNdXprRGxYZ05sanhiS2lDdC1tVDcxeXQ1bnlKRHAtTXdWc3NOazZpbC13QXZaLW1xT192NXFjSEY4cmVHUGVPN0VxZWhJdE50VzQtS1plRWxXeHhEVjhuOER4RHBBZ3Q2RGNPbW9FeExPdVdyQ1lCakhTNGFhZUpjZTJDZFgyNTU1M09mQmpWeTU2aEhoTWFPOHFBTV9SaVBZTzJPWlVndUoweWNFMDZPSWtHOVJiNC1tdS1iZkFudHU5QQ?oc=5",
      "https://www.forbes.com/sites/mikestunson/2026/01/28/fbi-reportedly-executes-search-warrant-at-election-center-near-atlanta/"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2026/1/28/fbi-executes-search-warrant-at-georgia-election-office-over-2020-us-vote?traffic_source=rss",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.927,
      "consensus": 0.789,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.814,
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is informative and provides context about the 2020 US election and ongoing investigations into potential irregularities. It contributes to readers' understanding of the election process and the role of law enforcement in maintaining its integrity.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The FBI, led by Kash Patel, searched the Fulton County election office in Atlanta as part of an investigation related to the 2020 US presidential election. The search addresses concerns linked to the Trump-Biden contest, following repeated false claims by Donald Trump about the election outcome.",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Bucks Considering Trade Offers for Giannis Antetokounmpo Before",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Wed, 28 Jan 2026 13:53:31 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Bleacher Report",
      "Yahoo Sports",
      "CBS Sports"
    ],
    "domains": [
      "espn.com",
      "news.google.com",
      "sports.yahoo.com",
      "cbssports.com"
    ],
    "snippets": [
      "Giannis Antetokounmpo is ready for a new home ahead of the trade deadline as several teams have made aggressive offers to the Bucks, league sources told ESPN.",
      "Giannis Reportedly 'Ready' for Bucks Trade at NBA Deadline, Latest Rumors on 'Aggressive' Offers Bleacher Report",
      "Latest Giannis Trade Rumors on Desire to Play with Jrue Holiday amid Knicks Buzz Bleacher Report",
      "Giannis Antetokounmpo has indicated he's ready to move on from the Bucks, and Milwaukee is reportedly willing to listen to offers. Here's the latest.",
      "While the Bucks and Antetokounmpo are apparently more interested in talking trade, it's still far more likely to happen in the offseason.",
      "It appears Antetokounmpo's time in Milwaukee is coming to an end",
      "A Giannis blockbuster feels closer than ever with the latest news -- will it happen by next Thursday?",
      "After recent reports regarding Milwaukee Bucks superstar Giannis Antetokounmpo, the Miami Heat's Bam Adebayo has begun his recruiting project.",
      "With the NBA tradeline rapidly approaching, Milwaukee Bucks superstar Giannis Antetokounmpo could be on the move, and the Knicks very well could be suitors.",
      "The Milwaukee Bucks are reportedly listening to trade offers from multiple teams for superstar Giannis Antetokounmpo ahead of the Feb. 5 NBA trade deadline, according to a report from ESPN’s Shams Charania on Wednesday. However, it does not seem like…"
    ],
    "image_url": "",
    "titles": [
      "Sources: Giannis preps for Bucks exit amid offers",
      "Giannis Reportedly 'Ready' for Bucks Trade at NBA Deadline, Latest Rumors on 'Aggressive' Offers - Bleacher Report",
      "Latest Giannis Trade Rumors on Desire to Play with Jrue Holiday amid Knicks Buzz - Bleacher Report",
      "Latest Giannis Antetokounmpo trade rumors, updates",
      "Giannis Antetokounmpo reportedly 'ready for a new home,' Milwaukee Bucks 'starting to listen' to trade offers",
      "Giannis Antetokounmpo reportedly ready to be dealt as Bucks begin to listen to offers",
      "NBA trade rumors: Giannis Antetokounmpo finally open to moving on from Bucks",
      "Heat's Bam Adebayo joins recruiting effort for Bucks' Giannis Antetokounmpo",
      "Knicks will be among teams making 'aggressive' trade offers for Bucks' Giannis Antetokounmpo",
      "Giannis Antetokounmpo Trade to LA Unlikely as Lakers, Clippers Lack Assets for Deal"
    ],
    "url": "https://www.espn.com/nba/story/_/id/47755088/sources-giannis-antetokounmpo-ready-bucks-trade-amid-offers",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMixAFBVV95cUxNT1pCSFZ3WTJieGFTUlNmMHEwVWM4OThQNnM3aFpFb1FLMW5OVm5lRUQ4ZWJHdGtqc09KSUptWmlOUUc4cjBoWmVGWmFqbk1kRnNmYzlTREpVNm1nZ2R1R3QxS044WmhDMHpPUjBwMnB6SWVjNENSRTZJYkc2NXlQX0pPeWhDYmkweWJMZnpHT255SFFyLXRhRWNvWS1WWXhNYlB5dlVwUXFxWDFpQUFWR3BNUXNqWmZZVTVia1ZRdXpvaU9N?oc=5",
      "https://news.google.com/rss/articles/CBMitAFBVV95cUxQTnRKdXdhZnNNZzg1NXVaRzQxbmlGU0dfR3dmOTNKUXZ3eEhLcU9FMS04My11cTZCLTBRQ1VaTjlwcTZHQVc5MW1MWVdYRnVyQjVMdy1TT3RfMWIzYV9kMUUwSTduNWo3YV90YjFpbnZaREdqWnF2WUdoQjFJb1lOcjVRbHhlZWpxV2szV0xZREhkZ1JZSndzdlBwS1lIODJ6OVJFNEVsaF9iclJhNDBreU9hTS0?oc=5",
      "https://sports.yahoo.com/articles/giannis-antetokounmpo-trade-rumors-bucks-172947608.html",
      "https://sports.yahoo.com/articles/giannis-antetokounmpo-reportedly-ready-home-170719212.html",
      "https://sports.yahoo.com/nba/article/giannis-antetokounmpo-reportedly-ready-to-be-dealt-as-bucks-begin-to-listen-to-offers-162913586.html",
      "https://www.cbssports.com/nba/news/nba-trade-rumors-giannis-antetokounmpo-request-bucks/",
      "https://sports.yahoo.com/articles/heats-bam-adebayo-joins-recruiting-194603665.html",
      "https://sports.yahoo.com/articles/knicks-among-teams-making-aggressive-164038594.html",
      "https://sports.yahoo.com/articles/giannis-antetokounmpo-trade-la-unlikely-195213910.html"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/nba/story/_/id/47755088/sources-giannis-antetokounmpo-ready-bucks-trade-amid-offers",
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.916,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.799,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.10; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Milwaukee Bucks player Giannis Antetokounmpo has reportedly expressed readiness to be traded, and the Bucks are listening to aggressive offers from multiple teams ahead of the February 5 NBA trade deadline. While a trade could happen soon, sources indicate it remains more likely during the offseason.",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "Tyson Fury to Fight Arslanbek Makhmudov in April Comeback",
    "domain": "sports",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Wed, 28 Jan 2026 15:51:48 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "BBC",
      "CBS Sports",
      "Sky Sports",
      "Sportsnet"
    ],
    "domains": [
      "aljazeera.com",
      "bbc.com",
      "cbssports.com",
      "skysports.com",
      "sportsnet.ca"
    ],
    "snippets": [
      "After months of speculation, the ex-heavyweight boxing champion has made his comeback official and will fight April 11.",
      "Former heavyweight world champion Tyson Fury will face Arslanbek Makhmudov in the UK on 11 April as he ends his latest spell of retirement.",
      "The former heavyweight champ will return to the ring in April",
      "Tyson Fury has confirmed his comeback fight against Arslanbek Makhmudov as the former heavyweight champion returns to boxing.",
      "Heavyweight boxer Tyson Fury is set to fight Arslanbek Makhmudov in April, broadcaster Netflix announced on Wednesday."
    ],
    "image_url": "",
    "titles": [
      "Tyson Fury announces comeback fight in April against Arslanbek Makhmudov",
      "Fury to face Makhmudov in April comeback fight",
      "Tyson Fury ends retirement, announces comeback fight against Arslanbek Makhmudov in April",
      "Fury's comeback fight confirmed",
      "Boxing legend Fury to come out of retirement, fight Makhmudov"
    ],
    "url": "https://www.aljazeera.com/sports/2026/1/28/tyson-fury-announces-comeback-fight-in-april-against-arslanbek-makhmudov?traffic_source=rss",
    "alternate_urls": [
      "https://www.bbc.com/sport/boxing/articles/c8x9wzw1vzyo?at_medium=RSS&at_campaign=rss",
      "https://www.cbssports.com/boxing/news/tyson-fury-next-fight-date-retirement-arslanbek-makhmudov/",
      "https://www.skysports.com/boxing/news/12040/13500152/tyson-fury-confirms-comeback-fight-against-arslanbek-makhmudov-for-april-11"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/sports/2026/1/28/tyson-fury-announces-comeback-fight-in-april-against-arslanbek-makhmudov?traffic_source=rss",
    "score_components": {
      "magnitude": 0.964,
      "recency": 0.842,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.791,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Tyson Fury has confirmed he will return to boxing to fight Arslanbek Makhmudov in the UK on April 11, ending his latest retirement. The bout was announced by Netflix.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Trump Warns Iran to Make Nuclear Deal as U.S. Armada Approaches",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Wed, 28 Jan 2026 14:06:14 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "BBC",
      "CNBC",
      "Financial Times",
      "The Guardian",
      "Bloomberg",
      "Reuters",
      "Al Arabiya"
    ],
    "domains": [
      "news.google.com",
      "bbc.com",
      "cnbc.com",
      "ft.com",
      "theguardian.com"
    ],
    "snippets": [
      "Trump warns Iran \"time is running out\" for talks, threatens \"far worse\" attack Axios",
      "Tehran says its armed forces are ready \"with their fingers on the trigger\" to respond to any aggression.",
      "U.S. President Donald Trump warned Iran on Wednesday it should \"make a deal\" with the U.S. on its nuclear program or face a large-scale U.S. military attack.",
      "Marco Rubio tells Capitol Hill that ‘regime is probably weaker than it has ever been’",
      "US president says armada heading towards Iran is ‘prepared to fulfil its missions with violence if necessary’ The threat of war between the US and Iran appeared to loom closer after Donald Trump told Tehran time was running out and that a huge US armada was moving quickly towards the country “with g",
      "Trump Warns Iran Time Is Running Out as Ships Enter Region Bloomberg",
      "Trump tells Iran to make nuclear deal or next attack will be 'far worse' Reuters",
      "Trump warns Iran that next attack ‘will be far worse’ Al Arabiya English",
      "Trump warns Iran an 'armada' is heading its way and to agree a nuclear deal, or else CNBC"
    ],
    "image_url": "",
    "titles": [
      "Trump warns Iran \"time is running out\" for talks, threatens \"far worse\" attack - Axios",
      "Trump warns Iran 'time is running out' for nuclear deal as US military builds up in Gulf",
      "Trump warns Iran an 'armada' is heading its way and to agree a nuclear deal, or else",
      "Trump warns Iran ‘time is running out’ for deal to avert US military action",
      "Threat of US-Iran war escalates as Trump warns time running out for deal",
      "Trump Warns Iran Time Is Running Out as Ships Enter Region - Bloomberg",
      "Trump tells Iran to make nuclear deal or next attack will be 'far worse' - Reuters",
      "Trump warns Iran that next attack ‘will be far worse’ - Al Arabiya English",
      "Trump warns Iran an 'armada' is heading its way and to agree a nuclear deal, or else - CNBC"
    ],
    "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTE9Ua01pWlR3UDQwT1AwV3dDWVJORXlUNjVudmRMZXNMZEtNcGRUOW5rOEh4QW04UUp4MEJET2xHWDVsNmVmNDFFNXhPeERLZnRDeWhGN0RQUDVnY2hMMF9ERWtMTVN6Q1A3MHdqY0FVc3Yzbm5M?oc=5",
    "alternate_urls": [
      "https://www.bbc.com/news/articles/cly5pd459gko?at_medium=RSS&at_campaign=rss",
      "https://www.cnbc.com/2026/01/28/trump-iran-armada-nuclear-program-deal.html",
      "https://www.ft.com/content/070b13a2-61c8-48fb-9bb0-42512f0c487d",
      "https://www.theguardian.com/world/2026/jan/28/trump-threat-us-iran-war-armada-nuclear-programme",
      "https://news.google.com/rss/articles/CBMitAFBVV95cUxNdHRmTURUUGpHdDFiVXRKRnFLNU9JWXJqOFZLZEpjTkNrMnY3SVRIalZqTVNQX19PVktES0MtR1lLelJZWnZsYi0zLWJIejhRc3A5Z3prTGpDdnltM3JDQVBXOVctemM1TlNyckVMV3FEUnZZckJHWXlXb0daeS1sRFJuaEV6SHNlNTJacnl1Zm43dnFyekF3Y3pfNXdZUGxybndfU1pDMHoxcTlWaXNqMUs3Y0Q?oc=5",
      "https://news.google.com/rss/articles/CBMivgFBVV95cUxOY0RUa19maUR6Y3BnbmZJSUpBSnZGTzJHMzBldDE1X0ZuM0lkRHRNZFNWU2w3YmNFME9nQy0yVl9DTWk1RHFpVGpEcndYNEJoX1dhbFhjOURPUFVhWThKbkl1cVJUcDV1V0ZncFZENjJ5UVA0ZEVVd2FydEo3VjBIRGpuZUdMbzlDNW5ZYmxrNHhKVWFBd2NaM0FnZjVTMVh5d2N1WWxSQzctcHJaVVpZS0h2SEtPam8wYjgtZldn?oc=5",
      "https://news.google.com/rss/articles/CBMitAFBVV95cUxOYXN4bWpUN251bnZZRzFtVS1aeHNINUxaRmpEbHBhN0pVTUw3bXRmSzYzVjd2LTFwR19RSmdSaGo0QnJkTmZsdjdHVTdFUmFMSDJvYWhzWHhMNE5UZVk1WTd1Qldkb1hGei1RTXA5alVoM2xvallkemxCQlJDeXpkZFU3RUM0eTg5bnRVenpoaGY4T1pXWnNsNkZvaWVsaG9CUG9TaExuMXM5UlRTb1JUQnV2U1nSAbQBQVVfeXFMTmFzeG1qVDdudW52WUcxbVUtWnhzSDVMWkZqRGxwYTdKVU1MN210Zks2M1Y3di0xcEdfUUpnUmhqNEJyZE5mbHY3R1U3RVJhTEgyb2Foc1h4TDROVGVZNVk3dUJXZG9YRnotUU1wOWpVaDNsb2pZZHpsQkJSQ3l6ZGRVN0VDNHk4OW50VXp6aGhmOE9aV1pzbDZGb2llbGhvQlBvU2hMbjFzOVJUU29SVEJ1dlNZ?oc=5",
      "https://news.google.com/rss/articles/CBMigAFBVV95cUxPZThPVl93OXVrc1h0V1hrdThZbFdmOXZIaWVtWnNQOGczZVZOUU50bUpKYXZQMXpfajZmd21ORHBweU0wTzMybWhPeWJYLXZrTXphVVp4b0l5X0ZGUXBKdjVzN0licUpwTlpZTkNudC00c0V0U0l2aTFfakNRSXhyctIBhgFBVV95cUxOSDZETDJ5Sm16aTlhbUpUT09sb3FMMmd4NS1HdlFYaEFrTVJZSXVfaTNlaVdmWVRrcjU5LWloakptUmxGZDZjeTRtMDBrTzhxdDA0ZWppdlYxOUFfTU83LWw4bmZqRFpaSF9XNkdZeUZaNTZNWVl3OElLQzZSWFVnWWRCSnNDUQ?oc=5"
    ],
    "location_scope": "national",
    "link": "https://news.google.com/rss/articles/CBMidEFVX3lxTE9Ua01pWlR3UDQwT1AwV3dDWVJORXlUNjVudmRMZXNMZEtNcGRUOW5rOEh4QW04UUp4MEJET2xHWDVsNmVmNDFFNXhPeERLZnRDeWhGN0RQUDVnY2hMMF9ERWtMTVN6Q1A3MHdqY0FVc3Yzbm5M?oc=5",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.802,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.791,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "negative_penalty=0.08 (keywords: attack); speculative_penalty=0.06 (tokens: warn); semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "On January 28, 2026, Donald Trump warned Iran to agree to a nuclear deal soon or face a much stronger U.S. military response. He stated that a large U.S. naval force is heading to the region, while Iran said its armed forces are ready to respond to any aggression. Tensions between the U.S. and Iran have escalated as both sides issue threats.",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "Rep. Ilhan Omar Sprayed With Unknown Substance at Minneapolis Town",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Wed, 28 Jan 2026 13:18:45 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "ABC News",
      "CBC News",
      "Associated Press",
      "Globe and Mail",
      "Bloomberg"
    ],
    "domains": [
      "news.google.com",
      "abcnews.go.com",
      "cbc.ca"
    ],
    "snippets": [
      "Rep. Ilhan Omar attacked at town hall, sprayed with \"unknown liquid\" Axios",
      "During a town hall in Minneapolis on Tuesday, a man charged the podium where Rep. Ilhan Omar was giving remarks, appeared to spray a liquid at her, and was tackled to the ground by a security guard.",
      "A man sprayed an unknown substance on Democratic U.S. Rep. Ilhan Omar and was tackled to the ground Tuesday during a town hall in Minneapolis, where tensions over federal immigration enforcement have come to a head after agents fatally shot an intensive care nurse and a mother of three this month.",
      "Man arrested after spraying unknown substance on Rep. Ilhan Omar at Minneapolis town hall AP News",
      "Man sprays unknown substance on Ilhan Omar during Minneapolis town hall The Globe and Mail",
      "Representative Ilhan Omar Attacked at Town Hall in Minneapolis Bloomberg"
    ],
    "image_url": "",
    "titles": [
      "Rep. Ilhan Omar attacked at town hall, sprayed with \"unknown liquid\" - Axios",
      "WATCH:  Man arrested after charging Rep. Omar, spraying her with liquid during town hall",
      "Man sprays U.S. lawmaker Ilhan Omar with unknown substance at town hall",
      "Man arrested after spraying unknown substance on Rep. Ilhan Omar at Minneapolis town hall - AP News",
      "Man sprays unknown substance on Ilhan Omar during Minneapolis town hall - The Globe and Mail",
      "Representative Ilhan Omar Attacked at Town Hall in Minneapolis - Bloomberg"
    ],
    "url": "https://news.google.com/rss/articles/CBMihwFBVV95cUxORFM5dEtEOXNUWWFackV0X2hJcWRGbjlMYWtScEZMeHdad2diWHFDcVJDUjBYeDJjMHBxM29DSDlSV1pWRXZWRDgxUGJ6dUFHQWNzWHVBME9QVUxWYzRRS18tWkw4SzV6YVlaV3FGOEFLaFFYQUwzSGNkTHRlbkh6dmhnSzRLTG8?oc=5",
    "alternate_urls": [
      "https://abcnews.go.com/US/video/man-arrested-after-charging-rep-omar-spraying-liquid-129637671",
      "https://www.cbc.ca/news/world/ilhan-omar-minneapolis-sprayed-town-hall-9.7064218?cmp=rss",
      "https://news.google.com/rss/articles/CBMikgFBVV95cUxOMzhqcUFPNE9mdjVTN01YbkMyOW1VN2RqR1lqRENGSS1fQ1c2U24yVVJSb29rX2E2VTdGZU42MFFGWU9qWkRweDRNSUxUdVg1TU5KNmgzTTlSbHVyZXFjcUVzVHJNaHliY21fdV81ZTM2a3RJVTdvM3VuUXI1SXhrYW1sc1c4X1VOMFZyTUFkOTRWdw?oc=5",
      "https://news.google.com/rss/articles/CBMipgFBVV95cUxOSzd0QzRpX25yaEpUTVplYnlmNk10d0NUNGMtQXVXZFBCLW00Z3c5a0JzRzEtVEJ1NjVObFBTenhyVXhTNlk4SWhsLUhGTzdOd3JLNDRTSnlKSE9MYWZNQW9aOTdBeE4zbkhCS0ZqUGE1TXBZNG5TSlBkUlVlU194Zmphd0xxVDRtS3QwUVZ5QXRHangyU1BHbjdGYXhPdzc2WWN2cFp3?oc=5",
      "https://news.google.com/rss/articles/CBMiswFBVV95cUxPREJWNjJEMURmQ2Q2MDB3V3Q0anM3Vno1V2psY3ZKQjFxSV9QY0M3ZGpRZi1KR0dhSkN6Z3ppbUllREx5eW1DSzJVZkFoVXlPSmJnLUZWYndqTF9LOVVfZzFzR0VVVHRzeVAwb2VIU3B1Y2hTeWZqQlJCS0dBUEJBeDVpd0M0dE5PYlp0WXNsXy0wTEoxVVlSWVdIbWFsaWtoTDZQUGJvVXF4bmVmOFFyRkRxYw?oc=5"
    ],
    "location_scope": "national",
    "link": "https://news.google.com/rss/articles/CBMihwFBVV95cUxORFM5dEtEOXNUWWFackV0X2hJcWRGbjlMYWtScEZMeHdad2diWHFDcVJDUjBYeDJjMHBxM29DSDlSV1pWRXZWRDgxUGJ6dUFHQWNzWHVBME9QVUxWYzRRS18tWkw4SzV6YVlaV3FGOEFLaFFYQUwzSGNkTHRlbkh6dmhnSzRLTG8?oc=5",
    "score_components": {
      "magnitude": 0.986,
      "recency": 0.784,
      "consensus": 0.999,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.781,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "negative_penalty=0.08 (keywords: attack); semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Rep. Ilhan Omar was sprayed with an unknown substance by a man during a town hall in Minneapolis on Tuesday. The man was tackled by security and arrested. Omar was not seriously injured. The incident occurred amid heightened tensions over recent federal immigration enforcement actions in the city.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Sarah Mullally Confirmed as First Female Archbishop of Canterbury",
    "domain": "general",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Wed, 28 Jan 2026 12:47:50 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian",
      "Associated Press"
    ],
    "domains": [
      "bbc.com",
      "theguardian.com",
      "news.google.com"
    ],
    "snippets": [
      "The first woman to lead the Church of England in its history is officially confirmed at St Paul's Cathedral.",
      "Sarah Mullally confirmed as 106th person to take up post as some African church leaders express dismay at appointment The first female archbishop of Canterbury has marked her confirmation in the role with a vow to speak out about misogyny while questions continue about her record on safeguarding. Sa",
      "Sarah Mullally confirmed as archbishop of Canterbury, first woman to lead the Church of England AP News"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/5605/live/76d55200-fc45-11f0-a8b8-bdd2c5f9bcad.jpg",
    "titles": [
      "I will speak out on misogyny, first female Archbishop of Canterbury says",
      "First female archbishop of Canterbury vows to call out misogyny",
      "Sarah Mullally confirmed as archbishop of Canterbury, first woman to lead the Church of England - AP News"
    ],
    "url": "https://www.bbc.com/news/articles/c7v0948vm9go?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://www.theguardian.com/world/2026/jan/28/sarah-mullally-first-female-archbishop-canterbury-vows-call-out-misogyny",
      "https://news.google.com/rss/articles/CBMiugFBVV95cUxOZDlpMjVycjVVNlltRnYxM3pLVnZIVW9wY3FsQTQ2QXFnMDF6M0kwaktnS2Vpc2JKSllJc1FxdFFjQkJMeVZmSHd2a2YwQzgwV21TQUVvUG9MV1JXRC1falJoSlR2a3BGOHhYWFB2ZGVzNEVsZXllcThVVkZyMzJHTkxyNU95dVZ5WHBsVC00cU9meU5RVUNfV1VNVHdiSnc1eFhJSTJfSWdOTWJUQnZlT2x4a1ltU1Y5MkE?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/news/articles/c7v0948vm9go?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.773,
      "consensus": 0.789,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.778,
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story clearly highlights progress in terms of gender equality in religious leadership. It also empowers readers with the knowledge that the Archbishop plans to address misogyny, suggesting potential future improvements.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Sarah Mullally has been officially confirmed as the archbishop of Canterbury, becoming the first woman to lead the Church of England. The confirmation ceremony took place at St Paul's Cathedral. Some African church leaders have expressed dismay at her appointment, while Mullally has pledged to address misogyny in the church.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Amazon to Lay Off 16",
    "domain": "business",
    "source_domain": "cnbc.com",
    "location": "national",
    "published": "Wed, 28 Jan 2026 15:02:43 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "CBC News",
      "Bloomberg",
      "Associated Press",
      "Business Insider"
    ],
    "domains": [
      "cnbc.com",
      "cbc.ca",
      "news.google.com",
      "businessinsider.com"
    ],
    "snippets": [
      "The layoffs mark the second round of mass cuts at Amazon since last October, when the company laid off roughly 14,000 employees across its corporate workforce.",
      "Amazon is slashing about 16,000 corporate jobs in the second round of mass layoffs for the e-commerce company in three months.",
      "Amazon to Cut 16,000 Corporate Positions to Trim Bureaucracy Bloomberg",
      "Amazon cuts about 16,000 corporate jobs in the latest round of layoffs AP News",
      "Amazon laying off about 16,000 corporate workers in latest anti-bureaucracy push CNBC",
      "The notifications state that employees will receive full pay and benefits for 90 days."
    ],
    "image_url": "",
    "titles": [
      "Amazon laying off about 16,000 corporate workers in latest anti-bureaucracy push",
      "Amazon lays off 16,000 corporate workers in latest round of job losses",
      "Amazon to Cut 16,000 Corporate Positions to Trim Bureaucracy - Bloomberg",
      "Amazon cuts about 16,000 corporate jobs in the latest round of layoffs - AP News",
      "Amazon laying off about 16,000 corporate workers in latest anti-bureaucracy push - CNBC",
      "Read the email Amazon is sending to laid-off employees as it cuts 16,000 corporate roles"
    ],
    "url": "https://www.cnbc.com/2026/01/28/amazon-layoffs-anti-bureaucracy-ai.html",
    "alternate_urls": [
      "https://www.cbc.ca/news/business/amazon-prematurely-alerts-layoffs-canada-us-9.7064378?cmp=rss",
      "https://news.google.com/rss/articles/CBMisgFBVV95cUxPcWdNaTd2Wlk1bzY5OVJKbkNubW9PcnJMbG1qTldhZmNlYjFiQnlnTUZzSlRJQlhHWTI1RmpxYzdsbFdrTWtJel9IZDFGNUU5ZURZb0FyNHY0Um01NVVzaTZBY3RsbE5TdGRoOTh4VVRXRVhEa2trNzVldEFRWmV2V2p5Wm1Yd2RQVm5ZVDROUEtvOC1fdEw5WUxrX2ZFWC1WNk50VW94MmVFdHJLZnEwNl93?oc=5",
      "https://news.google.com/rss/articles/CBMikgFBVV95cUxQOVAyM0tSQldldU1LWDlnUGdKeTFYNnJFXzBmR3FXMFVzd0t5UnowR3RTQVAxUTJNX3B6YWI1U2VzZ0hzSFMyQ0NzdXA2Y3I0OGFxOUtOLUZyRnRQaTZVSnpsY1A5bngzczcza19sc0NCdGk0eVVybDNUWGRFTU1ZekY1Q3dHSGJ0LWgwaDJfb0gxUQ?oc=5",
      "https://news.google.com/rss/articles/CBMie0FVX3lxTE1ERVFYY2pWdHVtaldTLTVvTTlwUjc5VFk3bDZUQ0YyNU9yVVE0MElIclZtb1QtVDN2QXExUmpKXzB2eDhUdm9BbGRpc3UwRlNEYkU4Y1JQUlRucXdiMThoZFRWTWxDV3NtTVc3NlBEc2lxOF9lLURhZ2pnMNIBgAFBVV95cUxOMjUxRVlpOF9Sc09RLW85SzFCbXoxelppRkwyZ2xib0k3VzdZNGk5SjZadTFYMUs0N2VHaUgyanA4Mm1HTHp1cHZtSDc4R3FwNmdReklNdktXb1c1ZzBVcV9IYlgyZVU2Q0xtUDN6RmsxV3NvYzRua25MTWFFZ1E4bg?oc=5",
      "https://www.businessinsider.com/read-the-email-amazon-is-sending-to-laid-off-employees-2026-1"
    ],
    "location_scope": "national",
    "link": "https://www.cnbc.com/2026/01/28/amazon-layoffs-anti-bureaucracy-ai.html",
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.823,
      "consensus": 0.975,
      "constructiveness": 0.022,
      "proximity": 0.5
    },
    "score": 0.777,
    "constructiveness_score": 0.022,
    "constructiveness_reason": "semantic: pos_sim=0.09, neg_sim=0.00; semantic_boost=0.02; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Amazon is cutting about 16,000 corporate jobs in its second round of mass layoffs in three months, aiming to reduce bureaucracy. Affected employees will receive full pay and benefits for 90 days.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Dollar Rises After Bessent Rejects U.S. Currency Market Intervention",
    "domain": "business",
    "source_domain": "cnbc.com",
    "location": "national",
    "published": "Wed, 28 Jan 2026 18:46:21 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Reuters",
      "Bloomberg",
      "Financial Times"
    ],
    "domains": [
      "cnbc.com",
      "news.google.com",
      "ft.com"
    ],
    "snippets": [
      "Treasury Secretary Scott Bessent shut down reports that the U.S. may step into the currency market.",
      "Dollar rebounds as Bessent reaffirms US strong dollar policy Reuters",
      "Bessent Touts a Strong Dollar After Trump Brushed Off Its Drop Bloomberg",
      "Greenback rebounds after Treasury secretary rejects speculation that Washington is intervening to boost yen"
    ],
    "image_url": "",
    "titles": [
      "U.S. dollar rebounds after Bessent shuts down report of potential yen intervention",
      "Dollar rebounds as Bessent reaffirms US strong dollar policy - Reuters",
      "Bessent Touts a Strong Dollar After Trump Brushed Off Its Drop - Bloomberg",
      "Bessent says Trump administration still pursuing ‘strong dollar policy’"
    ],
    "url": "https://www.cnbc.com/2026/01/28/bessent-treasury-currency-market-intervention-dollar-yen.html",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMipwFBVV95cUxQTDNLM0VRX002dDIybURyQllSVXh3OTQyVk1BeUZDaVNNa3htaDlkeGI3czYyTGE4UUg0eTJpQTFfN1MtRnY0eUxxbl9WNl9POXdUS19wZjlJcENhMnZNcThKbDRVcE5UZ0xuNHE2eTlNVFJMVGliWGdqVDlBbGtfTXpoWjNWU0dTWjFKSkhRbHljbmJvSzI0YUx6QmZYeWlfS3l5Nks0Zw?oc=5",
      "https://news.google.com/rss/articles/CBMiswFBVV95cUxNMEtkRlkwZkhUc3djbTFmUTJ0QWJ0eGdaS0F6MTdWZjNCNmdhTi1hUVpGb1dkNWVielhxaDJKYnRyQ2todHlqQ0tWb2poblYzVWwxY3BLTFJmQms3emRuNUpNQzU1YTZBbTFNVmduSlg0eERad0VMUXZjMlVDRENMcWQ5NklfUHJYUG9sZ0xndWpfS2NKN3BlWXlsSmRJVkt1WVF4NGtYckhVWXRpR2tRbWpZVQ?oc=5",
      "https://www.ft.com/content/e3fd65cd-a319-4cc1-a74b-5daa7f63799c"
    ],
    "location_scope": "national",
    "link": "https://www.cnbc.com/2026/01/28/bessent-treasury-currency-market-intervention-dollar-yen.html",
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.913,
      "consensus": 0.888,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.769,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.09; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Treasury Secretary Scott Bessent reaffirmed the U.S. strong dollar policy and dismissed speculation of government intervention in currency markets. Following his statements, the dollar rebounded after recent declines.",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "UK Confirms Chagos Deal Remains in Place Despite Trump Criticism",
    "domain": "politics",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Wed, 28 Jan 2026 17:00:10 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Financial Times",
      "The Guardian"
    ],
    "domains": [
      "bbc.com",
      "ft.com",
      "theguardian.com"
    ],
    "snippets": [
      "The prime minister says he has discussed the deal with Donald Trump, but there are concerns in Whitehall the US could withdraw support for the agreement.",
      "London raises subject with Washington after stinging criticism from Trump",
      "Downing Street sources say agreement is ‘done deal’ and will not be scuppered by US president’s U-turn US intelligence agencies disagree with Donald Trump’s newly found opposition to the Chagos deal , Keir Starmer has said, as he underlined how the US administration had supported the deal as it bols"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/c367/live/ac3645c0-fae8-11f0-adda-0755af0bac4f.jpg",
    "titles": [
      "Chagos discussions with US continue, says Starmer",
      "Talks with US over Chagos Islands deal have reopened, confirms Starmer",
      "US intelligence agencies disagree with Trump’s opposition to Chagos deal, says Starmer"
    ],
    "url": "https://www.bbc.com/news/articles/cp80p875pdko?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://www.ft.com/content/9c6d74da-fa9d-4824-bdf5-a771819c2713",
      "https://www.theguardian.com/world/2026/jan/28/us-intelligence-agencies-disagree-with-trumps-opposition-to-chagos-deal-says-starmer"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/news/articles/cp80p875pdko?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.869,
      "consensus": 0.789,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.767,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story provides basic awareness about the ongoing discussions between the US and Chagos, but it doesn't provide any depth or insight into the situation, the reasons behind these discussions, or their potential impacts.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Prime Minister Keir Starmer stated he discussed the Chagos agreement with Donald Trump amid concerns the US could withdraw support. Downing Street sources maintain the agreement is a 'done deal,' and US intelligence agencies continue to support it despite Trump's criticism.",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Major Banks Join Companies in Matching Employee Contributions",
    "domain": "business",
    "source_domain": "cnbc.com",
    "location": "national",
    "published": "Wed, 28 Jan 2026 16:42:06 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Reuters",
      "Forbes",
      "Business Insider"
    ],
    "domains": [
      "cnbc.com",
      "news.google.com",
      "forbes.com",
      "businessinsider.com"
    ],
    "snippets": [
      "Financial firms dominate the list of companies that are matching contributions for the",
      "BofA, JPMorgan to match US government contribution to Trump Accounts Reuters",
      "The banks follow similar pledges from other companies including BlackRock and BNY.",
      "JPMorgan and Bank of America will match the government's one-time contribution to investment accounts for newborns, known as \"Trump Accounts.\"",
      "JPMorgan Chase and Bank of America to match $1,000 U.S. contributions to employee 'Trump accounts' CNBC"
    ],
    "image_url": "",
    "titles": [
      "JPMorgan Chase and Bank of America to match $1,000 U.S. contributions to employee 'Trump accounts'",
      "BofA, JPMorgan to match US government contribution to Trump Accounts - Reuters",
      "JPMorgan And Bank Of America Will Match $1,000 Trump Account Deposits For Employees",
      "JPMorgan and Bank of America join the list of companies matching $1,000 contributions to employees' 'Trump accounts'",
      "JPMorgan Chase and Bank of America to match $1,000 U.S. contributions to employee 'Trump accounts' - CNBC"
    ],
    "url": "https://www.cnbc.com/2026/01/28/jpmorgan-chase-trump-accounts.html",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMivwFBVV95cUxNSmQyNFVNbUYtUUpmTlBTMjc0YnlXTGtmRXdLejFfSHNNUWJ5SHZTNl9wWEwzdWRVSk9Gbmc1RjYzQThBUnlsMC1rTUFkSzdCQkwxVTdBSUVPT1duWFBYOFRLMThiLUdNOHI2eTBsSjg5SGtSUU5NNUhBX1ZKTGx2QUp4UGdwcndUcGdFX29RbG9McDVtOUJWSEtzY2N2QWxEWGI3QzFlcVRlYklkSjQ2NzlRM0VzdE81WV9oQjdRWQ?oc=5",
      "https://www.forbes.com/sites/zacharyfolk/2026/01/28/jpmorgan-and-bank-of-america-will-match-1000-trump-account-deposits-for-employees/",
      "https://www.businessinsider.com/jpmorgan-jamie-dimon-companies-matching-trump-accounts-2026-1",
      "https://news.google.com/rss/articles/CBMidEFVX3lxTE84Yko4X2t1cEhVQ0FwNFBpZDZ6eFpiZjFqT3EyUlpRbU5rX3JYR1dVci04bkhocmF1X1FxSWZwb3poYnFLd1ZnQWFwUHpjeVo0N1M2VU0wemEyS0J4dHJFNl83VGtZWjBabGpkY29GbHE0UTdw0gF6QVVfeXFMTkV2X1ZzWFRzTzFXUGg5UW5BZlI5cnFJdERUUENZUHRsQ1lTM0ZtdWhueGlIc1Q2V0NfMGdXUW1VOExmXzRTMG9KYjZpbjJybmVtNDZDZ2Fna1FwTzZzQktwS3pjcldtOGdvYU5hZFFkSXNsejJLR2hVV1E?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.cnbc.com/2026/01/28/jpmorgan-chase-trump-accounts.html",
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.862,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.764,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Several major banks have joined companies like BlackRock and BNY in pledging to match employee contributions for a specific cause, with financial firms making up most of the participating organizations.",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "Champions League Group Stage Concludes With Key Final Round Matches",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Wed, 28 Jan 2026 14:43:18 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports",
      "Yahoo Sports"
    ],
    "domains": [
      "espn.com",
      "cbssports.com",
      "sports.yahoo.com"
    ],
    "snippets": [
      "Enjoy live updates of all 18 matches of the final matchday of the league phase in the 2025-26 UEFA Champions League.",
      "All eyes will be on Napoli where Chelsea chase top 8 and the hosts look to sneak into the top 24",
      "Chivu and Kovac lock in their teams for final-round clashInter Milan vs Borussia Dortmund lineups confirmed for Champions League final roundInter Milan will face Borussia Dortmund on Wednesday evening..."
    ],
    "image_url": "",
    "titles": [
      "Live updates: Champions League league phase final ...",
      "Footy Fix as Matchday Mayhem returns: Champions League league phase with 18 simultaneous games on Paramount+",
      "Inter Milan vs Borussia Dortmund lineups confirmed for Champions League final round"
    ],
    "url": "https://www.espn.com/soccer/story/_/id/47747382/live-updates-uefa-champions-league-league-phase-final-matchday",
    "alternate_urls": [
      "https://www.cbssports.com/soccer/news/footy-fix-as-matchday-mayhem-returns-champions-league-league-phase-with-18-simultaneous-games-on-paramount/",
      "https://sports.yahoo.com/articles/inter-milan-vs-borussia-dortmund-195500834.html"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/soccer/story/_/id/47747382/live-updates-uefa-champions-league-league-phase-final-matchday",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.937,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.762,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Lineups have been confirmed for the final round of the 2025-26 UEFA Champions League group stage, including Inter Milan vs Borussia Dortmund. Chelsea will play Napoli as both teams seek to advance in the competition.",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "NBA Teams Prepare for Trade Deadline as Mavericks Focus on Flagg",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Wed, 28 Jan 2026 13:39:58 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports",
      "Yahoo Sports"
    ],
    "domains": [
      "espn.com",
      "cbssports.com",
      "sports.yahoo.com"
    ],
    "snippets": [
      "What deals could kick-start the trade deadline? Marks examines the players, picks and priorities you need to know for every team.",
      "These 10 teams figure to be the biggest sellers at next week's trade deadline",
      "With one week until the Feb. 5 trade deadline, it's unlikely the L.A. teams will make a big splash, but there are some solid role players available to bolster rosters.",
      "However the Mavericks slice it, their new focus is Flagg, and every roster decision has to be with him in mind."
    ],
    "image_url": "",
    "titles": [
      "Bobby Marks' NBA trade deadline guide: What to kno...",
      "NBA trade deadline seller's guide: Which difference-makers could move from non-contenders?",
      "NBA trade deadline: What moves might the Lakers or Clippers make?",
      "NBA trade deadline: The moves the Mavericks should make to build around Cooper Flagg"
    ],
    "url": "https://www.espn.com/nba/story/_/id/47735878/nba-trade-deadline-tiering-all-30-teams-ahead-feb-5",
    "alternate_urls": [
      "https://www.cbssports.com/nba/news/2026-nba-trade-deadline-sellers-guide/",
      "https://sports.yahoo.com/articles/nba-trade-deadline-moves-might-120000416.html",
      "https://sports.yahoo.com/nba/article/nba-trade-deadline-the-moves-the-mavericks-should-make-to-build-around-cooper-flagg-140712649.html"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/nba/story/_/id/47735878/nba-trade-deadline-tiering-all-30-teams-ahead-feb-5",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.91,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.754,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "With the NBA trade deadline approaching on February 5, several teams are expected to focus on selling players, while the Mavericks are centering roster decisions around Flagg. Major trades from Los Angeles teams are unlikely, but some role players may be moved to strengthen lineups.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Prosecutors Seek Fine Against Budapest Mayor Karácsony Over Protest",
    "domain": "politics",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Wed, 28 Jan 2026 12:41:34 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Washington Post",
      "The Guardian"
    ],
    "domains": [
      "aljazeera.com",
      "washingtonpost.com",
      "theguardian.com"
    ],
    "snippets": [
      "Prosecutors seek fine against Mayor Gergely Karacsony 'without a trial'.",
      "Prime Minister Viktor Orban has aligned himself closely with President Donald Trump’s brand of populist conservatism and is a MAGA darling.",
      "Gergely Karácsony urged people to take to streets in June in pushback against Orbán government’s attack on rights Prosecutors in Hungary have filed charges against the progressive mayor of Budapest, seeking to fine him months after hundreds of thousands of people heeded his call to take to the stree"
    ],
    "image_url": "",
    "titles": [
      "Hungary charges Budapest mayor for allowing banned pride march",
      "Hungary announces charges against Budapest mayor over Pride events",
      "Budapest mayor charged over his calls for people to defy Hungary’s Pride ban"
    ],
    "url": "https://www.aljazeera.com/news/2026/1/28/hungary-charges-budapest-mayor-for-allowing-banned-pride-march?traffic_source=rss",
    "alternate_urls": [
      "https://www.washingtonpost.com/world/2026/01/28/hungary-budapest-mayor-pride-viktor-orban/",
      "https://www.theguardian.com/world/2026/jan/28/budapest-mayor-gergely-karacsony-charged-hungary-pride-ban"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2026/1/28/hungary-charges-budapest-mayor-for-allowing-banned-pride-march?traffic_source=rss",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.771,
      "consensus": 0.789,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.747,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs about a specific event and its consequences, providing some context about the political and social climate in Hungary. However, it lacks information on potential solutions or progress towards more inclusive policies.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Hungarian prosecutors have filed charges seeking to fine Budapest Mayor Gergely Karácsony for urging public protests against the government in June. The charges aim to impose the fine without a trial, following large demonstrations in response to Karácsony's call.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Victor Wembanyama Expresses Horror Over Minneapolis Shootings",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Wed, 28 Jan 2026 12:44:35 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "BBC Sport",
      "CBS Sports"
    ],
    "domains": [
      "espn.com",
      "bbc.com",
      "cbssports.com"
    ],
    "snippets": [
      "Spurs star Victor Wembanyama on Tuesday articulated his thoughts on a pair of fatal shootings by federal agents in Minneapolis, saying, \"Every day I wake up and see the news and I'm horrified.\"",
      "San Antonio Spurs' Victor Wembanyama says he is \"horrified\" after two fatal shootings by immigration agents in Minnesota.",
      "The San Antonio Spurs star spoke out Tuesday and said he didn't want to give a 'politically correct' answer"
    ],
    "image_url": "",
    "titles": [
      "Wembanyama 'horrified' by Minnesota shootings",
      "Spurs' Wembanyama 'horrified' by Minnesota shootings",
      "Victor Wembanyama speaks out on Minneapolis shootings, says he's 'horrified' by 'murder of civilians'"
    ],
    "url": "https://www.espn.com/nba/story/_/id/47747959/spurs-victor-wembanyama-horrified-minnesota-shootings",
    "alternate_urls": [
      "https://www.bbc.com/sport/basketball/articles/cddgpl0rlp8o?at_medium=RSS&at_campaign=rss",
      "https://www.cbssports.com/nba/news/victor-wembanyama-minneapolis-shootings-horrified-murder-of-civilians/"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/nba/story/_/id/47747959/spurs-victor-wembanyama-horrified-minnesota-shootings",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.887,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.747,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "negative_penalty=0.08 (keywords: shooting); semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0 (<6 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "San Antonio Spurs' Victor Wembanyama expressed horror on Tuesday regarding two fatal shootings by immigration agents in Minneapolis, stating he is disturbed by the news and did not want to give a 'politically correct' answer.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Yankees Trade for Reliever Angel Chivilli",
    "domain": "sports",
    "source_domain": "sports.yahoo.com",
    "location": "national",
    "published": "Wed, 28 Jan 2026 19:40:34 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports",
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "sports.yahoo.com",
      "sportsnet.ca",
      "espn.com"
    ],
    "snippets": [
      "The Twins sent the former top prospect to the Rockies for a pitcher in Low A.",
      "A Canadian infielder is on the move to the Mile High City.",
      "Colorado send prospect pitcher as cash to the Twins",
      "The Yankees added to their bullpen Wednesday by acquiring reliever Angel Chivilli from Colorado while the Rockies separately acquired infielder Edouard Julien and reliever Pierson Ohl from Minnesota.",
      "NEW YORK — The New York Yankees added to their bullpen Wednesday by acquiring right-handed reliever Angel Chivilli in a trade with the Colorado Rockies . They sent minor league infielder T.J. Rumfield to Colorado for Chivilli, a 23-year-old from the Dominican Republic with two seasons of major league experience. He had a 7.06 ERA in 43 relief appearances for the Rockies last year and a 4.55 ERA in 30 appearances with them in 2024. Chivilli in his career has struck out 71 batters, walked 33 and allowed 20 home runs in 90 1/3 innings. To make room on the 40-man roster for Chivilli, the team...",
      "The New York Yankees added to their bullpen Wednesday by acquiring right-handed reliever Angel Chivilli in a trade with the Colorado Rockies. To make room on the 40-man roster for Chivilli, the team designated outfielder Michael Siani for assignment.",
      "Colorado acquires first base prospect T.J. Rumfield",
      "The Yankees added to their bullpen on Wednesday, acquiring RHP Angel Chivilli from the Colorado Rockies in exchange for minor league 1B T.J. Rumfield.",
      "Matt Blake’s latest project has a 50-percent ground-ball rate… and needs some work"
    ],
    "image_url": "",
    "titles": [
      "Twins Trade Julien, Ohl to Rockies",
      "Rockies acquire Canadian Edouard Julien from Twins",
      "Rockies acquire Edouard Julien and Pierson Ohl from Minnesota",
      "Yanks strengthen bullpen, acquire Rockies' Chivill...",
      "Yankees acquire reliever Angel Chivilli in trade with Rockies",
      "Yankees acquire reliever Angel Chivilli in a trade with the Rockies",
      "Rockies trade Angel Chivilli to the Yankees",
      "Yankees acquire RHP Angel Chivilli in trade with Rockies",
      "Yankees acquire righty reliever Angel Chivilli from Rockies for T.J. Rumfield"
    ],
    "url": "https://sports.yahoo.com/articles/twins-trade-julien-ohl-rockies-194034690.html",
    "alternate_urls": [
      "https://sports.yahoo.com/articles/rockies-acquire-edouard-julien-pierson-191256383.html",
      "https://www.espn.com/mlb/story/_/id/47756031/yankees-acquire-reliever-angel-chivilli-trade-rockies",
      "https://sports.yahoo.com/articles/yankees-acquire-reliever-angel-chivilli-174936260.html",
      "https://sports.yahoo.com/articles/rockies-trade-angel-chivilli-yankees-174500706.html",
      "https://sports.yahoo.com/articles/yankees-acquire-rhp-angel-chivilli-174404315.html",
      "https://sports.yahoo.com/articles/yankees-acquire-righty-reliever-angel-173026330.html"
    ],
    "location_scope": "national",
    "link": "https://sports.yahoo.com/articles/twins-trade-julien-ohl-rockies-194034690.html",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.936,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.737,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The New York Yankees have acquired right-handed reliever Angel Chivilli from the Colorado Rockies in exchange for minor league infielder T.J. Rumfield. To clear space on the roster, the Yankees designated outfielder Michael Siani for assignment. Chivilli appeared in 30 games for Colorado in 2024 with a 4.55 ERA.",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "Shooting by Federal Agents in Minneapolis Spurs Outrage Amid",
    "domain": "politics",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Wed, 28 Jan 2026 12:34:06 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "CBC News",
      "Associated Press"
    ],
    "domains": [
      "news.google.com",
      "cbc.ca"
    ],
    "snippets": [
      "Homan arrives in Minnesota, but immigration crackdown continues Axios",
      "For days, the people of Minneapolis have been expressing outrage over the shooting death of Alex Pretti at the hands of federal agents. Here's how some of them are reacting to the shooting, as well as what they say about U.S. President Donald Trump's move to send more than 2,000 Immigration Customs",
      "What to know about Gregory Bovino, the commander of Trump’s immigration crackdown AP News"
    ],
    "image_url": "",
    "titles": [
      "Homan arrives in Minnesota, but immigration crackdown continues - Axios",
      "What Minnesotans are saying about Trump's immigration crackdown",
      "What to know about Gregory Bovino, the commander of Trump’s immigration crackdown - AP News"
    ],
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxOSzZYSXU3N0xuNjRseFN2RUNoM0d5al9rQzRpclNYQlNNV2hTelVNbjR2cWIxTFVIeldEQzZHbnY0MWdBbEdmaHFFdWV3UFJ2MFNMa3NxNGd6VW9vVWgzazFGQ1NycVB1amRZYTRDbk9KSnI2Tkw3SWlwZVEtTEdpRTJVMm9MM0lnY0V2eg?oc=5",
    "alternate_urls": [
      "https://www.cbc.ca/news/world/minneapolis-ice-minnesota-immigration-trump-9.7064077?cmp=rss",
      "https://news.google.com/rss/articles/CBMinwFBVV95cUxQN0xsZ3JqSHIyVzA3cTJCS1JpUjE1UFJNaGF4b09qNkJhLUJscUZvTXJydF9oVXNvQU5KTnNxdnVkdEZpZTNuZEdkR0VWV0ZaYW5GQVdmY3VkVFFzSWp3LUg2WVg3MHllVFZUWm1ObkcxZ3JCc2JRZnZBOW1MVFBLYkhScFZMY0NZT05tZmQ1TFVtbUg0WmdHRE1pUnpSelE?oc=5"
    ],
    "location_scope": "national",
    "link": "https://news.google.com/rss/articles/CBMijAFBVV95cUxOSzZYSXU3N0xuNjRseFN2RUNoM0d5al9rQzRpclNYQlNNV2hTelVNbjR2cWIxTFVIeldEQzZHbnY0MWdBbEdmaHFFdWV3UFJ2MFNMa3NxNGd6VW9vVWgzazFGQ1NycVB1amRZYTRDbk9KSnI2Tkw3SWlwZVEtTEdpRTJVMm9MM0lnY0V2eg?oc=5",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.768,
      "consensus": 0.769,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.732,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story offers basic awareness of the ongoing immigration crackdown in Minnesota, but it doesn't provide deeper understanding or actionable insights for the reader. It also doesn't report on any attempts to solve the problem or improve the situation.",
    "constructiveness_source": "gpt",
    "summary_source": "snippet",
    "summary_reason": "invalid_roles",
    "headline_source": "gpt",
    "summary": "Homan arrives in Minnesota, but immigration crackdown continues Axios",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "FBI Conducts Court Authorized Activity at Fulton County Election",
    "domain": "politics",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Wed, 28 Jan 2026 14:52:49 -0500",
    "source": "ABC News",
    "sources": [
      "ABC News",
      "NPR"
    ],
    "domains": [
      "abcnews.go.com",
      "npr.org"
    ],
    "snippets": [
      "The FBI said Wednesday that there is court authorized activity at the Fulton County Election Hub and Operation Center.",
      "The FBI would not clarify whether the action is tied to the 2020 election, but last month the Department of Justice announced it's suing Fulton County for records related to the election."
    ],
    "image_url": "https://s.abcnews.com/images/US/atlanta-election-1-ht-gmh-260128_1769627294160_hpMain_4x3t_384.jpg",
    "titles": [
      "FBI conducting 'court ordered activity' at Georgia election site",
      "The FBI conducts a search at the Fulton County election office in Georgia"
    ],
    "url": "https://abcnews.go.com/Politics/fbi-conducting-court-ordered-activity-georgia-election-site/story?id=129644345",
    "alternate_urls": [
      "https://www.npr.org/2026/01/28/nx-s1-5691764/fulton-county-fbi-search-election"
    ],
    "location_scope": "national",
    "link": "https://abcnews.go.com/Politics/fbi-conducting-court-ordered-activity-georgia-election-site/story?id=129644345",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.941,
      "consensus": 0.591,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.721,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story raises awareness about an ongoing investigation related to election integrity. However, without more context or details, it offers minimal depth or insight for readers.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The FBI confirmed court-authorized activity at the Fulton County Election Hub and Operation Center. The Department of Justice recently filed a lawsuit against Fulton County seeking records related to the 2020 election. The FBI did not specify if its action is connected to the lawsuit.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Stocks Hit Record High and Gold Surges Ahead of Fed Rate Decision",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Wed, 28 Jan 2026 17:56:42 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "CNBC",
      "Financial Times"
    ],
    "domains": [
      "news.google.com",
      "ft.com"
    ],
    "snippets": [
      "Gold tops $5,300 for first time on dollar weakness ahead of Fed decision Reuters",
      "Stocks hit record high, dollar stabilizes ahead of Fed rate call Reuters",
      "Gold tops $5,300 for first time on dollar weakness ahead of Fed decision CNBC",
      "Optimism over earnings powers Wall Street rebound from Greenland crisis"
    ],
    "image_url": "",
    "titles": [
      "Gold tops $5,300 for first time on dollar weakness ahead of Fed decision - Reuters",
      "Stocks hit record high, dollar stabilizes ahead of Fed rate call - Reuters",
      "Gold tops $5,300 for first time on dollar weakness ahead of Fed decision - CNBC",
      "S&P 500 tops 7,000 for first time"
    ],
    "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxNbk1WRzhYU0QtQnBKNkdHZ0hzYWt5VENBaDNtR2NzLUZkTlQzb2tnMHIzSDEtbGZpOE9DT095T25HRVlwZDJwMTlyMjJpWThCUEhfeDA1M24xYmtsaXk5NkVGdjAwSi1Ock5pWU4yOXc1MHN1Z1Q1Z0JERkRhQkYwZVVXLTdIX2l6VWEtVElQeWxIU183c3VhTWF5aWFTY0pJYmxzYW9jcGxaVzV2NzlIczdHQjJiZDBJUE10VGpCWXE?oc=5",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMie0FVX3lxTE5iaW1zVmRFeDBJQmpYNWJtaEx3ZHNoYS1vdUszeVBKUWNCYmFTaGlUcjF4dXhtS2h5aUdHZTZtR3FVa1N0OEpLSE5DbHRsc0E0R2xnMVRwVjNYeGV3Q2ZIdzVVOUxSRm1rOHZiOUJMdmJPYWpFaXJTRzVBUQ?oc=5",
      "https://news.google.com/rss/articles/CBMiowFBVV95cUxPX1ptWjU5c2puMlN0aHVjS1dWcG9ERnBDel9VM1JWRmg0aVZNZ0tGTm1VWnBrdUY5dWZmTXVPOUtzVTlNZGRkc0ZUb0ItajhXSWlDOHlQZEstbkFuM21wTW5xN2o0bVJJUDctUzNLSkRiTEVOZ2N5UVBycTlPWFN2WDZYMFVuQjdTMnBEUlg0cUVwZEFGY0xUR2NzLXFoR050ZzVR0gGoAUFVX3lxTE9OeHRDMndxemJPZ3NoZ1ZmQkZqdFNNc05KaHViVGFKa3BsZ21GLU0wT0x0b2JGa3VLa3BuSUxuWFRDNTR3bWFOa3phOG1TNV9OV084ZWpDQ0JBeVpJRE90M2lhTG82TnJrejlpR1BXRWMxS3VPZ1BXNWZxTXJnYlc3X01TRGV0b2wyWWx3VWwyU3NtUFhySFZFSDB3bzV0XzFZcndvd2puQg?oc=5",
      "https://www.ft.com/content/321eb05e-47a5-454c-8c46-fa22b4296957"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxNbk1WRzhYU0QtQnBKNkdHZ0hzYWt5VENBaDNtR2NzLUZkTlQzb2tnMHIzSDEtbGZpOE9DT095T25HRVlwZDJwMTlyMjJpWThCUEhfeDA1M24xYmtsaXk5NkVGdjAwSi1Ock5pWU4yOXc1MHN1Z1Q1Z0JERkRhQkYwZVVXLTdIX2l6VWEtVElQeWxIU183c3VhTWF5aWFTY0pJYmxzYW9jcGxaVzV2NzlIczdHQjJiZDBJUE10VGpCWXE?oc=5",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.892,
      "consensus": 0.769,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.72,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Stocks reached a record high and the dollar stabilized as investors awaited the Federal Reserve's interest rate decision. Gold surpassed $5,300 for the first time, supported by a weaker dollar. Optimism over corporate earnings contributed to Wall Street's rebound following the recent Greenland crisis.",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "S&P 500 Closes Above 7",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Wed, 28 Jan 2026 15:05:35 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "Reuters"
    ],
    "domains": [
      "news.google.com"
    ],
    "snippets": [
      "S&P 500 tops 7,000 for the first time ever Axios",
      "S&P 500 breaches 7,000 points for the first time, lifted by AI optimism Reuters"
    ],
    "image_url": "",
    "titles": [
      "S&P 500 tops 7,000 for the first time ever - Axios",
      "S&P 500 breaches 7,000 points for the first time, lifted by AI optimism - Reuters"
    ],
    "url": "https://news.google.com/rss/articles/CBMiZEFVX3lxTE5kamFTUENTZlgwSW9LRy1MSVBTQ0ZoWlVCNHRqNEJrdnY2R1lPNVdJdzdlSDJPWkhxS2t0Y1NuTzZJRkJYRkd6RlpfbUhzeVhWTkwtZEFIeEowQzNuTGNHMm1rT2g?oc=5",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMisgFBVV95cUxQX2prSzBUMUJzS2gxZzByMHU4UDFIVVdvRl9BYzQxMk54MkEtSW5mRG9NYkQ3SDI5SjhZUlVaaU5vN2hMV1k0ZDNReENINzIyNDFzYWsxNXhXVldFS3ZKWWxQcF9iazI1a1Q5dFRjelVaMWRYdHo4b1cwa2hQUTB2REEzLWlSbnBsbGFCWjhMblhIazhBd1NZMm5CU3RoSWNGX2hHYnJyUV92dFJnQkdWRDZR?oc=5"
    ],
    "location_scope": "national",
    "link": "https://news.google.com/rss/articles/CBMiZEFVX3lxTE5kamFTUENTZlgwSW9LRy1MSVBTQ0ZoWlVCNHRqNEJrdnY2R1lPNVdJdzdlSDJPWkhxS2t0Y1NuTzZJRkJYRkd6RlpfbUhzeVhWTkwtZEFIeEowQzNuTGNHMm1rT2g?oc=5",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.824,
      "consensus": 0.571,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.692,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about a milestone in the financial market, which could inform decision-making for investors. However, it lacks context or explanation about what led to this achievement or what it means for the future.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The S&P 500 index closed above 7,000 points for the first time, driven by investor optimism about artificial intelligence. This marks a new record high for the benchmark U.S. stock index.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Mayor Mamdani Proposes Tax Increases on Wealthy to Address Budget",
    "domain": "business",
    "source_domain": "cnbc.com",
    "location": "national",
    "published": "Wed, 28 Jan 2026 18:26:47 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Bloomberg"
    ],
    "domains": [
      "cnbc.com",
      "news.google.com"
    ],
    "snippets": [
      "New York Mayor Zohran Mamdani attributed the budget crisis to \"gross fiscal mismanagement,\" pointing to former Mayor Eric Adams and ex-Gov. Andrew Cuomo.",
      "New York Mayor Mamdani says city must hike taxes on wealthy to fill $12 billion deficit CNBC",
      "Mamdani Pushes for Tax Hikes on Wealthy New Yorkers to Fill Budget Gap Bloomberg"
    ],
    "image_url": "",
    "titles": [
      "New York Mayor Mamdani says city must hike taxes on wealthy to fill $12 billion deficit",
      "New York Mayor Mamdani says city must hike taxes on wealthy to fill $12 billion deficit - CNBC",
      "Mamdani Pushes for Tax Hikes on Wealthy New Yorkers to Fill Budget Gap - Bloomberg"
    ],
    "url": "https://www.cnbc.com/2026/01/28/zohran-mamdani-taxes-nyc-rich-budget.html",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMifkFVX3lxTFBKS2pKUjQ1UGowQ3JTSmNQRzdQNjA5OXRUeVFLZlRtcTEyQm53Zm45SnFXcmVMOW5vbXFTSkdqVUVUdU5zd2hobUpyN2RjUjVSOFJPMTVsMmZqdDA2UjhrQ1BfN2hBR0p1TWFvVW1LUWtjRDN4QV91RzJPU0tZQdIBgwFBVV95cUxPNzUxR2ZoUFBDU2szOUo4QkV1R01lRHljbmlyOU96aC1ycE91blBzNElJOUFhQkM1TXZyTDlMNkU5Y2RzTk1QT3ZzU3phQkFZanpIMnBoNDNWUmRJLU43bENlS3hRd0QtdUhHZmU5RkNlcjZZaEVQQmU2SEdBTFJwVERtOA?oc=5",
      "https://news.google.com/rss/articles/CBMitAFBVV95cUxPbExlYm55a0FaUW5rNkp4SGhXRXVVVmhFNTRjUHUyVWtrNHF0VzhnbXJ6V3Q3U2xCMmRiaVF1eTJSeUo1bzBoTWgxcHJTVlhnQllzR3VvWjlja3l0UlBldGs4Nko1bGtWSUdjbVYtUXl4bk1UMzJLdE1LTU50QjJYTG9OenBxcnJGRkxzMEhLS0dqNS11RHhNc2ItY0FfSTZRRzRqYVVoOGJoOVI1YmJKZ0RnTkc?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.cnbc.com/2026/01/28/zohran-mamdani-taxes-nyc-rich-budget.html",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.904,
      "consensus": 0.591,
      "constructiveness": 0.048,
      "proximity": 0.75
    },
    "score": 0.69,
    "constructiveness_score": 0.048,
    "constructiveness_reason": "semantic: pos_sim=0.19, neg_sim=0.00; semantic_boost=0.05; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "New York Mayor Zohran Mamdani has proposed raising taxes on wealthy residents to address a $12 billion city budget deficit. Mamdani attributed the shortfall to fiscal mismanagement by former Mayor Eric Adams and ex-Governor Andrew Cuomo.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Al Maliki Condemns Trumps Threat to Withdraw US Support for Iraq",
    "domain": "politics",
    "source_domain": "theguardian.com",
    "location": "global",
    "published": "Wed, 28 Jan 2026 13:14:15 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "Al Arabiya"
    ],
    "domains": [
      "theguardian.com",
      "news.google.com"
    ],
    "snippets": [
      "Nouri al-Maliki responds to Donald Trump’s threat to withdraw US support for Iraq if he is returned to power US politics live – latest updates Iraq’s former prime minister Nouri al-Maliki has angrily denounced “blatant American interference” in the country’s election after Donald Trump threatened to",
      "Iraq PM candidate al-Maliki denounces Trump’s ‘blatant interference’ Al Arabiya English"
    ],
    "image_url": "https://i.guim.co.uk/img/media/ce765a92f47ece5dabe1c09b86a41f9ed90f337e/724_0_4583_3667/master/4583.jpg?width=140&quality=85&auto=format&fit=max&s=a5ee52a1783130539882f180ca7f93b1",
    "titles": [
      "Iraq’s former prime minister denounces ‘blatant American interference’ in election",
      "Iraq PM candidate al-Maliki denounces Trump’s ‘blatant interference’ - Al Arabiya English"
    ],
    "url": "https://www.theguardian.com/world/2026/jan/28/iraq-nouri-al-maliki-denounces-us-interference-trump-election",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMitwFBVV95cUxQdjl2d2xVa2ZEcTBuOTV5T0R3SUJZWTRVem9vTmNoUE90TWo2dnpYOVZPWWNvTGlEWnlYUUk2Q2x1SFU2bU82UXpFNEh6dUZXOUtIX1hTbHRLSk1xcnUwdU54cmRVVEl6ekZOd1djLTExYW9UdFF3bjM0N0ZLZ29ZcnBMYjFvekVtVEpLLVc2Nkt3cV9QS3UtYlEzZ19PaENWd3dOWE10b01GRUNaVjlCcmFadWU1VHPSAbwBQVVfeXFMTjF1dTdxdFVfUkJtSi1FOURya0QwbVVLRElyN2RCVUk2TWhjX2VkZHo0MzhlTVZkd2NkUTEyV0JlUjFFYzJ4RnQ0U1l2MzE5TW4wclVodGVPMjAtdktVX3dHZWRlbm9RNktlcXdKLUlpUHN1NDBEU2VETlpMNHpFdHcxaVh0ekVyRWtMNVB0azM4Wm84aERMeHlhYWFsUDVjQ29LY1o4QUprajByaTFjanh5cHcxUkhESGRlM0w?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.theguardian.com/world/2026/jan/28/iraq-nouri-al-maliki-denounces-us-interference-trump-election",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.783,
      "consensus": 0.591,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.684,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about international relations and election interference, which could contribute to readers' understanding of global politics. However, it does not appear to report on solutions or improvements.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Nouri al-Maliki criticized Donald Trump's threat to withdraw US support for Iraq if al-Maliki returns to power, calling it 'blatant American interference' in Iraq's election.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "India Confirms Two Nipah Virus Cases",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Wed, 28 Jan 2026 12:17:32 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "The Guardian"
    ],
    "domains": [
      "news.google.com",
      "theguardian.com"
    ],
    "snippets": [
      "Nipah virus: What to know after cases emerge in India Reuters",
      "Highly contagious virus, which spreads from animals to humans, has a high fatality rate and there is no vaccine Airports across Asia have been put on high alert after India confirmed two cases of the deadly Nipah virus in the state of West Bengal over the past month. Thailand, Nepal and Vietnam are"
    ],
    "image_url": "",
    "titles": [
      "Nipah virus: What to know after cases emerge in India - Reuters",
      "What is Nipah virus? Key things to know about the disease amid cases in India"
    ],
    "url": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxPOU05TnFSQS1DaDMyR09yOXVCVFEwczFxTEdaNlZGZDY1TjlYcmd5MTdoRUhTS19wSU1UY1FDejNLRm5TQWs5LVNxS1AxRk5BSkRqNTlKTVRiVmxXaXlFN3VEcEltQ2NuU0hiMEtfWkh6NS11ZU5RdkJ2cG16Z0x2M09LTUtCekVVTG03QlJ6MWRabEE3MHR0MEEzVEtPY3B5XzNzS2hPODRQVzJua3NPem1pN2dlZ2pzRllwTW9mY3g4UQ?oc=5",
    "alternate_urls": [
      "https://www.theguardian.com/science/2026/jan/28/what-is-nipah-virus-outbreak-india-symptoms"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMiwgFBVV95cUxPOU05TnFSQS1DaDMyR09yOXVCVFEwczFxTEdaNlZGZDY1TjlYcmd5MTdoRUhTS19wSU1UY1FDejNLRm5TQWs5LVNxS1AxRk5BSkRqNTlKTVRiVmxXaXlFN3VEcEltQ2NuU0hiMEtfWkh6NS11ZU5RdkJ2cG16Z0x2M09LTUtCekVVTG03QlJ6MWRabEE3MHR0MEEzVEtPY3B5XzNzS2hPODRQVzJua3NPem1pN2dlZ2pzRllwTW9mY3g4UQ?oc=5",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.762,
      "consensus": 0.591,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.677,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the Nipah virus, which can help the reader understand the situation in India. However, it doesn't report on solutions or improvements, and the depth of the information provided is unclear without the summary.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "India has confirmed two cases of the Nipah virus in West Bengal over the past month. In response, airports across Asia have increased alert measures. The Nipah virus spreads from animals to humans, has a high fatality rate, and currently has no vaccine.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Ajit Pawar Dies in Maharashtra Plane Crash",
    "domain": "general",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Wed, 28 Jan 2026 13:32:33 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "New York Times"
    ],
    "domains": [
      "aljazeera.com",
      "nytimes.com"
    ],
    "snippets": [
      "Authorities in India say they're investigating the cause of a plane crash that killed Ajit Pawar",
      "Ajit Pawar, the deputy chief minister of Maharashtra State, was on board a charter jet that crashed as it was coming in to land."
    ],
    "image_url": "",
    "titles": [
      "What we know about plane crash that killed Ajit Pawar",
      "Ajit Pawar, a Veteran Indian Politician, Among 5 Killed in Plane Crash"
    ],
    "url": "https://www.aljazeera.com/video/newsfeed/2026/1/28/what-we-know-about-plane-crash-that-killed-ajit-pawar?traffic_source=rss",
    "alternate_urls": [
      "https://www.nytimes.com/2026/01/28/world/asia/india-plane-crash.html"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/video/newsfeed/2026/1/28/what-we-know-about-plane-crash-that-killed-ajit-pawar?traffic_source=rss",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.789,
      "consensus": 0.591,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.675,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "While this story raises awareness about a tragic event, it does not provide any insights into the causes, potential solutions for preventing similar incidents, or the broader implications of the event.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Ajit Pawar, the deputy chief minister of Maharashtra State, died in a charter jet crash while landing. Authorities in India are investigating the cause of the accident.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Fire at French Alps Hotel Prompts Evacuation of Nearly 300 People",
    "domain": "general",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Wed, 28 Jan 2026 15:56:07 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Reuters"
    ],
    "domains": [
      "aljazeera.com",
      "news.google.com"
    ],
    "snippets": [
      "A fire tore through a luxury hotel in Courchevel in the French Alps, forcing the evacuation of nearly 300 people.",
      "Fire hits luxury hotel in French Alps, no injuries but scores evacuated Reuters"
    ],
    "image_url": "",
    "titles": [
      "Nearly 300 evacuated as luxury hotel in French Alps burns",
      "Fire hits luxury hotel in French Alps, no injuries but scores evacuated - Reuters"
    ],
    "url": "https://www.aljazeera.com/video/newsfeed/2026/1/28/nearly-300-evacuated-as-luxury-hotel-in-french-alps-burns?traffic_source=rss",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMimAFBVV95cUxONl9ZcGQyWHFIbnJvMFlLM2tHNnVTZlk1cGZjczRWbWJYaVlCV3VmODZJcS1JRFIwVW82UVBQVXYwNWh5V0FSQjk5S09PQlFyQncwcWYxbTRGOWdORlliaVhXYVk3elJyTTB6VVVoUldqbUNMMEN3Mk01N1JVbmFYcExuUmcwUlMyLWhEZzEydGl6aFAtSVdQdQ?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/video/newsfeed/2026/1/28/nearly-300-evacuated-as-luxury-hotel-in-french-alps-burns?traffic_source=rss",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.844,
      "consensus": 0.591,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.672,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story raises awareness about a disaster, but doesn't provide any actionable insights, solutions, or deeper understanding about the cause or impact.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt_short",
    "summary_reason": "too_short",
    "headline_source": "gpt",
    "summary": "A fire broke out at a luxury hotel in Courchevel in the French Alps, leading to the evacuation of nearly 300 people. No injuries were reported.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "NASA Launches NURTURE Mission to Study Severe Winter Storms",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Wed, 28 Jan 2026 14:35:27 EST",
    "source": "Phys.org",
    "sources": [
      "Phys.org",
      "NASA"
    ],
    "domains": [
      "phys.org",
      "nasa.gov"
    ],
    "snippets": [
      "A team of NASA scientists deployed on an international mission designed to better understand severe winter storms. The North American Upstream Feature-Resolving and Tropopause Uncertainty Reconnaissance Experiment, or NURTURE, is an airborne campaign that uses a suite of remote sensing instruments t"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2026/nasa-science-flights-v.jpg",
    "titles": [
      "NASA science flights venture to improve severe winter weather warnings",
      "NASA Science Flights Venture to Improve Severe Winter Weather Warnings"
    ],
    "url": "https://phys.org/news/2026-01-nasa-science-flights-venture-severe.html",
    "alternate_urls": [
      "https://www.nasa.gov/missions/airborne-science/nasa-science-flights-venture-to-improve-severe-winter-weather-warnings/"
    ],
    "location_scope": "global",
    "link": "https://phys.org/news/2026-01-nasa-science-flights-venture-severe.html",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.934,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.669,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "keywords (1): improve; speculative_penalty=0.03 (tokens: warning); semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "NASA scientists have launched the NURTURE airborne mission to study severe winter storms. The international campaign uses advanced remote sensing instruments to collect data and improve understanding of storm formation and behavior.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "James Webb Telescope Confirms Bright Galaxy From Early Universe",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Wed, 28 Jan 2026 13:20:01 EST",
    "source": "Phys.org",
    "sources": [
      "Phys.org",
      "NASA"
    ],
    "domains": [
      "phys.org",
      "science.nasa.gov"
    ],
    "snippets": [
      "The NASA/ESA/CSA James Webb Space Telescope has topped itself once again, delivering on its promise to push the boundaries of the observable universe closer to cosmic dawn with the confirmation of a bright galaxy that existed 280 million years after the Big Bang.",
      "NASA’s James Webb Space Telescope has topped itself once again, delivering on its promise to push the boundaries of the observable universe closer to cosmic dawn with the confirmation of a bright galaxy that existed 280 million years after the big bang. By now Webb has established that it will event"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2026/webb-pushes-boundaries.jpg",
    "titles": [
      "Webb pushes boundaries of observable universe closer to Big Bang",
      "NASA Webb Pushes Boundaries of Observable Universe Closer to Big Bang"
    ],
    "url": "https://phys.org/news/2026-01-webb-boundaries-universe-closer-big.html",
    "alternate_urls": [
      "https://science.nasa.gov/missions/webb/nasa-webb-pushes-boundaries-of-observable-universe-closer-to-big-bang/"
    ],
    "location_scope": "global",
    "link": "https://phys.org/news/2026-01-webb-boundaries-universe-closer-big.html",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.902,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.659,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The James Webb Space Telescope has confirmed the existence of a bright galaxy that formed 280 million years after the Big Bang, advancing observations of the early universe.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Astronomers Find Earliest Known Galaxy Cluster Formation",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Wed, 28 Jan 2026 12:48:39 EST",
    "source": "Phys.org",
    "sources": [
      "Phys.org",
      "NASA"
    ],
    "domains": [
      "phys.org",
      "nasa.gov"
    ],
    "snippets": [
      "Astronomers at The University of Manchester have played a leading role in the discovery of a new cosmic object that is much larger than anything astronomers have seen before in the distant universe. This new discovery captures the cosmic moment when a galaxy cluster—among the largest structures in t",
      "A new discovery captures the cosmic moment when a galaxy cluster – among the largest structures in the universe – started to assemble only about a billion years after the big bang, one or two billion years earlier than previously thought. This result, made using NASA’s Chandra X-ray Observatory and"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2026/nasa-telescopes-spot-s.jpg",
    "titles": [
      "NASA telescopes spot surprisingly mature cluster in the early universe",
      "NASA Telescopes Spot Surprisingly Mature Cluster in Early Universe"
    ],
    "url": "https://phys.org/news/2026-01-nasa-telescopes-mature-cluster-early.html",
    "alternate_urls": [
      "https://www.nasa.gov/missions/chandra/nasa-telescopes-spot-surprisingly-mature-cluster-in-early-universe/"
    ],
    "location_scope": "global",
    "link": "https://phys.org/news/2026-01-nasa-telescopes-mature-cluster-early.html",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.889,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.655,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Astronomers using NASA’s Chandra X-ray Observatory and other tools have discovered a galaxy cluster that began forming about a billion years after the big bang, one to two billion years earlier than previously believed. The finding provides new insight into the early formation of large cosmic structures.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Iran says it did not request negotiations with US - Reuters",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Wed, 28 Jan 2026 09:01:07 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "Al Arabiya"
    ],
    "domains": [
      "news.google.com"
    ],
    "snippets": [
      "Iran says it did not request negotiations with US Reuters",
      "Iran says it didn’t request negotiations with US, foreign minister says Al Arabiya English"
    ],
    "image_url": "",
    "titles": [
      "Iran says it did not request negotiations with US - Reuters",
      "Iran says it didn’t request negotiations with US, foreign minister says - Al Arabiya English"
    ],
    "url": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxNek5KWkV6Tm5UblVudjJYRVFONmJPRFQ3amw0WUtqXzJYa2J3Q21VVUFxWUJxYTQxUEtodTJMMk40bF9TMHhidFYzeWZGdmlBOXkyX2xjRlZIaE9xS2NWSEd3bWhIdDREX1Z1a0tPcVJlMGMzYmJ1cTRMWWRlQk9CWXNIdzNYejhHM0x3REVnZjNUSDV6bXZlb09BS282dmROSGRUeTlKU2FRMzdIRU9SM3E2VkJHVWQ2ejJFUVpTeFQ?oc=5",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMizgFBVV95cUxNelJTQ0Y4OThiVkxnZURyVDU4NzcyUmQwbHBpXzB6WGhTc3Q2WFpwNllrY3ViNGpPaURfd014S0xZMzhiODRpUDBxcTJwTlFQU0FGbkMwQUtTVHNWMmthWlBhR25TcmpOZHNoUk9MdHd2ZzVPUDhOU3EtZlFvM25wQThYLWxjWVpVcUtvZFR2dlJNdS0tOUNBd19KTXVpM2Z0UEZXNDM5QUVfZzF0V1NkYklIVXpJNTdjOG5URW5QaDJpZzluMkw5QXdUSWdBUdIBzgFBVV95cUxNelJTQ0Y4OThiVkxnZURyVDU4NzcyUmQwbHBpXzB6WGhTc3Q2WFpwNllrY3ViNGpPaURfd014S0xZMzhiODRpUDBxcTJwTlFQU0FGbkMwQUtTVHNWMmthWlBhR25TcmpOZHNoUk9MdHd2ZzVPUDhOU3EtZlFvM25wQThYLWxjWVpVcUtvZFR2dlJNdS0tOUNBd19KTXVpM2Z0UEZXNDM5QUVfZzF0V1NkYklIVXpJNTdjOG5URW5QaDJpZzluMkw5QXdUSWdBUQ?oc=5"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMiwAFBVV95cUxNek5KWkV6Tm5UblVudjJYRVFONmJPRFQ3amw0WUtqXzJYa2J3Q21VVUFxWUJxYTQxUEtodTJMMk40bF9TMHhidFYzeWZGdmlBOXkyX2xjRlZIaE9xS2NWSEd3bWhIdDREX1Z1a0tPcVJlMGMzYmJ1cTRMWWRlQk9CWXNIdzNYejhHM0x3REVnZjNUSDV6bXZlb09BS282dmROSGRUeTlKU2FRMzdIRU9SM3E2VkJHVWQ2ejJFUVpTeFQ?oc=5",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.696,
      "consensus": 0.571,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.644,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about the current state of negotiations between Iran and the US. However, it lacks depth and doesn't provide actionable insights or report on attempts to solve the problem.",
    "constructiveness_source": "gpt",
    "summary_source": "skipped",
    "summary_reason": "skipped_due_to_budget",
    "headline_source": "",
    "summary": "",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Chandra, Webb Catch Twinkling Lights",
    "domain": "science",
    "source_domain": "nasa.gov",
    "location": "global",
    "published": "Wed, 28 Jan 2026 16:27 GMT",
    "source": "NASA EO",
    "sources": [
      "NASA EO",
      "NASA"
    ],
    "domains": [
      "nasa.gov"
    ],
    "snippets": [
      "This stellar landscape is reminiscent of a winter vista in a view from NASA’s James Webb Space Telescope (red, green, and blue). Chandra data (red, green and blue) punctuate the scene with bursts of colored lights representing high-energy activity from the active stars.",
      "Data from Chandra adds red, green, and blue twinkling lights in this Dec. 22, 2025, image of Pismis 24 from NASA’s James Webb Space Telescope. Pismis 24 is a young cluster of stars in the core of the nearby Lobster Nebula, approximately 5,500 light-years from Earth in the constellation Scorpius. Hom"
    ],
    "image_url": "https://www.nasa.gov/wp-content/uploads/2026/01/55001995170-87ea2dfa0b-otw.jpg",
    "titles": [
      "Chandra, Webb Catch Twinkling Lights"
    ],
    "url": "https://www.nasa.gov/image-detail/55001995170-87ea2dfa0b-otw/",
    "alternate_urls": [
      "https://www.nasa.gov/image-article/chandra-webb-catch-twinkling-lights/"
    ],
    "location_scope": "global",
    "link": "https://www.nasa.gov/image-detail/55001995170-87ea2dfa0b-otw/",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.856,
      "consensus": 0.571,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.641,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0 (<6 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "skipped",
    "summary_reason": "skipped_due_to_budget",
    "headline_source": "",
    "summary": "",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Iran executes man accused of spying for Israel - Reuters",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Wed, 28 Jan 2026 07:14:00 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "Al Arabiya"
    ],
    "domains": [
      "news.google.com"
    ],
    "snippets": [
      "Iran executes man accused of spying for Israel Reuters",
      "Iran executes man accused of spying for Israel Al Arabiya English"
    ],
    "image_url": "",
    "titles": [
      "Iran executes man accused of spying for Israel - Reuters",
      "Iran executes man accused of spying for Israel - Al Arabiya English"
    ],
    "url": "https://news.google.com/rss/articles/CBMimAFBVV95cUxOdG5SY1dNT211TGVsZXRuN2o4X0M2dEsyVDdRSVUxZ2Jxd2txZ1hQY2V2b2NPSlFEMFIzQWU0ZExlMF9kZXB1VG1XT3lsSmJyWl9ydUNNSU5hQVVucms1T21qa2o2TlNhNU0wWlBSR1E4anhjakMwdm5oekI3UjdSR0R3TTY3LVVWM3hKSTZwQ04tZ0JUTUFjbg?oc=5",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiqAFBVV95cUxPX0w0bElsdTAteVZEWWo1UGZ2WnhfZ0VDaXZLbVVpRVRDajUwLUJ5SEVLcGVEeVFRZndoUkJKelY4bFljTVJiSkIzVDFRWGRfY0U4ZmNCSmVSaWFSdHFjSG5SS0gwbkVmOXlVMnRqOVdJVlV5Q1RCWUJBUFZXR3Q0RmxRbmRScmhwOHhidUhFVjNoMXZDZDdTc2Rkc08xMUZSbWJPWDlqdDHSAa4BQVVfeXFMUE1yZHA4VldWc21rYlFoMTVqVXkzdnpWT01SUjQ3RVBtZnVBQnZiS3VlR0UxTklELTRQcUlYWVFxUUxOcS1qQkJBTnY2OVNQTXVBc2xpMUgtNEZ1bmZiODB4YjNZOGtoclpJeUQ1NmVuclJUdml2ZW5rWkw2YU51ek9XRm9uSUdRZWRlOUhtUng5QUJhbzdKYXFuWTRtcmw5WEE1ZV9Zdk9VbS1Xbkp3?oc=5"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMimAFBVV95cUxOdG5SY1dNT211TGVsZXRuN2o4X0M2dEsyVDdRSVUxZ2Jxd2txZ1hQY2V2b2NPSlFEMFIzQWU0ZExlMF9kZXB1VG1XT3lsSmJyWl9ydUNNSU5hQVVucms1T21qa2o2TlNhNU0wWlBSR1E4anhjakMwdm5oekI3UjdSR0R3TTY3LVVWM3hKSTZwQ04tZ0JUTUFjbg?oc=5",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.662,
      "consensus": 0.571,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.619,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers basic awareness about a geopolitical event but does not provide any actionable insights, solutions, or deeper understanding of the context or implications.",
    "constructiveness_source": "gpt",
    "summary_source": "skipped",
    "summary_reason": "skipped_due_to_budget",
    "headline_source": "",
    "summary": "",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Neil Young gifts Greenland free access to music catalogue",
    "domain": "general",
    "source_domain": "cbc.ca",
    "location": "national",
    "published": "Tue, 27 Jan 2026 15:56:53 EST",
    "source": "CBC News",
    "sources": [
      "CBC News",
      "Associated Press"
    ],
    "domains": [
      "cbc.ca",
      "news.google.com"
    ],
    "snippets": [
      "Neil Young announced Tuesday on his blog that he is providing free access to his entire music catalogue to residents of Denmark's semiautonomous territory, whose futures have lately become a point of tension between the U.S. and NATO.",
      "Neil Young’s gift to Greenland: Free access to his entire music catalog AP News"
    ],
    "image_url": "",
    "titles": [
      "Neil Young gifts Greenland free access to music catalogue",
      "Neil Young’s gift to Greenland: Free access to his entire music catalog - AP News"
    ],
    "url": "https://www.cbc.ca/news/entertainment/neil-young-catalogue-greenland-9.7063641?cmp=rss",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMikAFBVV95cUxQMUhJcUdsOTlmOTMzREVYVWdoclhJTWg0QVNtWUZPbXc3VUJkT2tBVldxb1JTMW05dDJyenRGRm9FaURwaGFUZkVfWUpsNFRKMUtKSVJTVGsya1FKZENrZUhTYWlLWkdTa3NEclFLLTVCT1NySWx5c1dwY1NWOUgzMEhYMzJBN3p6ZDF2dkF2OEg?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.cbc.ca/news/entertainment/neil-young-catalogue-greenland-9.7063641?cmp=rss",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.498,
      "consensus": 0.591,
      "constructiveness": 0.3,
      "proximity": 1.0
    },
    "score": 0.618,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about Neil Young's gesture towards Greenland. However, it doesn't provide deeper understanding or actionable insights, and it doesn't report on solutions, improvements, or innovations.",
    "constructiveness_source": "gpt",
    "summary_source": "skipped",
    "summary_reason": "skipped_due_to_budget",
    "headline_source": "",
    "summary": "",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Doomsday Clock Ticks Closer Than Ever to Apocalypse",
    "domain": "science",
    "source_domain": "nytimes.com",
    "location": "global",
    "published": "Wed, 28 Jan 2026 11:57:41 +0000",
    "source": "New York Times",
    "sources": [
      "New York Times",
      "Associated Press"
    ],
    "domains": [
      "nytimes.com",
      "news.google.com"
    ],
    "snippets": [
      "Wars, climate change, disruptive technologies and the rise of autocracy over the past year prompted scientists to set the clock at 85 seconds to midnight.",
      "'Doomsday Clock' moves closer to midnight over threats from nuclear weapons, climate change and AI AP News"
    ],
    "image_url": "https://static01.nyt.com/images/2026/01/28/multimedia/28xp-doomsday-gwtb/28xp-doomsday-gwtb-mediumSquareAt3X.jpg",
    "titles": [
      "Doomsday Clock Ticks Closer Than Ever to Apocalypse",
      "'Doomsday Clock' moves closer to midnight over threats from nuclear weapons, climate change and AI - AP News"
    ],
    "url": "https://www.nytimes.com/2026/01/28/us/doomsday-clock-2026.html",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMirAFBVV95cUxPMUMwMW81Z1IxbmFack56TFZLXzk1Vm5tdWlGMGUxY0c1dlFVUXpmc25sUXJNZENhdFBSQmw4R1dsMGhtU0NYbTR0R1lybUlTVENWTGN5UGJRRVpYRGdUNFZKMjBnNk95VlVvdGtsc010WG50aF8zZkEtelk5V1Q1eGgzRjFSX1kyZUhQX09FbjE2ZnJaSGhwTDRzTlRSY2Nlam5iY1F2Y2pDOFNM?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.nytimes.com/2026/01/28/us/doomsday-clock-2026.html",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.755,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.615,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "skipped",
    "summary_reason": "skipped_due_to_budget",
    "headline_source": "",
    "summary": "",
    "is_trending": false,
    "trending_score": 0.0
  }
]