[
  {
    "title": "Beltrán Jones and Kent Elected to Baseball Hall of Fame Class of",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Wed, 21 Jan 2026 01:13:37 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports",
      "Yahoo Sports",
      "Forbes",
      "Sportsnet"
    ],
    "domains": [
      "espn.com",
      "cbssports.com",
      "sports.yahoo.com",
      "forbes.com",
      "sportsnet.ca"
    ],
    "snippets": [
      "The results are in! Our experts break down the highs and lows of the 2026 vote and look ahead to 2027.",
      "What can we learn from the 2026 ballots? Let's dig in",
      "The center fielders will join Jeff Kent in Cooperstown this summer",
      "Carlos Beltran and Andruw Jones are heading to Cooperstown. What else did we learn from the 2026 voting?",
      "Carlos Beltran and Andruw Jones, center fielders who excelled at the plate and with their gloves, were voted into the Baseball Hall of Fame.",
      "Out of slim cast of characters on the ballot, Carlos Beltran and Andruw Jones were the only players to survive joining the Hall Class of 2026.",
      "Carlos Beltran and Andruw Jones, elected to Cooperstown together, were multiple Gold Glove winners in center field.",
      "The Baseball Hall of Fame has added two new members to its ranks.",
      "Ranking this year’s HoF class and looking ahead to next year’s ballot; Bellinger expected to sign soon; Salary cap looms",
      "Forever Giant. For 44 games.",
      "Will Carlos Beltrán don a Mets cap on his Cooperstown plaque?",
      "Beltrán and Jones were center fielders who excelled at the plate and with their gloves.",
      "Mets legend Carlos Beltran was asked which cap he will have on his plaque when he's inducted into the Baseball Hall of Fame this summer, and said it's a choice between two teams.",
      "Carlos Beltran and Andruw Jones have been voted into the Baseball Hall of Fame by the BBWAA",
      "The former outfielders will join Jeff Kent in this year’s induction class",
      "The beloved former Mets third baseman wished Beltrán a “huge, huge congratulations” in a video posted by SNY.",
      "A pair of former Yankees outfielders are heading to Cooperstown.",
      "Carlos Beltrán and Andruw Jones were elected to the Baseball Hall of Fame on Tuesday night the old-fashioned way.",
      "Outfielders Carlos Beltrán and Andruw Jones were elected to the National Baseball Hall of Fame, in results announced by the Baseball Writers Association of America on Tuesday afternoon. Beltrán and Jones will be inducted to the Hall of Fame in Cooperstown on Sunday, July 26 along with second baseman",
      "Alex Gordon receives one vote.",
      "The former Met earned 84.2% of the vote on his fourth year on the ballot.",
      "Overall, three players will be inducted this summer in Cooperstown.",
      "Carlos Beltran will be recognized this summer for one Hall of a career.",
      "Andruw Jones is the latest legend from those ‘90s Braves team to earn a spot in Cooperstown",
      "With no obvious first-ballot Hall of Famers up for a vote, two outfielders reached Cooperstown after a combined 13 years of waiting.",
      "Carlos Beltran, one of the best players in Mets history, has been elected to the National Baseball Hall of Fame.",
      "Beltrán and Jones will join Jeff Kent in the National Baseball Hall of Fame Class of 2026.",
      "﻿Former White Sox ace Mark Buehrle gains traction as Hall of Fame debate evolves"
    ],
    "image_url": "",
    "titles": [
      "Baseball Hall of Fame voting winners, losers and who could get in next",
      "Winners and losers of Baseball Hall of Fame voting: Good news for Chase Utley and Jose Altuve, Manny falls off",
      "Baseball Hall of Fame voting results: Carlos Beltrán, Andruw Jones elected into the class of 2026",
      "Baseball Hall of Fame 2026 winners and losers: The curious case of Andy Pettitte",
      "Beltran, A. Jones elected to Baseball Hall of Fame",
      "Carlos Beltran. Andruw Jones Latest Additions To Baseball Hall Of Fame",
      "Carlos Beltran And Andruw Jones Elected To Baseball Hall Of Fame",
      "Carlos Beltran, Andruw Jones inducted into Baseball Hall of Fame",
      "Around the Empire: Yankees outfielders Beltrán, Jones elected to Hall of Fame",
      "Giants legend Carlos Beltrán elected to Hall of Fame",
      "Carlos Beltran explains why a Mets cap on his Hall of Fame plaque is not a given",
      "Carlos Beltrán and Andruw Jones elected to baseball’s Hall of Fame",
      "Carlos Beltran: Mets hold ‘a lot of weight’ on upcoming Hall of Fame cap decision",
      "Beltran, Jones elected to HOF",
      "Carlos Beltrán, Andruw Jones elected to Baseball Hall of Fame",
      "David Wright congratulates Carlos Beltran on getting elected to Baseball Hall of Fame",
      "Former Yankees Carlos Beltrán, Andruw Jones elected to Hall of Fame",
      "Carlos Beltrán and Andruw Jones – born one day apart – kick open Hall of Fame doors",
      "Carlos Beltrán, Andruw Jones elected to 2026 Hall of Fame class",
      "Former Royals outfielder Carlos Beltrán elected to Hall of Fame with Andruw Jones",
      "Carlos Beltrán elected to Baseball Hall of Fame",
      "Carlos Beltrán, Andruw Jones elected to the Hall of Fame",
      "Carlos Beltran will enter Baseball Hall of Fame alongside Andruw Jones",
      "Atlanta Braves legend Andruw Jones elected to Baseball Hall of Fame for class of 2026",
      "Carlos Beltrán, Andruw Jones elected to Hall of Fame; Alex Rodriguez falls well short",
      "Mets great Carlos Beltran elected to MLB Hall of Fame",
      "Baseball Hall of Fame reactions: Carlos Beltrán shares his Hall call, Chipper Jones calls Andruw Jones the best OF 'ever'",
      "Cooperstown calls: Carlos Beltrán, Andruw Jones and Jeff Kent lead Class of 2026"
    ],
    "url": "https://www.espn.com/mlb/story/_/id/47673705/mlb-baseball-hall-fame-2026-voting-beltran-jones-winners-losers",
    "alternate_urls": [
      "https://www.cbssports.com/mlb/news/baseball-hall-of-fame-voting-results-winners-losers-chase-utley-jose-altuve/",
      "https://www.cbssports.com/mlb/news/baseball-hall-of-fame-voting-results-carlos-beltran-andruw-jones-elected-into-the-class-of-2026/",
      "https://sports.yahoo.com/articles/baseball-hall-fame-2026-winners-012416197.html",
      "https://www.espn.com/mlb/story/_/id/47675537/carlos-beltran-andruw-jones-elected-baseball-hall-fame",
      "https://www.forbes.com/sites/barrymbloom/2026/01/21/carlos-beltran-andruw-jones-latest-additions-to-baseball-hall-of-fame/",
      "https://www.forbes.com/sites/danschlossberg/2026/01/20/carlos-beltran-and-andruw-jones-elected-to-baseball-hall-of-fame/",
      "https://sports.yahoo.com/articles/around-empire-yankees-outfielders-beltr-050000839.html",
      "https://sports.yahoo.com/articles/giants-legend-carlos-beltr-n-040932089.html",
      "https://sports.yahoo.com/articles/carlos-beltran-explains-why-mets-035411907.html",
      "https://sports.yahoo.com/articles/carlos-beltr-n-andruw-jones-030020375.html",
      "https://sports.yahoo.com/articles/carlos-beltran-mets-hold-lot-014042012.html",
      "https://sports.yahoo.com/articles/beltran-jones-elected-hof-010131389.html",
      "https://sports.yahoo.com/articles/carlos-beltra-n-andruw-jones-005213385.html",
      "https://sports.yahoo.com/articles/david-wright-congratulates-carlos-beltran-003256926.html",
      "https://sports.yahoo.com/articles/former-yankees-carlos-beltr-n-001821401.html",
      "https://sports.yahoo.com/articles/carlos-beltr-n-andruw-jones-233542066.html",
      "https://sports.yahoo.com/articles/carlos-beltr-n-andruw-jones-233251403.html",
      "https://sports.yahoo.com/articles/former-royals-outfielder-carlos-beltr-233156185.html",
      "https://sports.yahoo.com/articles/carlos-beltr-n-elected-baseball-233037467.html",
      "https://sports.yahoo.com/articles/carlos-beltr-n-andruw-jones-232516944.html",
      "https://sports.yahoo.com/articles/carlos-beltran-enter-baseball-hall-232319141.html",
      "https://sports.yahoo.com/articles/andruw-jones-elected-baseball-hall-232258865.html",
      "https://sports.yahoo.com/mlb/article/carlos-beltran-andruw-jones-elected-to-hall-of-fame-alex-rodriguez-falls-well-short-232254331.html",
      "https://sports.yahoo.com/articles/mets-great-carlos-beltran-elected-231904386.html",
      "https://sports.yahoo.com/mlb/breaking-news/article/baseball-hall-of-fame-reactions-carlos-beltran-shares-his-hall-call-chipper-jones-calls-andruw-jones-the-best-of-ever-010955550.html",
      "https://sports.yahoo.com/articles/cooperstown-calls-carlos-beltr-n-002902665.html"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/mlb/story/_/id/47673705/mlb-baseball-hall-fame-2026-voting-beltran-jones-winners-losers",
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.859,
      "consensus": 0.995,
      "constructiveness": 0.5,
      "proximity": 0.75
    },
    "score": 0.865,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness about recent developments in the Baseball Hall of Fame voting. However, it does not provide deeper insights or contribute meaningfully to the reader's understanding or decision-making.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Carlos Beltrán and Andruw Jones have been elected to the National Baseball Hall of Fame by the Baseball Writers Association of America. They will be inducted in Cooperstown on July 26, 2026, alongside Jeff Kent. Beltrán received 84.2% of the vote in his fourth year on the ballot. The Hall of Fame Class of 2026 includes three players.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Trump Resumes Davos Trip After Air Force One Electrical Issue",
    "domain": "politics",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Wed, 21 Jan 2026 04:09:48 -0500",
    "source": "ABC News",
    "sources": [
      "ABC News",
      "Al Jazeera",
      "BBC",
      "Reuters",
      "The Guardian",
      "Bloomberg",
      "Business Insider"
    ],
    "domains": [
      "abcnews.go.com",
      "aljazeera.com",
      "bbc.com",
      "news.google.com",
      "theguardian.com",
      "businessinsider.com"
    ],
    "snippets": [
      "Trump makes first international trip of 2026 to Davos, where he's expected to deliver remarks focused on American dominance, including taking over Greenland.",
      "US president resumed journey to Europe on Boeing 757 that departed just after midnight on Wednesday.",
      "Journalists travelling with the president said the lights went out briefly in the press cabin.",
      "Trump's plane lands safely after 'minor electrical issue,' Davos trip to continue Reuters",
      "US president boards another aircraft to continue trip to World Economic Forum in Davos, Switzerland The US president’s plane, Air Force One, has been forced to abort its flight to Switzerland and turn back after what officials described as a “minor electrical issue”. Donald Trump boarded another air",
      "Air Force One Electrical Issue Delays Start of Trump Davos Trip Bloomberg",
      "Rolling coverage of the World Economic Forum in Davos Nervous rex: the Davos elite brace for Trump and his dinosaur diplomacy Q: Is the US worried that institutional investors in Europe might pull out of the US Treasury market, such as pension funds in Denmark? Bessent brushes this aside, saying The",
      "Air Force One headed back to Joint Base Andrews after it ran into a \"minor electrical issue,\" per a White House pool report."
    ],
    "image_url": "https://s.abcnews.com/images/Politics/trump-air-force-one-2_1768968221631_hpMain_4x3t_384.jpg",
    "titles": [
      "Air Force turns around amid trip to Davos after 'minor electrical issue'",
      "Air Force One turned back as it carried Trump to Davos",
      "'Minor electrical issue' on Air Force One delays Trump Davos visit",
      "Trump's plane lands safely after 'minor electrical issue,' Davos trip to continue - Reuters",
      "Trump’s Air Force One turns back to Washington after ‘minor electrical issue’",
      "Air Force One Electrical Issue Delays Start of Trump Davos Trip - Bloomberg",
      "Davos live: Trump to address world leaders amid Greenland standoff after ‘minor electrical issue’ on Air Force One",
      "Donald Trump won't take Air Force One to Davos after an electrical issue forced a U-turn"
    ],
    "url": "https://abcnews.go.com/Politics/trump-speak-world-economic-forum-amid-feud-nato/story?id=129393695",
    "alternate_urls": [
      "https://www.aljazeera.com/news/2026/1/21/air-force-one-turned-back-as-it-carried-trump-to-davos?traffic_source=rss",
      "https://www.bbc.com/news/articles/c1507x8njzwo?at_medium=RSS&at_campaign=rss",
      "https://news.google.com/rss/articles/CBMitAFBVV95cUxOYUJkd2E2cmpDbE00N0VfSmFKV3lLdVltSkU3ZjVPaWpTTjNILXBqMzJaaGZCOFZBN05jTVNWZkpnMXBmbEpLN1ByMjFwUDUyZWg1R1J3b1JPUlNHM0tJcUtnWHBfVGtpbFBLbXBuQjZueUd1NV90SEZvWGgwVmFjc3JKYnFKNmotZ1hTeENBNUcwZ1RKN2Uxamh1MEhSc0NST3hjSXhGaVdXbmxhb0JUVGpnNEs?oc=5",
      "https://www.theguardian.com/us-news/2026/jan/21/trump-air-force-one-turns-back-washington-davos-minor-electrical-issue",
      "https://news.google.com/rss/articles/CBMirAFBVV95cUxQZ1dWZXh6LVRCUTdzZnlzZnBGUHhfeGpxSXY0SElTMDktTjJSWDdDS2E3MXdSQ1dOeVdMM0E5RVBMRmVlbHc4VWxCZk9oSV9PTElwckhzZXF5WVZSTkd3Y2t4bWNXWGpoWFhSOHBBdzZYVWFqMnBnZHlLNjhab2NoLTRYVld1LXBRNlB6UC1OSk9IaEN2V3NnTWxrQ3hPdk1fZWVUbVlMZmlGUUty?oc=5",
      "https://www.theguardian.com/business/live/2026/jan/21/davos-trump-speech-wef-greenland-bessent-trade-milei-globalisation-business-live-updates",
      "https://www.businessinsider.com/trump-plane-u-turn-delay-air-force-one-davos-2026-1"
    ],
    "location_scope": "national",
    "link": "https://abcnews.go.com/Politics/trump-speak-world-economic-forum-amid-feud-nato/story?id=129393695",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.932,
      "consensus": 1.0,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.86,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about an incident that occurred, but it doesn't offer any depth or insight into the situation, or provide actionable insights for the reader.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Donald Trump's flight to Davos for the World Economic Forum was delayed after Air Force One experienced a minor electrical issue and returned to Joint Base Andrews. Trump then boarded another aircraft and resumed his trip to Switzerland. The incident caused a brief interruption, but the journey continued as planned.",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "Abes Assassin Sentenced to Life in Prison by Japanese Court",
    "domain": "politics",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Wed, 21 Jan 2026 04:43:03 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Washington Post",
      "New York Times",
      "CBC News",
      "Bloomberg",
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "aljazeera.com",
      "washingtonpost.com",
      "nytimes.com",
      "cbc.ca",
      "news.google.com",
      "theguardian.com",
      "bbc.com"
    ],
    "snippets": [
      "Tetsuya Yamagami shot the Japanese politician dead in 2022.",
      "Tetsuya Yamagami pleaded guilty to shooting the former prime minister with a homemade gun in 2022, an act he tied to struggles with the Unification Church.",
      "Tetsuya Yamagami, 45, had admitted to shooting Mr. Abe, Japan’s longest-serving prime minister, with a homemade gun at a political rally in 2022.",
      "A Japanese court sentenced a man who admitted assassinating former Japanese prime minister Shinzo Abe to life imprisonment on Wednesday.",
      "Former Japan Prime Minister Abe’s Killer Sentenced to Life Bloomberg",
      "Abe was killed by Tetsuya Yamagami in 2022 while campaigning in the city of Nara, a shooting that shocked Japan, where gun crime is almost unheard of A court in Japan has sentenced the assassin of former prime minister Shinzo Abe to life in prison – a case that shocked the public and exposed politic",
      "Abe's assassination stunned the country where there is virtually no gun crime."
    ],
    "image_url": "",
    "titles": [
      "Ex-Japanese Prime Minister Abe’s killer sentenced to life",
      "Killer of Japanese leader Shinzo Abe sentenced to life in prison",
      "Man Gets Life in Prison for Killing Shinzo Abe, Former Leader of Japan",
      "Man who assassinated former Japanese PM Shinzo Abe gets life in prison",
      "Former Japan Prime Minister Abe’s Killer Sentenced to Life - Bloomberg",
      "Shinzo Abe’s killer sentenced to life in prison over shooting of Japanese former PM",
      "Life sentence for man who killed Japan's ex-PM Shinzo Abe"
    ],
    "url": "https://www.aljazeera.com/news/2026/1/21/ex-japanese-prime-minister-abes-killer-sentenced-to-life?traffic_source=rss",
    "alternate_urls": [
      "https://www.washingtonpost.com/world/2026/01/21/japan-shinzo-abe-assassination-verdict/",
      "https://www.nytimes.com/2026/01/20/world/asia/japan-shinzo-abe-killer-verdict.html",
      "https://www.cbc.ca/news/world/shinzo-abe-shooting-death-trial-9.7054161?cmp=rss",
      "https://news.google.com/rss/articles/CBMiswFBVV95cUxNazEydTNlck5XVFRyQ0pCcnVmZFpYSXJFWXVIRVB1eDR2NXdJUkR5aXV1TzRQcG9nNDk0d0NmR1U0WVY3YXZFbFdYNjlwSUNIWXEzTUl6TmFZU0N1T25tdXBOSlA1dkZRZC1JQTVYdURNMVliUTZqVHJFNm5Ea0ViLTlubkdiVF9mUVJ1cEdHS2szRGV6OUdYblItOENwOGtXRnA5NjlLcW1IRURXNWMtUWRYQQ?oc=5",
      "https://www.theguardian.com/world/2026/jan/21/tetsuya-yamagami-assassinated-shinzo-abe-japan-life-sentence",
      "https://www.bbc.com/news/articles/c86v5lj39zpo?at_medium=RSS&at_campaign=rss"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2026/1/21/ex-japanese-prime-minister-abes-killer-sentenced-to-life?traffic_source=rss",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.824,
      "consensus": 1.0,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.847,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story provides basic awareness about the sentencing of a criminal, but it does not provide deeper understanding about the case, the legal system, or the implications of the sentencing.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "A Japanese court sentenced Tetsuya Yamagami to life in prison for the assassination of former prime minister Shinzo Abe in 2022. Yamagami admitted to shooting Abe with a homemade gun during a political rally in Nara, an event that shocked Japan due to its rarity of gun violence.",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "Netanyahu Accepts Invitation to Join Trumps Board of Peace",
    "domain": "politics",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Wed, 21 Jan 2026 09:14:47 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "NPR",
      "Reuters",
      "Al Arabiya"
    ],
    "domains": [
      "aljazeera.com",
      "npr.org",
      "news.google.com"
    ],
    "snippets": [
      "Artillery fire, gunship attack, demolitions in war-battered Gaza as PM Netanyahu accepts US 'peace board' position.",
      "Netanyahu's participation, despite an ICC warrant, will add to concerns over the objectivity of the board.",
      "Prime Minister Benjamin Netanyahu of Israel said Wednesday he had agreed to join U.S. President Donald Trump's Board of Peace, after his office earlier criticized makeup of the board.",
      "Israel's Netanyahu accepts invitation to join Trump's Board of Peace Reuters",
      "Israeli PM Netanyahu accept invite to join Trump’s Board of Peace Al Arabiya English"
    ],
    "image_url": "",
    "titles": [
      "Live: Israel launches strikes as Netanyahu joins Gaza ‘board of peace’",
      "Israel’s wanted war criminal Netanyahu joins Gaza ‘board of peace’",
      "Israel's Netanyahu agrees to join Trump's Board of Peace",
      "Israel's Netanyahu accepts invitation to join Trump's Board of Peace - Reuters",
      "Israeli PM Netanyahu accept invite to join Trump’s Board of Peace - Al Arabiya English"
    ],
    "url": "https://www.aljazeera.com/news/liveblog/2026/1/21/live-israel-launches-strikes-as-netanyahu-joins-gaza-board-of-peace?traffic_source=rss",
    "alternate_urls": [
      "https://www.aljazeera.com/news/2026/1/21/israels-netanyahu-to-join-board-of?traffic_source=rss",
      "https://www.npr.org/2026/01/21/g-s1-106641/netanyahu-join-trump-board-of-peace",
      "https://news.google.com/rss/articles/CBMitAFBVV95cUxPVTQzekd1Rk42YWtpMkppd0R1ei10X01IMUVmdmJJU3hQY1U0MnU1UW42OW9KSkREMTAtSFhVc0VwZDVWbGFwNHU3Qm16NnRIdUNQRUUzRWsyLUw2VEtDd05EdnBtNXBERnNBT2hLdUoxTDdydkVmMzFFSml2ajJiSHVCWUstWXNkeHZ3MkFiYzh0eV9qNUZid3R1Q1BTTUhkcWY1aWZmajNpQU9RTzlRN3NtTWo?oc=5",
      "https://news.google.com/rss/articles/CBMixwFBVV95cUxOSVVteEUyLTRpcmtOOGUycTVTaWtzcVlTRFloRWlRZ3pzQlBIWFJLWkpPUm5rcHJSWjczQ0Vibjk5ckN5X0dVSF80OHl6UUpQVnM1YzR6TnJhd0xvU0VIZTdVVkRybW80c1pyZ3NNeDVfNTkzblVxdmpYLWVxaFVlY1hZWTA3eUN6RWpVQXBvOVVfaG9hSm1aMlBxT2VROUpULUhXSWJjZlhGQXk0eF9kQ3piZnlzS2RhUGhZU3gzeVBHNW1Ka3dR0gHHAUFVX3lxTE5JVW14RTItNGlya044ZTJxNVNpa3NxWVNEWWhFaVFnenNCUEhYUktaSk9SbmtwclJaNzNDRWJuOTlyQ3lfR1VIXzQ4eXpRSlBWczVjNHpOcmF3TG9TRUhlN1VWRHJtbzRzWnJnc014NV81OTNuVXF2algtZXFoVWVjWFlZMDd5Q3pFalVBcG85VV9ob2FKbVoyUHFPZVE5SlQtSFdJYmNmWEZBeTR4X2RDemJmeXNLZGFQaFlTeDN5UEc1bUprd1E?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/liveblog/2026/1/21/live-israel-launches-strikes-as-netanyahu-joins-gaza-board-of-peace?traffic_source=rss",
    "score_components": {
      "magnitude": 0.932,
      "recency": 0.934,
      "consensus": 0.888,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.847,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs about a current event and provides some context about the ongoing conflict. However, it doesn't provide enough information about the causes, impacts, or potential solutions to the conflict.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Israeli Prime Minister Benjamin Netanyahu has accepted an invitation to join Donald Trump's Board of Peace. The announcement comes amid ongoing conflict in Gaza and international scrutiny over Netanyahu's actions.",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "Tensions Rise as Trump Pressures Europe Over Greenland at Davos",
    "domain": "politics",
    "source_domain": "washingtonpost.com",
    "location": "global",
    "published": "Wed, 21 Jan 2026 09:31:49 +0000",
    "source": "Washington Post",
    "sources": [
      "Washington Post",
      "New York Times",
      "The Guardian"
    ],
    "domains": [
      "washingtonpost.com",
      "nytimes.com",
      "theguardian.com"
    ],
    "snippets": [
      "The surreal clamor over Greenland provoked by Trump has shadowed proceedings in Davos, heightening fears of an emerging rupture between the U.S. and Europe.",
      "President Trump threatened tariffs on European nations that sent military personnel to Greenland last week. Some have already gone home, but Denmark is now sending about 100 more.",
      "Annex attempt could bring about Uefa-led boycott Implications for World Cup alarming heads of FAs European football leaders are increasingly concerned about Donald Trump’s wish to annex Greenland, and they have held initial discussions about how the sport could respond. The Guardian understands the",
      "President Donald Trump’s ultimatum — give up Greenland or face a trade war — has convinced some European officials that retaliation, rather than conciliation, is the answer.",
      "President Trump’s bellicose demands about Greenland and participation in his “board of peace” are deepening worries about the fate of the trans-Atlantic alliance."
    ],
    "image_url": "",
    "titles": [
      "At Davos, a European backlash to Trump",
      "A Few Dozen European Troops in Greenland Set Off Trump",
      "Concerned European football chiefs discuss response to Trump over Greenland",
      "Trump’s Greenland crusade pushes European allies to a breaking point",
      "Trump Escalates Tensions With European Allies With Greenland and Gaza Efforts"
    ],
    "url": "https://www.washingtonpost.com/world/2026/01/20/davos-trump-greenland-europe/",
    "alternate_urls": [
      "https://www.nytimes.com/2026/01/20/world/europe/europe-troops-greenland-trump.html",
      "https://www.theguardian.com/football/2026/jan/20/concerned-european-football-chiefs-discuss-response-to-donald-trump-over-greenland",
      "https://www.washingtonpost.com/world/2026/01/21/trump-greenland-europe-allies-nato/",
      "https://www.nytimes.com/2026/01/20/us/politics/trump-europe-tensions-greenland.html"
    ],
    "location_scope": "global",
    "link": "https://www.washingtonpost.com/world/2026/01/20/davos-trump-greenland-europe/",
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.941,
      "consensus": 0.789,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.804,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful context about global political dynamics, but it does not offer actionable insights or report on solutions or improvements.",
    "constructiveness_source": "gpt",
    "summary_source": "snippet",
    "summary_reason": "invalid_roles",
    "headline_source": "gpt",
    "summary": "The surreal clamor over Greenland provoked by Trump has shadowed proceedings in Davos, heightening fears of an emerging rupture between the U.S. and Europe.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Raducanu Exits Australian Open as Alcaraz",
    "domain": "sports",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Wed, 21 Jan 2026 08:02:30 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Sky Sports",
      "Sportsnet",
      "BBC",
      "BBC Sport"
    ],
    "domains": [
      "aljazeera.com",
      "skysports.com",
      "sportsnet.ca",
      "bbc.com"
    ],
    "snippets": [
      "Top-ranked Carlos Alcaraz and Aryna Sabalenka win in straight sets in third round action at Melbourne Park.",
      "Zeynep Sonmez wins in straight sets to enter the third round of a Grand Slam for the second time in six months.",
      "Emma Raducanu's Australian Open ended in the second round with an error-strewn loss to Anastasia Potapova.",
      "Victoria Mboko of Toronto punched her ticket to the third round of women’s single at the Australian Open on Wednesday in Melbourne with a 6-4, 6-3 win over American Caty McNally.",
      "Top-seeded Aryna Sabalenka defeated a tenacious Bai Zhouxuan of China 6-3, 6-1 Wednesday to reach the third round of the Australian Open.",
      "Britain's Emma Raducanu is below-par in an Australian Open second-round defeat by Austria's Anastasia Potapova.",
      "Emma Raducanu says she is ready to re-evaluate her game after her Australian Open second-round exit to Anastasia Potapova on Wednesday.",
      "British number one Emma Raducanu is knocked out of the Australian Open in straight sets 7-6 (7-3) 6-2 by Austria's Anastasia Potapova in the second round."
    ],
    "image_url": "",
    "titles": [
      "Alcaraz, Sabalenka cruise into Australian Open third round",
      "Turkiye’s Sonmez storms into Australian Open 2026 third round",
      "Raducanu knocked out of Australian Open in second round",
      "Victoria Mboko advances to third round at Australian Open",
      "Aryna Sabalenka, Coco Gauff reach third round at Australian Open",
      "Out-of-sorts Raducanu beaten at Australian Open",
      "Raducanu to re-evaluate after early Australia Open exit: 'She looked lost'",
      "Raducanu knocked out of Australian Open by Potopova"
    ],
    "url": "https://www.aljazeera.com/sports/2026/1/21/alcaraz-sabalenka-gauff-cruise-into-australian-open-third-round?traffic_source=rss",
    "alternate_urls": [
      "https://www.aljazeera.com/sports/2026/1/21/turkiyes-sonmez-storms-into-australian-open-2026-third-round?traffic_source=rss",
      "https://www.skysports.com/tennis/news/12040/13496929/emma-raducanu-lacking-intensity-and-energy-in-australian-open-exit-to-anastasia-potapova",
      "https://www.bbc.com/sport/tennis/articles/c620l640jz2o?at_medium=RSS&at_campaign=rss",
      "https://www.skysports.com/tennis/news/12040/13496935/australian-open-emma-raducanu-ready-to-re-evaluate-her-game-after-second-round-exit-she-looked-lost",
      "https://www.bbc.com/sport/tennis/videos/c1dkz20xq9eo?at_medium=RSS&at_campaign=rss"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/sports/2026/1/21/alcaraz-sabalenka-gauff-cruise-into-australian-open-third-round?traffic_source=rss",
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.903,
      "consensus": 0.975,
      "constructiveness": 0.019,
      "proximity": 0.5
    },
    "score": 0.801,
    "constructiveness_score": 0.019,
    "constructiveness_reason": "semantic: pos_sim=0.08, neg_sim=0.00; semantic_boost=0.02; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Emma Raducanu was eliminated from the Australian Open in the second round after losing in straight sets to Anastasia Potapova. Meanwhile, Carlos Alcaraz, Aryna Sabalenka, Zeynep Sonmez, and Victoria Mboko advanced to the third round with straight-set victories.",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "U.S. Military Seizes Seventh Venezuela Linked Oil Tanker in Caribbean",
    "domain": "general",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Wed, 21 Jan 2026 01:10:08 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Reuters",
      "Al Arabiya",
      "CBC News",
      "Globe and Mail"
    ],
    "domains": [
      "aljazeera.com",
      "news.google.com",
      "cbc.ca"
    ],
    "snippets": [
      "US has moved to assert strict control over production and sale of Venezuelan oil since attacking the country this month.",
      "US military seizes another Venezuela-linked tanker in the Caribbean Reuters",
      "US says it seized another tanker in the Caribbean Al Arabiya English",
      "U.S. military forces boarded and took control of a seventh oil tanker connected with Venezuela on Tuesday as the Trump administration continues its efforts to take control of the oil in the South American country.",
      "U.S. military seizes seventh sanctioned oil tanker linked to Venezuela The Globe and Mail"
    ],
    "image_url": "",
    "titles": [
      "US forces seize a seventh Venezuela-linked oil tanker",
      "US military seizes another Venezuela-linked tanker in the Caribbean - Reuters",
      "US says it seized another tanker in the Caribbean - Al Arabiya English",
      "U.S. says it has seized 7th Venezuela-linked oil tanker",
      "U.S. military seizes seventh sanctioned oil tanker linked to Venezuela - The Globe and Mail"
    ],
    "url": "https://www.aljazeera.com/news/2026/1/21/us-seizes-a-seventh-venezuela-linked-oil-tanker?traffic_source=rss",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMisAFBVV95cUxNeGVPel9iS3FDeVZ0c1dWRG1TWGRwRjN4Tzh4NFdfLXozSXJhZ0hjV1l1dkpZRkwzd0tjRGZaVWpBLVNadTAteWhKeGxROGgwaHUzeV94QlBCOVJpWVp1UVdWcXEtM3JqSDdTSGRGb0s1anE5ZTNoRlhLazFCSnBTbU5FZnZWN3hNOUQ5RC1lbFFEN3R6WWptVERoQ2JIY25zd0NLREhFNHdHcm1HMnhGYg?oc=5",
      "https://news.google.com/rss/articles/CBMirgFBVV95cUxQY2EwcWxWcVg3UUV1a0d5RnNINTZ3Q2g0azNvcjE1QmFkSC1rR0Fhb2x0ZzBTVmVlaG03dnpnNW5yWi1mdW5qSjdIT0VUN3RuVHZVUXRxM29YWVN4TXUtZ0QxSlMxOVpzSElVOFhSV3JtZUtyUXVPWGxtTzhuVzJTR3cwWnFNZi1rNDRZanFZYTE2YkVkdWxSOEFvX2RDczdhcXJMZDZTSllLRFdocUHSAbMBQVVfeXFMT1ZKVnNJakx5eXV6S3VqUmRJUjdyNlBjSW1xcV9NWVBJUmpxWjlPeGpxdGR6NkowM09DOE9WQXVaeE9LME9pRmE5WHhVR1ZpbTNxQmh1b25CbGhjdGpMR19GMGx3OGFiTDJTNHhmWHc4clRCU2ZEbm10ZWdCN1pYbS1NdDFrQ01xbVdXdmJRaTZRV2F3VXdLZlpMVEtjRUtWZldXcl9lcmxoM2QxeFl5bW1NTFU?oc=5",
      "https://www.cbc.ca/news/world/us-seizes-seventh-venezuela-linked-tanker-9.7053622?cmp=rss",
      "https://news.google.com/rss/articles/CBMimwFBVV95cUxNbUlKRDRjWWNtbzVxeDhubE5HZjZPVDBqbE55Yko0M0JpR0h1eXdwVmo0WWFUdEkwcWFnXzBpRV9uZXZzbGZRWDN1SklrLWFqekJoTUFrMTRIYjUtOHZQTEJ3UEZMbFp0WWx1R3dzMlViT241OVJ6UnNXOFNMZ1pmeEVtbVRkdnhCYzNDT2RnQnlaendPRnFPQ0k3Zw?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2026/1/21/us-seizes-a-seventh-venezuela-linked-oil-tanker?traffic_source=rss",
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.746,
      "consensus": 0.955,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.798,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story raises awareness about the ongoing conflict between the US and Venezuela, but it doesn't provide much in-depth analysis or actionable insights, nor does it highlight any progress or solutions.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The U.S. military seized a seventh oil tanker linked to Venezuela in the Caribbean on Tuesday, as part of ongoing efforts to control Venezuelan oil shipments following recent actions against the country.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Israeli Crews Demolish UNRWA Compound",
    "domain": "general",
    "source_domain": "nytimes.com",
    "location": "global",
    "published": "Wed, 21 Jan 2026 09:38:39 +0000",
    "source": "New York Times",
    "sources": [
      "New York Times",
      "The Guardian",
      "Associated Press"
    ],
    "domains": [
      "nytimes.com",
      "theguardian.com",
      "news.google.com"
    ],
    "snippets": [
      "Bulldozers leveled some structures in a compound that belonged to UNRWA, the United Nations agency for Palestinian refugees, escalating Israel’s crackdown on the organization.",
      "Palestinian refugee agency compound is demolished, while teargas is fired at UN vocational school in West Bank Israeli crews have started bulldozing the Jerusalem headquarters of the UN agency for Palestinian refugees in Jerusalem and fired teargas at a UN vocational school in Qalandia, in the West",
      "Israeli crews target UN facilities for Palestinian refugees in east Jerusalem AP News"
    ],
    "image_url": "https://static01.nyt.com/images/2026/01/20/multimedia/20int-gaza-unrwa-photo-pvcg/20int-gaza-unrwa-photo-pvcg-mediumSquareAt3X.jpg",
    "titles": [
      "Israel Seizes UNRWA’s Jerusalem Headquarters",
      "Israel bulldozes Unrwa headquarters in East Jerusalem",
      "Israeli crews target UN facilities for Palestinian refugees in east Jerusalem - AP News"
    ],
    "url": "https://www.nytimes.com/2026/01/20/world/middleeast/israel-unrwa-jerusalem.html",
    "alternate_urls": [
      "https://www.theguardian.com/world/2026/jan/20/israel-bulldozes-unrwa-headquarters-in-east-jerusalem",
      "https://news.google.com/rss/articles/CBMiqAFBVV95cUxNZ2gycWlabFNqaTdFR0pHcTRoX1AyOTMtRy1saVBMMmR4a2FINEhMOFZWdDBLdFNSb2pLOWdXQmhjUTlESTIyV3lkWTJCNVFrMlhVOC1ZaUhvU2QtRENWV1JBZlpHMkdCQ0RxaUdJVXd6MVFhUW9RWlkzQ3VYM2JQS2s4NlJyWk5uUjVyaDU0TGNDbnBNX21MdjBqMTEtSlQzdVZXWVZyWGE?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.nytimes.com/2026/01/20/world/middleeast/israel-unrwa-jerusalem.html",
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.944,
      "consensus": 0.789,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.795,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story provides basic awareness about the conflict between Israel and the UNRWA, but it lacks depth and insight. It does not provide any solutions or progress towards resolving the issue.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Israeli crews have demolished structures at the UNRWA compound in east Jerusalem and fired teargas at a UN vocational school in Qalandia, escalating actions against the United Nations agency for Palestinian refugees.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Chargers Expected to Hire Mike McDaniel as Offensive Coordinator",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Wed, 21 Jan 2026 02:58:46 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports",
      "Sports Illustrated",
      "Yahoo Sports"
    ],
    "domains": [
      "espn.com",
      "cbssports.com",
      "news.google.com",
      "sports.yahoo.com"
    ],
    "snippets": [
      "Former Miami Dolphins head coach Mike McDaniel is expected to become the Los Angeles Chargers' offensive coordinator, sources told ESPN.",
      "Barring the unexpected, McDaniel will be on the Chargers' staff next season",
      "Mike McDaniel to Join Jim Harbaugh As Chargers’ New Offensive Coordinator Sports Illustrated",
      "The Chargers are expected to make former Dolphins head coach Mike McDaniel their next offensive coordinator.",
      "The Chargers are closing in on hiring former Miami Dolphins head coach Mike McDaniel as the team’s new offensive coordinator.",
      "Mike McDaniel chooses to work with quarterback Justin Herbert over opportunities elsewhere.",
      "No deal is signed, as McDaniel remains in play for head-coaching jobs.",
      "Former Dolphins head coach Mike McDaniel is expected to become the next offensive coordinator of the Chargers, ESPN's Adam Schefter first reported.",
      "If hired, McDaniel will be tasked with further developing quarterback Justin Herbert and improving an offense that struggled the past two postseasons."
    ],
    "image_url": "",
    "titles": [
      "Sources: McDaniel set to become Chargers OC",
      "Chargers expected to hire former Dolphins coach Mike McDaniel as new offensive coordinator",
      "Mike McDaniel to Join Jim Harbaugh As Chargers’ New Offensive Coordinator - Sports Illustrated",
      "Chargers expected to make Mike McDaniel new OC",
      "Chargers nearing deal to hire Mike McDaniel as offensive coordinator",
      "Chargers to hire Mike McDaniel as offensive coordinator",
      "Chargers plan to hire Mike McDaniel as offensive coordinator",
      "Mike McDaniel landing Chargers offensive coordinator job in stunner",
      "Chargers reportedly expected to hire former Dolphins head coach Mike McDaniel as offensive coordinator"
    ],
    "url": "https://www.espn.com/nfl/story/_/id/47677046/sources-chargers-expected-hire-mike-mcdaniel-oc",
    "alternate_urls": [
      "https://www.cbssports.com/nfl/news/mike-mcdaniel-chargers-offensive-coordinator-former-dolphins-coach/",
      "https://news.google.com/rss/articles/CBMikwFBVV95cUxObVZxUF9fZmZENDhBMkRZUVlWVk5MMUJCN05vWkEyV0tVeExVNmhuRmJjbHp0N0xNQWpQbEtXN0NKTVR1M0NLUFJsdmE4ejNYclQtbnlsS1BONkdnRDkxUDFSS0VhQ0NLN3FEUEp1TWtYY1o4NGh6N3NQVU1UUkRMMG9RWTBPQ2FKQWFxQmxBVkhRMzA?oc=5",
      "https://sports.yahoo.com/articles/chargers-expected-mike-mcdaniel-oc-031557819.html",
      "https://sports.yahoo.com/articles/chargers-nearing-deal-hire-mike-025713581.html",
      "https://sports.yahoo.com/articles/chargers-hire-mike-mcdaniel-offensive-024423627.html",
      "https://sports.yahoo.com/articles/chargers-plan-hire-mike-mcdaniel-021418449.html",
      "https://sports.yahoo.com/articles/mike-mcdaniel-landing-chargers-offensive-020713646.html",
      "https://sports.yahoo.com/nfl/breaking-news/article/chargers-reportedly-expected-to-hire-former-dolphins-head-coach-mike-mcdaniel-as-offensive-coordinator-015543393.html"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/nfl/story/_/id/47677046/sources-chargers-expected-hire-mike-mcdaniel-oc",
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.902,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.795,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The Los Angeles Chargers are expected to hire former Miami Dolphins head coach Mike McDaniel as their new offensive coordinator. While no deal has been officially signed, multiple sources report McDaniel is likely to join the Chargers and work with quarterback Justin Herbert. An official announcement is pending.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Mayfield Anticipates NFC South Matchups Against Falcons Coach",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Wed, 21 Jan 2026 02:58:46 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports",
      "Sportsnet",
      "Yahoo Sports"
    ],
    "domains": [
      "espn.com",
      "cbssports.com",
      "sportsnet.ca",
      "sports.yahoo.com"
    ],
    "snippets": [
      "Buccaneers quarterback Baker Mayfield jabbed at new Falcons coach Kevin Stefanski, saying, \"Can't wait to see you twice a year, Coach.\"",
      "Stefanski coached Mayfield in Cleveland and their time together clearly did not end on good terms",
      "Baker Mayfield still hasn’t forgotten how his time ended with the Cleveland Browns, and he appears ready for some payback in the 2026 season. Mayfield, who was drafted by the Browns with the No. 1 overall pick in the 2018 NFL Draft, had a messy split with the team in 2021. After his fourth season with the Browns, and his second under head coach Kevin Stefanski, the team traded him to the Carolina Panthers for a fifth-round pick. Things didn’t work out for Mayfield in Carolina, but after a quick stop in L.A. with the Rams, he’s revitalized his career with the Buccaneers. Now, his former head...",
      "Mayfield spent two seasons in Cleveland with Kevin Stefanski. Now, the former No. 1 overall pick can't wait to see him twice a year in the NFC South."
    ],
    "image_url": "",
    "titles": [
      "Mayfield takes swipe at ex-coach Stefanski in post",
      "Baker Mayfield calls out new Falcons coach Kevin Stefanski: 'Can't wait to see you twice a year, coach'",
      "Mayfield welcomes Stefanski to NFC South with spicy jab",
      "Why Baker Mayfield says he 'can't wait' to face Kevin Stefanski"
    ],
    "url": "https://www.espn.com/nfl/story/_/id/47676216/bucs-qb-mayfield-takes-swipe-falcons-coach-stefanski-post",
    "alternate_urls": [
      "https://www.cbssports.com/nfl/news/baker-mayfield-kevin-stefanski-falcons-coach-buccaneers-browns/",
      "https://sports.yahoo.com/articles/why-baker-mayfield-says-cant-003017461.html"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/nfl/story/_/id/47676216/bucs-qb-mayfield-takes-swipe-falcons-coach-stefanski-post",
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.902,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.795,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Baker Mayfield, now quarterback for the Buccaneers, commented on facing new Falcons coach Kevin Stefanski, referencing their difficult split in Cleveland. Mayfield said, \"Can't wait to see you twice a year, Coach,\" as both are set to compete in the NFC South during the 2026 NFL season.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "UK Inflation Rises to 3.4% in December",
    "domain": "business",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Wed, 21 Jan 2026 09:28:37 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "CNBC",
      "Financial Times",
      "The Guardian"
    ],
    "domains": [
      "bbc.com",
      "cnbc.com",
      "ft.com",
      "theguardian.com"
    ],
    "snippets": [
      "It is the last set of monthly inflation figures before the next interest rate decision on 5 February.",
      "The U.K. inflation rate rose to 3.4% in December, above forecasts of 3.3% from economists polled by Reuters.",
      "Bank of England expects pick-up to be temporary",
      "Bigger than forecast rise part-fuelled by hikes in air fares and food prices suggests Bank of England will keep interest rates on hold in February Davos live – latest updates Inflation in the UK has risen for the first time in five months to 3.4% in December, according to official figures, suggestin",
      "Airfares and tobacco inflation artificially push headline figure higher"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/225d/live/541a6210-f6a4-11f0-a422-4ba8a094a8fa.jpg",
    "titles": [
      "UK inflation rises to 3.4%, driven by tobacco and airfares",
      "UK inflation rises to 3.4% in December, above forecasts",
      "UK inflation rises more than expected to 3.4% in December",
      "UK inflation rises for first time in five months to 3.4% in December",
      "Higher UK inflation in December mostly erratic"
    ],
    "url": "https://www.bbc.com/news/articles/cnvg251g25yo?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://www.cnbc.com/2026/01/21/uk-inflation-december-2025-uk-prices.html",
      "https://www.ft.com/content/df1b7436-35fe-4b64-954a-9009b371c444",
      "https://www.theguardian.com/business/2026/jan/21/uk-inflation-rose-december-interest-rate-hold-likely",
      "https://www.ft.com/content/c68e9d7a-661b-415b-90a2-6d853911ed5c"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/news/articles/cnvg251g25yo?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.932,
      "recency": 0.94,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.793,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "UK inflation rose to 3.4% in December 2025, exceeding economists' forecasts of 3.3%. The increase, driven by higher airfares, tobacco, and food prices, marks the first rise in five months. The Bank of England expects this uptick to be temporary and will consider the data at its upcoming interest rate decision on 5 February 2026.",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "Mexico Extradites 37 Cartel Suspects to US After Death Penalty",
    "domain": "politics",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Wed, 21 Jan 2026 06:05:02 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Reuters",
      "New York Times"
    ],
    "domains": [
      "aljazeera.com",
      "news.google.com",
      "nytimes.com"
    ],
    "snippets": [
      "Mexican Security Minister Omar Garcia Harfuch says the US promised that suspects will not face the death penalty.",
      "Mexico sends 37 more cartel suspects to US amid rising tensions Reuters",
      "Mexico has sought to do more to combat its cartels in an effort to stave off airstrikes threatened by President Trump."
    ],
    "image_url": "",
    "titles": [
      "Mexico sends 37 more drug cartel suspects to US amid Trump attack threats",
      "Mexico sends 37 more cartel suspects to US amid rising tensions - Reuters",
      "Pressured by Trump, Mexico Sends 37 Accused Criminals to U.S."
    ],
    "url": "https://www.aljazeera.com/news/2026/1/21/mexico-sends-37-more-drug-cartel-suspects-to-us-amid-trump-attack-threats?traffic_source=rss",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiqAFBVV95cUxNQ2J4YkF6RXV0YnY3dkJDSU1vZVZYejZqZWRjY1l5NGwtSW5UMW1nUk84RHhkNmxCM3hvbmFfOE0yQmNPWUpkQUltd1Y3WmFDMlJySjlDR1hmc3RnV2F5Y3AxeVVuX1pYLXh5VDV4aTM2WHpWNmV0Wng2QzFXQzdIU2YwLXBLWWY2cWdscnplaHdtc2FpRGRRM3V3UVBCZ1l2NW1PVW5jVEE?oc=5",
      "https://www.nytimes.com/2026/01/20/world/americas/mexico-cartels-suspects-trump.html"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2026/1/21/mexico-sends-37-more-drug-cartel-suspects-to-us-amid-trump-attack-threats?traffic_source=rss",
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.855,
      "consensus": 0.789,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.788,
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story informs about a significant event in international relations and crime control. It provides useful context, but it does not report on solutions or improvements.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Mexico has extradited 37 additional cartel suspects to the US. Security Minister Omar Garcia Harfuch stated that the US has promised not to seek the death penalty for these individuals. The move comes as Mexico increases efforts against cartels amid US threats of airstrikes.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Trump Launches Board of Peace",
    "domain": "politics",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Tue, 20 Jan 2026 23:50:25 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "New York Times",
      "The Guardian",
      "Associated Press"
    ],
    "domains": [
      "news.google.com",
      "nytimes.com",
      "theguardian.com"
    ],
    "snippets": [
      "Trump's Gaza Board of Peace: Here's what to know Axios",
      "Numerous countries say they have been invited to join President Trump’s newly minted organization, which critics say could undermine the United Nations.",
      "The US president’s global club was endorsed by the security council on a false prospectus and seems aimed at displacing the United Nations Like many punters who have tried to do business with Donald Trump in the past, the UN has found itself a victim of a classic bait-and-switch, thinking it was buy",
      "A look at Trump’s Board of Peace and who has been invited AP News"
    ],
    "image_url": "",
    "titles": [
      "Trump's Gaza Board of Peace: Here's what to know - Axios",
      "Gaza’s Board of Peace: What to Know",
      "Trump’s board of peace is an imperial court completely unlike what was proposed",
      "A look at Trump’s Board of Peace and who has been invited - AP News"
    ],
    "url": "https://news.google.com/rss/articles/CBMiggFBVV95cUxNRXFiZnplRTZNRzNaZUFpSnNqeDgzSzZUU0NhZzB2cEFMNGFWcWZxSTUxdVF0REpVNUp3dXhKVHh2bmx0UVVFYlh6M2lTdENBLWllQ2JaV1ZQSkpNVWlkazh6dUNlSGZuNzN1UjE5UzljaVMxNzRoT0JubHpOUVR3S1FR?oc=5",
    "alternate_urls": [
      "https://www.nytimes.com/2026/01/19/world/middleeast/trump-board-of-peace-gaza.html",
      "https://www.theguardian.com/us-news/2026/jan/20/trumps-board-of-peace-is-an-imperial-court-completely-unlike-what-was-proposed",
      "https://news.google.com/rss/articles/CBMinwFBVV95cUxPVXktSk5yd2xUV1hla0djX1h0UzFnSy1vdlNPQXdIWWdtVWwtcVlqNVRIMVdyTlVFZDJLeFdtY1BjeFFjTXlXOXg1dk43X0hFVUpzQndaOTVUek1XYlYxakNEMEZXUXU0VjFOWVFhYUEtbkdsS3VkOWF0QWlvYjJ2ZGVRWTJMQXVyT2laTVdQWm05dG9Za19wOWtmV00ySlU?oc=5"
    ],
    "location_scope": "national",
    "link": "https://news.google.com/rss/articles/CBMiggFBVV95cUxNRXFiZnplRTZNRzNaZUFpSnNqeDgzSzZUU0NhZzB2cEFMNGFWcWZxSTUxdVF0REpVNUp3dXhKVHh2bmx0UVVFYlh6M2lTdENBLWllQ2JaV1ZQSkpNVWlkazh6dUNlSGZuNzN1UjE5UzljaVMxNzRoT0JubHpOUVR3S1FR?oc=5",
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.719,
      "consensus": 0.888,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.787,
    "constructiveness_score": 0.7,
    "constructiveness_reason": "The story provides a deeper understanding of the Gaza Board of Peace, which can be useful for readers interested in international politics. However, it does not report on solutions or improvements, nor does it significantly increase clarity around systems, causes, trends, or impacts.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "President Trump has established a new international organization called the Board of Peace, inviting multiple countries to join. The initiative has drawn criticism from some who argue it could undermine the United Nations. The UN Security Council endorsed the group, though concerns remain about its purpose and impact.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Bo Bichette Signs With Mets After Near Deal With Phillies",
    "domain": "politics",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Tue, 20 Jan 2026 23:38:53 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet",
      "Yahoo Sports"
    ],
    "domains": [
      "espn.com",
      "sportsnet.ca",
      "sports.yahoo.com"
    ],
    "snippets": [
      "Bo Bichette spurning the Phillies for the NL East rival New York Mets was akin to a gut punch for the NL East champions.",
      "MLB analyst Jim Bowden joins JD Bunkis to discuss why he thinks the Blue Jays were ready to move off of Bo Bichette, why he doesn’t think they’re in on Cody Bellinger, and why he loves their off-season regardless of missing out on Bo and Kyle Tucker.",
      "Philadelphia Phillies president Dave Dombrowski is not feeling good about missing out on Bo Bichette.",
      "Bo Bichette, after meeting with the Phillies and coming close to a deal, opted to go with the Mets last week instead."
    ],
    "image_url": "",
    "titles": [
      "Phillies prez: Bichette joining Mets 'a gut punch'",
      "Why Blue Jays didn’t value Bichette the same as Mets or Phillies",
      "Phillies president Dombrowski: ‘Gut punch’ missing out on Bo Bichette",
      "Phillies president said losing out on Bo Bichette sweepstakes to the Mets was a ‘gut punch’"
    ],
    "url": "https://www.espn.com/mlb/story/_/id/47672631/phillies-president-laments-losing-ss-mets",
    "alternate_urls": [
      "https://sports.yahoo.com/mlb/article/phillies-president-said-losing-out-on-bo-bichette-sweepstakes-to-the-mets-was-a-gut-punch-041014359.html"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/mlb/story/_/id/47672631/phillies-president-laments-losing-ss-mets",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.822,
      "consensus": 0.789,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.758,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about a sports event, but it does not provide deeper understanding, report on solutions, or increase clarity around systems or impacts that matter.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Bo Bichette has signed with the New York Mets after nearly reaching a deal with the Philadelphia Phillies. Phillies president Dave Dombrowski expressed disappointment over missing out on Bichette, who chose the Mets last week despite strong interest from Philadelphia.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Stocks Plunge as Trump Threatens Tariffs Over Greenland Dispute",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Tue, 20 Jan 2026 12:10:52 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "New York Times",
      "Bloomberg",
      "The Guardian",
      "CNBC",
      "Al Jazeera",
      "CBC News",
      "Associated Press"
    ],
    "domains": [
      "news.google.com",
      "nytimes.com",
      "theguardian.com",
      "aljazeera.com",
      "cbc.ca",
      "cnbc.com"
    ],
    "snippets": [
      "EU chief warns there's no going back after Trump's Greenland threats Axios",
      "Wall Street reacts to Greenland tariff threats Axios",
      "Wall Street bets on Washington policy plays Axios",
      "President Trump posted private messages from France’s president and repeated his desire to take over Greenland in an overnight social media storm.",
      "After a century of defending other countries against foreign aggression, the United States is now positioned as an imperial power trying to seize another nation’s land.",
      "Trump Doubts Greenland Threats Will Spoil Europe Trade Deal Bloomberg",
      "Sell-off hits US stocks in first trading day since president threatened tariffs against eight countries Stock markets fell on both sides of the Atlantic on Tuesday, with Wall Street suffering its worst day since October, as investor concerns persisted over the fallout from Donald Trump’s push for US",
      "Dow slides 870 points, S&P 500 drops 2% for worst day since October on Trump tariff threat over Greenland: Live updates CNBC",
      "Wall Street has its worst day since October as Trump doubles down on threats to take Greenland.",
      "Stocks sank in afternoon trading on Wall Street Tuesday after President Donald Trump threatened to hit eight NATO members with new tariffs as tensions escalate over his attempts to assert American control over Greenland.",
      "Wall Street sinks as Trump threatens 8 European countries with tariffs over Greenland AP News",
      "The Supreme Court tariff decision could decide the fate of President Donald Trump's threat to tariff NATO nations over control of Greenland."
    ],
    "image_url": "",
    "titles": [
      "EU chief warns there's no going back after Trump's Greenland threats - Axios",
      "Wall Street reacts to Greenland tariff threats - Axios",
      "Wall Street bets on Washington policy plays - Axios",
      "Trump Doubles Down on Greenland Threats in Flurry of Truth Social Posts",
      "With Threats to Greenland, Trump Sets America on the Road to Conquest",
      "Trump Doubts Greenland Threats Will Spoil Europe Trade Deal - Bloomberg",
      "Wall Street sees worst day since October after Trump tariff threats",
      "Dow slides 870 points, S&P 500 drops 2% for worst day since October on Trump tariff threat over Greenland: Live updates - CNBC",
      "Stock markets, dollar plunge as Trump ramps up tensions over Greenland",
      "Stock markets plunge after Trump threatens some NATO members with tariffs over Greenland",
      "Wall Street sinks as Trump threatens 8 European countries with tariffs over Greenland - AP News",
      "Trump's Greenland tariff threats could be upended by Supreme Court decision"
    ],
    "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTFA5RUs0Undycmh5V0hkZ2V3eGtRalNVRndkMUhTWWM2M09RTjNHYkFIV3B5ZzB0LW9ycllqSGtUYzlrWFFnUUQxMDNuR0RwTGlnckRWeVdjUF95RHNTWlZpR21uYVp6bjk4M0VDZWlzakpVT1RkbmNR?oc=5",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMickFVX3lxTE1nUmFHUDl3VGRYWmNmWjZ2ODV4TEV4VzRVcXVuWFpGZTlLXzloNGRQTXBSUDZrN1ZsRUNyVTd5cVZUTERkTS1mNlM2bTdYdUJGemVsUThhU3VkZGpsdmVDd1I5WFRKd0dZUFV1dHJqQ18xdw?oc=5",
      "https://news.google.com/rss/articles/CBMic0FVX3lxTE9VbmNENVViVWpmbVoxZFp5U1VfY0dtc1hNZW9LR3lOblhlUUpnMGRjVzlOTGo1b2R4TnlIa2ZITHBocUVqU3lXOXo1X0piSExMSDJXbTZCc1JBVHFhemItY0gtb2RlNEt3MHlCcEhNaFFFTkk?oc=5",
      "https://www.nytimes.com/2026/01/20/world/europe/trump-greenland-europe-macron-rutte.html",
      "https://www.nytimes.com/2026/01/20/us/politics/trump-greenland-america-conquest.html",
      "https://news.google.com/rss/articles/CBMitgFBVV95cUxQQU1rNWp1YjVvWUVzQk9hS1JpMGFoT0RHMkIwS2RPcllTenl3ZHgtODJHOU5XSXlOa1VJb2RabkhpUE03OFVuTF9oU29xcy1wQ1RGR2tfT0xHbndPMUUzN2luQ2tBQWhRbF9TQjVNM1NVLUJrQ19oYmk0N1RpWVlWa0Z3akU5UzFDT2xHQVpIT2dIRHkzU3dGMzUtRmRfaVR5THU5eTJHd0hXdklXc1VwaFk3RlFldw?oc=5",
      "https://www.theguardian.com/business/2026/jan/20/stock-markets-trump-greenland-tariff-ftse-100-gold",
      "https://news.google.com/rss/articles/CBMid0FVX3lxTFB6aFhReFdKU1ZXQVpTNlFRalk5VkduNFp6cXh2aFd2bGxzcTVyb2ZrZkEwbm1XeU50N1hIZFRoTDN5REhLQVI5Rk52VHlIMlQ1SkN1bXlUUWQ5N3dLbF9KRkNyeEJHTktXcHlUYUdDLVA0YkxrT1Vj0gF8QVVfeXFMUGpoZU5NM24zWG5MNmVVUUFHRmdQMTh1QjdKZnBmWEZZc0R4ZktxSUVHeWR6bDBULU9zQm1TTlNSc3J6SUp2Z0VweENMaml4TER5cTRVWTJvYk1oVlBwM1lHRHEtbm5PYVBhRGJHNlhSb2RoeE13cGxNQnJaOA?oc=5",
      "https://www.aljazeera.com/news/2026/1/21/stock-markets-plunge-as-trump-ramps-up-tensions-over-greenland?traffic_source=rss",
      "https://www.cbc.ca/news/business/wall-street-stocks-trump-tariffs-nato-jan-20-9.7052595?cmp=rss",
      "https://news.google.com/rss/articles/CBMioAFBVV95cUxNeS1Jc3RseEJGMFg4X05ndFNfWlMxSWI5XzF4dkxzemVuZktNYmlEWUc2TndUUU11Y2MtV0tmckVuWl9FVVVIQ1JNbmF2aE0wMEN3RGhYSzF5dE94VGZxcHZPSGNncXZHVG9uQ3IyaWxYMmlhMlBoMGw1dFNucHlGdTU3ZjlmMHFaQ2x1SDdfZkotWHl3T2czRUl1dXZ3VDJ1?oc=5",
      "https://www.cnbc.com/2026/01/20/trump-greenland-tariffs-nato-supreme-court-decision.html"
    ],
    "location_scope": "national",
    "link": "https://news.google.com/rss/articles/CBMid0FVX3lxTFA5RUs0Undycmh5V0hkZ2V3eGtRalNVRndkMUhTWWM2M09RTjNHYkFIV3B5ZzB0LW9ycllqSGtUYzlrWFFnUUQxMDNuR0RwTGlnckRWeVdjUF95RHNTWlZpR21uYVp6bjk4M0VDZWlzakpVT1RkbmNR?oc=5",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.52,
      "consensus": 1.0,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.756,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story offers basic awareness of the situation and includes a warning from the EU chief, but it doesn't provide actionable insights or a deeper understanding of the situation.",
    "constructiveness_source": "gpt",
    "summary_source": "snippet",
    "summary_reason": "invalid_roles",
    "headline_source": "gpt",
    "summary": "EU chief warns there's no going back after Trump's Greenland threats Axios",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Commuter Train Crash Near Barcelona Kills Driver",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Wed, 21 Jan 2026 06:51:00 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "CBC News",
      "The Guardian"
    ],
    "domains": [
      "news.google.com",
      "cbc.ca",
      "theguardian.com"
    ],
    "snippets": [
      "Commuter train derails near Barcelona; driver dead, four badly injured Reuters",
      "A Barcelona commuter train crashed Tuesday after a retaining wall fell onto the tracks, Spanish regional authorities said, killing one person and injuring at least 14 others.",
      "Incident in Spain took place days after collision between two high-speed trains in Andalucía that killed at least 42 A commuter train has hit a collapsed retaining wall near Barcelona, killing the driver and injuring 37 people, four of them seriously, firefighters have said. Four people are believed"
    ],
    "image_url": "",
    "titles": [
      "Commuter train derails near Barcelona; driver dead, four badly injured - Reuters",
      "1 dead, several injured in commuter train crash near Barcelona",
      "Commuter train near Barcelona hits collapsed wall killing driver and injuring nearly 40"
    ],
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxPempkbU1lcENkaTM4bHFMcGZQNnRwRGNLMTFqZVdTN3BaQXV3emZpVjJncnJ3TVJMRDVUUmJ3YVFDd21wTXVkTmJJaUg2d2pVbU9ISEZFZ3NTRmpHN3kzUVhUOGNUUDY1WU96RWFuNjBJbmU2ODREN1dHSzJsNEtTRQ?oc=5",
    "alternate_urls": [
      "https://www.cbc.ca/news/world/barcelona-train-crash-fatal-9.7053786?cmp=rss",
      "https://www.theguardian.com/world/2026/jan/20/commuter-train-near-barcelona-hits-collapsed-wall-injuring-several-people"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMigAFBVV95cUxPempkbU1lcENkaTM4bHFMcGZQNnRwRGNLMTFqZVdTN3BaQXV3emZpVjJncnJ3TVJMRDVUUmJ3YVFDd21wTXVkTmJJaUg2d2pVbU9ISEZFZ3NTRmpHN3kzUVhUOGNUUDY1WU96RWFuNjBJbmU2ODREN1dHSzJsNEtTRQ?oc=5",
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.874,
      "consensus": 0.789,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.754,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness of an event but does not offer any depth, insight, or actionable information for the reader. It does not report on solutions, improvements, or attempts to solve problems.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "A commuter train near Barcelona crashed after hitting a collapsed retaining wall, killing the driver and injuring at least 37 people, including four seriously, according to firefighters. The incident follows a recent fatal train collision in Andalucía.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Mets Acquire Luis Robert Jr. From White Sox in Trade",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Wed, 21 Jan 2026 02:58:46 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sports Illustrated",
      "Yahoo Sports"
    ],
    "domains": [
      "espn.com",
      "news.google.com",
      "sports.yahoo.com"
    ],
    "snippets": [
      "Luis Robert Jr., a former Gold Glover who hit 38 home runs two seasons ago, is headed to the Mets in a trade that sends infielder Luisangel Acuna and right-hander Truman Pauley to the White Sox.",
      "Mets Land OF Luis Robert Jr. in Trade With White Sox Sports Illustrated",
      "The New York Mets acquired Luis Robert Jr. in a trade with the Chicago White Sox on Tuesday, filling a hole in center field. New York sent infielder Luisangel Acuña and minor league pitcher Truman Pauley to Chicago for Robert, who has struggled with injuries and inconsistency since a stellar 2023 se",
      "Mets fill OF hole while Sox add RHP Truman Pauley and infielder Luisangel Acuña, brother of MLB star Ronald Acuña Jr.",
      "Luis Robert was on the trade block for what feels like forever, and finally gets dealt to the Mets for two prospects.",
      "The Mets, in a trade with the White Sox, acquired center fielder Luis Robert Jr., who in 2023 was an All-Star and won a Silver Slugger Award.",
      "Luis Robert Jr. is headed to the Mets.",
      "The Mets filled their outfield need with a big trade on Tuesday night."
    ],
    "image_url": "",
    "titles": [
      "Mets continue overhaul, land OF Robert in trade",
      "Mets Land OF Luis Robert Jr. in Trade With White Sox - Sports Illustrated",
      "Mets acquire CF Luis Robert Jr. in a trade with the White Sox",
      "White Sox News: White Sox trade Luis Robert Jr. to the New York Mets",
      "Mets, White Sox, agree to Luis Robert Jr. trade",
      "Luis Robert Jr. traded to Mets in three-player deal with White Sox",
      "Mets acquire CF Luis Robert Jr. in trade with White Sox, days after landing Bo Bichette in free agency",
      "Mets acquire Luis Robert Jr. in trade with White Sox to fill outfield need"
    ],
    "url": "https://www.espn.com/mlb/story/_/id/47678017/mets-land-luis-robert-jr-deal-white-sox",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMicEFVX3lxTFBmc3VRUGJyUm5OX2FkUVN0U2xnTUNLS2VmaFdXT0hTRjZ3cDJDNEZnU0pQNnFtNzg0RE92YWtFMzY5M2lUaDU0c0ZRX3RGMFdzdVRyZjNIRDNkaU1FVzRLSTlUbGN0VURham9UX2VZZmM?oc=5",
      "https://sports.yahoo.com/articles/mets-acquire-cf-luis-robert-044935903.html",
      "https://sports.yahoo.com/articles/end-era-white-sox-trade-065149331.html",
      "https://sports.yahoo.com/articles/mets-white-sox-agree-luis-051842261.html",
      "https://sports.yahoo.com/articles/york-mets-acquire-luis-robert-045858424.html",
      "https://sports.yahoo.com/mlb/breaking-news/article/mets-acquire-cf-luis-robert-jr-in-trade-with-white-sox-days-after-landing-bo-bichette-in-free-agency-043416839.html",
      "https://sports.yahoo.com/articles/mets-acquire-luis-robert-jr-042756147.html"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/mlb/story/_/id/47678017/mets-land-luis-robert-jr-deal-white-sox",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.902,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.752,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The New York Mets acquired center fielder Luis Robert Jr. from the Chicago White Sox in a trade on Tuesday, sending infielder Luisangel Acuña and pitcher Truman Pauley to Chicago. Robert, an All-Star and Silver Slugger winner in 2023, fills a key outfield need for the Mets.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Han Duck soo Sentenced to 23 Years for Role in Martial Law",
    "domain": "politics",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Wed, 21 Jan 2026 09:02:32 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "New York Times"
    ],
    "domains": [
      "news.google.com",
      "nytimes.com"
    ],
    "snippets": [
      "Former South Korean PM Han jailed for 23 years in martial law case Reuters",
      "Han Duck-soo was convicted of playing a key role in former President Yoon Suk Yeol’s imposition of martial law, which a court said was an insurrection."
    ],
    "image_url": "",
    "titles": [
      "Former South Korean PM Han jailed for 23 years in martial law case - Reuters",
      "South Korean Ex-Premier Gets 23 Years in Prison for Role in Martial Law"
    ],
    "url": "https://news.google.com/rss/articles/CBMizgFBVV95cUxOcWlyaUdnV3FtLWxzUzJJcU9WNXVmRmRPRzdjb0NLcVh4QmI0X29IRnkyakxmMGk4SDVDZFNFQnB1VV84T1VSRlQwWGpfSDBocnVaQU03V3VaU0pBZGZEMUU5VGZ3WnhUVW5Tb2VneFZLY0NWaWJSUEdQbDkxMWc4N3dvRWdqbWc4VnNULVJpeUVCQnlYVURKckd0cHVwMTVFbk5vdFVtTUxTRHpmQWJGakg1Y3pJeEgtRE96b0E0WWJ5V0p4eXY3OC1CWkZzZw?oc=5",
    "alternate_urls": [
      "https://www.nytimes.com/2026/01/21/world/asia/south-korea-prime-minister-martial-law.html"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMizgFBVV95cUxOcWlyaUdnV3FtLWxzUzJJcU9WNXVmRmRPRzdjb0NLcVh4QmI0X29IRnkyakxmMGk4SDVDZFNFQnB1VV84T1VSRlQwWGpfSDBocnVaQU03V3VaU0pBZGZEMUU5VGZ3WnhUVW5Tb2VneFZLY0NWaWJSUEdQbDkxMWc4N3dvRWdqbWc4VnNULVJpeUVCQnlYVURKckd0cHVwMTVFbk5vdFVtTUxTRHpmQWJGakg1Y3pJeEgtRE96b0E0WWJ5V0p4eXY3OC1CWkZzZw?oc=5",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.929,
      "consensus": 0.591,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.733,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information about the consequences of martial law abuse, potentially informing readers' understanding of the justice system and political accountability. However, it lacks a focus on progress or solutions.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Han Duck-soo has been sentenced to 23 years in prison after being convicted of involvement in the imposition of martial law under former President Yoon Suk Yeol. The court ruled that the action constituted an insurrection.",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Barcelona Train Derailment Kills 1",
    "domain": "general",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Wed, 21 Jan 2026 02:51:46 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "BBC",
      "Globe and Mail"
    ],
    "domains": [
      "aljazeera.com",
      "bbc.com",
      "news.google.com"
    ],
    "snippets": [
      "Official says 37 people injured, as Spain observes three days of mourning for 42 killed in earlier train collision.",
      "At least 37 people have been injured, five seriously, in a second crash, after Sunday's two-train collision in Andalusia.",
      "One killed as Barcelona train derails just two days after Andalusia crash The Globe and Mail"
    ],
    "image_url": "",
    "titles": [
      "Barcelona rail crash kills 1 days after deadly train wreck in Spain’s south",
      "Train driver killed in second deadly Spain rail crash in days",
      "One killed as Barcelona train derails just two days after Andalusia crash - The Globe and Mail"
    ],
    "url": "https://www.aljazeera.com/news/2026/1/21/barcelona-rail-crash-kills-one-days-after-deadly-train-wreck-in-spains-south?traffic_source=rss",
    "alternate_urls": [
      "https://www.bbc.com/news/articles/c1m78xl0gmpo?at_medium=RSS&at_campaign=rss",
      "https://news.google.com/rss/articles/CBMilgFBVV95cUxPaHk0Mm5IZXhYNGpPNFZVdjBSSGZsZnNzR0Ezd2E4MERxbk1Sb2R2UHMtVmNZZVlEbDJDeVQtcmVPenFzWWlQUHNQT3cwR1pHdVc1WEpWUVQ1Mmk3QkY0MGNDOGx1YVc4OC1zTlVfTXRnb3FmOTJWejdNUW5rdVd3cGhVZjMzZUFWazR4bGpQd2ppclN0ZlE?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2026/1/21/barcelona-rail-crash-kills-one-days-after-deadly-train-wreck-in-spains-south?traffic_source=rss",
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.782,
      "consensus": 0.789,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.727,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness of an event but does not offer any depth, insight, or actionable information for the reader. It does not report on solutions, improvements, or attempts to solve problems.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "A train derailed in Barcelona, resulting in one death and 37 injuries, including five serious cases. The incident occurred two days after a train collision in Andalusia that killed 42 people. Spain is observing three days of mourning for the victims of the earlier crash.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Trump Signs Order Restricting Institutional Purchases of Single",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Wed, 21 Jan 2026 02:17:00 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "Bloomberg",
      "Business Insider"
    ],
    "domains": [
      "news.google.com",
      "businessinsider.com"
    ],
    "snippets": [
      "Trump signs order to limit Wall Street investors in single-family housing Reuters",
      "Trump Signs Order Targeting Institutional Housing Investors Bloomberg",
      "The order comes with a carveout: build-to-rent properties that were designed to be rental communities will not be affected."
    ],
    "image_url": "",
    "titles": [
      "Trump signs order to limit Wall Street investors in single-family housing - Reuters",
      "Trump Signs Order Targeting Institutional Housing Investors - Bloomberg",
      "Trump laid out his plans to restrict institutional housing investors &mdash; with some notable carveouts"
    ],
    "url": "https://news.google.com/rss/articles/CBMiswFBVV95cUxOc0ZISWx3WWlKQzFxZmVfS0dGSW9OZHRrZmNveUtBOEhCOXpmLW16emtndzFIUTVNVDR0SV9iV29KcFdPMzFDUVVwbzdRdVNFSDdELUpvUGhZMkNJa1A3ZVRjTzNNbUR5T0VHS2RldDY0aHVLT3g2SDNzMWFveDhwQVgzSDIyM2dFX0l5UmpuSWVhM1RmNU5qaEVNcWNZOVN3UkQ0OHE1NG51QjJFbC1ScHhLVQ?oc=5",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMirwFBVV95cUxNWnZtSDlWb0JncG8tZlhJLXEycEtSWkpzRE9wNXNLVTRzcG93T1A3YVcwYzg2ellNNXZEQmZxZFFIOTVxcEJoZWstb2lWNm16ZlFkaXhma09RaDdsS1lzOThKMEJ1OEpUcW11cnlZTEE5N3lQdENENEpBblZZZU1JWkFxLV81aWZuaGp4dVNocU5lZVlZcjc5bExUN2dQNkVrcWthRm1FVlo4X2MzQlBV?oc=5",
      "https://www.businessinsider.com/trump-laid-out-his-plans-to-restrict-institutional-housing-investors-2026-1"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMiswFBVV95cUxOc0ZISWx3WWlKQzFxZmVfS0dGSW9OZHRrZmNveUtBOEhCOXpmLW16emtndzFIUTVNVDR0SV9iV29KcFdPMzFDUVVwbzdRdVNFSDdELUpvUGhZMkNJa1A3ZVRjTzNNbUR5T0VHS2RldDY0aHVLT3g2SDNzMWFveDhwQVgzSDIyM2dFX0l5UmpuSWVhM1RmNU5qaEVNcWNZOVN3UkQ0OHE1NG51QjJFbC1ScHhLVQ?oc=5",
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.77,
      "consensus": 0.769,
      "constructiveness": 0.05,
      "proximity": 0.5
    },
    "score": 0.694,
    "constructiveness_score": 0.05,
    "constructiveness_reason": "actions: sign; semantic: pos_sim=0.08, neg_sim=0.00; semantic_boost=0.02; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Trump has signed an order restricting institutional and Wall Street investors from buying single-family homes. The order exempts build-to-rent properties that were originally developed as rental communities.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Charles Bediako Sues NCAA to Rejoin Crimson Tide",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Wed, 21 Jan 2026 02:58:46 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "espn.com",
      "cbssports.com"
    ],
    "snippets": [
      "Charles Bediako, who entered the 2023 NBA draft and played in the G League, has sued the NCAA to gain reinstatement to join the Crimson Tide.",
      "Bediako went undrafted in 2023 and has played for three G League teams"
    ],
    "image_url": "",
    "titles": [
      "Former Bama standout sues NCAA over eligibility",
      "Former Alabama center Charles Bediako sues NCAA in effort to return to college basketball"
    ],
    "url": "https://www.espn.com/mens-college-basketball/story/_/id/47677338/former-alabama-g-league-player-sues-ncaa-eligibility",
    "alternate_urls": [
      "https://www.cbssports.com/college-basketball/news/charles-bediako-alabama-ncaa-lawsuit-g-league-college-basketball/"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/mens-college-basketball/story/_/id/47677338/former-alabama-g-league-player-sues-ncaa-eligibility",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.902,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.684,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Charles Bediako, who went undrafted in the 2023 NBA draft and has since played for three G League teams, has filed a lawsuit against the NCAA seeking reinstatement to join the Crimson Tide.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Amazon CEO Says Trump Tariffs Lead to Rising Prices as Stockpiles",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Tue, 20 Jan 2026 23:26:23 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "CNBC",
      "Business Insider"
    ],
    "domains": [
      "news.google.com",
      "cnbc.com",
      "businessinsider.com"
    ],
    "snippets": [
      "Amazon CEO Andy Jassy says prices have started to increase because of Trump tariffs Axios",
      "Sellers tried to absorb the tariff shock by buying stock ahead of time, but much of that inventory has run out, forcing some businesses to raise prices.",
      "Amazon CEO Andy Jassy said that retailers are running out of stockpiled goods imported before tariffs and \"don't have endless options.\""
    ],
    "image_url": "",
    "titles": [
      "Amazon CEO Andy Jassy says prices have started to increase because of Trump tariffs - Axios",
      "Amazon CEO Jassy says Trump's tariffs have started to 'creep' into prices",
      "Amazon CEO says that tariffs are starting to 'creep' into prices as vendors run out of stockpiled goods"
    ],
    "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxOVEUzdjhhdzR0UXNFd0lrRFI5YTlCeWx2b3BxQzlvQVFfUjQwc2JxdzVpQ2ZKYTdhMEx0bDcyNll3SHBHN29UdFk3eXhOVF9CbGN3bDZ0Sk85RXNBVXUwUERsSmNOVTFYelo2eGREZ190aEhWQjdBY1FNN2xfN2JKRE85QQ?oc=5",
    "alternate_urls": [
      "https://www.cnbc.com/2026/01/20/amazon-jassy-trump-tariffs-prices-shoppers.html",
      "https://www.businessinsider.com/amazon-ceo-says-tariffs-are-starting-to-creep-into-prices-2026-1"
    ],
    "location_scope": "national",
    "link": "https://news.google.com/rss/articles/CBMigwFBVV95cUxOVEUzdjhhdzR0UXNFd0lrRFI5YTlCeWx2b3BxQzlvQVFfUjQwc2JxdzVpQ2ZKYTdhMEx0bDcyNll3SHBHN29UdFk3eXhOVF9CbGN3bDZ0Sk85RXNBVXUwUERsSmNOVTFYelo2eGREZ190aEhWQjdBY1FNN2xfN2JKRE85QQ?oc=5",
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.711,
      "consensus": 0.789,
      "constructiveness": 0.03,
      "proximity": 0.5
    },
    "score": 0.684,
    "constructiveness_score": 0.03,
    "constructiveness_reason": "actions: start; semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Amazon CEO Andy Jassy stated that prices are rising as businesses run out of goods imported before the Trump tariffs. With limited inventory remaining, some retailers have begun increasing prices to offset the impact of the tariffs.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Brooklyn Beckham Accuses Parents of Undermining His Marriage",
    "domain": "general",
    "source_domain": "npr.org",
    "location": "national",
    "published": "Wed, 21 Jan 2026 02:28:00 -0500",
    "source": "NPR",
    "sources": [
      "NPR",
      "Associated Press"
    ],
    "domains": [
      "npr.org",
      "news.google.com"
    ],
    "snippets": [
      "A Beckham family falling-out has spilled further into public view in a series of social media posts from Brooklyn Beckham alleging that his parents David and Victoria Beckham have tried to sabotage his marriage and have always prioritized public branding over their family relationships.",
      "Brooklyn Beckham accuses David and Victoria of putting branding before family and sabotaging wedding AP News"
    ],
    "image_url": "",
    "titles": [
      "Brooklyn Beckham accuses David and Victoria of putting branding before family and sabotaging wedding",
      "Brooklyn Beckham accuses David and Victoria of putting branding before family and sabotaging wedding - AP News"
    ],
    "url": "https://www.npr.org/2026/01/21/nx-s1-5683820/brooklyn-beckham-david-and-victoria-family-sabotaging-wedding",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMinAFBVV95cUxQZUI4WVV3QVY3VFV1THhtT2FBdFlrSDV3TnhoZjZRV3V5OTRyNUx0QkVHLUR5X1BwanRsdVBDdnM5WEVpcE9ZQVMyOUNtNEtQbEMwcXhJa25hMGUxRXZmLUtSNDRvOUVLZi1Fd2tmcnE0MHJRdFp4Z2RjOXhjcW5LU2ZMUUx4Z21iRUdoSzJsb2t2dGxsc0dnVkhyMnk?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.npr.org/2026/01/21/nx-s1-5683820/brooklyn-beckham-david-and-victoria-family-sabotaging-wedding",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.889,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.68,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "This story is sensational and does not contribute meaningfully to the reader’s understanding, decision-making, or sense of agency. It does not provide actionable insights or deeper understanding, and does not report on solutions, improvements, innovations, or attempts to solve problems.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Brooklyn Beckham has publicly accused his parents, David and Victoria Beckham, of prioritizing their public image over family and attempting to undermine his marriage. The allegations were made in a series of social media posts, bringing the family's internal conflict into the public eye.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Trumps Greenland Threats Draw Criticism Ahead of Davos Speech",
    "domain": "business",
    "source_domain": "businessinsider.com",
    "location": "global",
    "published": "2026-01-21T09:49:51Z",
    "source": "Business Insider",
    "sources": [
      "Business Insider",
      "Financial Times"
    ],
    "domains": [
      "businessinsider.com",
      "ft.com"
    ],
    "snippets": [
      "The rich and powerful at Davos are bracing for President Donald Trump's speech. His threats against Greenland have sparked outcry from world leaders.",
      "Also in today’s newsletter: WEF weighs new location and Nestlé on sustainability"
    ],
    "image_url": "https://i.insider.com/696ffd1ce1ba468a96aa61c9?format=jpeg",
    "titles": [
      "Davos updates: Trump speech looms as Greenland threats fuel global tension",
      "FirstFT: Greenland stand-off looms over Davos"
    ],
    "url": "https://www.businessinsider.com/davos-trump-speech-wef-live-updates-jan-21-2026-1",
    "alternate_urls": [
      "https://www.ft.com/content/91b02add-eafb-4d2e-a9b0-e4d18e506219"
    ],
    "location_scope": "global",
    "link": "https://www.businessinsider.com/davos-trump-speech-wef-live-updates-jan-21-2026-1",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.949,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.679,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "snippet",
    "summary_reason": "invalid_roles",
    "headline_source": "gpt",
    "summary": "The rich and powerful at Davos are bracing for President Donald Trump's speech. His threats against Greenland have sparked outcry from world leaders.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Bulls Lakers Raptors and Suns Secure NBA Wins",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Wed, 21 Jan 2026 03:38:31 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "Sportsnet"
    ],
    "domains": [
      "globalnews.ca",
      "sportsnet.ca"
    ],
    "snippets": [
      "Josh Morrissey and Mark Scheifele scored during a St. Louis double-minor for high-sticking in the first period before Scheifele added an empty netter to seal the win.",
      "Mark Scheifele scored twice and added an assist, while Josh Morrissey also posted three points, as the Winnipeg Jets defeated the St. Louis Blues 3-1.",
      "Tyler Kleven opened the scoring with his first goal of the season, while James Reimer stopped 21 of 22 shots, leading the Ottawa Senators to a 4-1 victory over the Columbus Blue Jackets.",
      "Konsta Helenius finished with three points in only his second career NHL game, Noah Ostlund scored twice, and Peyton Krebs picked up a goal and an assist to lead the Buffalo Sabres to a 5-3 win over the Nashville Predators.",
      "Brandon Hagel scored twice and finished with three points while Nikita Kucherov dished out two assists and Andrei Vasilevskiy stopped 22 shots to elevate the Tampa Bay Lightning to a 4-1 win over the San Jose Sharks.",
      "Anton Forsberg made 28 saves in relief of an injured Darcy Kuemper and Kevin Fiala tallied a goal and an assist in the Los Angeles Kings’ 4-3 win over the New York Rangers.",
      "Lane Hutson had a goal and an assist, and Cole Caufield fired home the game-winning goal with 15 seconds left in regulation as the Montreal Canadiens topped the Minnesota Wild 4-3.",
      "Arseni Gritsyuk and Cody Glass each had a goal and an assist while Jake Allen gave up just one goal and made 21 saves to lead the New Jersey Devils to a 2-1 win over the Edmonton Oilers.",
      "Justin Hryckowian finished with a goal and two assists, Miro Heiskanen recorded three assists of his own, and Jason Robertson scored twice in a dominant 6-2 victory for the Dallas Stars over the Boston Bruins.",
      "Immanuel Quickley popped off for 40 points and 10 assists, while Scottie Barnes had 26 with seven rebounds and 11 dimes as the Toronto Raptors rolled to a 145-127 win over the Golden State Warriors.",
      "The Los Angeles Lakers’ superstar duo of Luka Doncic and LeBron James combined for 57 points, 22 rebounds, and 18 assists in a 115-107 comeback win over the Denver Nuggets.",
      "Reed Sheppard scored a team-high 21 points, and Alpren Sengun added 20 points and 13 rebounds as the Houston Rockets rallied late to defeat the San Antonio Spurs 111-106.",
      "Coby White scored 27 points and added six assists to lead the Chicago Bulls to a 138-110 win over the Los Angeles Clippers.",
      "Devin Booker dropped a team-high 27 points while Jordan Goodwin and Grayson Allen each scored 16 to lead the Phoenix Suns to a 116-110 win over the Philadelphia 76ers.",
      "Bam Adebayo led the way with 25 points and Norman Powell added 22 as the Miami Heat defeated the Sacramento Kings 130-117."
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2026/01/CP175657372.jpg?quality=65&strip=all",
    "titles": [
      "Winnipeg Jets score twice early on power play, hold on for 3-1 win over Blues",
      "NHL Highlights: Jets 3, Blues 1",
      "NHL Highlights: Senators 4, Blue Jackets 1",
      "NHL Highlights: Sabres 5, Predators 3",
      "NHL Highlights: Lightning 4, Sharks 1",
      "NHL Highlights: Kings 4, Rangers 3",
      "NHL Highlights: Canadiens 4, Wild 3",
      "NHL Highlights: Devils 2, Oilers 1",
      "NHL Highlights: Stars 6, Bruins 2",
      "NBA Highlights: Raptors 145, Warriors 127",
      "NBA Highlights: Lakers 115, Nuggets 107",
      "NBA Highlights: Rockets 111, Spurs 106",
      "NBA Highlights: Bulls 138, Clippers 110",
      "NBA Highlights: Suns 116, 76ers 110",
      "NBA Highlights: Heat 130, Kings 117"
    ],
    "url": "https://globalnews.ca/news/11621887/winnipeg-jets-score-early-on-power-play-hold-on-for-3-1-win-over-blues/",
    "alternate_urls": [],
    "location_scope": "national",
    "link": "https://globalnews.ca/news/11621887/winnipeg-jets-score-early-on-power-play-hold-on-for-3-1-win-over-blues/",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.799,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.678,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Coby White led the Chicago Bulls to a 138-110 win over the Los Angeles Clippers. The Winnipeg Jets beat the St. Louis Blues 3-1 with two goals from Mark Scheifele. The Phoenix Suns topped the Philadelphia 76ers 116-110. The Houston Rockets rallied to defeat the San Antonio Spurs 111-106. The Los Angeles Lakers overcame the Denver Nuggets 115-107, and the Toronto Raptors beat the Golden State Warriors 145-127.",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "Trump Declines to Clarify Greenland Plans Ahead of Davos Meetings",
    "domain": "business",
    "source_domain": "cnbc.com",
    "location": "national",
    "published": "Tue, 20 Jan 2026 23:01:32 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "The Guardian",
      "Globe and Mail"
    ],
    "domains": [
      "cnbc.com",
      "theguardian.com",
      "news.google.com"
    ],
    "snippets": [
      "Trump will be meeting with world leaders at the World Economic Forum in Davos, Switzerland, later this week.",
      "President also declines to offer any reassurances about his commitment to the stability of Nato alliance Donald Trump ratcheted up the uncertainty over how far he would be willing to go to acquire Greenland as he warned the Nato alliance on Tuesday that it was only as strong as the United States all",
      "Trump says ‘you’ll find out’ when asked about his ambition to annex Greenland The Globe and Mail",
      "'You'll find out,' Trump says on Greenland takeover strategy CNBC"
    ],
    "image_url": "",
    "titles": [
      "'You'll find out,' Trump says on Greenland takeover strategy",
      "‘You’ll find out’: Trump refuses to say how far he would go to seize Greenland",
      "Trump says ‘you’ll find out’ when asked about his ambition to annex Greenland - The Globe and Mail",
      "'You'll find out,' Trump says on Greenland takeover strategy - CNBC"
    ],
    "url": "https://www.cnbc.com/2026/01/20/trump-greenland-takeover-strategy.html",
    "alternate_urls": [
      "https://www.theguardian.com/us-news/2026/jan/20/trump-press-briefing-greenland",
      "https://news.google.com/rss/articles/CBMiqAFBVV95cUxNaVl4eUV0MUVKdFhtZGk5aDdXbjBKRmJQN2hnNWlXSXE1emc5TDlXdHBsYm9hOWNFdkFjMmk2UG1pVG0wbkxHYVlmZHYwZmZ5YW9YWTBWd09wT29rNzZjUXNxc1RWS0NrNEc5MnFHYjJOdW1SLVBGSHpfOF9KME4wMGVvUWdwa3c5eHJSa3d5R19EVU9GUUx0MW16MXBvVG1DZFJhTV9EMU8?oc=5",
      "https://news.google.com/rss/articles/CBMiekFVX3lxTE95ak9jRklfQzZqOXJlX3UybFBZTEZ0UnFtc3FUaHpUNTBpR19sUThmWGl2U0xzU2Mwc09PSHZ1d2dlUGFVaGtQUFpTaFZPZURBUm5qbUNXaHhPTV9XWUszemdYSlZac3doMkVwQlZxWjFqVXVhTnJxTG5n0gF_QVVfeXFMTWhQRTJVU2xQam0xa2FBZThHWlFVaGN4bFBUOVQ5NVJyVGlYMzZoSWlyemhqeEhpdWtNLVhQWHBHbkhFbU5kLU9lQk1MRjFlenRTRnlrSzVUb3FCVUZyTGsySHlWTl81UlViOU8zRVNWVTdQWWE1SGo1ZUFiNXhTbw?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.cnbc.com/2026/01/20/trump-greenland-takeover-strategy.html",
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.703,
      "consensus": 0.789,
      "constructiveness": 0.017,
      "proximity": 0.5
    },
    "score": 0.675,
    "constructiveness_score": 0.017,
    "constructiveness_reason": "keywords (1): strategy; semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Donald Trump declined to clarify his plans regarding a potential Greenland takeover, stating 'you'll find out' when questioned. He also did not reassure about his commitment to NATO's stability ahead of meetings with world leaders at the World Economic Forum in Davos.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "NASA Astronaut Suni Williams Retires After 27 Years and Three ISS",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Wed, 21 Jan 2026 04:50:51 EST",
    "source": "Phys.org",
    "sources": [
      "Phys.org",
      "NASA"
    ],
    "domains": [
      "phys.org",
      "nasa.gov"
    ],
    "snippets": [
      "NASA's Suni Williams—one of two astronauts stuck for months at the International Space Station—has retired.",
      "After 27 years of service, NASA astronaut Suni Williams retired from the agency, effective Dec. 27, 2025. Williams completed three missions aboard the International Space Station, setting numerous human spaceflight records throughout her career. “Suni Williams has been a trailblazer in human spacefl"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2026/nasa-astronaut-who-was.jpg",
    "titles": [
      "NASA astronaut who was stuck at the space station for months retires within a year of returning",
      "NASA Astronaut Suni Williams Retires"
    ],
    "url": "https://phys.org/news/2026-01-nasa-astronaut-stuck-space-station.html",
    "alternate_urls": [
      "https://www.nasa.gov/news-release/nasa-astronaut-suni-williams-retires/"
    ],
    "location_scope": "global",
    "link": "https://phys.org/news/2026-01-nasa-astronaut-stuck-space-station.html",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.95,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.674,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "NASA astronaut Suni Williams retired on December 27, 2025, after 27 years of service and three missions aboard the International Space Station. Williams set multiple human spaceflight records during her career.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Buster Posey Inducted Into 2026 Baseball Hall of Fame",
    "domain": "sports",
    "source_domain": "cbssports.com",
    "location": "national",
    "published": "Wed, 21 Jan 2026 00:01:41 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Bleacher Report",
      "Yahoo Sports"
    ],
    "domains": [
      "cbssports.com",
      "news.google.com",
      "sports.yahoo.com"
    ],
    "snippets": [
      "Jon Lester, Brett Gardner, Kyle Seager and Ryan Zimmerman are among the other new candidates",
      "Who Got Snubbed from 2026 Baseball Hall of Fame Inductees? Bleacher Report",
      "One of MLB’s most well-rounded players will be honored in Cooperstown, but not without a little controversy.",
      "Three-time World Series winner Buster Posey highlights the newcomers on the 2027 Hall of Fame ballot."
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2026/01/14/186e411c-7eac-4cb5-9a75-0dae93800006/posey-getty.png",
    "titles": [
      "Who will be on 2027 Baseball Hall of Fame ballot? Buster Posey headlines newcomers",
      "Who Got Snubbed from 2026 Baseball Hall of Fame Inductees? - Bleacher Report",
      "Two center field stars inducted into 2026 class at National Baseball Hall of Fame class",
      "Who's on the 2027 Baseball Hall of Fame ballot? MVP catcher debuts"
    ],
    "url": "https://www.cbssports.com/mlb/news/baseball-hall-of-fame-ballot-2027-buster-posey-jon-lester/",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMimgFBVV95cUxNLTdpSGJJV2dQLW5UZVJFMF9JU2xUQ21OeWhBbkQ1WXdlcldRV2JfcklZWV9PRlNjclJ2SHkyLXBqSkpjcTV1NmxEbzBOX2pLTW44TEoyQkotTE5wYmpZRjJEdE1BM25UOC1UMG91NVJ3anpSZUphcVJqeHFwNEttYXlOcWo1SHZpOXp6dmhmNW81dkVvd2NuZGJ3?oc=5",
      "https://sports.yahoo.com/articles/two-center-field-stars-inducted-235115020.html",
      "https://sports.yahoo.com/articles/whos-2027-baseball-hall-fame-231616179.html"
    ],
    "location_scope": "national",
    "link": "https://www.cbssports.com/mlb/news/baseball-hall-of-fame-ballot-2027-buster-posey-jon-lester/",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.723,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.673,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Buster Posey has been selected for induction into the 2026 Baseball Hall of Fame. Other notable new candidates, including Jon Lester, Brett Gardner, Kyle Seager, and Ryan Zimmerman, were not chosen for induction this year.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "U.S. Treasury Secretary Dismisses Danish Bond Sell Off Concerns",
    "domain": "business",
    "source_domain": "cnbc.com",
    "location": "national",
    "published": "Wed, 21 Jan 2026 08:58:04 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "The Guardian"
    ],
    "domains": [
      "cnbc.com",
      "theguardian.com",
      "news.google.com"
    ],
    "snippets": [
      "U.S. treasury secretary Scott Bessant addressed reporters at a press conference at the World Economic Forum on Wednesday.",
      "Scott Bessent replied to a question on Danish investments by saying that ‘Denmark’s investment in US treasury bonds, like Denmark itself, is irrelevant’ Nordic correspondent in Copenhagen As Greenland, Denmark and much of the world braces for Donald Trump’s address to Davos, Alaskan Inuit representa",
      "Scott Bessent says U.S. is unconcerned by Treasury sell-off over Greenland, calls Denmark ‘irrelevant’ CNBC"
    ],
    "image_url": "",
    "titles": [
      "Scott Bessent says U.S. is unconcerned by Treasury sell-off over Greenland, calls Denmark ‘irrelevant’",
      "US Treasury secretary calls Denmark ‘irrelevant’ ahead of Trump speech at Davos – Europe live",
      "Scott Bessent says U.S. is unconcerned by Treasury sell-off over Greenland, calls Denmark ‘irrelevant’ - CNBC"
    ],
    "url": "https://www.cnbc.com/2026/01/21/bessent-davos-denmark-greenland-treasuries.html",
    "alternate_urls": [
      "https://www.theguardian.com/world/live/2026/jan/21/europe-donald-trump-davos-speech-greenland-denmark-latest-updates",
      "https://news.google.com/rss/articles/CBMihgFBVV95cUxNV3NkX1pTSlZWbUxCSHNlM1Q5MmFDZ3p2b0lodkV3Y2prUzczQ0E4NUUtZUg0OXdKTFBidW1BZnJPejV3R21JUnV6dHVVZ1dVR1B4Wm9qbmNMdng0T0RyVERnQU5qaEl1cDRPNXhodkZCSmExUHFLaXNMLXdOWlQ4TU5TZUxzUdIBiwFBVV95cUxPZ180VGlNX1Foc3l2VWc2RlVvRm5ZZlhrd1hLYlhqVVl2RkxPenRFb241aFMwUlVkMTZxaFU5bHNWeFkwWXYxajlHZHJXWnRDQm1CcFVQOWhHWmRwbXFDdWJ1UldCamwybWZWQUsxQmlfbGduQS1PUHpMb1IyenhSNmo5NHp4ZUtjZmk4?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.cnbc.com/2026/01/21/bessent-davos-denmark-greenland-treasuries.html",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.927,
      "consensus": 0.611,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.671,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "U.S. Treasury Secretary Scott Bessent stated at the World Economic Forum that Denmark's investment in U.S. Treasury bonds is 'irrelevant' and expressed no concern over a potential Treasury sell-off related to Greenland.",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "Gold Hits Record High Amid Trumps Greenland Tariff Threats",
    "domain": "business",
    "source_domain": "cnbc.com",
    "location": "national",
    "published": "Wed, 21 Jan 2026 07:23:15 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "MarketWatch"
    ],
    "domains": [
      "cnbc.com",
      "marketwatch.com",
      "news.google.com"
    ],
    "snippets": [
      "Gold prices climbed to another record of over $4,800 on Wednesday, extending its sharp rally.",
      "Asia-Pacific markets mostly fell, mirroring overnight losses on Wall Street after President Donald Trump escalated rhetoric over Greenland.",
      "Retail investors don’t welcome the prospect of a prolonged trade war, but don’t freak out when you check your 401(k).",
      "Gold climbs to new high as Trump’s Greenland-linked tariff threats rattle Asia markets CNBC"
    ],
    "image_url": "",
    "titles": [
      "Gold breaks new record on Greenland tariff threats — $7,000 level on the cards",
      "Gold climbs to new high as Trump’s Greenland-linked tariff threats rattle Asia markets",
      "Trump’s Greenland tariff threats rattle investors: The stakes are higher this time around",
      "Gold climbs to new high as Trump’s Greenland-linked tariff threats rattle Asia markets - CNBC"
    ],
    "url": "https://www.cnbc.com/2026/01/21/gold-prices-surge-record-4800-safe-haven-demand.html",
    "alternate_urls": [
      "https://www.cnbc.com/2026/01/21/asia-pacific-markets-nikkei-225-kospi-nifty-50-wall-street-trump-greenland-tariffs.html",
      "https://www.marketwatch.com/story/trump-threatens-more-tariffs-investors-gasp-dont-freak-out-over-your-401-k-d94aec34?mod=mw_rss_topstories",
      "https://news.google.com/rss/articles/CBMiuwFBVV95cUxNNUpkV1JTcjQzdDF2bExFZzdkcGtSakNjVTI3ZTc4djc3YTEzdm1OaF9HQWJLT3p1bldGM2tKdnlMQndCcE5fQUt5QWNIVkVHZnRCci1qa3l0UmpjTVFjLXNuRjh4TUFnVUpqRjd6RVdnNjRkVzBhQU1kcElJSmdHNkM4RDU3c212YkxkN3E1cmNjZjRkZW9IQkZnX2xuTXh5VTREQ3VIVnNDM2d4Vi1iaGFyc3JlM09nZ3p30gHAAUFVX3lxTFAzb19DMURWSWFOZm10ZWI2SDVEZkFZYTFCb3JsNWZCME1GNU1tcVpBWG9TVXA2X2tmdnF6RnMyb05Fb2Fzc1Z1Uk42U3FwaTdSMGdRWG5pS1JCMklHN2R2X2ViZ3F4dGZ0MFkyTjh1WG9pREtKUnhhWEZ4b3FuNmd4M2JaQzE5SzV3bG9qdzN0MHZSZXlfQnNzSEI1bTBWM1Z2TENqeDROM0c3R2hseExWTHA2TTFDMndGMWdGcnB3aQ?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.cnbc.com/2026/01/21/gold-prices-surge-record-4800-safe-haven-demand.html",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.887,
      "consensus": 0.611,
      "constructiveness": 0.05,
      "proximity": 0.5
    },
    "score": 0.67,
    "constructiveness_score": 0.05,
    "constructiveness_reason": "semantic: pos_sim=0.20, neg_sim=0.00; semantic_boost=0.05; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "snippet",
    "summary_reason": "invalid_roles",
    "headline_source": "gpt",
    "summary": "Gold prices climbed to another record of over $4,800 on Wednesday, extending its sharp rally.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "UN Warns Billions at Risk from Global Water Overuse and Pollution",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Tue, 20 Jan 2026 19:03:19 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "The Guardian"
    ],
    "domains": [
      "news.google.com",
      "theguardian.com"
    ],
    "snippets": [
      "Looming water supply 'bankruptcy' puts billions at risk, UN report warns Reuters",
      "Overuse and pollution must end urgently as no one knows when whole system might collapse, says expert The world has entered an era of “global water bankruptcy” that is harming billions of people, a UN report has declared. The overuse and pollution of water must be tackled urgently, the report’s lead"
    ],
    "image_url": "",
    "titles": [
      "Looming water supply 'bankruptcy' puts billions at risk, UN report warns - Reuters",
      "Era of ‘global water bankruptcy’ is here, UN report says"
    ],
    "url": "https://news.google.com/rss/articles/CBMizAFBVV95cUxPWFR3Znl1M0gxLThORWw0MDcyUFNhSW9IZDVVZXJFUjlvdFhnc0hqTERWQktZc0NLazZ4eEY1aG95eElOMUlCRHN4dl9kdnNMUmpsU0RUUGFab1luVEZQZjFzQ3hVMUVTckJkUGxHc0dEcUJkM2NPVEJlSHpvaF9LLVZmazJVMGwyX3pLcGwtbkhyeXdpSGM0bVFXbGducTJFNlFlTTZ0c2lRN0otZFFBeE9OM1B3bTlsbTFDeW03RG9peTFWUXJlOWQ0RE0?oc=5",
    "alternate_urls": [
      "https://www.theguardian.com/environment/2026/jan/20/era-of-global-water-bankruptcy-is-here-un-report-says"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMizAFBVV95cUxPWFR3Znl1M0gxLThORWw0MDcyUFNhSW9IZDVVZXJFUjlvdFhnc0hqTERWQktZc0NLazZ4eEY1aG95eElOMUlCRHN4dl9kdnNMUmpsU0RUUGFab1luVEZQZjFzQ3hVMUVTckJkUGxHc0dEcUJkM2NPVEJlSHpvaF9LLVZmazJVMGwyX3pLcGwtbkhyeXdpSGM0bVFXbGducTJFNlFlTTZ0c2lRN0otZFFBeE9OM1B3bTlsbTFDeW03RG9peTFWUXJlOWQ0RE0?oc=5",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.63,
      "consensus": 0.591,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.638,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story raises awareness about a significant global issue, providing useful information about the potential risks of water supply bankruptcy. However, it does not report on solutions or improvements, limiting its constructiveness.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "A UN report warns that the world is facing 'global water bankruptcy,' with overuse and pollution threatening water supplies for billions of people. The report calls for urgent action to address these issues to prevent further harm and potential system collapse.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Syria Announces Ceasefire Urges Kurdish Forces to Integrate",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Tue, 20 Jan 2026 16:36:00 GMT",
    "source": "Al Arabiya",
    "sources": [
      "Al Arabiya",
      "CBC News"
    ],
    "domains": [
      "news.google.com",
      "cbc.ca"
    ],
    "snippets": [
      "US signals end of military support for Syria’s Kurdish forces, urges integration Al Arabiya English",
      "Syria on Tuesday announced a ceasefire with Kurdish forces it has seized swathes of territory from in the northeast and gave them four days to agree on integrating into the central state, which their main ally, the United States, urged them to accept."
    ],
    "image_url": "",
    "titles": [
      "US signals end of military support for Syria’s Kurdish forces, urges integration - Al Arabiya English",
      "Syria gives Kurdish-led forces 4 days to accept integration as U.S. signals end of support"
    ],
    "url": "https://news.google.com/rss/articles/CBMi0wFBVV95cUxOc1dZUzFXU0tSaVhzNzA5NlZpQTktNmFSUnJXbGc1WHBxY3FMQ1NDWEpPMDhYeW80d21rWjVaSElPb013TS1PVzU0WUdZMmFCU1BydExVWk40LUxSaExBYmdyY0lOZW5JdHgtdFRacnVaS0x3UENwUmt3NV9sUzIwanZnTGtoRjY2dXZNZXlWX2t4eDBfNE11ZUNVMmo2SWpLNGg1N3VoNVIyemZOdUZnWGtaWjZfem5oRFJIMU90UFRLdmY3bnVCZVJOTFAtQXdKWkxB0gHYAUFVX3lxTFB2Y0twN1hOYm96cW80d0o0VXhpMnlhMWxEX3FMeFE2ekZkZUx0RzBJZlBGSzhoRWNQQVBWQWFVakR2YzFUb2E1TWZmenVGUmEzeGpwclhOWEFFalBFZDN4NjJtT211RVFPaUdaQi1qX1NqcWN2SnExX2JnTVR1WTVkZHdxSGlmcVhXbm8tWjJ4UzJKM0FPdENVY2VYSmdCWHhYY285UFlUM1gtZndNa3pKVGtraVd5Vnl0NGVtWWNMaHVKREdObVNWckVhX1IxZGExbnI0cDZmYg?oc=5",
    "alternate_urls": [
      "https://www.cbc.ca/news/world/syria-kurdish-forces-sdf-united-states-9.7053060?cmp=rss"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMi0wFBVV95cUxOc1dZUzFXU0tSaVhzNzA5NlZpQTktNmFSUnJXbGc1WHBxY3FMQ1NDWEpPMDhYeW80d21rWjVaSElPb013TS1PVzU0WUdZMmFCU1BydExVWk40LUxSaExBYmdyY0lOZW5JdHgtdFRacnVaS0x3UENwUmt3NV9sUzIwanZnTGtoRjY2dXZNZXlWX2t4eDBfNE11ZUNVMmo2SWpLNGg1N3VoNVIyemZOdUZnWGtaWjZfem5oRFJIMU90UFRLdmY3bnVCZVJOTFAtQXdKWkxB0gHYAUFVX3lxTFB2Y0twN1hOYm96cW80d0o0VXhpMnlhMWxEX3FMeFE2ekZkZUx0RzBJZlBGSzhoRWNQQVBWQWFVakR2YzFUb2E1TWZmenVGUmEzeGpwclhOWEFFalBFZDN4NjJtT211RVFPaUdaQi1qX1NqcWN2SnExX2JnTVR1WTVkZHdxSGlmcVhXbm8tWjJ4UzJKM0FPdENVY2VYSmdCWHhYY285UFlUM1gtZndNa3pKVGtraVd5Vnl0NGVtWWNMaHVKREdObVNWckVhX1IxZGExbnI0cDZmYg?oc=5",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.588,
      "consensus": 0.591,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.625,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about a shift in US foreign policy and its potential implications. However, it does not offer actionable insights or highlight progress or solutions, limiting its constructiveness.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Syria has announced a ceasefire with Kurdish forces in the northeast, giving them four days to agree to integration into the central state. The United States, their main ally, has urged the Kurdish forces to accept the offer and signaled an end to military support.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Hubble Nets Menagerie of Young Stellar Objects",
    "domain": "science",
    "source_domain": "nasa.gov",
    "location": "global",
    "published": "Tue, 20 Jan 2026 15:54 GMT",
    "source": "NASA EO",
    "sources": [
      "NASA EO",
      "NASA"
    ],
    "domains": [
      "nasa.gov"
    ],
    "snippets": [
      "A bright reflection nebula shares the stage with a protostar and planet-forming disk in this Hubble image.",
      "A disparate collection of young stellar objects bejewels a cosmic panorama in the star-forming region NGC 1333 in this new image from NASA’s Hubble Space Telescope. To the left, an actively forming star called a protostar casts its glow on the surrounding gas and dust, creating a reflection nebula."
    ],
    "image_url": "https://www.nasa.gov/wp-content/uploads/2026/01/hubble-ngc-1333-j521025-3117-2flat-cont-final.jpg",
    "titles": [
      "Hubble Nets Menagerie of Young Stellar Objects"
    ],
    "url": "https://www.nasa.gov/image-detail/hubble-ngc-1333-j521025-3117-2flat-cont-final/",
    "alternate_urls": [
      "https://www.nasa.gov/image-article/hubble-nets-menagerie-of-young-stellar-objects/"
    ],
    "location_scope": "global",
    "link": "https://www.nasa.gov/image-detail/hubble-ngc-1333-j521025-3117-2flat-cont-final/",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.577,
      "consensus": 0.571,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.558,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "skipped",
    "summary_reason": "skipped_due_to_budget",
    "headline_source": "",
    "summary": "",
    "is_trending": false,
    "trending_score": 0.0
  }
]