[
  {
    "title": "Osaka Defeats Gauff to Reach First Grand Slam Quarterfinal Since 2021",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 01 Sep 2025 23:09:27 GMT",
    "source": "BBC",
    "sources": [
      "ESPN",
      "Sky Sports",
      "BBC",
      "The Guardian",
      "Sports Illustrated",
      "Sportsnet"
    ],
    "domains": [
      "www.theguardian.com",
      "www.sportsnet.ca",
      "www.bbc.com",
      "www.skysports.com",
      "www.espn.com",
      "news.google.com"
    ],
    "snippets": [
      "Two-time US Open champion Naomi Osaka earns her most impressive win since returning to the tour by knocking out third seed Coco Gauff.",
      "Naomi Osaka eliminated Coco Gauff 6-3, 6-2 at the US Open on Monday to reach her first major quarterfinal since 2021.",
      "<ul><li><p>Four-times grand-slam champion wins 6-3, 6-2</p></li><li><p>Osaka has always won title after reaching last eight</p></li></ul><p>Naomi Osaka turned back the clock on Monday in New York, producing the cleanest big‑stage performance of her comeback from maternity leave to overwhelm Coco Gau",
      "<a href=\"https://news.google.com/rss/articles/CBMilAFBVV95cUxQOUltZFdyd2pmZHpKLXlvV3hmYl9WMFhPT2laclEyVjNoUmR6Z1NTek9MQ3VJa1ZSRDBvUG4xd0RCczFOaFNjOTNRQ3FtWWRRZjBjOWRSUVNyeGxuR1ZIUUhLZEVWZnZJMkstbEFvMGZYOTctYjJfOUhEbThUNW90cUVRLW9WeGhSYm1PV3R3alpsMmxG?oc=5\" target=\"_blank\">Naomi Osaka Upsets Coco Gau",
      "Naomi Osaka put on a faultless performance to book her place in the US Open quarter-finals with a 6-3 6-2 win over the tournament's third seed and home favourite Coco Gauff on Monday.",
      "<p>Naomi Osaka eliminated Coco Gauff 6-3, 6-2 at the U.S. Open with a far more confident and consistent brand of tennis Monday to reach her first Grand Slam quarterfinal in more than 4 1/2 years.</p>"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/40d2/live/65469e70-876c-11f0-a4c8-d381adcec3ce.jpg",
    "titles": [
      "'The moments I play tennis for' - Osaka beats Gauff at US Open",
      "Osaka ousts Gauff at US Open, returns to quarters",
      "Naomi Osaka dominates Coco Gauff to power into US Open quarter-finals",
      "Naomi Osaka Upsets Coco Gauff in Highly-Anticipated U.S. Open Rematch - Sports Illustrated",
      "Faultless Osaka beats Gauff to book US Open quarter-final spot",
      "Osaka eliminates Gauff to reach US Open quarterfinals"
    ],
    "score_components": {
      "magnitude": 0.986,
      "recency": 0.959,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.837,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Naomi Osaka defeated Coco Gauff 6-3, 6-2 at the US Open, reaching her first Grand Slam quarterfinal since 2021. This victory marks Osaka's most significant win since her return to the tour, showcasing a dominant performance against the third seed.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Nestlé Fires CEO Freixe Over Conduct, Names Navratil New Chief",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 01 Sep 2025 22:00:17 GMT",
    "source": "BBC",
    "sources": [
      "Financial Times",
      "Business Insider",
      "Forbes",
      "MarketWatch",
      "BBC",
      "The Guardian",
      "Axios"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com",
      "www.marketwatch.com",
      "www.businessinsider.com",
      "www.forbes.com",
      "news.google.com",
      "www.ft.com"
    ],
    "snippets": [
      "The food giant says Laurent Freixe had an \"undisclosed\" relationship with \"a direct subordinate\".",
      "<a href=\"https://news.google.com/rss/articles/CBMiiwFBVV95cUxNZjZYNnVqb25tcGUzeTZkeHN3REFlckdRVUhNUW9uQldPUWo0Nms2cGJ0TmdXdmtxWFk2NThQSGZxSmRLaWtKcnpmQUozdS1tR2tJUmZTUUJOYlR5MnM1clZNc2lRQVVHYkd2ZUhITExLV0VvN2N5T1JfOWhLRjBuN0ZQZ2dRQ203MDRB?oc=5\" target=\"_blank\">Nestlé fires CEO Laurent Freixe over \"r",
      "Swiss consumer goods group appoints Philipp Navratil as chief after finding its code of conduct was breached",
      "<p>Swiss multinational finds Laurent Freixe breached code of conduct as it names Philipp Navratil as his replacement</p><p>Nestlé has dismissed its chief executive, Laurent Freixe, after an investigation into an “undisclosed romantic relationship” with a subordinate that was found to have breached i",
      "Philipp Navratil, chief executive of Nestlé Nespresso, was named Freixe’s successor, effective immediately.",
      "Nestlé says it has dismissed its CEO Laurent Freixe after he failed to disclose a romantic relationship with a direct subordinate.",
      "Nestlé SA has its third chief executive in little more than a year, after the Swiss-based food conglomerate fired CEO Laurent Freixe on Monday due to an improper romantic relationship with a subordinate."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/4271/live/bebf9420-875d-11f0-ac15-0be71ebd833b.png",
    "titles": [
      "Nestle fires boss after romantic relationship with employee",
      "Nestlé fires CEO Laurent Freixe over \"romantic relationship\" with employee - Axios",
      "Nestlé dismisses CEO Laurent Freixe after probe into ‘romantic relationship’",
      "Nestlé sacks CEO over ‘undisclosed romantic relationship’",
      "Nestlé Ousts CEO Laurent Freixe After ‘Undisclosed Romantic Relationship’ With Subordinate",
      "Nestlé says it dismissed CEO Laurent Freixe over an undisclosed romantic relationship with his direct subordinate",
      "Nestlé fires CEO Laurent Freixe after less than a year over workplace affair"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.936,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.837,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Nestlé dismissed CEO Laurent Freixe for failing to disclose a romantic relationship with a direct subordinate, breaching the company's code of conduct. Philipp Navratil, previously of Nestlé Nespresso, was appointed as the new CEO, marking the company's third chief executive change in just over a year.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Afghanistan Earthquake Kills 600, Injures 1,300 Near Pakistan Border",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Mon, 01 Sep 2025 02:52:38 -0400",
    "source": "NPR",
    "sources": [
      "Al Jazeera",
      "Washington Post",
      "New York Times",
      "The Guardian",
      "NPR",
      "Axios"
    ],
    "domains": [
      "www.theguardian.com",
      "www.npr.org",
      "www.washingtonpost.com",
      "www.nytimes.com",
      "www.aljazeera.com",
      "news.google.com"
    ],
    "snippets": [
      "The 6.0 magnitude quake late Sunday hit a series of towns in the province of Kunar, near the city of Jalalabad in neighboring Nangahar province, causing extensive damage.",
      "Magnitude 6 tremor hits eastern provinces of Kunar and Nangarhar, and government spokesman warns toll could rise.",
      "<a href=\"https://news.google.com/rss/articles/CBMiggFBVV95cUxQc05iRnZ2aGFBbVQ2aTJPZ05wNkd2U2VVbTUtV1Q2QWZYZ09xVkNncXhMWVIwNzRlWklZaUVWcEFuSDA0a2Y0aTdJX2xJaFpYbUFlSlpwSnFnR2UxRmQzYmJIUVg5Wnh1blFrVF9lN1V2VVZteHczVExCdnVoZDJ4OGdn?oc=5\" target=\"_blank\">Hundreds killed after 6.0-magnitude earthquake stri",
      "<p>Rescuers try to reach people trapped under mud and debris while hampered by destroyed roads and steep terrain</p><p>A powerful earthquake that hit mountainous eastern Afghanistan has left at least 800 people confirmed dead and injured about 2,500, Taliban officials have said as rescuers struggled",
      "The 6.0-magnitude earthquake that struck near Jalalabad injured 2,800 others, the Taliban-run government said, and was felt as far as neighboring Pakistan.",
      "The quake, near the border with Pakistan, injured more than 2,500 people in mountainous areas that rescue workers took hours to reach.",
      "Hundreds of people were killed and more than 2,500 were injured, according to the Taliban government, and the death toll was expected to rise.",
      "Rescue workers struggled to reach isolated areas in eastern Afghanistan after a magnitude 6.0 quake."
    ],
    "image_url": "",
    "titles": [
      "An earthquake devastates eastern Afghanistan, killing more than 800 people",
      "At least 800 people killed as earthquake hits eastern Afghanistan",
      "Hundreds killed after 6.0-magnitude earthquake strikes Afghanistan - Axios",
      "At least 800 dead after magnitude-6 earthquake hits eastern Afghanistan",
      "More than 800 dead after earthquake hits eastern Afghanistan, Taliban say",
      "Afghanistan Earthquake Leaves More Than 800 Dead",
      "What to Know About the Earthquake in Afghanistan",
      "An Earthquake Killed Hundreds in Afghanistan"
    ],
    "score_components": {
      "magnitude": 0.986,
      "recency": 0.698,
      "consensus": 1.0,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.82,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A magnitude 6.0 earthquake struck eastern Afghanistan near Jalalabad and the Pakistan border late Sunday, killing over 600 people and injuring more than 1,300, as reported by the Taliban-run Interior Ministry. The quake caused extensive damage across the mountainous provinces of Kunar and Nangahar, destroying several villages. The death toll is expected to rise as rescue efforts continue.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "EU Commission Plane Lands with Maps Amid Suspected Russian GPS Jamming",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 01 Sep 2025 18:15:40 GMT",
    "source": "BBC",
    "sources": [
      "Financial Times",
      "CNBC",
      "New York Times",
      "Deutsche Welle",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.dw.com",
      "www.nytimes.com",
      "www.cnbc.com",
      "www.ft.com"
    ],
    "snippets": [
      "The European Commission said the plane's navigation was disrupted in Bulgaria on Sunday.",
      "Ursula von der Leyen's flight en route to Bulgaria was targeted with navigation interference, which the EU says was possibly deliberately done by Russia.",
      "The European Union said Russia was suspected of jamming the GPS system of a plane carrying European Commission President Ursula von der Leyen to Bulgaria.",
      "Officials suspect jamming operation forced jet carrying European Commission president to land in Bulgaria using paper maps",
      "The Bulgarian authorities believe that Russia disrupted navigation signals that would have been used by a plane carrying Ursula von der Leyen, European officials said."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/30c8/live/b0bf99f0-8722-11f0-95ce-ab02c3c61297.jpg",
    "titles": [
      "EU chief von der Leyen's plane hit by suspected Russian GPS jamming",
      "EU chief plane hit by suspected Russian GPS jamming",
      "Plane carrying EU leader hit with suspected Russian GPS interference",
      "Von der Leyen’s plane hit by suspected Russian GPS interference",
      "Russia Suspected of Jamming GPS for E.U. Leader’s Plane, Officials Say"
    ],
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.866,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.802,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The European Commission reported that a plane carrying President Ursula von der Leyen to Bulgaria experienced navigation disruption due to suspected GPS jamming on Sunday. The EU and Bulgarian authorities suspect Russia was behind the interference, which forced the aircraft to land using paper maps. The situation is under investigation.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump to Award Giuliani Presidential Medal of Freedom",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 01 Sep 2025 21:21:48 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian",
      "Axios",
      "ABC News"
    ],
    "domains": [
      "www.theguardian.com",
      "abcnews.go.com",
      "news.google.com",
      "www.bbc.com"
    ],
    "snippets": [
      "America's highest civilian honour is awarded to those with \"exceptionally meritorious contributions\" to society.",
      "<a href=\"https://news.google.com/rss/articles/CBMif0FVX3lxTE0xLTZwZG9xRnIzQURiakQxa3gwaTlEbEtVR2tHRUxtWlNTN19hZm5XTTFmbGtwQ3k1VC1ES0tzc0lKZjhoRWIyYlJ5VGtYdlZ3elR0SGt6MlM0ZTA3dHdNSUJhQTNxV3VwX0hXRW84V1F0Z2NIVUY5dzFKYUtodUU?oc=5\" target=\"_blank\">Trump says he'll honor Giuliani with Presidential Medal ",
      "President Donald Trump begins the week with a clear public schedule on Labor Day.",
      "<p>Former NYC mayor was sanctioned by courts and disbarred for amplifying false claims about the 2020 election</p><p>Donald Trump said Monday he will award Rudy Giuliani the Presidential Medal of Freedom, the nation’s highest civilian honor, two days after his longtime political ally was seriously i"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/99e8/live/73eeeec0-8774-11f0-9ba5-971e818a6b8b.jpg",
    "titles": [
      "Rudy Giuliani to receive Presidential Medal of Freedom, Trump says",
      "Trump says he'll honor Giuliani with Presidential Medal of Freedom - Axios",
      "Trump admin live updates: Rudy Giuliani to receive Presidential Medal of Freedom",
      "Trump says he will award Rudy Giuliani the Presidential Medal of Freedom"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.924,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.781,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Donald Trump announced he will award Rudy Giuliani, the former NYC mayor, the Presidential Medal of Freedom. Giuliani, who was disbarred and sanctioned for spreading false claims about the 2020 election, is recognized for his contributions to society, marking a significant honor despite his controversial actions.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Matthew Stafford Expected to Start Season Opener Despite Back Injury",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 1 Sep 2025 19:00:13 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sports Illustrated",
      "Yahoo Sports"
    ],
    "domains": [
      "www.usatoday.com",
      "www.espn.com",
      "news.google.com"
    ],
    "snippets": [
      "Rams quarterback Matthew Stafford, who missed time with an aggravated disk in his back, is expected to start the season opener against the Texans.",
      "Matthew Stafford has dealt with a back injury during the 2025 NFL offseason. Sean McVay expects the veteran to play in Week 1.",
      "<a href=\"https://news.google.com/rss/articles/CBMijgFBVV95cUxOajZYYkFvQUgyM1o3OWdWVi1DTUg2TVRNZHR3QU5EMEFtTUMtUDQwcmV3TC13ajB5a0ZkTkZiWGdtRXBGU2NxbTk2S194UmV1U3FjSTF4RGJTblZoRnA2X1dhWjROSTd3Y09NRTd0X29hUzVmT2ZvaHJjcmVCdGxGWHVHNzFCTHFidVozMG1n?oc=5\" target=\"_blank\">Sean McVay Gives Matthew Stafford's"
    ],
    "image_url": "",
    "titles": [
      "Rams expect Stafford to start Sunday vs. Texans",
      "Matthew Stafford will start vs Texans, Sean McVay says: 'He'll be good'",
      "Sean McVay Gives Matthew Stafford's Week 1 Status for Rams vs. Texans - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.976,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.757,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Rams quarterback Matthew Stafford, who has been dealing with a back injury during the offseason, is expected to start in the season opener against the Texans, according to coach Sean McVay.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Bill Belichick Debuts as North Carolina Coach Against TCU",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Mon, 01 Sep 2025 22:28:09 +0000",
    "source": "CBS Sports",
    "sources": [
      "Yahoo Sports",
      "CBS Sports",
      "Sports Illustrated"
    ],
    "domains": [
      "www.cbssports.com",
      "www.on3.com",
      "news.google.com"
    ],
    "snippets": [
      "SportsLine's computer model simulated TCU vs. UNC 10,000 times and released its college football best bets for Monday when Bill Belichick makes his coaching debut at North Carolina",
      "SportsLine expert Mike Tierney has revealed his North Carolina vs. TCU picks in the Week 1 matchup as Tar Heels coach Bill Belichick makes his collegiate debut",
      "SportsLine's model simulated North Carolina vs. TCU 10,000 times and released its best same-game parlay",
      "TCU vs. North Carolina concludes the Week 1 college football schedule on Monday, and bettors can use college football promos at the top CFB betting sites and CFB betting apps",
      "After winning six Super Bowls as the New England Patriots head coach, Bill Belichick makes his debut on the collegiate level. After a year away from the NFL game, Belichick is back in football and accepted the North Carolina job this winter following Mack Brown’s dismissal. Now the eyes of the footb",
      "<a href=\"https://news.google.com/rss/articles/CBMikgFBVV95cUxPdHc5Y0s1V2txczhqN3k3VWZwVElZR204bE9Sd0JYWlFmQlB6dFBEOWloNE94QkV3b0pzOUdEczBIZzEyQ185alU2LVpNMnZEZGxYT3lTN01nNE4yUEplVnVmakhSMTNPUm5NdTlfTE9Ia0xzeVlSeFFHQTJJYWstOUFaQ2V0MWx1bnlzdFExbE9EZw?oc=5\" target=\"_blank\">North Carolina vs. TCU score "
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/01/fdb558ea-82ef-4613-a7ad-8a29f1abb9cc/bill-belichick-getty.jpg",
    "titles": [
      "North Carolina vs. TCU picks: Model locks in free college football predictions for Bill Belichick's UNC debut",
      "North Carolina vs. TCU prediction, odds for Bill Belichick debut: 2025 Week 1 CFB picks by expert on 12-2 roll",
      "North Carolina vs. TCU SGP picks, CFB odds: Model's free Week 1 college football bets for Bill Belichick debut",
      "Best betting apps, promos, sites for North Carolina vs. TCU: How and where to bet on Bill Belichick debut",
      "TCU at North Carolina live updates: Latest score, highlights from Bill Belichick’s collegiate debut",
      "North Carolina vs. TCU score prediction by expert football model - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.965,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.737,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Bill Belichick made his collegiate coaching debut for North Carolina in a Week 1 college football matchup against TCU. Prior to the game, SportsLine simulated the match 10,000 times, offering betting insights and predictions. Belichick, who won six Super Bowls with the New England Patriots, returned to coaching at North Carolina after Mack Brown's dismissal. The game concluded the Week 1 college football schedule, attracting significant attention from bettors and fans alike.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Scholars Group Accuses Israel of Genocide in Gaza, Israel Condemns Claim",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 01 Sep 2025 17:22:13 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Washington Post",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.washingtonpost.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The world's leading association of genocide scholars cited several actions by Israel, including attacks on the healthcare sector and the killing of children.",
      "<p>International Association of Genocide Scholars resolution backed by 86% of members who voted</p><p>The world’s leading genocide scholars’ association has backed a resolution stating that Israel’s actions in Gaza meet the legal definition of the crime.</p><p>Out of the International Association of",
      "Israel’s foreign ministry called the resolution “disgraceful,” but it added to a growing chorus from rights groups concluding that Israel is committing genocide."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/5245/live/04a00ae0-8756-11f0-ac15-0be71ebd833b.jpg",
    "titles": [
      "Israel committing genocide in Gaza, world's leading experts say",
      "Israel committing genocide in Gaza, world’s top scholars on the crime say",
      "Israel is committing genocide in Gaza, leading scholars’ association says"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.85,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.731,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The International Association of Genocide Scholars passed a resolution, supported by 86% of voting members, stating that Israel's actions in Gaza, including attacks on healthcare and the killing of children, meet the legal definition of genocide. Israel's foreign ministry labeled the resolution \"disgraceful.\" This marks a significant stance from a leading scholarly group, aligning with conclusions from various rights groups accusing Israel of committing genocide.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "China Pledges $280M in Aid to SCO Members at Tianjin Summit",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Mon, 01 Sep 2025 04:57:10 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "New York Times",
      "CNBC"
    ],
    "domains": [
      "www.nytimes.com",
      "www.npr.org",
      "www.cnbc.com"
    ],
    "snippets": [
      "Chinese President Xi Jinping is hosting a high-profile summit with leaders from Russia, North Korea and India gathering among others in a challenge to U.S. influence.",
      "A viral photo of Modi, Xi and Putin at the SCO summit highlights shifting power, unresolved tensions and the limits of global alliances.",
      "It is unclear if the SCO summit will pave the way for any breakthroughs in easing tensions, though Beijing has sought to cast itself as a global peacemaker.",
      "Their display of friendship in China was aimed at projecting an alternative to U.S. global leadership, even as serious differences among them remain."
    ],
    "image_url": "",
    "titles": [
      "China's Xi hosts Putin and Modi at Shanghai Cooperation Organization summit",
      "Behind the smiles with Putin, Modi and Xi at China summit",
      "China's Xi urges AI cooperation, rejects ‘Cold War mentality’ at SCO summit",
      "Xi, Putin and Modi Try to Signal Unity at China Summit"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.728,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.731,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "At a summit in Tianjin, the Chinese leader pledged $280 million in aid to members of the Shanghai Cooperation Organisation (SCO). The contribution aims to support the SCO, but it remains uncertain if this will lead to significant breakthroughs in reducing tensions among member states. Beijing is positioning itself as a global peacemaker through this gesture.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Liverpool Signs Isak for Record £125m; Guéhi Deal Falls Through",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 01 Sep 2025 21:12:12 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian",
      "Sky Sports"
    ],
    "domains": [
      "www.theguardian.com",
      "www.skysports.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Liverpool sign striker Alexander Isak from Newcastle United for a British record transfer fee of £125m.",
      "<ul><li><p>Isak signs six-year contract and ‘wants to create history’</p></li><li><p>Deal for Crystal Palace’s Marc Guéhi falls through</p></li></ul><p>Liverpool broke the British transfer record to sign Alexander Isak for £125m from Newcastle on deadline day but were foiled in an attempt to end a s",
      "Liverpool have confirmed the signing of Alexander Isak for &#163;125m, Sky Sports News discuss how the Reds afforded a record-breaking &#163;446m summer.",
      "Liverpool&#160;have completed the signing of Newcastle striker Alexander Isak in a British-record deal worth &#163;125m."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/7318/live/c165f5d0-877a-11f0-899b-9ba806b70f02.jpg",
    "titles": [
      "Isak joins Liverpool in £125m British record deal",
      "Liverpool sign Alexander Isak in British transfer record £125m deal from Newcastle",
      "Liverpool sign Isak for £125m | How the Reds afforded a record £446m summer?",
      "Liverpool sign Isak in British-record £125m deal from Newcastle"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.921,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.721,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Liverpool signed striker Alexander Isak from Newcastle United for a British record transfer fee of £125m. Isak has agreed to a six-year contract with the intention of creating history at the club. However, Liverpool's attempt to sign Marc Guéhi from Crystal Palace was unsuccessful. This acquisition is part of Liverpool's record-breaking £446m summer spending, as confirmed by various news sources including Sky Sports News.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "WildBrain to Shut Down Four Family-Oriented Channels",
    "domain": "general",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Mon, 01 Sep 2025 19:13:00 +0000",
    "source": "Global News",
    "sources": [
      "CityNews",
      "Global News"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "globalnews.ca"
    ],
    "snippets": [
      "WildBrain announced last week it is closing four of its channels, including the Family Channel, Family Jr., WildBrainTV and Télémagino for French-language kids.",
      "Korie Heartz grew up with the Family Channel just like her mother, who also watched the iconic station’s shows during her own childhood. She said she hoped her own children would be the third generation in the family to enjoy the series, dramas, and programs that the television channel aired for Can"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/the-famiy-channel.jpg?quality=65&strip=all",
    "titles": [
      "‘A bit devastating’: Family Channel closure saddens fans, including many grownups",
      "Family Channel closure saddens fans, including many grownups"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.902,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.692,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "WildBrain is shutting down four channels: Family Channel, Family Jr., WildBrainTV, and Télémagino. This decision ends a multi-generational viewing tradition for families like Korie Heartz's, who had hoped her children would become the third generation to enjoy the content these channels offered.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Belichick's UNC Debut Stirs Excitement and Controversy Amid Fan Chaos",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 1 Sep 2025 19:59:25 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Yahoo Sports"
    ],
    "domains": [
      "ftw.usatoday.com",
      "www.espn.com"
    ],
    "snippets": [
      "From enlightening and exhilarating to chaotic and tumultuous, there hasn't been anything boring about Belichick at UNC.",
      "Of course Bill Belichick's first game with UNC was going to inspire some real cringy signs about Jordon Hudson from fans."
    ],
    "image_url": "",
    "titles": [
      "Chaotic recruiting and 'harsh' decisions: Bill Belichick's first nine months at UNC",
      "UNC fan has cringiest Jordon Hudson sign at Bill Belichick's first game"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.996,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.679,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Bill Belichick's debut game as UNC's coach was marked by a range of reactions, from excitement to chaos. The event also saw fans displaying controversial signs about player Jordon Hudson.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Florida State Linebacker Critically Injured in Shooting in Havana, Florida",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 1 Sep 2025 19:00:13 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "Florida State freshman linebacker Ethan Pritchard is hospitalized in critical but stable condition after suffering a gunshot wound Sunday night in Havana, Florida.",
      "<p>A Florida State linebacker is in critical but stable condition after being shot while visiting family, the Seminoles said Monday.</p>"
    ],
    "image_url": "",
    "titles": [
      "FSU freshman shot, in critical but stable condition",
      "Florida State player in critical but stable condition after being shot"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.976,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.675,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Florida State freshman linebacker Ethan Pritchard is in critical but stable condition after being shot Sunday night in Havana, Florida, while visiting family. He was inside a car at the time of the incident.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Juan Soto Hits 6 RBIs, Leads Mets to 10-8 Win Over Tigers",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 1 Sep 2025 19:00:13 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "Juan Soto tied his career high with six RBIs, hitting a grand slam and a tiebreaking, two-run triple to lead the Mets over the Tigers.",
      "<p>Juan Soto tied his career high with six RBIs, hitting a grand slam and a tiebreaking, two-run triple to lead the New York Mets over the Detroit Tigers 10-8 on Monday.</p>"
    ],
    "image_url": "",
    "titles": [
      "Soto hits grand slam, triple to spark Mets in win",
      "Soto ties career high with 6 RBIs, hits grand slam to lead Mets over Tigers"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.976,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.675,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Juan Soto matched his career high by earning six RBIs, including a grand slam and a decisive two-run triple, guiding the New York Mets to a 10-8 victory against the Detroit Tigers on Monday.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "2025 NFL Fantasy Insights: Breakouts, Busts, and Draft Strategy Revealed",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 1 Sep 2025 19:00:13 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "Weekly individual and composite rankings for each position in PPR and IDP formats, as well as Eric Karabell's superflex ranks.",
      "SportsLine simulated the new NFL season 10,000 times and identified Fantasy football busts 2025 to fade during your Fantasy football draft prep",
      "SportsLine simulated the NFL season 10,000 times and revealed its 2025 Fantasy football sleepers for 2025 Fantasy football draft prep",
      "SportsLine simulated the new NFL season 10,000 times to help form your 2025 Fantasy football draft strategy",
      "Jamey Eisenberg guides Fantasy managers through the final TE ADP and early waiver wire adds",
      "Jamey Eisenberg guides Fantasy managers through the final WR ADP and early waiver wire adds",
      "Jamey Eisenberg guides Fantasy managers through the final RB ADP and early waiver wire adds",
      "Jamey Eisenberg guides Fantasy managers through the final QB ADP and early waiver wire adds"
    ],
    "image_url": "",
    "titles": [
      "🏈 Fantasy football PPR rankings for Week 1",
      "Fantasy football rankings 2025: Busts from model that was all over Raheem Mostert's challenging season",
      "Fantasy football rankings 2025: Sleepers, top picks from NFL model that called James Cook's huge year",
      "Fantasy football rankings 2025: Breakouts, sleepers, busts from model that predicted C.J. Stroud's down year",
      "Fantasy Football final TE ADP: Draft sleepers and waiver wire tight end targets for Week 1",
      "Fantasy Football final WR ADP: Draft sleepers and waiver wire wide receiver targets for Week 1",
      "Fantasy Football final RB ADP: Draft sleepers and waiver wire running back targets for Week 1",
      "Fantasy Football final QB ADP: Draft sleepers and waiver wire quarterback targets for Week 1"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.976,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.675,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "SportsLine conducted 10,000 simulations of the new NFL season, providing insights for 2025 Fantasy football including breakouts, busts, and overall draft strategy. Additionally, weekly rankings for both PPR and IDP formats, along with Eric Karabell's superflex ranks, are available to assist with draft preparation and season planning.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "US Protests Demand Economic Justice, Criticize Trump Policies",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Mon, 01 Sep 2025 20:55:29 +0000",
    "source": "Al Jazeera",
    "sources": [
      "The Guardian",
      "Al Jazeera"
    ],
    "domains": [
      "www.theguardian.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Tens of thousands gather under &#039;Workers Over Billionaires&#039;, pushing for livable wages and economic justice.",
      "<p>Protests denounce Trump administration’s policies and call for the protection of social safety nets</p><p>As Labor Day rallies took place across the US, the Chicago mayor Brandon Johnson sharply denounced the Trump administration’s threat to deploy federal troops to the city as part of an immigra"
    ],
    "image_url": "",
    "titles": [
      "Over 1,000 Labor Day rallies held across US to protest Trump",
      "Hundreds of ‘Workers Over Billionaires’ Labor Day rallies take place across US"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.935,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.649,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Tens of thousands rallied across the US under the banner 'Workers Over Billionaires,' advocating for livable wages and economic justice. These protests also criticized the Trump administration's policies, particularly opposing the threat to send federal troops to Chicago, as stated by Mayor Brandon Johnson during Labor Day rallies. The gatherings called for the protection of social safety nets.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Judge Halts Deportation of Guatemalan Children by U.S. Government",
    "domain": "general",
    "source_domain": "www.washingtonpost.com",
    "location": "global",
    "published": "Mon, 01 Sep 2025 19:25:06 +0000",
    "source": "Washington Post",
    "sources": [
      "Washington Post",
      "New York Times"
    ],
    "domains": [
      "www.nytimes.com",
      "www.washingtonpost.com"
    ],
    "snippets": [
      "A federal judge rushed an emergency hearing after learning that the Trump administration was moving to deport children to Guatemala despite an order she had issued earlier Sunday.",
      "The temporary block ended another last-minute flurry of legal action over the Trump administration’s immigration crackdown."
    ],
    "image_url": "",
    "titles": [
      "Judge orders administration to halt deportation of hundreds of Guatemalan children",
      "Judge Halts U.S. Effort to Deport Guatemalan Children as Planes Sit on Tarmac"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.906,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.646,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A federal judge issued a temporary restraining order, halting the U.S. government's attempt to deport hundreds of unaccompanied Guatemalan children without proper immigration proceedings. This decision, made by District Judge Sparkle Sooknanan, comes after a legal complaint on behalf of 10 children, temporarily preventing these deportations for at least 14 days as the legal process continues. This move interrupts the Trump administration's broader immigration crackdown efforts.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "9 Ex-CDC Directors Critique HHS Secretary, Cite Health Risks",
    "domain": "general",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Mon, 01 Sep 2025 17:32:04 -0400",
    "source": "ABC News",
    "sources": [
      "The Guardian",
      "ABC News"
    ],
    "domains": [
      "www.theguardian.com",
      "abcnews.go.com"
    ],
    "snippets": [
      "Nine former directors of the CDC are speaking out, saying Health and Human Services Secretary Robert F. Kennedy Jr. is endangering the health of Americans.",
      "<p>In a New York Times essay, nine officials said Kennedy’s leadership at HHS ‘should alarm every American’</p><p>Nine former officials at the Centers for Disease Control and Prevention have said that Robert F Kennedy Jr’s leadership of the US health and human services department is “unlike anything"
    ],
    "image_url": "https://s.abcnews.com/images/US/cabinet-21-gty-gmh-250826_1756229711171_hpMain_4x3t_384.jpg",
    "titles": [
      "RFK Jr. ousted a CDC boss. Now former directors say he's endangering US health",
      "Former CDC leaders slam RFK Jr for endangering Americans’ health"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.947,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.644,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Nine former CDC directors have publicly criticized Health and Human Services Secretary Robert F. Kennedy Jr., stating in a New York Times essay that his leadership endangers American health. They argue his approach is unprecedented and alarming.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "EU Commission President's Plane Jammed Over Bulgaria, Lands Safely",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Mon, 01 Sep 2025 17:05:09 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Fortune",
      "Al Jazeera"
    ],
    "domains": [
      "fortune.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Plane for Ursula von der Leyen&#039;s four-day tour of ‘front line’ states on EU&#039;s eastern flank landed with ‘paper maps’.",
      "The plane landed safely and Ursula von der Leyen will continue her planned tour of the European Union’s nations bordering Russia and Belarus, a spokesperson said."
    ],
    "image_url": "",
    "titles": [
      "Russia suspected of jamming navigation on EU leader’s plane above Bulgaria",
      "Russia suspected of jamming navigation on European Commission president’s plane, official says"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.863,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.628,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A plane carrying European Commission President Ursula von der Leyen experienced GPS jamming over Bulgaria, suspected to be a Russian operation. Despite this, the plane safely landed at Plovdiv airport. Von der Leyen will proceed with her tour of EU nations bordering Russia and Belarus, as planned.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Labor Day Sales Offer Big Discounts on TVs, School Supplies Ahead of Sports Seas",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-09-01T16:47:17-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "www.theverge.com"
    ],
    "snippets": [
      "Labor Day weekend marks the unofficial end of summer, which is a bit sad, but it’s a great time to get a deal on a fancy, new TV. The US holiday is happening just before the start of the 2025-2026 NFL season, the World Cup qualifiers, and the lead-up to the MLB post-season games. This [&#8230;]",
      "Labor Day has finally arrived, and after a week of early discounts trickling in, the sales are now in full swing. We’ve put together an expansive guide detailing nearly 100 deals we think are worth the money — including everything from big-screen OLED TVs to back-to-school essentials like the latest",
      "Labor Day marks the unofficial end of summer, and while the prospect of cooler weather and shorter days can be a tough adjustment for some, at least there is always a great selection of deals to combat the post-summer blues. Lucky for you, we’ve gone ahead and rounded up the best discounts you can g"
    ],
    "image_url": "",
    "titles": [
      "The best Labor Day TV sales",
      "The 28 best Labor Day deals you still can grab for $100 or less",
      "The 95 best Labor Day sales happening now"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.932,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.454,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Labor Day weekend, marking the unofficial end of summer, brings a wave of sales on a wide range of products, including big-screen OLED TVs and back-to-school essentials. Coinciding with the lead-up to major sports events, such as the 2025-2026 NFL season, World Cup qualifiers, and MLB post-season games, the holiday offers extensive discounts. Comprehensive guides have been compiled to help shoppers navigate nearly 100 deals considered worth the investment.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]