[
  {
    "title": "Fifty hippos killed by anthrax in DR Congo",
    "domain": "general",
    "location": "global",
    "published": "Tue, 08 Apr 2025 14:08:21 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Efforts are now under way to recover the animals and bury them to prevent further spread."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/55b8/live/b539b8f0-147a-11f0-aff1-f1386d086010.png",
    "summary": "Authorities are currently engaged in a recovery operation to collect and properly bury animals that have died in order to prevent the spread of disease. This action is a preventive measure aimed at ensuring public and environmental health safety.",
    "titles": [
      "Fifty hippos killed by anthrax in DR Congo"
    ],
    "score_components": {
      "magnitude": 0.3,
      "recency": 0.988,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.487,
    "normalized_score": 10.0
  },
  {
    "title": "Devastation after deadly flooding in DR Congo’s capital",
    "domain": "general",
    "location": "global",
    "published": "Tue, 08 Apr 2025 13:02:05 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Hundreds of people have been moved to emergency shelters after flooding in DR Congo’s capital, Kinshasa."
    ],
    "image_url": "",
    "summary": "Hundreds of individuals in Kinshasa, the capital of the Democratic Republic of Congo, have been relocated to emergency shelters due to significant flooding. This event underscores the ongoing challenges the city faces with natural disasters.",
    "titles": [
      "Devastation after deadly flooding in DR Congo’s capital"
    ],
    "score_components": {
      "magnitude": 0.3,
      "recency": 0.972,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.483,
    "normalized_score": 9.82
  },
  {
    "title": "The crisis in North Macedonia runs deep",
    "domain": "general",
    "location": "global",
    "published": "Tue, 08 Apr 2025 12:13:55 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The tragedy in Kocani cannot be explained away as another case of local corruption."
    ],
    "image_url": "",
    "summary": "The incident in Kocani is being viewed as more than a local corruption issue, indicating a deeper, systemic problem. The nature of the tragedy has not been specified, but it is clear that explanations attributing it solely to corruption are considered inadequate.",
    "titles": [
      "The crisis in North Macedonia runs deep"
    ],
    "score_components": {
      "magnitude": 0.3,
      "recency": 0.961,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.48024999999999995,
    "normalized_score": 9.69
  },
  {
    "title": "Record global temperatures in March illustrate threat to climate goals",
    "domain": "general",
    "location": "global",
    "published": "Tue, 08 Apr 2025 09:35:14 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The data threatens that global climate goals are moving out of reach."
    ],
    "image_url": "",
    "summary": "Recent data indicates that achieving global climate goals is becoming increasingly difficult. This suggests that efforts to limit global warming and meet international targets may not be on track, posing significant challenges for future climate action.",
    "titles": [
      "Record global temperatures in March illustrate threat to climate goals"
    ],
    "score_components": {
      "magnitude": 0.3,
      "recency": 0.924,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.471,
    "normalized_score": 9.26
  },
  {
    "title": "Ukraine detains suspected Russian assassin",
    "domain": "general",
    "location": "global",
    "published": "Tue, 08 Apr 2025 13:10:30 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Indictment comes amid an uptick in targeted attacks on Ukrainian officials and public figures."
    ],
    "image_url": "",
    "summary": "An indictment has been issued in the context of a recent increase in targeted attacks against Ukrainian officials and public figures. This development marks a significant legal action amidst escalating incidents targeting prominent individuals in Ukraine.",
    "titles": [
      "Ukraine detains suspected Russian assassin"
    ],
    "score_components": {
      "magnitude": 0.24,
      "recency": 0.974,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.4655,
    "normalized_score": 9.01
  },
  {
    "title": "Breaking down the Ravens picks in Mel Kiper's latest 2-round 2025 NFL mock draft",
    "domain": "sports",
    "location": "national",
    "published": "Tue, 08 Apr 2025 14:46:19 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Mel Kiper has the Baltimore Ravens selecting an All SEC safety and an under the radar pass rusher in his latest 2025 NFL mock draft for ESPN",
      "Mel Kiper has the Philadelphia Eagles selecting an All SEC pass rusher and an a versatile safety in his latest 2025 NFL mock draft for ESPN"
    ],
    "image_url": "",
    "summary": "In his latest 2025 NFL mock draft for ESPN, Mel Kiper predicts the Baltimore Ravens will select an All-SEC safety and an under-the-radar pass rusher. Similarly, he forecasts the Philadelphia Eagles will choose an All-SEC pass rusher and a versatile safety. These selections highlight both teams' focus on strengthening their defensive line and secondary.",
    "titles": [
      "Breaking down the Ravens picks in Mel Kiper's latest 2-round 2025 NFL mock draft",
      "Breaking down the Eagles picks in Mel Kiper's latest 2-round 2025 NFL mock draft"
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.996,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.379,
    "normalized_score": 5.02
  },
  {
    "title": "Local notebook: Former Central thrower Ethan Thomas shatters UND shot put record",
    "domain": "sports",
    "location": "national",
    "published": "Tue, 08 Apr 2025 14:33:00 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Apr. 8—GRAND FORKS — Former Grand Forks Central standout Ethan Thomas continues to turn heads in his true freshman season at UND. After destroying the UND indoor shot put record this winter, Thomas easily crushed the outdoor record recently, as well. At the Triton Invitational in La Jolla, Calif., Thomas threw a personal-best throw of 63 feet, 7.75 inches. The previous record was 58-10, set by ..."
    ],
    "image_url": "",
    "summary": "Ethan Thomas, a freshman at UND and former Grand Forks Central standout, broke the UND outdoor shot put record at the Triton Invitational in La Jolla, California, with a throw of 63 feet, 7.75 inches. This surpassed the previous record of 58 feet, 10 inches. Thomas had previously set a new indoor shot put record at UND this winter, showcasing his exceptional talent in his first collegiate season.",
    "titles": [
      "Local notebook: Former Central thrower Ethan Thomas shatters UND shot put record"
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.993,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.3782500000000001,
    "normalized_score": 4.99
  },
  {
    "title": "Overall ski champion Brignone discharged from the hospital after breaking her leg",
    "domain": "sports",
    "location": "national",
    "published": "Tue, 08 Apr 2025 14:29:44 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Overall World Cup skiing champion Federica Brignone was discharged from the hospital on Tuesday, five days after breaking multiple bones in her left leg in a giant slalom crash and undergoing surgery.  “I still don’t know how long it will take (to return),” Brignone told reporters as she sat in a wheelchair before leaving the La Madonnina clinic in Milan.  Brignone also tore her ACL, raising questions about her chances of competing at the home Olympics in 10 months."
    ],
    "image_url": "",
    "summary": "Federica Brignone, the overall World Cup skiing champion, was released from the hospital after a five-day stay due to a giant slalom crash that resulted in multiple broken bones in her left leg and a torn ACL. Following surgery at the La Madonnina clinic in Milan, Brignone's recovery timeline remains uncertain, casting doubt on her ability to compete in the Olympics in 10 months.",
    "titles": [
      "Overall ski champion Brignone discharged from the hospital after breaking her leg"
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.993,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.3782500000000001,
    "normalized_score": 4.99
  },
  {
    "title": "Another big industry mock draft has the Saints picking Shedeur Sanders",
    "domain": "sports",
    "location": "national",
    "published": "Tue, 08 Apr 2025 14:52:06 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Mel Kiper Jr. is the latest analyst linked the Saints to Shedeur Sanders. He made the case for why the Colorado QB should keep wearing black and gold."
    ],
    "image_url": "",
    "summary": "Mel Kiper Jr., a noted analyst, has recommended that Shedeur Sanders, the quarterback for Colorado, should be drafted by the New Orleans Saints. Kiper Jr. believes Sanders would be a good fit for the Saints and should continue playing in black and gold, the team's colors.",
    "titles": [
      "Another big industry mock draft has the Saints picking Shedeur Sanders"
    ],
    "score_components": {
      "magnitude": 0.12,
      "recency": 0.998,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.35550000000000004,
    "normalized_score": 3.94
  },
  {
    "title": "Fantasy Baseball Waiver Wire: Chase Dollander makes for an excellent pitching replacement for managers in need",
    "domain": "sports",
    "location": "national",
    "published": "Tue, 08 Apr 2025 14:46:13 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Plus, why Casey Mize isn't a must-roster player just yet"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/04/08/bd91f00a-4410-4f72-a3e5-fa720a9ad361/chase-dollander-colorado-rockies-usatsi.jpg",
    "summary": "Casey Mize, a professional baseball player, is currently not considered a must-roster player. This assessment is based on his current performance and potential in the game. The conclusion draws from various evaluations of his abilities and contributions to the team, suggesting that while Mize may have talent, he has yet to reach a level of performance that makes him indispensable to fantasy baseball teams or his professional team's roster.",
    "titles": [
      "Fantasy Baseball Waiver Wire: Chase Dollander makes for an excellent pitching replacement for managers in need"
    ],
    "score_components": {
      "magnitude": 0.12,
      "recency": 0.996,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.355,
    "normalized_score": 3.92
  },
  {
    "title": "China vows ‘fight to the end’ after Trump threatens extra 50% tariff",
    "domain": "business",
    "location": "global",
    "published": "Tue, 08 Apr 2025 13:47:56 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Beijing and Washington exchange warnings of retaliation as markets stabilise"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F2f035622-4fd7-48ee-83d5-03795508e83e.png?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "summary": "Beijing and Washington have issued mutual warnings of retaliation, amid a period of stabilized markets. This development marks a significant moment in the ongoing tensions between the two capitals. The specifics of the warnings or potential areas of retaliation were not disclosed, but the exchange signals a continued strain in diplomatic relations.",
    "titles": [
      "China vows ‘fight to the end’ after Trump threatens extra 50% tariff"
    ],
    "score_components": {
      "magnitude": 0.26,
      "recency": 0.983,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.47375,
    "normalized_score": 9.39
  },
  {
    "title": "Zelenskyy says Chinese men fighting for Russia captured in Ukraine",
    "domain": "business",
    "location": "global",
    "published": "Tue, 08 Apr 2025 13:45:12 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Ukrainian president demands explanation and accuses Beijing of actively participating in Moscow’s war"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Fd8c3c4bd-f33a-47fc-8337-a4432ff98a8a.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "summary": "The Ukrainian President has accused Beijing of actively participating in Moscow's war and demanded an explanation. This accusation marks a significant development in the ongoing conflict, implicating direct involvement by Beijing alongside Moscow.",
    "titles": [
      "Zelenskyy says Chinese men fighting for Russia captured in Ukraine"
    ],
    "score_components": {
      "magnitude": 0.24,
      "recency": 0.982,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.4675,
    "normalized_score": 9.1
  },
  {
    "title": "Watch These Supermicro Price Levels as Stock Soars After Tariff-Induced Selling",
    "domain": "business",
    "location": "global",
    "published": "Tue, 08 Apr 2025 14:23:30 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "<figure><img alt=\"Source: TradingView.com\" src=\"https://www.investopedia.com/thmb/odssq-nAaDVy7rMyJTHVkJyflBA=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/SMCIChart-3af0e20bf9a94db89ad161166a9a15bc.jpg\" title=\"This image depicts the SMCI chart.\" /><figcaption><i>Source: TradingView.com</i></figcaption></figure><br /><h3>Key Takeaways</h3><ul><li>Super Micro Computer shares jumped in early trading Tuesday, adding to an 11% gain yesterday, as investors bid up the server marker’s stock after a few days of big losses during the broader market sell-off.</li><li>The stock completed a bullish engulfing pattern in Monday’s trading session, potentially forming a bear trap.</li><li>Investors should watch major overhead areas on Supermicro's chart around $48 and $63, while also monitoring vital support levels near $26 and $17.</li></ul><br /><br /><p>Super Micro Computer (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;smci\">SMCI</a>) shares jumped in early trading Tuesday, adding to an 11% surge yesterday, as investors bid up the server marker’s stock after a few days of big losses during the broader market's <a href=\"https://www.investopedia.com/dow-jones-today-04072025-11710097\">tariff-fueled sell-off</a>.</p><p>Sentiment surrounding the stock likely received a boost from J.P. Morgan analysts who recently pointed out that the company would only need to increase its global prices by 4%, based on the portion of its hardware that would be affected by tariffs.<span class=\"ql-inline-citation\"></span></p><p>Supermicro shares saw significant price swings in both directions during the first quarter as the company dealt with accounting issues that raised concerns of a potential Nasdaq delisting until the company <a href=\"https://www.investopedia.com/supermicro-stock-soars-in-extended-trading-as-server-maker-meets-filing-deadline-11686437\">met the exchange’s deadline to file several delayed financial reports in February</a>. The stock was up 6% at around $35 in recent trading.</p><p>Below, we break down the <a href=\"https://www.investopedia.com/technical-analysis-4689657\">technicals</a> on Supermicro’s chart and identify major price levels that investors may be monitoring.</p><h2>Potential Bear Trap</h2><p>After <a href=\"https://www.investopedia.com/terms/g/gapping.asp\">gapping</a> lower in late October, Supermicro shares oscillated within an orderly <a href=\"https://www.investopedia.com/terms/a/ascendingchannel.asp\">ascending channel</a> until breaking down below the pattern’s lower trendline toward the end of last month.</p><p>However, despite falling to its lowest level since early February last week, the stock completed a <a href=\"https://www.investopedia.com/terms/b/bullishengulfingpattern.asp\">bullish engulfing pattern</a> in Monday’s trading session, potentially forming a <a href=\"https://www.investopedia.com/terms/b/beartrap.asp\">bear trap</a>—a trading event that lures investors to sell upon a breach of major <a href=\"https://www.investopedia.com/terms/s/support.asp\">support</a> before the price makes a sudden move higher.</p><p>What’s more, Monday’s buying coincided with the <a href=\"https://www.investopedia.com/terms/r/rsi.asp\">relative strength index (RSI)</a> rallying from a reading of around 35, the same level the indicator bottomed at in early February before the stock roughly doubled over a two-week period.</p><p>Let’s identify two major overhead areas to watch on Supermicro’s chart amid the potential for follow-through buying, and also point out vital support levels worth monitoring.</p><h2>Major Overhead Areas to Watch</h2><p>A decisive close back above the ascending channel’s lower trendline could trigger a rally to around $48. This level, currently just above the closely watched <a href=\"https://www.investopedia.com/ask/answers/013015/why-200-simple-moving-average-sma-so-common-traders-and-analysts.asp\">200-day moving average</a>, connects a range of comparable trading activity on the chart extending back to last year’s prominent August <a href=\"https://www.investopedia.com/terms/s/swinglow.asp\">swing low</a>.</p><p>Buying above this price could see the stock revisit the $63 area. Investors who have <a href=\"https://www.investopedia.com/terms/a/accumulating-shares.asp\">accumulated shares</a> during the stock’s recent decline may decide to <a href=\"https://www.investopedia.com/terms/l/lock_in_profits.asp\">lock in profits</a> in this region near a trendline that links last year's late-August peak with the February <a href=\"https://www.investopedia.com/terms/s/swinghigh.asp\">swing high</a>.</p><p>Interestingly, this location also sits in the same vicinity as a projected bars pattern target that takes the stock’s sharp <a href=\"https://www.investopedia.com/terms/t/trendanalysis.asp\">trend</a> higher during February and overlays it from the low of yesterday’s bullish engulfing candle.</p><h2>Vital Support Levels Worth Monitoring</h2><p>A breach of the bullish engulfing candle's low could see Supermicro shares initially retrace to around $26, a location on the chart where they may attract support near the January <a href=\"https://www.investopedia.com/trading/peak-and-trough-analysis/\">trough</a> and early-November <a href=\"https://www.investopedia.com/articles/trading/10/trend-following-countertrend.asp\">countertrend</a> high.</p><p>Finally, a <a href=\"https://www.investopedia.com/terms/b/breakdown.asp\">breakdown</a> below this level paves the way for a potential drop to $17. Investors may seek <a href=\"https://www.investopedia.com/ask/answers/03/071803.asp\">buy-and-hold</a> opportunities in this region near the mid-November trough, which also marks the stock’s <a href=\"https://www.investopedia.com/terms/1/52weekhighlow.asp\">52-week low</a>.</p><p><em>The comments, opinions, and analyses expressed on Investopedia are for informational purposes only. Read our <a href=\"https://www.investopedia.com/legal-4768893#toc-warranty-and-liability-disclaimer\">warranty and liability disclaimer</a> for more info.</em></p><p><em>As of the date this article was written, the author does not own any of the above securities.</em><br /></p>"
    ],
    "image_url": "https://www.investopedia.com/thmb/odssq-nAaDVy7rMyJTHVkJyflBA=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/SMCIChart-3af0e20bf9a94db89ad161166a9a15bc.jpg",
    "summary": "Super Micro Computer (SMCI) shares experienced a significant increase, rising 11% in early trading on Tuesday after a previous 11% gain. This surge comes after the stock faced substantial losses during a broader market sell-off influenced by tariffs. Analysts from J.P. Morgan suggested that the company could offset tariff impacts by raising global prices by 4%. The stock's recent volatility is also tied to concerns about a potential Nasdaq delisting, which were alleviated when Supermicro met the filing deadline for delayed financial reports in February. The shares were trading up 6% at around ",
    "titles": [
      "Watch These Supermicro Price Levels as Stock Soars After Tariff-Induced Selling"
    ],
    "score_components": {
      "magnitude": 0.22,
      "recency": 0.991,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.46375,
    "normalized_score": 8.93
  },
  {
    "title": "CVS Stock Pops as Pharmacy Chain Improves Full-Year Outlook, Taps New Execs",
    "domain": "business",
    "location": "global",
    "published": "Tue, 08 Apr 2025 14:12:30 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "<figure><img alt=\"UCG / Contributor / Getty Images\" src=\"https://www.investopedia.com/thmb/mg2lujUgUC6hrsfNFwX97AVypbE=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2207232111-d7fe612f48dc4a8dbb1f3144fe6b6d70.jpg\" title=\"CVS Pharmacy\" /><figcaption><i><p>UCG / Contributor / Getty Images</p></i></figcaption></figure><br /><h3>Key Takeaways</h3><ul><li>CVS stock surged Tuesday after the company said it expects to meet or exceed its previous outlook for 2025.</li><li>This comes after the government said it will pay Medicare insurers, such as CVS' Aetna, more than previously expected.</li><li>CVS also announced new executives, including a CFO expected to start later this month.</li></ul><br /><br /><p>CVS Health (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;CVS\">CVS</a>) shares jumped Tuesday after the company improved its full-year outlook and named a new chief financial officer.<span class=\"ql-inline-citation\"></span></p><p>The pharmacy and health insurance giant said it now expects to meet or exceed its adjusted earnings projection of $5.75 to $6 per share <a href=\"https://www.investopedia.com/cvs-health-stock-pops-as-q4-sales-earnings-top-estimates-8787981\">issued in February</a>. Analysts expect $5.89 on average, according to Visible Alpha. </p><p>CVS shares jumped over 8% in recent trading. The federal government also announced late Monday that it will <a href=\"https://www.investopedia.com/medicare-payment-boost-lifts-health-insurance-stocks-11710823\">pay Medicare insurers</a>, such as CVS' Aetna, more than previously expected.</p><p>The company's shares are up about 55% year-to-date, making it the best-performing stock in the <a href=\"https://www.investopedia.com/terms/s/sp500.asp\">S&amp;P 500</a> since the start of the year, after a difficult 2024. </p><p>Along with its improved forecast, CVS announced the appointment of a new CFO, with former UPS (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;UPS\">UPS</a>) CFO Brian Newman set to take over the role effective April 21. The company also named Amy Compton-Phillips, who most recently served as chief physician executive of Press Ganey, its chief medical officer, effective May 19. These shakeups follow a <a href=\"https://www.investopedia.com/cvs-stock-plummets-as-it-replaces-ceo-price-update-8730261\">CEO change</a> in October that saw CVS veteran David Joyner take the helm.<br /></p>"
    ],
    "image_url": "https://www.investopedia.com/thmb/mg2lujUgUC6hrsfNFwX97AVypbE=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2207232111-d7fe612f48dc4a8dbb1f3144fe6b6d70.jpg",
    "summary": "CVS Health's stock experienced an over 8% surge on Tuesday after the company announced it anticipates meeting or surpassing its 2025 earnings forecast of $5.75 to $6 per share. This positive outlook was bolstered by the federal government's decision to increase payments to Medicare insurers, including CVS' Aetna. Additionally, CVS introduced new executive appointments, naming former UPS CFO Brian Newman as its new CFO effective April 21, and Amy Compton-Phillips as chief medical officer starting May 19. The company's shares have risen approximately 55% year-to-date, positioning CVS as the top ",
    "titles": [
      "CVS Stock Pops as Pharmacy Chain Improves Full-Year Outlook, Taps New Execs"
    ],
    "score_components": {
      "magnitude": 0.22,
      "recency": 0.989,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.46325000000000005,
    "normalized_score": 8.91
  },
  {
    "title": "Treasury Secretary Bessent Says China Playing With 'Losing Hand'",
    "domain": "business",
    "location": "global",
    "published": "Tue, 08 Apr 2025 14:02:01 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "<figure><img alt=\"SAUL LOEB / AFP via Getty Images U.S. Treasury Secretary Scott Bessent\" src=\"https://www.investopedia.com/thmb/4JMGQDAHyJJhghnsA6bPxEvyyh0=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2207587952-394e3980d32c4a2a96c60acd22c9bcad.jpg\" title=\"US Treasury Secretary Scott Bessent \" /><figcaption><i><p>SAUL LOEB / AFP via Getty Images</p> U.S. Treasury Secretary Scott Bessent</i></figcaption></figure><br /><h3>KEY TAKEAWAYS</h3><ul><li>Treasury Secretary Scott Bessent said in an interview Tuesday that the U.S. has the upper hand over China as the trade war intensifies.</li><li>\"What do we lose by the Chinese raising tariffs on us?\" Bessent said, \"We export one-fifth to them of what they export to us, so that is a losing hand for them.\"</li><li>On Tuesday, China threatened to hit back further if President Donald Trump hikes U.S. import tariffs by an additional 50%.<br /></li></ul><br /><br /><p>Treasury Secretary Scott Bessent said in an interview Tuesday that the U.S. has the upper hand over China as the trade war intensifies.<span class=\"ql-inline-citation\"></span></p><p>\"I think it was a big mistake, this Chinese escalation, because they're playing with a pair of twos,\" Bessent said on <em>CNBC</em>. \"...What do we lose by the Chinese raising tariffs on us? We export one-fifth to them of what they export to us, so that is a losing hand for them.\"</p><p>On Tuesday, China <a href=\"https://www.investopedia.com/global-stocks-rebound-even-as-china-pledges-to-fight-to-the-end-on-tariffs-11711018\">threatened</a> to hit back further if President Donald Trump hikes U.S. import tariffs by an <a href=\"https://www.investopedia.com/trump-threatens-further-tariffs-on-china-discusses-japan-trade-talks-11710276\">additional 50%</a>, saying it would \"fight to the end.\"<span class=\"ql-inline-citation\"></span>  </p><p>\"I think you are going to see some very large countries with large trade deficits come forward very quickly,\" Bessent said. \"If they come to the table with solid proposals, I think we can end up with some good deals.\"</p><p>Bessent told <em>Fox Business</em> on Monday that he expected Japan to get priority in trade talks \"just because they came forward very quickly,\" which helped the Nikkei close 6% higher Tuesday. </p>"
    ],
    "image_url": "https://www.investopedia.com/thmb/4JMGQDAHyJJhghnsA6bPxEvyyh0=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2207587952-394e3980d32c4a2a96c60acd22c9bcad.jpg",
    "summary": "U.S. Treasury Secretary Scott Bessent claimed the U.S. holds an advantage in the escalating trade war with China, citing the imbalance in exports between the two nations. Bessent argued that China's decision to raise tariffs is a strategic error, given the U.S. exports significantly less to China than vice versa. This statement came amid threats from China to retaliate if the U.S. increases import tariffs by an additional 50%. Bessent also mentioned potential for positive trade deals with other large countries and highlighted Japan's proactive stance in trade talks, which positively impacted i",
    "titles": [
      "Treasury Secretary Bessent Says China Playing With 'Losing Hand'"
    ],
    "score_components": {
      "magnitude": 0.22,
      "recency": 0.986,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.4625,
    "normalized_score": 8.87
  },
  {
    "title": "Smell-seeking drone uses moth antenna to follow a scent",
    "domain": "science",
    "location": "global",
    "published": "Tue, 08 Apr 2025 14:00:32 +0100",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A moth antenna can be integrated into the electronics of a drone to create a smell-seeking bio-hybrid – but it only detects the smell of a female moth"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/04/07153630/SEI_246276815.jpg",
    "summary": "Researchers have successfully integrated a moth antenna into drone electronics, creating a bio-hybrid device capable of detecting the specific scent of a female moth. This innovation marks a unique blend of biological components with technology, though its current application is limited to the identification of one particular smell.",
    "titles": [
      "Smell-seeking drone uses moth antenna to follow a scent"
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.972,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.45299999999999996,
    "normalized_score": 8.43
  },
  {
    "title": "Blood test predicts preeclampsia risk using RNA",
    "domain": "science",
    "location": "global",
    "published": "Tue, 08 Apr 2025 12:00:33 +0100",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A blood test can accurately predict whether someone without a known risk of preeclampsia is likely to develop the potentially fatal hypertensive pregnancy condition"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/04/08105441/SEI_246752277.jpg",
    "summary": "Researchers have developed a blood test that can accurately predict the likelihood of developing preeclampsia, a potentially fatal hypertensive condition during pregnancy, in individuals without previously known risk factors. This advancement offers a significant tool for early detection and preventive care in expectant mothers.",
    "titles": [
      "Blood test predicts preeclampsia risk using RNA"
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.944,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.44599999999999995,
    "normalized_score": 8.11
  },
  {
    "title": "How long is a day on Uranus? Slightly longer than we thought, it seems",
    "domain": "science",
    "location": "global",
    "published": "Tue, 08 Apr 2025 11:46:58 +0100",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Thanks to the Hubble Space Telescope, we now know that a day on Uranus lasts for 28 seconds longer than previously thought - a difference that could be crucial in planning future missions to the gas giant"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/04/08102827/SEI_246747964.jpg",
    "summary": "The Hubble Space Telescope has provided new data showing that a day on Uranus is 28 seconds longer than previously believed. This updated measurement is significant for the planning of future space missions to the gas giant.",
    "titles": [
      "How long is a day on Uranus? Slightly longer than we thought, it seems"
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.941,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.44525000000000003,
    "normalized_score": 8.08
  },
  {
    "title": "Trees capture toxic fingerprint of gold mining in the Amazon",
    "domain": "science",
    "location": "global",
    "published": "Tue, 08 Apr 2025 06:00:45 +0100",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Mercury pollution accumulating in trees could offer a new way to monitor destructive gold mining operations"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/04/07195915/SEI_246049660.jpg",
    "summary": "Scientists have discovered that mercury pollution, a byproduct of gold mining, is accumulating in trees. This finding offers a novel approach to track and monitor the environmental impact of gold mining operations by analyzing mercury levels in tree tissues.",
    "titles": [
      "Trees capture toxic fingerprint of gold mining in the Amazon"
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.861,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.42525,
    "normalized_score": 7.15
  },
  {
    "title": "Experimental medication helps treat cocaine addiction",
    "domain": "science",
    "location": "global",
    "published": "Mon, 07 Apr 2025 20:30:08 +0100",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A recently developed medication encourages people with cocaine use disorder to reduce their intake of the stimulant – a step towards the first approved drugs to treat the problem"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/04/07172220/SEI_246656352.jpg",
    "summary": "A new medication designed to help individuals with cocaine use disorder has shown promise in encouraging them to lower their cocaine intake. This development represents progress towards potentially the first approved drugs aimed at treating this specific disorder.",
    "titles": [
      "Experimental medication helps treat cocaine addiction"
    ],
    "score_components": {
      "magnitude": 0.22,
      "recency": 0.729,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.39825,
    "normalized_score": 5.91
  }
]