[
  {
    "title": "FBI Hunts Suspect in Fatal Shooting of Activist Charlie Kirk at Utah Event",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Thu, 11 Sep 2025 18:09:50 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Business Insider",
      "Al Jazeera",
      "CNBC",
      "ABC News",
      "Axios",
      "CityNews",
      "Financial Times",
      "LA Times",
      "The Guardian"
    ],
    "domains": [
      "www.cnbc.com",
      "www.businessinsider.com",
      "ottawa.citynews.ca",
      "www.latimes.com",
      "abcnews.go.com",
      "www.ft.com",
      "news.google.com",
      "www.aljazeera.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "The FBI has released photos of a person of interest in the fatal shooting of conservative activist Charlie Kirk.",
      "<a href=\"https://news.google.com/rss/articles/CBMif0FVX3lxTE84NHlabDJMTFp5ZGwxX18wamhGSEhwOG5tSFY2c2lhaGhHVDMxdk83cVhuTjA0VXF0ZE5DXzg2b2ladWNSZGJmSWxkRmJxQ0lYcVNrWjNoX1RyOWlIVTBFRWtUSEpXVUtEZWUtWko3MjdZZi1RMVIwSWVkd1VRY2c?oc=5\" target=\"_blank\">Roblox removes \"over 100 experiences\" tied to Charlie Ki",
      "<a href=\"https://news.google.com/rss/articles/CBMijwFBVV95cUxNRWpQY3RqQ0VJa0RjMExFOFpNN3N1aEsyQjZRb0otNlFxVUJxdHRwZUVwaHZwazFDcnRhMHNjdV93amJmbElIclBxYUdXQWJfSXhDNHhTQXd3bllzdTl2ZDA3dTQ1TmYwUzQtYkNTWlpoTk1pbVJqVE1oSW1IOVR4SjVWYzBpaWM4Rk5CeWdGaw?oc=5\" target=\"_blank\">Police release photo of \"person o",
      "The FBI released images of a person of interest sought in connection with the fatal shooting of Charlie Kirk during an event at Utah Valley University on Wednesday.",
      "Kirk, a close ally of President Donald Trump, was killed by a gunman during a political event at Utah Valley University in Orem.",
      "Agents recover a rifle as hunt continues for killer of conservative activist",
      "<p>Officials say rifle found and are offering compensation for information leading to person’s identification and arrest</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/live/2025/sep/11/charlie-kirk-shot-latest-news-updates-utah-university-donald-trump\">Charlie Kirk shooting: latest updat",
      "<p>Authorities said Thursday that they have fresh leads in their massive manhunt for a college-age shooter who killed Charlie Kirk.</p>",
      "Authorities said a \"high-powered, bolt-action rifle\" was recovered in a wooded area near the university where Charlie Kirk was shot on Wednesday.",
      "OREM, Utah (AP) — The shooter who assassinated conservative activist Charlie Kirk and then vanished off a roof and into the woods remained at large more than 24 hours later Thursday as federal investigators appealed for the public&#8217;s help by releasing a pair of photos of the person believed res",
      "<p>On Wednesday night, Charlie Kirk, an influential rightwing activist and Donald Trump ally, <a href=\"https://www.theguardian.com/us-news/2025/sep/11/charlie-kirk-death-political-violence-aftermath\">was shot dead</a> at a university campus in Utah. The US president immediately blamed the ‘radical l"
    ],
    "image_url": "",
    "titles": [
      "FBI releases photos of person of interest in Charlie Kirk shooting",
      "Roblox removes \"over 100 experiences\" tied to Charlie Kirk shooting - Axios",
      "Police release photo of \"person of interest\" in Charlie Kirk shooting death - Axios",
      "WATCH:  FBI releases images of person of interest amid manhunt for Charlie Kirk's killer",
      "Charlie Kirk shooting: FBI shares person of interest photos, offers $100,000 reward",
      "FBI releases images of ‘person of interest’ in Charlie Kirk shooting",
      "Charlie Kirk shooting: FBI releases images of person of interest and offers $100,000 reward",
      "FBI releases photos of 'person of interest' in Charlie Kirk shooting as manhunt intensifies",
      "FBI releases photos of 'person of interest' in Charlie Kirk shooter manhunt after rifle recovered",
      "FBI releases photos of person of interest in Charlie Kirk’s Utah university campus killing",
      "Where does the US go after the Charlie Kirk shooting? - podcast"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.882,
      "consensus": 1.0,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.836,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The FBI is actively searching for a person of interest in the fatal shooting of conservative activist Charlie Kirk, which occurred during a political event at Utah Valley University. Authorities have released photos of the suspect and recovered a high-powered, bolt-action rifle near the scene. Despite these developments, the shooter remains at large. Officials are offering a reward for information leading to the identification and arrest of the individual responsible for Kirk's death.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Bolsonaro Convicted of Coup Attempt, Sentenced to 27 Years",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 11 Sep 2025 23:55:12 GMT",
    "source": "BBC",
    "sources": [
      "New York Times",
      "Washington Post",
      "BBC",
      "ABC News",
      "Deutsche Welle"
    ],
    "domains": [
      "www.nytimes.com",
      "www.washingtonpost.com",
      "abcnews.go.com",
      "www.dw.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The former president has been found guilty of trying to mount coup to cling to power after he lost the election.",
      "The majority of a panel of Supreme Court justices voted to convict the far-right former Brazilian leader of trying to overturn his election defeat to Lula da Silva in 2022. He was sentenced to 27 years in prison.",
      "A panel of Brazilian Supreme Court justices has sentenced former president Jair Bolsonaro to 27 years and three months in prison after convicting him of attempting a coup to remain in office despite his 2022 electoral defeat",
      "Brazil’s Supreme Court ruled the former president tried to reverse his 2022 election loss with a plot that included plans to assassinate President Luiz Inácio Lula da Silva.",
      "Brazil’s Supreme Court convicted the former president of trying to cling to power after losing the 2022 election, including a plan to assassinate his opponent."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/5bba/live/8fe5ff20-8f61-11f0-824b-27b62254fc8b.jpg",
    "titles": [
      "Former president Bolsonaro sentenced to 27 years in prison for plotting Brazil coup",
      "Brazil: Bolsonaro sentenced to 27 years for attempted coup",
      "Brazil's Bolsonaro sentenced to more than 27 years in prison for coup attempt",
      "Bolsonaro sentenced to over 27 years in prison for coup plot in Brazil",
      "Bolsonaro Convicted of Attempting a Coup in Brazil, Sentenced to 27 Years in Prison"
    ],
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.973,
      "consensus": 0.995,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.834,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Former Brazilian President Jair Bolsonaro has been convicted by the country's Supreme Court for attempting a coup to stay in power after losing the 2022 election to Luiz Inácio Lula da Silva. The court found him guilty of plotting to overturn the election results, including plans to assassinate President Lula. Bolsonaro has been sentenced to 27 years and three months in prison.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Jason Collins, First Openly Gay NBA Player, Undergoes Brain Tumor Treatment",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Thu, 11 Sep 2025 19:20:20 EST",
    "source": "ESPN",
    "sources": [
      "Sports Illustrated",
      "Sportsnet",
      "ESPN",
      "Yahoo Sports"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com",
      "netswire.usatoday.com",
      "news.google.com"
    ],
    "snippets": [
      "Jason Collins, the NBA's first openly gay player who played through the 2013-14 season, is undergoing treatment for a brain tumor, his family said in a statement through the league.",
      "Former Brooklyn Nets center Jason Collins is undergoing treatment for a brain tumor, according to a statement from the NBA on Thursday.",
      "<a href=\"https://news.google.com/rss/articles/CBMiiwFBVV95cUxOdnI0RTV4LW53R19aeGFrMmJPX0I1c3NoNmhCb2N5WXJFeFBNWFg1SVJEcS1QVHFKUGdWalhMOUpoLTVmWG1MQlA0a29PTGZhMjdXdjIzRm1DWGVkUHM3SmxZZjZtY0RyQUplS3lvRXBFMjFBWS1vUmZ5cHE5YmdHWE5jQUxjQXdMaFJR?oc=5\" target=\"_blank\">Former NBA Center Jason Collins Undergo",
      "<p>Jason Collins, the NBA&#8217;s first openly gay player who now serves as an ambassador for the league, is undergoing treatment for a brain tumour, his family said Thursday.</p>"
    ],
    "image_url": "",
    "titles": [
      "Ex-NBA C Collins in treatment for brain tumor",
      "Former Nets center Jason Collins undergoing treatment for brain tumor",
      "Former NBA Center Jason Collins Undergoing Treatment for Brain Tumor - Sports Illustrated",
      "Former NBA player Jason Collins undergoing treatment for brain tumour"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.982,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.818,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Jason Collins, the first openly gay NBA player, is currently receiving treatment for a brain tumor, as confirmed by his family in a statement released through the NBA. Collins, who played until the 2013-14 season and later became an ambassador for the league, is being treated following the diagnosis.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Acquitted Players Eligible to Sign with NHL Teams After Suspension",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Thu, 11 Sep 2025 19:20:20 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN",
      "CityNews",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "www.sportsnet.ca",
      "www.espn.com",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "The NHL says the five players acquitted of sexual assault charges stemming from an alleged incident in 2018 will be eligible to sign a contract Oct. 15 and play Dec. 1.",
      "Five Hockey Canada players were charged with sexual assault before being acquitted in July",
      "<p>The NHL and NHLPA have agreed that the five players acquitted in the 2018 sexual assault trial will be suspended until Dec. 1, although they will have the opportunity to sign with NHL teams as soon as Oct. 15, Sportsnet has learned.</p>",
      "The NHL and NHLPA have agreed that the five players acquitted in the 2018 London sexual assault trial will be suspended until Dec. 1, although they will have the opportunity to sign with NHL teams as soon as Oct. 15, Sportsnet has learned.&#160; According to multiple sources, the players will not ap"
    ],
    "image_url": "",
    "titles": [
      "NHL: Hockey Canada players can return Dec. 1",
      "NHL issues suspension to Hockey Canada players acquitted in 2018 sexual assault trial",
      "Sources: NHL suspends players acquitted in 2018 sexual assault trial until Dec. 1",
      "Sources: NHL suspends players acquitted in 2018 sexual assault trial until Dec. 1"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.982,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.811,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Five players, previously charged and then acquitted of sexual assault from a 2018 incident, will be eligible to sign with NHL teams starting October 15. They will be suspended until December 1, following an agreement between the NHL and NHLPA.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Poland Restricts Air Traffic Near Eastern Border After Russian Drone Incursions",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 11 Sep 2025 23:46:28 GMT",
    "source": "BBC",
    "sources": [
      "Financial Times",
      "Deutsche Welle",
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.ft.com",
      "www.bbc.com",
      "www.theguardian.com",
      "www.dw.com"
    ],
    "snippets": [
      "Germany, the Netherlands and the Czech Republic will be sending Poland more support to defend Nato's eastern flank.",
      "Disinformation has been circulating since Poland shot down Russian drones. DW fact check debunks false viral claims.",
      "After 19 Russian drones breached Polish airspace, Poland's divided leaders are putting up a united front. They are also calling on the country's NATO allies to step up their support.",
      "Warsaw indicates Security Council will hold special session as it seeks international response to violation of airspace",
      "<p>Numerous European countries offer support but some allies dispute whether incident was deliberate attack</p><p>An emergency session of the UN security council will convene on Friday at Poland’s request as Warsaw seeks to rally support after an <a href=\"https://www.theguardian.com/world/2025/sep/1"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/9b5b/live/54efb050-8f52-11f0-9cf6-cbf3e73ce2b9.jpg",
    "titles": [
      "Nato strengthens defences after Russian drones shot down over Poland",
      "Fact check: Fake news after Russian drones downed in Poland",
      "Poland united and determined after Russian drone incursion",
      "UN to hold emergency meeting on Russian drone incursion, says Poland",
      "Emergency UN security council meeting convened after Russian drone incursion into Poland"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.97,
      "consensus": 0.908,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.81,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Poland has implemented air traffic restrictions along its eastern border, effective until December 9, in response to 19 Russian drones breaching its airspace. This move reflects a unified stance among Poland's leaders, who are also urging NATO allies for increased support. The restrictions are part of Poland's efforts to enhance its defenses following these airspace violations.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: effort, support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UK Ambassador Mandelson Dismissed Over Epstein Ties",
    "domain": "general",
    "source_domain": "www.bbc.co.uk",
    "location": "global",
    "published": "Thu, 11 Sep 2025 19:20:00 GMT",
    "source": "BBC",
    "sources": [
      "New York Times",
      "Washington Post",
      "BBC",
      "CNBC",
      "Financial Times"
    ],
    "domains": [
      "www.cnbc.com",
      "www.nytimes.com",
      "www.washingtonpost.com",
      "www.ft.com",
      "www.bbc.co.uk"
    ],
    "snippets": [
      "Keir Starmer sacks the US Ambassador a week before Trump’s state visit.",
      "Mandelson's apparent close friendship with Epstein was revealed in documents released by U.S. lawmakers this week.",
      "Veteran politician dismissed after days of criticism and email leaks",
      "British Prime Minister Keir Starmer fired Peter Mandelson after diplomats said “additional information” emerged about his links with sex offender Jeffrey Epstein.",
      "The British government said it withdrew the envoy after newly revealed emails showed the depth of his relationship with Jeffrey Epstein."
    ],
    "image_url": "https://ichef.bbci.co.uk/images/ic/240x135/p0l7jnbt.jpg",
    "titles": [
      "Peter Mandelson Sacked Over Epstein Messages",
      "UK sacks U.S. Ambassador Peter Mandelson over Epstein links",
      "Peter Mandelson sacked as UK ambassador to US over Epstein links",
      "U.K. dismisses ambassador to U.S. over links to Jeffrey Epstein",
      "U.K. Ambassador to U.S., Peter Mandelson, Fired Over Epstein Links"
    ],
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.885,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.806,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Peter Mandelson has been dismissed from his role as a U.K. ambassador due to his close relationship with the late sex offender Jeffrey Epstein. This decision came after leaked emails revealed Mandelson expressing a deep friendship with Epstein, referring to him as his \"best pal\" and expressing distress over Epstein's situation. The British government, led by Prime Minister Keir Starmer, acted after additional information about Mandelson's connections with Epstein emerged, including further anticipated correspondence. Mandelson's dismissal follows intense criticism and scrutiny over his ties to",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Belarus Releases 52 Prisoners Amid Sanctions Relief Efforts",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 11 Sep 2025 18:55:36 GMT",
    "source": "BBC",
    "sources": [
      "Al Jazeera",
      "New York Times",
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.nytimes.com",
      "www.aljazeera.com",
      "www.bbc.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Fifty-two prisoners have been released, but more than 1,000 political prisoners remain in jail.",
      "The release comes as the Belarusian president has sought to mend ties with the West in the hopes of sanctions relief.",
      "<p>Move seen as effort to win US favour and sanctions relief, as crackdown on dissent continues</p><p><a href=\"https://www.theguardian.com/world/belarus\">Belarus</a> has released 52 prisoners of various nationalities, after a visit by a US delegation to Minsk, in Alexander Lukashenko’s latest attemp",
      "The release came as Aleksandr Lukashenko, the country’s authoritarian leader and an ally of President Vladimir Putin of Russia, seeks to normalize ties with the Trump administration."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/8819/live/929f57c0-8f2a-11f0-b391-6936825093bd.jpg",
    "titles": [
      "Belarus frees political prisoners in exchange for easing of US sanctions",
      "Belarus frees 52 political prisoners after US mediation",
      "Belarus frees 52 political prisoners, including foreigners, after visit by US delegation",
      "Belarus Frees 52 Political Prisoners and Gets a Warm Thank-You From Trump"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.877,
      "consensus": 0.908,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.785,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Belarus has released 52 prisoners amidst efforts by President Aleksandr Lukashenko to improve relations with the West and seek sanctions relief. This move, following a US delegation's visit to Minsk, is seen as an attempt to gain favor with the US. However, over 1,000 political prisoners remain detained. Lukashenko, an ally of Russian President Vladimir Putin, continues to face criticism for his crackdown on dissent.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: effort, improve",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Charlie Kirk Fatally Shot at Utah Speaking Event; Shooter College-Aged",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 11 Sep 2025 23:23:59 GMT",
    "source": "BBC",
    "sources": [
      "Axios",
      "Deutsche Welle",
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.theguardian.com",
      "www.dw.com",
      "news.google.com"
    ],
    "snippets": [
      "The FBI releases new pictures of a \"person of interest\" as a large manhunt is under way for the suspect.",
      "The right-wing pundit died from a single gunshot at a Utah campus event. Authorities say they have footage of the shooter, who \"appears to be of college age.\" DW has the latest.",
      "<a href=\"https://news.google.com/rss/articles/CBMiekFVX3lxTFBFNEhoclJBZ1JFQjA3ZUphZGxtMWdoSFRvUGp2T1V0bFdHbjNkVElmd1VxUVJHQ1ZHZFhDOGhxRXJnOXlMclBxX3dpQTUtREhhWDRvOTRoTlFoTHNPME5GOEFTbWR6M1EtLTA3Q2tKMWh2WHlvQTN3UVl3?oc=5\" target=\"_blank\">Search ongoing for Charlie Kirk shooting suspect, rifle found n",
      "<p>Turning Point USA executive director has died after being shot during event at Utah Valley University</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/live/2025/sep/11/charlie-kirk-shot-latest-news-updates-utah-university-donald-trump\">Charlie Kirk shooting – follow the latest updates</"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/ac14/live/48996c50-8f08-11f0-9cf6-cbf3e73ce2b9.png",
    "titles": [
      "Rifle found but suspect still at large - what we know about Charlie Kirk shooting",
      "Charlie Kirk shooting: Rifle found but killer still at large",
      "Search ongoing for Charlie Kirk shooting suspect, rifle found near campus - Axios",
      "Charlie Kirk shooting death – what we know so far"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.963,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.782,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Charlie Kirk, a 31-year-old right-wing activist and ally of Donald Trump, was fatally shot at a speaking event at Utah Valley University in Orem, Utah. Authorities are investigating the incident and have identified the shooter as appearing to be of college age, based on footage. Kirk died from a single gunshot wound during the political event.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "\"Experts Share NFL DFS Picks for Key Washington vs. Green Bay Game\"",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Thu, 11 Sep 2025 23:44:10 +0000",
    "source": "CBS Sports",
    "sources": [
      "Yahoo Sports",
      "Sports Illustrated",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "www.fieldgulls.com",
      "www.bleedinggreennation.com",
      "news.google.com",
      "www.battleredblog.com"
    ],
    "snippets": [
      "SportsLine expert R.J. White has revealed his picks for Washington vs. Green Bay in the Week 2 NFL matchup on Thursday Night Football",
      "Jimmie Kaylor shares his top NFL DFS picks, daily fantasy optimal lineups, and NFL DFS stacks for Commanders vs. Packers on Thursday Night Football",
      "The SportsLine projection model has revealed its Green Bay vs. Washington picks for the 2025 NFL Week 2 Thursday Night Football game",
      "According to SportsLine's Inside the Lines team, one NFC squad on Thursday night has more to gain than any other team in Week 2",
      "It’s a battle between two NFC contenders in a strong Thursday Night Football opener.",
      "Watch this week’s TNF kickoff game here!",
      "They say if it’s on, it’s on, but is it really on?",
      "<a href=\"https://news.google.com/rss/articles/CBMimgFBVV95cUxQdlRlcjJQUlpEUzl3Wnk2R3Vob2g4M09veE1tNUlWbGRTSGp5MmRwazI2SGNHb0xSNjBVSGxTRlltQnF4VTYwRlh6aUJXcDBlRkptWVRrcHVNaGlpS3NSeDNHN1NxenY1MWNaRkFvUzM3VlZnRWhvR1RHaUJZLUV2ZkJObEUxZ0hFaUoxaW1VYTI3d08tOC1yeHhn?oc=5\" target=\"_blank\">Packers Limping Int"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/01/22/712d8352-02ba-402d-8db0-0e47d4eeeeba/terry-mclaurin-washington-commanders-usatsi.jpg",
    "titles": [
      "Thursday Night Football prediction, odds, line, spread: Packers vs. Commanders picks from expert on 77-32 roll",
      "NFL DFS picks, Thursday Night Football: Packers vs. Commanders daily fantasy lineups for DraftKings, FanDuel",
      "Commanders vs. Packers prediction, odds, time: 2025 NFL Week 2 Thursday Night Football picks from top model",
      "What's on the line in Commanders vs. Packers Week 2 Thursday Night Football game",
      "Thursday Night Football open thread: Commanders at Packers",
      "Thursday Night Football: Commanders vs. Packers",
      "Thursday Night Football Open Thread – Washington Commanders at Green Bay Packers",
      "Packers Limping Into Thursday Night Showdown vs. Commanders - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.99,
      "consensus": 0.829,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.77,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "SportsLine expert R.J. White and Jimmie Kaylor have shared their predictions and top NFL DFS picks for the Week 2 Thursday Night Football game between Washington and Green Bay. The SportsLine projection model also made its picks for the matchup. Coverage highlights the game as a significant contest between two NFC contenders, with implications for the standings early in the season. The outcome of this game could notably impact one NFC team's position in Week 2. The game is set to be a key highlight of Thursday Night Football's opening week.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Detained South Korean Workers Depart Georgia for Home Amid Uncertainty",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Thu, 11 Sep 2025 14:37:03 -0400",
    "source": "NPR",
    "sources": [
      "New York Times",
      "NPR",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "www.npr.org",
      "www.nytimes.com"
    ],
    "snippets": [
      "A plane carrying more than 300 workers from South Korea who were detained during an immigration raid at a battery factory in Georgia last week left Atlanta around noon Thursday, bound for South Korea.",
      "The plane carrying workers detained in an immigration raid of a Georgia Hyundai-LG plant last week left the U.S., bound for South Korea.",
      "It is unclear when the South Korean detainees will be repatriated. They were previously scheduled to depart the United States on Wednesday."
    ],
    "image_url": "",
    "titles": [
      "South Korean workers detained in immigration raid leave Atlanta and head home",
      "Plane carrying Hyundai, LG workers detained in immigration raid departs for South Korea",
      "Delayed Release of Workers Detained in Georgia Raid Fuels Anger in Korea"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.89,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.747,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A plane with over 300 South Korean workers, detained in an immigration raid at a Hyundai-LG battery factory in Georgia, departed from Atlanta for South Korea on Thursday. The repatriation was initially planned for Wednesday but was delayed. The current status of their repatriation remains unclear.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Brazil's Supreme Court Convicts Bolsonaro in Coup Plot",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Thu, 11 Sep 2025 15:13:28 -0400",
    "source": "NPR",
    "sources": [
      "Al Jazeera",
      "New York Times",
      "NPR"
    ],
    "domains": [
      "www.nytimes.com",
      "www.aljazeera.com",
      "www.npr.org"
    ],
    "snippets": [
      "A historic conviction: Brazil's Supreme Court delivers a majority vote to convict former President Jair Bolsonaro over a plot to overthrow the government.",
      "Sentence comes shortly after a majority of justices voted to convict the former Brazilian leader on five charges.",
      "Bolsonaro set to be sentenced on charges related to planning coup after three justices vote to convict.",
      "A majority of voting justices said they plan to vote to convict Brazil’s former president of trying to hold onto power. A final verdict could come Thursday."
    ],
    "image_url": "",
    "titles": [
      "Brazil's Supreme Court votes to convict ex-President Bolsonaro of a coup plot",
      "Brazil Supreme Court sentences Bolsonaro to 27 years in coup plot",
      "Updates: Brazil Supreme Court votes to convict Bolsonaro on all charges",
      "Brazil’s Supreme Court Is On Course to Convict Bolsonaro in Coup Plot"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.901,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.742,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Brazil's Supreme Court has convicted former President Jair Bolsonaro for plotting to overthrow the government, marking a historic verdict. The conviction followed a majority vote from the justices on five charges. Bolsonaro faces sentencing for his involvement in planning a coup, with three justices initially voting to convict. The court's decision signals a majority intent to convict him for attempting to retain power, with a final verdict expected by Thursday.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "OpenAI and Microsoft Update Partnership for AI Collaboration",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Thu, 11 Sep 2025 22:16:16 GMT",
    "source": "Axios",
    "sources": [
      "Business Insider",
      "Axios",
      "Ars Technica"
    ],
    "domains": [
      "arstechnica.com",
      "www.businessinsider.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMic0FVX3lxTE55bEFNZFUxcW11SV9kTGxiQ0h1NDIxLW1FLVY0RVdTcnZKTy1EYmZCRHVfdElLQzB4REd5VDVKaWhfVjdHZzFQbDNoOHYxLVdYUWlvd3lKNk1uV2lVWkgtOTMyQlJTcllHc0hPR2J2WEFHOFk?oc=5\" target=\"_blank\">OpenAI and Microsoft reach tentative deal to revise partnership</a>&nbsp",
      "OpenAI and Microsoft have reached a preliminary agreement over the terms of their partnership, moving forward a high-stakes AI alliance.",
      "Companies work to finalize terms as OpenAI pursues for-profit restructuring."
    ],
    "image_url": "",
    "titles": [
      "OpenAI and Microsoft reach tentative deal to revise partnership - Axios",
      "OpenAI and Microsoft reach tentative deal after dispute over partnership terms",
      "OpenAI and Microsoft sign preliminary deal to revise partnership terms"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.94,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.742,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "OpenAI and Microsoft have tentatively agreed to update their partnership terms, advancing their collaboration in artificial intelligence. Both parties are in the process of finalizing the agreement as OpenAI seeks to restructure into a for-profit entity.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: collaboration",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "SportsLine Releases Week 2 NFL Survivor Picks for ESPN Challenge",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Thu, 11 Sep 2025 11:37:15 EST",
    "source": "ESPN",
    "sources": [
      "Yahoo Sports",
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "www.bleedinggreennation.com",
      "www.espn.com"
    ],
    "snippets": [
      "NFL survivor pool strategy, predictions and picks for ESPN Eliminator Challenge Week 2.",
      "SportsLine's advanced computer model just locked in its top Week 2 NFL survivor picks",
      "﻿﻿Predicting the winners of this week’s football matchups."
    ],
    "image_url": "",
    "titles": [
      "Survivor pool strategy: The top teams to take in Week 2",
      "NFL football knockout, survivor pool picks, advice, strategy guide for Week 2, 2025: Dodge the Niners",
      "NFL Week 2 Game Picks"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.836,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.729,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "SportsLine's advanced computer model has released its Week 2 NFL survivor picks for the ESPN Eliminator Challenge. These selections are based on comprehensive data analysis to guide participants in making strategic choices for their survivor pools. The specific picks were not disclosed in the summary.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "U.S. Sues Uber for Alleged Discrimination Against Disabled Passengers",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Thu, 11 Sep 2025 20:40:34 GMT",
    "source": "CNBC",
    "sources": [
      "TechCrunch",
      "CNBC",
      "The Guardian"
    ],
    "domains": [
      "www.cnbc.com",
      "techcrunch.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "The suit seeks a jury trial and injunctive relief, monetary damages and to charge Uber a civil fine for violations of the Americans with Disabilities Act.",
      "<p>Justice department in lawsuit accuses company drivers of routinely refusing to serve people with disabilities</p><p>The US government sued Uber on Thursday, accusing the ride-sharing company of violating federal law by discriminating against passengers with disabilities.</p><p>In a complaint file",
      "It's the latest in a long line of criticism — and action against — about the company's treatment of people with physical disabilities."
    ],
    "image_url": "",
    "titles": [
      "Uber sued by DOJ for alleged discrimination against disabled riders",
      "US government sues Uber, alleging discrimination against disabled passengers",
      "Justice Department sues Uber for allegedly discriminating against people with disabilities"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.91,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.726,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The U.S. government filed a lawsuit against Uber, alleging the company discriminates against passengers with disabilities by allowing drivers to refuse service. The suit demands a jury trial, injunctive relief, monetary damages, and a civil fine for violations of the Americans with Disabilities Act. This action highlights ongoing concerns regarding Uber's treatment of individuals with physical disabilities.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Paramount Skydance Eyes Takeover of Warner Bros. Discovery",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 11 Sep 2025 22:17:29 GMT",
    "source": "BBC",
    "sources": [
      "CNBC",
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.cnbc.com",
      "www.bbc.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "The reported bid would be for a business which includes news network CNN, HBO, and the film studio behind Barbie and Harry Potter.",
      "The Wall Street Journal reported the recently merged Paramount Skydance was preparing a takeover bid for the entirety of WBD.",
      "Paramount Skydance CEO and Chairman David Ellison could buy Warner Bros. Discovery and add major TV and film franchises as well as sports rights to his empire.",
      "<p>Media conglomerate putting together majority cash offer for WBD backed by ultra-rich Ellison family, reports say</p><p>Paramount Skydance is reportedly preparing a takeover offer for Warner Bros Discovery, in a bid to pull together two of the largest US legacy media conglomerates and Hollywood mo"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/2d96/live/6ae12780-8f58-11f0-bdc4-01db39507e95.jpg",
    "titles": [
      "Warner Bros Discovery shares surge on buyout reports",
      "Paramount Skydance is preparing a bid for Warner Bros. Discovery, sources say",
      "Here's what Paramount Skydance would be buying in a deal for Warner Bros. Discovery",
      "Paramount Skydance reportedly preparing takeover bid for Warner Bros Discovery"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.941,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.725,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Paramount Skydance, led by CEO David Ellison, is reportedly preparing a takeover bid for Warner Bros. Discovery (WBD), aiming to merge two major media conglomerates. The deal would include assets like CNN, HBO, and the studios behind Barbie and Harry Potter. This move could significantly expand Ellison's media empire, incorporating a wide range of TV, film franchises, and sports rights. The bid is said to be primarily in cash, backed by the wealthy Ellison family.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Dolphins Hold Players-Only Meeting After 33-8 Loss to Colts",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Thu, 11 Sep 2025 19:20:20 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Yahoo Sports"
    ],
    "domains": [
      "ftw.usatoday.com",
      "www.espn.com"
    ],
    "snippets": [
      "The Dolphins held a players-only meeting Tuesday, two days after their 33-8 blowout loss to the Colts, to make sure the team remained \"on the same page.\"",
      "Well, the Dolphins already held a players-only meeting for the season."
    ],
    "image_url": "",
    "titles": [
      "Dolphins held players-only meeting after blowout",
      "Why the Dolphins held a players-only meeting after losing to the Colts"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.982,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.686,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Miami Dolphins conducted a players-only meeting on Tuesday, following a significant 33-8 defeat to the Colts. This session was aimed at ensuring team cohesion and alignment. This meeting marks the team's second such gathering of the season, emphasizing their effort to maintain unity amidst challenges.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump to Attend Yankee Stadium Game, Marking 9/11 Anniversary; Security Up",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Thu, 11 Sep 2025 19:20:20 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Yahoo Sports"
    ],
    "domains": [
      "www.espn.com",
      "www.sportingnews.com"
    ],
    "snippets": [
      "Security at Yankee Stadium will be tight with President Donald Trump attending Thursday's game to mark the 24th anniversary of the Sept. 11 attacks.",
      "The President is expected to be at the game in the Bronx."
    ],
    "image_url": "",
    "titles": [
      "Trump attends Yankees game on 9/11 anniversary",
      "Is Donald Trump at Yankees-Tigers? Latest updates on U.S. president's status for 9/11 anniversary at MLB game"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.982,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.683,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "President Donald Trump is set to attend a game at Yankee Stadium on Thursday to commemorate the 24th anniversary of the Sept. 11 attacks. Security will be significantly heightened for the event.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Browns' Delpit: Tackling Ravens' Henry \"Not Hard,\" Shows Team Confidence",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Thu, 11 Sep 2025 19:20:20 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "Browns safety Grant Delpit said it is \"not hard\" to tackle Derrick Henry.",
      "The Browns don't seem intimidated by the AFC powerhouse Ravens"
    ],
    "image_url": "",
    "titles": [
      "Browns' Delpit: 'Not hard' to bring down Henry",
      "Browns DB gives surprising answer when asked about stopping Ravens RB Derrick Henry: It's 'not hard'"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.982,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.676,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Browns safety Grant Delpit stated that tackling Derrick Henry is \"not hard,\" indicating a lack of intimidation by the Cleveland Browns towards the AFC powerhouse Ravens. This suggests confidence within the Browns team ahead of their matchup.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Week 2 NFL Fantasy Football Guide: Matchup Analysis & Lineup Tips",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Thu, 11 Sep 2025 19:20:20 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "An all-encompassing look at the matchups to exploit or avoid and lineup locks in fantasy, as well as projected scores for all NFL games.",
      "Matchup ratings for every player in Week 2 for PPR leagues",
      "Matchup ratings for every player in Week 2 for Non-PPR leagues"
    ],
    "image_url": "",
    "titles": [
      "🏈 Fantasy football playbook for NFL Week 2",
      "Fantasy Football 2025 Week 2 PPR Cheat Sheet: Player ratings to guide your toughest lineup calls",
      "Fantasy Football 2025 Week 2 Non-PPR Cheat Sheet: Player ratings to guide your toughest lineup calls"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.982,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.676,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "This report provides a comprehensive analysis of Week 2 NFL matchups for fantasy football players, including which matchups to leverage or steer clear of, and lineup recommendations. It offers projected scores for all NFL games and detailed matchup ratings for every player in both PPR (Points Per Reception) and Non-PPR leagues, aiding fantasy managers in making informed decisions for their Week 2 lineups.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "OpenAI, Microsoft Revise Partnership Ahead of Potential IPO",
    "domain": "business",
    "source_domain": "www.ft.com",
    "location": "global",
    "published": "Thu, 11 Sep 2025 23:48:48 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times",
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com",
      "www.ft.com"
    ],
    "snippets": [
      "Nonbinding term marks progress in talks to enable ChatGPT maker’s eventual IPO",
      "OpenAI and Microsoft say they reached a non-binding agreement on a revised partnership."
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F676164a8-92e8-4773-b692-99c0a63638a3.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "OpenAI and Microsoft sketch out deal to unlock for-profit restructuring",
      "OpenAI secures Microsoft’s blessing to transition its for-profit arm"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.971,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.656,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "OpenAI and Microsoft have reached a non-binding agreement on a revised partnership, marking progress in discussions aimed at facilitating OpenAI's potential future Initial Public Offering (IPO).",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Adobe Shares Fall in 2023 Despite Beating Wall Street Forecasts",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Thu, 11 Sep 2025 23:18:26 GMT",
    "source": "CNBC",
    "sources": [
      "MarketWatch",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "www.marketwatch.com"
    ],
    "snippets": [
      "Adobe shares have dropped this year, badly underperforming the broader market.",
      "The software company exceeds Wall Street’s revenue and earnings estimates, with AI-influenced revenue streams picking up steam"
    ],
    "image_url": "",
    "titles": [
      "Adobe's stock gains on earnings, revenue beat",
      "Adobe’s earnings beat shows investors that AI is finally paying off, and the stock rises"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.961,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.647,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Adobe's shares have fallen significantly in 2023, lagging behind the broader market performance. Despite this, the company has surpassed Wall Street's expectations for revenue and earnings, partly due to the growth of AI-influenced revenue streams.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Urges Fed to Lower Rates Amid Economic Concerns",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Thu, 11 Sep 2025 20:54:21 GMT",
    "source": "CNBC",
    "sources": [
      "Financial Times",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "www.ft.com"
    ],
    "snippets": [
      "Trump wants the Fed to slash rates in order to spur economic growth and reduce the cost of paying the nation's debts.",
      "US central bank set to make a pivotal decision on interest rates"
    ],
    "image_url": "",
    "titles": [
      "Trump asks appeals court to let him fire Lisa Cook before next week's Fed meeting",
      "Trump asks appeals court to let him fire Lisa Cook before next week’s Fed meeting"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.914,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.645,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Former President Trump has called for the Federal Reserve to cut interest rates to boost economic growth and lower the national debt payment costs. Meanwhile, the US central bank is approaching a critical decision on whether to adjust interest rates.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Authorities Probe Targeted Political Assassination Amid Rising Polarization",
    "domain": "business",
    "source_domain": "www.ft.com",
    "location": "global",
    "published": "Thu, 11 Sep 2025 22:36:08 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times",
      "LA Times"
    ],
    "domains": [
      "www.latimes.com",
      "www.ft.com"
    ],
    "snippets": [
      "Calls for retribution and a crackdown on the political left reinforce sense of polarisation in the country",
      "<p>Videos captured the attack that authorities call a targeted political assassination, showing Kirk struck in the neck by a single shot.</p>"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Fe8f7186f-d4c5-453e-a4bc-4a98ff450a6a.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "American right vows vengeance after killing of Charlie Kirk",
      "A single shot: What horrifying videos reveal about killing of Charlie Kirk"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.947,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.644,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Authorities are investigating a targeted political assassination after videos showed Kirk being fatally shot in the neck. The incident has sparked calls for crackdowns on the political left, highlighting the country's deepening polarization.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "FTC Increases Scrutiny on Big Tech Over Chatbot Safety Concerns",
    "domain": "business",
    "source_domain": "www.ft.com",
    "location": "global",
    "published": "Thu, 11 Sep 2025 18:14:14 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times",
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com",
      "www.ft.com"
    ],
    "snippets": [
      "Federal Trade Commission heaps pressure on Big Tech after high-profile cases of harm to young users of chatbots",
      "The federal consumer regulator seeks to learn about how AI companies evaluate the safety of their chatbots."
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F14f26854-170e-41de-a39f-7bb5155a0491.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "US regulator launches inquiry into AI ‘companions’ used by teens",
      "FTC launches inquiry into AI chatbot companions from Meta, OpenAI, and others"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.865,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.628,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Federal Trade Commission is increasing scrutiny on Big Tech regarding the safety of chatbots, especially after instances of harm to young users. The regulator aims to understand how AI companies assess chatbot safety.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]