[
  {
    "title": "Trump Deploys National Guard to Chicago, Faces Legal Challenge Over Portland",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sun, 05 Oct 2025 17:49:51 -0400",
    "source": "NPR",
    "sources": [
      "Fortune",
      "ABC News",
      "Axios",
      "Deutsche Welle",
      "Forbes",
      "Al Jazeera",
      "NPR"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.dw.com",
      "www.forbes.com",
      "www.npr.org",
      "abcnews.go.com",
      "news.google.com",
      "fortune.com"
    ],
    "snippets": [
      "The White House said Trump \"authorized\" the deployment of 300 Illinois National Guard members, after vowing to send troops into Chicago. Meanwhile, Guard members arrived in Oregon from California.",
      "The deployment would mark the latest escalation of Donald Trump’s use of US federal intervention in Democrat-led cities.",
      "Trump is deploying 300 troops to Chicago as part of his immigration and crime crackdown. But a similar order for Portland has been temporarily blocked.",
      "<a href=\"https://news.google.com/rss/articles/CBMieEFVX3lxTE1SNEQwYU1yYjl5Z2JlOXhkTWVGR0V1QXVXNTZXZTlOdEhPNU50MXlkOHNBcE5hVDBKeV9uYmJaUGxjLVZjdjFoaVUwbk91WTZvSkY0QjlSR0VINGF3R0tXZTNWZjFSempoclpWblNGcktuNERETmVJZw?oc=5\" target=\"_blank\">Newsom to sue Trump for sending California National Guard troops ",
      "Newsom says he'll sue White House over effort to send 300 California National Guard troops to Portland after a judge blocked Trump's attempts to deploy Oregon Guard.",
      "A federal judge already temporarily blocked the Trump administration from deploying the Oregon National Guard.",
      "“This action circumvents the court’s decision and threatens to inflame a community that has remained peaceful,” Portland's mayor said."
    ],
    "image_url": "",
    "titles": [
      "Trump federalizes the National Guard in Chicago, while troops arrive in Oregon",
      "Gov Newsom says Trump is sending California National Guard troops to Oregon",
      "US: Trump plans to deploy National Guard to Chicago",
      "Newsom to sue Trump for sending California National Guard troops to Oregon - Axios",
      "Newsom says he'll sue to keep Trump from sending California Guard to Portland",
      "Trump Sending California National Guard To Portland After Judge Blocked Oregon Guard Deployment, Newsom Says",
      "Trump sends California National Guard to Oregon after judge blocks him from using that state’s troops in Portland"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.952,
      "consensus": 1.0,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.875,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "President Trump authorized the deployment of 300 Illinois National Guard members to Chicago as part of his immigration and crime crackdown, while also attempting to send troops to Portland, Oregon. However, the deployment to Portland was blocked by a federal judge. In response, Trump is trying to send 300 California National Guard members instead, leading California Governor Newsom to announce plans to sue the White House. This marks an escalation in Trump's use of federal intervention in Democrat-led cities.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Yesavage's No-Hit Game and Guerrero's Slam Propel Blue Jays to 2-0 ALDS Lead",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sun, 05 Oct 2025 23:55:45 +0000",
    "source": "CBS Sports",
    "sources": [
      "Global News",
      "Sportsnet",
      "Yahoo Sports",
      "CBS Sports"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.nbcsports.com",
      "globalnews.ca",
      "www.cbssports.com"
    ],
    "snippets": [
      "Yesavage allowed no hits and struck out 11 of the 18 batters he faced on Sunday",
      "The Blue Jays have as many home runs (eight) as strikeouts (seven) through two games.",
      "Vladimir Guerrero Jr. hit a grand slam, Daulton Varsho hit two of Toronto's five homers and Trey Yesavage was masterful in his fourth career big-league start as the Blue Jays defeated the New York Yankees 13-7 on Sunday to take a 2-0 lead in the American League Division Series.",
      "<p>Trey Yesavage sliced and diced his way through the New York Yankees lineup in Game 2 of the ALDS, striking out nine, setting the record for most punchouts by a Toronto Blue Jays pitcher in the post-season.</p>",
      "<p>In the midst of their second straight offensive explosion against the New York Yankees, Toronto is entering historic territory.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/10/05/b507578d-88bc-4ab1-a6b8-1e7cd3ce0061/yesavage-getty-1.png",
    "titles": [
      "Trey Yesavage shuts down Yankees in ALDS Game 2 as Blue Jays rookie sets franchise strikeout record",
      "Yesavage sets Blue Jays postseason record with 11 Ks, Toronto thumps Yankees 13-7 in ALDS Game 2",
      "Blue Jays beat Yankees 13-7 in Game 2 of ALDS",
      "Trey Yesavage sets Blue Jays record for most strikeouts in playoff game",
      "Blue Jays set playoff franchise record with five home runs in Game 2"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.995,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.788,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Trey Yesavage delivered a no-hit performance with 11 strikeouts in his fourth big-league start, leading the Toronto Blue Jays to a 13-7 victory over the New York Yankees. This win gave the Blue Jays a 2-0 lead in the ALDS. Vladimir Guerrero Jr. contributed with a grand slam, while Daulton Varsho hit two of Toronto's five home runs. The team's performance has been historically significant, matching their home run tally (eight) with fewer strikeouts (seven) across two games.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Syria Holds First Parliamentary Elections Post-Assad Era",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sun, 05 Oct 2025 04:20:44 -0400",
    "source": "NPR",
    "sources": [
      "The Guardian",
      "New York Times",
      "CityNews",
      "NPR"
    ],
    "domains": [
      "www.npr.org",
      "www.nytimes.com",
      "www.theguardian.com",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "Syria is holding parliamentary elections on Sunday for the first time since the fall of the country's longtime autocratic leader, Bashar Assad, who was unseated in a rebel offensive in December.",
      "<p>After more than a decade of civil war, committee members will choose transitional parliament</p><p>Syria is holding its first parliamentary elections since the fall of its longtime ruler Bashar al-Assad, in a tentative step towards democratic polls that have been criticised as biased in favour of",
      "Syrians are voting indirectly, and President Ahmed al-Shara is appointing a third of the lawmakers. Still, some see this as a step forward after decades of dictatorship.",
      "DAMASCUS, Syria (AP) — Syria on Sunday held its first parliamentary elections, nearly a year after a rebel-led offensive unseated longtime autocratic leader Bashar Assad. The People’s Assembly will be tasked with passing a new elections law and constitution as the country moves through its post-Assa"
    ],
    "image_url": "",
    "titles": [
      "What to expect as Syria holds first parliamentary elections since Assad's ouster",
      "Syria holds first elections since fall of Bashar al-Assad",
      "Syria Chooses Its First Parliament Since End of Civil War",
      "Syria holds first elections since Assad’s ouster, marking a cautious step in political transition"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.719,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.758,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Syria conducted its first parliamentary elections since the ousting of Bashar Assad in December. President Ahmed al-Shara is appointing one-third of the lawmakers in these indirect elections. Despite the unconventional voting process, some view it as progress following years of autocratic rule.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Masked Figures Spotted at Mosque Before Fire Amid Manchester Tensions",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 05 Oct 2025 16:56:15 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "New York Times",
      "Al Jazeera",
      "BBC"
    ],
    "domains": [
      "www.nytimes.com",
      "www.aljazeera.com",
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The images are of two people in balaclavas seen outside the mosque before the large blaze spread.",
      "The attack in East Sussex comes as Britain sees a wave of protests demonising Muslims and asylum seekers.",
      "<p>Fire at mosque in Peacehaven on Saturday night left front entrance damaged and a car burnt out</p><p>A suspected arson attack on a mosque in an English seaside town is being investigated by police as a hate crime.</p><p>The front entrance to the mosque in Peacehaven, East Sussex, was damaged and ",
      "The attack came at a time of heightened anxiety after a deadly terrorist attack at a synagogue in Manchester."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/ab75/live/689ba000-a1fe-11f0-947b-6b8b23372a50.jpg",
    "titles": [
      "Police release photos of mosque arson suspects",
      "UK police probe suspected arson attack on mosque as ‘hate crime’",
      "Suspected arson attack at East Sussex mosque investigated as hate crime",
      "Fire at Peacehaven Mosque Is Being Treated as Hate Crime, UK Police Say"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.842,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.758,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A video shows two individuals wearing balaclavas at a mosque before a significant fire erupts. This incident occurred amidst increased tension following a fatal terrorist attack at a Manchester synagogue.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "White House Advisor Hopes for Deal to End Shutdown Amid Tax Credit Dispute",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Sun, 05 Oct 2025 15:28:52 GMT",
    "source": "Axios",
    "sources": [
      "Business Insider",
      "Axios",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "news.google.com",
      "www.businessinsider.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMihwFBVV95cUxNU0pXd1FFQ2xva1lRY3Y5WGNlbjkyekVyY184TGdRZjNiMmxEajk2ZFdUcFRqYmtpQ1gxb1QxYVd4akVnMUluUC1GWDBuckdpQ2ZLQ016eGJxOExQSnJBVThjUHAwdGdHcnhiWVduc0xuV3hnSEd0SG54QzV3bEI4VlA5ZTFiZ00?oc=5\" target=\"_blank\">Trump adviser: Layoffs will start if shutdow",
      "Democrats are holding firm on their health-care demands, pushing to include a permanent extension of enhanced premium tax credits in funding legislation.",
      "Top White House economic advisor Kevin Hassett said he's hopeful lawmakers can reach an agreement to end the government shutdown before layoffs begin."
    ],
    "image_url": "",
    "titles": [
      "Trump adviser: Layoffs will start if shutdown negotiations are \"going nowhere\" - Axios",
      "'There will start to be layoffs' if Trump decides shutdown talks have stalled, Hassett says",
      "Kevin Hassett says 'there will be layoffs' if Trump decides shutdown talks are not progressing"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.817,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.707,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Top White House economic advisor Kevin Hassett expressed hope for an agreement to end the government shutdown and prevent layoffs. The deadlock persists as Democrats demand a permanent extension of enhanced premium tax credits in the funding legislation.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Quebec's New \"Right-to-Repair\" Law Takes Effect to Protect Consumers",
    "domain": "business",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sun, 05 Oct 2025 21:47:30 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "Financial Post"
    ],
    "domains": [
      "financialpost.com",
      "globalnews.ca"
    ],
    "snippets": [
      "A new Quebec law came into effect Sunday aimed at protecting consumers against products intentionally designed with shorter lifespans while ensuring they have the information needed to repair and maintain goods they buy.",
      "MONTREAL &#8212; A new Quebec law came into effect Sunday aimed at protecting consumers against products intentionally designed with shorter lifespans while ensuring they have the information needed to repair and maintain goods they buy. Quebec&#8217;s so-called &#8220;right-to-repair&#8221; law, pa"
    ],
    "image_url": "",
    "titles": [
      "Quebec durable goods law comes into effect",
      "Quebec law to promote the sustainability of goods come into force"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.951,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.702,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A new \"right-to-repair\" law in Quebec came into effect on Sunday, aimed at protecting consumers from products designed with intentionally shorter lifespans. It ensures consumers have the necessary information to repair and maintain their purchases.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Taylor Swift's Album Movie Earns $33M in U.S. Opening",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Sun, 05 Oct 2025 15:17:22 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "MarketWatch",
      "Forbes"
    ],
    "domains": [
      "www.forbes.com",
      "www.cnbc.com",
      "www.marketwatch.com"
    ],
    "snippets": [
      "Taylor Swift's \"The Life of a Showgirl\" album movie generated an estimated $33 million domestically.",
      "The film, tied to Swift’s newly released “The Life of a Showgirl” album, grossed $15.8 million Friday alone.",
      "Swift’s new album represents an epic event for the music business, with sales of her music driving the fortunes of the entire industry."
    ],
    "image_url": "",
    "titles": [
      "Taylor Swift's 'The Life of a Showgirl' album release party snares $33 million domestically",
      "Taylor Swift’s ‘Official Release Party Of A Showgirl’ Hits No. 1 And Dominates Box Office During Single Weekend Run",
      "The release of Taylor Swift’s ‘The Life of a Showgirl’ is like Super Bowl Sunday for the music industry"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.814,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.7,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Taylor Swift's \"The Life of a Showgirl\" album movie earned around $33 million in the U.S., with $15.8 million coming in on its opening day. The film is linked to Swift's latest album release.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Yesavage Sets Blue Jays Record, Guerrero Jr. Hits Grand Slam in ALDS Victory",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sun, 5 Oct 2025 19:56:44 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "Rookie Trey Yesavage set a franchise postseason record by striking out 11 in 5 1/3 no-hit innings, Vladimir Guerrero Jr. hit the first postseason grand slam in team history and the Toronto Blue Jays beat the New York Yankees 13-7 to take a 2-0 ALDS lead.",
      "<p>Trey Yesavage showed that he was, in fact, &#8220;built for this&#8221; on Sunday with 5.1 innings of no-hit, 11-strikeout dominance against the Yankees.</p>\n<p>Shi Davidi has the story on how the rookie put the Blue Jays on the doorstep of the ALCS.</p>"
    ],
    "image_url": "",
    "titles": [
      "Yesavage fans 11 in playoff debut, Blue Jays roll",
      "Yesavage’s dominant playoff debut puts Blue Jays on brink of ALCS"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.995,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.679,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Rookie Trey Yesavage set a new franchise postseason record for the Toronto Blue Jays by striking out 11 and pitching 5 1/3 no-hit innings against the New York Yankees. Vladimir Guerrero Jr. hit the team's first postseason grand slam, leading the Blue Jays to a 13-7 victory and a 2-0 lead in the ALDS.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Manchester United Eyes Barcelona's Ter Stegen: Transfer Talk Report",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sun, 5 Oct 2025 15:42:14 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sports Illustrated"
    ],
    "domains": [
      "www.espn.com",
      "news.google.com"
    ],
    "snippets": [
      "Manchester United are among the Premier League clubs eyeing Barcelona goalkeeper Marc-André ter Stegen. Transfer Talk has the latest news and rumors.",
      "<a href=\"https://news.google.com/rss/articles/CBMifkFVX3lxTE1UU3pJSkdFODU0QVVWVHpsVzhZWnNZVE5UZVdBNGtIWWJ4aFJuc0tSQlhLdm9PVnIwSUtOeF9xN1hjeS1laDl0NS1nYm1xRjNmaFZXQUNBSVJTamhpYXpERVpCUEg2SXl1VnZNUkVrWkctSndJalVZQ1hfYndtUQ?oc=5\" target=\"_blank\">Man Utd ‘Enquire’ About Barcelona Goalkeeper Marc-Andre t"
    ],
    "image_url": "",
    "titles": [
      "Transfer rumors, news: Man United eye Barcelona keeper Ter Stegen",
      "Man Utd ‘Enquire’ About Barcelona Goalkeeper Marc-Andre ter Stegen - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.911,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.672,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Manchester United is reportedly interested in Barcelona goalkeeper Marc-André ter Stegen, according to Transfer Talk. This development is part of the latest news and rumors circulating in the football world.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Chargers' Hampton in Boot After Loss, Doubtful for Week 6",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sun, 05 Oct 2025 23:25:34 +0000",
    "source": "CBS Sports",
    "sources": [
      "Yahoo Sports",
      "CBS Sports"
    ],
    "domains": [
      "www.sportingnews.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "The Chargers already lost Najee Harris for the season",
      "Los Angeles Chargers rookie running back Omarion Hampton was spotted with a walking boot following the Week 5 loss to the Washington Commanders, which raises concerns about his Week 6 availability."
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/10/05/869da6dc-b37c-4c04-b0f3-3655b97f4895/omarion-hampton-chargers-injury.jpg",
    "titles": [
      "Omarion Hampton injury update: Chargers' star rookie RB leaves game against Commanders with ankle injury",
      "Chargers' Omarion Hampton gets concerning injury update after Week 5 loss"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.984,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.662,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Los Angeles Chargers rookie running back Omarion Hampton was seen wearing a walking boot after a Week 5 loss to the Washington Commanders, casting doubt on his availability for Week 6. This development follows the season-ending loss of Najee Harris, further impacting the Chargers' running back lineup.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Lions Beat Bengals 37-24, Secure Fourth Straight Win",
    "domain": "sports",
    "source_domain": "sports.yahoo.com",
    "location": "national",
    "published": "Sun, 05 Oct 2025 23:43:33 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Sportsnet",
      "Yahoo Sports"
    ],
    "domains": [
      "sports.yahoo.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "David Montgomery ran for a touchdown and threw for one on a trick play in his hometown, Jared Goff passed for three scores and the Detroit Lions rolled to their fourth straight win, 37-24 over the reeling Cincinnati Bengals on Sunday.  Montgomery, a seven-year veteran, had passing and rushing scores",
      "<p>David Montgomery ran for a touchdown and threw for one on a trick play in his hometown, Jared Goff passed for three scores and the Detroit Lions rolled to their fourth straight win, 37-24 over the reeling Cincinnati Bengals on Sunday.</p>"
    ],
    "image_url": "",
    "titles": [
      "David Montgomery dominates in his hometown as Lions beat Bengals 37-24",
      "David Montgomery dominates in his hometown as Lions beat Bengals"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.991,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.66,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "David Montgomery scored a touchdown both by running and executing a trick play in his hometown, while Jared Goff threw for three touchdowns, leading the Detroit Lions to a 37-24 victory against the Cincinnati Bengals. This win marks the Lions' fourth consecutive victory.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Bad Bunny Hosts SNL Season 51 Premiere, Addresses Super Bowl Criticism",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sun, 05 Oct 2025 14:38:49 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "Forbes"
    ],
    "domains": [
      "www.npr.org",
      "www.forbes.com"
    ],
    "snippets": [
      "Bad Bunny returned to <em>SNL </em>as a host for the second time, and the musician addressed criticism over his upcoming Super Bowl performance.",
      "Saturday Night Live kicked off its 51st season with host Bad Bunny and musical guest Doja Cat."
    ],
    "image_url": "",
    "titles": [
      "SNL roasts Trump in season premiere, as Bad Bunny addresses Super Bowl criticism",
      "Bad Bunny Hosts ‘SNL’ Season 51 Premiere With Doja Cat And Jon Hamm"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.891,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.658,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Bad Bunny hosted \"Saturday Night Live\" (SNL) for the second time as it launched its 51st season, with Doja Cat as the musical guest. During the episode, Bad Bunny addressed criticism regarding his upcoming Super Bowl performance.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Titans Score Unusual TD After Cardinals Fumble Interception",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sun, 05 Oct 2025 23:47:47 +0000",
    "source": "CBS Sports",
    "sources": [
      "Sportsnet",
      "CBS Sports"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.cbssports.com"
    ],
    "snippets": [
      "The football gods looked favorably upon Tennessee multiple times in Week 5",
      "<p>Watch as Tennessee Titans quarterback Cam Ward throws an interception which is fumbled by the Arizona Cardinals and then recovered by Tyler Lockett in the end zone for a wild touchdown score.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/10/05/9f5be22a-2729-45d7-ba10-f346e7359c5d/titans.jpg",
    "titles": [
      "Titans turn Cardinals' interception into Tennessee touchdown in one of the wildest plays of the year",
      "Titans score TD after Cardinals interception turns into fumble recovery"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.992,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.653,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In Week 5, the Tennessee Titans experienced a remarkable play when quarterback Cam Ward's interception was fumbled by the Arizona Cardinals and subsequently recovered by Tyler Lockett in the end zone, resulting in an unexpected touchdown for the Titans.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "France's MeToo Figure Gisèle Pelicot's Impact Fades; 51 Men Convicted",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 05 Oct 2025 23:07:07 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Gisèle Pelicot's dominant stance was seen as a moment in France's MeToo movement but the enthusiasm appears to be wilting.",
      "<p>Husamettin Dogan, 44, was sentenced to nine years in prison at trial of 51 men last year where all were found guilty</p><p>Gisèle Pelicot, who survived almost a <a href=\"https://www.theguardian.com/world/2024/sep/17/dominique-pelicot-france-rape-trial-testimony\">decade of rape</a> involving dozen"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/4476/live/3e104390-a04b-11f0-b687-23a5afa8b42e.jpg",
    "titles": [
      "As Gisèle Pelicot faces one of her rapists in court, what has changed in France?",
      "Gisèle Pelicot to attend appeals court as man convicted of raping her contests verdict"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.958,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.647,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Gisèle Pelicot became a notable figure in France's MeToo movement after surviving nearly a decade of rape. However, interest in her story and the movement seems to be fading. In a related case, Husamettin Dogan, 44, was sentenced to nine years in prison during a trial where 51 men were found guilty.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Georgia PM Vows Crackdown on Protesters, Accuses EU Envoy of Coup Support",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-10-05T19:34:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "The Guardian",
      "Deutsche Welle"
    ],
    "domains": [
      "www.dw.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Prime Minister Kobakhidze vowed \"no one will go unpunished\" after Saturday's clashes between police and anti-government protesters. The EU has rejected claims it backed overthrowing him as \"disinformation.\"",
      "<p>Irakli Kobakhidze accused EU ambassador of supporting ‘attempt to overthrow constitutional order’ </p><p>Georgia’s prime minister, Irakli Kobakhidze, has announced a sweeping crackdown on dissent, accusing demonstrators who tried to storm the presidential palace of aiming to topple his government"
    ],
    "image_url": "",
    "titles": [
      "Georgia's prime minister promises crackdown on dissent",
      "Georgia’s prime minister announces crackdown on dissent after Tbilisi protests"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.908,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.647,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Georgia's Prime Minister Irakli Kobakhidze has pledged a strict crackdown following clashes between police and anti-government protesters, accusing them of trying to overthrow the government. He also accused the EU ambassador of supporting this alleged coup, a claim the EU has labeled as disinformation. Kobakhidze emphasized that \"no one will go unpunished\" in response to the Saturday protests.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Rescue Teams Deployed on Everest, Hundreds Safe After Blizzard",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 05 Oct 2025 19:28:48 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Rescue teams have been deployed to clear the snow on the world's highest mountain, Chinese state media reports.",
      "<p>Hundreds of trekkers stranded by blizzard on eastern face of mountain in Tibet already guided to safety by rescuers</p><p>Rescue efforts are under way on Mount Everest after a snowstorm trapped nearly 1,000 people in campsites on the eastern side of the mountain, according to Chinese state media."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/3a26/live/bb0f5800-a225-11f0-928c-71dbb8619e94.jpg",
    "titles": [
      "Rescue efforts under way after 1,000 people trapped on Mount Everest slopes",
      "Mount Everest rescue under way after snowstorm traps nearly 1,000 people"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.888,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.643,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Rescue teams were deployed on Mount Everest to clear snow after a blizzard trapped nearly 1,000 people. Chinese state media reports that hundreds of trekkers on the mountain's eastern face in Tibet have been guided to safety. The rescue efforts are ongoing.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "New Orleans Wins First Game Since December, Rattler Celebrates with Sprint",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sun, 05 Oct 2025 20:54:42 +0000",
    "source": "CBS Sports",
    "sources": [
      "Sportsnet",
      "CBS Sports"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.cbssports.com"
    ],
    "snippets": [
      "New Orleans won its first game since Dec. 8 last year",
      "<p>Spencer Rattler was so fired up by the sight of Rashid Shaheed hauling in his deep throw down the right sideline that the second-year quarterback started sprinting the length of the field to join the celebration.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/10/05/a5124d8e-d187-4910-8482-6759f4a3e036/getty.jpg",
    "titles": [
      "Spencer Rattler becomes first QB drafted by Saints to win a game for New Orleans since 1998",
      "Saints’ Spencer Rattler get first win over mistake-prone Giants"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.934,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.642,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "New Orleans celebrated its first game win since December 8 of the previous year. In the game, second-year quarterback Spencer Rattler was notably excited, sprinting the length of the field to celebrate after his successful deep throw was caught by Rashid Shaheed.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Tom English Chronicles Russell Martin's Decline at Rangers",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 05 Oct 2025 23:17:42 GMT",
    "source": "BBC",
    "sources": [
      "Yahoo Sports",
      "BBC"
    ],
    "domains": [
      "www.bbc.com"
    ],
    "snippets": [
      "BBC Sport Scotland's chief sportswriter Tom English charts the downfall of Russell Martin at Rangers.",
      "BBC Sport Scotland's chief sportswriter Tom English charts the downfall of Russell Martin at Rangers."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/9933/live/02af8be0-a239-11f0-928c-71dbb8619e94.jpg",
    "titles": [
      "'Martin's excruciating Rangers era finally at a chaotic conclusion'",
      "'Martin's excruciating Rangers era finally at a chaotic conclusion'"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.961,
      "consensus": 0.571,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.642,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Scotland's chief sportswriter Tom English details the decline of Russell Martin at Rangers. Martin, a former captain, struggled with form and fitness, leading to his departure from the club. English highlights the challenges Martin faced and the impact on his career.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Russell Martin Sacked as Rangers Coach, Gerrard Considered for Role",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 05 Oct 2025 20:45:18 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Russell Martin is sacked as Rangers head coach after 17 games in charge in the wake of Sunday's 1-1 draw with Falkirk.",
      "<ul><li><p>Martin dismissed after fans surround team bus at Falkirk</p></li><li><p>Former Ibrox manager under strong consideration</p></li></ul><p>Steven Gerrard is under strong consideration for a return to Rangers after the Scottish club confirmed the sacking of Russell Martin.</p><p>Martin’s ill-"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/4060/live/241bbf50-a235-11f0-92db-77261a15b9d2.jpg",
    "titles": [
      "Rangers sack head coach Russell Martin after 17 games",
      "Steven Gerrard in frame for Rangers return after Russell Martin is sacked"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.912,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.637,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Russell Martin was sacked as Rangers head coach after 17 games, following a 1-1 draw with Falkirk. His dismissal came after fans surrounded the team bus. Steven Gerrard is now under strong consideration for the role.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Candles Lit for Manchester Attack Victims; Hamas Leadership Weakened",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 05 Oct 2025 19:50:23 GMT",
    "source": "BBC",
    "sources": [
      "Deutsche Welle",
      "BBC"
    ],
    "domains": [
      "www.dw.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Candles were also lit for those affected by a deadly attack outside a Manchester synagogue on Thursday.",
      "The military leadership of Hamas has been decimated, and it is unclear how many fighters the group still has. Still, it remains able to conduct guerrilla attacks."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/e22f/live/65e7d860-a203-11f0-b741-177e3e2c2fc7.jpg",
    "titles": [
      "Thousands gather in London to mark two years since 7 October attacks",
      "How strong is Hamas two years after October 7 attacks?"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.895,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.634,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Candles were lit in memory of victims of a fatal attack outside a Manchester synagogue on Thursday. Meanwhile, Hamas's military leadership has suffered significant losses, diminishing its numbers. Despite this, the group retains the capability to carry out guerrilla attacks.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Moscow Escalates Attacks on Ukraine's Energy Infrastructure",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sun, 05 Oct 2025 13:58:04 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Washington Post",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.washingtonpost.com"
    ],
    "snippets": [
      "Moscow has stepped up its attacks in recent weeks, particularly on Ukraine&#039;s energy grid and gas production sites.",
      "The drone and missile assault hit nine regions and left tens of thousands without electricity as Russia ramps up its energy war ahead of winter in Ukraine."
    ],
    "image_url": "",
    "titles": [
      "Five killed across Ukraine in overnight Russian attacks",
      "Russian air attack across Ukraine damages energy networks, kills five"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.808,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.631,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Moscow increased its attacks on Ukraine, targeting the country's energy grid and gas production sites, affecting nine regions. The drone and missile strikes have left tens of thousands without electricity, intensifying Russia's energy war on Ukraine as winter approaches.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]