[
  {
    "title": "Judge Rules Trump Admin Unlawfully Froze Harvard Grants; White House to Appeal",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Wed, 03 Sep 2025 19:52:10 -0400",
    "source": "NPR",
    "sources": [
      "BBC",
      "CNBC",
      "Forbes",
      "NPR"
    ],
    "domains": [
      "www.forbes.com",
      "www.npr.org",
      "www.bbc.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "The ruling is a legal victory for Harvard but the White House says it will appeal the decision.",
      "A court rules the Ivy League college's free speech rights were violated, but the White House vows to appeal.",
      "The Trump administration in April froze grants to Harvard University over concerns about antisemitism on the Ivy League campus and other concerns.",
      "Harvard is the only prestigious university that has sued over antisemitism allegations lobbed by the Trump administration after on-campus pro-Palestinian protests in 2024."
    ],
    "image_url": "",
    "titles": [
      "Trump administration illegally froze billions in Harvard funds, judge rules",
      "Judge overturns Trump administration funding cuts to Harvard",
      "Judge voids $2.2 billion Harvard funding freeze by Trump administration",
      "Trump Administration’s $2.2 Billion Harvard Funding Freeze Ruled Unconstitutional"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.841,
      "consensus": 0.908,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.799,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A judge ruled that the Trump administration unlawfully violated Harvard University's free speech rights by freezing $2.6 billion in grants due to concerns over antisemitism and other issues. This decision marks a legal win for Harvard, which is the only Ivy League school to sue the administration following allegations of antisemitism after pro-Palestinian protests on campus. However, the White House has announced plans to appeal the ruling.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Auger-Aliassime Beats de Minaur to Reach US Open Semifinals",
    "domain": "sports",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Thu, 04 Sep 2025 06:08:28 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Sky Sports",
      "CityNews",
      "Sportsnet",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.sportsnet.ca",
      "www.skysports.com",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "Top-seed Jannik Sinner cruised through the semifinals, losing only seven games to Italian compatriot Lorenzo Musetti.",
      "World No 1 Jannik Sinner surged into the US Open semi-finals against Felix Auger-Aliassime after another dominant display at Flushing Meadows.",
      "<p>The Canadian knocked off No. 8 seed Alex de Minaur of Australia 4-6, 7-6, 7-5, 7-6 to reach the semifinals of the Grand Slam tournament. </p>",
      "<p>Canada&#8217;s Felix Auger-Aliassime explains his mentality to persevere through a long match against Alex de Minaur and his focus on preparing for the US Open semifinals. </p>",
      "<p>Watch as Canada&#8217;s Felix Auger-Aliassime defeats Australia&#8217;s Alex de Minaur after a four-hour bout to advance to the US Open semifinals.</p>",
      "Félix Auger-Aliassime has passed another big test at the US Open. The Canadian knocked off No. 8 seed Alex de Minaur of Australia 4-6, 7-6 (7), 7-5, 7-6 (4) to reach the semifinal of the Grand Slam tournament. It is the first time since 2021 that Auger-Aliassime, who improved to 3-1 against de Minau"
    ],
    "image_url": "",
    "titles": [
      "US Open: Sinner dominates Musetti to set up semifinal with Auger-Aliassim",
      "Scintillating Sinner surges into US Open semi-final against Auger-Aliassime",
      "Canada’s Auger-Aliassime beats de Minaur, to face Sinner in US Open semifinals",
      "‘It’s not over’: Canada’s Auger-Aliassime focused on US Open semifinals",
      "Auger-Aliassime upsets de Minaur to advance to US Open semifinals",
      "Canada’s Félix Auger-Aliassime punches ticket to US Open semifinal"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.958,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.781,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Félix Auger-Aliassime defeated No. 8 seed Alex de Minaur 4-6, 7-6, 7-5, 7-6 to reach the US Open semifinals after a four-hour match. This victory marks Auger-Aliassime's advancement to his first Grand Slam semifinal since 2021, improving his head-to-head record against de Minaur to 3-1.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "U.S. Appeals to Supreme Court to Uphold Trump's Tariffs",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Thu, 04 Sep 2025 00:32:49 -0400",
    "source": "NPR",
    "sources": [
      "CNBC",
      "Axios",
      "NPR"
    ],
    "domains": [
      "news.google.com",
      "www.npr.org",
      "www.cnbc.com"
    ],
    "snippets": [
      "The government called on the court to reverse an appeals court ruling that found most of President Donald Trump's tariffs are an illegal use of an emergency powers law.",
      "<a href=\"https://news.google.com/rss/articles/CBMidkFVX3lxTFBXaGhIRjRzdmgtOEIxSW9EZ2tUX0VaaEJwaUlGWVl1SUpaVHI3WHNlVXJjOTk5dDIzbGpnWWRzLUNPMzdSUElCQWtvLThfeXhNbjcyeVM0VFFRT2Q4dmtNaDdNZExhdTdSX1lobGhPT01hTWJSZUE?oc=5\" target=\"_blank\">Trump administration files appeal to Supreme Court to keep tariffs i",
      "The fate of most of President Trump's tariffs are at stake in the appeal, which seeks to overturn lower-court rulings finding he usurped Congress' authority."
    ],
    "image_url": "",
    "titles": [
      "Trump asks Supreme Court to reverse tariffs ruling finding them illegal",
      "Trump administration files appeal to Supreme Court to keep tariffs in place - Axios",
      "Trump asks Supreme Court to quickly hear appeal to save his tariffs"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.927,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.761,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The U.S. government has appealed to the Supreme Court to overturn a lower court's decision that deemed most of President Donald Trump's tariffs illegal, arguing they were an improper use of emergency powers. This move seeks to preserve the tariffs, challenging the prior ruling that Trump overstepped Congress' authority.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Lisbon Funicular Derailment Kills 15, Injures 18 in Tragic Accident",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Wed, 03 Sep 2025 20:59:30 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Washington Post",
      "New York Times",
      "Deutsche Welle",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.nytimes.com",
      "www.washingtonpost.com",
      "www.dw.com"
    ],
    "snippets": [
      "Crash of the historic Elevador da Gloria funicular is one of Lisbon’s deadliest transport accidents in years.",
      "At least 15 people were killed and 18 more injured when the iconic funicular derailed in the Portuguese capital. The precise cause of the accident remains unclear.",
      "Lisbon’s funiculars — a type of cable car running on rails up and down a steep slope — are a popular tourist destination in the city.",
      "The funicular line, one of three in Lisbon, is a popular tourist attraction."
    ],
    "image_url": "",
    "titles": [
      "At least 15 killed as funicular railcar derails in Portugal’s Lisbon",
      "Portugal: At least 15 dead in Lisbon funicular accident",
      "15 killed, 18 injured after Lisbon’s popular Glória funicular derails",
      "At Least 15 Dead After Lisbon Funicular Derails and Crashes, Officials Say"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.792,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.755,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A funicular derailment in Lisbon resulted in at least 15 deaths and 18 injuries, marking one of the city's deadliest transport accidents in years. The incident involved the historic Elevador da Gloria, a popular tourist attraction. Lisbon's mayor declared it a tragic moment for the city, and a day of mourning has been announced.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "NFL's Goodell Open to Taylor Swift Super Bowl Show, No Talks Confirmed",
    "domain": "sports",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Wed, 03 Sep 2025 21:02:39 GMT",
    "source": "Axios",
    "sources": [
      "Sky Sports",
      "Business Insider",
      "Sportsnet",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "www.sportsnet.ca",
      "www.skysports.com",
      "www.businessinsider.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMigAFBVV95cUxQRWszbkRXT2VqTHRSV2F4a215WmktenVNVjZMa211STlRNEpveEw5X2JJdnRhbjR4VE81R0d3eUZhakdyVWM2dGtqMy1WQkczSGtoLXdvbTlWaF9maXB6Z195VUhQZEZ0MlVZbjA0ano3Ri1NaWpzeTZ2VWs4clVaYw?oc=5\" target=\"_blank\">Taylor Swift Super Bowl halftime not ruled out by NFL",
      "\"It's a maybe,\" NFL Commissioner Roger Goodell said of the chances of Taylor Swift performing at next year's Super Bowl halftime show.",
      "The tantalising prospect of Taylor Swift performing at the Super Bowl half-time show in February is a 'maybe', according to NFL commissioner Roger Goodell.",
      "<p>Appearing on the TODAY show Wednesday morning, NFL commissioner Roger Goodell addressed the possibility of pop star Taylor Swift performing the halftime show at Super Bowl LX.</p>"
    ],
    "image_url": "",
    "titles": [
      "Taylor Swift Super Bowl halftime not ruled out by NFL commissioner - Axios",
      "NFL commissioner says Taylor Swift would be 'welcome at any time' on the Super Bowl halftime stage",
      "Taylor Swift to play Super Bowl show? NFL commissioner says 'maybe'",
      "Goodell says Taylor Swift performing Super Bowl halftime show a ‘maybe’"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.776,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.744,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "NFL Commissioner Roger Goodell did not confirm any official discussions regarding Taylor Swift performing at the Super Bowl halftime show but expressed that the NFL would be thrilled to have her. Despite the lack of confirmation, fan speculation is high, with some pointing to cryptic references in Swift's work as hints she might be the next performer.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Alex Matthews to Captain England vs Australia in World Cup Pool Match",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 04 Sep 2025 07:48:28 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Yahoo Sports",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com",
      "www.independent.co.uk"
    ],
    "snippets": [
      "Number eight Alex Matthews will captain England against Australia in their final Rugby World Cup pool match on Saturday.",
      "Matthews, a 2014 World Cup winner, leads the side in the continued absence of skipper Zoe Aldcroft as England seek top spot in Pool A",
      "<ul><li><p>Victory would cement England’s position at top of Pool A</p></li><li><p>Jess Breach will win 50th cap on the left wing in Brighton</p></li></ul><p>Alex Matthews will captain England for only the second time in her career in their final pool match of the Rugby World Cup against Australia, "
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/eb7a/live/5c0f70d0-6139-11ee-ac8c-9d18dbc280ea.png",
    "titles": [
      "Matthews to captain England against Australia",
      "Alex Matthews to captain England against Australia as Jess Breach wins 50th cap in Women’s World Cup",
      "Alex Matthews to captain England in final World Cup pool game against Australia"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.971,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.738,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Alex Matthews will captain England in their final Rugby World Cup pool match against Australia, aiming for a victory to secure the top spot in Pool A. This marks her second captaincy in her career. The match also features Jess Breach winning her 50th cap. England is playing without regular skipper Zoe Aldcroft.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Florida Lawmakers to Vote on Ending School Vaccine Mandates",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Wed, 03 Sep 2025 15:16:08 -0400",
    "source": "NPR",
    "sources": [
      "CNBC",
      "Ars Technica",
      "NPR"
    ],
    "domains": [
      "www.npr.org",
      "www.cnbc.com",
      "arstechnica.com"
    ],
    "snippets": [
      "Florida lawmakers will vote whether to repeal a law that requires children to receive vaccines for polio, diphtheria, measles, and mumps before entering school.",
      "The move would make Florida the first U.S. state to withdraw from mandates credited with boosting vaccination rates and preventing infectious disease outbreaks.",
      "Exposing vulnerable people to vaccine-preventable disease is just part of life, Ladapo said."
    ],
    "image_url": "",
    "titles": [
      "Florida working to end vaccine mandates",
      "Florida to become first state to end all vaccine mandates, including in schools",
      "In win for infectious diseases, Florida to end all school vaccine requirements"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.764,
      "consensus": 0.789,
      "constructiveness": 0.2,
      "proximity": 0.75
    },
    "score": 0.735,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Florida lawmakers are set to vote on repealing a law mandating vaccines for schoolchildren against diseases like polio and measles. Critics label the plan a public health risk, while Florida could become the first state to eliminate such mandates. Joseph Ladapo, known for his vaccine skepticism, supports the repeal, stating exposure to vaccine-preventable diseases is a part of life.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: plan, support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "American Eagle Sees Surge in Sales, Credits Sweeney and Kelce Campaigns",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 04 Sep 2025 01:20:00 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Business Insider",
      "CNBC"
    ],
    "domains": [
      "www.businessinsider.com",
      "www.bbc.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "The US actress was part of the company's controversial \"Great Jeans\" campaign which drew a backlash.",
      "American Eagle said its Sydney Sweeney campaign is its best ever, leading to positive gains in new customers, sales and foot traffic.",
      "American Eagle stock surged as the company reported that Sydney Sweeney's jeans campaign and Travis Kelce's new collection were successes."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/b729/live/d4fc4a90-8923-11f0-b925-b728614782d0.jpg",
    "titles": [
      "American Eagle shares soar as Sydney Sweeney ads seen driving sales",
      "American Eagle stock soars 20% as retailer says Sydney Sweeney campaign is 'best' to date, beats earnings",
      "American Eagle's stock is soaring as Sydney Sweeney and Travis Kelce's star power jolts sales"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.849,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.724,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "American Eagle reported significant positive impacts from its promotional campaigns featuring Sydney Sweeney and Travis Kelce, including an increase in new customers, sales, and foot traffic. The company's stock surged following the announcement of better-than-expected same-store sales forecasts, attributed to the successful marketing efforts.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Deputy PM Rayner Admits to Stamp Duty Error, Faces Ethics Review",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 04 Sep 2025 04:24:12 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian",
      "Financial Times"
    ],
    "domains": [
      "www.bbc.com",
      "www.ft.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Angela Rayner's admission that she underpaid stamp duty on her flat in Hove dominates Thursday's papers.",
      "Deputy prime minister faces hefty stamp duty bill as she waits for government ethics adviser to rule on affair",
      "<p>Deputy prime minister expresses regret over mistake that led to underpayment of stamp duty on £800,000 flat</p><p>Angela Rayner is battling for her political survival after she admitted underpaying stamp duty on her £800,000 seaside flat and referred herself to the ministerial ethics adviser afte"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/b50e/live/134310d0-891b-11f0-b391-6936825093bd.jpg",
    "titles": [
      "Rayner 'clings on' as she 'fights for political survival'",
      "Angela Rayner fights for political survival after property tax admission",
      "Rayner battling for political survival after referring herself to ethics adviser"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.905,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.718,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Angela Rayner, the Deputy Prime Minister, admitted to underpaying stamp duty on her £800,000 flat in Hove and has referred herself to the government's ethics adviser. She expressed regret over the mistake and now faces a hefty bill. The affair dominates headlines as Rayner battles for her political survival.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "US Military Strike Kills 11 on Venezuelan Boat, Raises Regional Concerns",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Wed, 03 Sep 2025 22:32:45 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Washington Post",
      "Deutsche Welle",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.washingtonpost.com",
      "www.dw.com"
    ],
    "snippets": [
      "US threats of expanding military attacks across Latin America have alarmed some regional leaders, including in Mexico.",
      "President Donald Trump has justified the US military's lethal strike on a boat allegedly owned by a Venezuelan gang. Meanwhile, top US officials have vowed to continue the strikes.",
      "The administration has not provided a legal authority or justification for the attack Tuesday that killed 11 people."
    ],
    "image_url": "",
    "titles": [
      "US will bomb more vessels suspected of drug smuggling, Rubio says",
      "US says attacks on suspected drug boats will happen again",
      "Trump ordered strike on suspected drug boat to send a message, Rubio says"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.818,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.714,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The US, under President Trump, conducted a military strike on a boat owned by a Venezuelan gang, killing 11 people. This action, part of a broader threat to expand military attacks in Latin America, has raised concerns among regional leaders, including Mexico. The US administration has yet to provide a legal justification for the attack.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Anisimova Defeats Swiatek in US Open Quarter-Finals, Advances to Semis",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 04 Sep 2025 01:19:49 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.cbssports.com",
      "www.bbc.com",
      "www.espn.com"
    ],
    "snippets": [
      "Amanda Anisimova says she rewatched her Wimbledon final defeat by Iga Swiatek to inspire her to victory over the second seed in the US Open quarter-finals.",
      "Fewer than two months ago, Swiatek bested Anisimova in the Wimbledon final 6-0, 6-0. On Wednesday, Ansimova got her revenge.",
      "Anisimova had plenty of motivation on Wednesday to advance to the semifinals in New York"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/32c5/live/3421b900-8911-11f0-9cf6-cbf3e73ce2b9.jpg",
    "titles": [
      "How rewatching 'painful' Wimbledon final inspired Anisimova to beat Swiatek",
      "The ultimate upset: How Amanda Anisimova beat Iga Swiatek",
      "US Open 2025 results: Amanda Anisimova upsets No. 2 Iga Swiatek to reach semifinals after Wimbledon disaster"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.849,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.707,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Amanda Anisimova avenged her Wimbledon final defeat to Iga Swiatek by beating the second seed in the US Open quarter-finals. Less than two months after losing 6-0, 6-0 to Swiatek, Anisimova used the loss as motivation to win and advance to the semifinals in New York.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Lisbon Funicular Derailment Kills 15, Injures 18",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 03 Sep 2025 21:33:06 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "New York Times",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.nytimes.com",
      "www.bbc.com"
    ],
    "snippets": [
      "At least 15 people died after a car on Lisbon's famous funicular railway derailed and crashed.",
      "A Lisbon streetcar, one of the city’s major tourist attractions, derailed on Wednesday, leaving 15 dead and 18 injured.",
      "At least 15 people were killed after the Glória funicular, one of the city’s most popular tourist attractions, derailed and crashed."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/6ed7/live/ee893a60-895d-11f0-b391-6936825093bd.jpg",
    "titles": [
      "How did Lisbon's iconic funicular derail? What we know so far",
      "Lisbon’s Gloria funicular derails: What we know about the cause and victims",
      "Lisbon Funicular Crash: What to Know About Cause and Victims"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.784,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.701,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A tragic incident occurred in Lisbon when the Glória funicular, a major tourist attraction, derailed and crashed, resulting in at least 15 fatalities and 18 injuries. This event took place on Wednesday.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Putin, Xi Discuss Immortality Through Organ Transplants in Leaked Chat",
    "domain": "general",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Wed, 03 Sep 2025 16:21:25 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "Ars Technica",
      "New York Times"
    ],
    "domains": [
      "arstechnica.com",
      "www.nytimes.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "<p>Live footage of private conversation between Russian president and Chinese leader aired at Beijing military parade</p><p>The authoritarian strongmen Vladimir Putin and Xi Jinping have mused on how organ transplants might lead to immortality, during a brief exchange of small talk caught on a hot m",
      "Medical advances and geopolitics collide for two septuagenarian leaders who have suggested that their time in office is far from over.",
      "What do warmongers and strongmen chat about? Living forever, of course."
    ],
    "image_url": "https://i.guim.co.uk/img/media/ba14947e6d76d908525650c64eda8b36d0fbac46/159_0_1760_1407/master/1760.jpg?width=140&quality=85&auto=format&fit=max&s=1019e2c8bcc8ea4ffb109c5ba8375943",
    "titles": [
      "Hot mic catches Putin and Xi discussing organ transplants and immortality",
      "In a ‘Hot Mic’ Moment, Xi and Putin Muse About Immortality and Organ Transplants",
      "Putin: “Immortality” coming soon through continuous organ transplants"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.704,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.678,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "During a Beijing military parade, a live broadcast captured a private conversation between Russian President Vladimir Putin and Chinese Premier Xi Jinping, who have been in power for 25 and 13 years respectively. They speculated on the possibility of living forever through organ transplants, amidst discussions on medical advances and their prolonged tenures in office. This exchange highlights their interest in immortality and suggests their intention to remain in power indefinitely.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Clippers Investigated for Alleged $28M Salary Cap Breach with Leonard",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Thu, 4 Sep 2025 00:58:32 EST",
    "source": "ESPN",
    "sources": [
      "Sports Illustrated",
      "ESPN"
    ],
    "domains": [
      "news.google.com",
      "www.espn.com"
    ],
    "snippets": [
      "The Clippers reportedly have been accused of circumventing the NBA's salary cap by paying $28 million to Kawhi Leonard for a \"no-show job.\"",
      "<a href=\"https://news.google.com/rss/articles/CBMimwFBVV95cUxQTXdGYlduNWJYSXNCbTJDRU45WjVxRmlqS0RQQXNQbklodlRxZjljZWQySlRHMmN2QXZWNWlxVHlJN1JEMHZkMzRTeVBLTFZUcERpRF9CX1RuSWRSakhDTWplUlNLbGMzT2wxYUNPX3RoMWEzbW4zV3daYThvejdKU2QyTDVHSG5ZMi1SaGp6Q0dYV2NuWUJlOXRFTQ?oc=5\" target=\"_blank\">Clippers Issue St",
      "<a href=\"https://news.google.com/rss/articles/CBMidkFVX3lxTE5zQmQ1S3A3Wk12S2o1dzliWktlRUZIaldSWTVzT2I2NzV5WFNQTk1CRjNWNm9ZbTRiMUd5YjAtT0dLYWE4REw4RFpqWHBoOTk2TjBJczRLNmZFYWZOYi1Dc0VDS1JvRFlkN0JhaDlzTWhUUUZoSEE?oc=5\" target=\"_blank\">Breaking Down Clippers’ Potential Punishments Over Kawhi Leonard Sal",
      "<a href=\"https://news.google.com/rss/articles/CBMiekFVX3lxTE5OWVUwcC1sSHFwVU5tMzVyUHg4dUpwc1RjOXZVa3Y5emdVTU9rR1BPS3RabHJZNXZzUUtTSHF0WDAyZkpxbXRsMkxzRWtZVVlwUUFoZWYza3FDTFFhV1puTE9hcV9MR2kyZXhaVFdCWm44aHQ2Szg5QnZn?oc=5\" target=\"_blank\">Report: Clippers, Kawhi Leonard Used Fraudulent Tree Company to",
      "<a href=\"https://news.google.com/rss/articles/CBMimgFBVV95cUxNNkZCRjMzaTdlRnFoWEQwZTVRZS10Y2ZZTzJaRHUzOXRQcmg2VVZ3aGhHazljV0dIMVBYdHF0ZUw2YnZxcVB0YXRtenJSWDJ0T0NGcTVleGlUa0hvWUh4VWtuOUtnTjdWRnNuUzdYS3FVNG5XNHdILTFiQmliYU1ndm11UjNQaWFvbEVZUi1xSXZtcEdXNzltUnFB?oc=5\" target=\"_blank\">Stephen A. Smith Ri"
    ],
    "image_url": "",
    "titles": [
      "Report: Clippers skirted cap with Kawhi payment",
      "Clippers Issue Statement Denying Report of Circumventing Salary Cap for Kawhi Leonard - Sports Illustrated",
      "Breaking Down Clippers’ Potential Punishments Over Kawhi Leonard Salary Cap Report - Sports Illustrated",
      "Report: Clippers, Kawhi Leonard Used Fraudulent Tree Company to Circumvent Salary Cap - Sports Illustrated",
      "Stephen A. Smith Rips Kawhi Leonard Over No-Show Tree Company Job Report - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.935,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.667,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Los Angeles Clippers are under investigation for allegedly circumventing the NBA's salary cap rules by providing Kawhi Leonard with a $28 million payment for a \"no-show job.\" Reports suggest the involvement of a fraudulent tree company in the scheme. The current status of the investigation and potential punishments for the Clippers and Leonard remain under review by the NBA.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Koch Family Acquires Stake in NFL's New York Giants",
    "domain": "sports",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Thu, 04 Sep 2025 00:45:41 GMT",
    "source": "Axios",
    "sources": [
      "ESPN",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "www.espn.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMickFVX3lxTE93OXBfWVNXSE0wSzFxYTVoMzVMZk5jdmtxQV96Q1l5VGIyRUp3ZWNCcFNEXzFnOTlrWHVJWl9uZG14cmhLcWJsbzdZeVlVSWJCak5HcmpvaV9UMjZ5d0pBaXhsYWJGQmtvUW8wVG1zSnZJdw?oc=5\" target=\"_blank\">Koch family buying piece of the NFL's New York Giants</a>&nbsp;&nbsp;<fon",
      "The Koch family has agreed to purchase a 10% stake in the New York Giants, as first reported by Bloomberg on Wednesday."
    ],
    "image_url": "",
    "titles": [
      "Koch family buying piece of the NFL's New York Giants - Axios",
      "Reports: Koch family to buy 10% stake in Giants"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.839,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.648,
    "summary_source": "snippet",
    "summary_reason": "retry_exhausted",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMickFVX3lxTE93OXBfWVNXSE0wSzFxYTVoMzVMZk5jdmtxQV96Q1l5VGIyRUp3ZWNCcFNEXzFnOTlrWHVJWl9uZG14cmhLcWJsbzdZeVlVSWJCak5HcmpvaV9UMjZ5d0pBaXhsYWJGQmtvUW8wVG1zSnZJdw?oc=5\" target=\"_blank\">Koch family buying piece of the NFL's New York Giants</a>&nbsp;&nbsp;<fon",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Nidec Corp. Shares Plunge 22% Amid Accounting Scandal Concerns",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Thu, 04 Sep 2025 05:24:50 GMT",
    "source": "CNBC",
    "sources": [
      "Financial Post",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "financialpost.com"
    ],
    "snippets": [
      "This marks the Japanese electronics components manufacturer's biggest one-drop.",
      "Nidec Corp.’s shares plunged a record 22% after the Japanese company found evidence that senior executives may have been involved in a number of accounting issues at subsidiaries."
    ],
    "image_url": "",
    "titles": [
      "Nidec shares plunge 22% as China unit probe finds accounting issues tied to management",
      "Nidec Shares Sink 22% on Fears of Systemic Accounting Issues"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.924,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.64,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Nidec Corp., a Japanese electronics components manufacturer, saw its shares plummet by a record 22% following the discovery of potential accounting irregularities involving senior executives at its subsidiaries.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Judge Rules Trump Admin Unlawfully Cut $2.2B Funding to Harvard",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Wed, 03 Sep 2025 23:14:13 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Deutsche Welle",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.dw.com"
    ],
    "snippets": [
      "The decision is a victory for the Ivy League university, which has been locked in a months-long feud with Trump.",
      "Harvard has scored a legal victory against the White House as a federal judge overturned the Trump administration's decision to cut the university's funding by billions of dollars."
    ],
    "image_url": "",
    "titles": [
      "US judge rules Trump unlawfully cut Harvard University research grants",
      "US judge rules Trump unlawfully canceled Harvard's grants"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.83,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.638,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A federal judge ruled that the Trump administration unlawfully terminated approximately $2.2 billion in funding to Harvard University, marking a significant legal victory for the institution. This decision comes after a prolonged dispute, where the White House accused Harvard of failing to address harassment of Jewish students. The ruling overturns the administration's funding cut, supporting Harvard's stance in the feud.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Ottawa Senators Unveil New Red Third Jersey for Select Games",
    "domain": "sports",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Thu, 04 Sep 2025 02:26:15 GMT",
    "source": "NHL",
    "sources": [
      "Ottawa Citizen",
      "NHL"
    ],
    "domains": [
      "news.google.com",
      "ottawacitizen.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMickFVX3lxTE1jZDd1UVhfcnNreWZ1REptWjN6YzlPTFVmek9keGQtaUFMSVF4LXJOMEhYbHp5T1pRdDBhU21PUnN4WWtOZUVacHpkNW9KZ1hkZm10cmFuN1B1V01oUUdOVlJIa1RQaFhmMG5IdzJyVXpMZw?oc=5\" target=\"_blank\">Senators unveil red third jerseys for this season</a>&nbsp;&nbsp;<font co",
      "<a href=\"https://news.google.com/rss/articles/CBMiigFBVV95cUxQSzVPZHhBLU00cmFPMm9WTHRfYmV6SWVCcGpIUEFHNTYtY3lxYzRta2dTc1lnZVUwUS1EcVJ2SUVnU2drM1RUUVR6b2FIR2xZUXJPMmdHbDZMWTU2T0xSNHJ1QmRjM1ZldUZlc042eHZNalpJamFXeDVpdWlucDF3WlBoU0tGbDdrLXc?oc=5\" target=\"_blank\">Ottawa Senators 3rd Jersey Teaser</a>&nb",
      "The Ottawa Senators have returned to red. The Senators finally unveiled their much-anticipated third jersey on Wednesday during Media Day at the Canadian Tire Centre and fans are pleased by the club&#8217;s new look. The red-themed hockey sweater also has gold and black trim. There is a logo with th"
    ],
    "image_url": "",
    "titles": [
      "Senators unveil red third jerseys for this season - NHL.com",
      "Ottawa Senators 3rd Jersey Teaser - NHL.com",
      "Ottawa Senators unveil new fiery third jersey for 2025-26 NHL season"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.869,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.636,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Ottawa Senators introduced a new red third jersey with gold and black trim, featuring a logo, during Media Day at the Canadian Tire Centre. This addition to their attire will be worn in select games this season, receiving positive feedback from fans.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Osaka Reaches First Grand Slam Semifinal as a Mother; Anisimova Defeats Swiatek",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Thu, 04 Sep 2025 02:44:13 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Forbes"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.forbes.com"
    ],
    "snippets": [
      "Osaka returns to semis for the first time since 2020, while Amanda Anisimova gets Wimbledon revenge against Iga Swiatek.",
      "Four-time major champion Naomi Osaka said “weight has been lifted off my shoulders\" after she reached her first Grand Slam semifinal as a mother at the U.S. Open."
    ],
    "image_url": "",
    "titles": [
      "Naomi Osaka defeats Karolina Muchova to reach US Open semifinal",
      "U.S. Open: Naomi Osaka Reaches First Grand Slam Semifinal As A Mom"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.892,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.633,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Naomi Osaka reached her first Grand Slam semifinal since 2020 and her first as a mother at the U.S. Open, expressing relief at the achievement. Meanwhile, Amanda Anisimova achieved Wimbledon revenge by defeating Iga Swiatek, advancing in the tournament.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Sen. Warner's Intel Meeting Canceled Amid Far-Right Attacks",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Thu, 04 Sep 2025 02:45:27 GMT",
    "source": "Axios",
    "sources": [
      "The Guardian",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMijAFBVV95cUxQNExGQzBtd0RXWkUzUS11c25RbldsQUZQQVpMZDBkZFpTUFV5VTBBQ21YSlJYREdmcXFTMWo1eGtXcWtVRE5GZWE0X2VFSlZLNTR1ZjdlMjdlTXd4OEZtZFRhNXhjcHU3VE5HWGdvZ1Z0cVlpRDFnV1JLelBadi0zUFdKRXJjS3FSc3l5Wg?oc=5\" target=\"_blank\">Top Democrat says intel visit cancele",
      "<p>Mark Warner says officials rescinded invitation because of ‘campaign of baseless attacks’ by extremist Trump backer</p><p>Senator Mark Warner said on Wednesday that a meeting he had scheduled at the headquarters of a US intelligence agency was cancelled following online attacks by the far-right a"
    ],
    "image_url": "",
    "titles": [
      "Top Democrat says intel visit canceled after Laura Loomer attacked him online - Axios",
      "Top Democrat says intelligence briefing cancelled after attacks by far-right Laura Loomer"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.874,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.63,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Senator Mark Warner reported that his scheduled meeting at a US intelligence agency was canceled due to online attacks from a far-right Trump supporter. Warner attributed the cancellation to a \"campaign of baseless attacks\" by the individual.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Newsmax Sues Fox News for Antitrust, Alleges Monopoly in Conservative Market",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Wed, 03 Sep 2025 14:14:43 -0400",
    "source": "NPR",
    "sources": [
      "CNBC",
      "NPR"
    ],
    "domains": [
      "www.npr.org",
      "www.cnbc.com"
    ],
    "snippets": [
      "Right-wing TV news outlet Newsmax sued Fox News on antitrust grounds, alleging the conservative media powerhouse had illegally sought to suppress its smaller rival's growth in cable news.",
      "Newsmax filed a lawsuit accusing conservative news giant Fox News of suppressing its right-leaning competitors."
    ],
    "image_url": "",
    "titles": [
      "In a brawl over right-wing TV, Newsmax sues Fox News",
      "Newsmax sues Fox News for allegedly abusing monopoly power"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.748,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.63,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Newsmax has filed an antitrust lawsuit against Fox News, accusing the larger conservative network of illegally trying to suppress its growth in the right-leaning cable news market. The suit claims Fox News is maintaining a monopoly in this sector.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Bruce Marshall Shares Top College Football Picks for Week 2",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Wed, 03 Sep 2025 22:43:19 +0000",
    "source": "CBS Sports",
    "sources": [
      "Bleacher Report",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "news.google.com"
    ],
    "snippets": [
      "Legendary Vegas handicapper Bruce Marshall reveals the best betting values for the Week 2 college football schedule",
      "<a href=\"https://news.google.com/rss/articles/CBMinAFBVV95cUxPZno5VWg2SktRTThIUmN4Vy1pbnlibVhoMmhjM2dtMkN2M2NpTEVjZVhMVmNkZExQZ1JZWXNsOHFmUnBpMUIyTzBQS3otRkpzcDRva1ZZOGpOaGFlV3dDeG5SUTlreGVtVG8xazNIdk1PeTRkSWEwTWZyU2lhWVVxUl96UTVxZ1MtbVdMSk90T0d6YXRKdmdXWWl6dkY?oc=5\" target=\"_blank\">2025 Week 2 Coll",
      "<a href=\"https://news.google.com/rss/articles/CBMiiwFBVV95cUxNZHE1aVhHOW93Ujg1cThWMHVzczNNV295S0hGTkczYW5WbnhoNWZCaS1SZzBMQm01M2Z5UHZmSzVkS245VUNBUTNnelkwcmFVaV9iTHZfRV9OalNkdEVIa1NqelRZcUxCNmNYOWVfOVdHd250SGxtU051RkNrUTZLVHJrZ0hYU2x0Wkdj?oc=5\" target=\"_blank\">Week 1 Fantasy Football 2025 Big Board<"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/03/100742c2-46c9-420c-8a82-49c6d6529c9c/kewan-lacy-ole-miss-getty-images.jpg",
    "titles": [
      "2025 college football Week 2 picks against the spread, odds, lines, trends: Vegas expert reveals picks",
      "2025 Week 2 College Football Predictions for Every Game - Bleacher Report",
      "Week 1 Fantasy Football 2025 Big Board - Bleacher Report"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.821,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.619,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Bruce Marshall, a renowned Las Vegas handicapper, has shared his top betting picks for Week 2 of the college football season. The specifics of his recommendations, including which games offer the best betting values, were not disclosed in the summary provided.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Powerball Jackpot Hits Record $1.7 Billion",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Wed, 03 Sep 2025 23:49:17 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "Forbes"
    ],
    "domains": [
      "news.google.com",
      "www.forbes.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMijwFBVV95cUxQZVlpdGt3WlhjUXR1eVg3U3R6cFVzZTBhWm1mak9KSGFpNXJ6U2EyQ3Q3OV9neTlKWHRyN0t4X0dzX1pkZ2ZYZm1BbDNBMXFuSVQtYzRhZ2F2cFZsRS1sN1N6NkNzbU9adHI1bmVSV21taE1KZ3lLOXJndFVIUXJ2alA0SnBkQ0dTSlpNS21FTQ?oc=5\" target=\"_blank\">Powerball jackpot soars to $1.7 b",
      "The $1.7 billion jackpot is the third biggest lottery prize of all time and the biggest since October 2023."
    ],
    "image_url": "",
    "titles": [
      "Powerball jackpot soars to $1.7 billion after no winner Wednesday - Axios",
      "Powerball Jackpot Surges To $1.7 Billion—Here’s What The Winner Could Take Home After Taxes"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.822,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.619,
    "summary_source": "snippet",
    "summary_reason": "retry_exhausted",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMijwFBVV95cUxQZVlpdGt3WlhjUXR1eVg3U3R6cFVzZTBhWm1mak9KSGFpNXJ6U2EyQ3Q3OV9neTlKWHRyN0t4X0dzX1pkZ2ZYZm1BbDNBMXFuSVQtYzRhZ2F2cFZsRS1sN1N6NkNzbU9adHI1bmVSV21taE1KZ3lLOXJndFVIUXJ2alA0SnBkQ0dTSlpNS21FTQ?oc=5\" target=\"_blank\">Powerball jackpot soars to $1.7 b",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Google Unveils New Updates for Android and Pixel Devices",
    "domain": "technology",
    "source_domain": "techcrunch.com",
    "location": "global",
    "published": "Wed, 03 Sep 2025 18:00:00 +0000",
    "source": "TechCrunch",
    "sources": [
      "Ars Technica",
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com",
      "arstechnica.com"
    ],
    "snippets": [
      "Google announced on Wednesday that it's bringing a slew of new features to the Android ecosystem and Pixel devices.",
      "Google's latest updates include a smattering of features for Pixels and other Android phones."
    ],
    "image_url": "",
    "titles": [
      "Google brings Material 3 Expressive to Pixel 6 and newer devices, along with other features",
      "Google’s Material 3 Expressive UI rolls out to Pixel 6 and newer"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.744,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.604,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Google announced new updates for the Android ecosystem and Pixel devices on Wednesday, introducing a variety of features aimed at enhancing user experience across Pixels and other Android phones.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Philips Hue Launches Major Update with Affordable Essentials Line at IFA",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-09-04T03:30:00-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "www.theverge.com"
    ],
    "snippets": [
      "Philips Hue has announced the biggest revamp of its smart lighting line in years, introducing lower-cost lights, support for Matter over Thread, and a new generation of brighter light strips. The update includes the launch of a new Essentials line, motion-sensing technology across all Hue lights, an",
      "Smart lighting company Philips Hue debuted a bunch of new products this week at the IFA tech show in Berlin, Germany, and most of them are available now. The launch, which is the biggest in the company’s history, includes cheaper smart lights, a new bridge for its Zigbee ecosystem, a redesigned line"
    ],
    "image_url": "",
    "titles": [
      "Philips Hue responds to cheaper competitors with major product overhaul",
      "Philips Hue lights get bigger, brighter, and cheaper with a major product refresh"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.985,
      "consensus": 0.35,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.475,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Philips Hue unveiled its largest update in years at the IFA tech show in Berlin, introducing a more affordable Essentials line, support for Matter over Thread, brighter light strips, and motion-sensing technology. This revamp also features a new bridge for the Zigbee ecosystem. Most new products are available now.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  }
]