[
  {
    "title": "US and Ukraine leaders meet in Florida to talk about peace plan",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Sun, 30 Nov 2025 18:47:00 GMT",
    "source": "Associated Press",
    "sources": [
      "Al Jazeera",
      "Associated Press",
      "Axios",
      "The Guardian",
      "Global News"
    ],
    "domains": [
      "aljazeera.com",
      "news.google.com",
      "theguardian.com",
      "globalnews.ca"
    ],
    "snippets": [
      "Delegations meet in Florida to ‘create pathway’ for sovereign Ukraine ahead of US special envoy Witkoff’s Moscow trip.",
      "US and Ukrainian negotiators meet as Trump seeks to broker an end to Russia’s war AP News",
      "U.S. and Ukrainian officials meet in Miami before Moscow talks Axios",
      "Marco Rubio, Steve Witkoff and Jared Kushner meet Kyiv delegation amid more deadly Russian attacks in Ukraine Ukrainian negotiators have met US officials in Florida to thrash out details of Washington’s proposed framework to end Russia’s war in Ukraine, as Kyiv faces pressure on military and politic",
      "Secretary of State Marco Rubio and other U.S. officials held talks with a Ukrainian delegation to further hash out the details of a proposed peace framework."
    ],
    "image_url": "",
    "titles": [
      "US and Ukraine talks begin as Trump pushes to bring war to an end",
      "US and Ukrainian negotiators meet as Trump seeks to broker an end to Russia’s war - AP News",
      "U.S. and Ukrainian officials meet in Miami before Moscow talks - Axios",
      "Ukrainian and US officials meet in Florida to discuss proposals to end Russia’s war",
      "U.S., Ukraine officials meet for latest talks on Trump’s peace plan"
    ],
    "url": "https://news.google.com/rss/articles/CBMimgFBVV95cUxNQUlFei1JZEFUYTBqNWVDWEZzMlRRMlBZclZSREpod0lzU3l4TlBYVlpLNlJCc3FSTzNGRkZqRkEza3VxckszbGRiRGxCMGJtT09VOHc4MVlSNk9vdlN3RjVoOTdjSFhjT2lUSlhJalRUOEFKLW44NTdPRVVzLXpFajBsWmhDdjktdFJ5NmVXTi0ydzFBekJTVkVR?oc=5",
    "alternate_urls": [
      "https://www.aljazeera.com/news/2025/11/30/us-ukraine-negotiators-meet-as-trump-pushes-to-bring-war-to-an-end?traffic_source=rss",
      "https://news.google.com/rss/articles/CBMiggFBVV95cUxPanF1X1dIV2RhMEpsRlQycno2ekItd2xkQ1RaWGhHRnZMUDVaSGNGOUF4cXFEY0tLNUIyaTgyTEpaaW1aNUZSR0tZa0hCM19xX1VkajZsb253RkQyYVd5NEJ2QUxsMUFwSjNuOUd0N0lzbXpKdWxPcDZPa21nbGVPZXB3?oc=5",
      "https://www.theguardian.com/world/2025/nov/30/ukrainian-and-us-officials-talks-florida-russia-war",
      "https://globalnews.ca/news/11550961/us-ukraine-delegation-talks-peace-plan/"
    ],
    "location_scope": "national",
    "link": "https://news.google.com/rss/articles/CBMimgFBVV95cUxNQUlFei1JZEFUYTBqNWVDWEZzMlRRMlBZclZSREpod0lzU3l4TlBYVlpLNlJCc3FSTzNGRkZqRkEza3VxckszbGRiRGxCMGJtT09VOHc4MVlSNk9vdlN3RjVoOTdjSFhjT2lUSlhJalRUOEFKLW44NTdPRVVzLXpFajBsWmhDdjktdFJ5NmVXTi0ydzFBekJTVkVR?oc=5",
    "score_components": {
      "magnitude": 0.984,
      "recency": 0.963,
      "consensus": 0.975,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.919,
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "U.S. officials, including Secretary of State Marco Rubio, Steve Witkoff, and Jared Kushner, met with a Ukrainian delegation in Florida to discuss a proposed framework aimed at ending Russia’s war in Ukraine. The meeting comes as Ukraine faces ongoing Russian attacks and precedes U.S. special envoy Witkoff’s planned visit to Moscow. Negotiations focused on outlining steps toward a potential peace agreement.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive as it reports on efforts to solve a significant international problem. It provides useful information about the ongoing negotiations and the proposed framework for peace, contributing to the reader's understanding of the situation.",
    "constructiveness_source": "gpt",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "Netanyahu asks president for pardon during corruption trial",
    "domain": "politics",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Sun, 30 Nov 2025 18:04:05 GMT",
    "source": "Reuters",
    "sources": [
      "Al Jazeera",
      "Deutsche Welle",
      "BBC",
      "NPR",
      "Reuters",
      "The Guardian",
      "Financial Times",
      "New York Times",
      "CBC News",
      "Global News",
      "Associated Press",
      "Globe and Mail"
    ],
    "domains": [
      "aljazeera.com",
      "dw.com",
      "bbc.com",
      "npr.org",
      "news.google.com",
      "theguardian.com",
      "ft.com",
      "nytimes.com",
      "cbc.ca",
      "globalnews.ca"
    ],
    "snippets": [
      "Benjamin Netanyahu has requested a formal pardon from President Isaac Herzog in his long-running corruption cases.",
      "Israeli leader is up against three cases of corruption, including receiving hundreds of thousands of dollars in gifts.",
      "Israeli Prime Minister Netanyahu has asked President Herzog for a pardon, citing the national interest as his corruption trial deepens political division. Meanwhile, Lebanon is hosting Pope Leo XIV. DW has more.",
      "He denies any wrongdoing in three ongoing trials over allegations of bribery, fraud and breach of trust.",
      "Israeli Prime Minister Benjamin Netanyahu has asked Israel's president to grant him a pardon during his long-running corruption trial that's bitterly divided the country.",
      "Israel's Netanyahu seeks pardon in years-long corruption trial Reuters",
      "Request is submitted weeks after Donald Trump called on Isaac Herzog to pardon Israeli prime minister Benjamin Netanyahu has asked Israel’s president for a pardon for bribery and fraud charges and an end to a five-year corruption trial, arguing that it would be in the “national interest”. Isaac Herz",
      "Isaac Herzog’s office says it will consider the ‘extraordinary request’, which is expected to have significant political and legal implications",
      "Prime Minister Benjamin Netanyahu made the contentious appeal weeks after President Trump had made the same request to the Israeli president.",
      "Israeli Prime Minister Benjamin Netanyahu on Sunday asked the country’s president to grant him a pardon from corruption charges — seeking to end a long-running trial that has bitterly divided the nation.",
      "Netanyahu, who has been at war against Israel’s legal system over the charges, said the request would help unify the country at a time of momentous change in the region.",
      "Netanyahu requests a pardon during the Israeli prime minister’s ongoing corruption trial AP News",
      "Netanyahu seeks pardon in years-long corruption trial The Globe and Mail"
    ],
    "image_url": "",
    "titles": [
      "Netanyahu requests Israel’s president grant a pardon in corruption cases",
      "Netanyahu writes to Israeli president requesting pardon in corruption cases",
      "Middle East: Netanyahu requests presidential pardon",
      "Benjamin Netanyahu seeks pardon from Israel's president",
      "Netanyahu submits request for a pardon during his ongoing corruption trial",
      "Israel's Netanyahu seeks pardon in years-long corruption trial - Reuters",
      "Benjamin Netanyahu asks Israel’s president for pardon in corruption case",
      "Netanyahu asks Israeli president for pardon to end corruption case",
      "Netanyahu Asks Israel’s President to Pardon Him in Corruption Cases",
      "Netanyahu asks Israel’s president for pardon amid ongoing trial",
      "Netanyahu requests a pardon during the Israeli prime minister’s ongoing corruption trial - AP News",
      "Netanyahu seeks pardon in years-long corruption trial - The Globe and Mail"
    ],
    "url": "https://news.google.com/rss/articles/CBMipwFBVV95cUxNQ19zM0c4UkhtYzlrRVBxWmo3Qk8zd0FaWHI3dk5CRGhvYi0tajVQb3htSHhoN3h2RldZTHR5empNSnA0RnFoRGRGczZRc0VYSmVpVExRR1pMSC01UEhFamYyQm90cmJOaVNsUk1PVUpuWDRWZTM5U2FHcEQ2SE52ZE14TENGakJjd3FoclF0NTNnRUV1SGp4b3RTSlBqU29aZXcyX1ZmTQ?oc=5",
    "alternate_urls": [
      "https://www.aljazeera.com/video/newsfeed/2025/11/30/netanyahu-requests-israels-president-grant-a-pardon-in-corruption-cases?traffic_source=rss",
      "https://www.aljazeera.com/news/2025/11/30/netanyahu-writes-to-israeli-president-requesting-pardon-in-corruption-cases?traffic_source=rss",
      "https://www.dw.com/en/middle-east-netanyahu-requests-presidential-pardon/live-74958154?maca=en-rss-en-top-1022-rdf",
      "https://www.bbc.com/news/articles/c4gv76r5qpvo?at_medium=RSS&at_campaign=rss",
      "https://www.npr.org/2025/11/30/nx-s1-5625482/netanyahu-request-pardon-corruption-trial",
      "https://www.theguardian.com/world/2025/nov/30/benjamin-netanyahu-asks-israel-president-isaac-herzog-for-pardon-corruption-case",
      "https://www.ft.com/content/800512dc-ebc1-4fee-b6cd-0e65bbd62dea",
      "https://www.nytimes.com/2025/11/30/world/middleeast/netanyahu-pardon-request-israel.html",
      "https://www.cbc.ca/news/world/netanyahu-pardon-request-corruption-trial-9.6997900?cmp=rss",
      "https://globalnews.ca/news/11550896/netanyahu-asks-for-pardon-israel/",
      "https://news.google.com/rss/articles/CBMikwFBVV95cUxORENsQ01DN3IyUGlPb1h0MnBmUVVHNzIxVjlsaGdUZTFud0JtV0kwd0h5bmZUNENyOWVyem5FeURTZDZBRC1CUXhEX2pvRkxXRTBHamxXY1M3UGtlRkxYVkF4OG1wREJsSXNaRWNzRWJvM0FzRFhsdThxYUVRSExFYXZVRUFqOTlQRVRVUGFQWjRNbzQ?oc=5",
      "https://news.google.com/rss/articles/CBMiogFBVV95cUxPZlhUeURaUUdHekFwQWwxMW9zRGFoM0h5VEVzLU9ZckV6Nlo1VUdZNGdjU1EtdTJIcElPb09tZ1BFS09QbW12NzZLaG11NDJ6b0x5Y2hxYW1yR29OdHd2VHFqS0twT3ZWclR0eklBM054NFViQU12Y1U2ck9EZzAwc0ZqUHV0anV3UEhXUzRVR0trN2JzZXUxOVJXYTQxbU9JUEE?oc=5"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMipwFBVV95cUxNQ19zM0c4UkhtYzlrRVBxWmo3Qk8zd0FaWHI3dk5CRGhvYi0tajVQb3htSHhoN3h2RldZTHR5empNSnA0RnFoRGRGczZRc0VYSmVpVExRR1pMSC01UEhFamYyQm90cmJOaVNsUk1PVUpuWDRWZTM5U2FHcEQ2SE52ZE14TENGakJjd3FoclF0NTNnRUV1SGp4b3RTSlBqU29aZXcyX1ZmTQ?oc=5",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.944,
      "consensus": 1.0,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.893,
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Israeli Prime Minister Benjamin Netanyahu has formally requested a pardon from President Isaac Herzog amid his ongoing corruption trial, which includes charges of bribery, fraud, and breach of trust. Netanyahu denies any wrongdoing and argues the pardon would serve the national interest. Herzog’s office has confirmed receipt of the request and is considering it. The trial has been ongoing for five years and has caused significant political division.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the ongoing corruption trial of Benjamin Netanyahu and his request for a pardon. However, it doesn't provide much insight into the implications of this request or the broader context of political corruption in Israel.",
    "constructiveness_source": "gpt",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "Fire in Hong Kong apartments kills at least 146 people",
    "domain": "general",
    "source_domain": "cbc.ca",
    "location": "national",
    "published": "Sun, 30 Nov 2025 08:33:21 EST",
    "source": "CBC News",
    "sources": [
      "Al Jazeera",
      "BBC",
      "ABC News",
      "The Guardian",
      "CBC News"
    ],
    "domains": [
      "aljazeera.com",
      "bbc.com",
      "abcnews.go.com",
      "theguardian.com",
      "cbc.ca"
    ],
    "snippets": [
      "As fire alarms failed, this woman livestreamed her escape from the Hong Kong apartment inferno to warn other residents.",
      "More than 100 people remain unaccounted for after seven high-rise buildings caught fire and burned for two days.",
      "Authorities say they have completed searches of four of the seven towers as part of a criminal investigation.",
      "A massive fire tore through a residential complex in Hong Kong on Wednesday.",
      "Rescue teams find more bodies in burnt-out buildings of Wang Fuk Court complex after Wednesday’s fire The death toll in Hong Kong’s apartment complex fire has risen to 146 after investigators discovered more bodies in the burnt-out buildings. A steady stream of people placed bouquets of flowers at a",
      "The death toll in Hong Kong’s apartment complex blaze rose to 146 on Sunday as investigators discovered more bodies in the burned-out buildings. A steady stream of people placed bouquets of flowers at an ever-growing makeshift memorial at the scene of the disaster, among the worst in the city’s hist"
    ],
    "image_url": "",
    "titles": [
      "Nanny streamed dramatic escape from Hong Kong apartment fire to warn other",
      "Death toll in Hong Kong apartment complex fire hits 146",
      "Hong Kong fire death toll rises to 146 as thousands pay respects",
      "Death toll climbs to 146 in Hong Kong high-rise fire, officials say",
      "Hong Kong mourns as apartment fire death toll rises to 146",
      "Death toll in Hong Kong apartment complex blaze rises to 146 as the city mourns"
    ],
    "url": "https://www.cbc.ca/news/world/death-toll-rises-hong-kong-apartment-complex-fire-9.6997887?cmp=rss",
    "alternate_urls": [
      "https://www.aljazeera.com/video/newsfeed/2025/11/30/nanny-streamed-dramatic-escape-from-hong-kong-apartment-fire-to-warn-other?traffic_source=rss",
      "https://www.aljazeera.com/news/2025/11/30/death-toll-in-hong-kong-apartment-complex-fire-hits-146?traffic_source=rss",
      "https://www.bbc.com/news/articles/cp34yk7z6yxo?at_medium=RSS&at_campaign=rss",
      "https://abcnews.go.com/International/death-toll-climbs-146-hong-kong-high-rise/story?id=127977217",
      "https://www.theguardian.com/world/2025/nov/30/hong-kong-mourns-as-apartment-blaze-death-toll-rises"
    ],
    "location_scope": "national",
    "link": "https://www.cbc.ca/news/world/death-toll-rises-hong-kong-apartment-complex-fire-9.6997887?cmp=rss",
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.833,
      "consensus": 0.995,
      "constructiveness": 0.5,
      "proximity": 1.0
    },
    "score": 0.882,
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "A fire in Hong Kong’s Wang Fuk Court apartment complex killed at least 146 people, with more than 100 still unaccounted for after seven high-rise buildings burned over two days. Authorities have finished searching four of the towers and are conducting a criminal investigation. Residents and mourners have gathered at a memorial near the site.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story raises awareness about a tragic event and the ongoing investigation, but it does not provide deeper insights, potential solutions, or actionable insights for the reader. It is primarily a report on a reactive situation.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Max Verstappen wins in Qatar title race goes to last race",
    "domain": "sports",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Sun, 30 Nov 2025 18:35:43 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "BBC",
      "Sky Sports",
      "Sportsnet",
      "The Guardian"
    ],
    "domains": [
      "aljazeera.com",
      "bbc.com",
      "skysports.com",
      "sportsnet.ca",
      "theguardian.com"
    ],
    "snippets": [
      "Reigning F1 champion Max Verstappen closed to within 12 points of leader Lando Norris heading into final round in UAE.",
      "Lando Norris, Max Verstappen and Oscar Piastri will contest a final-race championship showdown in Abu Dhabi after the Red Bull driver won a gripping Qatar Grand Prix.",
      "Formula 1's 2025 title fight will be settled by a thrilling three-way decider in Abu Dhabi after Max Verstappen beat Oscar Piastri to victory in the Qatar Grand Prix and championship leader Lando Norris finished only fourth.",
      "Oscar Piastri held his lead in a 'perfect start' to the Qatar GP, while Max Verstappen overtook Lando Norris at the first corner.",
      "Max Verstappen won the Qatar Grand Prix on Sunday to send a tense Formula 1 title fight into the season’s final race in Abu Dhabi next weekend.",
      "Norris only fourth in Qatar, making Abu Dhabi decisive McLaren failure to pit on safety car costs their drivers Max Verstappen won the Qatar Grand Prix to ensure he remains squarely in the world championship fight which, with title leader Lando Norris in fourth and his McLaren teammate Oscar Piastri"
    ],
    "image_url": "",
    "titles": [
      "Verstappen wins Qatar GP to keep F1 world championship alive with Norris",
      "Norris' title wait goes on as Verstappen wins in Qatar",
      "Verstappen wins Qatar GP to set up title decider with Norris and Piastri",
      "Piastri holds lead as Verstappen overtakes Norris to start Qatar GP!",
      "Red Bull’s Max Verstappen wins Qatar Grand Prix, title fight heads for final race",
      "Max Verstappen beats Piastri to take F1 title race to Abu Dhabi GP as Norris falters"
    ],
    "url": "https://www.aljazeera.com/sports/2025/11/30/verstappen-wins-qatar-gp-to-keep-f1-world-championship-alive-with-norris?traffic_source=rss",
    "alternate_urls": [
      "https://www.bbc.com/sport/formula1/articles/cx2d0yeqqpwo?at_medium=RSS&at_campaign=rss",
      "https://www.skysports.com/f1/news/12040/13477418/qatar-gp-max-verstappen-wins-in-major-title-twist-to-set-up-f1-2025-title-decider-with-lando-norris-oscar-piastri",
      "https://www.skysports.com/watch/video/13477528/piastri-holds-lead-as-verstappen-overtakes-norris-to-start-qatar-gp",
      "https://www.theguardian.com/sport/2025/nov/30/max-verstappen-beats-piastri-to-take-f1-title-race-to-abu-dhabi-gp-as-norris-falters"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/sports/2025/11/30/verstappen-wins-qatar-gp-to-keep-f1-world-championship-alive-with-norris?traffic_source=rss",
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.958,
      "consensus": 0.995,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.87,
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Max Verstappen won the Qatar Grand Prix, narrowing the gap to championship leader Lando Norris to 12 points ahead of the final Formula 1 race in Abu Dhabi. Norris finished fourth in Qatar, while Oscar Piastri placed second. The 2025 F1 title will be decided in a three-way contest between Norris, Verstappen, and Piastri at the season’s last race.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about the results of the Qatar Grand Prix and the upcoming final race. However, it does not offer deeper insights into the strategies of the drivers, the implications of the results, or any potential solutions or improvements.",
    "constructiveness_source": "gpt",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "Swiss voters say no to new tax on large inheritances",
    "domain": "business",
    "source_domain": "dw.com",
    "location": "global",
    "published": "2025-11-30T18:17:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "Reuters",
      "Financial Times",
      "Bloomberg",
      "Fortune",
      "Associated Press"
    ],
    "domains": [
      "dw.com",
      "news.google.com",
      "ft.com",
      "fortune.com"
    ],
    "snippets": [
      "More than 78% of Swiss voters opposed the introduction of a new inheritance tax on multimillionaires, the proceeds of which would have been directed toward \"socially just measures to combat the climate crisis.\"",
      "Swiss voters reject proposed tax on super rich Reuters",
      "Overwhelming majority opposed wealth tax in contentious referendum",
      "Swiss Reject Millionaire Inheritance Tax Fearing Wealth Exodus Bloomberg.com",
      "The revenues were to be used to fight the impact of climate change and help Switzerland meet its ambitions to have net-zero greenhouse gas emissions by 2050.",
      "Swiss voters reject mandatory national service for women and new inheritance tax AP News"
    ],
    "image_url": "",
    "titles": [
      "Switzerland: Voters reject climate tax in referendum",
      "Swiss voters reject proposed tax on super rich - Reuters",
      "Swiss voters reject 50% inheritance tax for the super-rich",
      "Swiss Reject Millionaire Inheritance Tax Fearing Wealth Exodus - Bloomberg.com",
      "Swiss voters reject tax of up to 50% on large donations or inheritances, fearing exodus of wealthy instead of fighting climate change",
      "Swiss voters reject mandatory national service for women and new inheritance tax - AP News"
    ],
    "url": "https://www.dw.com/en/switzerland-voters-reject-climate-tax-in-referendum/a-74959419?maca=en-rss-en-top-1022-rdf",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiwwFBVV95cUxOZXpMZmtFWENiQ3JKbWVwOWxMZFFoTkN6M3F0bDhmcVBmSWhtcE0tX28yaDlmOG5idHpFQWlfQTh0YWFySVl3OHllZ3MzbjN1Z0Z3OVdGRzUxMWZrbHVuS3JvdXZ1ZFVOVnZjdF93RkNUWlVNYi1kb254bTljZTF1eG0yb0ZnRW5LZmFndk1qc2dwdHI4R3VqUk1oa0Uxbl9jX2REU2o2UkxoRXZEazd4Ry1ZTTdfZTQ5VHowV2VpMElrRDA?oc=5",
      "https://www.ft.com/content/f03fdcf8-d032-40ef-9ea1-ff32c182df8a",
      "https://news.google.com/rss/articles/CBMiswFBVV95cUxNbzJic3MzbG15bFFza1N4Y3czOTZGUm0tcGhHSFFjOWktS3MtMWViNWcweFFyTl9NRnp1Wjh5bktwb2lwUmVFUnVua3pxZ1MyWkplenVQVXhrWW14OExVZGU1bkdVNFVnOHZRQzJhRFRVVU13b3JrMDhReGNJZFJ0QjZNZ3BtUGpLb0JYcTlFMzFjdmpYczI3STdQYktlalZhSFE5SnVtVjVkYzc3dHk0bXVkSQ?oc=5",
      "https://fortune.com/2025/11/30/swiss-voters-tax-large-donations-inheritances-exodus-wealthy-climate-change-net-zero/",
      "https://news.google.com/rss/articles/CBMikgFBVV95cUxOVTJEeUpBZmtPa1ZLa0ZkNDRUaEVMa3FPNF9fdmFzSks0SmFjT1IxNUQyUW1HR2ZfRjBkQW4ydloyYU5ZWjBtR1U3ck1fMDVnNnc0UndUS3E4ejB0ZTduTWdIUk5NcFVhejNzV2k3dWx0V253RHFfRHNYTUR6UHEwejNaejVmMkdDWFdHaWRxdmVlZw?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.dw.com/en/switzerland-voters-reject-climate-tax-in-referendum/a-74959419?maca=en-rss-en-top-1022-rdf",
    "score_components": {
      "magnitude": 0.986,
      "recency": 0.95,
      "consensus": 1.0,
      "constructiveness": 0.069,
      "proximity": 0.5
    },
    "score": 0.838,
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Swiss voters have overwhelmingly rejected a proposed inheritance tax on multimillionaires, with over 78% voting against it in a national referendum. The tax revenues were intended to fund measures addressing climate change and support Switzerland's goal of net-zero emissions by 2050. The proposal was defeated amid concerns about a potential wealth exodus.",
    "constructiveness_score": 0.069,
    "constructiveness_reason": "keywords (1): support; semantic: pos_sim=0.15, neg_sim=0.06; semantic_boost=0.02",
    "constructiveness_source": "heuristic",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "Auburn picks Alex Golesh as new football coach",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Sun, 30 Nov 2025 14:29:32 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports",
      "Sportsnet"
    ],
    "domains": [
      "espn.com",
      "cbssports.com",
      "sportsnet.ca"
    ],
    "snippets": [
      "Auburn has hired South Florida's Alex Golesh as its new coach. Golesh, who went 23-15 over three seasons at USF, will get a six-year deal, sources told ESPN.",
      "Auburn will bring in Alex Golesh from USF as its next coach",
      "Auburn hired South Florida’s Alex Golesh as its next coach on Sunday, counting on him to revitalize an offence that has ranked in the bottom half of the Southeastern Conference each of the last six years."
    ],
    "image_url": "",
    "titles": [
      "Auburn hires South Florida's Golesh as new coach",
      "Auburn hires Alex Golesh: Tigers bring in USF coach to replace Hugh Freeze, breathe life into offense",
      "Auburn tabs USF’s Alex Golesh as head coach, replacing Hugh Freeze"
    ],
    "url": "https://www.espn.com/college-football/story/_/id/47151282/sources-auburn-hiring-usf-alex-golesh-new-football-coach",
    "alternate_urls": [
      "https://www.cbssports.com/college-football/news/auburn-hires-alex-golesh-head-coach-south-florida/"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/college-football/story/_/id/47151282/sources-auburn-hiring-usf-alex-golesh-new-football-coach",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.982,
      "consensus": 0.789,
      "constructiveness": 0.6,
      "proximity": 0.75
    },
    "score": 0.835,
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Auburn has hired Alex Golesh, previously the head coach at South Florida, as its new football coach. Golesh compiled a 23-15 record over three seasons at USF and has agreed to a six-year contract with Auburn. He is expected to improve Auburn's offense, which has struggled in recent years.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story informs about a new coaching appointment and provides some context about the coach's previous record and the expectation for him to improve the team's offense. However, it does not delve into the specifics of how he plans to achieve this or what his appointment means for the team's future strategies.",
    "constructiveness_source": "gpt",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "Colts player Sauce Gardner leaves game with leg injury",
    "domain": "sports",
    "source_domain": "sports.yahoo.com",
    "location": "national",
    "published": "Sun, 30 Nov 2025 19:41:00 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "ESPN",
      "Yahoo Sports",
      "Sportsnet",
      "CBS Sports"
    ],
    "domains": [
      "espn.com",
      "sports.yahoo.com",
      "sportsnet.ca",
      "cbssports.com"
    ],
    "snippets": [
      "Colts cornerback Sauce Gardner sustained a left calf injury early in Sunday's game against the Texans and has been ruled out for the remainder of the day.",
      "Here are the latest updates for Colts DB Sauce Gardner's calf injury in Week 13 against the Houston Texans.",
      "Indianapolis Colts cornerback Sauce Gardner exited Sunday’s game against the Houston Texans after sustaining a calf injury while in coverage.",
      "The Colts big trade deadline acquisition injured his calf early against Houston"
    ],
    "image_url": "",
    "titles": [
      "Colts CB Gardner suffers noncontact calf injury",
      "Sauce Gardner injury update: Colts star DB helped off field with non-contact calf injury",
      "Colts’ Gardner exits vs. Texans with calf injury",
      "Sauce Gardner in walking boot, ruled out after suffering early calf injury against Texans"
    ],
    "url": "https://sports.yahoo.com/articles/sauce-gardner-injury-colts-star-182055364.html",
    "alternate_urls": [
      "https://www.espn.com/nfl/story/_/id/47153310/colts-sauce-gardner-suffers-noncontact-calf-injury-ruled-out",
      "https://www.cbssports.com/nfl/news/sauce-gardner-injury-update-colts-calf-texans/"
    ],
    "location_scope": "national",
    "link": "https://sports.yahoo.com/articles/sauce-gardner-injury-colts-star-182055364.html",
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.988,
      "consensus": 0.908,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.826,
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Indianapolis Colts cornerback Sauce Gardner sustained a left calf injury early in Sunday’s Week 13 game against the Houston Texans. He was ruled out for the remainder of the game and did not return. Gardner had recently joined the Colts as a trade deadline acquisition. His status for upcoming games has not yet been announced.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "The story offers basic awareness about a player's injury but lacks depth or insight. It does not provide any information about the impact of the injury on the team, potential replacements, or recovery strategies.",
    "constructiveness_source": "gpt",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "US says it may stop aid to Honduras after election",
    "domain": "politics",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Sun, 30 Nov 2025 18:56:26 GMT",
    "source": "BBC",
    "sources": [
      "Al Jazeera",
      "Deutsche Welle",
      "BBC"
    ],
    "domains": [
      "aljazeera.com",
      "dw.com",
      "bbc.com"
    ],
    "snippets": [
      "The vote is taking place in a highly polarised climate, with the US backing the right-wing candidate Nasry Asfura.",
      "US President Donald Trump has threatened to cut aid to Honduras if Nasry Asfura, of the right-wing National Party, is unsuccessful in the presidential election.",
      "The US president is threatening to cut aid to Honduras if his favoured right-wing presidential candidate does not win."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/882a/live/2e266e70-cde9-11f0-a750-a3ce41dc0968.jpg",
    "titles": [
      "Polls open in Honduras presidential election marked by fraud accusations",
      "Honduras election: Trump's threat casts shadow as polls open",
      "Hondurans vote in election shadowed by Trump aid threats"
    ],
    "url": "https://www.bbc.com/news/articles/cx2dgp8mvmno?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://www.aljazeera.com/news/2025/11/30/polls-open-in-honduras-presidential-election-marked-by-fraud-accusations?traffic_source=rss",
      "https://www.dw.com/en/honduras-election-trump-s-threat-casts-shadow-as-polls-open/a-74958682?maca=en-rss-en-top-1022-rdf"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/news/articles/cx2dgp8mvmno?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.968,
      "consensus": 0.789,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.812,
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The US, under President Donald Trump, has threatened to cut aid to Honduras if right-wing National Party candidate Nasry Asfura does not win the presidential election. The vote is occurring in a highly polarized environment, with the US openly supporting Asfura. The outcome of the election has not yet been determined.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story informs about the US's stance on the Honduran election and its threat to cut aid. However, it lacks depth in terms of understanding the reasons behind this decision, the potential impacts on Honduras, and the context of US-Honduras relations.",
    "constructiveness_source": "gpt",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "Rachel Reeves says she did not lie about tax rises",
    "domain": "business",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Sun, 30 Nov 2025 18:01:05 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Reuters",
      "The Guardian",
      "Bloomberg"
    ],
    "domains": [
      "bbc.com",
      "news.google.com",
      "theguardian.com"
    ],
    "snippets": [
      "Conservative leader Kemi Badenoch says she's not satisfied with the chancellor's denial of lying and called on her to resign.",
      "UK's Reeves says she did not mislead public on the budget Reuters",
      "Chancellor accused of misleading public about reasons for tax rises, with opposition MPs calling for her to resign UK politics live – latest updates Rachel Reeves has denied lying to the public in the buildup to last week’s budget , insisting that she needed to raise taxes to a record level to ensur",
      "Rachel Reeves Denies Lying about UK Finances Pre-Budget Bloomberg.com"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/f098/live/b2dcd6d0-cdfe-11f0-9fb5-5f3a3703a365.png",
    "titles": [
      "Reeves denies she misled public over UK's finances in run-up to Budget",
      "UK's Reeves says she did not mislead public on the budget - Reuters",
      "Rachel Reeves denies lying to public in run-up to budget",
      "Rachel Reeves Denies Lying about UK Finances Pre-Budget - Bloomberg.com"
    ],
    "url": "https://www.bbc.com/news/articles/clyd38gp00eo?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMimgFBVV95cUxOQlRJT1RrcTNXX24tUnFNcXhjS3VCT3M0OXZ5T21pQ0JZN1NrYkJ4Vko4VEdvbkxOeU9EMDJtdEZieVA4ZHhzbGZ2V0pTQ1oxR1pxVWYwZ1JZMFdmUkxXZlRiZzBZcC1XZTBXd3pHbXA0ZUtxbkk5OVpwWlRqU3dWbEtuTmZPME5HMnlDM1lJWm9PUnFmcEFTWVh3?oc=5",
      "https://www.theguardian.com/politics/2025/nov/30/rachel-reeves-denies-lying-public-budget-tax-rises",
      "https://news.google.com/rss/articles/CBMitgFBVV95cUxPaGNOdHhhLVQ4WWYtcXo0dVVrd016V3oyaTZONW92cm1lOHNLV3E4VkdQRVl3bmRnNEk0RGhXSlR0bnYwNEQ3SmFUMG1Ub0V4eC14V3hHOGI4N1FhbzdGUW9sLUwxWGpoaXpjRXZJcksxWkFMOXo4UHhEbVVDZmRNRHBEUmc1UzgyQWdLTFNBVEt4NWtLY3Vic2hxYmJQSjYzczgyZUhSbHg2NkI0a0htN1E0bVJfQQ?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/news/articles/clyd38gp00eo?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.943,
      "consensus": 0.888,
      "constructiveness": 0.05,
      "proximity": 0.5
    },
    "score": 0.783,
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "UK Chancellor Rachel Reeves has denied accusations of lying about the reasons for recent tax increases, stating that the rises were necessary to support public finances. Conservative leader Kemi Badenoch and other opposition MPs have called for Reeves to resign, but Reeves maintains she did not mislead the public. The chancellor remains in her position.",
    "constructiveness_score": 0.05,
    "constructiveness_reason": "keywords (1): support; semantic: pos_sim=0.00, neg_sim=0.00",
    "constructiveness_source": "heuristic",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Four people killed in shooting at birthday party in California",
    "domain": "general",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Sun, 30 Nov 2025 14:38:36 -0500",
    "source": "ABC News",
    "sources": [
      "Deutsche Welle",
      "BBC",
      "ABC News"
    ],
    "domains": [
      "dw.com",
      "bbc.com",
      "abcnews.go.com"
    ],
    "snippets": [
      "Police in California have said four people were killed in a possible targeted shooting Saturday evening. The incident took place during a children's birthday party.",
      "Officials say 11 others are injured in what they believe is a \"targeted\" shooting at a children's birthday party.",
      "Four people were killed and 11 others wounded in a shooting at a banquet hall in Stockton, California on Saturday evening, local authorities said."
    ],
    "image_url": "https://s.abcnews.com/images/US/CaliforniaShooting_1764482538480_hpMain_4x3t_384.jpg",
    "titles": [
      "US: 4 killed, 10 injured in birthday party shooting",
      "Three children among four killed in shooting at 'birthday party' in California",
      "3 children among 4 people killed in banquet hall shooting: Sheriff's office"
    ],
    "url": "https://abcnews.go.com/US/4-dead-10-wounded-after-shooting-california-banquet/story?id=127972958",
    "alternate_urls": [
      "https://www.dw.com/en/us-4-killed-10-injured-in-birthday-party-shooting/a-74955605?maca=en-rss-en-top-1022-rdf",
      "https://www.bbc.com/news/articles/cvg81p61dnmo?at_medium=RSS&at_campaign=rss"
    ],
    "location_scope": "national",
    "link": "https://abcnews.go.com/US/4-dead-10-wounded-after-shooting-california-banquet/story?id=127972958",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.987,
      "consensus": 0.789,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.782,
    "summary_source": "cache",
    "summary_reason": "",
    "headline_source": "cache",
    "summary": "Four people were killed and ten others injured, including children, in a shooting at a family gathering in Stockton, California, on Saturday night. The incident occurred during a children's birthday party at a banquet hall. Police believe the attack was targeted but have not released information about the suspect's identity or motive. The investigation is ongoing.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story is largely reactive and sensational, focusing on a tragic event. It provides basic awareness about the incident but lacks depth, doesn't provide actionable insights, and doesn't report on solutions or improvements.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Four people killed and ten hurt in Stockton banquet hall shooting",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Sun, 30 Nov 2025 18:48:00 GMT",
    "source": "Associated Press",
    "sources": [
      "NPR",
      "Reuters",
      "Associated Press"
    ],
    "domains": [
      "npr.org",
      "news.google.com"
    ],
    "snippets": [
      "Four people were killed and 10 wounded in a shooting during a family gathering at a banquet hall in Stockton, sheriff's officials said Saturday.",
      "Four dead after 14 people shot at family gathering in Stockton, California Reuters",
      "Police search for shooter after 4 are killed and 11 wounded in shooting in Stockton, California AP News"
    ],
    "image_url": "",
    "titles": [
      "4 dead and 10 wounded in shooting at banquet hall in Stockton, California",
      "Four dead after 14 people shot at family gathering in Stockton, California - Reuters",
      "Police search for shooter after 4 are killed and 11 wounded in shooting in Stockton, California - AP News"
    ],
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxOUUJzd2FUZkFCaFphbmFENmd2NFh5NDBrVGgtdUV6UzJnaHdtRS1hMmtuaXRrXzhROUQ1c1YtZk5GTkhFa2lQOHRUYnpiVllVc0JIdC14RVoxWEljOURuSG5nRHR4RXF1cXZ2N05WMjJCbUNPb2ViRjN3R09HTlJ4ZFpNczBUc2xfTmQxWHA4bjdHUQ?oc=5",
    "alternate_urls": [
      "https://www.npr.org/2025/11/30/nx-s1-5625453/4-dead-shooting-banquet-hall-stockton-california",
      "https://news.google.com/rss/articles/CBMisgFBVV95cUxPcUVDRGFLV1VodmM1QU92OHV5dzRVWWdZWGhWQzNXQVdQLUZPbFpSZmUwUU5tYVRGbHZPT3hsMElCSjFBdHFEVDBEVVU3VGVPdFVEWEEya21WbVpvQjllZGpwdU1vYldpYXRhakhNM3JhRzA2ZWI2aEpNNC1xTFpJMG1JclBSMXVlaGdyV29WTTRyeS0zOE5icG1XMnZvbmpSZjNXN21pNFJqV0pWSmFmeFVR?oc=5"
    ],
    "location_scope": "national",
    "link": "https://news.google.com/rss/articles/CBMikgFBVV95cUxOUUJzd2FUZkFCaFphbmFENmd2NFh5NDBrVGgtdUV6UzJnaHdtRS1hMmtuaXRrXzhROUQ1c1YtZk5GTkhFa2lQOHRUYnpiVllVc0JIdC14RVoxWEljOURuSG5nRHR4RXF1cXZ2N05WMjJCbUNPb2ViRjN3R09HTlJ4ZFpNczBUc2xfTmQxWHA4bjdHUQ?oc=5",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.964,
      "consensus": 0.769,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.771,
    "summary_source": "cache",
    "summary_reason": "",
    "headline_source": "cache",
    "summary": "Four people were killed and 10 others were wounded in a shooting at a family gathering in a banquet hall in Stockton, California, on Saturday evening, according to local authorities. The incident is under investigation, and no suspects or motives have been announced.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "The story provides basic awareness about a tragic event but does not offer much depth or insight. It does not provide actionable insights or deeper understanding for the reader, nor does it report on solutions or improvements. The story does not increase clarity around systems, causes, trends, or impacts that matter.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Olympic athletes will stay in mobile homes at 2026 Winter Games",
    "domain": "sports",
    "source_domain": "cbc.ca",
    "location": "national",
    "published": "Sun, 30 Nov 2025 11:24:56 EST",
    "source": "CBC News",
    "sources": [
      "CBC News",
      "Associated Press"
    ],
    "domains": [
      "cbc.ca",
      "news.google.com"
    ],
    "snippets": [
      "The temporary Village that will house up to 1,400 athletes and other team members during the Feb. 6-22 Milan-Cortina Olympics consists of 377 rented mobile homes arranged close to one another on a humid valley floor.",
      "Behind the scenes of Cortina’s trailer-park Olympic Village: 400 mobile homes in an Alpine valley AP News"
    ],
    "image_url": "",
    "titles": [
      "Cortina Olympic Village is a trailer park featuring 400 mobile homes in an alpine valley",
      "Behind the scenes of Cortina’s trailer-park Olympic Village: 400 mobile homes in an Alpine valley - AP News"
    ],
    "url": "https://www.cbc.ca/sports/olympics/winter/olympic-village-trailer-park-mobile-homes-cortina-italy-9.6998007?cmp=rss",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiqAFBVV95cUxQNVJhdlJ1SjhneFh0d0h3b0lOU2FzNFVBLU5WUWNuTWxzYXduR3V5N3pOczVJaWMwMXE3eEs5V3ZzcXVqU0dzdnhZREt2aXFaQVVwd1N6eFBvQjhqRGc5VEdJZ1VwVDFSajA2a2xpYUdMbC1XWnRvQWhjRTl1czlsSTB0UHFVNkdDTXlOX0ZaTE9WTUxlaVIwX0o1NHhSdXFHd0NzaDhwSmM?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.cbc.ca/sports/olympics/winter/olympic-village-trailer-park-mobile-homes-cortina-italy-9.6998007?cmp=rss",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.902,
      "consensus": 0.591,
      "constructiveness": 0.6,
      "proximity": 1.0
    },
    "score": 0.769,
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The Milan-Cortina 2026 Winter Olympics will accommodate up to 1,400 athletes and team members in a temporary village made up of 377 rented mobile homes. These units are set up close together on a humid valley floor in Cortina, forming a trailer-park-style Olympic Village for the duration of the Games from February 6 to 22, 2026.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information about the accommodation arrangements for the 2026 Winter Olympics. However, it does not report on solutions, improvements, or innovations, nor does it increase clarity around systems, causes, trends, or impacts that matter. The depth of the story is also limited.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Officials say suspect in DC shooting became radical in United States",
    "domain": "business",
    "source_domain": "theguardian.com",
    "location": "global",
    "published": "Sun, 30 Nov 2025 16:29:57 GMT",
    "source": "The Guardian",
    "sources": [
      "ABC News",
      "Reuters",
      "The Guardian",
      "Bloomberg"
    ],
    "domains": [
      "abcnews.go.com",
      "news.google.com",
      "theguardian.com"
    ],
    "snippets": [
      "DHS Secretary Kristi Noem said that the suspect in Wednesday's National Guard shooting may have been radicalized in the U.S.",
      "National Guard shooting suspect radicalized in US, homeland secretary says Reuters",
      "Homeland security secretary also blamed ‘activist’ judges for defying court order to halt deportation flights Kristi Noem, the homeland security secretary, claimed on Sunday that the suspect in the national guard shooting in Washington DC was “radicalized” in the US and blamed the Biden administrati",
      "National Guard Shooter Was Radicalized in US, Noem Says Bloomberg.com"
    ],
    "image_url": "https://i.guim.co.uk/img/media/0db2a959337358c174a27109296b0334085ee8ca/486_23_2448_1959/master/2448.jpg?width=140&quality=85&auto=format&fit=max&s=4cc0b043c1c05ba9b84ebc4dd7c7bbb4",
    "titles": [
      "Noem says National Guard shooting suspect could have been radicalized in US",
      "National Guard shooting suspect radicalized in US, homeland secretary says - Reuters",
      "Kristi Noem claims suspect in national guard shooting was ‘radicalized’ in US",
      "National Guard Shooter Was Radicalized in US, Noem Says - Bloomberg.com"
    ],
    "url": "https://www.theguardian.com/us-news/2025/nov/30/kristi-noem-national-guard-shooting-deportation-flights",
    "alternate_urls": [
      "https://abcnews.go.com/Politics/noem-national-guard-shooting-suspect-radicalized-us/story?id=127977510",
      "https://news.google.com/rss/articles/CBMitgFBVV95cUxQaUMtd2dCWU9kOXpObjZ4WGZ6VWFkVXhqMXBOY2FmdmMxWlN2Qks5c2ZCdVhUc01LRzVfSm5ocmFlWWdtQTNNNUVVMGdhLWR1Y2dHcEZ6blFOQWI0YnlVNGpvZE1tWF9JYTNrOENyMW9nanZZQkdNeTZYcGdUZTBhR3U4R1FNb29ZMlp4MnZNNGlZbnhCamxSN1BiTHVHMkU4MXc5cGlna3BVY1dzMFZDQTlCQ1FPZw?oc=5",
      "https://news.google.com/rss/articles/CBMisAFBVV95cUxQMEpiQk1LMHRoTWlONUpyRGQxYXVxUVpPM095UXQ1SHdhRnB4SlVrYXY3a25sVklxSGRKMG42MnRtUW1wRHplcFlfQXdPS1NYRU5mT3VPS0hJeXRpRmZoc2NjWV93bkoxY2xOQjdmckFlZ1dLcnk2QS1mOXlieGN0RjBYbG9yRWJGZUh6ZFo2QVhoTWloODhSVVRyNlNnXzl5YnpxZGR2UjZWQ2x6aGE0NA?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.theguardian.com/us-news/2025/nov/30/kristi-noem-national-guard-shooting-deportation-flights",
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.904,
      "consensus": 0.888,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.766,
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Homeland Security Secretary Kristi Noem stated that the suspect in Wednesday's National Guard shooting in Washington, DC, was radicalized in the United States. Noem also criticized \"activist\" judges for blocking deportation flights. Authorities continue to investigate the incident.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.09",
    "constructiveness_source": "heuristic",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "Manchester United plays better in second half against Crystal Palace",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Sun, 30 Nov 2025 14:19:12 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sky Sports"
    ],
    "domains": [
      "espn.com",
      "skysports.com"
    ],
    "snippets": [
      "Man United and Joshua Zirkzee had a poor first half vs. Crystal Palace, but one moment of magic turned everything around.",
      "FREE TO WATCH: Highlights from Crystal Palace’s match against Manchester United in the Premier League."
    ],
    "image_url": "",
    "titles": [
      "Awful in first half, magic in second: Joshua Zirkzee leads Man United comeback",
      "Mount and Zirkzee lead Man Utd comeback against Crystal Palace"
    ],
    "url": "https://www.espn.com/soccer/story/_/id/47149761/zirkzee-leads-man-united-comeback-game-two-halves-vs-palace",
    "alternate_urls": [
      "https://www.skysports.com/watch/video/13477458/crystal-palace-1-2-manchester-united-premier-league-highlights"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/soccer/story/_/id/47149761/zirkzee-leads-man-united-comeback-game-two-halves-vs-palace",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.978,
      "consensus": 0.591,
      "constructiveness": 0.5,
      "proximity": 0.75
    },
    "score": 0.763,
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Manchester United struggled in the first half against Crystal Palace, with forward Joshua Zirkzee also facing difficulties. However, a standout play in the second half shifted the momentum in Manchester United's favor. The match highlights are available to watch, showing how the team's performance improved after the key moment.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story offers basic awareness of the match between Manchester United and Crystal Palace, highlighting a key moment that shifted the game's momentum. However, it lacks depth and does not provide actionable insights or progress reports. It also doesn't increase clarity around systems, causes, trends, or impacts that matter.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Dignitas founder Ludwig Minelli dies at age ninety two",
    "domain": "general",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Sun, 30 Nov 2025 19:30:42 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "bbc.com",
      "theguardian.com"
    ],
    "snippets": [
      "Ludwig Minelli founded the group in 1998, which has since helped thousands of people to die.",
      "Ludwig Minelli, whose work had lasting influence on Swiss law, dies just days before his 93rd birthday The head of the Swiss right-to-die organisation Dignitas has ended his life through an assisted death, the group has said. Ludwig Minelli, who founded the group in 1998, died on Saturday, days befo"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/1e92/live/9d0e5320-ce07-11f0-b581-8bb45e928046.jpg",
    "titles": [
      "Dignitas founder dies by assisted suicide aged 92, group says",
      "Dignitas founder ends his own life through assisted death"
    ],
    "url": "https://www.bbc.com/news/articles/c79x8x82gy4o?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://www.theguardian.com/society/2025/nov/30/dignitas-founder-ludwig-minelli-assisted-death"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/news/articles/c79x8x82gy4o?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.983,
      "consensus": 0.591,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.754,
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Ludwig Minelli, founder of the Swiss right-to-die organization Dignitas, has died through assisted suicide just days before his 93rd birthday. Minelli established Dignitas in 1998, and the group has since assisted thousands of people to end their lives. His work had a lasting impact on Swiss law regarding assisted dying.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful insight into the life and work of Ludwig Minelli, founder of Dignitas, and his impact on Swiss law regarding assisted dying. However, it does not report on solutions or improvements, nor does it give actionable insights to the reader.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Pope Leo visits Beirut and calls for peace",
    "domain": "business",
    "source_domain": "nytimes.com",
    "location": "global",
    "published": "Sun, 30 Nov 2025 19:18:12 +0000",
    "source": "New York Times",
    "sources": [
      "Al Jazeera",
      "Reuters",
      "New York Times"
    ],
    "domains": [
      "aljazeera.com",
      "news.google.com",
      "nytimes.com"
    ],
    "snippets": [
      "Crowds welcome Pope Leo in Beirut as he calls for an end to violence and promotes interfaith understanding.",
      "Pope Leo: Palestinian state 'only' solution to Israeli conflict Reuters",
      "Pope Leo takes peace message to Lebanon, target of Israeli strikes Reuters",
      "The pope, arriving in Lebanon, also encouraged that country’s Christians to stay where they are, despite economic, political and security concerns."
    ],
    "image_url": "https://static01.nyt.com/images/2025/11/30/multimedia/30int-pope-plane-qwlm/30int-pope-plane-qwlm-mediumSquareAt3X.jpg",
    "titles": [
      "Pope Leo insists on two-state solution to resolve Israel-Palestine conflict",
      "Pope Leo: Palestinian state 'only' solution to Israeli conflict - Reuters",
      "Pope Leo takes peace message to Lebanon, target of Israeli strikes - Reuters",
      "Pope Leo Calls for a Two-State Solution in Mideast Conflict"
    ],
    "url": "https://www.nytimes.com/2025/11/30/world/middleeast/pope-leo-two-state-solution-israel.html",
    "alternate_urls": [
      "https://www.aljazeera.com/news/2025/11/30/pope-leo-insists-on-2-state-solution-to-resolve-israel-palestine-conflict?traffic_source=rss",
      "https://news.google.com/rss/articles/CBMisAFBVV95cUxPZHFCa3NvcXFfbnVxbHZsX1ExY0FGbzJPVVpDUTFidkswLWFHSmtxUmNIZk1JaVNGM05rR3A0Q1cwSUJHN2FPZl92bGh5aFVjYXZKV0dWOVl5ekRDdDh4SllNc3RUVzFQQTVUdUwySk5fMDVGWGRnOXg3UGp3ak1GRFNmM1VSWUE4bXY2ZmlFV0FIVjVfc3pycVM0ZVdwejAwTUJxbW1NVk5vZXM4M21IZA?oc=5",
      "https://news.google.com/rss/articles/CBMitAFBVV95cUxQWUFvV1VuSUlDcHZEcmQwd1Y1cU9YWWxPRThCSWRIOHJ0QThCaG95c3JSdzhlVkU4aHpZVml4ME5Hc2hwdF9VNmE3RkR5RnpnbUIzX1JfRU00ZElDaHVVb3ZRVm9XUV9laVdqSmhpVmZ2WFdXTkNWR0d6SUZXNkstOHZVUlVZNHF0ZzVFcTQtTWJHV0hSc3RUYTNyeUZPUzlwbGMxWHk2a1BaTk1mUTJFcG92bTU?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.nytimes.com/2025/11/30/world/middleeast/pope-leo-two-state-solution-israel.html",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.977,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.749,
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Pope Leo arrived in Beirut, where he was welcomed by large crowds. He called for an end to violence, promoted interfaith understanding, and stated that a Palestinian state is the only solution to the Israeli conflict. He also urged Lebanese Christians to remain in the country despite ongoing economic, political, and security challenges.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "keywords (1): solution; negative_penalty=0.05 (keywords: violence); semantic: pos_sim=0.00, neg_sim=0.10",
    "constructiveness_source": "heuristic",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "Billy Bonds who played for West Ham dies at age 79",
    "domain": "sports",
    "source_domain": "theguardian.com",
    "location": "global",
    "published": "Sun, 30 Nov 2025 14:38:33 GMT",
    "source": "The Guardian",
    "sources": [
      "BBC",
      "The Guardian",
      "Sportsnet"
    ],
    "domains": [
      "bbc.com",
      "theguardian.com",
      "sportsnet.ca"
    ],
    "snippets": [
      "Billy Bonds, West Ham's record appearance maker who led them to two FA Cup titles, passes away peacefully on Sunday morning.",
      "That he stayed after relegation in 1978 and lifted the FA Cup with the team still in Division Two typified his commitment Some players embody a club but few have ever embodied their side more than Billy Bonds, who died on Sunday at the age of 79. He was not a one-club man but by the time he finally",
      "LONDON (AP) — Billy Bonds, the former West Ham United player and manager described as one of soccer’s “greatest competitors,” has died. He was 79. His death was confirmed in a statement by his family via West Ham on Sunday. The Premier League club said Bonds “passed away peacefully” on Sunday morning. Former West Ham captain Bonds was the longest-serving player in the club’s history, making 799 appearances over a 21-year spell. He won two FA Cups before retiring at the age of 41. He managed West Ham from 1990-94. “Dad loved West Ham United and its wonderful supporters with all his heart and..."
    ],
    "image_url": "https://i.guim.co.uk/img/media/82b4e20893c64465c69770768db5ed03586e3d09/277_0_5072_4057/master/5072.jpg?width=140&quality=85&auto=format&fit=max&s=04e93db47c9549d58fe06c1998022c13",
    "titles": [
      "West Ham legend Billy Bonds dies aged 79",
      "Claret and blue, through and through: Billy Bonds embodied West Ham",
      "West Ham great Billy Bonds dead at 79"
    ],
    "url": "https://www.theguardian.com/football/2025/nov/30/claret-and-blue-through-and-through-billy-bonds-embodied-west-ham",
    "alternate_urls": [
      "https://www.bbc.com/sport/football/articles/cy47lde523zo?at_medium=RSS&at_campaign=rss"
    ],
    "location_scope": "global",
    "link": "https://www.theguardian.com/football/2025/nov/30/claret-and-blue-through-and-through-billy-bonds-embodied-west-ham",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.859,
      "consensus": 0.789,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.744,
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Billy Bonds, West Ham United’s record appearance maker and former captain, died peacefully on Sunday at age 79. Bonds played 799 games for the club over 21 years, winning two FA Cups and later managing the team from 1990 to 1994. His death was confirmed by his family and West Ham United.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "While the story offers basic awareness of Billy Bonds' death and his contributions to West Ham United, it provides minimal depth or insight. There is no actionable insight, progress report, or increased clarity around systems or trends.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "US and Ukraine leaders meet in Florida to talk about peace",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Sun, 30 Nov 2025 15:45:23 GMT",
    "source": "Bloomberg",
    "sources": [
      "NPR",
      "Bloomberg",
      "Financial Post"
    ],
    "domains": [
      "npr.org",
      "news.google.com",
      "financialpost.com"
    ],
    "snippets": [
      "Top Trump administration officials are meeting Ukrainian negotiators in Florida this weekend, pushing to broker an end to Russia's war in Ukraine.",
      "Rubio, Witkoff Meeting Ukrainian Team in Florida Early Sunday Bloomberg.com",
      "US officials are meeting with a Ukrainian delegation in south Florida as the White House continues its drive toward an agreement on ending the Kremlin’s almost four-year war on Ukraine."
    ],
    "image_url": "",
    "titles": [
      "Rubio and Witkoff are meeting with Ukraine's negotiators in Florida as Trump pushes to broker a deal",
      "Rubio, Witkoff Meeting Ukrainian Team in Florida Early Sunday - Bloomberg.com",
      "Rubio, Witkoff Meet Ukrainian Team in Pursuit of Peace Deal"
    ],
    "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxNTGdHUDhsR0piX1ZqbnR3Z3ZaSENLVFBWRWEtY2ZSVV9vTnhpZEh6eHVoUi01cU5WaG5UZ29JX0VDM1VGdUN1N2J1dVRMaWJldi1hd1FoVmJTNGJJdTBaX21PNWpJWUFCZFM2S0JsZFV2czlqV3V2YkcySEIzZ0F3ZDlQM1JBSkdnUmdCbDQ1MUpyZExfSkgweWZxT1BxQXVTd2FZSXg2aHFnM1F3aldn?oc=5",
    "alternate_urls": [
      "https://www.npr.org/2025/11/30/nx-s1-5625473/rubio-witkoff-ukraine-negotiators-florida-deal",
      "https://financialpost.com/pmn/business-pmn/rubio-witkoff-meeting-ukrainian-team-in-florida-early-sunday"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMirwFBVV95cUxNTGdHUDhsR0piX1ZqbnR3Z3ZaSENLVFBWRWEtY2ZSVV9vTnhpZEh6eHVoUi01cU5WaG5UZ29JX0VDM1VGdUN1N2J1dVRMaWJldi1hd1FoVmJTNGJJdTBaX21PNWpJWUFCZFM2S0JsZFV2czlqV3V2YkcySEIzZ0F3ZDlQM1JBSkdnUmdCbDQ1MUpyZExfSkgweWZxT1BxQXVTd2FZSXg2aHFnM1F3aldn?oc=5",
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.886,
      "consensus": 0.789,
      "constructiveness": 0.05,
      "proximity": 0.5
    },
    "score": 0.739,
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Senior U.S. officials are meeting with Ukrainian negotiators in Florida to discuss efforts to end Russia's war in Ukraine. The talks are part of ongoing U.S. initiatives to broker a resolution to the conflict, which has lasted nearly four years. The meetings are taking place this weekend, with the goal of advancing peace negotiations.",
    "constructiveness_score": 0.05,
    "constructiveness_reason": "keywords (1): effort; semantic: pos_sim=0.00, neg_sim=0.13",
    "constructiveness_source": "heuristic",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "North Carolina football team ends season with 4 wins and 8 losses",
    "domain": "politics",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Sun, 30 Nov 2025 14:29:32 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "espn.com",
      "sportsnet.ca"
    ],
    "snippets": [
      "Bill Belichick's debut season at North Carolina ended with a blowout loss to rival NC State, capping a 4-8 campaign filled with struggles for the Tar Heels.",
      "Bill Belichick stood at the microphone in a crowded room of reporters. North Carolina’s season had just ended with a lopsided loss to a fierce nearby rival to cap a four-win season."
    ],
    "image_url": "",
    "titles": [
      "Belichick's debut UNC season ends in rivalry loss",
      "Belichick’s rough first season at North Carolina ends in rivalry loss at NC State"
    ],
    "url": "https://www.espn.com/college-football/story/_/id/47149380/bill-belichick-debut-unc-season-ends-loss-nc-state",
    "alternate_urls": [],
    "location_scope": "national",
    "link": "https://www.espn.com/college-football/story/_/id/47149380/bill-belichick-debut-unc-season-ends-loss-nc-state",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.982,
      "consensus": 0.591,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.738,
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Bill Belichick’s first season as head coach at North Carolina ended with a heavy loss to rival NC State, finalizing a 4-8 record for the Tar Heels. The team struggled throughout the season and failed to qualify for a bowl game. Belichick addressed reporters after the season-ending defeat.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "While this story provides basic information about the North Carolina football team's season record, it offers minimal insight into why the team struggled, what the implications are for the team, or any potential solutions or plans for improvement.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "US military builds up forces near Venezuela in Caribbean islands",
    "domain": "general",
    "source_domain": "nytimes.com",
    "location": "global",
    "published": "Sun, 30 Nov 2025 18:41:10 +0000",
    "source": "New York Times",
    "sources": [
      "Washington Post",
      "New York Times"
    ],
    "domains": [
      "washingtonpost.com",
      "nytimes.com"
    ],
    "snippets": [
      "The Dominican Republic and Trinidad and Tobago are hosting U.S. forces and facilities. Grenada is considering it.",
      "Venezuela doesn’t play a large role in the drug trade to the United States, so what is motivating the massive military buildup? Julian E. Barnes, who reports on intelligence and international security, discusses the issues with our senior writer Katrin Bennhold."
    ],
    "image_url": "",
    "titles": [
      "Here are the Caribbean allies helping the U.S. against Venezuela",
      "Why Is the U.S. Threatening Venezuela?"
    ],
    "url": "https://www.nytimes.com/video/world/americas/100000010549651/trump-venezuela-pressure-campaign.html",
    "alternate_urls": [
      "https://www.washingtonpost.com/world/2025/11/29/us-venezuela-dominican-trinidad-grenada/"
    ],
    "location_scope": "global",
    "link": "https://www.nytimes.com/video/world/americas/100000010549651/trump-venezuela-pressure-campaign.html",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.961,
      "consensus": 0.591,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.737,
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The Dominican Republic and Trinidad and Tobago are currently hosting U.S. military forces and facilities. Grenada is evaluating the possibility of doing the same. Despite a limited role in drug trafficking to the U.S., Venezuela's proximity has prompted a significant U.S. military buildup in the region, raising questions about strategic motivations.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful context about the U.S. military's presence in the Caribbean, potentially contributing to a deeper understanding of international relations. However, it does not provide actionable insights, nor does it report on solutions or improvements.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "People gather after Hong Kong fire as police detain one",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Sun, 30 Nov 2025 16:19:12 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "The Guardian"
    ],
    "domains": [
      "news.google.com",
      "theguardian.com"
    ],
    "snippets": [
      "Mourners flock to site of deadly Hong Kong blaze as Beijing warns against protests Reuters",
      "Police on Saturday detained one person who was part of a group that launched a petition demanding accountability Anger over a deadly blaze at a Hong Kong high-rise apartment complex simmered on Sunday as Beijing warned against attempts to use the disaster to disrupt the city, while people across the"
    ],
    "image_url": "",
    "titles": [
      "Mourners flock to site of deadly Hong Kong blaze as Beijing warns against protests - Reuters",
      "Anger mounts in Hong Kong over apartment fires as Beijing warns against ‘anti-China disruptors’"
    ],
    "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxNTmZFZ1JWZjNJYVVlZmp0Z0d0S2RXMHIxMG1hdFVaOGUxWU9DdUprZmF5V2hDT0E4QW83UzJIRUdIamZ2Yy1ycVNnZUl4SDZrVmRxN1JWaldqWVVPRUVXR0NaZVZmMWVHRXQ2akxFT3JEd0pLS0Y0d283bF9VTU1Dck43N20xaG5NNGxJQk12aW5xbWZEeW5YNUtRd1V1UjV6MGlyM09RUDNrYnZpeEx5TXBjTVRTdVNfdlZ4MGRFYw?oc=5",
    "alternate_urls": [
      "https://www.theguardian.com/news/2025/nov/30/anger-mounts-in-hong-kong-over-apartment-fires-as-beijing-warns-against-anti-china-disruptors"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMivwFBVV95cUxNTmZFZ1JWZjNJYVVlZmp0Z0d0S2RXMHIxMG1hdFVaOGUxWU9DdUprZmF5V2hDT0E4QW83UzJIRUdIamZ2Yy1ycVNnZUl4SDZrVmRxN1JWaldqWVVPRUVXR0NaZVZmMWVHRXQ2akxFT3JEd0pLS0Y0d283bF9VTU1Dck43N20xaG5NNGxJQk12aW5xbWZEeW5YNUtRd1V1UjV6MGlyM09RUDNrYnZpeEx5TXBjTVRTdVNfdlZ4MGRFYw?oc=5",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.9,
      "consensus": 0.591,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.725,
    "summary_source": "cache",
    "summary_reason": "",
    "headline_source": "cache",
    "summary": "Mourners gathered at the site of a deadly high-rise fire in Hong Kong, where public anger over the incident continued. Police detained one person involved in a petition calling for accountability. Chinese authorities warned against using the tragedy for protests or to disrupt the city. The investigation into the cause of the blaze is ongoing.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story informs about an ongoing situation in Hong Kong and the public response to it. It provides some context about the incident and the subsequent arrest, contributing to the reader's understanding of the situation. However, it does not clearly highlight progress or solutions, and the depth of the information provided could be improved.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Vancouver Whitecaps reach first MLS Cup final after win",
    "domain": "sports",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Sun, 30 Nov 2025 14:01:43 GMT",
    "source": "Globe and Mail",
    "sources": [
      "Globe and Mail",
      "Sportsnet"
    ],
    "domains": [
      "news.google.com",
      "sportsnet.ca"
    ],
    "snippets": [
      "Vancouver Whitecaps earn spot in MLS Cup final against Miami after beating San Diego FC The Globe and Mail",
      "On Saturday night, the Whitecaps bested San Diego FC and is now just 90 minutes away from being crowned MLS champions for the first time in its history. John Molinaro has what you need to know about the Whitecaps’ win."
    ],
    "image_url": "",
    "titles": [
      "Vancouver Whitecaps earn spot in MLS Cup final against Miami after beating San Diego FC - The Globe and Mail",
      "Whitecaps’ dominance, composure over San Diego FC earns trip to MLS Cup final"
    ],
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxNNmR0OWZfV21OMExqbjF6Y3prLTlaTHRHd1ZYV2NiWERoaS0xQmJRRkFUNXItSHlHZDBTRVg4SXJDUHoxYl94UjNsQXh4VnlONGRFMWNyakJqbHA2MlBrZXFZSmM0YThadUoyc2V5T0MwejRxOUVGTEEtT1h6T2kzOGNudWxfYUs4U2tNX0F6UUQtUQ?oc=5",
    "alternate_urls": [],
    "location_scope": "national",
    "link": "https://news.google.com/rss/articles/CBMikgFBVV95cUxNNmR0OWZfV21OMExqbjF6Y3prLTlaTHRHd1ZYV2NiWERoaS0xQmJRRkFUNXItSHlHZDBTRVg4SXJDUHoxYl94UjNsQXh4VnlONGRFMWNyakJqbHA2MlBrZXFZSmM0YThadUoyc2V5T0MwejRxOUVGTEEtT1h6T2kzOGNudWxfYUs4U2tNX0F6UUQtUQ?oc=5",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.844,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.692,
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The Vancouver Whitecaps defeated San Diego FC on Saturday night, securing a place in the MLS Cup final against Miami. This marks the first time in the club’s history that they have reached the final. The Whitecaps are now one win away from their first MLS championship. The final will determine the 2024 MLS champion.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00",
    "constructiveness_source": "heuristic",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Heavy rain and floods in Sumatra kill over 440 people",
    "domain": "science",
    "source_domain": "nytimes.com",
    "location": "global",
    "published": "Sun, 30 Nov 2025 17:38:48 +0000",
    "source": "New York Times",
    "sources": [
      "BBC",
      "New York Times"
    ],
    "domains": [
      "bbc.com",
      "nytimes.com"
    ],
    "snippets": [
      "The death toll on the island of Sumatra has risen to more than 440, the government says.",
      "Hundreds of people have been killed and millions displaced as extreme weather has ravaged Southeast Asia this month. Indonesia’s heavy rain was linked to two tropical cyclones."
    ],
    "image_url": "https://static01.nyt.com/images/2025/11/30/multimedia/30xp-flooding-jhgl/30xp-flooding-jhgl-mediumSquareAt3X.jpg",
    "titles": [
      "Indonesia searches for hundreds missing in deadly floods",
      "Deadly Floods in Indonesia Leave Hundreds Missing"
    ],
    "url": "https://www.nytimes.com/2025/11/30/world/asia/flooding-indonesia-thailand-southeast-asia.html",
    "alternate_urls": [
      "https://www.bbc.com/news/articles/clyz82z7p8zo?at_medium=RSS&at_campaign=rss"
    ],
    "location_scope": "global",
    "link": "https://www.nytimes.com/2025/11/30/world/asia/flooding-indonesia-thailand-southeast-asia.html",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.933,
      "consensus": 0.591,
      "constructiveness": 0.12,
      "proximity": 0.5
    },
    "score": 0.687,
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "More than 440 people have died on Sumatra amid severe weather in Southeast Asia this month, according to the Indonesian government. Heavy rains, attributed to two tropical cyclones, have caused extensive flooding and landslides. Millions have been displaced across the region as authorities continue rescue and relief efforts.",
    "constructiveness_score": 0.12,
    "constructiveness_reason": "keywords (2): effort, relief; semantic: pos_sim=0.08, neg_sim=0.00; semantic_boost=0.02",
    "constructiveness_source": "heuristic",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Trump says US wants to close airspace over Venezuela",
    "domain": "politics",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Sat, 29 Nov 2025 23:03:43 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "Washington Post",
      "CBC News"
    ],
    "domains": [
      "news.google.com",
      "washingtonpost.com",
      "cbc.ca"
    ],
    "snippets": [
      "Trump says Venezuelan airspace should be considered closed Reuters",
      "President Donald Trump’s announcement follows growing U.S. threats to attack Venezuela.",
      "U.S. President Donald Trump on Saturday said that the airspace \"above and surrounding\" Venezuela should be considered as \"closed in its entirety,\" an assertion that raised more questions about the U.S. pressure on Venezuelan leader Nicolas Maduro. His government accused Trump of making a \"colonial t"
    ],
    "image_url": "",
    "titles": [
      "Trump says Venezuelan airspace should be considered closed - Reuters",
      "Trump says airlines should consider Venezuelan airspace closed",
      "Maduro slams 'colonial threat' as Trump says Venezuelan airspace should be closed"
    ],
    "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxONXk4VHEya2pxbDczZnZvY2dXX3pIUmRmX295Y25NNWJmQk5BMm5nUXNpcWw1ZXRsMUE1cTlmOFBpTUtCLUI1N2tuNkYxWVc5NWNkUFlRT2ZVQlRZMzNXQ0J3cTNWOTR5d3lSY205TTFwbHJScWtSMFN5bVJHYTZGdE9PazZucW5qZ0tIQ0F1d1laak5nWWxIZTdrWmlWNlBodEZjQTYyd0UwclRvdHBlaU9YRWhNb0cta1c1VF9n?oc=5",
    "alternate_urls": [
      "https://www.washingtonpost.com/national-security/2025/11/29/trump-venezuela-air-space-closure/",
      "https://www.cbc.ca/news/world/trump-maduro-venezuela-airspace-9.6997688?cmp=rss"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMivgFBVV95cUxONXk4VHEya2pxbDczZnZvY2dXX3pIUmRmX295Y25NNWJmQk5BMm5nUXNpcWw1ZXRsMUE1cTlmOFBpTUtCLUI1N2tuNkYxWVc5NWNkUFlRT2ZVQlRZMzNXQ0J3cTNWOTR5d3lSY205TTFwbHJScWtSMFN5bVJHYTZGdE9PazZucW5qZ0tIQ0F1d1laak5nWWxIZTdrWmlWNlBodEZjQTYyd0UwclRvdHBlaU9YRWhNb0cta1c1VF9n?oc=5",
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.557,
      "consensus": 0.789,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.685,
    "summary_source": "cache",
    "summary_reason": "",
    "headline_source": "cache",
    "summary": "On Saturday, U.S. President Donald Trump announced on social media that the airspace above and around Venezuela should be considered \"closed in its entirety\" to airlines, drug traffickers, and others. The statement follows increased U.S. military activity near Venezuela and rising tensions with President Nicolás Maduro. Venezuela has not officially responded. The U.S. cannot legally close another country's airspace, but the warning may deter flights.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about the current political tensions between the U.S. and Venezuela. However, it lacks depth or insight into the implications of such a move, the legality and feasibility of it, or how it might impact the citizens of Venezuela or international relations.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Big investor asks Microsoft to report on human rights impact",
    "domain": "politics",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Sun, 30 Nov 2025 08:59:37 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "Bloomberg"
    ],
    "domains": [
      "news.google.com"
    ],
    "snippets": [
      "Norway wealth fund to back call for Microsoft human rights report at AGM Reuters",
      "Norway’s $2.1 Trillion Fund Backs Microsoft in Human Rights Vote Bloomberg.com"
    ],
    "image_url": "",
    "titles": [
      "Norway wealth fund to back call for Microsoft human rights report at AGM - Reuters",
      "Norway’s $2.1 Trillion Fund Backs Microsoft in Human Rights Vote - Bloomberg.com"
    ],
    "url": "https://news.google.com/rss/articles/CBMi5wFBVV95cUxPNS1tTDZ5ZmVvY194Ty1OdVNHaHBfVE1KZGphMVV5X0U4SHNzYXJsTXkzVXFYeExhSHVOOGVyNTBfVTBTc2p2VTBRMnpZeTVBQ2pSdUFfVjNzb3hzZXFQdlRLRng5cUxoSE9lT0VPdzNLTXhaYW5EZFhiRlo3RUdXeWFrZXdKT1dRUW5ZTEZCbDJSNS14NDZ0dTctQ0xNUmxMNGh3MW9hTXZ2RkFPNGlmVzd2VXVTQmVkNFNFemVuaWxEeEpvTXM3WjNLTDhYMEdkd2lud2ZBVFJKUFlyS2Vpay02d0FWZjQ?oc=5",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMitAFBVV95cUxQdV9xa0dCY2Nrdm1EWTZfLU92X3RybU1nU2R2bkRUYndNdGREcmFEQ2J4RkNJbUVzUFY1WlNUWkZGNko3NU5xX2lBMVlZMTN1Z3RaeUU0emZ3Ti11SkFTLWs4TGdfQ2VwS1M4YmtoM2JFTW5ibl9jVXFhVXdlVUZSWl9GQkM2OHNBTmJIYms2Rzh1ekRhdFg5VVJlWDZGb20xN2l3emVBSm56bVhrOUdUblZkZFQ?oc=5"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMi5wFBVV95cUxPNS1tTDZ5ZmVvY194Ty1OdVNHaHBfVE1KZGphMVV5X0U4SHNzYXJsTXkzVXFYeExhSHVOOGVyNTBfVTBTc2p2VTBRMnpZeTVBQ2pSdUFfVjNzb3hzZXFQdlRLRng5cUxoSE9lT0VPdzNLTXhaYW5EZFhiRlo3RUdXeWFrZXdKT1dRUW5ZTEZCbDJSNS14NDZ0dTctQ0xNUmxMNGh3MW9hTXZ2RkFPNGlmVzd2VXVTQmVkNFNFemVuaWxEeEpvTXM3WjNLTDhYMEdkd2lud2ZBVFJKUFlyS2Vpay02d0FWZjQ?oc=5",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.734,
      "consensus": 0.571,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.685,
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Norway’s $2.1 trillion sovereign wealth fund has announced it will support a shareholder proposal calling for Microsoft to publish a report on its human rights impact at the company’s annual general meeting. The fund is one of Microsoft’s largest investors. The proposal aims to increase transparency around Microsoft’s business practices related to human rights.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it provides useful information about the call for increased transparency in Microsoft's business practices related to human rights. It also highlights the role of shareholders in influencing corporate behavior. However, it does not offer a solution or report on progress in addressing the issue.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Zootopia 2 earns 556 million dollars around the world",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Sun, 30 Nov 2025 19:30:21 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "CNBC"
    ],
    "domains": [
      "news.google.com",
      "cnbc.com"
    ],
    "snippets": [
      "Disney's 'Zootopia 2' fuels box office frenzy with $556 million worldwide Reuters",
      "Disney's \"Zootopia 2\" tallied an estimated $156 million during the five-day Thanksgiving holiday, leading the box office to a top five performance."
    ],
    "image_url": "",
    "titles": [
      "Disney's 'Zootopia 2' fuels box office frenzy with $556 million worldwide - Reuters",
      "'Zootopia 2' fuels top 5 Thanksgiving box office haul"
    ],
    "url": "https://news.google.com/rss/articles/CBMiowFBVV95cUxPbl8wZ3VYeVVLT2E1Q09wRjBvc2pnemx0Zm0ydkhfOE9oYmNtb2tQUWMxenFyU0o1RFZiRkl1bWpKNE1sb19Wd1ZXV1JMVEd4SWlIaTVLdUxyVGZWNHd5ZlhPUzM4NWs2N1FPUXB3OUI2clpHYXBnMkxmbDRsZk93N3hTenRtQmtDb2xCSFp4aVJJVkxkbHplUGpZOEgyUWxhRVNV?oc=5",
    "alternate_urls": [
      "https://www.cnbc.com/2025/11/30/zootopia-2-fuels-top-5-thanksgiving-box-office-haul.html"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMiowFBVV95cUxPbl8wZ3VYeVVLT2E1Q09wRjBvc2pnemx0Zm0ydkhfOE9oYmNtb2tQUWMxenFyU0o1RFZiRkl1bWpKNE1sb19Wd1ZXV1JMVEd4SWlIaTVLdUxyVGZWNHd5ZlhPUzM4NWs2N1FPUXB3OUI2clpHYXBnMkxmbDRsZk93N3hTenRtQmtDb2xCSFp4aVJJVkxkbHplUGpZOEgyUWxhRVNV?oc=5",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.983,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.684,
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Disney's \"Zootopia 2\" has earned $556 million worldwide, including an estimated $156 million during the five-day Thanksgiving holiday. The film led the box office and contributed to one of the top five Thanksgiving performances on record.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00",
    "constructiveness_source": "heuristic",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Big fireball rises at Sydney waste site two firefighters hurt",
    "domain": "general",
    "source_domain": "theguardian.com",
    "location": "global",
    "published": "Sun, 30 Nov 2025 15:16:01 GMT",
    "source": "The Guardian",
    "sources": [
      "Al Jazeera",
      "The Guardian"
    ],
    "domains": [
      "aljazeera.com",
      "theguardian.com"
    ],
    "snippets": [
      "A huge fireball exploded at a waste facility in an Australian suburb in western Sydney.",
      "Footage provided by Fire and Rescue NSW shows the dramatic moment a fireball exploded at a waste facility in North St Marys in western Sydney, Australia, on Saturday evening. The fireball sent flames up to 150 metres into the sky, according to authorities. Two firefighters were reported to have sust"
    ],
    "image_url": "https://i.guim.co.uk/img/media/57d35905e0f15a6fc6ad6cf2c6653d1a39d2d2ca/966_114_954_763/master/954.jpg?width=140&quality=85&auto=format&fit=max&s=305875cab82dfd87c30248e7d33b2369",
    "titles": [
      "Massive fire erupts at waste facility in western Sydney",
      "Huge fireball erupts at Sydney waste facility – video"
    ],
    "url": "https://www.theguardian.com/australia-news/video/2025/nov/30/huge-fireball-erupts-at-sydney-waste-facility-video",
    "alternate_urls": [
      "https://www.aljazeera.com/video/newsfeed/2025/11/30/massive-fire-erupts-at-waste-facility-in-western-sydney?traffic_source=rss"
    ],
    "location_scope": "global",
    "link": "https://www.theguardian.com/australia-news/video/2025/nov/30/huge-fireball-erupts-at-sydney-waste-facility-video",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.874,
      "consensus": 0.591,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.681,
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "A large fireball erupted at a waste facility in North St Marys, western Sydney, on Saturday evening, sending flames up to 150 metres high. Fire and Rescue NSW released footage of the incident. Two firefighters sustained minor injuries. Authorities are investigating the cause of the explosion.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story reports on an incident at a waste facility, but does not provide actionable insights or a deeper understanding of the situation. It also does not report on solutions or improvements, and provides minimal depth or insight.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Snow is expected in New York City on Tuesday morning",
    "domain": "science",
    "source_domain": "financialpost.com",
    "location": "national",
    "published": "Sun, 30 Nov 2025 14:54:54 +0000",
    "source": "Financial Post",
    "sources": [
      "Bloomberg",
      "Financial Post"
    ],
    "domains": [
      "news.google.com",
      "financialpost.com"
    ],
    "snippets": [
      "New York City Facing Snowy Commute on Tuesday from Early Storm Bloomberg.com",
      "New York City and the Northeast will likely see a dollop of snow late Monday into Tuesday from a storm rising up from the US Gulf coast, even as a record-breaking system pulls away from Chicago and the Midwest."
    ],
    "image_url": "",
    "titles": [
      "New York City Facing Snowy Commute on Tuesday from Early Storm - Bloomberg.com",
      "New York City Facing Snowy Commute on Tuesday from Early Storm"
    ],
    "url": "https://financialpost.com/pmn/business-pmn/new-york-city-facing-snowy-commute-on-tuesday-from-early-storm",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiswFBVV95cUxPUzhJd2l5SDZQekRRdlpjdDJNTTZvVlp3cTU0VVJWZU9COTZXMkNrUGZNeDhkUjlfclg5Q2E3Y3VreTV5d0tlNGdRWmJSWmZyVlpaajNCN0xDd1oxaFdWelh5bnJrV0hnb2c3R2YzVEZ3VW8weVFma1RpbzhVMFk1Q3liQ1FHUmRVcEVWTGpuMEtDbktsUl90R3BwMHUyN0NRYWtPZEVUZ1J6bTc4QjZxZC1CNA?oc=5"
    ],
    "location_scope": "national",
    "link": "https://financialpost.com/pmn/business-pmn/new-york-city-facing-snowy-commute-on-tuesday-from-early-storm",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.865,
      "consensus": 0.591,
      "constructiveness": 0.048,
      "proximity": 0.75
    },
    "score": 0.678,
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "New York City and the Northeast are expected to receive snow late Monday into Tuesday due to a storm moving up from the Gulf Coast. This weather event follows a record-breaking system that is now moving away from Chicago and the Midwest. Commuters in New York City may face snowy conditions during Tuesday's morning commute.",
    "constructiveness_score": 0.048,
    "constructiveness_reason": "semantic: pos_sim=0.19, neg_sim=0.00; semantic_boost=0.05",
    "constructiveness_source": "heuristic",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Arsenal and Chelsea draw 1 1 in London soccer match",
    "domain": "sports",
    "source_domain": "sports.yahoo.com",
    "location": "national",
    "published": "Sun, 30 Nov 2025 19:41:46 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Al Jazeera",
      "Yahoo Sports"
    ],
    "domains": [
      "aljazeera.com",
      "sports.yahoo.com"
    ],
    "snippets": [
      "Mikel Merino cancels out Trevoh Chalobah's opener to spare the Premier League leaders' blushes at Stamford Bridge.",
      "Mikel Merino rescued Arsenal as the Premier League leaders battled to a 1-1 draw against 10-man Chelsea in a bad-tempered London derby on Sunday.Arsenal arrived as the best set-piece team in the league with 10 goals in 12 matches."
    ],
    "image_url": "",
    "titles": [
      "Merino strikes to earn Arsenal bruising 1-1 draw against 10-man Chelsea",
      "Merino strikes to give Arsenal bruising draw at 10-man Chelsea"
    ],
    "url": "https://sports.yahoo.com/articles/merino-strikes-arsenal-bruising-draw-183354861.html",
    "alternate_urls": [
      "https://www.aljazeera.com/sports/2025/11/30/merino-strikes-to-earn-arsenal-bruising-1-1-draw-at-10-man-chelsea?traffic_source=rss"
    ],
    "location_scope": "national",
    "link": "https://sports.yahoo.com/articles/merino-strikes-arsenal-bruising-draw-183354861.html",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.988,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.25
    },
    "score": 0.66,
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Arsenal drew 1-1 with Chelsea at Stamford Bridge in a tense London derby. Trevoh Chalobah scored first for Chelsea, but Mikel Merino equalized for Arsenal, who remain Premier League leaders. Chelsea finished the match with 10 players. Arsenal have now scored 11 set-piece goals in 13 matches.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.10",
    "constructiveness_source": "heuristic",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "US officials meet Ukraine leaders to talk about ending war",
    "domain": "business",
    "source_domain": "ft.com",
    "location": "global",
    "published": "Sun, 30 Nov 2025 13:51:48 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times",
      "New York Times"
    ],
    "domains": [
      "ft.com",
      "nytimes.com"
    ],
    "snippets": [
      "US-Ukraine meeting expected to open potentially pivotal week of diplomacy to end war",
      "Secretary of State Marco Rubio, Steve Witkoff and Jared Kushner plan to discuss peace terms again after an uproar over a 28-point proposal drafted with Russian input."
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Fd15f1a78-61f4-4562-b1c3-48669686c382.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Zelenskyy aides meet Trump team in Florida for talks on peace plan",
      "Top Trump Aides to Meet With Ukrainians in Florida on Sunday"
    ],
    "url": "https://www.ft.com/content/feea78a5-364a-4296-895b-a68323fe4944",
    "alternate_urls": [
      "https://www.nytimes.com/2025/11/29/us/politics/trump-aides-ukraine-florida-meeting.html"
    ],
    "location_scope": "global",
    "link": "https://www.ft.com/content/feea78a5-364a-4296-895b-a68323fe4944",
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.84,
      "consensus": 0.591,
      "constructiveness": 0.05,
      "proximity": 0.5
    },
    "score": 0.658,
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "U.S. Secretary of State Marco Rubio, along with Steve Witkoff and Jared Kushner, is scheduled to meet with Ukrainian officials this week to discuss potential peace terms for ending the war. The talks follow controversy over a 28-point proposal that included Russian input. The meeting marks the start of a critical week of diplomatic efforts, but no agreement has been reached yet.",
    "constructiveness_score": 0.05,
    "constructiveness_reason": "keywords (1): effort; semantic: pos_sim=0.00, neg_sim=0.17",
    "constructiveness_source": "heuristic",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Floods in Indonesia and Sri Lanka make rescue work hard",
    "domain": "science",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Sun, 30 Nov 2025 13:51:13 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "CBC News"
    ],
    "domains": [
      "aljazeera.com",
      "cbc.ca"
    ],
    "snippets": [
      "At least two areas of the worst-affected Sumatra island still unreachable, as authorities struggle to deliver aid.",
      "Some residents of the flood-hit Indonesian island of Sumatra have resorted to stealing food and water to survive, authorities said Sunday, while Sri Lankan officials said deaths from floods and mudslides in that island nation have risen to 193."
    ],
    "image_url": "",
    "titles": [
      "Indonesia floods death toll rises to 442 as people hunt for food and water",
      "Indonesian residents hunt for food and water after deadly floods; 193 dead in Sri Lanka"
    ],
    "url": "https://www.aljazeera.com/news/2025/11/30/indonesia-floods-death-toll-rises-to-442-as-people-hunt-for-food-and-water?traffic_source=rss",
    "alternate_urls": [
      "https://www.cbc.ca/news/world/death-tolls-rise-in-indonesia-sri-lanka-flooding-9.6997892?cmp=rss"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2025/11/30/indonesia-floods-death-toll-rises-to-442-as-people-hunt-for-food-and-water?traffic_source=rss",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.84,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.651,
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Floods on Indonesia's Sumatra island have left some areas unreachable, making aid delivery difficult. Authorities report that some residents have resorted to stealing food and water to survive. In Sri Lanka, floods and mudslides have killed at least 193 people, according to officials. Relief efforts continue in both countries.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords (2): effort, relief; semantic: pos_sim=0.00, neg_sim=0.13",
    "constructiveness_source": "heuristic",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "India plans new arms deal talks with Russia",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Sun, 30 Nov 2025 13:17:15 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "Bloomberg"
    ],
    "domains": [
      "news.google.com"
    ],
    "snippets": [
      "India to pitch new arms deal with Russia during Putin visit, Bloomberg News reports Reuters",
      "India Said to Pitch New Arms Deal With Russia During Putin Visit Bloomberg.com"
    ],
    "image_url": "",
    "titles": [
      "India to pitch new arms deal with Russia during Putin visit, Bloomberg News reports - Reuters",
      "India Said to Pitch New Arms Deal With Russia During Putin Visit - Bloomberg.com"
    ],
    "url": "https://news.google.com/rss/articles/CBMi2gFBVV95cUxNeE5sUy1nTWRYWkVaZ0pwQjhUNC1zV1phdVk4RGVpUXVmMEgyNldGWkhDMnlhejNuajJVR1lEOUUzNDVlRFdteC12anlyTXlCaVZlZDg2dU5BZE9FMUFvSnFGQTFHSm1BNVNuZjRFb2xjeXlUNVdkOEJUZE8tMFRSOGFRODhncUkwdDVzYnJHZlp5Wk9mMGRHZ0pRT3RmdmFOTGJUd0YxS1MtMGZJb01KR21LczJzdnQxdEROYmRDUHMwd0ljRnUyR1dpSGdhRXJHbnVVWnhDMnRSQQ?oc=5",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMitgFBVV95cUxPTmV1UVV1SUgtZ1BjaDJDQnB1RFQzN0pXMUQtalk3WWJyLTdhMTJaSnNFc3JhOEJuQy1QbTJiS20ycUdtVXVEOE9hcmt5OFJ5cDBsRERTdU5NNlQxS1B0cFVCSU9ObXh3MjRvLV9TTVFKTWRETjB5OEhWNHhTb3JKRXBNNm42QmFWTUZ4dXNmazllLTJFcGJSeElYUDQ2Vnk4Q1BOb3c5YlBCOGNNazl6NE8yMlUydw?oc=5"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMi2gFBVV95cUxNeE5sUy1nTWRYWkVaZ0pwQjhUNC1zV1phdVk4RGVpUXVmMEgyNldGWkhDMnlhejNuajJVR1lEOUUzNDVlRFdteC12anlyTXlCaVZlZDg2dU5BZE9FMUFvSnFGQTFHSm1BNVNuZjRFb2xjeXlUNVdkOEJUZE8tMFRSOGFRODhncUkwdDVzYnJHZlp5Wk9mMGRHZ0pRT3RmdmFOTGJUd0YxS1MtMGZJb01KR21LczJzdnQxdEROYmRDUHMwd0ljRnUyR1dpSGdhRXJHbnVVWnhDMnRSQQ?oc=5",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.827,
      "consensus": 0.571,
      "constructiveness": 0.05,
      "proximity": 0.5
    },
    "score": 0.638,
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "India is expected to propose a new arms deal with Russia during President Vladimir Putin's visit, according to Bloomberg and Reuters. The discussions aim to strengthen defense ties between the two countries. No details about the potential agreement or its value have been disclosed. The talks reflect ongoing military cooperation amid global tensions.",
    "constructiveness_score": 0.05,
    "constructiveness_reason": "semantic: pos_sim=0.20, neg_sim=0.00; semantic_boost=0.05",
    "constructiveness_source": "heuristic",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Scientists discover a hidden brain circuit that rewrites vision",
    "domain": "science",
    "source_domain": "sciencedaily.com",
    "location": "global",
    "published": "Sun, 30 Nov 2025 06:42:21 EST",
    "source": "ScienceDaily",
    "sources": [
      "ScienceDaily",
      "SciTechDaily"
    ],
    "domains": [
      "sciencedaily.com",
      "scitechdaily.com"
    ],
    "snippets": [
      "MIT scientists found that what we see is strongly influenced by how alert or active we are. Parts of the brain responsible for planning and control send specialized signals that either boost or quiet visual details. These areas seem to balance each other, sharpening important information while dimmi",
      "A powerful earthquake that struck Calama in 2024 defied long-held assumptions about how deep earthquakes behave. In July 2024, a 7.4-magnitude earthquake struck the city of Calama in northern Chile, damaging structures and cutting power across the area. Chile is no stranger to major seismic events,"
    ],
    "image_url": "",
    "titles": [
      "Scientists discover a hidden brain circuit that rewrites vision",
      "Scientists Discover a Hidden Mechanism That “Supercharges” Deep Earthquakes"
    ],
    "url": "https://www.sciencedaily.com/releases/2025/11/251130050715.htm",
    "alternate_urls": [
      "https://scitechdaily.com/scientists-discover-a-hidden-mechanism-that-supercharges-deep-earthquakes/"
    ],
    "location_scope": "global",
    "link": "https://www.sciencedaily.com/releases/2025/11/251130050715.htm",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.791,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.632,
    "summary_source": "skipped",
    "summary_reason": "skipped_due_to_budget",
    "headline_source": "",
    "summary": "",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Sri Lanka declares emergency as floods wreak havoc across Colombo",
    "domain": "science",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Sun, 30 Nov 2025 12:11:41 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Deutsche Welle"
    ],
    "domains": [
      "aljazeera.com",
      "dw.com"
    ],
    "snippets": [
      "More than 25,000 homes destroyed, 147,000 displaced, in Sri Lanka's deadliest flood since 2017, affecting Colombo.",
      "In Sri Lanka, rescue teams are racing to reach cut-off villages as floods and landslides caused by Cyclone Ditwah force tens of thousands of people into shelters, submerge homes, and block roads."
    ],
    "image_url": "",
    "titles": [
      "Sri Lanka declares emergency as floods wreak havoc across Colombo",
      "Sri Lanka declares emergency as floods kill more than 150"
    ],
    "url": "https://www.aljazeera.com/gallery/2025/11/30/sri-lanka-declares-emergency-as-floods-wreak-havoc-across-colombo?traffic_source=rss",
    "alternate_urls": [
      "https://www.dw.com/en/sri-lanka-declares-emergency-as-floods-kill-more-than-150/a-74952338?maca=en-rss-en-top-1022-rdf"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/gallery/2025/11/30/sri-lanka-declares-emergency-as-floods-wreak-havoc-across-colombo?traffic_source=rss",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.802,
      "consensus": 0.591,
      "constructiveness": 0.023,
      "proximity": 0.5
    },
    "score": 0.632,
    "summary_source": "skipped",
    "summary_reason": "skipped_due_to_budget",
    "headline_source": "",
    "summary": "",
    "constructiveness_score": 0.023,
    "constructiveness_reason": "semantic: pos_sim=0.09, neg_sim=0.00; semantic_boost=0.02; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Floods hit Sri Lanka's capital as cyclone deaths near 200",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Sun, 30 Nov 2025 07:07:13 EST",
    "source": "Phys.org",
    "sources": [
      "The Guardian",
      "Phys.org"
    ],
    "domains": [
      "theguardian.com",
      "phys.org"
    ],
    "snippets": [
      "Hundreds of people still missing after heavy rain and mudslides in country’s deadliest natural disaster for years Entire areas of Sri Lanka’s capital are flooded after a powerful cyclone triggered heavy rains and mudslides across the island, with authorities reporting nearly 200 dead and dozens more",
      "Entire areas of Sri Lanka's capital were flooded on Sunday after a powerful cyclone triggered heavy rains and mudslides across the island, with authorities reporting nearly 200 dead and dozens more missing."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/extreme-weather-in-sri.jpg",
    "titles": [
      "Sri Lanka’s capital hit by floods as cyclone death toll nears 200",
      "Floods hit Sri Lanka's capital as cyclone deaths near 200"
    ],
    "url": "https://phys.org/news/2025-11-sri-lanka-capital-cyclone-deaths.html",
    "alternate_urls": [
      "https://www.theguardian.com/world/2025/nov/30/sri-lanka-capital-colombo-hit-by-floods-as-cyclone-death-toll-rises"
    ],
    "location_scope": "global",
    "link": "https://phys.org/news/2025-11-sri-lanka-capital-cyclone-deaths.html",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.801,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.629,
    "summary_source": "skipped",
    "summary_reason": "skipped_due_to_budget",
    "headline_source": "",
    "summary": "",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Black Friday sets online spending record of $11.8B, Adobe says",
    "domain": "science",
    "source_domain": "techcrunch.com",
    "location": "global",
    "published": "Sat, 29 Nov 2025 21:39:44 +0000",
    "source": "TechCrunch",
    "sources": [
      "Reuters",
      "TechCrunch"
    ],
    "domains": [
      "news.google.com",
      "techcrunch.com"
    ],
    "snippets": [
      "AI helps drive record $11.8 billion in Black Friday online spending Reuters",
      "American consumers spent $11.8 billion online on Black Friday, according to data from Adobe Analytics, which says it tracks more than 1 trillion visits to U.S. retail websites."
    ],
    "image_url": "",
    "titles": [
      "AI helps drive record $11.8 billion in Black Friday online spending - Reuters",
      "Black Friday sets online spending record of $11.8B, Adobe says"
    ],
    "url": "https://techcrunch.com/2025/11/29/black-friday-sets-online-spending-record-of-11-8b-adobe-says/",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiwwFBVV95cUxQa2w0YUo5cGdad3BCYml5R2pIS25CNWwtVlNIMER3dGViMnpYTDIzdzlSTGpWMkJWT191TUNHQjZ0Mzh3em9fOE5waGp4UkxnekMtYXc2elFMMVZwOTdrTlI4REVDcVk3OTlGNXZwMHQ4eFpNaUFFTVhfdkFGT2JBYmZzTUxNN0lkOTJWYjBfOU40VlY1bjVob3B5UEpOTXJWR0RXeU5scE12MkxvN3FvMEtBaU9WdGxfT2FRTlhLLWtfaEk?oc=5"
    ],
    "location_scope": "global",
    "link": "https://techcrunch.com/2025/11/29/black-friday-sets-online-spending-record-of-11-8b-adobe-says/",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.536,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.549,
    "summary_source": "skipped",
    "summary_reason": "skipped_due_to_budget",
    "headline_source": "",
    "summary": "",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "The absolute best Cyber Monday deals you can already shop",
    "domain": "science",
    "source_domain": "theverge.com",
    "location": "global",
    "published": "2025-11-30T13:00:39-05:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "theverge.com"
    ],
    "snippets": [
      "Black Friday is over, but the deals haven’t simply evaporated. As we turn our attention to Cyber Monday, many of our favorite deals are still holding strong. That means you have another chance to save if you’ve been too preoccupied with holiday leftovers. Be forewarned, though: stock on certain item",
      "‘Tis the season to score some serious bargains on smart home gear. While Black Friday is behind us, Cyber Monday is coming up fast, so there is still time to grab a bargain on that smart lock you’ve been eyeing or take the plunge on a robot vacuum. Here I’ve rounded up the best deals […]",
      "If you’ve been waiting to upgrade your headphones or earbuds, your patience has been rewarded. Right now, models from Apple, Sony, Bose, Sonos, and other brands are down to their lowest prices to date, allowing you to save more than ever on both new and older releases. The AirPods Pro 3, for instanc",
      "If you’re planning to gift an Apple device this holiday season — or treat yourself — now’s the time to start shopping. Black Friday is bleeding into Cyber Monday — and these Apple deals are some of the best we’ve seen all year. Despite having recently launched, for instance, the new AirPods Pro, App"
    ],
    "image_url": "",
    "titles": [
      "The absolute best Cyber Monday deals you can already shop",
      "The best Cyber Monday deals on some of my favorite smart home gear",
      "Screaming Cyber Monday deals on Bose, Sony, and Apple headphones and earbuds",
      "The best Cyber Monday deals on Apple MacBooks, AirTags, iPads, and more"
    ],
    "url": "https://www.theverge.com/gadgets/833101/cyber-monday-best-early-deals-2025",
    "alternate_urls": [
      "https://www.theverge.com/gadgets/831719/best-black-friday-cyber-monday-smart-home-deals",
      "https://www.theverge.com/gadgets/831125/best-black-friday-headphone-earbud-deals-2025",
      "https://www.theverge.com/gadgets/827826/best-black-friday-apple-deals-sale-2025"
    ],
    "location_scope": "global",
    "link": "https://www.theverge.com/gadgets/833101/cyber-monday-best-early-deals-2025",
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.943,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.515,
    "summary_source": "skipped",
    "summary_reason": "skipped_due_to_budget",
    "headline_source": "",
    "summary": "",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "is_trending": true,
    "trending_score": 0.5
  }
]