[
  {
    "title": "Alysa Liu Wins Olympic Gold",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Fri, 20 Feb 2026 12:32:16 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "New York Times",
      "Associated Press",
      "Bleacher Report",
      "Sports Illustrated",
      "Reuters",
      "BBC Sport"
    ],
    "domains": [
      "espn.com",
      "nytimes.com",
      "news.google.com",
      "bbc.com"
    ],
    "snippets": [
      "Alysa Liu won Olympic gold on Thursday -- an unexpected fairy-tale ending to an up-and-down week for the U.S. figure skating team.",
      "Liu became the first American to win a medal in women’s figure skating since 2006.",
      "Alysa Liu dazzles to win figure skating gold, ending a 24-year Olympic drought for US women AP News",
      "'Over the Moon,' Alysa Liu Celebrates Historic Olympic Gold Medal in Figure Skating Bleacher Report",
      "Women’s Figure Skating Free Skate Results: Alysa Liu Wins Gold, Ending 20-Year Drought for U.S. Sports Illustrated",
      "Alysa Liu wins Olympic gold in Milan, ends U.S. women's medal drought Reuters",
      "American superstar Alysa Liu adds Olympic figure skating gold to her world title as she beats a standout field in the women's final.",
      "Alysa Liu ends USA's 24-year wait for a women's figure skating gold medal, as the reigning 20-year old world champion wins her first singles Olympic title at Milan-Cortina 2026."
    ],
    "image_url": "",
    "titles": [
      "How Alysa Liu became the unlikeliest Olympic figure skating champion",
      "Alysa Liu Wins Figure Skating Gold in Stunning Comeback",
      "Alysa Liu dazzles to win figure skating gold, ending a 24-year Olympic drought for US women - AP News",
      "'Over the Moon,' Alysa Liu Celebrates Historic Olympic Gold Medal in Figure Skating - Bleacher Report",
      "Women’s Figure Skating Free Skate Results: Alysa Liu Wins Gold, Ending 20-Year Drought for U.S. - Sports Illustrated",
      "Alysa Liu wins Olympic gold in Milan, ends U.S. women's medal drought - Reuters",
      "USA superstar Liu wins women's skating Olympic gold",
      "'Oh my word!' - USA's Liu wins women's figure skating gold"
    ],
    "url": "https://www.espn.com/olympics/story/_/id/47980819/2026-winter-olympics-alysa-liu-women-figure-skating",
    "alternate_urls": [
      "https://www.nytimes.com/2026/02/19/world/alysa-liu-skating-gold.html",
      "https://news.google.com/rss/articles/CBMipgFBVV95cUxQMGZzWDVqM1lDMU5qWWg5SFN4cDVOWkxSNVlPVXhMMkdYTE9IOTZ6MlJBX0NNdEdLVGJBWFY2eXBJUTV6NXJidjdZOXNabmxqUFRVMUl2UXZ0V09BUFhxRzlpZWlCOUt5ekl0Z0N1eDU0WV9PN0s4S2syNUlURzBKNURtNjFlZjY1RTNIMU9aMkJXSWZIa0twRENSSkFYaDdON0RZdjVn?oc=5",
      "https://news.google.com/rss/articles/CBMiugFBVV95cUxQWU43akpJazRwSWtiaWNya042NThnMGIwRzZzeXVJcmVmSnJ1eXd5X19icWVwUWFEZFFpVTVHZGQ4dVJkc1J0RkoxWWRPUHhTaXZsekdYaW9xdmpTM3RTN29FbTM5cWJjRnk1OEd4RUZIU2FyMjNPRWwxNjB1RGY5c0hEdTdDZkFDQlJaVkgxb0F5QmptclBDd1FjclI1bzJ5cG1RM1NtOWM5b2xta2RQZHBPU0NtYmN3T3c?oc=5",
      "https://news.google.com/rss/articles/CBMihwFBVV95cUxNbVRWT3VKOWc3a3A5MlpxaGo2Z2o0Zm1CZmlmeW9MZ0p1NUhxNXlfa3d5Rzdzai1KVHBYOUJDaTJBejdZblJybXFadGYweHkzbU5jczRjZzhWZmtWcUh3V0RYcU00V1d1RUlMT3Y1YmR0NjFQTWVpWHQ0ZFNwSzBoSXNlWUpGdEE?oc=5",
      "https://news.google.com/rss/articles/CBMioAFBVV95cUxPa1RLZkNOTjlrZGlaSHB6cTQydEVDdlJKRFEyQTNkTVZGM1dkelI5TV9hSWNvRG9MVzZPdDdBNDJ4Z1NkUzBmMklERC05bUxsMU8wbHZfLTF6MzdhRWs0S0ctSXNUWWtiOVlwRDhDdjBrOThFdXJVRXl5eGNidWo1ZGE3Y1A5c2FqOXNWenpLYUUwMmNydTcxQnpIMUs5T05X?oc=5",
      "https://www.bbc.com/sport/articles/c33jz026mg3o?at_medium=RSS&at_campaign=rss",
      "https://www.bbc.com/sport/videos/cn0z50e5vr2o?at_medium=RSS&at_campaign=rss"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/olympics/story/_/id/47980819/2026-winter-olympics-alysa-liu-women-figure-skating",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.89,
      "consensus": 1.0,
      "constructiveness": 0.8,
      "proximity": 0.75
    },
    "score": 0.922,
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides a deeper understanding of Alysa Liu's journey to becoming an Olympic champion, which can be inspiring and empowering for readers. However, it doesn't necessarily provide actionable insights or report on solutions to broader societal issues.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Alysa Liu won the women's figure skating gold medal at the Milan-Cortina 2026 Olympics, becoming the first American to win a medal in the event since 2006. Her victory ended a 24-year U.S. gold medal drought in women's figure skating.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Supreme Court Blocks Trumps Tariffs",
    "domain": "politics",
    "source_domain": "cnbc.com",
    "location": "national",
    "published": "Fri, 20 Feb 2026 19:39:28 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Financial Times",
      "The Guardian",
      "Forbes",
      "Financial Post"
    ],
    "domains": [
      "cnbc.com",
      "ft.com",
      "theguardian.com",
      "forbes.com",
      "financialpost.com",
      "news.google.com"
    ],
    "snippets": [
      "President Donald Trump spoke hours after the Supreme Court ruled against his global tariffs that he imposed without Congress.",
      "Top court issues historic rebuke of US president’s use of emergency powers to impose duties on trading partners",
      "US president declares a global tariff after saying ‘other alternatives will now be used to replace the ones that the court incorrectly rejected’ Trump’s tariffs are illegal, supreme court rules According to reporters at the supreme court, one box of opinions has been brought out. Typically, this mea",
      "US president vows to enact 10% global baseline tariff after calling the supreme court justices ‘a disgrace to the nation’ US politics live – latest updates The US supreme court declared many of Donald Trump ’s tariffs illegal on Friday, in a sharp rebuke that topples a key pillar of the president’s",
      "Trump said the ruling was “deeply disappointing” and called the justices who struck down his policy a “disgrace.”",
      "President Donald Trump said he would sign an order imposing a 10% global tariff after the Supreme Court struck down the bulk of the levies he imposed last year, and pledged a raft of investigations that could allow him to enact more import taxes.",
      "Trump announces new 10% global tariff after raging over Supreme Court loss CNBC"
    ],
    "image_url": "",
    "titles": [
      "Trump announces new 10% global tariff after raging over Supreme Court loss",
      "Trump vows to impose 10% global tariff after Supreme Court rules sweeping duties are illegal",
      "Trump to impose 10% global tariff and attacks ‘certain’ supreme court justices after levies ruled illegal – live",
      "Trump illegally used executive power to impose global tariffs, supreme court rules",
      "Trump Imposes New 10% Global Tariff After Supreme Court Kills His ‘Liberation Day’ Levies",
      "Trump to Impose 10% Global Tariff After Supreme Court Defeat",
      "Trump announces new 10% global tariff after raging over Supreme Court loss - CNBC"
    ],
    "url": "https://www.cnbc.com/2026/02/20/trump-global-trade-tariff-supreme-court.html",
    "alternate_urls": [
      "https://www.ft.com/content/d00d0663-8716-4323-bda3-2cbfb5b30285",
      "https://www.theguardian.com/us-news/live/2026/feb/20/us-iran-nuclear-deal-trump-agreement-strikes-latest-news-live-updates",
      "https://www.theguardian.com/us-news/2026/feb/20/trump-supreme-court-tariffs-ruling",
      "https://www.forbes.com/sites/saradorn/2026/02/20/trump-says-hes-ashamed-of-supreme-court-justices-who-overturned-his-tariffs/",
      "https://financialpost.com/pmn/business-pmn/trump-to-impose-10-global-tariff-after-supreme-court-defeat",
      "https://news.google.com/rss/articles/CBMiggFBVV95cUxNeGZpQjhFOE1PeWVFOTdYY3hCQzN3LUxwWDZpR2pMMWE0aGZpd0QzZi1NVTdLOXl1UjN2R29LNUxYbURySEpydVhBWHplUkF2ZmNWTWI5WGxPYnFHRklPbmhBTDNEOVdKdnplVVNvdnpVNWMxYVYxOGo4QXRUV0l5bEV30gGHAUFVX3lxTE5ySnJGS2FxWEwxWTBWaE14b0RkNmZfTEVjTVM3NHZJWFJQSGFCdHdnM0VVRWo5clJwc2dQU0M2c3NjUG1kbkdUOVlXUVhCUVp5MlotVzZLT3pMOGh3UFIxMk5nU242LVctelFsQmZ2R0Y3RnpEZUM0d2wtZExwRUtCU3RZMk1GYw?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.cnbc.com/2026/02/20/trump-global-trade-tariff-supreme-court.html",
    "score_components": {
      "magnitude": 0.984,
      "recency": 0.943,
      "consensus": 1.0,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.878,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about a new global tariff and its political context. However, it does not provide in-depth understanding or actionable insights for the reader.",
    "constructiveness_source": "gpt",
    "summary_source": "snippet",
    "summary_reason": "invalid_roles",
    "headline_source": "gpt",
    "summary": "President Donald Trump spoke hours after the Supreme Court ruled against his global tariffs that he imposed without Congress.",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "Supreme Court Strikes Down Trumps Global Tariffs in 6 3 Ruling",
    "domain": "politics",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Fri, 20 Feb 2026 16:59:42 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "NPR",
      "ABC News",
      "Al Jazeera",
      "Reuters",
      "Financial Times",
      "The Guardian",
      "Bloomberg",
      "Forbes",
      "MarketWatch",
      "Business Insider",
      "Globe and Mail",
      "CNBC",
      "Associated Press"
    ],
    "domains": [
      "news.google.com",
      "npr.org",
      "abcnews.com",
      "aljazeera.com",
      "ft.com",
      "theguardian.com",
      "forbes.com",
      "marketwatch.com",
      "businessinsider.com",
      "cnbc.com"
    ],
    "snippets": [
      "Supreme Court says Trump global tariffs are illegal Axios",
      "Trump's tariffs near their fate before the Supreme Court Axios",
      "Business groups applaud Supreme Court ruling on Trump tariffs Axios",
      "The Supreme Court ruled Friday that President Trump overstepped his authority in ordering double-digit tariffs on nearly everything the U.S. imports. Here's some of the economic context to understand that decision.",
      "The 6-3 ruling is a major blow to the president's signature economic policy.",
      "SCOTUS has invalidated most of President Donald Trump's tariffs, a cornerstone of his economic policy in his second term. ABC News' Mary Bruce reports.",
      "President Donald Trump suggested he doesn’t plan to refund tariff fees already collected by the US government.",
      "Top US court says Trump did not have authority to enact tariffs under law meant for national emergencies.",
      "The decision is a significant loss to US President Trump on an issue that has been critical for his economic agenda.",
      "US Supreme Court ruling overturning Trump tariffs could spook bond vigilantes Reuters",
      "US Supreme Court strikes down Trump's global tariffs Reuters",
      "VIEW Stocks jump after US Supreme Court rejects Trump's tariffs Reuters",
      "Wall St rises after landmark US Supreme Court ruling against Trump's tariffs Reuters",
      "The US president has alternatives he can use to escalate his trade wars",
      "It turns out that even conservative justices will only accept so many assaults on legal and constitutional norms",
      "President called justices who blocked his tariffs a ‘disgrace to the nation’ while praising three justices who dissented US politics live – latest updates Donald Trump on Friday railed against the supreme court justices who blocked his use of tariffs, calling the decision a “disgrace to the nation”",
      "Trump’s Global Tariffs Struck Down by US Supreme Court Bloomberg",
      "US Treasuries Fall After Supreme Court Scraps Trump’s Tariffs Bloomberg",
      "US Supreme Court Strikes Down Trump Tariffs, Wall Street React Bloomberg",
      "The three major indexes all rose shortly after the decision.",
      "The U.S. Supreme Court said President Trump exceeded his authority in using a 1977 law to justify a large swath of his tariffs, but that does not mean he’s now unable to slap tariffs on other countries’ products.",
      "The Supreme Court fast-tracked a case over whether President Donald Trump's \"Liberation Day\" tariffs.",
      "U.S. Supreme Court rules against Trump’s use of emergency powers to impose tariffs The Globe and Mail",
      "Video: U.S. Supreme Court rejects Trump's global tariffs The Globe and Mail",
      "European stocks close higher after U.S. Supreme Court strikes down Trump's tariffs CNBC",
      "President Trump claimed the justices opposing his position were acting because of partisanship, though three of those ruling against his tariffs were appointed by Republican presidents.",
      "Trump laid out alternative ways to impose his tariffs after the Supreme Court struck down most of the levies as illegal, a decision he called \"deeply disappointing.\"",
      "US President Trump called several Supreme Court justices a “disgrace” after they struck down tariffs he issued in 2025.",
      "The US Supreme Court has struck down Donald Trump’s imposition of sweeping global tariffs.",
      "Supreme Court Justice Brett Kavanaugh, in his dissent, warned that \"the refund process\" for tariffs \"is likely to be a 'mess,'\" citing oral arguments",
      "Exclusive: Supreme Court tariff ruling makes over $175 billion in US revenue subject to refunds, Penn-Wharton estimates Reuters",
      "Costco, Revlon, J. Crew, Dole, Reebok and more have filed lawsuits in hopes of getting their money back.",
      "President Donald Trump's tariff agenda took a blow Friday, prompting celebration from Democrats who have opposed his unilateral tariffs.",
      "President Donald Trump's tariffs have forced some e-commerce companies to raise prices and alter their supply chains.",
      "How will companies get refunds now that the US Supreme Court has rejected Trump's tariffs? Reuters",
      "The Supreme Court’s decision striking down most of President Donald Trump’s tariffs left at least one big question unanswered: What about refunds?",
      "Supreme Court strikes down Trump’s sweeping tariffs, upending central plank of his economic agenda AP News",
      "Supreme Court strikes down Trump tariffs, rebuking president's signature economic policy CNBC",
      "Several Republicans lauded the Supreme Court for upholding the separation of powers between the executive and legislative branches.",
      "10-year Treasury yields rises after high court rebukes Trump's tariffs CNBC"
    ],
    "image_url": "",
    "titles": [
      "Supreme Court says Trump global tariffs are illegal - Axios",
      "Trump's tariffs near their fate before the Supreme Court - Axios",
      "Business groups applaud Supreme Court ruling on Trump tariffs - Axios",
      "7 key things to know about Trump's tariffs after the Supreme Court decision",
      "Supreme Court strikes down Trump's tariffs",
      "WATCH:  Supreme Court invalidates most of Trump's tariffs in major ruling",
      "Trump suggests he won’t refund tariffs after Supreme Court ruling",
      "Trump tariffs live: US president slams Supreme Court, vows more tariffs",
      "In major blow to Trump, US Supreme Court strikes down his global tariffs",
      "US Supreme Court ruling overturning Trump tariffs could spook bond vigilantes - Reuters",
      "US Supreme Court strikes down Trump's global tariffs - Reuters",
      "VIEW Stocks jump after US Supreme Court rejects Trump's tariffs - Reuters",
      "Wall St rises after landmark US Supreme Court ruling against Trump's tariffs - Reuters",
      "What does the Supreme Court ruling against Trump’s tariffs mean?",
      "The Supreme Court has delivered an overdue rebuke to Donald Trump on tariffs",
      "Trump threatens 10% global tariffs and rails against supreme court justices",
      "Trump’s Global Tariffs Struck Down by US Supreme Court - Bloomberg",
      "US Treasuries Fall After Supreme Court Scraps Trump’s Tariffs - Bloomberg",
      "US Supreme Court Strikes Down Trump Tariffs, Wall Street React - Bloomberg",
      "Markets Rise After Supreme Court Strikes Down Tariffs",
      "Supreme Court rejects Trump’s tariffs. The president is already rolling out new ones.",
      "Supreme Court strikes down swath of Trump's tariffs",
      "U.S. Supreme Court rules against Trump’s use of emergency powers to impose tariffs - The Globe and Mail",
      "Video: U.S. Supreme Court rejects Trump's global tariffs - The Globe and Mail",
      "European stocks close higher after U.S. Supreme Court strikes down Trump's tariffs - CNBC",
      "Trump calls SCOTUS tariffs decision 'deeply disappointing' and lays out path forward",
      "Trump outlines new plan for tariffs after 'deeply disappointing' Supreme Court ruling",
      "Trump: Supreme Court’s rejection of tariffs ‘deeply disappointing’",
      "Why did the US Supreme Court strike down Trump’s global tariff policy?",
      "Supreme Court Trump tariffs ruling could put U.S. on hook for $175 billion in refunds, estimate says",
      "Exclusive: Supreme Court tariff ruling makes over $175 billion in US revenue subject to refunds, Penn-Wharton estimates - Reuters",
      "These Companies Are Already In Court For Possible Refunds From Trump’s $175 Billion In Tariffs",
      "Democrats rejoice in Supreme Court rebuke of Trump tariffs they have called illegal",
      "Amazon, Etsy, other e-commerce stocks pop after Supreme Court rules against Trump's tariffs",
      "How will companies get refunds now that the US Supreme Court has rejected Trump's tariffs? - Reuters",
      "Will American companies get tariff refunds after the Supreme Court decision? What we know so far.",
      "Supreme Court strikes down Trump’s sweeping tariffs, upending central plank of his economic agenda - AP News",
      "Supreme Court strikes down Trump tariffs, rebuking president's signature economic policy - CNBC",
      "These Republicans Break With Trump In Praising Supreme Court Ruling Striking Down His Tariffs",
      "10-year Treasury yields rises after high court rebukes Trump's tariffs - CNBC"
    ],
    "url": "https://news.google.com/rss/articles/CBMid0FVX3lxTE11clJ4WG9YMmhYWTRPRFlxNmRhcnd1cklHTDlnQzVwS2VZLWdlSm9fS3pGR2ZMcnFFbGJfNmxvalZYYXQ2SlYwTmpJV3N6QkE2WGd0MDVGbkExYW1xd1A4WnFkNHFwcmhwMFFtV3ByTlBLcm44OGM0?oc=5",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMidkFVX3lxTE1DQ0p6NW1NdlJXajRFVVotcTRvOWJ1a3BOQUxjUXBhSkl2elF2NXZiNFF0XzdlWFg2Y3RpLUkwazVVdGtDSzhUM0hBWDhxVDJvRWg4TDR4YlpUQm42YUhmV0tNUTZFaDVBWUVtcHc1WXpBRGNIZHc?oc=5",
      "https://news.google.com/rss/articles/CBMiggFBVV95cUxNSm90MUZmbzZSODFYdV9MTG1fekl4eDBtQ085aVZZbWF0TnhCcnYyUVY3RVctQmpLc3JBTWlUVTg5VGF5RFpYZ1ZKTHE5b3R3c0djMTFsZnFfc1pvZElhMnNqY2ExRnVVNFFFRUtaWEgzWE9Za3cyOFJTOUctVWdXMFB3?oc=5",
      "https://www.npr.org/2026/02/20/nx-s1-5677609/tariffs-economy-trump-supreme-court",
      "https://www.npr.org/2026/02/20/nx-s1-5672383/supreme-court-tariffs",
      "https://abcnews.com/Politics/video/supreme-court-invalidates-trumps-tariffs-major-ruling-130339479",
      "https://www.aljazeera.com/video/newsfeed/2026/2/20/trump-suggests-he-wont-refund-tariffs-after-supreme-court-ruling?traffic_source=rss",
      "https://www.aljazeera.com/news/liveblog/2026/2/20/trump-tariffs-live-us-supreme-court-rules-against-sweeping-global-tariffs?traffic_source=rss",
      "https://www.aljazeera.com/news/2026/2/20/us-supreme-court-strikes-down-trumps-global-tariffs?traffic_source=rss",
      "https://news.google.com/rss/articles/CBMivAFBVV95cUxOMXVwS3pUcjdrSjg0N1hlNDM1cWxLejBaQU1DWFY1QnloM0tnZExRVnJ3T05ZVzlGUFZ6cFVJcVFiVDJUclIxdTFxcHF0Y29tWllDeVV3Mzh1ODluNmtOcGpXZXEtV0dtQU5MRkd3M0RRT3Y5b2xNWTI0ekpoeThONlMtc01JVk1KQlNQQTZRSG5ESjBmSkNCbUlGTUoxaHBnQUpxRFg1emtseVo4WHoyRDNoanFiRlg4RTdWRw?oc=5",
      "https://news.google.com/rss/articles/CBMioAFBVV95cUxOeWFtcjJKM1FoR2pkVldFNncwblBySWNKWGxLdDU3blVuUWJ5eDhvSVgxUVBIX1NxNXVtdVJZRXdYUU1zUlNwQVo5MGloXzhveGw1WnpIY1FsNlRWX053cHRuY2NoSU1mXzNmNm1WczVjWDBMUDduVHZkUndtOE01YlJ0UlhjdU82Z1RDZWVUYk5PVEhucS13SDE3a3hPa1NX?oc=5",
      "https://news.google.com/rss/articles/CBMiqwFBVV95cUxPbWI1bm1fQUZqWDE3S1lPNU5xanR0aUZiWEgtUEVmRlVxdGVrc0hFMGxTUlBmdXZMQ0VNZk00RVlWU1NUVFBWY0gxR1dDVmZRb2xzWG5UYWU2UjhadTVVbG84YXlqcU9EeW8tbnRlZUJ4eERhRUxkLXJacjFwejB5ekdnODFyR3lXZmN1MXVjRFVSYjZnaklDRGxoWnYwQkpXQ2lJdHhiTk9lZHM?oc=5",
      "https://news.google.com/rss/articles/CBMikAFBVV95cUxOZnJCV3UxUW1ORUVxWnpFampuaXhUYk5jMFdmbHZUNmhmNTU2ajFtVzAzREdjSGI5WTYxRGhaTnZVRmN6dUFGT3JxbEpia0gxdXdPVXpwNXFnMVVXRUt6c2hVOVZ5VnJnU29Xc1U1aWtDQV9UendyMUlMLU44RHdhNHNZX0hfZ3VxLWpGaXFZUFM?oc=5",
      "https://www.ft.com/content/4d97c617-50ec-4152-9d5f-15688279ef90",
      "https://www.ft.com/content/26c4bc44-35d0-4946-bc66-13777c9aef7e",
      "https://www.theguardian.com/us-news/2026/feb/20/trump-tariff-scotus-response",
      "https://news.google.com/rss/articles/CBMiqAFBVV95cUxPRjh4OVpHX2pYWU5uVlRET0d1d1RoM2pBQ0JUNXhjQW5NUFNTMnkwaG9weEhSbEc1STVORG92cUk1MTZZUzdldDNtNzdMYl9pMndELV9WNW95M29PMWJQZUZXNWRqbXMxb2ZneUdVXzNVOGNWa3A2TnhydVlCSDFNSUZwbnNkNzJTek9uMlJEanlGSFljOUhJWEMyWk40RWJvS19BN1BRUG4?oc=5",
      "https://news.google.com/rss/articles/CBMisgFBVV95cUxOeGxEMmZlQVhOUUdnWm1mVDRDV1Rza19CNUQ3WGp4QWsxaUF0SUUtWVM5LWFXYkZ4VC12VkhjZWVnTWZLVGZWMG45SHpVdzR2OWw1c2ZwRzV6LUwwMHB0OVgxNXdudjdVdjZSc1FQMmRfWmJRWURqZVA1cm5KdWk0TWxQSmlSVVJTZkt2SDZhY1NNRFpLeUd3ZHUydnVHN2dNbURKZHF6ci1DQXNwMTZ6TzBR?oc=5",
      "https://news.google.com/rss/articles/CBMiswFBVV95cUxNRzZVUnFoaUVwYldicVdGWlhjQ2VpaWVQWHlmdi0ycDltOEh0cjFPQ1ZXRVNGMml2anJoSEdET3hFYUJKQkppUDh0S2FXdDFTYzZWVXhCRHJzR0psb0paUFpObUx1bnZhb1NSSXhtUS1YN2VvcC1ISzkwRE4tV1VQa1FRaFlERks3RFlUTmZnSGVZb3JWVVVvLXNWNDNxSUZCS0pQSk8wSTJLX0NkaFJQTDRWQQ?oc=5",
      "https://www.forbes.com/sites/martinadilicosa/2026/02/20/markets-rise-after-supreme-court-strikes-down-tariffs/",
      "https://www.marketwatch.com/story/supreme-court-rejects-trumps-tariffs-heres-what-the-president-could-try-to-use-instead-c09ec3fa?mod=mw_rss_topstories",
      "https://www.businessinsider.com/supreme-court-scotus-rules-trump-tariffs-2026-1",
      "https://news.google.com/rss/articles/CBMitAFBVV95cUxOWmJ5dXh4X3RaWTlBbHpHbzJwSjkwQzNlRlQ0VC1vSUhYYkM4Vl94R1dzWjVoMV82elVvam10NXVBY0VGc3F6MlhuRU1kYURGVExXMzZEWlA5S3NnYi1ZNXpRWFJIOEZUalFhVjg2Y3dpeHpUQUMtR1lNcnRIQU5lcXV3Smc4a1dzaXJHUXFpSkJCRGtpU2w2MzFyMW5oQ3N3TGd3X2NiRUdPdEJlY2pGanA1Mmc?oc=5",
      "https://news.google.com/rss/articles/CBMilgFBVV95cUxOMkJ3eHNHSVVRLTE2b3BMR2prMG5mdXM1U3phdXhJLTZQZkZIbUw4N2ZQTEpyY1N4Rk1VMXg0bE9GNXNpNy1sS2hwTmJvZXNNbmxwcllMSHJXRXFPQzZwSVJxeXBMOC1FR01yYjQzaWo5RjJCQ1p2Mk5tQXVXbmt5aElGNlkxdGNyQ08yVVBkVUV3eDVaU2c?oc=5",
      "https://news.google.com/rss/articles/CBMijAFBVV95cUxPNUdha0tXTjN5MGM0Uld6b29Ydjg0WTQzVElUUW44UmxrLVBBaXBJWXVyWnFlQ0toZFV0MzJiV29hX0M4RUd1b1RSalR6clM2VGU5eVNvNUt3aW1hMzhRbFQ2ZnMxYlMwajV4ZWZZQXpVMGV6bzRjVjd0M2tRdDV5OW5tVmtYTXlZeUNfedIBkgFBVV95cUxOQ2ZBYThXa05tYXNsTmtPb2dmLWcxMzlLa1hlNW9lTUhQV2JaMDdSZHJhbnVubWgyczlNUkhqbE9YMERpSUhVQm5TYUJmc0dQdjVLZWtXWGhGZGZaRnhVUEliRWVZV1kxb2taUXNmMUo3NFpxaTg1bXZkdVJFcGVVa3pCeXJ6dVNLQTd0Y2Q4bmxjZw?oc=5",
      "https://www.npr.org/2026/02/20/nx-s1-5720826/trump-calls-scotus-tariffs-decision-deeply-disappointing-and-lays-out-path-forward",
      "https://abcnews.com/Politics/trump-outlines-new-plan-tariffs-after-deeply-disappointing/story?id=130338220",
      "https://www.aljazeera.com/video/newsfeed/2026/2/20/trump-supreme-courts-rejection-of-tariffs-deeply?traffic_source=rss",
      "https://www.aljazeera.com/video/newsfeed/2026/2/20/why-did-the-us-supreme-court-strike-down-trumps-global-tariff-policy?traffic_source=rss",
      "https://www.cnbc.com/2026/02/20/supreme-court-trump-tariffs-us-refunds.html",
      "https://news.google.com/rss/articles/CBMitgFBVV95cUxQT2NZaTJYUkpYT1JJcjJUcXhjNFoyTEV6M3QzQk1nellOUHlFNlZFU2FTcTBITlJqYThDSVJUMTA2aFgxeWJoOUliRHktNTRXRFR3YUpPa19LOGs4aDhMNVVnQjNqTHZaVnRMd2c3T2luZUFTdjJzd1FpZXJKcVY5R3hqSFJJeFZMZ2l0Y19xTVlSeU1YZmtvUDhURE1UcUxGYm5DMExZU3lFczdMT3QtS3J2OTk1dw?oc=5",
      "https://www.forbes.com/sites/alisondurkee/2026/01/08/supreme-court-could-rule-on-tariffs-tomorrow-these-companies-are-already-in-court-for-possible-refunds/",
      "https://www.cnbc.com/2026/02/20/congress-scotus-trump-tariffs.html",
      "https://www.cnbc.com/2026/02/20/supreme-court-decision-amazon-etsy-stocks-tariffs-trump.html",
      "https://news.google.com/rss/articles/CBMi5wFBVV95cUxOSW56dWFueU1ldmxZZkVoaW9oaEk0dndYcnBtTThONWVQcnB0bkxJekdfaGdLT2h6eW1RazhFU3NORkxROTBQcndQeTRpTm1ZdmJSTDlHQ3BoUGRtczQtZ2xlQ1JyRU8tWk41ZE1RSTV5QUpWbUhWSlZLaDhPZU1ST3kzQ3hiRm5fdllLZENIMGdrUGQ3YmRMTXdBaHFybHhWcGtqTkNhakhWaGdtUHpUaWxoQ0owWWJaZWFZSF82VjVpME9obWJIcDlZbFFBMk1PNVQ4bDdTRjR2amlydHFxLVA3X3ljVHc?oc=5",
      "https://www.marketwatch.com/story/will-the-u-s-give-tariff-refunds-after-the-supreme-court-decision-what-we-know-so-far-5d1bf6fb?mod=mw_rss_topstories",
      "https://news.google.com/rss/articles/CBMikAFBVV95cUxQaW96b3hPVVRVV05IZWNBWUFHN0VrQThsc19kMXE5NU50VUVqeVF5QkVzTUhMWmpfc2NSUGJBemJQV3pUNC0xbS1xRjdFZVZzWE41M1RNVWRhN0hTZnU5RzdKUkdTSVp5NzhlenQtaVc2RFNFbGgxdWd1UHZmZ21XN1RDdEF5aHVZdjdySVJWREk?oc=5",
      "https://news.google.com/rss/articles/CBMie0FVX3lxTFBGQlZtT1ZoNC1qcnhBZ2p4RGxVaDFjLUZXX2ZJZFVHLVpwcm1aQ19XYVp6ZENOT3Y0R0VYY2lwUG5SVWgwb0pQMXpENWpaQnNDMmFId1Nha1MtaXBkYkV4a2dENnJ2bngyUld1SFNTcHZnd0pCSjdhSkUxUdIBgAFBVV95cUxQLU9IWEUwcFlBbEJVSnNucmJLTWxrbFRNQmZCU1huZVlfQnU5TW00NUdRWW5USmhlV0JRa2syZW9kaEZJTVEyNnB2WnB3MXlNb3hQLTJzVFA4YnRERDdnaFMwdlVPN3JyYmZ2bWRNY00xUzluUHJMa1cwNDJYa3Y1Nw?oc=5",
      "https://www.forbes.com/sites/saradorn/2026/02/20/these-republicans-break-with-trump-in-praising-supreme-court-ruling-striking-down-his-tariffs/",
      "https://news.google.com/rss/articles/CBMiigFBVV95cUxNNDR0ODBzUzdrS0xZRmQ4Z2hNQ2lERnRvZXVSd0lSYWE4eDh5NGJlUnUza2RDN2ZnTW5ka0tyYzlQZ1VVQkc0NHlDdVNqZkYtLUZwak1DcFhYMVhTcEgwY04zeng0QTVEZVYxdFlCZzM1NkhZMDM4eE5zNWdkVHpIYkRyelM2RTZicmfSAY8BQVVfeXFMUHpBR1NJVzdHVFBfMFVaQl95SW9kaE9ZUk1VT013VjZTV0NJVG5XeTJRbXR0b3BfSVJibThZWWIzUy0yYXI5QkRjay13VnRtd1RYUkVSa05kTlc5bklZeW5JWmhFVU9FeHFNOEVxR2laZzV5dW9weG4tb3E3UWpfUUt2c0d2SEp5MF9LenljZDQ?oc=5"
    ],
    "location_scope": "national",
    "link": "https://news.google.com/rss/articles/CBMid0FVX3lxTE11clJ4WG9YMmhYWTRPRFlxNmRhcnd1cklHTDlnQzVwS2VZLWdlSm9fS3pGR2ZMcnFFbGJfNmxvalZYYXQ2SlYwTmpJV3N6QkE2WGd0MDVGbkExYW1xd1A4WnFkNHFwcmhwMFFtV3ByTlBLcm44OGM0?oc=5",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.876,
      "consensus": 1.0,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.873,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs about a significant legal decision and its implications for global tariffs. However, it does not report on solutions or improvements, or provide a clear sense of agency for the reader.",
    "constructiveness_source": "gpt",
    "summary_source": "snippet",
    "summary_reason": "invalid_roles",
    "headline_source": "gpt",
    "summary": "Supreme Court says Trump global tariffs are illegal Axios",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "Canada Reaches Mens Curling and Hockey Finals",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Fri, 20 Feb 2026 14:42:20 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Global News",
      "Globe and Mail",
      "Sportsnet"
    ],
    "domains": [
      "espn.com",
      "globalnews.ca",
      "news.google.com",
      "sportsnet.ca"
    ],
    "snippets": [
      "Nathan MacKinnon scored the go-ahead goal with 35.2 seconds left after Shea Theodore tied it midway through the third period, and Canada survived another scare at the Olympics, rallying to beat Finland 3-2 and advance to the men's gold medal game.",
      "Team USA gets its third Olympic gold in women's ice hockey. Here are the goals and top moments.",
      "Canada now awaits the winner of the United States and Slovakia semifinal game set for late Friday at Milano Santagiulia Ice Hockey Arena.",
      "Jacobs leads Canada into men’s curling gold medal game The Globe and Mail",
      "Brad Jacobs had a masterful performance on Thursday to send Canada to the men’s gold-medal match in curling for the first time since 2014.",
      "U.S. captain Knight more nervous about proposal than gold medal game The Globe and Mail"
    ],
    "image_url": "",
    "titles": [
      "MacKinnon sends Canada to gold medal game",
      "Top moments: United States wins gold medal game over Canada in overtime",
      "Canada beats Finland to advance to men’s gold medal hockey game",
      "Jacobs leads Canada into men’s curling gold medal game - The Globe and Mail",
      "Olympic curling takeaways: Jacobs’ mistake-free plan sends Canada to gold-medal game",
      "U.S. captain Knight more nervous about proposal than gold medal game - The Globe and Mail"
    ],
    "url": "https://www.espn.com/olympics/story/_/id/47988010/mackinnon-late-goal-sends-canada-olympic-gold-medal-game",
    "alternate_urls": [
      "https://www.espn.com/olympics/story/_/id/47976418/2026-milan-cortina-winter-olympics-live-updates-women-hockey-usa-canada-gold-medal",
      "https://globalnews.ca/news/11676036/canada-finland-semi-finals/",
      "https://news.google.com/rss/articles/CBMikAFBVV95cUxNV0Jpa0pSUmIxdjJPaTgyX1hBZVlScjZXTFgyb1NHLVR6TnBKZ3Y5REJZSGJJcWw1M2JPbXgzY0k2b2JieXYzal9UZGM3bkUyZVZPczU3cHlndmtQbi03UHRPVzFIRk5RTnpvanZ0QlgyU3EzSmpBNHhLU0YwOUJ4eVhLb2V0WEpoOXhMcTJaRlU?oc=5",
      "https://news.google.com/rss/articles/CBMivgFBVV95cUxQaTVzaEI5MHlvVUMtTmFQX1VuaVBBMWxiQmpnQ1g0OS11V2NPOTB5S1ZoMHRQN1NiMUR0OHZxcUJuY3BQc2t5U2M1aWU0MVhzMEFaSnJaOVpodll5RU1UR245NF9FOHNQcWhCaDRZNlRoNnlfN3F5REtDcnVWQ3o4WW9Sa2FPUFhrVzRKSFc1TzMxTXl0Y3MzbUJpWGYxSEw3RHQ1ZXE5Z3FXajdlMmlLekJmbEg4U2xlNEFlWmdR?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/olympics/story/_/id/47988010/mackinnon-late-goal-sends-canada-olympic-gold-medal-game",
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.945,
      "consensus": 0.908,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.838,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "While this story provides basic awareness of a sporting event, it doesn't provide deeper insights, report on solutions or improvements, or increase clarity around systems, causes, or impacts that matter. Its value is mainly in providing a quick update on a specific event.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Brad Jacobs led Canada to the men's curling gold medal game for the first time since 2014 after a strong performance. In men's ice hockey, Canada defeated Finland 3-2 to reach the gold medal game. In women's ice hockey, Team USA won its third Olympic gold medal.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Trump Considers Limited Strike on Iran",
    "domain": "business",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Fri, 20 Feb 2026 19:13:58 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "CNBC",
      "Reuters",
      "Al Arabiya",
      "Forbes",
      "Financial Times"
    ],
    "domains": [
      "aljazeera.com",
      "cnbc.com",
      "news.google.com",
      "forbes.com",
      "ft.com"
    ],
    "snippets": [
      "US President Trump says he is “considering” limited strikes on Iran as negotiations continue over its nuclear program.",
      "The oil market's biggest fear is that a conflict between the U.S. and Iran could lead to a prolonged disruption of oil flows through the Strait of Hormuz.",
      "U.S. President Donald Trump has given Iran \"10 to 15\" days to make a meaningful deal over its nuclear program — or “really bad things” will happen.",
      "Trump says he is considering limited military strike on Iran Reuters",
      "Trump says he is considering a limited military strike on Iran Al Arabiya English",
      "The U.S. has amassed a significant military buildup in the Middle East as it prepares for a possible attack on Iran.",
      "Oil prices edge lower as Trump considers limited military strike against Iran CNBC",
      "Abbas Araghchi’s comments come as Trump says he is considering limited strikes to pressure Tehran into agreement"
    ],
    "image_url": "",
    "titles": [
      "Trump ‘considering’ limited strikes on Iran",
      "Trump says he's considering limited military strike against Iran",
      "Oil prices stable as Trump considers limited military strike against Iran",
      "Trump says he is considering limited military strike on Iran - Reuters",
      "Trump says he is considering a limited military strike on Iran - Al Arabiya English",
      "Trump Says He’s ‘Considering’ More Limited Iran Strike As Negotiating Tactic",
      "Oil prices edge lower as Trump considers limited military strike against Iran - CNBC",
      "Iran preparing deal proposal for US, says foreign minister"
    ],
    "url": "https://www.aljazeera.com/video/newsfeed/2026/2/20/trump-considering-limited-strikes-on-iran?traffic_source=rss",
    "alternate_urls": [
      "https://www.cnbc.com/2026/02/20/trump-says-hes-considering-limited-military-strike-against-iran.html",
      "https://www.cnbc.com/2026/02/20/oil-prices-trump-us-iran-conflict-strikes-energy.html",
      "https://news.google.com/rss/articles/CBMioAFBVV95cUxQYTJGa1R2SUpPZ1dDOU0yQ1B5UXcySG5ZMndaNDJGbWh6MFlvZ19yVXoySmszUXNueWdSSGZ1NTRZS0tSTmRNRWR2TUdGTnFmTjk4NEwwWWU5VFJzcW5KZThmSkthODNOeDJvaEg0NkxQN0RaVWZRMW1aY3Iwc25kbU5IUThHZGhtT3hCTzh6bjRnZ01rUU5ZT014OTQ3cGN3?oc=5",
      "https://news.google.com/rss/articles/CBMiwgFBVV95cUxPXzZmSWluOUc2dno0Q1UwYUl3dlo0dHdYZG4xb2JOZkx4d21yVTZqMFpPVE44YWJpZFdoNmxxYU1jaExWUkgxV3YyQWdZR2Zic2RiY0poOVk4OG9mLXNHMHRNWnRhaHM3Yk1OaTlpbV8yeWJfNEFDTFJ4S0pUQjhpWURnQzJhZmo3ZDNGWG5oZ093alVQanNMTXVRZFNnX0tRY3pFT09wNjJOS2VyLXBPTFdFQW1qbThtRTc0emQwNjkwd9IBwgFBVV95cUxPXzZmSWluOUc2dno0Q1UwYUl3dlo0dHdYZG4xb2JOZkx4d21yVTZqMFpPVE44YWJpZFdoNmxxYU1jaExWUkgxV3YyQWdZR2Zic2RiY0poOVk4OG9mLXNHMHRNWnRhaHM3Yk1OaTlpbV8yeWJfNEFDTFJ4S0pUQjhpWURnQzJhZmo3ZDNGWG5oZ093alVQanNMTXVRZFNnX0tRY3pFT09wNjJOS2VyLXBPTFdFQW1qbThtRTc0emQwNjkwdw?oc=5",
      "https://www.forbes.com/sites/saradorn/2026/02/20/trump-says-hes-considering-more-limited-iran-strike-as-negotiating-tactic/",
      "https://news.google.com/rss/articles/CBMijgFBVV95cUxNVzVmNUgyeEY0bDY2Szd0c2pwWlVheEFPN1Fud3lNVlFRcGVxYzkydFAwaHpFSzhWWFVMSEt1Z2V6U2JvRS0teDZaVVZBdzV6Umk2eEhveTNNYWFtek5Wa1JpYTFQSzZBVVV3bTdSVmdFUW9aZk80SUVGdXJMcjBnWUE1WG1FS3FrdUdzZjNR0gGTAUFVX3lxTE9nbWVETXdJblVvWnVtUklDbUxTNzdQNTlVVlhVRWp0clRXbTJBVTJGWWs4bjcyWWh0ci1yX29jNjE4WDJ0WlRUX3BEMzcweGlOQ0g0aHdudHNfVHRjTFZRcEtVUkRQcm93ZXpQeGVId2E5N2xvZ0Z0clgtaUlVbzVOMFpmdlFRM1pyTUxIaHlTbUludw?oc=5",
      "https://www.ft.com/content/14c01257-f4dd-4f5a-ae10-e7134462135d"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/video/newsfeed/2026/2/20/trump-considering-limited-strikes-on-iran?traffic_source=rss",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.932,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.83,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "snippet",
    "summary_reason": "invalid_roles",
    "headline_source": "gpt",
    "summary": "US President Trump says he is “considering” limited strikes on Iran as negotiations continue over its nuclear program.",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "Supreme Court Strikes Down Key Trump Tariffs",
    "domain": "business",
    "source_domain": "cnbc.com",
    "location": "national",
    "published": "Fri, 20 Feb 2026 17:19:48 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Financial Post",
      "Reuters",
      "The Guardian",
      "Bloomberg",
      "Financial Times",
      "Global News"
    ],
    "domains": [
      "cnbc.com",
      "financialpost.com",
      "news.google.com",
      "theguardian.com",
      "ft.com",
      "globalnews.ca"
    ],
    "snippets": [
      "The U.S. Supreme Court voted 6-3 to strike down large parts of President Trump's tariff policies Friday.",
      "The Supreme Court did not address the issue of refunds to importers, and Trump has said he has a backup plan",
      "Gold firms as investors weigh weak US GDP data, Supreme Court's tariff ruling Reuters",
      "Government ‘expects privileged trading position’ to go on as EU ‘seeks clarity’ over Trump administration’s next steps Britain and the EU said they were assessing the implications of the US supreme court ruling against Donald Trump’s global tariffs , while business groups reacted to the court’s anno",
      "Supreme Court’s Tariff Ruling Is Secretly a Gift to Trump Bloomberg",
      "The risk of a lasting inflationary overshoot is now lower but the US’s fiscal path is likely to be more expansionary",
      "What a Supreme Court tariff ruling may mean for your money CNBC",
      "The U.S. Supreme Court on Friday ruled that Trump overstepped his presidential authority by imposing tariffs on Canada, Mexico and other countries under emergency powers.",
      "Higher import costs is the latest blow to the furniture industry, which had been buckling under interest rates and a sluggish housing market well before tariffs."
    ],
    "image_url": "",
    "titles": [
      "U.S. trading partners cheer Supreme Court tariff ruling — but businesses must still navigate 'murky waters'",
      "Raw sugar finds support after Supreme Court tariff ruling",
      "Gold firms as investors weigh weak US GDP data, Supreme Court's tariff ruling - Reuters",
      "UK ‘working with US’ to analyse impact of supreme court’s ruling against tariffs",
      "Supreme Court’s Tariff Ruling Is Secretly a Gift to Trump - Bloomberg",
      "Supreme Court’s tariff ruling has mixed implications for the Fed",
      "What a Supreme Court tariff ruling may mean for your money - CNBC",
      "B.C. Premier David Eby to respond to Trump Supreme Court tariff ruling",
      "Small furniture retailers face existential tariff threat, despite Supreme Court ruling"
    ],
    "url": "https://www.cnbc.com/2026/02/20/supreme-court-tariff-ruling-trade-world-leaders-react-trump.html",
    "alternate_urls": [
      "https://financialpost.com/commodities/raw-sugar-finds-support-tariff-ruling",
      "https://news.google.com/rss/articles/CBMijwFBVV95cUxOTHhKVU93NGprenktcTZlbXo4bUZURkhLOGdtZ2FmaGx3cWVtNVlYR3hPbzExZUNsQ3VsWFlja25BUTU1MzRuc2d1emdVd3hfZWRGOEZLUlJ2SkJJMmE1c3NDMTAyWE5fbTkwY2psV2ZzXzd2cUt6UzZuVl8zRHdKSzZoTDA2MU9FbTVVN0VxTQ?oc=5",
      "https://www.theguardian.com/politics/2026/feb/20/uk-eu-reaction-us-supreme-court-ruling-trump-tariffs",
      "https://news.google.com/rss/articles/CBMirAFBVV95cUxQR0phWjlHSGU2M0QzNW9yZHVfN1BxUk9IUGhQbWFZQ1FJUzVaZlUxRjU3WmgtbmY2UWFuTGVndUpoLS1SMW5fenY2bllKTjJ5bU1IZWE4WjFaMmM3dUpRcEZuaG91cjZWV0JoRUtueU9qbXFpYjg3cEVEcE5Jal9raG9sUERhU0l6aWI4cEV2X2U2QjRMcDdURjZ2Vzd2a3VOMXd6NkZSckMzNmVu?oc=5",
      "https://www.ft.com/content/af9329a1-562b-4dcf-b6f8-f57d386c5632",
      "https://news.google.com/rss/articles/CBMickFVX3lxTE12SllHQUlETklEYlpueVo3cmFrVnRzQkFqV00tc1ZpRlhmRWkxd0gyZXVSMmZiMGtDMDlhWDRoNlBEc1d5bnY4d1IyWnFrVUhQRF9xVEZwZHNkTVpDa1lsdkQyVzh0dlcwaUxYR3V4U2pad9IBd0FVX3lxTFBvMXpXQ0E1dmZ3RlRFLWRMWTlRYk5VVjhWbnlvalBldENDQTFaUWZmT1ZONHp4VlR3cmh5QjB5VUVDd3FiMGR0anA3MkZZTkhMbmhmSGY0TG1ZekxpaS02Q1JWQS1rbUtLc25HMWM2V24xdkFINWN3?oc=5",
      "https://globalnews.ca/news/11676224/bc-premier-david-eby-respond-trump-supreme-court-tariff-ruling/",
      "https://www.cnbc.com/2026/02/19/supreme-court-tariffs-furniture-retailers-threat.html"
    ],
    "location_scope": "national",
    "link": "https://www.cnbc.com/2026/02/20/supreme-court-tariff-ruling-trade-world-leaders-react-trump.html",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.884,
      "consensus": 1.0,
      "constructiveness": 0.019,
      "proximity": 0.5
    },
    "score": 0.817,
    "constructiveness_score": 0.019,
    "constructiveness_reason": "semantic: pos_sim=0.08, neg_sim=0.00; semantic_boost=0.02; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The U.S. Supreme Court ruled 6-3 to strike down major parts of President Trump's tariffs on Canada, Mexico, and other countries, finding he exceeded his authority. The decision did not address importer refunds. The ruling is expected to lower inflation risks, but its economic impact is still being assessed by the U.S., EU, and business groups.",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "Leclerc Fastest in Final F1 Test",
    "domain": "politics",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Fri, 20 Feb 2026 19:44:29 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Yahoo Sports",
      "The Guardian"
    ],
    "domains": [
      "bbc.com",
      "sports.yahoo.com",
      "theguardian.com"
    ],
    "snippets": [
      "As pre-season testing reaches its conclusion, which teams look best - and worst - placed ahead of the Australian Grand Prix?",
      "Lando Norris second fastest; Max Verstappen third Aston Martin completed just six laps after problems Ferrari’s Charles Leclerc took the bragging rights with the quickest time at the final Formula One test before the season proper begins in Australia in just two weeks, while Aston Martin endured a h"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/90a1/live/9b3a1a90-0e8d-11f1-9120-a910fc22c6ac.png",
    "titles": [
      "Who are the winners and losers from F1 pre-season testing?",
      "Charles Leclerc clocks quickest time at final F1 pre-season testing in Bahrain"
    ],
    "url": "https://www.bbc.com/sport/formula1/articles/c77e1djpg3mo?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://sports.yahoo.com/articles/winners-losers-f1-pre-season-194434118.html",
      "https://www.theguardian.com/sport/2026/feb/20/charles-leclerc-lando-norris-max-verstappen-final-pre-season-testing-bahrain-formula-one"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/sport/formula1/articles/c77e1djpg3mo?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.946,
      "consensus": 0.789,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.8,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the outcomes of F1 pre-season testing. However, it does not report on solutions or improvements, or provide a clear sense of agency for the reader.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Charles Leclerc set the fastest time at the final Formula One pre-season test ahead of the Australian Grand Prix. Lando Norris was second fastest and Max Verstappen third. Aston Martin faced difficulties, completing only six laps due to technical problems.",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Kompany Criticizes Mourinhos Comments on Vinícius Júnior Incident",
    "domain": "sports",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Fri, 20 Feb 2026 15:51:17 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "ESPN",
      "The Guardian",
      "Sky Sports",
      "Yahoo Sports"
    ],
    "domains": [
      "bbc.com",
      "espn.com",
      "theguardian.com",
      "skysports.com",
      "sports.yahoo.com"
    ],
    "snippets": [
      "Bayern Munich boss Vincent Kompany says Jose Mourinho made a \"huge mistake\" with his \"unacceptable\" post-match comments after the alleged racial abuse of Real Madrid winger Vinicius Jr.",
      "Bayern Munich coach Vincent Kompany said Benfica boss José Mourinho made a \"huge mistake\" in his postmatch comments following alleged racist abuse of Real Madrid forward Vinícius Júnior.",
      "Manchester United co-owner reminded of his responsibilities in media interviews as Carrick backs club’s culture of respect Continue reading...",
      "Vincent Kompany believes Benfica manager Jose Mourinho made a \"huge mistake\" with his comments on Vinicius Jr.",
      "Bayern Munich coach Vincent Kompany has criticized José Mourinho for attacking the character of Vinícius Júnior after the Real Madrid star accused an opponent of racially insulting him during a Champions League match. Benfica coach Mourinho suggested that Brazil forward Vinícius had incited Benfica'"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/b786/live/412e7c40-0e64-11f1-801d-ed3cff6bf876.jpg",
    "titles": [
      "Mourinho made 'unacceptable, huge mistake' - Kompany",
      "Kompany: Mourinho made 'huge mistake' over Vini",
      "Football news: Ratcliffe escapes FA charges; Mourinho made ‘huge mistake’, says Kompany",
      "Kompany: Mourinho made 'huge mistake' with Vinicius comments",
      "'A huge mistake.' Kompany hits out at Mourinho for Vinícius Júnior comments"
    ],
    "url": "https://www.bbc.com/sport/football/articles/crl4jx0jw11o?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://www.espn.com/soccer/story/_/id/47986920/jose-mourinho-made-huge-mistake-alleged-racism-towards-vini-jr-kompany",
      "https://www.theguardian.com/football/2026/feb/20/football-news-jim-ratcliffe-escapes-fa-charges-jose-mourinho-vincent-kompany-premier-league",
      "https://www.skysports.com/football/news/12040/13509963/vincent-kompany-bayern-munich-boss-says-jose-mourinho-made-huge-mistake-with-comments-on-vinicius-jr-over-alleged-racism",
      "https://sports.yahoo.com/articles/huge-mistake-kompany-hits-mourinho-152246525.html"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/sport/football/articles/crl4jx0jw11o?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.849,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.787,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Bayern Munich coach Vincent Kompany criticized Benfica manager Jose Mourinho for making a 'huge mistake' with his post-match comments about Real Madrid's Vinícius Júnior, following allegations that Vinícius was racially abused during a Champions League match.",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "Andrew Mountbatten Windsor Faces Probe",
    "domain": "business",
    "source_domain": "npr.org",
    "location": "national",
    "published": "Fri, 20 Feb 2026 11:51:35 -0500",
    "source": "NPR",
    "sources": [
      "NPR",
      "BBC",
      "Financial Times",
      "The Guardian"
    ],
    "domains": [
      "npr.org",
      "bbc.com",
      "ft.com",
      "theguardian.com"
    ],
    "snippets": [
      "Andrew Mountbatten-Windsor, the British former prince, is being investigated on suspicion of misconduct in having shared confidential trade information with the late sex offender Jeffrey Epstein.",
      "The former Duke of York is eighth in line to the throne meaning he remains eligible to be King.",
      "Move by government comes as Met police probes use of London airports following revelations in Epstein files",
      "Move would follow any police investigation after former prince questioned on suspicion of misconduct in public office The government will consider passing legislation to strip Andrew Mountbatten-Windsor of his right to inherit the throne once any police investigation has concluded, it is understood."
    ],
    "image_url": "",
    "titles": [
      "U.K. considers cutting ex-Prince Andrew from line of succession over his Epstein ties",
      "Government considers removing Andrew from royal line of succession",
      "UK looks at removing former prince Andrew from royal line of succession",
      "Ministers to consider removing Andrew Mountbatten-Windsor from line of succession"
    ],
    "url": "https://www.npr.org/2026/02/20/g-s1-110915/uk-former-prince-andrew-epstein-investigation",
    "alternate_urls": [
      "https://www.bbc.com/news/articles/c1kgv837wvdo?at_medium=RSS&at_campaign=rss",
      "https://www.ft.com/content/11132602-1161-4311-ba54-8f730d262889",
      "https://www.theguardian.com/uk-news/2026/feb/20/mps-parliament-consider-removing-former-prince-andrew-mountbatten-windsor-from-line-of-succession"
    ],
    "location_scope": "national",
    "link": "https://www.npr.org/2026/02/20/g-s1-110915/uk-former-prince-andrew-epstein-investigation",
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.873,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.786,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Andrew Mountbatten-Windsor is being investigated by police over alleged misconduct involving confidential trade information shared with Jeffrey Epstein. The government is considering legislation to remove his right to inherit the throne, pending the outcome of the police investigation.",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "NBA Plans New Anti Tanking Rule Changes for Next Season",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Fri, 20 Feb 2026 14:29:46 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports",
      "Yahoo Sports"
    ],
    "domains": [
      "espn.com",
      "cbssports.com",
      "sports.yahoo.com"
    ],
    "snippets": [
      "Commissioner Adam Silver informed the league's 30 general managers that the NBA plans to make anti-tanking rule changes for next season, sources told ESPN.",
      "Adam Silver reportedly told teams this week that anti-tanking rule changes will be coming next season",
      "Will the new anti-tanking rules work? Color me skeptical"
    ],
    "image_url": "",
    "titles": [
      "Sources: NBA plans to enact anti-tanking rules",
      "The NBA plans to address tanking, but there are problems with the league's seven potential solutions",
      "The NBA’s new anti-tanking rules are a mess"
    ],
    "url": "https://www.espn.com/nba/story/_/id/47979919/nba-set-enact-anti-tanking-rules-next-season-sources-say",
    "alternate_urls": [
      "https://www.cbssports.com/nba/news/nba-tanking-rule-changes-problems-solutions/",
      "https://sports.yahoo.com/articles/nba-anti-tanking-rules-mess-173556970.html"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/nba/story/_/id/47979919/nba-set-enact-anti-tanking-rules-next-season-sources-say",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.939,
      "consensus": 0.789,
      "constructiveness": 0.042,
      "proximity": 0.75
    },
    "score": 0.767,
    "constructiveness_score": 0.042,
    "constructiveness_reason": "keywords (1): plan; actions: enact, plan; semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "NBA Commissioner Adam Silver has informed the league's 30 general managers that new anti-tanking rule changes are planned for next season, according to sources.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Rams Promote Nate Scheelhaase to Offensive Coordinator",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Fri, 20 Feb 2026 14:45:41 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Yahoo Sports",
      "Sportsnet"
    ],
    "domains": [
      "espn.com",
      "sports.yahoo.com",
      "sportsnet.ca"
    ],
    "snippets": [
      "The Rams are promoting passing game coordinator Nate Scheelhaase to offensive coordinator and making quarterbacks coach Dave Ragone their co-offensive coordinator/QB coach, sources told ESPN.",
      "The Los Angeles Rams are promoting assistant Nate Scheelhaase to offensive coordinator, a person with knowledge of the decision told The Associated Press on Friday. The person spoke to the AP on condition of anonymity because the Rams haven't made a full announcement of coach Sean McVay's new staff",
      "Rams are promoting passing game coordinator Nate Scheelhaase to offensive coordinator in the wake of Mike LaFleur leaving to become head coach of the Arizona Cardinals.",
      "Scheelhaase, 35, will stay with the L.A. Rams after interviewing for five NFL head coaching jobs following the 2025 season.",
      "Scheelhaase has spent the last two seasons with the Los Angeles Rams, first as an offensive assistant and passing game specialist, then as pass game coordinator.",
      "LOS ANGELES — The Los Angeles Rams are promoting assistant Nate Scheelhaase to offensive co-ordinator, a person with knowledge of the decision told The Associated Press on Friday. The person spoke to the AP on condition of anonymity because the Rams haven’t made a full announcement of coach Sean McVay’s new staff for the upcoming season. Scheelhaase replaces Mike LaFleur, who became the Arizona Cardinals’ head coach this month. The 35-year-old Scheelhaase became a rising star in NFL coaching circles last season. He interviewed for at least five head coaching vacancies in the past two months...."
    ],
    "image_url": "",
    "titles": [
      "Sources: Rams keep Scheelhaase, promote to OC",
      "Rams promote Nate Scheelhaase to offensive coordinator, AP source says",
      "Rams are promoting Nate Scheelhaase to offensive coordinator",
      "LA Rams promote rising star Nate Scheelhaase to offensive coordinator",
      "Rams promote pass game coordinator Nathan Scheelhaase to OC",
      "AP source: Rams promote Nate Scheelhaase to offensive co-ordinator"
    ],
    "url": "https://www.espn.com/nfl/story/_/id/47985549/rams-promote-nate-scheelhaase-oc-sources-say",
    "alternate_urls": [
      "https://sports.yahoo.com/articles/rams-promote-nate-scheelhaase-offensive-173107892.html",
      "https://sports.yahoo.com/articles/rams-promoting-nate-scheelhaase-offensive-182020181.html",
      "https://sports.yahoo.com/articles/la-rams-promote-rising-star-163917152.html",
      "https://sports.yahoo.com/nfl/breaking-news/article/rams-promote-pass-game-coordinator-nathan-scheelhaase-to-oc-125536714.html"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/nfl/story/_/id/47985549/rams-promote-nate-scheelhaase-oc-sources-say",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.946,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.765,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The Los Angeles Rams are promoting Nate Scheelhaase to offensive coordinator after Mike LaFleur left to become head coach of the Arizona Cardinals. Scheelhaase, 35, has spent the past two seasons with the Rams and interviewed for several NFL head coaching jobs following the 2025 season.",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "Canada to Play U.S. for Bronze After Semifinal Loss in Olympic Curling",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Fri, 20 Feb 2026 14:42:21 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Globe and Mail",
      "Sportsnet"
    ],
    "domains": [
      "espn.com",
      "news.google.com",
      "sportsnet.ca"
    ],
    "snippets": [
      "Canada's top-ranked women were upset by Sweden in the Olympic curling semifinals, while the United States also suffered a 7-4 loss to Switzerland.",
      "Canada to play for bronze after painful 6-3 loss to Sweden in women’s curling The Globe and Mail",
      "Team Rachel Homan will have to settle for a shot at Olympic bronze. The Canadian rink lost 6-3 to Team Anna Hasselborg of Sweden in the curling semifinals on Friday at Milano Cortina 2026. Homan will now play in the bronze-medal game on Saturday against Team Tabitha Peterson of the U.S. (8:05 a.m. ET / 5:05 a.m. PT, CBC Gem, Sportsnet+). Team Silvana Tirinzoni will face Sweden for gold on Sunday (5:05 a.m ET / 2:05 a.m. PT, CBC Gem, Sportsnet+) after the Swiss rink beat the U.S. 8-5 in the other semifinal. After winning the past two world titles, Homan’s rink was not at its best all week. “We..."
    ],
    "image_url": "",
    "titles": [
      "No. 1 Canada, U.S. fall in women's curling semis",
      "Canada to play for bronze after painful 6-3 loss to Sweden in women’s curling - The Globe and Mail",
      "Canada’s Team Homan loses to Sweden in Olympic women’s curling semifinal"
    ],
    "url": "https://www.espn.com/olympics/story/_/id/47986807/top-ranked-canada-us-fall-women-olympic-curling-semis",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMipgFBVV95cUxPQ1RETlB3b29BSmd2Y2FZcnNBRjVaQ09ZOGpRbFQzQm5mTWNNRFZkMTVIcGxkcWNPd0h1LU9HejlTSlFGM2xzM3Fpd0RibE15THNpT3d1SHo3MjlNeGV4dk9teXJpY0VhWTd1WHpfY3Q1MnprdnQzNWdvM3ltd1AzUGNqS3NNSHI3dlFJTDhhcFlPMzFnVlJ4VFB5VzE5QnktTWJOd0VB?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/olympics/story/_/id/47986807/top-ranked-canada-us-fall-women-olympic-curling-semis",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.945,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.764,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Canada's Team Rachel Homan lost 6-3 to Sweden in the women's curling semifinals at the Milano Cortina 2026 Olympics and will play the United States for bronze. Sweden will face Switzerland, who defeated the U.S. 8-5, in the gold medal match.",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Experts Release NBA and Olympic Hockey Predictions for February 20",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Fri, 20 Feb 2026 14:37:16 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports",
      "Yahoo Sports"
    ],
    "domains": [
      "espn.com",
      "cbssports.com",
      "sports.yahoo.com"
    ],
    "snippets": [
      "Friday at the Olympics is headlined by the U.S. men's hockey team facing Slovakia in the semifinals.",
      "SportsLine's expert Matt Severance reveals his United States vs. Slovakia picks for their Winter Olympics men's hockey semifinal match on Friday",
      "SportsLine's model reveals its Boston Celtics vs. Golden State Warriors NBA picks today",
      "SportsLine's model reveals its Detroit Pistons vs. New York Knicks predictions and NBA picks today",
      "SportsLine's model reveals its Atlanta Hawks vs. Philadelphia 76ers picks for Thursday",
      "SportsLine's model reveals its Los Angeles Clippers vs. Los Angeles Lakers predictions and NBA picks today",
      "Take the Under in our Pacers vs. Wizards picks, odds & expert predictions for Friday, February 20.",
      "Get the best Mavericks vs. Timberwolves predictions ahead of Friday's matchup in Minneapolis. Free NBA picks for February 20.",
      "Our Bucks vs. Pelicans predictions and free NBA picks for Friday, February 20 are targeting a Ryan Rollins player prop.",
      "Our Cavaliers vs. Hornets predictions see Charlotte putting up a good fight vs. Cleveland tonight. Free NBA picks for Friday, February 20.",
      "Our Heat vs. Hawks predictions for Friday, February 20 are calling for another big game for Jalen Johnson tonight.",
      "Our Jazz vs. Grizzlies predictions for Friday, February 20 expect Lauri Markkanen to manhandle Memphis.",
      "After 10,000 simulations, SportsLine's model reveals its top NBA picks today"
    ],
    "image_url": "",
    "titles": [
      "2026 Winter Olympics: U.S. men's hockey faces Slovakia in semis and more",
      "USA vs. Slovakia odds, prediction: 2026 Winter Olympics men's ice hockey semifinal picks from proven expert",
      "Celtics vs. Warriors odds, prediction, time: 2026 NBA picks for Thursday, Feb. 19 from proven model",
      "Knicks vs. Pistons odds, prediction, spread, time: 2026 NBA picks for Thursday, Feb. 19 from proven model",
      "Hawks vs. 76ers odds, prediction, spread, time: 2026 NBA picks for Thursday, Feb. 19 from proven model",
      "Lakers vs. Clippers odds, prediction, spread, time: 2026 NBA picks for Friday, Feb. 20, from proven model",
      "Pacers vs Wizards Prediction, Picks & Odds for Tonight’s NBA Game",
      "Mavericks vs Timberwolves Prediction, Picks & Odds for Tonight’s NBA Game",
      "Bucks vs Pelicans Prediction, Picks & Odds for Tonight’s NBA Game",
      "Cavaliers vs Hornets Prediction, Picks & Odds for Tonight’s NBA Game",
      "Heat vs Hawks Prediction, Picks & Odds for Tonight’s NBA Game",
      "Jazz vs Grizzlies Prediction, Picks & Odds for Tonight’s NBA Game",
      "NBA odds, picks, best bets for Friday, Feb. 20, from proven model: This 3-leg parlay returns over +750",
      "NBA odds, picks, best bets for Thursday, Feb. 19, from proven model: This 3-leg parlay returns over +450"
    ],
    "url": "https://www.espn.com/olympics/story/_/id/47980489/2026-milan-cortina-italy-winter-olympics-best-moments-friday",
    "alternate_urls": [
      "https://www.cbssports.com/olympics/news/usa-slovakia-odds-prediction-2026-winter-olympics-mens-ice-hockey-semifinal-picks-bets/",
      "https://www.cbssports.com/nba/news/celtics-warriors-odds-prediction-spread-time-2026-nba-picks-february-19/",
      "https://www.cbssports.com/nba/news/knicks-pistons-odds-prediction-spread-time-2026-nba-picks-february-19-best-bets/",
      "https://www.cbssports.com/nba/news/hawks-76ers-odds-prediction-spread-time-2026-nba-picks-february-19-best-bets/",
      "https://www.cbssports.com/nba/news/lakers-vs-clippers-odds-prediction-spread-time-2026-nba-picks-friday-february-20/",
      "https://sports.yahoo.com/articles/pacers-vs-wizards-prediction-picks-175500467.html",
      "https://sports.yahoo.com/articles/mavericks-vs-timberwolves-prediction-picks-175000449.html",
      "https://sports.yahoo.com/articles/bucks-vs-pelicans-prediction-picks-150800954.html",
      "https://sports.yahoo.com/articles/cavaliers-vs-hornets-prediction-picks-143500287.html",
      "https://sports.yahoo.com/articles/heat-vs-hawks-prediction-picks-140900233.html",
      "https://sports.yahoo.com/articles/jazz-vs-grizzlies-prediction-picks-134500002.html",
      "https://www.cbssports.com/nba/news/nba-odds-picks-parlay-best-bets-friday-february-20/",
      "https://www.cbssports.com/nba/news/nba-odds-picks-best-bets-thursday-february-19-basketball-parlay-props/"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/olympics/story/_/id/47980489/2026-milan-cortina-italy-winter-olympics-best-moments-friday",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.943,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.764,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "SportsLine and other experts have released their NBA predictions for several games on February 20, including picks for the Hawks vs. 76ers, Celtics vs. Warriors, Pistons vs. Knicks, Clippers vs. Lakers, and more. In the Winter Olympics, the U.S. men's hockey team is set to play Slovakia in the semifinals, with expert picks also provided for that matchup.",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "NASA Schedules Artemis II Moon Mission for March After Successful Test",
    "domain": "science",
    "source_domain": "npr.org",
    "location": "national",
    "published": "Fri, 20 Feb 2026 13:06:30 -0500",
    "source": "NPR",
    "sources": [
      "NPR",
      "The Guardian",
      "Phys.org"
    ],
    "domains": [
      "npr.org",
      "theguardian.com",
      "phys.org"
    ],
    "snippets": [
      "The four astronauts heading to the moon for the lunar fly-by are the first humans to venture there since 1972. The ten-day mission will travel more than 600,000 miles.",
      "Administrator Jared Isaacman cites ‘major progress’ since earlier discovery of liquid hydrogen leaking from rocket Nasa said on Friday it was planning to launch its delayed Artemis II moon mission on 6 March after successfully completing a fueling test that had caused it to stand down earlier this m",
      "NASA aims to send astronauts to the moon in March after acing the latest rocket fueling test."
    ],
    "image_url": "",
    "titles": [
      "NASA eyes March 6 to launch 4 astronauts to the moon on Artemis II mission",
      "Nasa to launch historic Artemis II moon mission on 6 March after delays",
      "NASA targets March for first moon mission by Artemis astronauts after fueling test success"
    ],
    "url": "https://www.npr.org/2026/02/20/nx-s1-5720953/nasa-artemis-ii-moon-launch-date",
    "alternate_urls": [
      "https://www.theguardian.com/science/2026/feb/20/nasa-artemis-ii-moon-mission-launch",
      "https://phys.org/news/2026-02-nasa-moon-mission-artemis-astronauts.html"
    ],
    "location_scope": "national",
    "link": "https://www.npr.org/2026/02/20/nx-s1-5720953/nasa-artemis-ii-moon-launch-date",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.904,
      "consensus": 0.789,
      "constructiveness": 0.06,
      "proximity": 0.75
    },
    "score": 0.758,
    "constructiveness_score": 0.06,
    "constructiveness_reason": "keywords (1): launch; actions: launch; semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "NASA plans to launch the Artemis II mission with four astronauts on 6 March, following a successful rocket fueling test that addressed earlier hydrogen leaks. The ten-day lunar fly-by will be the first crewed mission to the moon since 1972.",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Bears Make Progress Toward Possible Move to Indiana Stadium",
    "domain": "politics",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Fri, 20 Feb 2026 14:45:41 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "espn.com",
      "cbssports.com"
    ],
    "snippets": [
      "The Bears' search for a new home took a \"meaningful step\" forward, opening the door for the storied franchise to leave Illinois and potentially build a new, domed stadium in Indiana.",
      "The Bears have been seeking a new stadium for years"
    ],
    "image_url": "",
    "titles": [
      "Indiana passes bill to lure Bears from Chicago",
      "Could the Bears really leave Chicago? Indiana passes bill in effort to lure team across state lines"
    ],
    "url": "https://www.espn.com/nfl/story/_/id/47977218/indiana-unanimously-passes-bill-lure-bears-away-chicago",
    "alternate_urls": [
      "https://www.cbssports.com/nfl/news/bears-new-stadium-chicago-illinois-indiana-nfl/"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/nfl/story/_/id/47977218/indiana-unanimously-passes-bill-lure-bears-away-chicago",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.946,
      "consensus": 0.591,
      "constructiveness": 0.6,
      "proximity": 0.75
    },
    "score": 0.757,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs readers about a new bill in Indiana, providing some context about the intention to lure the Bears from Chicago. However, it doesn't provide deeper understanding or insights into the potential impacts or the reasoning behind this decision.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The Bears have advanced plans to potentially build a new domed stadium in Indiana, signaling progress in their search for a new home and raising the possibility of leaving Illinois.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Sidney Crosby Ruled Out of Olympic Semifinal vs. Finland",
    "domain": "sports",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Fri, 20 Feb 2026 15:03:18 GMT",
    "source": "Sports Illustrated",
    "sources": [
      "Sports Illustrated",
      "Sportsnet",
      "Yahoo Sports"
    ],
    "domains": [
      "news.google.com",
      "sportsnet.ca",
      "sports.yahoo.com"
    ],
    "snippets": [
      "Sidney Crosby Won’t Play in Canada’s Olympic Semifinal vs. Finland Sports Illustrated",
      "Canada will have to try to make the men’s Olympic gold-medal game without its captain. Sidney Crosby has been ruled out for Friday’s semifinal against Finland with a lower-body injury, Hockey Canada announced . Crosby suffered the injury in Wednesday’s Olympic quarterfinal against Czechia. He hobbled off the ice in the second period after he was crunched along the boards in the neutral zone by Czech defenceman Radko Gudas at centre ice and took another awkward hit along the boards later in the same shift. It’s a big blow for the Canadians, as Crosby enjoyed a strong round-robin in Milan with...",
      "Sidney Crosby is not playing for Canada against Finland in the semifinals at the Olympics on Friday because of injury. Crosby appeared to injure his right knee in the second period of the quarterfinals against Czechia on Wednesday night. It was not immediately clear if the 38-year-old captain would"
    ],
    "image_url": "",
    "titles": [
      "Sidney Crosby Won’t Play in Canada’s Olympic Semifinal vs. Finland - Sports Illustrated",
      "Canadian captain Sidney Crosby out for semifinal against Finland",
      "Injured Sidney Crosby is out for Canada vs. Finland in the semifinals at the Olympics"
    ],
    "url": "https://news.google.com/rss/articles/CBMieEFVX3lxTE5JLVZyMFY1MXdsY0ctWndlR1MtZWZ4YUZxMFhLd3hJcWJnbmNrQkZHYkhBN3RYTUZUQUlTLXdjN0FSRVJZOUY4YnNBUFZtazBvaTFDYzUwUGp2XzRha0pXSFZ5RVg1YjBlX1NBVTFQUDdlNXpoSmNEYw?oc=5",
    "alternate_urls": [
      "https://sports.yahoo.com/articles/injured-sidney-crosby-canada-vs-143249311.html"
    ],
    "location_scope": "national",
    "link": "https://news.google.com/rss/articles/CBMieEFVX3lxTE5JLVZyMFY1MXdsY0ctWndlR1MtZWZ4YUZxMFhLd3hJcWJnbmNrQkZHYkhBN3RYTUZUQUlTLXdjN0FSRVJZOUY4YnNBUFZtazBvaTFDYzUwUGp2XzRha0pXSFZ5RVg1YjBlX1NBVTFQUDdlNXpoSmNEYw?oc=5",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.83,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.755,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Sidney Crosby has been ruled out of Canada's Olympic men's hockey semifinal against Finland due to a lower-body injury sustained during the quarterfinal win over Czechia. Hockey Canada announced he will not play in Friday's game, leaving Canada without its captain as they compete for a spot in the gold-medal match.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Andrew Mountbatten Windsor Arrested and Investigated for Misconduct",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Fri, 20 Feb 2026 14:16:27 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "ABC News",
      "Al Jazeera",
      "New York Times"
    ],
    "domains": [
      "news.google.com",
      "abcnews.com",
      "aljazeera.com",
      "nytimes.com"
    ],
    "snippets": [
      "Former Prince Andrew was arrested. What the Epstein files revealed about him Axios",
      "International attorney Ann Olivarius breaks down potential criminal pathways, jurisdictional hurdles and investigative next steps.",
      "Mountbatten-Windsor remains under investigation, which means he has neither been charged nor exonerated by police.",
      "Andrew Mountbatten-Windsor, a longtime associate of Jeffrey Epstein, is being investigated on suspicion of misconduct in public office.",
      "There have been no public statements by his former wife or their two daughters.",
      "King Charles III’s brother, who had already been stripped of his royal titles over ties to Jeffrey Epstein, was detained for several hours on Thursday on suspicions of misconduct in public office.",
      "King Charles III’s family, long rocked by infighting and grievous losses, is facing what could be the gravest threat to its moral authority in more than a generation.",
      "The arrest of the former prince could shake public confidence in the monarchy.",
      "Police officers standing by an entrance to Wood Farm on the royal family’s Sandringham Estate, in Norfolk, England, where Andrew Mountbatten-Windsor was arrested on Thursday."
    ],
    "image_url": "",
    "titles": [
      "Former Prince Andrew was arrested. What the Epstein files revealed about him - Axios",
      "WATCH:  What’s next for former Prince Andrew after his arrest?",
      "Police search ex-Prince Andrew’s former home a day after his arrest",
      "British Police Arrest Former Prince Andrew Amid Scrutiny Over Epstein Ties",
      "How Has Sarah Ferguson, the Former Prince’s Ex-Wife, Responded to His Arrest?",
      "What to Know About Former Prince Andrew’s Arrest and His Ties to Epstein",
      "Former Prince Andrew’s Arrest Upends Royal Family’s Effort to Move Past His Scandal",
      "Former Prince Andrew’s Arrest Casts Shadow Over UK Monarchy",
      "Former Prince Andrew is the most senior British royal to have been arrested in modern times."
    ],
    "url": "https://news.google.com/rss/articles/CBMidkFVX3lxTFBjaDVneDlnRnRwWEc1MWE4YWREYnNVcjVaaFdrclJ2VFU5bU9wMGlrYlJIeEZHNkpVVF9Ra3JiZzhHZUI4ZzM0dVNDMk5zUWxTdno3V2RCcGUxdXAzTEVSZ1BScGZnMloxRVJYYXd5Mml2T1RLZmc?oc=5",
    "alternate_urls": [
      "https://abcnews.com/International/video/whats-former-prince-andrew-after-arrest-130316202",
      "https://www.aljazeera.com/news/2026/2/20/police-search-ex-prince-andrews-home-a-day-after-his-arrest?traffic_source=rss",
      "https://www.nytimes.com/2026/02/19/world/europe/prince-andrew-arrest-epstein.html",
      "https://www.nytimes.com/2026/02/19/world/europe/ex-wife-andrew-sarah-ferguson-epstein-files.html",
      "https://www.nytimes.com/2026/02/19/world/europe/andrew-mountbatten-windsor-arrest-epstein-explained.html",
      "https://www.nytimes.com/2026/02/20/world/europe/prince-andrew-arrest-epstein-royal-family-uk.html",
      "https://www.nytimes.com/2026/02/19/world/europe/prince-andrew-epstein-royal-family.html",
      "https://www.nytimes.com/live/2026/02/19/world/uk-prince-andrew-arrest-epstein/former-prince-andrew-is-the-most-senior-british-royal-to-have-been-arrested-in-modern-times"
    ],
    "location_scope": "national",
    "link": "https://news.google.com/rss/articles/CBMidkFVX3lxTFBjaDVneDlnRnRwWEc1MWE4YWREYnNVcjVaaFdrclJ2VFU5bU9wMGlrYlJIeEZHNkpVVF9Ra3JiZzhHZUI4ZzM0dVNDMk5zUWxTdno3V2RCcGUxdXAzTEVSZ1BScGZnMloxRVJYYXd5Mml2T1RLZmc?oc=5",
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.812,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.743,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Andrew Mountbatten-Windsor was arrested at Sandringham Estate on suspicion of misconduct in public office related to his association with Jeffrey Epstein. He remains under investigation and has not been charged or exonerated. No public statements have been made by his former wife or daughters.",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "Businesses Face Delays in Receiving Trump Tariff Refunds",
    "domain": "politics",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Fri, 20 Feb 2026 16:02:38 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "Business Insider"
    ],
    "domains": [
      "news.google.com",
      "businessinsider.com"
    ],
    "snippets": [
      "Business celebrates win over Trump tariffs, but refunds will take time Reuters",
      "The process for IEEPA tariff refunds will likely go through the Court of International Trade. Already, over 1,000 lawsuits are pending."
    ],
    "image_url": "",
    "titles": [
      "Business celebrates win over Trump tariffs, but refunds will take time - Reuters",
      "The battle over Trump tariff refunds is next — and it will be messy"
    ],
    "url": "https://news.google.com/rss/articles/CBMiywFBVV95cUxPNzNMaXgxX0pLYUZUbXRhbzNIT0xTRUlLYjB6TkZNeHZMNTlWV3AtaURfTm5GTUFwYm5DRWhEZWVxUWpuLThGYWZ6cFJqc1pEOE1BMHU1OFl3SU5TT1hBV2RzeFEyQzc5TS1zMjNpYWVHZDZLTnc2MUZCNDNRV1RUZEtLZjBLdXJUOU1MVVI3LW5SOER6UkpjcFR5TjdwaktCRENqenJnb0YyQklzRUwwUWdrdDByUlpIYm5TRVZ6alJaWUVtNEZvU1dRTQ?oc=5",
    "alternate_urls": [
      "https://www.businessinsider.com/trump-tariff-refund-process-how-works-court-international-trade-2026-2"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMiywFBVV95cUxPNzNMaXgxX0pLYUZUbXRhbzNIT0xTRUlLYjB6TkZNeHZMNTlWV3AtaURfTm5GTUFwYm5DRWhEZWVxUWpuLThGYWZ6cFJqc1pEOE1BMHU1OFl3SU5TT1hBV2RzeFEyQzc5TS1zMjNpYWVHZDZLTnc2MUZCNDNRV1RUZEtLZjBLdXJUOU1MVVI3LW5SOER6UkpjcFR5TjdwaktCRENqenJnb0YyQklzRUwwUWdrdDByUlpIYm5TRVZ6alJaWUVtNEZvU1dRTQ?oc=5",
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.853,
      "consensus": 0.591,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.737,
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful information about the impacts of policy changes on businesses and the economy. It also gives insight into the process of tariff refunds, which can help readers understand how these policies work in practice. However, it does not seem to report on any solutions or improvements, limiting its score.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Businesses that successfully challenged Trump-era IEEPA tariffs are set to receive refunds, but the process is expected to be lengthy as over 1,000 lawsuits are currently pending before the Court of International Trade.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Trump Commits $10 Billion to Board of Peace for Gaza Stabilization",
    "domain": "politics",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Fri, 20 Feb 2026 16:41:38 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "Washington Post"
    ],
    "domains": [
      "news.google.com",
      "washingtonpost.com"
    ],
    "snippets": [
      "Trump pledges $10 billion for Board of Peace in inaugural meeting on Gaza Axios",
      "President Donald Trump’s sparsely attended Board of Peace meeting set a mission to stabilize Gaza, but plans beyond that remain murky."
    ],
    "image_url": "",
    "titles": [
      "Trump pledges $10 billion for Board of Peace in inaugural meeting on Gaza - Axios",
      "Trump vows $10 billion contribution to his own Board of Peace"
    ],
    "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTE4wY1MxNlVxUWNnMUxOenZoX1RWQ2g2VTdOUzVsYlY5dGIyaDlxSElxdDBQNFdBSGhRSHlFUlhPMXp0ZVE5ZmxBb1V3Y2JuY25BV0JDUXk3LTc5cWJMcElrOWxDNEJmbWFpclBrcGFtTUxCejNQ?oc=5",
    "alternate_urls": [
      "https://www.washingtonpost.com/politics/2026/02/19/trump-board-of-peace-gaza/"
    ],
    "location_scope": "national",
    "link": "https://news.google.com/rss/articles/CBMidEFVX3lxTE4wY1MxNlVxUWNnMUxOenZoX1RWQ2g2VTdOUzVsYlY5dGIyaDlxSElxdDBQNFdBSGhRSHlFUlhPMXp0ZVE5ZmxBb1V3Y2JuY25BV0JDUXk3LTc5cWJMcElrOWxDNEJmbWFpclBrcGFtTUxCejNQ?oc=5",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.869,
      "consensus": 0.591,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.735,
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story reports on a potential solution to a conflict, which is constructive. However, without more details on how the funds will be used or the potential impacts, it doesn't fully empower the reader with knowledge.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Donald Trump pledged $10 billion for a Board of Peace aimed at stabilizing Gaza during its inaugural meeting, though detailed plans have not been outlined.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Mountbatten Windsor Arrested Over Misconduct Allegations",
    "domain": "business",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Fri, 20 Feb 2026 18:32:39 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "ABC News",
      "Financial Times"
    ],
    "domains": [
      "bbc.com",
      "abcnews.com",
      "ft.com"
    ],
    "snippets": [
      "The former prince was arrested on suspicion of misconduct in public office and taken to a Norfolk police station for questioning on Thursday 19 February.",
      "Mountbatten-Windsor's arrest on Thursday follows the emergence of documents detailing communication between the former prince and the late convicted sex offender, Jeffrey Epstein.",
      "Former prince was UK trade envoy but his role was never officially outlined"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/a0f5/live/40cffe30-0e88-11f1-b048-c9424b2cf5fd.jpg",
    "titles": [
      "What happens next for Andrew Mountbatten-Windsor?",
      "WATCH:  Andrew Mountbatten-Windsor arrested in London",
      "Andrew Mountbatten-Windsor arrest highlights vagueness of rules for royals"
    ],
    "url": "https://www.bbc.com/news/videos/cgmljz14lpro?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://abcnews.com/International/video/andrew-mountbatten-windsor-arrested-london-130313325",
      "https://www.ft.com/content/f855da8c-0371-4e9f-8fe2-11e046de95a7"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/news/videos/cgmljz14lpro?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.915,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.73,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Mountbatten-Windsor, a former UK trade envoy, was arrested on February 19 on suspicion of misconduct in public office. The arrest follows the release of documents showing communication between him and the late Jeffrey Epstein. He was taken to a Norfolk police station for questioning.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Argentinas Lower House Approves Labor Reform Backed by Milei",
    "domain": "politics",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Fri, 20 Feb 2026 19:06:00 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Reuters"
    ],
    "domains": [
      "aljazeera.com",
      "news.google.com"
    ],
    "snippets": [
      "Unions have slammed the reforms as an effort under libertarian President Javier Milei to erode protections for workers.",
      "Argentina's lower house passes labor reform despite strike Reuters"
    ],
    "image_url": "",
    "titles": [
      "Argentina’s Chamber of Deputies passes controversial labour reform bill",
      "Argentina's lower house passes labor reform despite strike - Reuters"
    ],
    "url": "https://www.aljazeera.com/news/2026/2/20/argentinas-chamber-of-deputies-passes-controversial-labour-reform-bill?traffic_source=rss",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiuAFBVV95cUxORnpsZmJRbUVIVUxTNHU0ZUl4eWhBeE1zbFVIclhYVjBIYzdSUDJjNTh4ZDdzQVBxS2VnUDdXSGdHMnVJLVpMQV9pTDR3Qzhadnc1OE5pcHlNWlFsNHlNQkhGd1hZRjVXS1pFVlphNmFuRXQyb2NhVkRyUkxlZFN1Tm9peVVQbXhiaWU2WTVPTkxYTGxQT2pwMXlYM01SVjROcTFRTHozeDIwbUgtNnh4N0E2V0FlQjJi?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2026/2/20/argentinas-chamber-of-deputies-passes-controversial-labour-reform-bill?traffic_source=rss",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.929,
      "consensus": 0.591,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.727,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs readers about a significant policy change in Argentina, which can be useful for those interested in international politics or economics. However, without more details about the specifics of the reform and its potential impacts, it does not fully contribute to readers' understanding or decision-making.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Argentina's lower house has approved a labor reform bill backed by President Javier Milei, despite opposition from unions who argue the changes will reduce worker protections.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Venezuela Releases Political Prisoners After Maduros Capture",
    "domain": "general",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Fri, 20 Feb 2026 16:04:06 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "New York Times"
    ],
    "domains": [
      "aljazeera.com",
      "nytimes.com"
    ],
    "snippets": [
      "Venezuela's new government has released hundreds of political detainees. But does that mean freedom?",
      "Since Nicolás Maduro’s capture by the United States, Venezuela has released hundreds of political prisoners and approved a new amnesty law, although the restrictions on those freed have raised questions about whether this signals real change. Our international correspondent Simon Romero describes wh"
    ],
    "image_url": "",
    "titles": [
      "A fragile freedom for Venezuela’s released political prisoners",
      "Venezuela Releases Political Prisoners, With Conditions"
    ],
    "url": "https://www.aljazeera.com/news/longform/2026/2/20/a-fragile-freedom-for-venezuelas-released-political-prisoners?traffic_source=rss",
    "alternate_urls": [
      "https://www.nytimes.com/video/world/americas/100000010703424/venezuela-releases-political-prisoners-with-conditions.html"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/longform/2026/2/20/a-fragile-freedom-for-venezuelas-released-political-prisoners?traffic_source=rss",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.854,
      "consensus": 0.591,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.705,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "While the story does not provide actionable insights, it does offer a deeper understanding of the political situation in Venezuela and the plight of political prisoners. It does not, however, report on solutions or improvements, nor does it increase clarity around systems or impacts.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Following Nicolás Maduro's capture by the United States, Venezuela's new government has released hundreds of political prisoners and approved an amnesty law. However, restrictions on those released have led to questions about the extent of political change.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Trump Administration Moves to Weaken Mercury Emissions Rules for",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Fri, 20 Feb 2026 11:05:02 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "The Guardian"
    ],
    "domains": [
      "news.google.com",
      "theguardian.com"
    ],
    "snippets": [
      "Trump EPA to weaken rule limiting harmful mercury, air toxins from coal plants Reuters",
      "Environmental groups warn that weakening air toxics and mercury standards will lead to higher health-related costs The Trump administration announced on Friday it would roll back air regulations for power plants limiting mercury and hazardous air toxics at an event in Kentucky, a move it says will b"
    ],
    "image_url": "",
    "titles": [
      "Trump EPA to weaken rule limiting harmful mercury, air toxins from coal plants - Reuters",
      "Trump’s EPA to roll back rule limiting hazardous mercury from coal plants"
    ],
    "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxQN0VnaVJnZDhONG84Y05hZFRFZ0RVRXdRU2ZzOXZrUjNuSWtza1d2N3d2c05aSjZLWjdKTENBckhkaVdkS1RJdEFDeFkxRXVBQXFTNk9WampPSUNHV3FxbXZrUGxpSFV1YXV2ZDJWbEZqTDFWbUY3ZEpIbnpZNm50Y3dhOHJ4ejloOHZfMS1Ya1FoWGpFZzFVdkZ4dlVMNU9pVW93ajNNaGpkVURnYnEwR2MwWHdKU1RSUkRyMU51bw?oc=5",
    "alternate_urls": [
      "https://www.theguardian.com/us-news/2026/feb/20/trump-epa-weaken-rule-mercury-air-toxics-coal"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMivwFBVV95cUxQN0VnaVJnZDhONG84Y05hZFRFZ0RVRXdRU2ZzOXZrUjNuSWtza1d2N3d2c05aSjZLWjdKTENBckhkaVdkS1RJdEFDeFkxRXVBQXFTNk9WampPSUNHV3FxbXZrUGxpSFV1YXV2ZDJWbEZqTDFWbUY3ZEpIbnpZNm50Y3dhOHJ4ejloOHZfMS1Ya1FoWGpFZzFVdkZ4dlVMNU9pVW93ajNNaGpkVURnYnEwR2MwWHdKU1RSUkRyMU51bw?oc=5",
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.744,
      "consensus": 0.591,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.704,
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story informs readers about a significant policy change that could have impacts on public health and the environment. It provides useful context about the role of the EPA and the implications of weakening regulations on mercury and air toxins. However, it does not highlight any progress or solutions, nor does it empower readers with knowledge on how to respond or take action.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The Trump administration announced plans to roll back regulations that limit mercury and hazardous air toxic emissions from power plants. Environmental groups warn the move could increase health-related costs, while the administration says the changes will benefit the industry.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "US Increases Military Presence as Nuclear Talks With Iran Continue",
    "domain": "politics",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Fri, 20 Feb 2026 16:45:25 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "CBC News"
    ],
    "domains": [
      "aljazeera.com",
      "cbc.ca"
    ],
    "snippets": [
      "Top Iranian diplomat Abbas Araghchi says US 'has not asked' for zero uranium enrichment in nuclear talks.",
      "The U.S. has deployed dozens of military aircraft and other assets to bases in and near the Middle East, with President Donald Trump suggesting Thursday strikes against Iran could begin “within 10 days” if a deal is not reached about its nuclear program."
    ],
    "image_url": "",
    "titles": [
      "Iran says US military build-up ‘unnecessary and unhelpful’, deal achievable",
      "What we know about the U.S. military buildup near Iran"
    ],
    "url": "https://www.aljazeera.com/news/2026/2/20/iran-says-us-military-build-up-unnecessary-and-unhelpful-deal-achievable?traffic_source=rss",
    "alternate_urls": [
      "https://www.cbc.ca/news/world/us-iran-military-buildup-iran-9.7097884?cmp=rss"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2026/2/20/iran-says-us-military-build-up-unnecessary-and-unhelpful-deal-achievable?traffic_source=rss",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.87,
      "consensus": 0.591,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.7,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness about the current state of US-Iran relations and the potential for a deal. However, it lacks depth and insight, as it does not provide much context or analysis about why Iran has this stance or what a deal might look like.",
    "constructiveness_source": "gpt",
    "summary_source": "snippet",
    "summary_reason": "invalid_roles",
    "headline_source": "gpt",
    "summary": "Top Iranian diplomat Abbas Araghchi says US 'has not asked' for zero uranium enrichment in nuclear talks.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Catania Man Used Dog to Evade CCTV in Rubbish Dumping Scheme",
    "domain": "general",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Fri, 20 Feb 2026 15:57:17 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "bbc.com",
      "theguardian.com"
    ],
    "snippets": [
      "\"Ingenuity can never become an alibi for incivility\", the City of Catania warns.",
      "City of Catania calls ruse to avoid CCTV cameras installed to stop fly-tipping ‘as cunning as it is doubly wrong’ A man in Catania, Sicily, trained his dog to dump bags of rubbish by the roadside in an attempt to evade surveillance cameras installed to combat fly-tipping, municipal police have said."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/af9f/live/3b795c80-0e5e-11f1-9120-a910fc22c6ac.png",
    "titles": [
      "Dog trained to illegally dump rubbish, Italian authorities say",
      "Man in Sicily trained his dog to illegally dump rubbish, say police"
    ],
    "url": "https://www.bbc.com/news/articles/cy57erz57xyo?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://www.theguardian.com/world/2026/feb/20/man-sicily-trained-dog-illegally-dump-rubbish-catania"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/news/articles/cy57erz57xyo?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.851,
      "consensus": 0.591,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.7,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story raises awareness about an unusual case of illegal dumping. However, it does not provide enough depth or insight to be highly constructive. It could be more useful if it discussed the broader issue of waste management and potential solutions.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Municipal police in Catania, Sicily, report that a man trained his dog to dump rubbish bags by the roadside to avoid CCTV cameras installed to prevent fly-tipping. City officials condemned the act, calling it both cunning and wrong.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Andrew Mountbatten Windsors Legal Troubles Impact Royal Family",
    "domain": "general",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Fri, 20 Feb 2026 18:05:35 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Washington Post"
    ],
    "domains": [
      "bbc.com",
      "washingtonpost.com"
    ],
    "snippets": [
      "The problems facing the monarchy over Andrew Mountbatten-Windsor is also a family problem between brothers.",
      "Unlike King Charles I, who was arrested in 1647, Andrew Mountbatten-Windsor will not be executed. But his legal woes and ties to Jeffrey Epstein threaten to damage the royal family."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/ac4c/live/63cbdfe0-0e64-11f1-ac78-0950755f28c4.jpg",
    "titles": [
      "Andrew and King Charles, a personal battle of royal brothers",
      "Arrest of Andrew, brother of King Charles, shakes the House of Windsor"
    ],
    "url": "https://www.bbc.com/news/articles/czx4y1l1nq4o?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://www.washingtonpost.com/world/2026/02/19/arrest-andrew-brother-king-charles-windsor/"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/news/articles/czx4y1l1nq4o?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.903,
      "consensus": 0.591,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.69,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers basic awareness about a personal conflict between royal brothers. However, it lacks depth or insight that would contribute meaningfully to the reader’s understanding or decision-making.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Andrew Mountbatten-Windsor continues to face legal issues related to his connections with Jeffrey Epstein, raising concerns about potential harm to the reputation of the royal family.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Paralympic Committee Allows Russian and Belarusian Athletes to Compete",
    "domain": "general",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Fri, 20 Feb 2026 13:22:05 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Washington Post"
    ],
    "domains": [
      "aljazeera.com",
      "washingtonpost.com"
    ],
    "snippets": [
      "The International Paralympic Committee has allocated 10 combined slots to Russian and Belarusian athletes.",
      "The decision allowing Russia and Belarus to rejoin competition drew outrage in Ukraine and Europe following the disqualification last week of a Ukrainian skeleton athlete."
    ],
    "image_url": "",
    "titles": [
      "Ukraine to boycott Paralympic Games ceremony due to Russian participation",
      "Ukraine protests renewed Paralympics participation by Russia, Belarus"
    ],
    "url": "https://www.aljazeera.com/sports/2026/2/20/ukraine-to-boycott-paralympic-games-ceremony-due-to-russian-participation?traffic_source=rss",
    "alternate_urls": [
      "https://www.washingtonpost.com/world/2026/02/20/russia-belarus-paralympics-ukraine-protest/"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/sports/2026/2/20/ukraine-to-boycott-paralympic-games-ceremony-due-to-russian-participation?traffic_source=rss",
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.792,
      "consensus": 0.591,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.688,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story provides basic awareness about Ukraine's decision to boycott the Paralympic Games ceremony. However, it does not offer deeper insights or context about the underlying issues between Ukraine and Russia, nor does it report on any solutions or attempts to address these issues.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The International Paralympic Committee has granted 10 combined slots to Russian and Belarusian athletes, allowing them to compete. The decision has led to criticism in Ukraine and Europe, especially after a Ukrainian skeleton athlete was disqualified last week.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Trump Linked Board of Peace Launches in Washington",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Fri, 20 Feb 2026 10:04:29 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "Al Jazeera"
    ],
    "domains": [
      "news.google.com",
      "aljazeera.com"
    ],
    "snippets": [
      "Trump's Board of Peace debuts: Who's in, who's out, who could join next Axios",
      "The Board of Peace takes Washington."
    ],
    "image_url": "",
    "titles": [
      "Trump's Board of Peace debuts: Who's in, who's out, who could join next - Axios",
      "Who made the cut on Trump’s ‘Board of Peace’ and what they want"
    ],
    "url": "https://news.google.com/rss/articles/CBMigwFBVV95cUxONEFmWFA2SXA4VUU3Z0lZSHpLTmhfVlpWR2hLYnNOY2kxMDZ4MW53VFNISDNiM1RCdHJ5U1V6NUd3LW80TEJTejUxTDlIaTFZXzRZN2tOZHF2SHpGN0tOajBZR29OUmQyOVdkV2ZrMTRZWjlMVjc4SjVONzdIMkxXalBJZw?oc=5",
    "alternate_urls": [
      "https://www.aljazeera.com/video/the-take-2/2026/2/20/aje-onl-glb_boardofpeacemeeting_av_v1-190226?traffic_source=rss"
    ],
    "location_scope": "national",
    "link": "https://news.google.com/rss/articles/CBMigwFBVV95cUxONEFmWFA2SXA4VUU3Z0lZSHpLTmhfVlpWR2hLYnNOY2kxMDZ4MW53VFNISDNiM1RCdHJ5U1V6NUd3LW80TEJTejUxTDlIaTFZXzRZN2tOZHF2SHpGN0tOajBZR29OUmQyOVdkV2ZrMTRZWjlMVjc4SjVONzdIMkxXalBJZw?oc=5",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.723,
      "consensus": 0.591,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.672,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the composition of the 'Board of Peace', which could be relevant to readers interested in political developments. However, it doesn't seem to highlight any specific solutions or progress, nor does it provide a deep understanding of the underlying systems or causes.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The Board of Peace, associated with Trump, has been established in Washington. The initial members have been announced, while speculation continues about possible future additions.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Judge Upholds $243 Million Verdict Against Tesla Over Autopilot Crash",
    "domain": "business",
    "source_domain": "cnbc.com",
    "location": "national",
    "published": "Fri, 20 Feb 2026 19:28:47 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Reuters"
    ],
    "domains": [
      "cnbc.com",
      "news.google.com"
    ],
    "snippets": [
      "A federal judge in Miami denied Tesla's bid to overturn a $243 million jury verdict in a high-profile lawsuit over a fatal Autopilot crash.",
      "US judge upholds $243 million verdict against Tesla over fatal Autopilot crash Reuters"
    ],
    "image_url": "",
    "titles": [
      "Tesla loses bid to toss $243 million verdict in fatal Autopilot crash suit",
      "US judge upholds $243 million verdict against Tesla over fatal Autopilot crash - Reuters"
    ],
    "url": "https://www.cnbc.com/2026/02/20/tesla-loses-bid-toss-243-million-verdict-fatal-autopilot-crash-suit.html",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiuwFBVV95cUxQNm1CWkdxNHhNbE1TekZReGM3bTd4NVB0Sm90aW5PaUpTUWo5VzZHcS1LbkdkRkNUWnU1V2lIS2R4Qi1nWVlxQ0RPWmUwNVJkejlMeXV5OGxDNlNFdkhVR2NFcTdxRlQzQ3NKMWhOQkUwLS1JTzJUTUJSc2VMVExkeDN2ZGo0c2ZvTF80S0U2UlNQdFNyR3ZqckpDblBmRlJSNWVCVGw0TUxPSHhXNnBIdXhIYXJLc2l5TV9R?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.cnbc.com/2026/02/20/tesla-loses-bid-toss-243-million-verdict-fatal-autopilot-crash-suit.html",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.939,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.67,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "A federal judge in Miami has upheld a $243 million jury verdict against Tesla in a lawsuit over a fatal Autopilot crash, denying the company's request to overturn the decision.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Supreme Court Blocks Trumps Tariffs",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Fri, 20 Feb 2026 17:05:01 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "MarketWatch"
    ],
    "domains": [
      "news.google.com",
      "marketwatch.com"
    ],
    "snippets": [
      "What Trump's tariff loss means for his agenda Axios",
      "The Supreme Court decision just made ‘money talks’ with your partner a lot less stressful."
    ],
    "image_url": "",
    "titles": [
      "What Trump's tariff loss means for his agenda - Axios",
      "Trump’s tariff loss is a win for your relationship"
    ],
    "url": "https://news.google.com/rss/articles/CBMidEFVX3lxTFA5NXFMNTFUZ2hnYkFZeTlFcHY1X2dqSzNHeUVFbGZYVjVTOC01bEU0VllMNGNsQjEyMTlBWjk3ZWIyTl9uLTlfRldyYjZ1WnMwcmFEa0NEOHUwVFBDc0hfM3hUQWhRc2ViMG1IRjNlN3A3aURh?oc=5",
    "alternate_urls": [
      "https://www.marketwatch.com/story/tariff-proof-your-partnership-how-couples-can-turn-economic-hurdles-into-financial-wins-971134e9?mod=mw_rss_topstories"
    ],
    "location_scope": "national",
    "link": "https://news.google.com/rss/articles/CBMidEFVX3lxTFA5NXFMNTFUZ2hnYkFZeTlFcHY1X2dqSzNHeUVFbGZYVjVTOC01bEU0VllMNGNsQjEyMTlBWjk3ZWIyTl9uLTlfRldyYjZ1WnMwcmFEa0NEOHUwVFBDc0hfM3hUQWhRc2ViMG1IRjNlN3A3aURh?oc=5",
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.878,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.664,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The Supreme Court has ruled against Trump's proposed tariffs, impacting his economic agenda. The decision is expected to ease financial concerns for couples, as it affects how tariffs influence household expenses.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Trump Warns Iran of Harsher Response Than June Airstrikes",
    "domain": "business",
    "source_domain": "cnbc.com",
    "location": "national",
    "published": "Fri, 20 Feb 2026 16:30:12 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Washington Post"
    ],
    "domains": [
      "cnbc.com",
      "washingtonpost.com",
      "news.google.com"
    ],
    "snippets": [
      "President Trump has warned Iran that an attack would be \"far worse\" than the U.S. airstrikes that targeted its nuclear facilities last June.",
      "Although the United States and ally Israel have a military advantage over Iranian forces, there are ways for Tehran to make any attack painful, officials said.",
      "Trump could attack Iran in days — what's at stake for the oil market CNBC"
    ],
    "image_url": "",
    "titles": [
      "Trump could attack Iran in days — what's at stake for the oil market",
      "Trump appears ready to attack Iran as U.S. strike force takes shape",
      "Trump could attack Iran in days — what's at stake for the oil market - CNBC"
    ],
    "url": "https://www.cnbc.com/2026/02/20/trump-could-attack-iran-in-days-whats-at-stake-for-the-oil-market.html",
    "alternate_urls": [
      "https://www.washingtonpost.com/national-security/2026/02/19/trump-iran-attack-military/",
      "https://news.google.com/rss/articles/CBMipAFBVV95cUxPeFRnT1EzM2I3OWdTWmFCNHdEMDI3VGpSdVk1QW9ESDBNQldJZExZZV9pSGZ4RHUzdFVQM24yWGQ2ZXhOemFuaURkcmpXU3NDNVo4SzlTUmpPNEk0V1R5eUxLZXFXS2VLbmx2ZzdZS1lsTUptQ2plX2JRSjZnck1lTi0xZ2x1QmxzWmNNQWRkd01QQjQ5WjFpNnRzcDZRN2RRYk9wZtIBqgFBVV95cUxQV3dNU294ekc4RTFmSGNWU2ItUG5aMlQxZUZsSVpBRjFRbVBkMTl4cEtWcUNNTnJfdkhfQ01MUUtNdjdKTnFsNVJyMHRSRjJDR0pBWmlOSXI2OHl0T19HN2RjRHp5VGg1Z2hnZGE4VUU3Z0ZRTkhPNnJQQ2xiVnByOXBkUDVVQ2t6b1pkTDR5Sk9Hdi1QaEczQW95QTl4d0s0aEFXWkgxbVBCdw?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.cnbc.com/2026/02/20/trump-could-attack-iran-in-days-whats-at-stake-for-the-oil-market.html",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.864,
      "consensus": 0.611,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.658,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "negative_penalty=0.08 (keywords: attack); speculative_penalty=0.06 (tokens: could); semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "President Trump has warned Iran that any attack would be more severe than last June's U.S. airstrikes on Iranian nuclear facilities. U.S. and Israeli forces have a military advantage, but officials note that Iran could still retaliate in ways that would cause significant challenges.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Nvidia Nears $30 Billion Investment in OpenAI Funding Round",
    "domain": "business",
    "source_domain": "cnbc.com",
    "location": "national",
    "published": "Fri, 20 Feb 2026 15:59:14 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Reuters"
    ],
    "domains": [
      "cnbc.com",
      "news.google.com"
    ],
    "snippets": [
      "The investment is separate from the $100 billion infrastructure agreement that OpenAI and Nvidia announced in September.",
      "Nvidia close to investing $30 billion in OpenAI's mega funding round, source says Reuters"
    ],
    "image_url": "",
    "titles": [
      "Nvidia is in talks to invest up to $30 billion in OpenAI, source says",
      "Nvidia close to investing $30 billion in OpenAI's mega funding round, source says - Reuters"
    ],
    "url": "https://www.cnbc.com/2026/02/19/nvidia-is-in-talks-to-invest-up-to-30-billion-in-openai-source-says.html",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMivwFBVV95cUxNc3dhTXN0WlA0X01NTHdRS3BPYzVNZVUxbmhoUHhYc3hKNFQzdm12VTdnc3VlQV9mUWRYSE1nYVJpQ2VoeHpzMFM4UVY0cTJ1aTlSUXVyNWhUdTFPeHM5SmduRTZJUmM1V1NQa1hKejM3SDhQSkRKR2ZUZklVUlg1TVlfOFdBSmYtZXAydVN1Ynk5S0VnZkZDVUpINmJEUG51UEZoYloxck5XLWVMVVBrTkM0ajlBd1pWeFE3aEVVWQ?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.cnbc.com/2026/02/19/nvidia-is-in-talks-to-invest-up-to-30-billion-in-openai-source-says.html",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.852,
      "consensus": 0.591,
      "constructiveness": 0.03,
      "proximity": 0.5
    },
    "score": 0.653,
    "constructiveness_score": 0.03,
    "constructiveness_reason": "keywords (1): invest; semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Nvidia is nearing a $30 billion investment in OpenAI as part of a major funding round, according to a source. This investment is separate from the $100 billion infrastructure agreement previously announced by OpenAI and Nvidia in September.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Two teens who died at holiday park named by police",
    "domain": "general",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Fri, 20 Feb 2026 16:54:47 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "bbc.com",
      "theguardian.com"
    ],
    "snippets": [
      "Cherish Bean, 15, and Ethan Slater, 17, died at Little Eden Holiday Park on Wednesday, police say.",
      "Cherish Bean, 15, and Ethan Slater, 17, were discovered at a rental property in Little Eden Holiday Lodge Park on Wednesday A teenage couple who died from suspected carbon monoxide poisoning at an East Yorkshire holiday park have been named by police. Cherish Bean, 15, and Ethan Slater, 17, were dis"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/4e78/live/01c7d810-0db2-11f1-956d-fd8ddad492c1.png",
    "titles": [
      "Two teens who died at holiday park named by police",
      "Tributes paid to teen couple who died of suspected carbon monoxide poisoning in Yorkshire"
    ],
    "url": "https://www.bbc.com/news/articles/c4g8rdp6lrvo?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://www.theguardian.com/uk-news/2026/feb/20/tributes-paid-to-teen-couple-who-died-of-suspected-carbon-monoxide-poisoning-in-yorkshire"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/news/articles/c4g8rdp6lrvo?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.874,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.651,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "This news story is reactive and sensational, focusing on a tragic event without providing any actionable insights, deeper understanding, or information about potential solutions or causes.",
    "constructiveness_source": "gpt",
    "summary_source": "skipped",
    "summary_reason": "skipped_due_to_budget",
    "headline_source": "",
    "summary": "",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Artemis II Crew Trains on T-38",
    "domain": "science",
    "source_domain": "nasa.gov",
    "location": "global",
    "published": "Fri, 20 Feb 2026 14:52 GMT",
    "source": "NASA EO",
    "sources": [
      "NASA EO",
      "NASA"
    ],
    "domains": [
      "nasa.gov"
    ],
    "snippets": [
      "NASA astronaut Christina Koch and Canadian Space Agency astronaut Jeremy Hansen take off on a T-38 training flight from Ellington Field on Feb. 11, 2026, as a waning crescent Moon hovers above.",
      "NASA astronaut Christina Koch and Canadian Space Agency astronaut Jeremy Hansen take off on a T-38 training flight from Ellington Field on Feb. 11, 2026, as a waning crescent Moon hovers above. Koch and Hansen, along with NASA astronauts Reid Wiseman and Victor Glover, are part of NASA’s Artemis II"
    ],
    "image_url": "https://www.nasa.gov/wp-content/uploads/2026/02/jsc2026e007422orig.jpg",
    "titles": [
      "Artemis II Crew Trains on T-38"
    ],
    "url": "https://www.nasa.gov/image-detail/jsc2026e007422/",
    "alternate_urls": [
      "https://www.nasa.gov/image-article/artemis-ii-crew-trains-on-t-38/"
    ],
    "location_scope": "global",
    "link": "https://www.nasa.gov/image-detail/jsc2026e007422/",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.826,
      "consensus": 0.571,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.638,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "skipped",
    "summary_reason": "skipped_due_to_budget",
    "headline_source": "",
    "summary": "",
    "is_trending": false,
    "trending_score": 0.0
  }
]