[
  {
    "title": "Trump's battle on international students explained... in 70 seconds",
    "domain": "general",
    "location": "global",
    "published": "Wed, 28 May 2025 23:38:10 GMT",
    "source": "BBC",
    "sources": [
      "BBC"
    ],
    "snippets": [
      "The BBC's Nomia Iqbal spoke to students at Harvard University, which is the target of funding cuts and a ban on international student enrollment."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/7e63/live/c1881ed0-3c02-11f0-b6e6-4ddb91039da1.jpg",
    "titles": [
      "Trump's battle on international students explained... in 70 seconds"
    ],
    "summary": "The BBC's Nomia Iqbal reported on the situation at Harvard University, which is facing funding cuts and a prohibition on enrolling international students. This development directly impacts the university's financial resources and its global student community.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the impact of policy changes on international students and universities, although it does not offer solutions or delve deeply into the causes or broader implications.",
    "score_components": {
      "magnitude": 0.429,
      "recency": 0.771,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.503,
    "normalized_score": 8.26
  },
  {
    "title": "Rosenberg: What a new Stalin statue says about Russia's attempt to reshape history",
    "domain": "general",
    "location": "global",
    "published": "Wed, 28 May 2025 23:26:10 GMT",
    "source": "BBC",
    "sources": [
      "BBC"
    ],
    "snippets": [
      "A brand new statue of the Soviet dictator Josef Stalin has been unveiled at a Metro station in Moscow."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/7ff5/live/eb10b3c0-3c61-11f0-aa24-d1c64c46ace6.jpg",
    "titles": [
      "Rosenberg: What a new Stalin statue says about Russia's attempt to reshape history"
    ],
    "summary": "A new statue of Josef Stalin has been unveiled at a Moscow Metro station, marking a notable addition to the city's public displays. This event reflects a continuing interest in Soviet history within Russia, showcasing Stalin's enduring and complex legacy in the country's public and historical narrative.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides insight into Russia's relationship with its Soviet past, increasing reader's awareness of historical trends and their impact on the present. However, it does not offer actionable insights or report on progress.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.769,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.506,
    "normalized_score": 8.51
  },
  {
    "title": "Cassie Ventura needed stitches after Diddy beating, trial hears",
    "domain": "general",
    "location": "global",
    "published": "Wed, 28 May 2025 23:21:59 GMT",
    "source": "BBC",
    "sources": [
      "BBC"
    ],
    "snippets": [
      "Deonte Nash testified that he spent years witnessing the music mogul's abuse and threats."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/cff3/live/ef4f6f80-3c0c-11f0-aa24-d1c64c46ace6.jpg",
    "titles": [
      "Cassie Ventura needed stitches after Diddy beating, trial hears"
    ],
    "summary": "Deonte Nash, a witness, provided testimony regarding his years of observing a music mogul engaged in abusive behavior and issuing threats. This testimony contributes to the ongoing scrutiny of the mogul's conduct.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "While this story raises awareness about domestic abuse, it does so in a sensational manner that lacks depth or insight. It does not provide actionable insights or report on solutions to the issue.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.768,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.456,
    "normalized_score": 4.38
  },
  {
    "title": "US distances itself from Gaza food delivery group amid questions over leadership and funding",
    "domain": "general",
    "location": "global",
    "published": "Wed, 28 May 2025 22:49:37 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "snippets": [
      "<p>Gaza Humanitarian Foundation had faced criticism from aid groups even before this week’s chaotic rollout</p><p>After a rollout trumpeted by US officials, the US- and <a href=\"https://www.theguardian.com/world/israel\">Israeli</a>-backed effort that claimed it would return large-scale food deliveries to <a href=\"https://www.theguardian.com/world/gaza\">Gaza</a> was born an orphan, with questions growing over its leadership, sources of funding and ties to Israeli officials and private US security contractors.</p><p>The Gaza Humanitarian Foundation had said it would <a href=\"https://www.theguardian.com/us-news/2025/may/09/gaza-israeli-aid-plan\">securely provide food supplies to the Gaza Strip</a>, ending an Israeli blockade that UN officials say have led to the brink of a famine.</p> <a href=\"https://www.theguardian.com/world/2025/may/28/gaza-food-deliveries\">Continue reading...</a>"
    ],
    "image_url": "https://i.guim.co.uk/img/media/e80f42d5d521bdf0dd6cf41bf524745f139407f8/784_0_7200_5760/master/7200.jpg?width=140&quality=85&auto=format&fit=max&s=90ec41b817ed943544fdd985dca7a3f3",
    "titles": [
      "US distances itself from Gaza food delivery group amid questions over leadership and funding"
    ],
    "summary": "The Gaza Humanitarian Foundation, backed by the US and Israel, launched an initiative to resume large-scale food deliveries to Gaza, aiming to end an Israeli blockade cited by the UN for bringing the region close to famine. However, the effort has faced significant criticism for its chaotic rollout, unclear leadership, funding sources, and connections to Israeli officials and US private security firms. Despite initial promises, the program's effectiveness and transparency are now under scrutiny.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the Gaza Humanitarian Foundation's initiative and the challenges it faces, offering readers a deeper understanding of the situation. However, it does not report on any solutions, improvements, or attempts to solve the problems mentioned, nor does it clearly highlight progress or empowering knowledge.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.76,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.484,
    "normalized_score": 6.69
  },
  {
    "title": "RFK Jr. and Dr. Oz Want Canada to Save Ostriches on Farm With Avian Flu",
    "domain": "general",
    "location": "global",
    "published": "Wed, 28 May 2025 22:33:15 +0000",
    "source": "New York Times",
    "sources": [
      "New York Times"
    ],
    "snippets": [
      "Ostriches on a British Columbia farm have died of the avian flu. Canada ordered hundreds of others to be culled. But two top Trump administration officials have objected."
    ],
    "image_url": "https://static01.nyt.com/images/2025/05/28/multimedia/28int-canada-ostriches-ltpw/28int-canada-ostriches-ltpw-mediumSquareAt3X.jpg",
    "titles": [
      "RFK Jr. and Dr. Oz Want Canada to Save Ostriches on Farm With Avian Flu"
    ],
    "summary": "In British Columbia, Canada, several ostriches on a farm succumbed to the avian flu, leading Canadian authorities to mandate the culling of hundreds more to prevent the disease's spread. However, this decision faced opposition from two senior officials from the Trump administration.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "While the story raises awareness about the avian flu outbreak on a Canadian farm and the controversial decision to cull ostriches, it offers minimal depth or insight into the issue. It does not provide actionable insights or deeper understanding for the reader, nor does it report on solutions or attempts to solve the problem.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.756,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.452,
    "normalized_score": 4.05
  },
  {
    "title": "NHL free agency big board: Where does Marner land? Who are the other top options?",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 28 May 2025 23:06:36 EST",
    "source": "ESPN",
    "sources": [
      "ESPN"
    ],
    "snippets": [
      "From All-Stars and award winners down to diamonds in the rough, here's who is available on July 1."
    ],
    "image_url": "",
    "titles": [
      "NHL free agency big board: Where does Marner land? Who are the other top options?"
    ],
    "summary": "On July 1, a diverse group of baseball players, ranging from decorated All-Stars and award winners to lesser-known talents, became available. This encompasses players of various achievements and recognitions in the sport.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness about the NHL free agency and the players available. However, it lacks depth or insight into the implications of these player movements, the strategies of the teams involved, or the potential impacts on the sport. Therefore, it does not significantly contribute to the reader's understanding or decision-making.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.764,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.455,
    "normalized_score": 4.3
  },
  {
    "title": "Free agency and draft plans for Hurricanes, every other eliminated team",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 28 May 2025 23:06:36 EST",
    "source": "ESPN",
    "sources": [
      "ESPN"
    ],
    "snippets": [
      "We explore the next moves each team should make this summer and forecast its 2025-26 outlook."
    ],
    "image_url": "",
    "titles": [
      "Free agency and draft plans for Hurricanes, every other eliminated team"
    ],
    "summary": "This article discusses the future strategies and projections for various sports teams, focusing on the actions they should take in the upcoming summer to improve their performance. It provides a forecast of each team's outlook for the 2025-26 season, aiming to give insights into the potential changes and developments expected in the teams' dynamics and success rates over the next few years.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "GPT evaluation failed",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.764,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.405,
    "normalized_score": 0.17
  },
  {
    "title": "Littler rules out early retirement: 'I'll be here for a long time!'",
    "domain": "sports",
    "location": "global",
    "published": "Wed, 28 May 2025 23:00:00 BST",
    "source": "Sky Sports",
    "sources": [
      "Sky Sports"
    ],
    "snippets": [
      "Luke Littler, perhaps to the dismay of his close rivals, downplayed retirement talk as he set his sights on adding longevity to his supremacy at the top of darts.&#160;"
    ],
    "image_url": "https://e2.365dm.com/25/05/1920x1080/skysports-luke-littler-premier-league_6929962.jpg?20250528225034",
    "titles": [
      "Littler rules out early retirement: 'I'll be here for a long time!'"
    ],
    "summary": "Luke Littler, a prominent figure in darts, has dismissed rumors of retirement, expressing his desire to continue dominating the sport for an extended period.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "GPT evaluation failed",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.762,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.404,
    "normalized_score": 0.08
  },
  {
    "title": "2025 MLB mock draft 1.0: High school slugger or college ace at No. 1?",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 28 May 2025 22:45:55 EST",
    "source": "ESPN",
    "sources": [
      "ESPN"
    ],
    "snippets": [
      "Starting with a wide-open top of the board, here's how the first round of this July's draft could play out."
    ],
    "image_url": "",
    "titles": [
      "2025 MLB mock draft 1.0: High school slugger or college ace at No. 1?"
    ],
    "summary": "The first round of the draft in July began with numerous possibilities for top picks. The outcome of this initial stage is expected to significantly influence the strategies and decisions of teams throughout the rest of the draft process.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "GPT evaluation failed",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.759,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.403,
    "normalized_score": 0.0
  },
  {
    "title": "Transfer window preview: What do Europe's big clubs need?",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 28 May 2025 22:42:37 EST",
    "source": "ESPN",
    "sources": [
      "ESPN"
    ],
    "snippets": [
      "The first transfer window is set to open across Europe on June 1, so what are the top clubs planning? Who comes in? Who will go?"
    ],
    "image_url": "",
    "titles": [
      "Transfer window preview: What do Europe's big clubs need?"
    ],
    "summary": "The first transfer window in Europe is scheduled to open on June 1. Top football clubs are preparing for player acquisitions and departures, though specific plans regarding who will be transferred in or out remain undisclosed at this stage.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about the upcoming transfer window in European football. However, it lacks depth and actionable insights, as it doesn't provide specific information about which players might be transferred or what strategies the clubs might use.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.758,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.453,
    "normalized_score": 4.13
  },
  {
    "title": "AI China Curbs Weaken America's Position, Nvidia CEO Jensen Huang Says",
    "domain": "business",
    "location": "global",
    "published": "Wed, 28 May 2025 22:02:03 GMT",
    "source": "Investopedia",
    "sources": [
      "Investopedia"
    ],
    "snippets": [
      "<figure><img alt=\"Andrew Harnik / Getty Images Nvidia CEO Jensen Huang, right, with President Donald Trump in Washington, D.C., in April.\" src=\"https://www.investopedia.com/thmb/Xyw1677hPqEQVF12A_Wz3nUtxII=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2212184615-dd3dee6426f24d4c8e5841e18ea49744.jpg\" title=\"President Donald Trump, left, with Nvidia CEO Jensen Huang. \" /><figcaption><i><p>Andrew Harnik / Getty Images</p> Nvidia CEO Jensen Huang, right, with President Donald Trump in Washington, D.C., in April.</i></figcaption></figure><p>Trump-administration policy that restricts the sale of Nvidia products to China \"weakens America's position,\" CEO Jensen Huang said Wednesday.</p><p>Huang's comments came during a conference call after chip giant Nvidia (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;NVDA\">NVDA</a>) reported its <a href=\"https://www.investopedia.com/nvidia-earnings-q1-fy2026-11742553\">latest financial results</a>—which included a multibillion dollar hit to revenue and a ding to earnings associated with export curbs on the company's H20 chips to China. (Read <em>Investopedia's</em> live coverage of <a href=\"https://www.investopedia.com/nvidia-earnings-live-coverage-q1-fy2026-11743538\">Nvidia's results here</a>.) They follow a <a href=\"https://www.investopedia.com/trade-war-truce-leaves-30-tariff-on-china-in-place-11732864\">mid-May trade truce</a> of sorts between Trump and China, which have put on hold steep tariffs on each other's imports while the countries seek a trade deal.</p><p>Instead of limiting Chinese AI capabilities, Huang said, the curbs have \"spurred China's innovation and scale.\"</p><p>“The question is not whether China will have AI—it already does,” Huang said. “The question is whether one of the world's largest AI markets will run on American platforms. Shielding Chinese chipmakers from U.S. competition only strengthens them abroad and weakens America's position.\"</p><p>Policy assumptions that China can't make its own AI chips are \"clearly wrong,\" said Huang.</p><p>The CEO also called it \"terrific\" that Trump rescinded the Biden administration's AI diffusion rule, which would've put additional restrictions on the export of AI chips, particularly to countries that aren't U.S. allies. The Trump administration has said it’s looking to replace the rules, and analysts <a href=\"https://www.investopedia.com/trump-plan-to-undo-biden-chip-curbs-is-a-win-for-nvidia-but-not-for-long-analysts-warn-11730745\">have warned</a> that new ones could be stricter than Biden's.</p><p>\"President Trump wants America to win, and he also realizes that that we're not the only country in the race,\" Huang said Wednesday.</p><p>The conference call followed news that the <a href=\"https://www.investopedia.com/chip-software-stocks-tumble-trump-china-cadence-synopsys-nvidia-earnings-11743742\">administration told companies</a> that make software used to design semiconductors to stop selling to Chinese companies. That news hit shares of companies in that sector during Wednesday's session.<br /></p>"
    ],
    "image_url": "https://www.investopedia.com/thmb/Xyw1677hPqEQVF12A_Wz3nUtxII=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2212184615-dd3dee6426f24d4c8e5841e18ea49744.jpg",
    "titles": [
      "AI China Curbs Weaken America's Position, Nvidia CEO Jensen Huang Says"
    ],
    "summary": "Nvidia CEO Jensen Huang criticized Trump administration policies restricting Nvidia's product sales to China, stating they weaken America's position and spur Chinese innovation. During a conference call after reporting significant financial losses due to export curbs, Huang argued these policies do not limit China's AI capabilities but rather encourage their own technological advancements. He also mentioned the rescindment of the Biden administration's AI diffusion rule by Trump, suggesting a desire for America to lead in AI but acknowledging the global competition. This commentary followed ac",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful information about the impact of US policies on AI technology and international competition. It also provides context about the financial impact of these policies on Nvidia. However, it doesn't report on any solutions or improvements to the situation.",
    "score_components": {
      "magnitude": 0.429,
      "recency": 0.749,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.516,
    "normalized_score": 9.34
  },
  {
    "title": "HP sinks 15% as company misses on earnings, guidance due to 'added cost' from tariffs",
    "domain": "business",
    "location": "national",
    "published": "Wed, 28 May 2025 21:55:24 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "snippets": [
      "HP beat on revenue but came up short on earnings and guidance, partly due to President Donald Trump's tariffs."
    ],
    "image_url": "",
    "titles": [
      "HP sinks 15% as company misses on earnings, guidance due to 'added cost' from tariffs"
    ],
    "summary": "HP reported higher-than-expected revenue but missed earnings forecasts and provided disappointing guidance. The shortfall was partly attributed to the impact of tariffs introduced by President Donald Trump.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the impact of tariffs on HP's financial performance. However, it doesn't provide deeper insights into the broader impacts of these tariffs or potential solutions to the problem.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.748,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.488,
    "normalized_score": 7.02
  },
  {
    "title": "Chip Software Stocks Tumble on Report Trump Orders They Stop Selling to China",
    "domain": "business",
    "location": "global",
    "published": "Wed, 28 May 2025 21:35:13 GMT",
    "source": "Investopedia",
    "sources": [
      "Investopedia"
    ],
    "snippets": [
      "<figure><img alt=\"Andrew Harnik / Getty Images President Trump reportedly ordered companies stop selling chip design software to China.\" src=\"https://www.investopedia.com/thmb/eWSJmP348rrzCl6ksLR5q3FoGUo=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2216880075-669eba159cc242c39e2804dd0e720941.jpg\" title=\"President Donald Trump speaks during a swearing in ceremony for U.S. Attorney for Washington, D.C.\" /><figcaption><i><p>Andrew Harnik / Getty Images</p> President Trump reportedly ordered companies stop selling chip design software to China.</i></figcaption></figure><p>Shares of semiconductor software companies sank, weighed down by a report that they had been caught up in the Trump administration’s efforts to hamstring China’s ability to develop sophisticated artificial intelligence. </p><p>The Financial Times on Wednesday reported the White House had instructed companies that sell software used to design semiconductors to stop providing their services to Chinese clients.<span class=\"ql-inline-citation\"></span> </p><p>Shares of Cadence Design Systems (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;CDNS\">CDNS</a>) and Synopsys (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;SNPS\">SNPS</a>) tumbled 10.7% and 9.6%, respectively, on Wednesday. Those companies did not respond to Investopedia's requests for comment in time for publication.</p><p>The report arrived ahead of Nvidia's (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;NVDA\">NVDA</a>) report of its latest <a href=\"https://www.investopedia.com/nvidia-earnings-q1-fy2026-11742553\">quarterly financial results</a>, with the chip giant saying it took a substantial financial hit—though smaller than it initially thought—after the White House in early April tightened restrictions on the export of advanced chips to China. Read <em>Investopedia's</em> full coverage of <a href=\"https://www.investopedia.com/nvidia-earnings-live-coverage-q1-fy2026-11743538\">Nvidia's results here</a>.</p><p>The Trump administration has escalated <a href=\"https://www.investopedia.com/biden-to-impose-more-limits-on-nvidia-ai-chip-exports-report-says-8771630\">the Biden administration’s efforts</a> to curb China’s access to cutting-edge semiconductors. Nvidia in particular lost out on some revenue associated with its H20 chips, which it developed specifically to comply with Biden-era restrictions. Competitor Advanced Micro Devices (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;MU\">AMD</a>) estimated it would take an $800 million hit for similar easons.</p><p>Nvidia CEO Jensen Huang <a href=\"https://www.investopedia.com/nvidia-ceo-jensen-huang-calls-us-curbs-on-advanced-chip-exports-to-china-failure-11739180\">reportedly blasted</a> U.S. export controls as \"a failure\" during an industry conference earlier this month. Huang argued the restrictions had encouraged local technology firms to develop sophisticated chips on their own, eroding U.S. firms' market share without preventing China's AI prospects.</p><p>Trump earlier this month <a href=\"https://www.investopedia.com/the-trump-administration-plans-to-repeal-biden-era-chip-curbs-that-were-set-to-take-effect-later-this-month-and-expand-limits-on-exports-of-american-chips-11730418\">rescinded</a> Biden's \"AI diffusion rule,\" which would have expanded export restrictions and tightened existing controls. The administration says it will eventually issue its own rule to prevent US-made chips from reaching China via other countries.<span class=\"ql-inline-citation\"></span></p>"
    ],
    "image_url": "https://www.investopedia.com/thmb/eWSJmP348rrzCl6ksLR5q3FoGUo=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2216880075-669eba159cc242c39e2804dd0e720941.jpg",
    "titles": [
      "Chip Software Stocks Tumble on Report Trump Orders They Stop Selling to China"
    ],
    "summary": "President Trump directed companies to halt sales of chip design software to China, intensifying efforts to restrict China's development of advanced artificial intelligence. This move caused shares of semiconductor software companies like Cadence Design Systems and Synopsys to fall significantly. The action builds on previous restrictions under the Biden administration, targeting the semiconductor industry and affecting major companies such as Nvidia and AMD financially. Nvidia's CEO criticized the U.S. export controls for failing to curb China's AI advancements and instead diminishing U.S. mar",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful information about the impact of political decisions on the tech industry. It gives readers an understanding of the relationship between politics and the economy, particularly in the tech sector. However, it doesn't clearly highlight any progress or solutions, nor does it provide a deep insight into the systems or causes behind these developments.",
    "score_components": {
      "magnitude": 0.429,
      "recency": 0.743,
      "consensus": 0.2,
      "constructiveness": 0.7
    },
    "score": 0.504,
    "normalized_score": 8.35
  },
  {
    "title": "Trump says he's not 'chickening out' on trade: 'It's called negotiation'",
    "domain": "business",
    "location": "national",
    "published": "Wed, 28 May 2025 21:20:53 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "snippets": [
      "TACO, the term that stands for \"Trump Always Chickens Out,\" describes the market reaction to Trump repeatedly announcing heavy tariffs and later pausing them."
    ],
    "image_url": "",
    "titles": [
      "Trump says he's not 'chickening out' on trade: 'It's called negotiation'"
    ],
    "summary": "The term \"TACO\" refers to a pattern observed in the market where former President Trump would announce significant tariffs but then delay their implementation. This term highlights the observed inconsistency between initial tariff announcements and subsequent actions.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides some insight into the tactics used in international trade negotiations, and the term 'TACO' could be useful for readers interested in understanding market trends. However, it doesn't provide a deep understanding of the negotiation process or its impacts, nor does it highlight any progress or solutions.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.74,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.486,
    "normalized_score": 6.86
  },
  {
    "title": "Mark Zuckerberg says Meta AI has 1 billion monthly active users",
    "domain": "business",
    "location": "national",
    "published": "Wed, 28 May 2025 21:12:43 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "snippets": [
      "Meta's AI assistant now has one billion monthly active users across the company's family of apps, CEO Mark Zuckerberg said Wednesday."
    ],
    "image_url": "",
    "titles": [
      "Mark Zuckerberg says Meta AI has 1 billion monthly active users"
    ],
    "summary": "Meta's AI assistant has reached one billion monthly active users across its apps, as announced by CEO Mark Zuckerberg. This milestone highlights the AI assistant's widespread use within Meta's suite of applications.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about the reach of Meta's AI assistant, which could be useful for readers interested in the tech industry. However, it doesn't provide a deep understanding of the implications of this milestone, nor does it highlight any progress or solutions beyond the achievement itself.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.738,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.475,
    "normalized_score": 5.95
  },
  {
    "title": "This Common Oral Bacterium Can Invade Your Heart",
    "domain": "science",
    "location": "global",
    "published": "Wed, 28 May 2025 21:54:26 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/this-common-oral-bacterium-can-invade-your-heart/\" rel=\"nofollow\" title=\"This Common Oral Bacterium Can Invade Your Heart\"><img alt=\"Dental Teeth Mouth Bacteria and Viruses\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Dental-Teeth-Mouth-Bacteria-and-Viruses-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>Gum disease bacteria can reach the heart, causing damage that raises AFib risk. Good oral hygiene may help protect heart health. Tempted to skip flossing? It might not be worth the risk. A new study from Hiroshima University (HU) has found that the gum disease bacterium Porphyromonas gingivalis (P. gingivalis) can enter the bloodstream and [...]"
    ],
    "image_url": "",
    "titles": [
      "This Common Oral Bacterium Can Invade Your Heart"
    ],
    "summary": "A study by Hiroshima University revealed that the bacterium Porphyromonas gingivalis, responsible for gum disease, can travel from the mouth to the heart. This migration can cause damage that increases the risk of atrial fibrillation (AFib), a common heart rhythm disorder. The research emphasizes the importance of maintaining good oral hygiene, including regular flossing, to protect heart health.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it provides useful information about the connection between oral hygiene and heart health, emphasizing the importance of maintaining good oral hygiene. However, it lacks progress in terms of solutions or improvements.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.747,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.5,
    "normalized_score": 8.02
  },
  {
    "title": "USC Scientists Unveil 5-in-1 Blood Test for Early Alzheimer’s Detection",
    "domain": "science",
    "location": "global",
    "published": "Wed, 28 May 2025 21:29:58 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/usc-scientists-unveil-5-in-1-blood-test-for-early-alzheimers-detection/\" rel=\"nofollow\" title=\"USC Scientists Unveil 5-in-1 Blood Test for Early Alzheimer’s Detection\"><img alt=\"Science Lab Blood Red Liquid Test Tubes\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Science-Lab-Blood-Red-Liquid-Test-Tubes-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>In a proof-of-concept study, the test successfully identified five critical biomarkers associated with Alzheimer’s disease, exceeding the capabilities of currently available commercial blood tests. Researchers at the Keck School of Medicine of USC have created a&#160; new blood test that could make it easier to detect Alzheimer’s disease early. This innovative tool, called the Penta-Plex [...]"
    ],
    "image_url": "",
    "titles": [
      "USC Scientists Unveil 5-in-1 Blood Test for Early Alzheimer’s Detection"
    ],
    "summary": "Scientists at the Keck School of Medicine of USC have developed a new blood test, termed the Penta-Plex, capable of identifying five key biomarkers for Alzheimer's disease. This proof-of-concept study showcases the test's potential to surpass existing commercial blood tests in early detection of the disease, aiming to facilitate easier and more effective diagnosis.",
    "constructiveness_score": 1.0,
    "constructiveness_reason": "This story is highly constructive. It informs readers about a new development in Alzheimer's detection, which is a solution to a problem. It provides actionable insights and increases awareness about the disease and its early detection.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.742,
      "consensus": 0.2,
      "constructiveness": 1.0
    },
    "score": 0.518,
    "normalized_score": 9.5
  },
  {
    "title": "Brain Reset: One Molecular Switch Could Silence Alzheimer’s and Parkinson’s",
    "domain": "science",
    "location": "global",
    "published": "Wed, 28 May 2025 21:04:58 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/brain-reset-one-molecular-switch-could-silence-alzheimers-and-parkinsons/\" rel=\"nofollow\" title=\"Brain Reset: One Molecular Switch Could Silence Alzheimer’s and Parkinson’s\"><img alt=\"Brain Switch On\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Brain-Switch-On-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>A scientist has discovered a biochemical &#8220;master switch&#8221; that connects and potentially cures Alzheimer&#8217;s and Parkinson’s. His theory may revolutionize brain disease treatment and sustainable medicine. At the upcoming Sustainability Through Science and Technology Summit 2025 (SIPS 2025), Nobel Laureate Prof. Aaron Ciechanover will be honored in a special event taking place in Cebu, Philippines, [...]"
    ],
    "image_url": "",
    "titles": [
      "Brain Reset: One Molecular Switch Could Silence Alzheimer’s and Parkinson’s"
    ],
    "summary": "A scientist has identified a biochemical \"master switch\" that could link and possibly treat Alzheimer's and Parkinson's diseases. This discovery has the potential to transform the treatment of brain diseases and advance sustainable medicine. Nobel Laureate Prof. Aaron Ciechanover will be recognized for this groundbreaking work at the Sustainability Through Science and Technology Summit 2025 (SIPS 2025) in Cebu, Philippines.",
    "constructiveness_score": 1.0,
    "constructiveness_reason": "This story is very constructive as it highlights a significant innovation in the treatment of Alzheimer's and Parkinson's diseases. It provides a deeper understanding of the diseases and the potential for treatment, empowering readers with knowledge.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.736,
      "consensus": 0.2,
      "constructiveness": 1.0
    },
    "score": 0.524,
    "normalized_score": 10.0
  },
  {
    "title": "We’re about to unlock the secrets of ancient human brains",
    "domain": "science",
    "location": "global",
    "published": "Wed, 28 May 2025 20:00:42 +0100",
    "source": "New Scientist",
    "sources": [
      "New Scientist"
    ],
    "snippets": [
      "For the first time, we have a method for extracting proteins from preserved soft tissues like brains – which could be a treasure trove of evolutionary information"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/05/27133011/SEI_253312812.jpg",
    "titles": [
      "We’re about to unlock the secrets of ancient human brains"
    ],
    "summary": "Scientists have developed a new method to extract proteins from preserved soft tissues, such as brains, for the first time. This breakthrough could significantly enhance our understanding of evolutionary processes by providing access to a rich source of genetic information previously inaccessible.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it reports on a scientific innovation that can potentially enhance our understanding of human evolution. It provides useful knowledge about a new method in scientific research and highlights progress in the field of evolutionary studies.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.707,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.506,
    "normalized_score": 8.51
  },
  {
    "title": "Massive glacier collapse triggers landslide that buries Swiss village",
    "domain": "science",
    "location": "global",
    "published": "Wed, 28 May 2025 19:08:04 +0100",
    "source": "New Scientist",
    "sources": [
      "New Scientist"
    ],
    "snippets": [
      "Villagers in Blatten, Switzerland, were evacuated earlier this month after authorities warned a nearby glacier was on the brink of collapse – one of many becoming less stable as global temperature rise"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/05/28180039/SEI_253445449.jpg",
    "titles": [
      "Massive glacier collapse triggers landslide that buries Swiss village"
    ],
    "summary": "Residents of Blatten, Switzerland, were evacuated earlier this month due to the imminent risk of a nearby glacier collapsing, highlighting the increasing instability of glaciers worldwide as a result of rising global temperatures.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story raises awareness about the impacts of climate change, specifically on glacier instability and its potential threats to human settlements. However, it does not provide actionable insights or report on potential solutions to the problem, which limits its constructiveness.",
    "score_components": {
      "magnitude": 0.439,
      "recency": 0.695,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.484,
    "normalized_score": 6.69
  }
]