[
  {
    "title": "Who will win the US-China trade war?",
    "domain": "general",
    "location": "global",
    "published": "Wed, 16 Apr 2025 20:31:10 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "US-China trade war escalates with huge stakes for the economies of both nations and the rest of the world."
    ],
    "image_url": "",
    "summary": "The US-China trade war has intensified, significantly impacting both countries' economies and having widespread effects globally. This escalation marks a critical juncture in international trade relations, with substantial implications for global economic stability and growth.",
    "titles": [
      "Who will win the US-China trade war?"
    ],
    "score_components": {
      "magnitude": 0.22,
      "recency": 0.989,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.46325000000000005,
    "normalized_score": 9.07
  },
  {
    "title": "Nvidia shares plunge amid $5.5bn hit over export rules to China",
    "domain": "general",
    "location": "global",
    "published": "Wed, 16 Apr 2025 20:27:49 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The chip manufacturing giant will require licences to export its H20 AI chip to China."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/6dc7/live/021993c0-1a4d-11f0-b6de-656b207d7440.jpg",
    "summary": "The chip manufacturing company has announced that it will now need licenses to export its H20 AI chip to China. This regulatory change signifies a shift in how the company's technology is accessed by Chinese markets, impacting the distribution and sale of the H20 AI chip in China.",
    "titles": [
      "Nvidia shares plunge amid $5.5bn hit over export rules to China"
    ],
    "score_components": {
      "magnitude": 0.22,
      "recency": 0.988,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.46299999999999997,
    "normalized_score": 9.06
  },
  {
    "title": "Israeli troops will remain in Gaza 'security zones' after war, minister says",
    "domain": "general",
    "location": "global",
    "published": "Wed, 16 Apr 2025 18:23:49 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Israel Katz said Israel would continue its six-week blockade of all supplies, despite the UN warning of \"devastating\" consequences."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/6af4/live/a8f65990-1ae7-11f0-84fd-f389f3c61043.jpg",
    "summary": "Israel's official, Israel Katz, confirmed the country will maintain its six-week blockade, halting all supplies, despite the United Nations' warnings that this action could lead to \"devastating\" consequences.",
    "titles": [
      "Israeli troops will remain in Gaza 'security zones' after war, minister says"
    ],
    "score_components": {
      "magnitude": 0.24,
      "recency": 0.96,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.46199999999999997,
    "normalized_score": 9.02
  },
  {
    "title": "Israel says its troops will remain in Gaza, Lebanon and Syria indefinitely",
    "domain": "general",
    "location": "global",
    "published": "Wed, 16 Apr 2025 17:41:17 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Defence minister says army &#039;will remain in the security zones as a buffer between the enemy and [Israeli] communities&#039;."
    ],
    "image_url": "",
    "summary": "The Israeli Defence Minister announced that the army will continue its presence in the security zones to serve as a buffer between Israeli communities and perceived threats. This decision underscores the government's commitment to maintaining security and protecting its citizens from potential dangers.",
    "titles": [
      "Israel says its troops will remain in Gaza, Lebanon and Syria indefinitely"
    ],
    "score_components": {
      "magnitude": 0.24,
      "recency": 0.95,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.4595,
    "normalized_score": 8.9
  },
  {
    "title": "US judge says Trump administration could be in contempt over deportation flights",
    "domain": "general",
    "location": "global",
    "published": "Wed, 16 Apr 2025 19:04:09 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The US government is accused of \"wilful disregard\" of a ruling blocking the deportation of 200 individuals to El Salvador."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/b692/live/e3b07270-1ae5-11f0-84fd-f389f3c61043.jpg",
    "summary": "The US government has been accused of ignoring a court ruling that halted the deportation of 200 people to El Salvador. This action is being described as a \"willful disregard\" of the judicial order, indicating a significant legal and procedural controversy surrounding the treatment of these individuals. The current status of the deportations in light of the accusation remains a focal point of concern.",
    "titles": [
      "US judge says Trump administration could be in contempt over deportation flights"
    ],
    "score_components": {
      "magnitude": 0.22,
      "recency": 0.969,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.45825000000000005,
    "normalized_score": 8.84
  },
  {
    "title": "David Ford or Luke Clanton? Breaking down the 2 favorites for the 2025 Haskins Award",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 16 Apr 2025 21:00:43 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "David Ford and Luke Clanton have been the best players in college golf this season. Who's the favorite for the Haskins Award?"
    ],
    "image_url": "",
    "summary": "David Ford and Luke Clanton have emerged as the top players in this season's college golf, positioning themselves as leading contenders for the Haskins Award. The award, which honors the most outstanding college golfer, has both athletes in a tight race for the top spot, reflecting their exceptional performance throughout the season. The current status does not declare a definitive favorite between them.",
    "titles": [
      "David Ford or Luke Clanton? Breaking down the 2 favorites for the 2025 Haskins Award"
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.996,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.379,
    "normalized_score": 5.22
  },
  {
    "title": "Wiffen wins third gold but misses out on record",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 16 Apr 2025 20:43:34 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Daniel Wiffen's wins his third gold medal of the week at the Irish Open Swimming Championships in the 1500m freestyle but misses out on a new world record."
    ],
    "image_url": "",
    "summary": "Daniel Wiffen secured his third gold medal at the Irish Open Swimming Championships by winning the 1500m freestyle event. Despite his victory, Wiffen did not break the world record in this race.",
    "titles": [
      "Wiffen wins third gold but misses out on record"
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.992,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.378,
    "normalized_score": 5.17
  },
  {
    "title": "WWE WrestleMania 41 start time, date: Where to watch and when the massive event begins this weekend",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 16 Apr 2025 18:02:28 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The annual spectacle is sure to deliver another amazing show in Las Vegas on Saturday and Sunday"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/04/16/1f4f766a-e17b-4318-a767-62e881791b5e/john-cena-lights.jpg",
    "summary": "The annual event in Las Vegas, happening on Saturday and Sunday, is anticipated to provide another impressive spectacle.",
    "titles": [
      "WWE WrestleMania 41 start time, date: Where to watch and when the massive event begins this weekend"
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.955,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.36875,
    "normalized_score": 4.75
  },
  {
    "title": "Former FC Cincinnati forward Aaron Boupendza dies after 11th-floor fall in China",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 16 Apr 2025 20:53:49 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Former FC Cincinnati forward Aaron Boupendza died after falling from the 11th floor of a building in China, the Gabonese Football Federation announced Wednesday. He was 28."
    ],
    "image_url": "",
    "summary": "Aaron Boupendza, a 28-year-old former forward for FC Cincinnati, tragically passed away after falling from the 11th floor of a building in China, as confirmed by the Gabonese Football Federation on Wednesday.",
    "titles": [
      "Former FC Cincinnati forward Aaron Boupendza dies after 11th-floor fall in China"
    ],
    "score_components": {
      "magnitude": 0.12,
      "recency": 0.994,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.35450000000000004,
    "normalized_score": 4.1
  },
  {
    "title": "Jaivian Thomas become's Cal's fifth RB to enter the portal this week",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 16 Apr 2025 20:52:13 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The junior joins fellow running back Jaydn Ott as the Bears' biggest names to enter the portal this week."
    ],
    "image_url": "",
    "summary": "This week, a junior running back joined Jaydn Ott in entering the transfer portal, making them the most notable players from the Bears to do so recently.",
    "titles": [
      "Jaivian Thomas become's Cal's fifth RB to enter the portal this week"
    ],
    "score_components": {
      "magnitude": 0.12,
      "recency": 0.994,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.35450000000000004,
    "normalized_score": 4.1
  },
  {
    "title": "Why Gold Prices Surged to a Record High on Wednesday",
    "domain": "business",
    "location": "global",
    "published": "Wed, 16 Apr 2025 19:25:53 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "<figure><img alt=\"Sven Hoppe / picture alliance via Getty Images\" src=\"https://www.investopedia.com/thmb/jjQ57KlhjTW3_fvd8TfMZUfQocM=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2207845141-d616f0ac732a4fbaa1c7981b72ec7a3b.jpg\" title=\"A man places a gold bar in a safe deposit box.\" /><figcaption><i><p>Sven Hoppe / picture alliance via Getty Images</p></i></figcaption></figure><br /><h3>Key Takeaways</h3><ul><li>Gold futures rose to a record high of more than $3,350 an ounce on Wednesday as stocks sold off after chip giant Nvidia warned its earnings would take a $5 billion hit from escalating tensions between the U.S. and China.</li><li>Gold prices have soared more than 25% so far this year, boosted by uncertainty about President Trump's tariff policies and the economic damage they could inflict.</li><li>Analysts with the World Gold Council believe central banks and investors are likely to continue driving up the price of gold as geopolitical tensions persist.</li></ul><br /><br /><p>Gold prices rose to another record high on Wednesday as <a href=\"https://www.investopedia.com/dow-jones-today-04162025-11716170\">stocks tumbled</a> after AI chip giant Nvidia warned its earnings would take a $5 billion hit from escalating tensions between the U.S. and China. </p><p>Gold futures contracts were up more than 3% at a record high of about $3,350 an ounce on Wednesday afternoon. </p><p>Gold prices have soared more than 25% since the start of the year as investors have flocked to <a href=\"https://www.investopedia.com/terms/s/safe-haven.asp\">safe havens</a> amid mounting uncertainty about tariffs and their economic fallout. <a href=\"https://www.investopedia.com/gold-and-gold-mining-etfs-8431193\">Gold ETFs</a> recorded net inflows every week but one in the first quarter, with demand jumping to its highest level since 2022 in late February and again in late March.<span class=\"ql-inline-citation\"></span></p><p>President Trump’s announcement earlier this month of <a href=\"https://www.investopedia.com/trump-imposes-sweeping-reciprocal-tariffs-11707935\">sweeping “reciprocal” tariffs</a> may push demand even higher in April. In the week after Trump’s tariff announcement, 49% of fund managers surveyed by Bank of America labeled “long gold” Wall Street’s most crowded trade. It was the first BofA Global Fund Manager Survey in two years in which “long <a href=\"https://www.investopedia.com/magnificent-seven-stocks-8402262\">Magnificent Seven</a>” wasn’t thought to be the most popular trade. The preponderance of fund managers (42%) think gold will be the best-performing asset of 2025.<span class=\"ql-inline-citation\"></span></p><p>“The case for adding gold allocations has become more compelling than ever in this environment of escalating tariff uncertainty, weaker growth, higher inflation, geopolitical risks &amp; diversification away from US assets &amp; the US$,” wrote UBS analysts in a note on Monday.<span class=\"ql-inline-citation\"></span></p><p>\"We acknowledge the poor historical operational/cost performance of gold miners but remain bullish gold equities,\" the analysts continued. Shares of Newmont (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;NEM\">NEM</a>) and Barrick Gold (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;GOLD\">GOLD</a>) both followed gold prices higher on Wednesday.<br /></p><h2>Can the Rally Keep Going?</h2><p>There are several reasons to expect the recent run-up to persist, according to the World Gold Council, a gold miner trade association.</p><p>First of all, central banks have been <a href=\"https://www.investopedia.com/gold-shines-so-far-in-2024-as-central-banks-invest-heavily-8672711\">key drivers of demand</a> for gold over the past few years, and researchers don’t expect them to let up soon. Investors are also historically underexposed, with gold ETFs accounting for just 1.6% of the value of all U.S. ETFs, compared with 7.6% in 2011—the peak of a rally comparable to today’s. Plus, geopolitical and economic uncertainty are likely to remain elevated as the end of the White House’s <a href=\"https://www.investopedia.com/trump-issues-90-day-pause-on-widespread-reciprocal-tariffs-11712133\">90-day tariff pause</a> approaches.<span class=\"ql-inline-citation\"></span></p><p>Risks to the rally include the possibility that soaring prices slow demand from investors and central banks, or that a liquidity crisis—of which the analysts see increasing risk—could force investors to sell gold to cover <a href=\"https://www.investopedia.com/terms/m/margincall.asp\">margin calls</a>. The resolution of trade tensions through bilateral agreements could also reignite investors’ risk appetite and act as a headwind to gold. </p>"
    ],
    "image_url": "https://www.investopedia.com/thmb/jjQ57KlhjTW3_fvd8TfMZUfQocM=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2207845141-d616f0ac732a4fbaa1c7981b72ec7a3b.jpg",
    "summary": "Gold futures reached a record high of over $3,350 an ounce, driven by a more than 25% price increase this year due to escalating U.S.-China tensions and concerns over President Trump's tariff policies. The surge is attributed to investors seeking safe havens amidst economic uncertainty, with gold ETFs experiencing significant inflows. Analysts from the World Gold Council and UBS suggest that central bank purchases and geopolitical risks will continue to support gold's rise. However, they also caution that high prices could dampen demand or a liquidity crisis could pressure investors to sell, p",
    "titles": [
      "Why Gold Prices Surged to a Record High on Wednesday"
    ],
    "score_components": {
      "magnitude": 0.3,
      "recency": 0.974,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.48350000000000004,
    "normalized_score": 10.0
  },
  {
    "title": "Fed Chair Powell Emphasizes Inflation Risks Of Trump Trade War",
    "domain": "business",
    "location": "global",
    "published": "Wed, 16 Apr 2025 19:31:10 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "<figure><img alt=\"\" src=\"https://www.investopedia.com/thmb/nOSFPUItWyqjW3BGXMWxh5cPrlA=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2209986446-e4c9da74407048baaed42d775a1ee6ed.jpg\" title=\"US Federal Reserve Chair Jerome Powell speaks at the Economic Club of Chicago in Chicago, Illinois, on April 16, 2025.\" /></figure><br /><h3>Key Takeaways</h3><ul><li>Federal Reserve Chair Jerome Powell expects President Donald Trump's tariff campaign to push inflation, the central banker said in a Wednesday speech.<br /></li><li>Powell emphasized the inflation risks and said the Fed would not necessarily step in to help financial markets with lower interest rates if stocks plummeted.<br /></li><li>The tariffs threaten to slow the economy while pushing up inflation, putting the Fed in a difficult position since its monetary policy tools can only help with one of those problems at a time.<br /></li></ul><br /><br /><p>The Federal Reserve appears to be bracing for a fresh surge of inflation from President Donald Trump's campaign of tariffs.<br /><br />In a speech to the Economic Club of Chicago Wednesday, Fed Chair Jerome Powell said officials at the central bank expect <a href=\"https://www.investopedia.com/tariff-tracker-where-do-president-trump-trade-proposals-stand-11702803\">the import taxes Trump imposed </a>this month to push up the cost of living and are determined not to let that bout of price increases turn into a prolonged period of inflation.<br /><br />\"The tariffs are larger than forecasters had expected, certainly larger than we expected, even in our upside case,\" Powell said.<br /><br />Powell's remarks shed light on the Fed's possible response to the rapidly changing trade war. Powell said trade policy could be a setback to both sides of the Fed's \"<a class=\"recommendation-inline-link\" href=\"https://www.investopedia.com/articles/investing/100715/breaking-down-federal-reserves-dual-mandate.asp\">dual mandate</a>\" to keep inflation under control and joblessness in check. Powell suggested the Fed wasn't ready to jump in to boost financial markets and the economy by cutting interest rates—at least not yet.</p><h2>Fed Is Unlikely To Cut Its Influential Interest Rate</h2><p>Powell echoed the <a href=\"https://www.investopedia.com/fed-officials-are-bracing-for-higher-inflation-slower-growth-from-tariffs-11714034\">recent comments of other Fed officials</a>, saying the tariff war could pose a \"challenging\" scenario by slowing down the economy while pushing up prices.</p><p>The Fed's main tool for managing the economy is raising or lowering the <a class=\"recommendation-inline-link\" href=\"https://www.investopedia.com/terms/f/federalfundsrate.asp\">federal funds rate</a>, which influences borrowing costs on all kinds of loans. A higher fed funds rate means more costly loans, and a slower economy, reducing inflation pressures. A lower fed funds rate means easy money and a boost to the job market.<br /><br />The Fed has been keeping the rate high in recent years to combat the post-pandemic surge of inflation, and Powell's remarks indicated the Fed would be reluctant to cut rates even if financial markets took a dive.<br /><br />When asked whether the Fed would step in with rate cuts if markets plunged, Powell said, \"No, with an explanation\"—markets were functioning in an orderly fashion and predictably responding to the uncertainty surrounding the <a href=\"https://www.investopedia.com/economists-see-few-winners-in-us-china-trade-war-11715135\">rapidly changing tariff policies</a>.</p><h2>Powell Reluctant To Look Through Price Increases</h2><p>A <a class=\"recommendation-inline-link\" href=\"https://www.investopedia.com/terms/t/tariff.asp\">tariff</a> is, in theory, a one-time price increase, whereas <a class=\"recommendation-inline-link\" href=\"https://www.investopedia.com/terms/i/inflation.asp\">inflation</a> is, by definition, a sustained increase in prices.</p><p>By that logic, central bank doctrine dictates the Fed should \"look through\" tariff-driven price increases and not necessarily raise interest rates or keep them high in response. However, Powell said the central bank's experience during the pandemic challenged that logic.</p><p>For example, he said, disruptions in the supply of computer chips affected car prices, which were a major reason overall inflation surged in 2022. He said the Fed was determined not to let that happen again.<br /><br />\"Our role is to make sure that this is a one-time increase in prices and not something that turns into an ongoing inflation process,\" he said.<br /></p>"
    ],
    "image_url": "https://www.investopedia.com/thmb/nOSFPUItWyqjW3BGXMWxh5cPrlA=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2209986446-e4c9da74407048baaed42d775a1ee6ed.jpg",
    "summary": "Federal Reserve Chair Jerome Powell, in a speech at the Economic Club of Chicago, stated that President Donald Trump's tariff policies are expected to increase inflation but clarified that the Fed would not cut interest rates to counteract any potential stock market declines caused by these tariffs. Powell highlighted the challenge tariffs pose to the Fed's dual mandate of controlling inflation and maintaining employment, as tariffs could slow the economy while raising prices. Despite the potential for a challenging scenario, Powell indicated the Fed's reluctance to lower interest rates in res",
    "titles": [
      "Fed Chair Powell Emphasizes Inflation Risks Of Trump Trade War"
    ],
    "score_components": {
      "magnitude": 0.26,
      "recency": 0.975,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.47175,
    "normalized_score": 9.46
  },
  {
    "title": "Trump tariffs put Fed’s jobs and inflation goals at risk, Powell says",
    "domain": "business",
    "location": "global",
    "published": "Wed, 16 Apr 2025 18:28:10 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "US central bank chair says ‘without price stability, we cannot achieve long periods of strong labour market conditions’"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F502c2066-76f3-4c63-91b1-6869bf295623.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "summary": "The US central bank chair emphasized the importance of price stability, stating it is essential for achieving sustained periods of strong labor market conditions. This statement underscores the central bank's focus on controlling inflation to ensure economic stability and growth.",
    "titles": [
      "Trump tariffs put Fed’s jobs and inflation goals at risk, Powell says"
    ],
    "score_components": {
      "magnitude": 0.26,
      "recency": 0.961,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.46824999999999994,
    "normalized_score": 9.3
  },
  {
    "title": "S&P 500 Gains and Losses Today: Chip Stocks Drop as Top Firms Cite Export Restriction Effects",
    "domain": "business",
    "location": "global",
    "published": "Wed, 16 Apr 2025 20:45:57 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "<figure><img alt=\"Spencer Platt/Getty Images\" src=\"https://www.investopedia.com/thmb/zEI4qoPXZmIa2qYQUyEEHHD5QlE=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2209794197-ecf0f56363bd48159669c5063581f6c4.jpg\" title=\"Traders work on the floor of the New York Stock Exchange (NYSE) on April 11, 2025 in New York City. \" /><figcaption><i><p>Spencer Platt/Getty Images</p></i></figcaption></figure><br /><h3>Key Takeaways</h3><ul><li>The S&amp;P 500 lost 2.2% on Wednesday, April 16, as the Federal Reserve chair discussed possible inflationary and economic consequences of tariffs.</li><li>Semiconductor stocks dropped as major AI players Nvidia and AMD anticipated charges related to restrictions on chip exports to China.</li><li>Oil prices partially recovered from recent declines, helping lift numerous stocks in the oil and gas sector.</li></ul><br /><br /><p>Major U.S. equities indexes tumbled Wednesday.</p><p>Federal Reserve Chair Jerome Powell told the Economic Club of Chicago that changes in U.S. trade policy could <a href=\"https://www.investopedia.com/federal-reserve-chair-jerome-powell-emphasizes-inflation-risks-of-trump-tariffs-trade-war-11716687\">pressure growth and boost inflation</a>. Noting declines in business and consumer sentiment, Powell suggested the Fed is poised to await more visibility on possible tariff impacts before modifying interest rates.</p><p>The S&amp;P 500 ended the session 2.2% lower, while the Dow declined 1.7%. Tech sector underperformance weighed on the Nasdaq, which fell 3.1%.<br /></p><p>Shares of J.B. Hunt Transport Services (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;jbht\">JBHT</a>) skidded 7.7%, falling the furthest of any S&amp;P 500 stock, following the logistics company's earnings release. Although first-quarter sales and profits edged out expectations, executives noted that tariffs were weighing on demand as customers attempt to gauge the potential impact on their supply chains and overall businesses. J.B. Hunt stressed that it is evaluating options to reduce its costs as it navigates these challenges.</p><p>The top executive from marketing and corporate communications firm Omnicom (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;omc\">OMC</a>) reaffirmed plans to move forward with the acquisition of advertising giant Interpublic Group (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;ipg\">IPG</a>), pushing back against claims that the deal could result in client losses. However, shares of both companies dropped more than 7% on Wednesday.</p><p>Semiconductor stocks dropped after chip giants Nvidia (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;nvda\">NVDA</a>) and Advanced Micro Devices (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;amd\">AMD</a>) said they <a href=\"https://www.investopedia.com/nvidia-amd-and-other-chip-stocks-fall-as-trump-curbs-exports-to-china-11716186\">expect to take significant charges</a> related to export restrictions imposed by the Trump administration. Nvidia anticipates a <a href=\"https://www.investopedia.com/nvidia-to-record-usd5-5b-charge-as-us-cracks-down-on-chip-exports-to-china-11716119\">$5.5 billion hit</a> in its fiscal first-quarter results. In comparison, AMD foresees a charge of up to $800 million. Reports said that Nvidia's H20, AMD's MI308, and other equivalent chips will need export licenses to be sold to Chinese firms. AMD shares plunged 7.4%, while Nvidia shares lost 6.9%.<br /></p><p>Palantir Technologies (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;pltr\">PLTR</a>) shares declined 5.8% on Wednesday, reversing some of the strong gains notched this week after the data analytics firm struck a <a href=\"https://www.investopedia.com/palantir-stock-extends-gains-after-nato-deal-11715614\">deal with the North Atlantic Treaty Organization (NATO)</a> for the deployment of Palantir's artificial intelligence (AI) military system. Shares of other enterprise software providers also lost ground amid broad pressure in the tech sector following Powell's comments about tariffs and their possible inflationary impact.</p><p>Crude oil futures prices moved higher after the U.S. government announced sanctions on Chinese importers of oil from Iran, increasing concerns about global supply. The uncertain outlook for the global economy has pressured the commodity's price this month, and the bounce back helped lift oil and gas stocks. Shares of exploration and production company APA Corp. (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;apa\">APA</a>) led the way, with a gain of 3.2%, marking Wednesday's top performance in the S&amp;P 500. </p><p>Abbott Laboratories (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;abt\">ABT</a>) shares jumped 2.8% after the maker of medical devices and other health care products reported <a href=\"https://www.investopedia.com/abbott-labs-stock-jumps-on-strong-earnings-with-usd500m-investment-in-us-facilities-11716349\">better-than-expected first-quarter sales and profits</a>. The company also reaffirmed its full-year earnings per share (EPS) guidance. It announced plans to invest $500 million in two manufacturing and research and development (R&amp;D) facilities in Texas and Illinois that are set to open this year.</p><p>Gold prices surged to <a href=\"https://www.investopedia.com/why-gold-prices-surged-to-a-record-high-on-wednesday-11716665\">another record high</a> as the precious metal's safe-haven appeal remains solid in the tense geopolitical environment. Shares of Newmont (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;nem\">NEM</a>), the world's largest gold producer, advanced 2.6%.<br /></p>"
    ],
    "image_url": "https://www.investopedia.com/thmb/zEI4qoPXZmIa2qYQUyEEHHD5QlE=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2209794197-ecf0f56363bd48159669c5063581f6c4.jpg",
    "summary": "On April 16, 2025, the S&P 500 dropped 2.2%, influenced by Federal Reserve Chair Jerome Powell's remarks on the potential economic risks of tariffs, leading to declines across major U.S. equity indexes. Semiconductor stocks, including Nvidia and AMD, fell sharply due to anticipated charges from export restrictions to China, with Nvidia expecting a $5.5 billion hit and AMD up to $800 million. Oil prices saw a partial recovery, boosting stocks in the oil and gas sector, while gold prices reached a new high, underscoring its status as a safe-haven asset. Additionally, shares of J.B. Hunt and Omni",
    "titles": [
      "S&P 500 Gains and Losses Today: Chip Stocks Drop as Top Firms Cite Export Restriction Effects"
    ],
    "score_components": {
      "magnitude": 0.22,
      "recency": 0.993,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.46425000000000005,
    "normalized_score": 9.12
  },
  {
    "title": "Tech stocks sink after Nvidia reveals hit from US curbs on sales to China",
    "domain": "business",
    "location": "global",
    "published": "Wed, 16 Apr 2025 20:01:21 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Chipmaker leads declines as Wall Street sell-off reignites"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F43442058-b3ca-4ac8-8160-0d893fdac444.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "summary": "A leading chipmaker was at the forefront of a renewed sell-off on Wall Street, contributing significantly to the market's downturn. This event marks a notable decline in stock values, impacting the broader financial landscape.",
    "titles": [
      "Tech stocks sink after Nvidia reveals hit from US curbs on sales to China"
    ],
    "score_components": {
      "magnitude": 0.22,
      "recency": 0.982,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.4615,
    "normalized_score": 8.99
  },
  {
    "title": "Exoplanet found in odd perpendicular orbit to brown dwarf star pair",
    "domain": "science",
    "location": "global",
    "published": "Wed, 16 Apr 2025 20:00:10 +0100",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "It is rare to find brown dwarf stars orbiting in pairs, and this pair has an even more unusual exoplanet companion"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/04/16174045/SEI_247755554.jpg",
    "summary": "Astronomers have discovered a rare pair of brown dwarf stars that are orbited by an even more unusual exoplanet. This finding is significant because brown dwarfs, often referred to as \"failed stars\" due to their inability to sustain nuclear fusion like true stars, seldom form in pairs. The presence of an exoplanet within this unique duo adds an additional layer of rarity to the discovery.",
    "titles": [
      "Exoplanet found in odd perpendicular orbit to brown dwarf star pair"
    ],
    "score_components": {
      "magnitude": 0.22,
      "recency": 0.968,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.45799999999999996,
    "normalized_score": 8.83
  },
  {
    "title": "Vegan diets have good levels of key amino acids, but there's a catch",
    "domain": "science",
    "location": "global",
    "published": "Wed, 16 Apr 2025 20:00:52 +0100",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "It is harder for our bodies to absorb key nutrients from plant-based foods, so some vegans may be short on essential amino acids for healthy muscles and bones despite eating plenty of protein"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/04/16154304/SEI_247530823.jpg",
    "summary": "Research indicates that the human body may find it more challenging to absorb essential amino acids from plant-based proteins compared to animal sources. Consequently, vegans, despite consuming adequate amounts of protein, might still face deficiencies in these critical nutrients necessary for muscle and bone health.",
    "titles": [
      "Vegan diets have good levels of key amino acids, but there's a catch"
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.968,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.45199999999999996,
    "normalized_score": 8.56
  },
  {
    "title": "Iron Age site was a purple dye factory for centuries",
    "domain": "science",
    "location": "global",
    "published": "Wed, 16 Apr 2025 20:00:43 +0100",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Beginning around 3000 years ago, Tel Shiqmona in modern-day Israel was a major centre for the production of Tyrian purple, a valuable commodity produced from marine snails"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/04/16120414/SEI_247626048.jpg",
    "summary": "Tel Shiqmona, located in present-day Israel, emerged as a significant hub for Tyrian purple production around 3000 years ago. This valuable dye, derived from marine snails, was a key commodity during that period.",
    "titles": [
      "Iron Age site was a purple dye factory for centuries"
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.968,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.45199999999999996,
    "normalized_score": 8.56
  },
  {
    "title": "Ancient humans may have faced radiation risk 41,000 years ago",
    "domain": "science",
    "location": "global",
    "published": "Wed, 16 Apr 2025 20:00:23 +0100",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A weakening of Earth’s magnetic field known as the Laschamps event would have increased the threat of solar radiation, perhaps requiring ancient humans to invent protective measures"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/04/16142836/SEI_247736922.jpg",
    "summary": "The Laschamps event, a period of weakened Earth's magnetic field, likely heightened the risk of solar radiation for ancient humans. This scenario may have prompted them to develop protective measures against increased solar radiation exposure.",
    "titles": [
      "Ancient humans may have faced radiation risk 41,000 years ago"
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.968,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.45199999999999996,
    "normalized_score": 8.56
  },
  {
    "title": "The race to visit the asteroid making the closest pass by Earth",
    "domain": "science",
    "location": "global",
    "published": "Wed, 16 Apr 2025 19:00:16 +0100",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Space agencies from the US, Europe and Japan are all making plans to visit the asteroid Apophis when it makes an extremely close flyby in 2029 to learn how to deflect others like it"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/04/16155921/SEI_247621091.jpg",
    "summary": "Space agencies from the US, Europe, and Japan are preparing missions to study the asteroid Apophis during its close approach to Earth in 2029. The objective is to gather data to develop strategies for deflecting potentially hazardous asteroids in the future.",
    "titles": [
      "The race to visit the asteroid making the closest pass by Earth"
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.954,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.4485,
    "normalized_score": 8.4
  }
]