[
  {
    "title": "Trump Signs Order Naming Antifa a Terrorist Group After Kirk's Killing",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-09-23T05:46:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Axios",
      "The Verge",
      "Forbes",
      "Deutsche Welle",
      "Financial Times",
      "The Guardian",
      "LA Times"
    ],
    "domains": [
      "www.latimes.com",
      "www.theguardian.com",
      "www.ft.com",
      "www.forbes.com",
      "www.theverge.com",
      "www.dw.com",
      "news.google.com"
    ],
    "snippets": [
      "According to Donald Trump's executive order, US authorities can act against \"any person claiming to act on behalf of Antifa.\" The order follows the assassination of conservative activist Charlie Kirk.",
      "<a href=\"https://news.google.com/rss/articles/CBMibkFVX3lxTE4wQ2RIS1FKb1RPTmREaVhXVTdmZVpaSFQyanVBNEp3c0M2eDBGMTBsRG8wS3ltWHEteEF1d0NZNHlSeGd0SG9hLWItNVBKWElOdWVDV251dzgxRy16VGF2enFKdkd0SXI1eTNhRHB3?oc=5\" target=\"_blank\">Trump designates antifa a \"domestic terrorist\" group</a>&nbsp;&nbsp;<font color",
      "Executive order allows US government to ‘investigate, disrupt, and dismantle any and all illegal operations’ by the group",
      "<p>This blog has closed. Read our latest story <a href=\"https://www.theguardian.com/us-news/2025/sep/22/trump-executive-order-antifa-terrorist-organization\">here</a></p><p>Per my last post, it’s important to underscore that <strong>autism has been a focus for Kennedy</strong>. Earlier this month, th",
      "<p>Executive order revives controversial pledge from Trump’s first presidency in wake of Charlie Kirk’s killing</p><p>Donald Trump signed an executive order on Monday that designates antifa as a “domestic terrorist organization”, reviving a controversial pledge from his first presidency in the wake ",
      "<p>Trump plans to classify the left-wing, anti-fascist movement as a terrorist organization, raising legal and ethical questions about how the U.S. can prosecute a movement.</p>",
      "The president vowed to sign the executive order against antifa in the wake of conservative activist Charlie Kirk’s assassination.",
      "The Trump administration’s crackdown on perceived left-wing threats following the death of Charlie Kirk continued on Monday evening, with Donald Trump announcing an executive order titled “Designating Antifa as a Domestic Terrorist Organization.” The order directs federal departments and agencies to"
    ],
    "image_url": "",
    "titles": [
      "Trump labels Antifa as 'domestic terrorist organization'",
      "Trump designates antifa a \"domestic terrorist\" group - Axios",
      "Trump designates ‘Antifa’ as domestic terrorist organisation",
      "Donald Trump signs order designating antifa as a domestic terror organization – as it happened",
      "Trump signs order designating antifa as a ‘domestic terrorist organization’",
      "Trump moves to declare antifa a domestic terrorist group",
      "Trump Administration Designates Antifa As Domestic Terrorist Organization",
      "Trump escalates crackdown by designating ‘Antifa’ a domestic terror group"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.95,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.84,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Following the assassination of conservative activist Charlie Kirk, President Donald Trump signed an executive order designating antifa as a \"domestic terrorist organization.\" This action revives a commitment from his first term and authorizes the U.S. government to investigate, disrupt, and dismantle any activities associated with the group deemed illegal. This move has raised legal and ethical concerns regarding the prosecution of a loosely defined movement.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Admin Links Acetaminophen to Autism, Faces Criticism",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 23 Sep 2025 07:35:14 GMT",
    "source": "BBC",
    "sources": [
      "Deutsche Welle",
      "CNBC",
      "The Guardian",
      "MarketWatch",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.cnbc.com",
      "www.theguardian.com",
      "www.marketwatch.com",
      "www.dw.com"
    ],
    "snippets": [
      "Some studies have suggested an association between the two, but experts say there is no causal relationship.",
      "Donald Trump said pregnant women must not take acetaminophen, as his government moved to link the drug to autism, contradicting medical consensus on its safety as a painkiller during pregnancy.",
      "Officials warned pregnant women against using acetaminophen unless they have a fever, and touted a lesser-known drug as a potential treatment for autism.",
      "<p>Doctors call president’s warning that pregnant women should limit use of acetaminophen – also known as paracetamol - ‘highly concerning’ and ‘irresponsible’</p><p>Medical experts are raising alarms after Donald Trump warned pregnant women to avoid taking Tylenol, baselessly linking the painkiller",
      "Shares of Kenvue Inc. sank to a record low Monday, as President Donald Trump warned women to avoid taking Kenvue’s Tylenol, the brand name for acetaminophen, during pregnancy because of a possible connection with autism for the children."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/fe63/live/e4bbecf0-9842-11f0-928c-71dbb8619e94.jpg",
    "titles": [
      "Trump makes unproven claims about paracetamol link with autism",
      "Trump pushes unproven claims linking Tylenol to autism",
      "Trump admin draws unproven link between autism and Tylenol ingredient use during pregnancy",
      "Experts alarmed as Trump pushes unproven link between Tylenol and autism",
      "Kenvue says Tylenol is safe, but stock hits record low as Trump makes unproven link to autism"
    ],
    "score_components": {
      "magnitude": 0.964,
      "recency": 0.966,
      "consensus": 0.995,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.839,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Trump administration claims a link between acetaminophen use during pregnancy and autism, advising against its use unless necessary and promoting leucovorin as a potential autism treatment. However, there's minimal credible scientific support for these assertions, with experts denying a causal relationship between acetaminophen and autism. The situation has sparked controversy, including criticism from Tylenol's manufacturer, Kenvue.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "\"Jimmy Kimmel Live!\" Resumes on ABC After Suspension Over Kirk Comments",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Mon, 22 Sep 2025 16:55:00 -0400",
    "source": "NPR",
    "sources": [
      "ABC News",
      "Business Insider",
      "Ars Technica",
      "Axios",
      "NPR",
      "Al Jazeera",
      "CityNews",
      "Deutsche Welle",
      "CNBC",
      "The Guardian"
    ],
    "domains": [
      "arstechnica.com",
      "ottawa.citynews.ca",
      "www.cnbc.com",
      "abcnews.go.com",
      "www.aljazeera.com",
      "www.theguardian.com",
      "www.businessinsider.com",
      "www.npr.org",
      "www.dw.com",
      "news.google.com"
    ],
    "snippets": [
      "The late night comic was suspended last week under pressure from the Trump administration after comments about Charlie Kirk's killing.",
      "Announcement comes nearly a week after the late-night host was controversially suspended for remarks about Charlie Kirk.",
      "\"Jimmy Kimmel Live!\" was hauled off American screens after the host made comments related to conservative activist Charlie Kirk, who was killed on September 10. The show is set to return on Tuesday.",
      "Jimmy Kimmel is set to return to the air Tuesday night on ABC, The Walt Disney Company said.",
      "ABC had pulled Kimmel's show after he made comments linking the alleged killer of conservative activist Charlie Kirk to President Donald Trump's MAGA movement.",
      "<p>Late-night host reinstated after brief suspension related to comments on Maga and Charlie Kirk that Disney called ‘insensitive’</p><p><a href=\"https://www.theguardian.com/tv-and-radio/jimmy-kimmel\">Jimmy Kimmel</a> is headed back to air.</p><p>Disney announced on Monday that Jimmy Kimmel Live! wo",
      "\"Jimmy Kimmel Live!\" will return to ABC on Tuesday after the late-night host's comments on Charlie Kirk's death caused the network to pull the show.",
      "ABC will reinstate Jimmy Kimmel’s late night show in the wake of criticism over his comments about the assassination of conservative activist Charlie Kirk, officials with the network said Monday. &#8220;We have spent the last days having thoughtful conversations with Jimmy, and after those conversat",
      "<a href=\"https://news.google.com/rss/articles/CBMibkFVX3lxTE9aRUxERGpVTU9EWjJVSDN6ZVdLRnplMFFxaDF6d0VqZThEZkN1OVN3ZXk1OU9fQllTUDQ4ZlBRQ0N0VXZwRUs0MWhBdklCTng3U1JQekY2MElwSEc4OVl0M1dISFVNT1JKQmZLLUpR?oc=5\" target=\"_blank\">Disney bringing Jimmy Kimmel back Tuesday</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">",
      "Disney says \"thoughtful conversations with Jimmy\" led to show's return.",
      "Sinclair, which owns ABC affiliate stations, said it would not be returning Jimmy Kimmel to the air on its stations after Disney's announcement."
    ],
    "image_url": "",
    "titles": [
      "Jimmy Kimmel will be back on air on Tuesday, Disney says",
      "Jimmy Kimmel’s show to return on Tuesday after Disney lifts suspension",
      "US: Jimmy Kimmel returns to late-night TV after suspension",
      "WATCH:  Jimmy Kimmel returns to ABC on Tuesday after suspension",
      "Disney says 'Jimmy Kimmel Live' will return to ABC on Tuesday",
      "Jimmy Kimmel will return to TV after highly criticized suspension",
      "Jimmy Kimmel is returning to ABC on Tuesday, Disney says",
      "ABC ends Jimmy Kimmel’s suspension and his show will return Tuesday",
      "Disney bringing Jimmy Kimmel back Tuesday - Axios",
      "Disney reinstates Jimmy Kimmel after backlash over capitulation to FCC",
      "Sinclair says it won't air Jimmy Kimmel on its stations after Disney announced his return"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.79,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.833,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "\"Jimmy Kimmel Live!\" will return to ABC on Tuesday after being pulled off the air due to comments the host made about the death of conservative activist Charlie Kirk, linking the alleged killer to President Trump's MAGA movement. The Walt Disney Company, ABC's parent company, announced the show's return following a brief suspension and \"thoughtful conversations with Jimmy.\" However, Sinclair, owning ABC affiliate stations, stated it would not air the show following Disney's decision.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Rockets' Fred VanVleet Tears ACL, May Miss 2025-26 Season",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 22 Sep 2025 16:03:57 EST",
    "source": "ESPN",
    "sources": [
      "Yahoo Sports",
      "ESPN",
      "Forbes",
      "Sportsnet",
      "Sports Illustrated",
      "CBS Sports"
    ],
    "domains": [
      "www.nbcsports.com",
      "www.cbssports.com",
      "www.espn.com",
      "www.sportsnet.ca",
      "www.forbes.com",
      "news.google.com"
    ],
    "snippets": [
      "Rockets star guard Fred VanVleet suffered a torn ACL during a recent workout and could potentially miss the entirety of the 2025-26 season, sources told ESPN.",
      "VanVleet recently signed a two-year, $50 million deal to remain in Houston",
      "This is a blow to the Rockets, who were counting on his steady hand at the point the glue for their team.",
      "Houston Rockets point guard Fred VanVleet has suffered an ACL tear according to ESPN’s Shams Charania. This injury puts his status for the 2025-26 NBA season in jeopardy.",
      "<a href=\"https://news.google.com/rss/articles/CBMijAFBVV95cUxNSEQyc2xQY2t0N25HV1FtbjE3Z19SRVEyU05fRnZQc3EwRGtFWEtLRGNZWnVsWGluOWpSanJYOHpzVGxBOF90MVliUGNyaDVrUVZtTHdQVjFYa2JCdmgxc2NHT000VC15Unl6YW1EbmNGMXgxRVhPNW5hb2FyUjlXblZadkc2QnluR21nQw?oc=5\" target=\"_blank\">Rockets Guard Fred VanVleet Suffers P",
      "<p>Rockets veteran guard Fred VanVleet has reportedly suffered a torn ACL and will potentially miss the 2025-26 season, according to ESPN&#8217;s Shams Charania.</p>"
    ],
    "image_url": "",
    "titles": [
      "Sources: VanVleet has torn ACL, may miss season",
      "Fred VanVleet injury: Rockets star suffers torn ACL, could miss entire 2025-26 season, per report",
      "Rockets' Fred VanVleet suffers torn ACL, could miss entire season",
      "Rockets Guard Fred VanVleet Reportedly Suffers ACL Tear",
      "Rockets Guard Fred VanVleet Suffers Possible Season-Ending Torn ACL - Sports Illustrated",
      "Report: Rockets’ Fred VanVleet suffers torn ACL"
    ],
    "score_components": {
      "magnitude": 0.986,
      "recency": 0.776,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.825,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Houston Rockets guard Fred VanVleet has torn his ACL during a workout, potentially sidelining him for the entire 2025-26 NBA season. This injury comes after he signed a two-year, $50 million contract to stay with the Rockets.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Copenhagen, Oslo Airports Reopen After Drone Disruptions Divert 35 Flights",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 23 Sep 2025 05:31:13 GMT",
    "source": "BBC",
    "sources": [
      "Al Jazeera",
      "Deutsche Welle",
      "The Guardian",
      "New York Times",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.aljazeera.com",
      "www.theguardian.com",
      "www.nytimes.com",
      "www.dw.com"
    ],
    "snippets": [
      "Both airports have been reopened, with Danish police unable to confirm origin of drones.",
      "The drone sightings near Danish and Norwegian airports come amid heightened concerns over Russia violating EU airspace.",
      "According to FlightRadar, some 35 flights were diverted from Denmark's principal airport. Police believe a \"capable operator\" is responsible. A drone incident was reported on the same evening at Oslo Airport in Norway.",
      "The closures disrupted dozens of flights, the authorities said. It was not immediately clear who was flying the drones.",
      "<p>Copenhagen airport closed for four hours after large drones seen in vicinity, while Oslo airport closed for three hours following two sightings</p><p><strong>Copenhagen police and Danish security and intelligence service, </strong>or PET,<strong> are now giving a press conference, </strong>report"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/a3b8/live/b82541c0-97f0-11f0-be9f-872dac3e9076.jpg",
    "titles": [
      "Copenhagen and Oslo airports forced to close temporarily due to drone sightings",
      "Drone sightings disrupt flights at Copenhagen, Oslo airports",
      "Copenhagen Airport reopens after being closed due to drones",
      "Drone Sightings Force Copenhagen and Oslo Airports to Close Temporarily",
      "Danish PM links drone sightings that closed Copenhagen and Oslo airports with recent European airspace violations – Europe live"
    ],
    "score_components": {
      "magnitude": 0.964,
      "recency": 0.925,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.821,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Copenhagen and Oslo airports were temporarily closed due to drone sightings, disrupting dozens of flights. Danish police have not confirmed the drones' origin, amid concerns over airspace violations. Copenhagen airport was shut for four hours and Oslo for three. Over 35 flights were diverted in Denmark. Authorities believe a skilled operator was behind the incidents, but the responsible party remains unidentified. Both airports have since reopened.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "France Recognizes Palestinian Statehood at U.N., Aligns with UK, Australia, Cana",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 23 Sep 2025 01:26:27 GMT",
    "source": "BBC",
    "sources": [
      "Axios",
      "Washington Post",
      "New York Times",
      "BBC"
    ],
    "domains": [
      "www.washingtonpost.com",
      "www.bbc.com",
      "www.nytimes.com",
      "news.google.com"
    ],
    "snippets": [
      "Donald Trump will address UN leaders on Tuesday, as more European countries look set to join the French policy change.",
      "<a href=\"https://news.google.com/rss/articles/CBMid0FVX3lxTE1ZSzF0Vkc1bWhZM1NiZEpxVlYyeGNuS3FWYU1BaUZ5d2ZkZE5TZEhHR0ZneEFaUk5BOXFJR3BlVGpZSVB3d3ZMZE9xNG1leGxKRUtrZTIzTDZqMTNRdkNVWDhrYWxpdGptMklFNnRUZXVOQVRZcDBB?oc=5\" target=\"_blank\">France is the latest country to formally recognize State of Palesti",
      "<a href=\"https://news.google.com/rss/articles/CBMiekFVX3lxTFBPZFN1QXgzNndRQ2tVQzI1MC1ITnBBSXVlcWlYcUcyQnpWX0xkMEpFNi1DaDJ6V041NjVraWM0TUpRSWNlNHVTZVJaU2FTRjV0X0stWXdWTERBSnJGZUJMcUUyVXN0ck9GNzNiczQ0Qzd4cGRfOVZkZVhR?oc=5\" target=\"_blank\">What countries recognize a Palestinian state in 2025?</a>&nbsp;",
      "France became the latest Western nation to formally recognize Palestinian sovereignty, which remains a largely symbolic gesture. It was followed by calls for Israel to end the war in Gaza and stop its expansion of West Bank settlements.",
      "At a meeting ahead of the U.N. General Assembly, France and other U.S. allies made official a breach with Washington that has been years in the making.",
      "Secretary of State Marco Rubio tried to kill France’s recognition of Palestinian statehood, publicly lambasting it as a “gift to Hamas” ahead of the U.N. summit in New York."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/8617/live/879fa280-9835-11f0-928c-71dbb8619e94.jpg",
    "titles": [
      "France becomes latest country to recognise Palestinian state",
      "France is the latest country to formally recognize State of Palestine - Axios",
      "What countries recognize a Palestinian state in 2025? - Axios",
      "France and Other Nations Recognize Palestinian Statehood at U.N. Summit",
      "World Leaders Recognize Palestinian State, in a Challenge to U.S. and Israel",
      "France defies Trump, recognizes Palestinian statehood despite U.S. pressure"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.85,
      "consensus": 0.908,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.789,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "At the U.N. General Assembly in New York, France, led by President Emmanuel Macron, formally recognized Palestinian statehood, joining the UK, Australia, and Canada in a move that diverges from U.S. policy. This recognition is part of a broader effort to revive the two-state solution and has been praised by Palestinians. The decision comes amidst calls for peace and an end to conflict in the region, with Macron stating \"the time for peace has come.\" This development marks a significant shift in international relations and increases pressure on Israel regarding its policies in Gaza and the West",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "keywords: development, effort, solution",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Admin Links Acetaminophen to Autism, Faces Criticism",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Tue, 23 Sep 2025 03:42:48 +0000",
    "source": "Al Jazeera",
    "sources": [
      "ABC News",
      "Al Jazeera",
      "Forbes",
      "Axios"
    ],
    "domains": [
      "www.aljazeera.com",
      "abcnews.go.com",
      "www.forbes.com",
      "news.google.com"
    ],
    "snippets": [
      "US leader&#039;s remarks on popular painkiller, known as paracetamol globally, prompt outcry from doctors and medical bodies.",
      "<a href=\"https://news.google.com/rss/articles/CBMigAFBVV95cUxQOWJtTFRQZzV0akxxbXJoLXgwWmNqbWdBTFhNUEpoRTVLdWVSUTluUXdhZU1wME0za2VGNWNBQm9xRWtFNFlTRFp4bS0yUUI1ZVFWd3JZa3NFYTRlTDVYN3p4c1JwdUl2Z0V1WVcyZFBVQkloMnF6UXN6d1pQd0c3cQ?oc=5\" target=\"_blank\">Trump links autism to Tylenol, urges pregnant women n",
      "The Trump administration stated on Monday that the use of an over-the-counter pain medication during pregnancy may be linked to autism.",
      "The administration will reportedly also identify leucovorin, a drug used to treat cancer and anemia, as a potential treatment for autism."
    ],
    "image_url": "",
    "titles": [
      "Trump urges pregnant women to avoid Tylenol over unproven autism risk",
      "Trump links autism to Tylenol, urges pregnant women not to take it - Axios",
      "Trump admin links Tylenol use in pregnancy to increased risk of autism",
      "Trump Ties Tylenol During Pregnancy To Autism: ‘Don’t Take It’"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.91,
      "consensus": 0.908,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.788,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Trump administration claims a link between acetaminophen use during pregnancy and autism, advising against its use unless necessary and promoting leucovorin as a potential autism treatment. However, there's minimal credible scientific support for these assertions, with experts denying a causal relationship between acetaminophen and autism. The situation has sparked controversy, including criticism from Tylenol's manufacturer, Kenvue.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Supreme Court Allows Trump to Dismiss FTC's Slaughter Pending Review",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Mon, 22 Sep 2025 15:49:45 -0400",
    "source": "NPR",
    "sources": [
      "CNBC",
      "NPR",
      "Al Jazeera",
      "Axios"
    ],
    "domains": [
      "www.npr.org",
      "www.aljazeera.com",
      "www.cnbc.com",
      "news.google.com"
    ],
    "snippets": [
      "At issue is whether the president has the authority to dismiss the heads of those agencies that are protected by Congress.",
      "Decision means Rebecca Slaughter remains barred from her post at the Federal Trade Commission for the time being.",
      "<a href=\"https://news.google.com/rss/articles/CBMiggFBVV95cUxPNUpYUlV3ejlreVlOdFBGV1R3d0lLaU9OS2t2QzVQMmw2U1JKOWRMNjk3Q2VMdFgxUFo5MUU4ajA1eWMxWGlhZkNCQVY0dWlrSlJDR0pFcDdQUFh3RmdvcFFVVDJXUFZYUUoxTTRaNWowcjZfbTJTdk9LTlYwTks3anpB?oc=5\" target=\"_blank\">Supreme Court lets Trump fire FTC official as it we",
      "The Supreme Court allowed President Donald Trump to remove Rebecca Slaughter as a member of the Federal Trade Commission while the justices consider her case."
    ],
    "image_url": "",
    "titles": [
      "Supreme Court allows Trump to fire -- for now -- remaining Democrat on FTC",
      "US Supreme Court to consider whether Trump may fire Democratic FTC member",
      "Supreme Court lets Trump fire FTC official as it weighs president's power over agencies - Axios",
      "Supreme Court lets Trump fire FTC's Slaughter for now"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.772,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.776,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Supreme Court has permitted President Donald Trump to dismiss Rebecca Slaughter from her position at the Federal Trade Commission. This decision is pending as the justices deliberate on whether the president has the authority to remove heads of agencies protected by Congress. Consequently, Slaughter is currently barred from her post.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "British-Egyptian Activist Alaa Abd el-Fattah Released After Sentence Commuted",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Tue, 23 Sep 2025 04:11:31 +0000",
    "source": "Al Jazeera",
    "sources": [
      "The Guardian",
      "Al Jazeera",
      "Washington Post",
      "Deutsche Welle"
    ],
    "domains": [
      "www.theguardian.com",
      "www.aljazeera.com",
      "www.dw.com",
      "www.washingtonpost.com"
    ],
    "snippets": [
      "Alaa Abd El-Fattah is considered to be among the most high-profile political prisoners held in Egypt&#039;s prisons.",
      "Prominent British-Egyptian democracy advocate Alaa Abd el-Fattah has been freed after years of detention. His release follows a petition from Egypt’s human rights council and increased international pressure.",
      "<p>Writer, who has served six years for sharing a Facebook post, was given a presidential pardon</p><p>The British-Egyptian human rights activist Alaa Abd el-Fattah has been released from jail after serving six years for sharing a Facebook post.</p><p>Egypt’s president, Abdel Fatah al-Sisi, granted ",
      "Abdel Fattah was a symbol of the 2011 uprising but was arrested two years later. He has since spent almost all of the past 12 years behind bars."
    ],
    "image_url": "",
    "titles": [
      "Egyptian-British activist Alaa Abd El-Fattah freed after Sisi pardon",
      "Egypt pardons jailed activist Alaa Abd el-Fattah",
      "British-Egyptian activist Alaa Abd el-Fattah freed from prison",
      "Arab Spring activist Alaa Abdel Fattah released after pardon from Egypt’s Sisi"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.919,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.773,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "British-Egyptian activist Alaa Abd el-Fattah, arrested in 2019 and sentenced in 2021 to five years for \"spreading false news,\" has been released. His freedom comes after President Abdul Fattah al-Sisi commuted his sentence along with five others, following a petition from Egypt’s human rights council and international advocacy. Abd el-Fattah, known for his role in the 2011 uprising, spent nearly 12 years in detention.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Jimmy Kimmel's Show to Resume Tuesday After Disney Suspension",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 23 Sep 2025 00:41:17 GMT",
    "source": "BBC",
    "sources": [
      "The Verge",
      "Financial Times",
      "Forbes",
      "BBC"
    ],
    "domains": [
      "www.theverge.com",
      "www.bbc.com",
      "www.forbes.com",
      "www.ft.com"
    ],
    "snippets": [
      "The late-night comic's show will return to air after Disney said it had \"thoughtful coversations\" with him.",
      "Disney subsidiary ABC said last week the show would be cancelled indefinitely following comments Kimmel made about Trump supporters and conservative activist Charlie Kirk.",
      "Jimmy Kimmel’s late-night talk show is returning on Tuesday after Disney pulled it off the air over comments made about the assassination of Charlie Kirk. In a statement on Monday, Disney said it planned to resume production after having “thoughtful conversations” with Kimmel. &#8220;Last Wednesday,",
      "Company says comments on Charlie Kirk killing were ‘insensitive’ but broadcast is to resume after talks with host"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/6a8f/live/3a2c90b0-97fb-11f0-be80-2974137b337f.jpg",
    "titles": [
      "Jimmy Kimmel show to return after suspension over Charlie Kirk comments",
      "‘Jimmy Kimmel Live!’ Will Return Tuesday Following Charlie Kirk Controversy—But Not On Sinclair-Owned Stations",
      "Jimmy Kimmel’s show will return after censorship outrage",
      "Disney to return Kimmel’s show to airwaves after brief suspension"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.837,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.757,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Jimmy Kimmel's late-night show will return to air on Tuesday after being temporarily pulled by Disney due to his comments about the assassination of Charlie Kirk. Disney described the comments as 'insensitive' but decided to resume the show following \"thoughtful conversations\" with Kimmel.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Dembélé Wins First Ballon d'Or, Bonmati Secures Women's Award",
    "domain": "sports",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Tue, 23 Sep 2025 00:42:05 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Sky Sports",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.aljazeera.com",
      "www.skysports.com"
    ],
    "snippets": [
      "Ousmane Dembele helped Paris Saint-Germain to a quadruple last season, including their first Champions League.",
      "Watch the moment Ousmane Dembele and Aitana Bonmati won the Ballon d'Or",
      "Ousmane Dembele and Aitana Bonmati were crowned the best men's and women's player in the world at the 2025 Ballon d'Or ceremony in Paris.",
      "<p>After securing a domestic treble and a pair of continental trophies, Ousmane Dembele will have to find room for yet another piece of distinguished hardware on his mantle. </p>"
    ],
    "image_url": "",
    "titles": [
      "PSG’s Dembele beats Barca’s Yamal to Ballon d’Or, as Bonmati nets hat-trick",
      "The moment Dembele and Bonmati won the Ballon d'Or!",
      "Dembele, Bonmati win Ballon d'Or awards - and Gyokeres honoured",
      "PSG’s Ousmane Dembele, Barcelona’s Aitana Bonmati win Ballon d’Or awards"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.855,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.708,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Ousmane Dembélé, Paris Saint-Germain forward, won the 2025 Ballon d'Or, marking his first win of the award for the world's best player. His victory came after a successful season highlighted by Champions League success and a domestic treble. Aitana Bonmati won the women's award at the same ceremony in Paris.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Nvidia Partners with OpenAI, Commits $100 Billion to AI Advancements",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Mon, 22 Sep 2025 17:42:55 GMT",
    "source": "Axios",
    "sources": [
      "TechCrunch",
      "Business Insider",
      "Axios"
    ],
    "domains": [
      "www.businessinsider.com",
      "techcrunch.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMidkFVX3lxTE1ody1RblVBeDlaT2VoNlB1R1pFUEZqVUxCZWNyOFFzUDcxZHNfWUlaRlF4dF9TRHFPQklGdndiak40bXVaMlA1aE1NeFBQTUJEWnFxdVhRYVJkbkR0TVhWa1lycXlyUFp2ZDJ6X2JRcHc2X1ptOVE?oc=5\" target=\"_blank\">Nvidia to invest up to $100B in ChatGPT creator OpenAI</a>&nbsp;&nbs",
      "$100 billion is worth something like 333 AI researchers with Meta salaries.",
      "OpenAI and Nvidia agreed to deploy 10 gigawatts' worth AI chips to power the next generation of ChatGPT."
    ],
    "image_url": "",
    "titles": [
      "Nvidia to invest up to $100B in ChatGPT creator OpenAI - Axios",
      "Nvidia plans to invest $100 billion into OpenAI. That's uh, a lot of money.",
      "Nvidia plans to invest up to $100B in OpenAI"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.724,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.699,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Nvidia has announced a partnership with OpenAI, agreeing to supply high-performance chips for OpenAI's data centers and invest up to $100 billion in the AI startup. This collaboration aims to significantly expand data center capabilities for artificial intelligence advancements. The deal includes OpenAI purchasing chips from Nvidia and a substantial investment by Nvidia into OpenAI, highlighting a major commitment to the future of AI technology.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: collaboration",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "USA vs Europe at Ryder Cup: McIlroy's Best Moments Highlighted",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 22 Sep 2025 20:56:53 EST",
    "source": "ESPN",
    "sources": [
      "Sky Sports",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.skysports.com"
    ],
    "snippets": [
      "Team USA and Europe will meet at Bethpage Black for Ryder Cup bragging rights. We're breaking down every player competing in this year's tournament.",
      "As we build up to the Ryder Cup at Bethpage, take a look at Rory McIlroy's best shots from his seven appearances in the competition."
    ],
    "image_url": "",
    "titles": [
      "Ranking every player in the 2025 Ryder Cup, from Scheffler to McIlroy to Højgaard",
      "The best of Rory McIlroy at the Ryder Cup!"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.859,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.652,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Team USA and Europe are set to compete at Bethpage Black for the Ryder Cup. The tournament will feature a detailed analysis of each player participating. Additionally, highlights of Rory McIlroy's top moments from his seven Ryder Cup appearances will be showcased as part of the event's buildup.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Tony Jacklin Spurs Ryder Cup Transformation, Boosts European Success",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 23 Sep 2025 06:31:13 GMT",
    "source": "BBC",
    "sources": [
      "Yahoo Sports",
      "BBC"
    ],
    "domains": [
      "www.bbc.com"
    ],
    "snippets": [
      "The Ryder Cup was dying after decades of US dominance. Then Tony Jacklin became captain and sparked an era of European glory - this is how he did it.",
      "The Ryder Cup was dying after decades of US dominance. Then Tony Jacklin became captain and sparked an era of European glory - this is how he did it."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/8460/live/5b234230-9848-11f0-858a-a904eacbef23.jpg",
    "titles": [
      "Forty years on, how Jacklin resurrected Ryder Cup",
      "Forty years on, how Jacklin resurrected Ryder Cup"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.945,
      "consensus": 0.571,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.639,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Tony Jacklin revitalized the Ryder Cup, transforming it from a competition dominated by the US into an era of European success. As captain, he inspired significant changes that led to a more competitive and engaging tournament.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "49ers' Nick Bosa Out for Season with Torn ACL After Cardinals Game",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 22 Sep 2025 14:32:43 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "49ers Pro Bowl defensive end Nick Bosa tore his right ACL during Sunday's 16-15 victory against the Cardinals at Levi's Stadium, and he will need season-ending surgery.",
      "<p>The San Francisco 49ers&#8217; injury woes have gone from bad to worse.</p>"
    ],
    "image_url": "",
    "titles": [
      "49ers DE Bosa out for season with torn right ACL",
      "Report: 49ers DE Nick Bosa suffers season-ending torn ACL"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.752,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.63,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "San Francisco 49ers Pro Bowl defensive end Nick Bosa suffered a torn right ACL during a 16-15 victory against the Cardinals at Levi's Stadium, necessitating season-ending surgery. This injury adds to the 49ers' growing list of setbacks this season.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Resolution Foundation Proposes Tax Shift to Ease Worker Strain",
    "domain": "business",
    "source_domain": "www.ft.com",
    "location": "global",
    "published": "Mon, 22 Sep 2025 23:01:05 GMT",
    "source": "Financial Times",
    "sources": [
      "The Guardian",
      "Financial Times"
    ],
    "domains": [
      "www.theguardian.com",
      "www.ft.com"
    ],
    "snippets": [
      "Resolution Foundation suggests chancellor should cut employee national insurance to ease burden on workers",
      "<p>Resolution Foundation says move could raise additional £6bn a year and ‘level the playing field’ on income tax</p><p>Rachel Reeves has been urged to take 2p off the rate of employee national insurance and add it to income tax in her autumn budget, to raise billions of pounds while protecting work"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F5860e2c7-4358-4422-8bfb-e10f45ec309e.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Reeves urged to break Labour manifesto pledge and raise income tax",
      "Reeves urged to take 2p off employee NI and add it to income tax in budget"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.808,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.624,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Resolution Foundation has recommended that the chancellor reduce employee national insurance by 2p and shift this to income tax in the upcoming autumn budget. This adjustment is projected to generate an extra £6bn annually, aiming to alleviate the financial strain on workers and create a more balanced approach to taxation.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Meta Launches AI Dating Assistant and \"Meet Cute\" Feature on Facebook Dating",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-09-22T14:59:59-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge",
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com",
      "www.theverge.com"
    ],
    "snippets": [
      "Facebook Dating is getting new AI features to help users avoid “swipe fatigue,” Meta announced today. The new features include a new “dating assistant” AI chatbot that helps you find potential matches as well as a new “Meet Cute” feature that automatically matches you with someone using a “personali",
      "Facebook Dating's AI assistant is supposed to help users build their profiles and find the matches they're looking for."
    ],
    "image_url": "",
    "titles": [
      "Facebook Dating tries using AI to end ‘swipe fatigue’",
      "Facebook is getting an AI dating assistant"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.759,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.624,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Meta introduced new AI features to Facebook Dating, including a \"dating assistant\" chatbot and a \"Meet Cute\" feature for automatic matching based on personality, aiming to reduce \"swipe fatigue\" among users. These updates are designed to assist in profile creation and improve match-finding efficiency.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: improve",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Cowboys Face Injury Crisis Ahead of Packers Game",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Mon, 22 Sep 2025 23:23:08 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.cbssports.com"
    ],
    "snippets": [
      "Dallas' injuries on offense continue to mount ahead of a Week 4 showdown with Micah Parsons and the Packers",
      "<p>Fresh off a loss to the Chicago Bears, the Dallas Cowboys will have to keep their heads above water without the help of their superstar receiver for the foreseeable future. </p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/22/8eeb591d-bd26-4e57-9db7-358a8b7be905/tyler-booker-dallas-cowboys.jpg",
    "titles": [
      "Tyler Booker injury: Cowboys guard expected to miss 4-6 weeks with high ankle sprain",
      "Cowboys’ CeeDee Lamb suffers ankle sprain, could miss 3-4 weeks"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.831,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.621,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Dallas Cowboys are facing significant injury challenges on their offense as they prepare for a Week 4 game against the Packers, following a recent loss to the Chicago Bears. The team will be without their superstar receiver for an unspecified period, adding to their difficulties.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Pietrangelo Eyes Return to Golden Knights After Hip Injury, Aims to Avoid Surger",
    "domain": "sports",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Mon, 22 Sep 2025 22:20:59 GMT",
    "source": "NHL",
    "sources": [
      "NHL",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMilgFBVV95cUxObWxXMjNZcmlVVUFrT1BUUW1LZmpidm9xRHlQSHd0bldrVlRLajFSWjR5U1RWcUFaYmZ5Rzk5d0hCMDBjTWtFSVdhTnB1a2hSUW4wX3hmc2lQNTMyeDdreHo1R1J2aDgwR3AzeWxFUjEtNVdJNjhjcnl1SXFIa195cmtQcVljQV9ld3dGOF9CdHphOG53bFE?oc=5\" target=\"_blank\">Pietrangelo won’t rule o",
      "<p>After announcing he would be stepping away from hockey for somDefenseman Alex Pietrangelo has not ruled out playing again for the Golden Knights — even this season — hoping to avoid surgery as he goes through rehabilitation on his injured hip.e time, Alex Pietrangelo isn&#8217;t ruling out a retu"
    ],
    "image_url": "",
    "titles": [
      "Pietrangelo won’t rule out playing for Golden Knights this season - NHL.com",
      "Golden Knights’ Pietrangelo rehabbing hip, doesn’t rule out playing this season"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.797,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.621,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Defenseman Alex Pietrangelo, after announcing a break from hockey due to a hip injury, has not dismissed the possibility of returning to play for the Golden Knights within the same season. He hopes to avoid surgery through rehabilitation.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Jayden Daniels' Game Status Uncertain Due to Injury",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Mon, 22 Sep 2025 20:24:43 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sports Illustrated"
    ],
    "domains": [
      "www.cbssports.com",
      "news.google.com"
    ],
    "snippets": [
      "Daniels' status for Sunday's game is very much up in the air",
      "<a href=\"https://news.google.com/rss/articles/CBMijAFBVV95cUxQeVZOOTBtb2lYT3UzN1BCNWZXYjhfV1Y4NXFRVS1janQ4Y0tLSnh2Y1dGMGp3VDhCYTlzRXNXWldSRW9YZWkxNEo4SlY3S0RKdldoS3NrTmw4bTJ3NTZ3emhIeUstU2o2WlhHdXhMalJDTklzZl9DNnZ0V1k1QUFHMVRkQ0NiM3FyWDEycg?oc=5\" target=\"_blank\">Jayden Daniels Injury: Dan Quinn Prov"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/22/430d2b62-5923-4816-9dce-1c7f86e17428/danielscommanders.jpg",
    "titles": [
      "Jayden Daniels injury: Commanders QB remains day-to-day with knee sprain",
      "Jayden Daniels Injury: Dan Quinn Provides Update on Status of Commanders' QB - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.782,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.618,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Arizona State quarterback Jayden Daniels' availability for Sunday's game remains uncertain due to an injury. Daniels' status is currently up in the air, with no definitive update provided. The team is closely monitoring his condition to determine if he will be able to play.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Apple Stock Rises on New iPhone, Watch, and AirPods Launch",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Mon, 22 Sep 2025 20:00:20 GMT",
    "source": "CNBC",
    "sources": [
      "MarketWatch",
      "CNBC"
    ],
    "domains": [
      "www.marketwatch.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "Apple's stock has turned green for the year after the company released new iPhone, Apple Watch, and AirPods models on Friday.",
      "Strong early demand for the new iPhone is fueling a rally in Apple’s stock, but some analysts are seeing mixed signals for the pricier models."
    ],
    "image_url": "",
    "titles": [
      "Apple's stock turns positive for the year after iPhone 17 launch",
      "Apple’s stock surges to a 2025 high on hot iPhone 17 demand. Can the rally continue?"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.759,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.614,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Apple's stock has become positive for the year following the release of new iPhone, Apple Watch, and AirPods models. The surge in Apple’s stock is attributed to high early demand for the new iPhone, although analysts have given mixed reviews about the demand for the more expensive models.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Hollywood Stars Back Kimmel in ACLU Letter Amid NYC Mayoral Event Row",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Mon, 22 Sep 2025 19:14:04 GMT",
    "source": "CNBC",
    "sources": [
      "The Guardian",
      "CNBC"
    ],
    "domains": [
      "www.theguardian.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "A slew of Academy Award winners and other Hollywood celebrities signed a letter organized by the ACLU backing Jimmy Kimmel.",
      "<p>New York mayoral candidate had withdrawn from WABC event in protest at network’s suspension of talkshow host</p><p><a href=\"https://www.theguardian.com/us-news/zohran-mamdani\">Zohran Mamdani</a>, the New York Democratic mayoral candidate, said on Monday evening he was willing to appear at a town "
    ],
    "image_url": "",
    "titles": [
      "NYC mayor candidate Mamdani withdraws from ABC town hall over Jimmy Kimmel suspension",
      "Zohran Mamdani agrees to ABC town hall after Kimmel reinstated"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.747,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.614,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A group of Academy Award winners and Hollywood celebrities supported Jimmy Kimmel by signing an ACLU-organized letter. This came after New York Democratic mayoral candidate Zohran Mamdani withdrew from a WABC event, protesting the network's suspension of Kimmel. Mamdani later stated he was open to participating in the town hall, indicating a partial resolution to the protest.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Judge Allows Restart of Revolution Wind Project Off Rhode Island",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Mon, 22 Sep 2025 19:45:47 GMT",
    "source": "Axios",
    "sources": [
      "CNBC",
      "Axios"
    ],
    "domains": [
      "www.cnbc.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMigAFBVV95cUxPMVhvc3lxczRPTnpPc3dtMFZ5TzZ3enMtdzh5Q2FYcmFSeWx6ZDNlOWwySlVVRjhGaWJqOVFFUC1JNmNOTXJ6SnN2ak9QSERMeUMxQmlNdmFueVRRVkVLaDVXS2U4b3R1WGpTcE5Fd0FrSGxCb3U4RUdWV1VPMjRtYQ?oc=5\" target=\"_blank\">Trump-stalled offshore wind project can restart, judg",
      "The Interior Department had ordered Orsted on Aug. 22 to halt construction on Revolution Wind off the coast of Rhode Island and Connecticut."
    ],
    "image_url": "",
    "titles": [
      "Trump-stalled offshore wind project can restart, judge says - Axios",
      "Trump's order to halt offshore wind project overturned, Orsted to restart work soon"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.755,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.606,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A judge has ruled that the offshore wind project, Revolution Wind, which had been halted by the Interior Department on August 22, can now restart. This project, located off the coast of Rhode Island and Connecticut, had faced delays due to Trump administration policies.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Christian Horner Leaves Red Bull with £80m Settlement, Can Return to F1",
    "domain": "business",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Mon, 22 Sep 2025 17:51:17 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "Forbes"
    ],
    "domains": [
      "www.theguardian.com",
      "www.forbes.com"
    ],
    "snippets": [
      "<ul><li><p>Former team principal was sacked in July</p></li><li><p>Agreement allows 51-year-old to return to F1 next season</p></li></ul><p>Christian Horner has formally left the Red Bull Formula One team with what is understood to be an £80m settlement after <a href=\"https://www.theguardian.com/spo",
      "Christian Horner has officially left Red Bull after reaching a $100 million settlement agreement that will allow him to return to Formula 1."
    ],
    "image_url": "https://i.guim.co.uk/img/media/708201f3e6792860687a714d3b89d8c4431c2b9c/196_0_2080_1664/master/2080.jpg?width=140&quality=85&auto=format&fit=max&s=d84f94ffa62f12553fe07556a4e4c40d",
    "titles": [
      "Christian Horner formally leaves Red Bull team with £80m payoff",
      "Christian Horner Now Free To Return To F1 After $100 Million Red Bull Settlement"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.726,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.6,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Christian Horner has departed from Red Bull following his sacking in July, with an £80m settlement. The agreement permits the 51-year-old to make a return to Formula 1 next season.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Nvidia CEO Supports $100K H-1B Visa Fee, Diverse Industry Reactions Emerge",
    "domain": "business",
    "source_domain": "www.businessinsider.com",
    "location": "global",
    "published": "2025-09-23T03:48:19Z",
    "source": "Business Insider",
    "sources": [
      "Business Insider"
    ],
    "domains": [
      "www.businessinsider.com"
    ],
    "snippets": [
      "Business leaders such as Nvidia CEO Jensen Huang and \"Shark Tank\" star Kevin O'Leary have weighed in on the $100,000 H-1B visa fee.",
      "Nvidia CEO Jensen Huang and OpenAI CEO Sam Altman reacted to the new H-1B visa fee on Monday, with Huang expressing direct support for Trump."
    ],
    "image_url": "https://i.insider.com/68d20670183847aa39d743bd?format=jpeg",
    "titles": [
      "Business leaders including Jensen Huang, Sam Altman, and Reed Hastings, react to Trump's H-1B visa fee",
      "Jensen Huang and Sam Altman react to new H-1B $100K fee"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.912,
      "consensus": 0.35,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.46,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Business leaders, including Nvidia CEO Jensen Huang and \"Shark Tank\" star Kevin O'Leary, have shared their views on the proposed $100,000 H-1B visa fee. Specifically, Huang has shown support for the fee, aligning with Trump's stance, while other industry figures like OpenAI CEO Sam Altman have also reacted. The responses from these leaders highlight the varied perspectives within the tech and business communities regarding this significant policy proposal.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "TechCrunch Disrupt 2025: Hudson, Chan, Gil to Discuss Investing Insights",
    "domain": "technology",
    "source_domain": "techcrunch.com",
    "location": "global",
    "published": "Mon, 22 Sep 2025 19:15:00 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com"
    ],
    "snippets": [
      "At TechCrunch Disrupt 2025, Charles Hudson (Precursor Ventures) and Wesley Chan (FPV Ventures) break down what early-stage investors really look for in founders — from narrative and resilience to red flags and common mistakes. Don’t miss this candid Builders Stage conversation. Register by September",
      "Elad Gil shares his approach to early-stage investing, frontier tech, and spotting breakout potential at TechCrunch Disrupt 2025 (Oct 27–29, Moscone West, SF). Register before Sept 26 to save up to $668."
    ],
    "image_url": "",
    "titles": [
      "What Early-Stage Investors Really Look for in Founders at TechCrunch Disrupt 2025",
      "Inside the mind of Elad Gil: Early-stage investing and next-gen innovation at TechCrunch Disrupt 2025"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.763,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.421,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "At TechCrunch Disrupt 2025, investors Charles Hudson and Wesley Chan will discuss what they seek in founders, covering narrative, resilience, red flags, and common mistakes. Concurrently, Elad Gil will share insights on early-stage investing and identifying potential in frontier tech. The event is scheduled for Oct 27–29 at Moscone West, SF, with a registration discount available until Sept 26.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "New Bass and \"Ghost\" Marsupial Species Discovered",
    "domain": "science",
    "source_domain": "scitechdaily.com",
    "location": "global",
    "published": "Mon, 22 Sep 2025 13:39:38 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "scitechdaily.com"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/scientists-discover-two-new-bass-species-hiding-in-plain-sight/\" rel=\"nofollow\" title=\"Scientists Discover Two New Bass Species Hiding in Plain Sight\"><img alt=\"Altamaha Bass\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"583\" src=\"https://scitechdaily.com/im",
      "<a href=\"https://scitechdaily.com/scientists-discover-new-ghost-species-of-marsupial-closely-related-to-the-kangaroo/\" rel=\"nofollow\" title=\"Scientists Discover New “Ghost” Species of Marsupial, Closely Related to the Kangaroo\"><img alt=\"Woylie Illustration\" class=\"webfeedsFeaturedVisual wp-post-ima"
    ],
    "image_url": "",
    "titles": [
      "Scientists Discover Two New Bass Species Hiding in Plain Sight",
      "Scientists Discover New “Ghost” Species of Marsupial, Closely Related to the Kangaroo"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.679,
      "consensus": 0.35,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.414,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Scientists have identified two new bass species previously unrecognized and a new \"ghost\" species of marsupial closely related to kangaroos. These discoveries, made through genetic analysis and field observations, highlight the ongoing diversity in both aquatic and terrestrial ecosystems. The findings, published in separate studies, expand our understanding of species diversity and underscore the importance of conservation efforts for these newly identified animals.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  }
]