[
  {
    "title": "Thomas Frank Leaves Brentford for Tottenham After Nearly 7 Years",
    "domain": "general",
    "location": "global",
    "published": "Sat, 14 Jun 2025 07:00:44 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "<p>Across nearly seven years, Frank achieved great things. His switch to Spurs feels like a break-up but we wish him well</p><p>Don’t cry because it’s over, smile because it happened. <a href=\"https://www.theguardian.com/football/2025/jun/12/tottenham-confirm-appointment-thomas-frank-new-manager\">Thomas Frank is no longer Brentford’s manager</a> and that’s not easy to write. We knew the day was drawing near but it’s still a bitter pill to swallow. It feels like a break-up, a one-sided one where we do not get the chance to ask why and how. And the grief supporters are experiencing is because..."
    ],
    "image_url": "https://i.guim.co.uk/img/media/471e9ada0bec6b5dfb819457c3f44d33cdb6670e/193_0_4311_3448/master/4311.jpg?width=140&quality=85&auto=format&fit=max&s=e97dbb64a68041d8127fbdcacdb9b9db",
    "titles": [
      "Thomas Frank gave Brentford fans so much for so long – we will truly miss him | Natalie Sawyer"
    ],
    "summary": "Thomas Frank has left his position as Brentford's manager after nearly seven years to join Tottenham Hotspur. His departure is described as difficult for fans, akin to a break-up. Frank's achievements at Brentford are acknowledged, and while there is sadness over his exit, there is also a sense of gratitude for his tenure.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story provides basic awareness about a significant event in the football world, but it doesn't offer much depth or insight into the reasons behind the decision or the potential impacts on both teams.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.976,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.407
  },
  {
    "title": "ChatGPT's Finance Advice Evaluated by Experts",
    "domain": "general",
    "location": "global",
    "published": "Sat, 14 Jun 2025 07:00:43 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "<p>We asked a chatbot some common finance questions – and then ran its responses past human experts</p><p>Artificial intelligence seems to have touched every part of our lives. But can it help us manage our money? We put some common personal finance questions to the free version of ChatGPT, one of the most well-known AI chatbots, and asked for&nbsp;its help.</p><p>Then we gave the answers to some – human – experts and asked them what they thought.</p> <a href=\"https://www.theguardian.com/technology/2025/jun/14/ai-can-chatgpt-manage-money-chatbot\">Continue reading...</a>"
    ],
    "image_url": "https://i.guim.co.uk/img/media/614e25f4ce71d89c01784b66f6419fe4ed407927/0_0_5000_4000/master/5000.jpg?width=140&quality=85&auto=format&fit=max&s=51d1abbca4e917ffb5d71bf1e6bf9ec8",
    "titles": [
      "Hey AI! Can ChatGPT help you to manage your money?"
    ],
    "summary": "A test was conducted to evaluate the effectiveness of ChatGPT, a popular AI chatbot, in managing personal finance queries. Common finance questions were posed to ChatGPT, and its responses were then reviewed by human financial experts for accuracy and reliability. The outcome of this evaluation has not been explicitly stated in the provided content.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story informs readers about an important evaluation of an AI system's capabilities in the financial sector. However, it doesn't provide the results of the evaluation, which would have given readers more actionable insights or a deeper understanding.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.976,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.437
  },
  {
    "title": "Documentary Explores Harry & Meghan's Finances, Including Netflix Deal",
    "domain": "general",
    "location": "global",
    "published": "Sat, 14 Jun 2025 07:00:43 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "<p>An exploration of the financial affairs of Harry Windsor and Meghan Markle. Plus, a shameful and seldom-told story from the aftermath of the second world war. Here’s what to watch tonight</p><p><strong>8.30pm, Channel 5 <br /></strong>The Sussex Squad may have largely disappeared from British public life, but they still seem to arouse tabloid fury. Hence, this unnecessary documentary on the exiled couple’s financial affairs. The sources of their wealth don’t seem too mysterious: inheritance, a massive Netflix deal and a payout from the publishers representing the Sun newspaper won’t have..."
    ],
    "image_url": "https://i.guim.co.uk/img/media/d96b75c576986615f172f42f433e7dff8a17494f/653_0_4000_3200/master/4000.jpg?width=140&quality=85&auto=format&fit=max&s=5199acbf75c892734f3cc635061d92dd",
    "titles": [
      "TV tonight: the Sussex Squad’s finances go under the microscope in Meghan & Harry - Where Did the Money Go?"
    ],
    "summary": "A documentary airing at 8:30 pm on Channel 5 delves into the financial affairs of Harry Windsor and Meghan Markle, highlighting their income sources such as inheritance, a significant Netflix deal, and a payout from publishers representing the Sun newspaper. The program is noted for sparking tabloid attention despite the couple's reduced presence in British public life, suggesting a continued public and media fascination with their financial status.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "The story offers basic awareness about a documentary that explores the finances of Harry and Meghan. However, it lacks depth or insight and seems to focus more on the sensational aspect of their financial status rather than providing useful or empowering knowledge to the reader.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.976,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.387
  },
  {
    "title": "Violence in Northern Ireland Forces Foreign Families to Flee",
    "domain": "general",
    "location": "global",
    "published": "Sat, 14 Jun 2025 07:00:42 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "<p>Northern Ireland faces stark questions over the racism, xenophobia and intolerance that has forced families from abroad to flee</p><p>First came the shouts as the crowd worked its way through narrow terraced streets, proclaiming its mission to rid the town of “scum”. Then came the shattered glass as rocks exploded through windows. Then the flames, licking up curtains and spreading to sofas, carpets, books and framed pictures until smoke billowed into the summer night.</p><p>They might have been scenes from another century, another country, but they played out in Northern Ireland this week..."
    ],
    "image_url": "https://i.guim.co.uk/img/media/92e5e72086df9e295e30e0f7217cb4bb34d4dab7/0_0_4463_3571/master/4463.jpg?width=140&quality=85&auto=format&fit=max&s=fe95e9df9a9c3493742854caa45a176e",
    "titles": [
      "‘Where are the foreigners?’: does a facile explanation lie behind Ballymena’s outbreak of hate?"
    ],
    "summary": "This week in Northern Ireland, incidents of racism, xenophobia, and intolerance escalated as families from abroad were forced to flee due to violent attacks. A crowd moved through the streets, targeting homes with shouts, rocks, and ultimately setting fires that caused significant damage. These actions have raised serious concerns over the social issues plaguing the region, highlighting the urgent need for solutions to combat this deep-rooted hostility.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information about social issues in Northern Ireland, raising awareness about the escalating violence and xenophobia. However, it does not report on solutions or progress towards resolving these issues, limiting its constructiveness.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.976,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.417
  },
  {
    "title": "Andrew Lloyd Webber Wins Tony for Sunset Boulevard Revival After 30 Years",
    "domain": "general",
    "location": "global",
    "published": "Sat, 14 Jun 2025 07:00:42 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "<p>Veteran composer’s work is everywhere, but generation who grew up admiring him say he has never been out of touch</p><p>When Andrew Lloyd Webber walked on stage to collect the Tony award for best musical revival for Sunset Boulevard, it was the first time in 30 years he had been recognised by the American Theatre Wing.</p><p>The Jamie Lloyd-directed revival was the star of the show at <a href=\"https://www.theguardian.com/stage/2025/jun/08/tony-awards-2025-full-list-of-winners\">American theatre’s big night</a> last Sunday with its three wins signifying a return to prominence for the veteran..."
    ],
    "image_url": "https://i.guim.co.uk/img/media/4b8adedb10ab222d6183449086c02e6b7203ea52/424_0_3525_2819/master/3525.jpg?width=140&quality=85&auto=format&fit=max&s=44bc0cdc9c875b4402ac03a2315676c2",
    "titles": [
      "Andrew Lloyd Webber is ‘hot again’ –with help from new kids on musicals block"
    ],
    "summary": "Andrew Lloyd Webber received a Tony award for best musical revival for Sunset Boulevard, marking his first recognition by the American Theatre Wing in 30 years. Directed by Jamie Lloyd, the revival was highlighted at the Tony Awards, showcasing Webber's enduring relevance and talent in the theatre industry. This achievement underscores a significant comeback for the veteran composer, celebrated by both long-time admirers and a new generation of fans.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story offers basic awareness about Andrew Lloyd Webber's recent achievement and his enduring relevance in the theatre industry. However, it lacks depth or insight into the broader context of his career, the significance of the award, or the impact on the theatre industry.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.976,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.407
  },
  {
    "title": "Group Finds Thrill in Dangerous Cresta Run, Despite Risks",
    "domain": "general",
    "location": "global",
    "published": "Sat, 14 Jun 2025 07:00:41 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "<p>In a stable and affluent society, it is possible to declare that ‘life is for living’ through pursuits that shorten your odds of dying</p><p>Last year I visited St Moritz’s infamous Cresta Run. You know the one – the vertiginous skeleton course that has killed a number of its participants and maimed many more. I was with a group of friends who were attempting it for the first time, and who quickly became addicted to the adrenaline fix. I stubbornly refused to even contemplate it.</p><p>It’s not just that my mates are braver than me – they are – but they’re all decent athletes, cricketers,..."
    ],
    "image_url": "https://i.guim.co.uk/img/media/ac6fb1f36dd49e98f988efadade8a4f791a5d2cd/0_0_3543_2835/master/3543.jpg?width=140&quality=85&auto=format&fit=max&s=7a42b3a9df0bd67f1bc6d68b9c57cc45",
    "titles": [
      "Need for speed: how sport’s risk takers recognise deadly danger and do it anyway | Emma John"
    ],
    "summary": "A visit to the Cresta Run in St Moritz, known for its dangerous skeleton course, highlighted the thrill-seeking behavior among a group of friends. Despite its reputation for causing fatalities and injuries, the group found the experience addictive, driven by an adrenaline rush. The narrator, in contrast, chose not to participate, acknowledging the risks involved. This story reflects on the choices individuals make in pursuit of excitement, especially in societies where such risks are a viable option.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides a deeper understanding of thrill-seeking behavior and the risks involved, offering readers a chance to reflect on their own choices. However, it doesn't highlight any solutions or progress towards safer thrill-seeking activities, which limits its constructiveness.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.976,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.437
  },
  {
    "title": "Common Wealth Calls for Tougher Penalties on Corporate Negligence in England",
    "domain": "general",
    "location": "global",
    "published": "Sat, 14 Jun 2025 06:00:44 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "<p>Exclusive: Thinktank calls for stronger penalties for corporate negligence in England, including directorship and public-contract bans</p><p></p><p>Companies responsible for unsafe cladding should face unlimited fines and permanent bans from public contracts, according to a report that also says England’s existing laws have not gone far enough to prevent future tragedies.</p><p>The thinktank Common Wealth said the law fails to effectively hold companies to account for corporate negligence, leaving the door open for another disaster like the Grenfell fire, which killed 72 people in June..."
    ],
    "image_url": "https://i.guim.co.uk/img/media/c159298720998cb1c6c3614ff012e7787cff3611/500_0_5000_4000/master/5000.jpg?width=140&quality=85&auto=format&fit=max&s=ceea2ed48255d79200484291266cfb20",
    "titles": [
      "Impose unlimited fines on unsafe-cladding firms, report says"
    ],
    "summary": "The think tank Common Wealth has advocated for more stringent penalties for corporate negligence in England, including unlimited fines and permanent bans from public contracts, especially targeting companies responsible for unsafe cladding. This recommendation comes in response to the current laws deemed insufficient in preventing tragedies similar to the Grenfell fire, which claimed 72 lives. The report criticizes the existing legal framework for not adequately holding companies accountable for corporate negligence.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it increases the reader's understanding of the current legal framework in England regarding corporate negligence. It also reports on a proposed solution to improve the situation, which could potentially empower readers to support the cause or take similar actions in their own jurisdictions.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.956,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.443
  },
  {
    "title": "Teacher Finds Ideal Match on Blind Date",
    "domain": "general",
    "location": "global",
    "published": "Sat, 14 Jun 2025 06:00:44 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "<p>Matthew, 48, an international English teacher, meets Emma, 40, a lecturer</p><p><strong>What were you hoping for?</strong><br />\n A serious-minded woman with a great backstory and fine taste in food who could share thoughts and opinions. All&nbsp;of those things happened.</p> <a href=\"https://www.theguardian.com/lifeandstyle/2025/jun/14/blind-date-matthew-emma\">Continue reading...</a>"
    ],
    "image_url": "https://i.guim.co.uk/img/media/555203b75467e62af674a882e6923af756ccefe7/0_0_2083_1666/master/2083.jpg?width=140&quality=85&auto=format&fit=max&s=a9f7f58ea380a2842b6d214ebefd24c0",
    "titles": [
      "Blind date: ‘It felt more like two people having a friendly conversation at a conference’"
    ],
    "summary": "Matthew, a 48-year-old international English teacher, went on a blind date with Emma, a 40-year-old lecturer. He hoped to meet a serious-minded woman with a great backstory and fine taste in food, who could share thoughts and opinions. According to his account, all of his expectations were met during the date.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "While this story provides basic awareness about the personal life of an individual, it lacks depth and insight. It does not offer actionable insights, improvements, or clarity around systems, causes, trends, or impacts that matter.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.956,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.383
  },
  {
    "title": "Context Needed for \"Perfect Ending\" Statement",
    "domain": "sports",
    "location": "global",
    "published": "Sat, 14 Jun 2025 08:00:00 BST",
    "source": "Sky Sports",
    "sources": [
      "Sky Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "\"It would be the perfect ending.\""
    ],
    "image_url": "https://e0.365dm.com/25/06/1920x1080/skysports-craig-gordon-hearts_6941007.jpg?20250613113435",
    "titles": [
      "Gordon wants 'perfect ending' to career | 'This season could be my last'"
    ],
    "summary": "The statement \"It would be the perfect ending\" lacks specific context, details, and outcomes related to the story it references. Without additional information about the subject, event, or individuals involved, and the current status or conclusion of the story, a comprehensive and factual summary cannot be provided.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "This story is not constructive as it does not provide any information, insights, or awareness. It lacks context and details, and does not contribute to the reader's understanding, decision-making, or sense of agency.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.996,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.361
  },
  {
    "title": "June 14 Sports Headlines Dominated by Player Transfer Talks",
    "domain": "sports",
    "location": "global",
    "published": "Sat, 14 Jun 2025 07:44:00 BST",
    "source": "Sky Sports",
    "sources": [
      "Sky Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Saturday morning's papers are dominated by transfer talk - check out the headlines on June 14th."
    ],
    "image_url": "https://e1.365dm.com/25/06/1920x1080/skysports-saturday-papers-transfers_6941727.jpg?20250614075919",
    "titles": [
      "Paper Talk: Saturday morning's headlines"
    ],
    "summary": "Saturday morning's newspapers on June 14th focused heavily on discussions related to player transfers in the sports world. The headlines across various publications highlighted the ongoing and potential future moves of athletes between teams, making transfer talk the dominant theme of the day's sports news coverage.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers basic awareness of the dominant theme in sports news for the day, but it does not provide much depth or insight into the implications or reasons for these player transfers.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.991,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.39
  },
  {
    "title": "Bath vs. Leicester at Twickenham: A Historic Rugby Rivalry Rekindled",
    "domain": "sports",
    "location": "national",
    "published": "Sat, 14 Jun 2025 07:39:21 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "The Guardian",
      "Yahoo Sports"
    ],
    "domains": [
      "sports",
      "general"
    ],
    "snippets": [
      "Everything you need to know ahead of the final at Allianz Stadium, Twickenham",
      "<p>Rival coaches Johann van Graan and Michael Cheika have rebuilt their sides along similar lines but Bath are favourites</p><p>It has been a while but the old firm of English club rugby are finally back. Between 1978 and 1997 Bath and Leicester collectively won 15 national knockout trophies and over the first 15 years of the league’s existence they claimed 12 titles between them. Their reunion at Twickenham is akin to those other 90s chart-toppers, Oasis and Blur, dusting down their favourite guitars and appearing on stage together.</p><p>The temptation is to dive head first into a foaming..."
    ],
    "image_url": "",
    "titles": [
      "Is Bath vs Leicester on TV? Kick-off time, channel and how to watch Premiership final",
      "Master motivators put 90s chart-toppers Bath and Leicester back on Premiership final stage"
    ],
    "summary": "Bath and Leicester, two of English club rugby's most successful teams historically, are set to face off at Twickenham. Coaches Johann van Graan and Michael Cheika have rebuilt their teams with similar strategies, with Bath being the favorites for the match. This reunion marks a significant moment, reminiscent of their dominance in English rugby from 1978 to 1997, where they won a combined total of 15 national knockout trophies and 12 league titles.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful context about the historical rivalry between Bath and Leicester. It informs readers about the teams' past successes and the strategies their coaches are using to rebuild. However, it does not report on any innovation or solution.",
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.989,
      "consensus": 0.682,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.708
  },
  {
    "title": "Real Madrid in Talks to Extend Vinicius Jr.'s Contract Amid Saudi Interest",
    "domain": "sports",
    "location": "national",
    "published": "Sat, 14 Jun 2025 07:30:00 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "With Saudi Arabia making overtures to lure Vinicius Jr. from Real Madrid, the club have opened talks over renewing the forward’s contract.The 24-year-old megastar’s current deal runs until the sum..."
    ],
    "image_url": "",
    "titles": [
      "Real Madrid yet to reach renewal agreement with key forward despite €100m five-year offer"
    ],
    "summary": "Saudi Arabia has shown interest in acquiring Vinicius Jr. from Real Madrid. In response, Real Madrid has initiated discussions to extend the 24-year-old forward's contract, which is set to expire in the summer. The move aims to secure the megastar's future with the club amidst external interest.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story informs readers about Real Madrid's response to external interest in one of their players. It provides some context about the player's contract situation but does not delve into the broader impact or trends in player transfers.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.986,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.419
  },
  {
    "title": "Houston Astros Adjust Lineup Amid Player Injuries",
    "domain": "sports",
    "location": "national",
    "published": "Sat, 14 Jun 2025 07:22:25 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "The Houston Astros shuffled the roster after suffering injuries."
    ],
    "image_url": "",
    "titles": [
      "Astros Make Move Immediately After Twins Game"
    ],
    "summary": "The Houston Astros made adjustments to their team lineup due to injuries among players. These changes were implemented to maintain the team's competitive edge and address the gaps left by the injured athletes. The specific details of the roster changes were not disclosed, but the move is a direct response to the recent injuries within the team.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the Houston Astros' response to player injuries, which could impact future games and the team's overall performance. However, it lacks detailed information about the specific changes made and how they might affect the team's strategies, limiting its depth and usefulness.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.983,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.418
  },
  {
    "title": "Hato Expresses Love for Ajax Amid Chelsea Interest",
    "domain": "sports",
    "location": "national",
    "published": "Sat, 14 Jun 2025 07:15:00 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Chelsea transfer target Jorrel Hato has described Ajax as “home” in a possible hint he will remain at the Dutch giants this summer.The Blues will likely be busy again this summer and have already ..."
    ],
    "image_url": "",
    "titles": [
      "&#8220;I just feel&#8221; &#8211; Jorrel Hato drops hint on his future amid Chelsea interest"
    ],
    "summary": "Chelsea's transfer target, Jorrel Hato, has expressed a strong affinity for Ajax, referring to it as \"home.\" This statement could indicate his preference to stay with the Dutch club despite interest from Chelsea. The Blues are expected to be active in the summer transfer window, but Hato's recent comments suggest a potential reluctance to move.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information for football fans, offering insight into potential player transfers and their implications. However, it does not delve deeper into the potential impacts of such a move on both teams or the player's career, limiting its depth and usefulness.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.981,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.418
  },
  {
    "title": "McKaigue Confident in Derry Ahead of Key Dublin Match Despite Winless 2025",
    "domain": "sports",
    "location": "national",
    "published": "Sat, 14 Jun 2025 07:13:01 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Former Derry captain Chrissy McKaigue believes the county will go into Saturday's crunch Group Four game against Dublin with &quot;full belief&quot; despite their winless 2025."
    ],
    "image_url": "",
    "titles": [
      "Derry would ignite season with Dubs win - McKaigue"
    ],
    "summary": "Former Derry captain Chrissy McKaigue expressed confidence in his team's mindset ahead of their crucial Group Four match against Dublin, despite Derry's winless streak in 2025. McKaigue emphasized that the team will enter the game with \"full belief\" in their ability to compete.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness about Derry's mindset ahead of a crucial match, but it lacks depth or insight into their strategies for overcoming their winless streak or how this game could impact their season. It does not provide actionable insights or deeper understanding for the reader.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.98,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.415
  },
  {
    "title": "Anwar El Ghazi and Kieron Evans Depart Cardiff City",
    "domain": "sports",
    "location": "national",
    "published": "Sat, 14 Jun 2025 07:05:52 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Anwar El Ghazi and Kieron Evans have issued farewell messages on social media, as they prepare to leave Cardiff City.  Dutch international El Ghazi, 30, leaves after less than a year at Cardiff, while 23-year-old City youth product Evans departs having spent last season on loan at Newport County."
    ],
    "image_url": "",
    "titles": [
      "Departing Bluebirds post farewell messages"
    ],
    "summary": "Anwar El Ghazi and Kieron Evans have announced their departures from Cardiff City on social media. El Ghazi, a 30-year-old Dutch international, is leaving after less than a year with the club. Evans, a 23-year-old who came up through Cardiff's youth system and spent the last season on loan at Newport County, is also exiting. Both players have shared farewell messages as they conclude their time at Cardiff City.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about the departure of two players from Cardiff City. However, it does not provide any deeper insights or understanding about the reasons for their departure, the impact on the team, or the future plans of the players or the club.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.978,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.388
  },
  {
    "title": "Nvidia CEO Jensen Huang Recognized as Leading Tech Industry Figure",
    "domain": "business",
    "location": "national",
    "published": "Sat, 14 Jun 2025 06:05:19 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Nvidia boss Jensen Huang is truly the current rockstar of the tech world."
    ],
    "image_url": "",
    "titles": [
      "Nvidia-mania took over Europe this week. Here's what I learned from Jensen Huang"
    ],
    "summary": "Jensen Huang, the CEO of Nvidia, has emerged as a prominent figure in the technology industry. His leadership and innovations have garnered significant attention, establishing him as a leading figure in the sector.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "The story provides basic awareness about Jensen Huang's recognition in the tech industry. However, it lacks depth and insight as it does not elaborate on the specific innovations or leadership strategies that have led to his recognition.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.957,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.383
  },
  {
    "title": "Anti-Bezos Campaign Gains Momentum in Venice with Public Rally Planned",
    "domain": "business",
    "location": "global",
    "published": "Sat, 14 Jun 2025 06:05:00 +0000",
    "source": "Fortune",
    "sources": [
      "Fortune"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "The anti-Bezos group, whose posters and stickers have been seen in recent days across Venice, has called a public assembly to drum up opposition."
    ],
    "image_url": "https://fortune.com/img-assets/wp-content/uploads/2025/06/GettyImages-2202523786.jpg?w=2048",
    "titles": [
      "Venice is set to host Jeff Bezos and Lauren Sanchez’s fairytale wedding—but residents aren’t feeling the love"
    ],
    "summary": "An anti-Bezos group has been actively displaying posters and stickers in Venice to garner public attention. They have scheduled a public assembly aimed at rallying opposition against Jeff Bezos. The group's activities and their call for a public gathering indicate a coordinated effort to mobilize against Bezos, with their actions gaining visibility in Venice.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the growing opposition against Jeff Bezos in Venice. It informs readers about the campaign's activities and their plans for a public rally. However, it does not delve into the reasons behind the opposition or the potential impacts of the campaign.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.957,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.42
  },
  {
    "title": "Indian Films Secure Top Spots on Netflix Globally",
    "domain": "business",
    "location": "global",
    "published": "Sat, 14 Jun 2025 02:58:47 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Four Indian films ranked among Netflix global top 10 films and three among those made it to the list for the second week in a row."
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/684d1bb744e4b59c8554b672/0x0.jpg?width=960",
    "titles": [
      "Netflix Global Top 10: 3 Indian Films Rank For Second Consecutive Week"
    ],
    "summary": "Four Indian films have achieved significant global recognition on Netflix, ranking among the top 10 films worldwide. Impressively, three of these films maintained their positions in the top 10 list for two consecutive weeks, highlighting their popularity and the growing international appeal of Indian cinema on the streaming platform.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the growing international appeal of Indian cinema on Netflix. However, it lacks depth in terms of explaining why these films are popular or what this trend might mean for the global film industry.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.975,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.417
  },
  {
    "title": "NYT Mini Crossword Provides Hints and Answers for Today's Puzzle",
    "domain": "business",
    "location": "global",
    "published": "Sat, 14 Jun 2025 01:46:58 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Looking for help with today's NYT Mini Crossword puzzle? Here are some hints and answers for the puzzle."
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/66ad93159698a3280d18584c/0x0.jpg?width=960",
    "titles": [
      "Today’s NYT Mini Crossword Clues And Answers For Saturday, June 14th"
    ],
    "summary": "Hints and answers for today's NYT Mini Crossword puzzle were provided to assist players. This service aims to help those struggling with the puzzle by offering guidance and solutions.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "While this story provides basic awareness about the availability of hints and answers for a crossword puzzle, it does not offer any deeper insight or understanding. It is not reporting on any significant progress, solutions, or improvements.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.951,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.382
  },
  {
    "title": "Tesla to Test Robotaxis in Austin Amid Local Protests",
    "domain": "business",
    "location": "national",
    "published": "Sat, 14 Jun 2025 01:40:29 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "With Tesla planning its initial test of robotaxis on the streets of Austin, Texas, later this month, protesters in the city are voicing their concerns."
    ],
    "image_url": "",
    "titles": [
      "Tesla faces protests in Austin over Musk's robotaxi plans"
    ],
    "summary": "Tesla is set to begin testing its robotaxis in Austin, Texas, later this month. This move has sparked protests from local residents who are expressing their concerns about the initiative.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story informs readers about Tesla's plans to test robotaxis and the local community's response. It provides useful context about the ongoing debate over autonomous vehicles, but it could be more constructive if it delved into the reasons behind the protests or the potential impacts of the robotaxis.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.873,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.416
  },
  {
    "title": "Singapore Finalizes Strategic Land Swap to Optimize Urban Development",
    "domain": "business",
    "location": "global",
    "published": "Sat, 14 Jun 2025 01:00:00 GMT",
    "source": "Bloomberg",
    "sources": [
      "Bloomberg"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMiugFBVV95cUxQbUZ5SGdmbXBhMzlPSWxNS1pfajVscTREMDZYUmR4cnRtYzZ0SkFtZUlsVjNrZnR5RmtLcl9PTVhCeHdJUGpyd21KQW1BQVJidmoxXzhpbWx4eEs2OHd1XzhVejZaREhRcTd4T0p1R1I2RFNpbGhsdkVQcGZ5aWdmZlBnSGdJYUcxdUc3b0dlZHBTdGxEUnFzMlB5dEhrMmZ1U0FSWHVwR1B6ZldnbERxY3ZQN0xsX3ZVU1E?oc=5\" target=\"_blank\">The Story Behind Singapore’s Ultra-Valuable Land Swap</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Bloomberg</font>"
    ],
    "image_url": "",
    "titles": [
      "The Story Behind Singapore’s Ultra-Valuable Land Swap - Bloomberg"
    ],
    "summary": "Singapore has successfully completed an ultra-valuable land swap deal, as reported by Bloomberg. This strategic move involves exchanging land parcels to optimize its limited space for development and use. The swap aims to enhance urban planning and infrastructure development, reflecting Singapore's approach to managing its scarce land resources efficiently. The current status of the story indicates that the deal has been finalized, showcasing Singapore's innovative strategies in land management and urban development.",
    "constructiveness_score": 1.0,
    "constructiveness_reason": "This story is constructive as it provides useful insights into Singapore's innovative approach to land management and urban development. It reports on a solution to a problem (limited land resources), and increases awareness about strategic urban planning.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.861,
      "consensus": 0.393,
      "constructiveness": 1.0,
      "proximity": 0.5
    },
    "score": 0.434
  },
  {
    "title": "UFC Atlanta Hosts Usman vs. Buckley at State Farm Arena on June 14",
    "domain": "business",
    "location": "global",
    "published": "Sat, 14 Jun 2025 00:15:00 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "The UFC Atlanta fight card takes place tonight, June 14, at State Farm Arena in Atlanta, GA. Kamaru Usman vs. Joaquin Buckley serves as the main event."
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/684c997914b2d87f4a5d8c21/0x0.jpg?width=960",
    "titles": [
      "UFC Tonight: What You Need To Know About The UFC Atlanta Fight Card"
    ],
    "summary": "The UFC event in Atlanta occurred on June 14 at State Farm Arena, featuring Kamaru Usman vs. Joaquin Buckley as the main event. This summary does not include the outcome of the fights or additional details about the event's other matchups.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "The story offers basic awareness about an upcoming UFC event but lacks depth or insight. There's no information about the significance of the event, the fighters, or the potential impact of the outcome.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.921,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.376
  },
  {
    "title": "Northern Metropolis Project Falls Short of Expectations",
    "domain": "business",
    "location": "global",
    "published": "Sat, 14 Jun 2025 00:00:00 +0000",
    "source": "Fortune",
    "sources": [
      "Fortune"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "It’s called “Northern Metropolis,” yet, for now, it’s anything but."
    ],
    "image_url": "https://fortune.com/img-assets/wp-content/uploads/2025/06/GettyImages-2187559561-e1749811670640.jpg?w=2048",
    "titles": [
      "Hong Kong bets the future on a vast tech zone by China’s border"
    ],
    "summary": "The term \"Northern Metropolis\" refers to a project or area that, despite its ambitious name, currently does not live up to the expectations or developments typically associated with a metropolis. The current status or outcome of the project is not detailed, indicating it is still in early stages or facing challenges.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs about a setback in a development project, providing some context about its current status. However, it lacks in-depth analysis or insights into the reasons for the shortfall, or potential solutions to the problem.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.843,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.39
  },
  {
    "title": "Wood Pellet Plants Near Yosemite Spark Fire Concerns",
    "domain": "science",
    "location": "global",
    "published": "Sat, 14 Jun 2025 06:00:00 +0000",
    "source": "Wired",
    "sources": [
      "Wired"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Facilities that make wood pellets have a track record of catching alight. Yet there are plans to build several near Yosemite’s tinderbox forests."
    ],
    "image_url": "https://media.wired.com/photos/684acaf52adeef00c74c7c45/master/pass/AP24203458670422.jpg",
    "titles": [
      "Wood Pellet Mills Are Prone to Catching Fire. Why Build Them in California?"
    ],
    "summary": "Wood pellet production facilities, known for their susceptibility to fires, are slated for construction near the fire-prone forests surrounding Yosemite National Park. This decision has raised concerns due to the historical incidence of fires at such plants.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful awareness about the potential fire risks associated with wood pellet production facilities. However, it does not offer any solutions or improvements to mitigate these risks, nor does it provide actionable insights for the reader.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.955,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.413
  },
  {
    "title": "Astronomers Find Unusual Star Emitting Signals Every 44 Minutes",
    "domain": "science",
    "location": "global",
    "published": "Sat, 14 Jun 2025 04:40:05 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/its-not-a-pulsar-its-not-a-magnetar-so-what-is-this-bizarre-star/\" rel=\"nofollow\" title=\"It’s Not a Pulsar. It’s Not a Magnetar. So What Is This Bizarre Star?\"><img alt=\"ASKAP J1832 Composite\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"747\" src=\"https://scitechdaily.com/images/ASKAP-J1832-Composite-777x747.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>Astronomers have uncovered a bizarre star, ASKAP J1832, that pulses radio waves and X-rays every 44 minutes—thousands of times slower than typical pulsars. This rare..."
    ],
    "image_url": "",
    "titles": [
      "It’s Not a Pulsar. It’s Not a Magnetar. So What Is This Bizarre Star?"
    ],
    "summary": "Astronomers discovered a unique star, ASKAP J1832, which emits radio waves and X-rays every 44 minutes, significantly slower than the usual pulsar frequencies. This finding challenges existing classifications, as it does not fit the typical profiles of known pulsars or magnetars, indicating a potentially new type of celestial object.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides a deeper understanding of a new astronomical discovery, which can be useful for those interested in this field. However, it does not directly offer actionable insights or report on solutions or improvements.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.929,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.428
  },
  {
    "title": "NASA's CODEX Reveals New Details of Solar Wind from ISS",
    "domain": "science",
    "location": "global",
    "published": "Sat, 14 Jun 2025 04:05:50 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/nasas-codex-unveils-the-suns-fiery-secrets-with-stunning-new-solar-wind-images/\" rel=\"nofollow\" title=\"NASA’s CODEX Unveils the Sun’s Fiery Secrets With Stunning New Solar Wind Images\"><img alt=\"NASA CODEX Sun Outer Atmosphere\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"433\" src=\"https://scitechdaily.com/images/NASA-CODEX-Sun-Outer-Atmosphere-777x433.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>NASA’s CODEX experiment, now operating aboard the International Space Station, has just delivered never-before-seen..."
    ],
    "image_url": "",
    "titles": [
      "NASA’s CODEX Unveils the Sun’s Fiery Secrets With Stunning New Solar Wind Images"
    ],
    "summary": "NASA's CODEX experiment, located on the International Space Station, has recently provided unprecedented images of the solar wind, unveiling new details about the Sun's outer atmosphere. These images offer significant insights into the Sun's fiery secrets, enhancing our understanding of solar phenomena.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "The story clearly highlights progress in the field of solar research, providing empowering knowledge about the Sun's outer atmosphere. The insights gained from NASA's CODEX experiment can potentially lead to further advancements in our understanding of solar phenomena.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.918,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.443
  },
  {
    "title": "USDA Implements Measures Against Deadly Bird Flu Spread",
    "domain": "science",
    "location": "global",
    "published": "Fri, 13 Jun 2025 22:00:25 +0100",
    "source": "New Scientist",
    "sources": [
      "New Scientist"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Amidst an ongoing outbreak of a deadly bird flu virus in livestock, the US Department of Agriculture is doing more to prevent the spread than public health agencies are"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/06/13172251/SEI_255372835.jpg",
    "titles": [
      "How a US agriculture agency became key in the fight against bird flu"
    ],
    "summary": "The US Department of Agriculture is actively implementing measures to curb the spread of a deadly bird flu virus affecting livestock, in contrast to public health agencies which are less engaged in these efforts. This initiative reflects a focused attempt to manage the outbreak and mitigate its impact on the agricultural sector.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it raises awareness about a current issue affecting agriculture and public health. It provides useful information about the measures being taken by the USDA to manage and mitigate the impact of the bird flu outbreak. This information could be useful to farmers, policy makers, and the general public.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.792,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.417
  },
  {
    "title": "Early Humans Used Fire for More Than Cooking 1 Million Years Ago",
    "domain": "science",
    "location": "global",
    "published": "Fri, 13 Jun 2025 21:03:34 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/archaeologists-reveal-early-humans-used-fire-in-a-surprising-way-as-early-as-1-million-years-ago/\" rel=\"nofollow\" title=\"Archaeologists Reveal Early Humans Used Fire in a Surprising Way As Early as 1 Million Years Ago\"><img alt=\"Illustration of Elephant Hunting With Spears\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"559\" src=\"https://scitechdaily.com/images/Illustration-of-Elephant-Hunting-With-Spears-777x559.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>Fire helped early humans preserve meat and deter predators,..."
    ],
    "image_url": "",
    "titles": [
      "Archaeologists Reveal Early Humans Used Fire in a Surprising Way As Early as 1 Million Years Ago"
    ],
    "summary": "Archaeologists have discovered that early humans were using fire for purposes beyond cooking as early as 1 million years ago. The findings suggest that fire was utilized for preserving meat and deterring predators, indicating a sophisticated understanding and application of fire by early human societies. This revelation sheds new light on the innovative ways early humans adapted to their environments for survival.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides a deeper understanding of early human societies and their innovative use of fire. While it doesn't offer actionable insights for the reader, it does contribute to the broader knowledge of human history and evolution.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.793,
      "consensus": 0.393,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.391
  },
  {
    "title": "New Semiconductor Tech Promises to Boost 6G Performance",
    "domain": "science",
    "location": "global",
    "published": "Fri, 13 Jun 2025 20:38:52 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/new-semiconductor-technology-could-supercharge-6g-delivery/\" rel=\"nofollow\" title=\"New Semiconductor Technology Could Supercharge 6G Delivery\"><img alt=\"Artistic Representation of a Futuristic Semiconductor Device Enabling 6G Technology\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"1030\" src=\"https://scitechdaily.com/images/Artistic-Representation-of-a-Futuristic-Semiconductor-Device-Enabling-6G-Technology-777x1030.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>A team at the University of Bristol developed SLCFETs, a..."
    ],
    "image_url": "",
    "titles": [
      "New Semiconductor Technology Could Supercharge 6G Delivery"
    ],
    "summary": "Researchers at the University of Bristol have developed a new semiconductor technology, known as SLCFETs, which has the potential to significantly enhance the performance and efficiency of 6G networks. This advancement could lead to faster data transmission speeds and improved connectivity in future wireless networks.",
    "constructiveness_score": 1.0,
    "constructiveness_reason": "This story is highly constructive. It reports on an innovative technology that could significantly improve future wireless networks. This could be useful information for tech industry professionals, investors, and anyone interested in the future of connectivity.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.786,
      "consensus": 0.393,
      "constructiveness": 1.0,
      "proximity": 0.5
    },
    "score": 0.419
  },
  {
    "title": "\"Ghost Plume Found Beneath Oman Suggests Earth's Core Is Hotter Than Thought\"",
    "domain": "science",
    "location": "global",
    "published": "Fri, 13 Jun 2025 20:37:16 +0100",
    "source": "New Scientist",
    "sources": [
      "New Scientist"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "A ‘ghost plume’ identified deep in the mantle beneath Oman suggests there may be more heat flowing out of Earth’s core than previously thought"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/06/13180403/sei255368578.jpg",
    "titles": [
      "Earth’s mantle may have hidden plumes venting heat from its core"
    ],
    "summary": "Scientists have discovered a 'ghost plume' deep in the mantle beneath Oman, indicating that Earth's core may be releasing more heat than previously estimated. This finding could reshape our understanding of Earth's internal heat flow and its impact on geological processes.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The story provides useful insights into new scientific findings that could reshape our understanding of Earth's internal heat flow. However, it doesn't provide any actionable insights for the reader or report on solutions or improvements.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.77,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.396
  },
  {
    "title": "Greenland Tsunamis Cause Global Shaking for Nine Days",
    "domain": "science",
    "location": "global",
    "published": "Fri, 13 Jun 2025 20:13:09 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/the-earth-shook-every-90-seconds-for-9-days-in-2023-scientists-finally-know-why/\" rel=\"nofollow\" title=\"The Earth Shook Every 90 Seconds for 9 Days in 2023 – Scientists Finally Know Why\"><img alt=\"Earth Shaking Lines Concept\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Earth-Shaking-Lines-Concept-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>Scientists used satellite and seismic data to prove mega tsunamis in Greenland fjords created trapped standing waves that shook..."
    ],
    "image_url": "",
    "titles": [
      "The Earth Shook Every 90 Seconds for 9 Days in 2023 – Scientists Finally Know Why"
    ],
    "summary": "In 2023, the Earth experienced consistent shaking every 90 seconds for nine days. Scientists have determined that the cause was mega tsunamis in Greenland's fjords, which generated trapped standing waves. This phenomenon was confirmed through the analysis of satellite and seismic data, providing a clear explanation for the unusual seismic activity observed during that period.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs and contextualizes a unique natural phenomenon, increasing awareness about the potential impacts of mega tsunamis. However, it doesn't provide any actionable insights or discuss any solutions or improvements.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.779,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.378
  }
]