[
  {
    "title": "Supreme Court Backs Trump Admin in Cutting DEI-Linked Grants",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Thu, 21 Aug 2025 17:41:09 -0400",
    "source": "NPR",
    "sources": [
      "Al Jazeera",
      "NPR",
      "The Guardian",
      "Axios",
      "Forbes",
      "LA Times"
    ],
    "domains": [
      "news.google.com",
      "www.forbes.com",
      "www.latimes.com",
      "www.npr.org",
      "www.theguardian.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "But the court, in its emergency-docket order, left in place by a 5-4 order a lower court ruling that threw out National Institutes of Health memos that enforced the administration's policies.",
      "SCOTUS decision impacts DEI programmes that include breast cancer research and HIV prevention.",
      "<a href=\"https://news.google.com/rss/articles/CBMif0FVX3lxTE9feldhZHR4UC1xdVh1dkNuaEVKYzJMWDRTZkxlZ2ozNFdZV2NtS0p4NjdNOEQwUFdxSHZkSDhSalVtYTFpdVF4NUxaWGFoVk10RGs1VEtDRW94dzYzNFFHQmhvS1RybTF3Z0tnN0hFN0pEZHptcjlGbGxveTJPalU?oc=5\" target=\"_blank\">Supreme Court lets Trump slash DEI grants at NIH</a>&nbs",
      "<p>Supreme Court sides with Trump on cutting government grant programs involving diversity, equity and inclusion.</p>",
      "The decision could result in the loss of National Institutes of Health grants worth hundreds of millions of dollars.",
      "<p>Court, in 5-4 split, lifts judge’s order blocking $783m in cuts made by NIH to align with president’s priorities</p><p>The Trump administration can slash hundreds of millions of dollars’ worth of research funding in its push to cut federal diversity, equity and inclusion efforts, the supreme cour"
    ],
    "image_url": "",
    "titles": [
      "Supreme Court allows NIH to stop making nearly $800M in research grants for now",
      "US Supreme Court rules Trump admin can cut nearly $800m in health funding",
      "Supreme Court lets Trump slash DEI grants at NIH - Axios",
      "Supreme Court says Trump may cancel DEI-related health research grants",
      "Supreme Court Allows Trump To Cut Millions In DEI-Related Health Grants",
      "Supreme court allows Trump officials to cut research millions in anti-DEI push"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.804,
      "consensus": 1.0,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.846,
    "summary": "The Supreme Court, in a 5-4 decision, sided with the Trump administration to cut government grant programs that involve diversity, equity, and inclusion (DEI), impacting areas such as breast cancer research and HIV prevention. This ruling upheld a lower court's decision to invalidate National Institutes of Health (NIH) memos enforcing these policies, potentially leading to the loss of NIH grants worth hundreds of millions of dollars.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: research",
    "constructiveness_source": "heuristic",
    "image": {
      "src": "icons/newspaper.svg",
      "thumbnail": "icons/newspaper.svg",
      "alt": "general",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Judge Orders Closure of \"Alligator Alcatraz\" Detention Center in 60 Days",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Fri, 22 Aug 2025 00:39:18 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "ABC News",
      "The Guardian",
      "Forbes",
      "BBC"
    ],
    "domains": [
      "www.forbes.com",
      "www.bbc.com",
      "abcnews.go.com",
      "www.npr.org",
      "www.theguardian.com"
    ],
    "snippets": [
      "A federal judge issued a preliminary injunction Thursday halting further expansion and ordering the winding down of an immigration detention center built in the middle of the Florida Everglades.",
      "The order gave the Trump administration 60 days to wind down operations at the site, with no new detainees allowed.",
      "A federal judge is ordering the Trump administration and Florida to effectively wind down operations at the immigrant detention center known as “Alligator Alcatraz.\"",
      "<p>Judge’s order finds jail, which has attracted waves of criticism, was causing severe harm to Florida Everglades</p><p>A federal judge in Miami late on Thursday ordered the closure of the Trump administration’s notorious “<a href=\"https://www.theguardian.com/us-news/2025/jul/26/alligator-alcatraz-",
      "The ruling sided with environmental groups and the Miccosukee Tribe, who had filed a suit alleging that the facility built in the Florida Everglades violated federal environmental laws."
    ],
    "image_url": "",
    "titles": [
      "Florida must stop expanding 'Alligator Alcatraz' immigration center, judge says",
      "US judge orders shutdown of Trump's 'Alligator Alcatraz' detention centre",
      "Judge blocks transfers to 'Alligator Alcatraz,' effectively winding down operations",
      "Federal judge orders closure of Trump’s ‘Alligator Alcatraz’ immigration jail",
      "Federal Judge Orders ‘Alligator Alcatraz’ To Be Shut Down Within 60 Days—No New Detainees"
    ],
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.93,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.84,
    "summary": "A federal judge has ordered the closure of the immigration detention center known as \"Alligator Alcatraz\" located in the Florida Everglades, giving the Trump administration 60 days to cease operations. The decision comes after environmental groups and the Miccosukee Tribe sued, arguing the facility violated federal environmental laws and caused severe harm to the ecosystem. The judge's ruling prohibits any new detainees and mandates the winding down of the center.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic",
    "image": {
      "src": "icons/newspaper.svg",
      "thumbnail": "icons/newspaper.svg",
      "alt": "general",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Court Overturns $464M Fine Against Trump in Fraud Case, Upholds Other Sanctions",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Thu, 21 Aug 2025 12:52:34 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "ABC News",
      "Deutsche Welle",
      "The Guardian",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "abcnews.go.com",
      "www.npr.org",
      "www.theguardian.com",
      "www.dw.com"
    ],
    "snippets": [
      "Trump, in a social media post, claimed \"total victory\" after the ruling, which spares him from a potential half-billion-dollar fine for decades of exaggerating his wealth.",
      "A New York appeals court has ruled that US President Donald Trump will not be required to pay a $515 million (around €443 million) civil fraud penalty, eliminating one of his biggest financial liabilities.",
      "<a href=\"https://news.google.com/rss/articles/CBMigwFBVV95cUxOQ24xSk9ONUdRVGh4T1NlNXdWUFVta3R2YWdlalExb2Z4SWpNOXJvN2FvbEdocjBSeElPc0J5Vm5VRGpqWEhTeDlrallRakI1LUVJbG50X2J6UC0tR1R1M0ZoUnRVZzMwaXFRZ3Zwc2JVeGZOUGZsbW56RVpQeVpNR3dIRQ?oc=5\" target=\"_blank\">President Trump's massive civil fraud penalty jus",
      "A New York appeals court has thrown out the half billion-dollar civil fraud judgment handed down last year against President Trump, his family and his company.",
      "<p>Divided decision by New York appeals judges dismisses ‘excessive’ penalty but leaves room for further appeals</p><p>A <a href=\"https://www.theguardian.com/us-news/new-york\">New York</a> appeals court has thrown out the massive civil fraud penalty against <a href=\"https://apnews.com/hub/donald-tru"
    ],
    "image_url": "",
    "titles": [
      "An appeals court throws out a massive civil fraud penalty against President Trump",
      "US court throws out massive fraud penalty against Trump",
      "President Trump's massive civil fraud penalty just got tossed out - Axios",
      "WATCH:  NY appeals court throws out civil fraud judgment against Trump",
      "Court throws out $500m civil fraud penalty against Donald Trump"
    ],
    "score_components": {
      "magnitude": 0.984,
      "recency": 0.728,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.814,
    "summary": "A New York appeals court has overturned a $464 million fine against President Donald Trump in a civil fraud case, deeming it excessive and likely a violation of the US Constitution. The case, filed by New York State Attorney General Letitia James, accused Trump of inflating his assets to secure favorable terms from lenders and insurers. While the court dismissed the financial penalty, it upheld other sanctions against Trump, his family, and his company. This decision represents a significant legal victory for the President amidst ongoing legal challenges.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic",
    "image": {
      "src": "icons/newspaper.svg",
      "thumbnail": "icons/newspaper.svg",
      "alt": "general",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Jaylen Brown's Father Charged with Attempted Murder in Las Vegas",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Fri, 22 Aug 2025 00:58:07 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sports Illustrated",
      "Sportsnet"
    ],
    "domains": [
      "www.espn.com",
      "news.google.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "The father of Boston Celtics star Jaylen Brown was accused of attempted murder in connection with a stabbing Wednesday night in Las Vegas.",
      "<a href=\"https://news.google.com/rss/articles/CBMid0FVX3lxTE1IOGF5T1Ywai04d2s1YTRZZkZ2QXJTVE42OUlpVklhYlZNcEluNW1nanhXdU5mTDVEdjhVYTRWbEJsd1hXTXF4MFVIdlZHVTJCbmJrYlluMWQ0Wm5YTEt5U0FYN1dZMjE4S19wMTAzNXhqOWpocDZn?oc=5\" target=\"_blank\">Marselles Brown, Father of Celtics Star Jaylen Brown, Arrested for ",
      "<p>The father of Boston Celtics All-Star Jaylen Brown was arrested in Las Vegas and charged with attempted murder after reportedly stabbing another man in a parking lot.</p>"
    ],
    "image_url": "",
    "titles": [
      "Father of Celtics' Brown arrested after stabbing",
      "Marselles Brown, Father of Celtics Star Jaylen Brown, Arrested for Attempted Murder - Sports Illustrated",
      "AP Source: Father of Celtics’ Jaylen Brown arrested in Las Vegas"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.936,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.749,
    "summary": "Quenton M. Brown, the father of Boston Celtics star Jaylen Brown, was arrested and charged with attempted murder in Las Vegas. The charge stems from an incident where he allegedly stabbed a youth football coach following an argument over a parking situation.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Lil Nas X Arrested, Hospitalized After LA Altercation with Police",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 22 Aug 2025 06:16:02 GMT",
    "source": "BBC",
    "sources": [
      "Deutsche Welle",
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.theguardian.com",
      "www.dw.com"
    ],
    "snippets": [
      "The LAPD allege the singer \"charged\" at them and was placed under arrest on suspicion of battery.",
      "The Grammy Award-winning rapper was taken to hospital for a suspected overdose after a brief struggle with police. He was held in jail and booked on suspicion of obstructing an officer.",
      "<p>The 26-year-old rapper and singer was seen walking down the street in his underwear Thursday morning in LA</p><p>Lil Nas X has been arrested and briefly hospitalized after an altercation with police in the early hours of Thursday morning, according to authorities in Los Angeles.</p><p>Officers fo"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/3af5/live/3d5ca7c0-7edd-11f0-9f8a-81f8e371e1d1.jpg",
    "titles": [
      "Lil Nas X arrested and taken to hospital after wandering LA streets in underwear",
      "Lil Nas X arrested after being found nearly naked in LA",
      "Lil Nas X arrested and hospitalized after altercation with police"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.942,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.725,
    "summary": "Lil Nas X, a 26-year-old rapper and singer, was arrested and briefly hospitalized following an altercation with police in Los Angeles early Thursday morning. He was seen walking down the street in his underwear before the incident. Authorities expect to charge him with misdemeanor battery on a police officer, as reported by NBC Los Angeles.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic",
    "image": {
      "src": "icons/newspaper.svg",
      "thumbnail": "icons/newspaper.svg",
      "alt": "general",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "California Gov Targets Texas Gerrymandering, Calls for November Vote",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Fri, 22 Aug 2025 06:00:00 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "Forbes",
      "The Guardian"
    ],
    "domains": [
      "news.google.com",
      "www.forbes.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMilwFBVV95cUxONDZ0NXNMS1Z5aF9DM0hIN0ZIVnBxZWg5bjE0WjlST0I3SGljQVhuM0M5TXFtRGhUaTliLV9MUUFSUU0xRGFfNHpVcE1RdzVTQTVXUS02RFdJQjJoNzl3SWtrbWpJT3hycG9LUE52YTJWeGotWXF4U0toemNUU1Q0aGpTNG90eVJvV0tBUHR0NTIzZ2pDRmFv?oc=5\" target=\"_blank\">Newsom signs California",
      "<p>Retaliatory strike against gerrymandered maps in Texas now heads to voters in a special election this November</p><p><a href=\"https://www.theguardian.com/us-news/california\">California</a> governor <a href=\"https://www.theguardian.com/us-news/gavin-newsom\">Gavin Newsom</a> on Thursday signed a sw",
      "If approved by voters, the California redistricting could nullify five new U.S. House seats Republicans are expected to gain from a new redistricting map in Texas."
    ],
    "image_url": "",
    "titles": [
      "Newsom signs California redistricting measures in response to Texas bill - Axios",
      "Newsom signs redistricting proposal to reshape congressional map in favor of Democrats",
      "Newsom Sends Redistricting Proposal To California Voters To Counter GOP’s Texas Redistricting"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.937,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.724,
    "summary": "California Governor Gavin Newsom signed legislation targeting gerrymandered maps in Texas, setting up a special election in November for voters to decide. If passed, this measure could counteract the expected gain of five U.S. House seats by Republicans under a new Texas redistricting map.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic",
    "image": {
      "src": "icons/newspaper.svg",
      "thumbnail": "icons/newspaper.svg",
      "alt": "general",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Musk Sought Zuckerberg's Help for $97.4B OpenAI Buy, Court Docs Reveal",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Fri, 22 Aug 2025 03:06:15 GMT",
    "source": "CNBC",
    "sources": [
      "Business Insider",
      "CNBC",
      "Financial Times"
    ],
    "domains": [
      "www.cnbc.com",
      "www.businessinsider.com",
      "www.ft.com"
    ],
    "snippets": [
      "In early 2025, xAI CEO Elon Musk asked Meta's Mark Zuckerberg to help him finance a $97.4 billion takeover of OpenAI, new court filings revealed.",
      "Tesla billionaire made offer for ChatGPT maker’s core business in February",
      "Elon Musk wanted Mark Zuckerberg to join him in his bid to buy OpenAI, the startup said in a court filing on Thursday."
    ],
    "image_url": "",
    "titles": [
      "Elon Musk asked Meta CEO Mark Zuckerberg to join xAI bid to buy OpenAI, filing shows",
      "Musk tried to enlist Zuckerberg in $100bn bid for OpenAI",
      "Musk tried to get Zuckerberg on board to buy OpenAI, says the AI company"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.882,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.72,
    "summary": "In early 2025, Tesla CEO Elon Musk sought financial assistance from Meta's CEO Mark Zuckerberg for a $97.4 billion acquisition of OpenAI, the creator of ChatGPT. This information was disclosed in recent court documents. Musk's proposal to Zuckerberg aimed at purchasing OpenAI's main operations was made in February, as stated in a court filing.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic",
    "image": {
      "src": "icons/briefcase.svg",
      "thumbnail": "icons/briefcase.svg",
      "alt": "business",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Colombia's President Petro Terms Dissidents, Cartels as 'Terrorists'",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Fri, 22 Aug 2025 03:27:08 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Washington Post",
      "Deutsche Welle",
      "Al Jazeera"
    ],
    "domains": [
      "www.washingtonpost.com",
      "www.dw.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Colombian President Gustavo Petro says armed dissidents, drug trafficking cartels should be considered &#039;terrorists&#039;.",
      "Colombian authorities have blamed the two incidents on separate dissident factions of FARC, the disbanded leftist guerrilla group.",
      "A wave of attacks by armed groups across Colombia this year has left Colombians fearing a return to the country’s more violent past."
    ],
    "image_url": "",
    "titles": [
      "At least 18 killed in Colombia in drone attack on helicopter, car bombing",
      "Colombia: truck bomb, helicopter downing kill at least 17",
      "Truck bomb and helicopter downing in Colombia leave at least 13 dead"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.907,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.718,
    "summary": "Colombian President Gustavo Petro has labeled armed dissidents and drug trafficking cartels as 'terrorists,' attributing recent violence, including two incidents, to factions of the disbanded FARC guerrilla group. This surge in attacks has sparked concerns among Colombians of a potential return to the nation's historically violent periods.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic",
    "image": {
      "src": "icons/newspaper.svg",
      "thumbnail": "icons/newspaper.svg",
      "alt": "general",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Steelers Beat Panthers 19-10 in Preseason Finale; Key Players Shine",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Fri, 22 Aug 2025 02:20:48 +0000",
    "source": "CBS Sports",
    "sources": [
      "Yahoo Sports",
      "CBS Sports",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "steelerswire.usatoday.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Harmon, the No. 21 pick, appears to have avoided a serious injury based on initial feedback",
      "Skylar Thompson, Yahya Black, Scotty Miller, and three more Steelers highlight the top performances in the Week 3 preseason win over the Panthers.",
      "<p>Skylar Thompson completed 11 of 13 passes for 152 yards, including a 24-yard touchdown strike to Lance McCutcheon, rookie Ben Sauls kicked four field goals, and the Pittsburgh Steelers beat the Carolina Panthers 19-10 on Thursday night in the preseason finale.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/08/22/486a6aac-da57-42da-8ef2-296c7904740e/harmon.jpg",
    "titles": [
      "Derrick Harmon injury: Steelers first-round pick carted off with knee sprain in preseason game vs. Panthers",
      "6 Steelers standouts from preseason Week 3 win over Panthers",
      "Steelers top Panthers in pre-season finale, lose Harmon to knee injury"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.886,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.714,
    "summary": "In the preseason finale, the Pittsburgh Steelers secured a 19-10 victory over the Carolina Panthers, with notable performances from Skylar Thompson, Yahya Black, Scotty Miller, and three other Steelers. Thompson completed 11 of 13 passes for 152 yards and a touchdown, while rookie Ben Sauls contributed with four field goals. Additionally, Harmon, the No. 21 draft pick, has reportedly avoided a serious injury according to initial feedback.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Erik Menendez Denied Parole 36 Years After Parents' Murder",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 22 Aug 2025 02:36:58 GMT",
    "source": "BBC",
    "sources": [
      "ABC News",
      "Deutsche Welle",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "abcnews.go.com",
      "www.dw.com"
    ],
    "snippets": [
      "The younger of the Menendez brothers, who killed their parents in their Beverly Hills mansion, can try again for parole in three years.",
      "Erik and his brother Lyle were convicted of the killings and sentenced to life without parole in 1996. Lyle's parole hearing is set for Friday.",
      "Erik Menendez was denied parole during his first-ever parole hearing on Thursday, 36 years and one day after he and his brother killed their parents."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/fe29/live/7cfe6290-7eb2-11f0-a5e2-236e16f99597.jpg",
    "titles": [
      "Erik Menendez denied parole three decades after killing his parents",
      "US: Erik Menendez denied parole after parents' murder",
      "Erik Menendez denied parole 36 years after murdering his parents"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.873,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.711,
    "summary": "Erik Menendez, convicted alongside his brother Lyle for the murder of their parents in their Beverly Hills home in 1989, was denied parole at his first hearing since their sentencing to life without parole in 1996. The decision came 36 years and one day after the crime. Erik is eligible to reapply for parole in three years, while Lyle's parole hearing is scheduled for Friday.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic",
    "image": {
      "src": "icons/newspaper.svg",
      "thumbnail": "icons/newspaper.svg",
      "alt": "general",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Judge Disqualifies Trump Lawyer Alina Habba from Case Over Appointment Issue",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Thu, 21 Aug 2025 23:28:38 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Axios",
      "CNBC",
      "Al Jazeera"
    ],
    "domains": [
      "www.cnbc.com",
      "news.google.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "The Trump administration has ignored a July decision from a panel of judges replacing Habba as interim US attorney.",
      "<a href=\"https://news.google.com/rss/articles/CBMiiwFBVV95cUxPRDg5TlZvRjFPV0tfQWJmVFZFSDRub09JX045QV92bzN3WHFUZlJMWW9Fa2R5SXFnQ0FGd1BJYWZrUlFaLVdsZmpiaTNvUHZlalVmQjhIRVowREFmWmFZUXpkSHFvNGpLbEJ2eGVEVnY4VmQxU0FpM29wcnpObVJwanNEaTlBckRrbWVv?oc=5\" target=\"_blank\">Alina Habba \"unlawfully appointed\" New ",
      "Alina Habba, who has served as the acting U.S. Attorney for New Jersey, is a former lawyer for President Donald Trump."
    ],
    "image_url": "",
    "titles": [
      "Judge rules Trump lawyer Alina Habba is unlawfully serving as US attorney",
      "Alina Habba \"unlawfully appointed\" New Jersey AG, federal judge rules - Axios",
      "Judge says Alina Habba, Trump's top federal prosecutor in New Jersey, not lawfully appointed"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.835,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.711,
    "summary": "Alina Habba, previously a lawyer for Donald Trump and acting as the U.S. Attorney for New Jersey, was disqualified by a judge from overseeing a case. This decision came after criminal defendants challenged her authority, citing her appointment as \"unlawful.\" The Trump administration has not adhered to a July ruling from a panel of judges that mandated replacing Habba as the interim U.S. attorney.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic",
    "image": {
      "src": "icons/newspaper.svg",
      "thumbnail": "icons/newspaper.svg",
      "alt": "general",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "SEC to Adopt Nine-Game Football Schedule in 2026 for Enhanced Competition",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Fri, 22 Aug 2025 00:58:06 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "The SEC said Thursday that it will go with a nine-game conference football schedule starting in 2026.",
      "The development comes on the heels of the College Football Playoff committee updating its metrics"
    ],
    "image_url": "",
    "titles": [
      "SEC to go with 9-game schedule starting in '26",
      "SEC adopts nine-game conference slate starting in 2026 as CFP metrics shift emphasis on schedule strength"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.936,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.667,
    "summary": "The SEC announced a shift to a nine-game conference football schedule beginning in 2026. This decision follows the College Football Playoff committee's update on metrics. The change aims to enhance competition within the conference.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic",
    "image": {
      "src": "icons/football.svg",
      "thumbnail": "icons/football.svg",
      "alt": "football",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "West Ham Hosts Chelsea, Potter Under Pressure for Positive Result",
    "domain": "sports",
    "source_domain": "www.independent.co.uk",
    "location": "national",
    "published": "Fri, 22 Aug 2025 07:00:00 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports",
      "Sports Illustrated"
    ],
    "domains": [
      "news.google.com",
      "www.independent.co.uk",
      "onefootball.com"
    ],
    "snippets": [
      "Follow our football betting tips as West Ham host Chelsea on Friday night",
      "Graham Potter is under immediate pressure to get a response from his West Ham side as they prepare for their first home game of the season against Chelsea on Friday.The Hammers are looking to bounce b...",
      "<a href=\"https://news.google.com/rss/articles/CBMimAFBVV95cUxPcEk2SGR6R3NjZHhJZ0hoR0JhTmN3WG5sWjZhUjR3NmlaZmhUWEM0R09nZk5mel9BZGMxNmZzOFViMnpPUmdZTmtUNDdOQVpOYTJyUXFOLXdOek5xYU1TbDdfbWctQ0JPbC1rMkpKZ3RSWVdwcGJkVVA0NWpCSTFIU1licm9jbEFwb2gwTUNQRjJEc3RqVjlFcA?oc=5\" target=\"_blank\">Chelsea Predicted Lin"
    ],
    "image_url": "",
    "titles": [
      "West Ham vs Chelsea prediction, team news & odds",
      "West Ham United vs Chelsea – Predicted lineup and team news",
      "Chelsea Predicted Lineup vs. West Ham: Estevao Ready for First Premier League Start - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.976,
      "consensus": 0.611,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.665,
    "summary": "West Ham is set to host Chelsea in their first home game of the season on Friday night, with manager Graham Potter facing pressure to deliver a positive result. This match is significant for West Ham as they seek to bounce back and gain momentum early in the season. The outcome of this game could be crucial for Potter's efforts to stabilize his team and build confidence.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic",
    "image": {
      "src": "icons/uk.svg",
      "thumbnail": "icons/uk.svg",
      "alt": "uk flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "OpenAI Chief People Officer Julia Villagra to Depart Friday",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Fri, 22 Aug 2025 01:43:12 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Business Insider"
    ],
    "domains": [
      "www.cnbc.com",
      "www.businessinsider.com"
    ],
    "snippets": [
      "OpenAI confirmed on Thursday that Julia Villagra, the company's chief people officer, is leaving at the end of the week.",
      "Julia Villagra, OpenAI's chief people officer, is leaving the company on Friday."
    ],
    "image_url": "",
    "titles": [
      "OpenAI says HR chief Julia Villagra is leaving company",
      "OpenAI's chief people officer is leaving the company"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.857,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.633,
    "summary": "Julia Villagra, the chief people officer at OpenAI, is departing from the company at the end of the week. OpenAI confirmed her departure, stating that she will be leaving on Friday.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic",
    "image": {
      "src": "icons/briefcase.svg",
      "thumbnail": "icons/briefcase.svg",
      "alt": "business",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Bill Belichick Experiences Reduced Duties, Family Roles in North Carolina",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Fri, 22 Aug 2025 02:10:00 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sports Illustrated"
    ],
    "domains": [
      "news.google.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "At North Carolina, Belichick has fewer people -- and offspring -- to answer to than with the Patriots",
      "<a href=\"https://news.google.com/rss/articles/CBMinAFBVV95cUxNajRDNnQ2MkRJRWdBdFAzVzI5TUVoN3RURHB0M0ZlNWZVQ0hORmxZQlB2cEVJQm02TU41VXlQR0NCQjd0SXkzdnNVUExqMC05YVhjMDZHOU1rTklMdW1pbGJuWmFhLVJBNkVlN1VKQUdzaWtHSlk2Q3ZnYXREZmRmNTdkZndNZTlJeXFJZGFDNENqeThpMlBZZGxhRzU?oc=5\" target=\"_blank\">Bill Belichick R"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/08/22/2cda9fd8-251f-41d8-a8fb-f08648d5c1c1/gettyimages-2210133758-2.jpg",
    "titles": [
      "Bill Belichick on difference between coaching in college vs. NFL: 'There's no owner, there's no owner's son'",
      "Bill Belichick Reveals Major Difference Between Coaching College and Pro Football - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.883,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.632,
    "summary": "Bill Belichick, in North Carolina, has fewer responsibilities and family members to manage compared to his duties with the New England Patriots. This change in his personal and professional environment is highlighted, indicating a shift in his daily obligations and interactions.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Houston Astros Sign Former All-Star Pitcher Craig Kimbrel",
    "domain": "sports",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Thu, 21 Aug 2025 23:31:30 GMT",
    "source": "Sports Illustrated",
    "sources": [
      "Sports Illustrated",
      "Sportsnet"
    ],
    "domains": [
      "news.google.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMihgFBVV95cUxQNUZfX09sRTBDc0hFcXluLVFiY3Y3T3lwY0xzZ1QxZS1WWHFoUEhwbHI5NUQxWm44TFU3SEZzZlhHblJEQVJVdnZuSTJZZEZiZnI1TWFPcmpnTjA3SHdaZ3FMQ0lrR3JOcnNJLTdLTTFySWI1TUphaThoQVFCbDQwcXY5bDJDZw?oc=5\" target=\"_blank\">Astros Sign Former All-Star Relief Pitcher Cr",
      "<p>Craig Kimbrel has found his next landing spot. The veteran reliever is reportedly signing with the Houston Astros and will be joining the major-league roster, per ESPN&#8217;s Jeff Passan on Thursday.</p>"
    ],
    "image_url": "",
    "titles": [
      "Astros Sign Former All-Star Relief Pitcher Craig Kimbrel - Sports Illustrated",
      "Report: Astros signing veteran reliever, nine-time all-star Craig Kimbrel"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.818,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.626,
    "summary": "The Houston Astros have signed former All-Star relief pitcher Craig Kimbrel. Kimbrel will be joining the team's major-league roster, as reported by ESPN's Jeff Passan. This move marks a significant addition to the Astros' bullpen and provides them with an experienced and talented pitcher.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Henley Leads Tour Championship Opening, Scheffler Close Behind",
    "domain": "sports",
    "source_domain": "www.skysports.com",
    "location": "global",
    "published": "Thu, 21 Aug 2025 23:55:00 BST",
    "source": "Sky Sports",
    "sources": [
      "Sky Sports",
      "Sportsnet"
    ],
    "domains": [
      "www.skysports.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Scottie Scheffler sits second, two shots off the Tour Championship lead, after a stunning nine-under 61 from Russell Henley in the race for the FedExCup.",
      "<p>ussell Henley hardly missed a putt. Scottie Scheffler hardly missed a fairway. They led a parade of players who seized on the soft conditions at East Lake to begin the race for the Tour Championship and the season-ending FedEx Cup title.</p>"
    ],
    "image_url": "https://e0.365dm.com/25/08/1920x1080/skysports-scottie-scheffler_6997288.jpg?20250821232457",
    "titles": [
      "Scheffler two off Tour Championship lead as Henley cards opening 61",
      "Russell Henley birdies last 3 holes for 61 to lead Tour Championship over Scheffler"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.825,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.62,
    "summary": "Russell Henley and Scottie Scheffler led the opening round of the Tour Championship, taking advantage of soft conditions at East Lake. Henley leads after a remarkable nine-under 61, with Scheffler two shots behind following a 63. Other notable performances included Fleetwood and MacIntyre each shooting a 64. The event marks the final race for the season-ending FedExCup title, with players like Rory McIlroy also in contention, despite being five shots off the lead after an opening 66.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Millie Bobby Brown and Jake Bongiovi Adopt Baby Girl",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 21 Aug 2025 16:53:06 GMT",
    "source": "BBC",
    "sources": [
      "Business Insider",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.businessinsider.com"
    ],
    "snippets": [
      "The Stranger Things star and Jake Bongiovi say they are \"beyond excited to embark on this beautiful next chapter\".",
      "\"Stranger Things\" star Millie Bobby Brown and her husband, Jake Bongiovi, announced they adopted a baby girl. The young couple got married in 2024."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/546d/live/36a70490-7eae-11f0-a5e2-236e16f99597.jpg",
    "titles": [
      "Millie Bobby Brown and husband adopt a baby girl",
      "Millie Bobby Brown and Jake Bongiovi's relationship timeline, from meeting on Instagram to adopting a baby girl"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.713,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.598,
    "summary": "\"Stranger Things\" actress Millie Bobby Brown and her husband, Jake Bongiovi, have shared their joy in becoming parents after adopting a baby girl. The couple, aged 21 and 23, tied the knot in 2024.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic",
    "image": {
      "src": "icons/briefcase.svg",
      "thumbnail": "icons/briefcase.svg",
      "alt": "business",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Bulinews Offers Budget-Friendly Bundesliga Fantasy Tips and Squad Picks",
    "domain": "sports",
    "source_domain": "onefootball.com",
    "location": "national",
    "published": "Fri, 22 Aug 2025 07:18:00 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "onefootball.com"
    ],
    "snippets": [
      "When building your Fantasy Bundesliga squad, budget picks can be crucial in freeing up funds for premium stars.In this article, we spotlight one budget-friendly option from each club to help you shape...",
      "Bulinews' Fantasy Bundesliga writers have each put together a squad of 10 outfield players for the opening matchday of the new season.Managers have full freedom with formations, but squads can’t exc..."
    ],
    "image_url": "",
    "titles": [
      "Fantasy Bundesliga: Budget picks to consider",
      "Fantasy Bundesliga: Scout squads for Matchday 1"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.983,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.465,
    "summary": "Bulinews' Fantasy Bundesliga coverage includes budget-friendly player options from each club to help managers assemble their squads while saving funds for premium stars. Additionally, their writers have created squads of 10 outfield players for the new season's opening matchday, showcasing diverse formations but adhering to a budget constraint. This approach aids fantasy managers in making strategic choices for their teams.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  }
]