[
  {
    "title": "Katie Taylor Beats Serrano Again, Retains Title at Historic MSG Bout",
    "domain": "sports",
    "location": "global",
    "published": "Sat, 12 Jul 2025 06:16:49 GMT",
    "source": "BBC",
    "sources": [
      "ESPN",
      "Sky Sports",
      "Yahoo Sports",
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "sports",
      "general"
    ],
    "snippets": [
      "Ireland's Katie Taylor beats Amanda Serrano for the third time in their epic trilogy, winning their bout at New York's Madison Square Garden.",
      "Katie Taylor outpointed Amanda Serrano once again to retain her undisputed junior welterweight title.",
      "Ireland's Katie Taylor beats Amanda Serrano for the third time in their epic trilogy, winning their bout at New York's Madison Square Garden.",
      "<ul><li><p>Katie Taylor wins majority decision to retain titles</p></li><li><p>MSG hosts historic all-women’s card for trilogy bout</p></li><li><p><a href=\"https://www.theguardian.com/sport/live/2025/jul/11/katie-taylor-v-amanda-serrano-iii-undisputed-womens-junior-welterweight-championship-live-upd",
      "Katie Taylor beat Amanda Serrano by unanimous decision to defend the undisputed super-lightweight championship and complete a clean sweep of three victories in their trilogy."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/b8c7/live/9a128120-5ede-11f0-b849-cfa51a96038d.jpg",
    "titles": [
      "Taylor triumphs over Serrano in trilogy",
      "Fight results: Katie Taylor defeats Amanda Serrano in trilogy fight",
      "Taylor triumphs over Serrano in trilogy",
      "Taylor outpoints Serrano to cap classic trilogy on historic all-women’s card",
      "Taylor completes Serrano trilogy as Marshall suffers upset defeat"
    ],
    "score_components": {
      "magnitude": 0.82,
      "recency": 0.962,
      "consensus": 1.0,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.839,
    "summary": "Katie Taylor defeated Amanda Serrano for the third time, securing a unanimous decision victory at New York's Madison Square Garden to retain her undisputed junior welterweight title. This historic bout was part of an all-women’s card, marking a significant event in boxing history. Taylor's win concludes their trilogy with a clean sweep of victories against Serrano.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful context about the progression of women's boxing, highlighting a historic event. It does not, however, delve into systemic issues or offer actionable insights for the reader. The focus is more on the individual achievement of Katie Taylor."
  },
  {
    "title": "Air India Crash Report: No Fault Found in Boeing, Focus on Pilots' Actions",
    "domain": "general",
    "location": "national",
    "published": "Fri, 11 Jul 2025 17:29:48 -0400",
    "source": "NPR",
    "sources": [
      "Al Jazeera",
      "New York Times",
      "NPR",
      "Financial Times",
      "The Guardian"
    ],
    "domains": [
      "business",
      "general"
    ],
    "snippets": [
      "Indian investigators determined the Boeing 787 Dreamliner was properly configured and lifted off normally. But three seconds after takeoff, the engines' fuel switches were cut off.",
      "Preliminary investigation does not apportion blame for Boeing 787 crash that killed 260 people in June.",
      "Preliminary findings recommend ‘no actions’ against Boeing or GE Aerospace over incident",
      "<p>Early investigation into accident in Ahmedabad in June also contains details of pilots discussing the switches</p><p>Fuel to both engines of the Air India plane that <a href=\"https://www.theguardian.com/world/2025/jun/12/london-bound-air-india-flight-ai171-plane-crash-people-onboard-ahmedabad\">cr",
      "A focus on the Boeing 787’s fuel switches in a preliminary assessment raised questions about the pilots’ actions, but much is still unknown about Flight 171."
    ],
    "image_url": "",
    "titles": [
      "Preliminary report says fuel switches were cut off before Air India Boeing 787 crash",
      "Fuel switches cut off just before deadly Air India crash, early report says",
      "Fuel to Air India 171’s engines was cut off seconds before fatal crash, report says",
      "Engine fuel switches cut off before Air India crash that killed 260, preliminary report finds",
      "Air India Plane Crash Report Says Fuel to Engines Was Cut Off"
    ],
    "score_components": {
      "magnitude": 0.82,
      "recency": 0.801,
      "consensus": 1.0,
      "constructiveness": 0.6,
      "proximity": 0.75
    },
    "score": 0.832,
    "summary": "Indian investigators' preliminary report on the Air India crash in Ahmedabad in June, which resulted in 260 deaths, reveals that the Boeing 787 Dreamliner was correctly configured for takeoff. However, seconds after takeoff, the plane's engines' fuel switches were cut off. Despite detailing this critical incident, the investigation does not blame Boeing or GE Aerospace and recommends no actions against them. The report also mentions discussions between pilots regarding the switches, focusing attention on their actions during the incident.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information about the preliminary findings of the crash investigation. It increases awareness about the incident and the systems involved in aviation safety. However, it lacks progress or actionable insights as it does not suggest any solutions or improvements to prevent similar incidents in the future."
  },
  {
    "title": "Judge Halts ICE, Border Patrol Stops in 7 CA Counties Amid Profiling Claims",
    "domain": "general",
    "location": "national",
    "published": "Fri, 11 Jul 2025 23:08:34 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "The Guardian",
      "CNBC"
    ],
    "domains": [
      "business",
      "general"
    ],
    "snippets": [
      "Civil rights groups alleged that ICE and Border Patrol agents are rounding people up based on their race, and denying them access to lawyers. A federal judge said there's  evidence what they're doing is illegal.",
      "A federal judge on Friday ordered the Trump administration to halt indiscriminate immigration stops and arrests in seven California counties, including Los Angeles.",
      "<p>Judge issues temporary block in seven counties including Los Angeles after lawsuit accuses government of systematically targeting brown-skinned people</p><p>A federal judge has ordered the Trump administration to halt indiscriminate immigration stops and arrests in seven California counties, incl"
    ],
    "image_url": "",
    "titles": [
      "Federal judge orders stop to indiscriminate immigration raids in Los Angeles",
      "Judge orders Trump administration to halt indiscriminate immigration stops, arrests in California",
      "Trump administration ordered to halt indiscriminate immigration stops in California over racial profiling concerns"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.901,
      "consensus": 0.897,
      "constructiveness": 0.8,
      "proximity": 0.75
    },
    "score": 0.811,
    "summary": "A federal judge has temporarily blocked ICE and Border Patrol from conducting indiscriminate immigration stops and arrests in seven California counties, including Los Angeles. This decision came after civil rights groups accused the agencies of racially profiling and denying individuals access to lawyers, with the judge finding evidence of potentially illegal practices. The lawsuit claimed the government was systematically targeting people based on their skin color.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it provides useful information about a legal decision that impacts immigration practices, potentially affecting many people's lives. It also raises awareness about issues of racial profiling and access to legal representation, important social justice topics. However, it doesn't report on any solutions or improvements to the problem, hence the score is not higher."
  },
  {
    "title": "Court Nullifies 9/11 Mastermind's Plea Deal, Keeps Death Penalty Option",
    "domain": "general",
    "location": "global",
    "published": "Fri, 11 Jul 2025 20:40:06 +0000",
    "source": "Al Jazeera",
    "sources": [
      "CityNews",
      "Al Jazeera",
      "Deutsche Welle",
      "New York Times"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "A civilian court of appeals says ex-Pentagon chief Lloyd Austin &#039;had full legal authority&#039; to withdraw plea agreement.",
      "A divided federal appeals court has scrapped an agreement that would have allowed the alleged September 11 mastermind Khalid Sheikh Mohammed to plead guilty in a deal sparing him the risk of execution.",
      "The court found that Defense Secretary Lloyd J. Austin III had the authority to invalidate a contract reached between the accused mastermind and a Pentagon official.",
      "WASHINGTON (AP) — A divided federal appeals court on Friday threw out an agreement that would have allowed accused Sept. 11 mastermind Khalid Sheikh Mohammed to plead guilty in a deal sparing him the risk of execution for al-Qaida’s 2001 attacks. The decision by a panel of the federal appeals court "
    ],
    "image_url": "",
    "titles": [
      "US court nixes guilty plea for alleged 9/11 attacks mastermind",
      "US: Court throws out plea deal for alleged 9/11 mastermind",
      "Appeals Court Overturns Plea Deal in 9/11 Case",
      "Appeals court throws out plea deal for alleged mastermind of Sept. 11 attacks"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.788,
      "consensus": 0.935,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.771,
    "summary": "A federal appeals court has overturned an agreement that would have allowed Khalid Sheikh Mohammed, the accused mastermind behind the September 11 attacks, to plead guilty while avoiding the death penalty. The court ruled that Defense Secretary Lloyd J. Austin III had the legal authority to nullify the plea deal previously reached with a Pentagon official. This decision maintains the possibility of execution for Mohammed.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness about the court's decision regarding the 9/11 mastermind's plea deal. It provides some insight into the legal proceedings related to high-profile terrorism cases. However, it does not provide actionable insights, solutions, or a deeper understanding of the broader implications of this decision."
  },
  {
    "title": "US Raids on Undocumented Immigrants: 200 Arrested, 1 Dead, 10 Children Rescued",
    "domain": "general",
    "location": "global",
    "published": "Sat, 12 Jul 2025 03:32:30 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Deutsche Welle",
      "The Guardian"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "Authorities said they arrested about 200 immigrants and saved 10 children at risk of exploitation during the raids.",
      "Raids are part of Donald Trump's latest efforts to detain undocumented immigrants in the United States. During the raid on a farm that led to the death of a worker, officers arrested 200 undocumented immigrants.",
      "<p>Jaime Alanis died after sustaining injuries during raid where authorities say they arrested about 200 people</p><p>A farmworker died Friday from injuries that he sustained a day earlier in raids on two California cannabis farm sites as US immigration authorities confirmed they arrested 200 worker"
    ],
    "image_url": "",
    "titles": [
      "Worker dies following immigration raids on California cannabis farms",
      "US: Worker dies after immigration raid on cannabis farm",
      "Farm worker dies a day after chaotic immigration raid at California farm"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.909,
      "consensus": 0.847,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.756,
    "summary": "During raids targeting undocumented immigrants in the United States, part of Donald Trump's immigration enforcement efforts, authorities arrested about 200 individuals and rescued 10 children at risk of exploitation. These operations included a raid on a California cannabis farm, where farmworker Jaime Alanis died from injuries sustained. The raids aimed at detaining undocumented immigrants resulted in one fatality and the arrest of 200 people.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information about the outcomes of immigration enforcement efforts, which can inform readers about the ongoing situation. However, it lacks depth on the broader impacts, causes, or potential solutions to the issues surrounding immigration enforcement. The story also doesn't contextualize the events in a way that could empower readers or contribute to their understanding of the broader immigration system."
  },
  {
    "title": "Liverpool FC Retires No. 20 Shirt in Memory of Diogo Jota",
    "domain": "sports",
    "location": "global",
    "published": "Fri, 11 Jul 2025 19:36:32 GMT",
    "source": "BBC",
    "sources": [
      "Sky Sports",
      "BBC",
      "ESPN"
    ],
    "domains": [
      "sports",
      "general"
    ],
    "snippets": [
      "Liverpool are to retire the number 20 shirt in honour of Diogo Jota, who died in a car crash along with his brother Andre Silva.",
      "Liverpool have confirmed they will retire the No. 20 shirt in honour of forward Diogo Jota, who died in a car crash alongside brother André Silva last week.",
      "Liverpool have confirmed that the number 20 shirt will be permanently retired in honour of Diogo Jota."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/db87/live/af8d0620-5e8d-11f0-b003-c12cdae35db2.jpg",
    "titles": [
      "Liverpool to retire number 20 in honour of Jota",
      "Liverpool retire No. 20 jersey in memory of Jota",
      "Liverpool to retire number 20 in honour of Jota"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.77,
      "consensus": 0.897,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.703,
    "summary": "Liverpool FC has permanently retired the No. 20 shirt in memory of Diogo Jota, following his tragic death in a car crash at the age of 28. Jota died alongside his brother, André Silva, in the incident. This decision reflects the club's respect and commemoration for Jota, and the number will no longer be used across all of the club’s teams.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "While the story provides basic awareness about the tragic event and the club's decision to honor Diogo Jota, it doesn't offer deeper insights or understanding. It doesn't discuss the impact of this decision on the team or the broader football community, nor does it provide context about Jota's career or contributions to the club."
  },
  {
    "title": "Josh Nagel Releases Top Picks for Taylor vs. Serrano Title Fight",
    "domain": "sports",
    "location": "national",
    "published": "Sat, 12 Jul 2025 03:02:05 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Forbes"
    ],
    "domains": [
      "business",
      "sports"
    ],
    "snippets": [
      "The legendary fighters makes his return after four years away against a rising champion",
      "The pair of all-time greats meet for a third and final time on Friday night in New York",
      "The historic all-women’s boxing card is underway. In the main event, Katie Taylor will face Amanda Serrano for a third time. Follow here for all of the results."
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/07/12/88d7f082-6b2c-4e0f-9b4d-0b7a4948c6ef/pacquiao-barrios-presser.jpg",
    "titles": [
      "Manny Pacquiao vs. Mario Barrios: Fight card, odds, start time, date, PPV price, location, complete guide",
      "Katie Taylor vs. Amanda Serrano 3: Fight card, odds, start time, date, PPV price, location, complete guide",
      "Katie Taylor Vs. Amanda Serrano Results And Full Fight Card Results"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.899,
      "consensus": 0.682,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.67,
    "summary": "Josh Nagel, a combat expert from SportsLine, has issued his top picks for the highly anticipated boxing match between Katie Taylor and Amanda Serrano. This fight, part of an historic all-women's boxing card, is set for the junior welterweight title at Madison Square Garden. The event is currently ongoing, with Taylor and Serrano facing off for the third time in the main event.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about an expert's predictions for an upcoming boxing match. It could help readers make informed decisions if they are interested in betting on the match or simply following the event. However, it does not report on solutions, improvements, or innovations."
  },
  {
    "title": "Palestinian American Killed in West Bank Amid Regional Tensions",
    "domain": "general",
    "location": "national",
    "published": "Sat, 12 Jul 2025 01:24:40 GMT",
    "source": "Axios",
    "sources": [
      "Washington Post",
      "Axios"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMihgFBVV95cUxQOTZWWFplTVV1MmZMZWstWWFGQzNJTm9NVnFVeGVNeVh4WjEydnVfdlNJR25EelFzUmw5bUx0MklZb2dKUlBUTzh0aEVzeHVMWUVXaDhnZEtxQ2ZSLW5uT3gyWnM2UlNfaU5LcjF4SE5aMjZxdk05UDJVcTUyUkdSUmJrVVkzUQ?oc=5\" target=\"_blank\">Palestinian American killed in Israeli settle",
      "Sayfollah Kamel Musallet, who lived in Tampa and was an American citizen, his family said, was visiting relatives in the West Bank when he was killed."
    ],
    "image_url": "",
    "titles": [
      "Palestinian American killed in Israeli settler attack in West Bank - Axios",
      "Palestinian American from Florida killed in the West Bank, family says"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.869,
      "consensus": 0.632,
      "constructiveness": 0.5,
      "proximity": 0.75
    },
    "score": 0.667,
    "summary": "Palestinian American Sayfollah Kamel Musallet, a resident of Tampa and U.S. citizen, was visiting family in the West Bank when he was killed. The circumstances surrounding his death are not yet clear. The incident highlights ongoing tensions in the region.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story raises basic awareness about the ongoing tensions in the West Bank and the risks faced by individuals in the region. However, it doesn't provide deeper insights into the causes of these tensions, their broader impacts, or potential solutions. The lack of clarity around the circumstances of the individual's death also limits the story's usefulness in informing readers."
  },
  {
    "title": "Firefly Aerospace Plans IPO, Aims for Nasdaq Listing as \"FLY\"",
    "domain": "business",
    "location": "national",
    "published": "Fri, 11 Jul 2025 22:57:39 GMT",
    "source": "CNBC",
    "sources": [
      "TechCrunch",
      "CNBC"
    ],
    "domains": [
      "business",
      "technology"
    ],
    "snippets": [
      "Rocket maker Firefly Aerospace filed for an initial public offering on Friday, with plans to trade under the ticker symbol \"FLY\" on the Nasdaq.",
      "Firefly is heading into the initial public offering with $176.9 million in cash and cash equivalents. And while it has incurred negative cash flows and losses from operations, Firefly projected that its cash is adequate to meet its liquidity needs for at least 12 months."
    ],
    "image_url": "",
    "titles": [
      "Rocket maker Firefly Aerospace files to go public under ticker FLY",
      "Firefly Aerospace files for an IPO"
    ],
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.826,
      "consensus": 0.682,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.663,
    "summary": "Firefly Aerospace announced its plan to go public through an initial public offering (IPO), aiming to list on the Nasdaq with the ticker symbol \"FLY\". The company, which specializes in rocket manufacturing, reported having $176.9 million in cash and cash equivalents. Despite experiencing negative cash flows and operational losses, Firefly has projected its current cash reserves will support its liquidity requirements for at least the next 12 months.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information about Firefly Aerospace's financial situation and future plans, which could help readers make informed decisions about investing. However, it does not report on any solutions, improvements, or innovations in the company's operations, nor does it provide a deeper understanding of the broader trends or impacts in the aerospace industry."
  },
  {
    "title": "Boeing Settles With Man Who Lost Family in 737 Max Crash, Avoids Trial",
    "domain": "business",
    "location": "national",
    "published": "Fri, 11 Jul 2025 22:56:14 +0000",
    "source": "Financial Post",
    "sources": [
      "CityNews",
      "Financial Post"
    ],
    "domains": [
      "business",
      "general"
    ],
    "snippets": [
      "CHICAGO (AP) &#8212; Boeing reached a settlement Friday with a Canadian man whose wife and three children were killed in a deadly 2019 crash in Ethiopia, averting the first trial connected to a devastating event that led to a worldwide grounding of Max jets. The jury trial at Chicago&#8217;s federal",
      "CHICAGO (AP) — Boeing reached a settlement Friday with a Canadian man whose wife and three children were killed in a deadly 2019 crash in Ethiopia, averting the first trial connected to a devastating event that led to a worldwide grounding of Max jets. The jury trial at Chicago’s federal court had b"
    ],
    "image_url": "",
    "titles": [
      "Boeing settles with a man whose family died in a 737 Max crash in Ethiopia",
      "Boeing settles with a man whose family died in a 737 Max crash in Ethiopia"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.826,
      "consensus": 0.682,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.656,
    "summary": "Boeing has settled with a Canadian man whose wife and three children died in the 2019 Ethiopian Airlines crash involving a 737 Max jet. This agreement avoids the first trial linked to the incident that caused global Max jet groundings. The settlement was reached in Chicago's federal court, preventing the jury trial from proceeding.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story informs about a significant legal settlement related to a major aviation incident. It provides useful context about the ongoing legal and safety issues surrounding the 737 Max jet. However, it does not report on solutions to the underlying problems or provide empowering knowledge to the reader."
  },
  {
    "title": "Rookie Misiorowski Named to NL All-Star Team After 5 MLB Games",
    "domain": "sports",
    "location": "national",
    "published": "Sat, 12 Jul 2025 04:03:16 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sportsnet"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Misiorowski has been lightning on the mound, but he has also only made a handful of appearances",
      "<p>The Milwaukee Brewers star rookie right-hander was named to the National League All-Star team on Friday, just five games into his MLB career.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/07/12/4196ae2a-2a62-4ce9-a7b0-504e1245c8a7/jacob-misiorowski-brewers.jpg",
    "titles": [
      "Brewers rookie Jacob Misiorowski added to National League All-Star roster after just five starts",
      "Brewers rookie Jacob Misiorowski named NL All-Star after just five games"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.919,
      "consensus": 0.632,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.652,
    "summary": "The Milwaukee Brewers' rookie right-hander, Misiorowski, was named to the National League All-Star team after making just five appearances in his MLB career. Despite the limited number of games, his performance on the mound has been exceptionally noteworthy, earning him this prestigious recognition early in his career.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story offers basic awareness about a significant achievement in the career of a rookie baseball player. However, it lacks depth and does not provide actionable insights or understanding of broader trends or systems within the sport."
  },
  {
    "title": "798 Dead in Gaza Aid Access Attempts, GHF Questions Figures",
    "domain": "general",
    "location": "global",
    "published": "2025-07-11T18:25:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "The Guardian"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "The OHCHR released figures that showed at least 798 people have been killed trying to access aid in the Gaza Strip over the past 10 weeks. The much-maligned GHF have cast doubt on the veracity of the numbers.",
      "<p>UN human rights office says 615 of the deaths were in vicinity of sites run by the Gaza Humanitarian Foundation</p><p>At least 798 people have been killed while seeking food at distribution points operated by the US- and Israeli-backed Gaza Humanitarian Foundation and other humanitarian convoys s",
      "<p>Majority of those killed were in the vicinity of sites run by the Israeli-backed Gaza Humanitarian Foundation </p><p><strong>The number of people killed by strikes in Gaza on Friday has risen to seven, according to the region’s civil defence agency, Agence France-Presse (AFP) reports.</strong></p"
    ],
    "image_url": "",
    "titles": [
      "Gaza: UN says nearly 800 killed near aid centers since May",
      "Nearly 800 killed at Gaza food hubs and aid convoy routes since end of May, UN says",
      "Middle East crisis live: Almost 800 people killed in Gaza while trying to get food aid since end of May, says UN – as it happened"
    ],
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.752,
      "consensus": 0.632,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.645,
    "summary": "The OHCHR reported that at least 798 individuals have died over the past 10 weeks while attempting to access aid in the Gaza Strip, with 615 of these deaths occurring near sites operated by the Gaza Humanitarian Foundation (GHF), a US- and Israeli-backed organization. The GHF has questioned the accuracy of these figures. Additionally, recent strikes in Gaza have increased the death toll to seven, as confirmed by the region's civil defense agency.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful information about the humanitarian crisis in the Gaza Strip. It highlights the challenges faced by individuals trying to access aid, as well as the response from the Gaza Humanitarian Foundation. However, it does not provide solutions or progress on the issue."
  },
  {
    "title": "Venus Williams to Return to Tennis at DC Open After Yearlong Hiatus",
    "domain": "sports",
    "location": "national",
    "published": "Fri, 11 Jul 2025 23:09:37 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sportsnet"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Williams, 45, last played in an official capacity in the 2024 Miami Open",
      "<p>Venus Williams accepted a wild-card invitation to play singles at this month&#8217;s DC Open, which would be the seven-time Grand Slam champion&#8217;s first tournament in more than a year.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2020/07/18/f5c477fc-97d6-4c29-ac66-b0345d41bd13/venus-williams.jpg",
    "titles": [
      "Venus Williams accepts wild-card invitation to play in DC Open, ex-world No. 1's first event in over a year",
      "Venus Williams accepts wild card for DC Open"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.83,
      "consensus": 0.632,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.634,
    "summary": "Venus Williams, a seven-time Grand Slam champion, will return to competitive tennis at the DC Open this month after accepting a wild-card invitation. This marks her first tournament in over a year, having last competed officially at the 2024 Miami Open.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about Venus Williams' return to competitive tennis. However, it lacks depth and insight into why she took a hiatus, what her return means for the sport, or how it might impact the tournament and her competitors."
  },
  {
    "title": "Sinner Defeats Djokovic to Face Alcaraz in Wimbledon 2025 Final",
    "domain": "general",
    "location": "global",
    "published": "Fri, 11 Jul 2025 19:11:23 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Sportsnet",
      "Al Jazeera"
    ],
    "domains": [
      "sports",
      "general"
    ],
    "snippets": [
      "World number one races to straight-sets win over the 24-time Grand Slam champion in the semifinals at Wimbledon 2025.",
      "<p>Carlos Alcaraz moved within one victory of a third consecutive Wimbledon championship and sixth Grand Slam title overall at age 22 by defeating Taylor Fritz 6-4, 5-7, 6-3, 7-6 (6) on Friday.</p>"
    ],
    "image_url": "",
    "titles": [
      "Sinner beats Djokovic to set up Wimbledon final against Alcaraz",
      "Jannik Sinner beats Novak Djokovic at Wimbledon, will face Carlos Alcaraz in final"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.764,
      "consensus": 0.682,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.633,
    "summary": "Jannik Sinner defeated Novak Djokovic in straight sets (6-3, 6-3, 6-4) in the Wimbledon 2025 semifinals, advancing to face defending champion Carlos Alcaraz in the final. Sinner, the world number one, showcased a dominant performance against the 7-time Wimbledon champion Djokovic, who required a trainer at the end of the second set. Alcaraz reached the final after beating Taylor Fritz, aiming for his third consecutive Wimbledon title and sixth Grand Slam overall. Djokovic has shared his pick for the final, while Sinner provided an injury update.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about the Wimbledon 2025 semifinals results and the upcoming final match. However, it does not provide deeper insights or actionable knowledge for the reader."
  },
  {
    "title": "El Chapo's Son Pleads Guilty to U.S. Drug Charges, Faces Life Sentence",
    "domain": "general",
    "location": "global",
    "published": "2025-07-12T01:52:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "The Guardian"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "Ovidio Guzman Lopez, a son of imprisoned former Mexican drug lord Joaquin \"El Chapo\" Guzman, pleaded guilty to four drug trafficking charges. Guzman Lopez was facing a maximum of life in prison.",
      "<p>Prosecutors allege Ovidio Guzmán López and his brother, Joaquin Guzmán López, ran a faction of the Sinaloa cartel</p><p>A son of notorious Mexican drug kingpin “El Chapo” pleaded guilty on Friday to US drug-trafficking charges, becoming the first of the drug lord’s sons to enter a plea deal.</p><"
    ],
    "image_url": "",
    "titles": [
      "Son of Mexico's 'El Chapo' pleads guilty in US drugs case",
      "Son of El Chapo pleads guilty in US drug trafficking case"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.878,
      "consensus": 0.632,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.624,
    "summary": "Ovidio Guzman Lopez, a son of former Mexican drug lord Joaquin \"El Chapo\" Guzman, pleaded guilty to four drug trafficking charges in the U.S. He is the first of El Chapo's sons to enter a plea deal. Guzman Lopez, who prosecutors say ran a faction of the Sinaloa cartel with his brother, now faces a maximum sentence of life in prison.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about the ongoing drug trafficking issue and the legal proceedings against a high-profile figure. However, it doesn't offer deeper insights into the systemic causes or potential solutions to the drug trafficking problem, nor does it empower the reader with actionable knowledge."
  },
  {
    "title": "Home Run Derby Set for July 14 in Atlanta with New Local Star",
    "domain": "sports",
    "location": "national",
    "published": "Fri, 11 Jul 2025 23:42:05 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sportsnet"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "The Derby is set for July 14 in Atlanta",
      "<p>The Home Run Derby crowd in Atlanta has a new hometown representative to cheer for.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/07/11/4fd387dc-5aec-4b07-a983-115b9a7f5cfd/olson.jpg",
    "titles": [
      "2025 MLB Home Run Derby: Matt Olson replaces Ronald Acuña Jr., joins Jazz Chisholm Jr., Cal Raleigh and others",
      "Braves’ Matt Olson to replace Ronald Acuna Jr. in Home Run Derby"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.839,
      "consensus": 0.632,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.616,
    "summary": "The Home Run Derby is scheduled for July 14 in Atlanta. The event will feature a new hometown representative for the crowd to support.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about an upcoming event and a new local participant. However, it lacks depth or insight into the event, its significance, or how it might affect the reader."
  },
  {
    "title": "Jeff Skinner Joins San Jose Sharks with $3M One-Year Deal",
    "domain": "sports",
    "location": "national",
    "published": "Fri, 11 Jul 2025 22:27:38 GMT",
    "source": "NHL",
    "sources": [
      "Sportsnet",
      "NHL"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMihwFBVV95cUxOcjNWLW1Rbnl0b1FRN010YUw4NU1oQXZyakVQMVRGSGtILW5KS2w1bjlkcjNCZm1iMEdVcTdVOTZsUXlNbmhTYjVaN084VXo2cVItLV85TkoxRkxpTS1WdFFBMnFmMU9xNWpCRWowWWVwWElTTmJzdGp2YW1ROUJSZXdUcDdEdUU?oc=5\" target=\"_blank\">Jeff Skinner signs 1-year contract with Shar",
      "<a href=\"https://news.google.com/rss/articles/CBMijgFBVV95cUxPeVVQQW1lR0ljaTVrMVVDWEJ5Y3RFWlZUSGhhdjF0N3RqUFZmS2x2X2kyUWxsMkVyUm0xR1dWQUtyWVVmdWFvWnNwMy14c3ViU1BPZTBnUWZGRFZzM21IN01EanQwUmhIWmxKTW5YX19wS2h1SDJyZzkxQUdaN29ZVVhWVDg2MTZDWUlTd0V3?oc=5\" target=\"_blank\">Sharks sign forward Jeff Skinner to",
      "<p>Jeff Skinner is heading south. The veteran forward has signed a one-year, $3-million deal with the San Jose Sharks, the team announced Friday.</p>"
    ],
    "image_url": "",
    "titles": [
      "Jeff Skinner signs 1-year contract with Sharks - NHL.com",
      "Sharks sign forward Jeff Skinner to one-year contract - NHL.com",
      "Jeff Skinner signs one-year, $3M deal with Sharks"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.818,
      "consensus": 0.632,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.612,
    "summary": "Jeff Skinner, a veteran forward, has signed a one-year, $3-million contract with the San Jose Sharks. This move marks his departure from the Buffalo Sabres. Skinner's deal with the Sharks was confirmed by the team on Friday.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "The story provides basic awareness about a player's move to a new team. However, it does not provide any deeper understanding or actionable insights for the reader."
  },
  {
    "title": "Graduation Timing Linked to Financial Stability, Study Finds",
    "domain": "business",
    "location": "global",
    "published": "2025-07-12T07:56:01Z",
    "source": "Business Insider",
    "sources": [
      "Business Insider"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Just a couple of years between graduation can make the difference between zero student debt or moving back in with your parents."
    ],
    "image_url": "https://i.insider.com/68700c6af748d8c055f561bc?format=jpeg",
    "titles": [
      "The Gen Z jobs gap: Great Resignation grads got a jump-start while their younger peers face a much tougher market"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.996,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.451,
    "summary": "Recent studies indicate that the timing of graduation can significantly impact financial outcomes for students. Graduates entering the job market during prosperous times are less likely to accumulate student debt compared to those who graduate during economic downturns, the latter often facing the necessity of moving back in with their parents due to financial constraints.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story clearly highlights a trend and its impacts, based on a recent study. It provides empowering knowledge about how the timing of graduation can affect financial stability, which could be actionable for students planning their education and career paths."
  },
  {
    "title": "Trump Imposes 35% Tariff on Canadian Imports Amid Trade Tensions",
    "domain": "business",
    "location": "national",
    "published": "Fri, 11 Jul 2025 14:58:22 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "President Donald Trump announced a 35% tariff on Canadian imports, starting Aug. 1, the latest letter to a trade partner that threatens high rates."
    ],
    "image_url": "",
    "titles": [
      "Trump announces 35% tariffs on Canada starting Aug. 1, warns of higher levies if Ottawa retaliates"
    ],
    "score_components": {
      "magnitude": 0.079,
      "recency": 0.7,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 1.0
    },
    "score": 0.446,
    "summary": "U.S. President Donald Trump has declared a 35% tariff on Canadian imports effective August 1. This decision is in response to Canada's alleged involvement in the flow of fentanyl and their imposition of retaliatory tariffs. The move is part of ongoing trade tensions between the two countries.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is informative and provides context about the ongoing trade tensions between the U.S. and Canada. It helps readers understand the causes and potential impacts of these trade decisions. However, it doesn't report on solutions or attempts to solve the problem, which would have made it more constructive."
  },
  {
    "title": "New Catalyst Converts Acids to Pharmaceuticals, Cutting Costs",
    "domain": "science",
    "location": "global",
    "published": "Sat, 12 Jul 2025 04:15:36 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/cheap-catalyst-turns-acids-into-pharmaceutical-gold/\" rel=\"nofollow\" title=\"Cheap Catalyst Turns Acids Into Pharmaceutical Gold\"><img alt=\"Conceptual Illustration of Computation Guided Chemical Reaction Modeling\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\""
    ],
    "image_url": "",
    "titles": [
      "Cheap Catalyst Turns Acids Into Pharmaceutical Gold"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.923,
      "consensus": 0.393,
      "constructiveness": 1.0,
      "proximity": 0.5
    },
    "score": 0.446,
    "summary": "Researchers have developed an affordable catalyst that can transform acids into valuable pharmaceutical compounds. This innovation, guided by computational modeling, promises to make the production of these compounds more cost-effective and accessible.",
    "constructiveness_score": 1.0,
    "constructiveness_reason": "This story is very constructive as it reports on an innovative solution that could make the production of pharmaceutical compounds more cost-effective. It provides actionable insights for those in the pharmaceutical industry and contributes to a broader understanding of this field."
  },
  {
    "title": "Caltech Unveils \"Smart Pill\" for Advanced Gut Health Insights",
    "domain": "science",
    "location": "global",
    "published": "Sat, 12 Jul 2025 03:50:12 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/caltechs-new-smart-pill-can-read-your-gut-like-never-before/\" rel=\"nofollow\" title=\"Caltech’s New Smart Pill Can Read Your Gut Like Never Before\"><img alt=\"Male Large Intestine Anatomy Close Up\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://"
    ],
    "image_url": "",
    "titles": [
      "Caltech’s New Smart Pill Can Read Your Gut Like Never Before"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.915,
      "consensus": 0.393,
      "constructiveness": 1.0,
      "proximity": 0.5
    },
    "score": 0.445,
    "summary": "Caltech has developed a new \"smart pill\" that offers unprecedented insights into the human gut. This innovative device is designed to navigate the digestive system, collecting detailed information that could significantly enhance medical diagnostics and treatment strategies. The technology represents a major advancement in gastrointestinal health research, promising more precise and less invasive options for patients.",
    "constructiveness_score": 1.0,
    "constructiveness_reason": "This story is highly constructive. It provides useful information about a new technology that can significantly enhance medical diagnostics and treatment strategies. This represents progress in the field of health research and offers readers actionable insights into this new development."
  },
  {
    "title": "Geologists Uncover Clues to Earth's Crust 4.4 Billion Years Ago",
    "domain": "science",
    "location": "global",
    "published": "Sat, 12 Jul 2025 04:40:03 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/geologists-decode-earths-4-4-billion-year-old-missing-crust/\" rel=\"nofollow\" title=\"Geologists Decode Earth’s 4.4-Billion-Year-Old “Missing” Crust\"><img alt=\"Artistic Reconstruction of Earth During the Hadean Eon\" class=\"webfeedsFeaturedVisual wp-post-image\" height="
    ],
    "image_url": "",
    "titles": [
      "Geologists Decode Earth’s 4.4-Billion-Year-Old “Missing” Crust"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.93,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.438,
    "summary": "Geologists have made significant progress in understanding Earth's early crust, dating back 4.4 billion years. By analyzing ancient zircon minerals, they've uncovered clues about the composition and conditions of Earth's surface during the Hadean Eon. This research helps fill a gap in knowledge about the planet's earliest geological history, providing insights into how Earth's crust evolved over billions of years.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive as it reports on a significant scientific discovery that deepens our understanding of Earth's geological history. The story highlights the progress made in geological research and provides insights into the evolution of Earth's crust."
  },
  {
    "title": "Navarro Urges Canada to Continue Talks After US Imposes 35% Tariff",
    "domain": "business",
    "location": "national",
    "published": "Fri, 11 Jul 2025 22:36:51 +0000",
    "source": "Financial Post",
    "sources": [
      "Financial Post"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "White House trade adviser Peter Navarro encouraged Canada to continue negotiating with the US to lower trade barriers after President Donald Trump announced a 35% tariff on the North American neighbor."
    ],
    "image_url": "",
    "titles": [
      "Navarro Urges Canada to ‘Negotiate Fairly’ Before August Tariff Deadline"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.82,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 1.0
    },
    "score": 0.433,
    "summary": "White House trade adviser Peter Navarro urged Canada to keep negotiating with the US following President Donald Trump's announcement of a 35% tariff on goods from the North American country. The move aims to lower trade barriers between the two nations.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness about the ongoing trade negotiations between the US and Canada, but it lacks depth or insight into the reasons behind the tariff, the potential impacts on the economies of the two countries, or possible solutions to the trade dispute."
  },
  {
    "title": "Breakthrough in Understanding Brain's Speech Process Aids Communication",
    "domain": "science",
    "location": "global",
    "published": "Fri, 11 Jul 2025 21:15:12 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/researchers-decode-how-we-turn-thoughts-into-sentences/\" rel=\"nofollow\" title=\"Researchers Decode How We Turn Thoughts Into Sentences\"><img alt=\"Hand Holding Glowing Brain\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/image"
    ],
    "image_url": "",
    "titles": [
      "Researchers Decode How We Turn Thoughts Into Sentences"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.797,
      "consensus": 0.393,
      "constructiveness": 1.0,
      "proximity": 0.5
    },
    "score": 0.428,
    "summary": "Researchers have made significant progress in understanding how the human brain converts thoughts into sentences. This breakthrough in cognitive science could have profound implications for enhancing communication abilities, especially for individuals with speech impairments. The study, detailed on SciTechDaily, explains the complex neurological processes involved in speech production, potentially opening new pathways for therapeutic interventions and advanced communication technologies.",
    "constructiveness_score": 1.0,
    "constructiveness_reason": "This story clearly highlights progress in understanding the brain's speech process, which could lead to solutions for speech impairments. It provides a deeper understanding of the neurological processes involved in speech production, which is useful for readers interested in cognitive science or communication disorders. It also raises awareness about the potential for therapeutic interventions and advanced communication technologies."
  },
  {
    "title": "Bitget Lists Chainbase for Spot Trading, Launches Exclusive Launchpool",
    "domain": "business",
    "location": "national",
    "published": "Sat, 12 Jul 2025 05:23:03 +0000",
    "source": "Financial Post",
    "sources": [
      "Financial Post"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "VICTORIA, Seychelles, July 12, 2025 (GLOBE NEWSWIRE) &#8212; Bitget, the leading cryptocurrency exchange, and Web3 company has announced the listing of Chainbase (C) in the Innovation and AI Zone, for spot trading. Besides being available for spot trading, Bitget will launch an exclusive Launchpool "
    ],
    "image_url": "",
    "titles": [
      "Bitget Launchpool to List Chainbase (C) with 2.75M in Token Rewards"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.944,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.418,
    "summary": "Bitget, a major cryptocurrency exchange, has announced the listing of Chainbase (C) for spot trading in its Innovation and AI Zone as of July 12, 2025, in Victoria, Seychelles. In addition to spot trading availability, Bitget is also introducing an exclusive Launchpool for Chainbase, enhancing its offerings in the cryptocurrency market.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story is constructive as it provides useful information about the listing of a new cryptocurrency on a major exchange. However, it doesn't provide much depth on why this is significant or how it impacts the broader cryptocurrency market."
  },
  {
    "title": "AI Study Suggests Human Rationality More Limited Than Thought",
    "domain": "science",
    "location": "global",
    "published": "Fri, 11 Jul 2025 20:50:16 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/are-we-truly-rational-ai-challenges-a-long-held-scientific-belief/\" rel=\"nofollow\" title=\"Are We Truly Rational? AI Challenges a Long-Held Scientific Belief\"><img alt=\"Artificial Intelligence Robot Thinking\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"605\" "
    ],
    "image_url": "",
    "titles": [
      "Are We Truly Rational? AI Challenges a Long-Held Scientific Belief"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.79,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.417,
    "summary": "A recent study using AI challenges the long-standing belief that humans are fundamentally rational beings. By analyzing complex decision-making processes, the AI demonstrated that human rationality may be more limited than previously thought. This finding suggests that under certain conditions, human decisions do not always align with traditional notions of rationality.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story provides empowering knowledge about human rationality and decision-making processes, which could be useful for readers interested in psychology or AI. It also highlights the innovative use of AI in research, demonstrating progress in the field. However, it doesn't give actionable insights for the reader."
  },
  {
    "title": "The Verge’s guide to Amazon Prime Day 2025",
    "domain": "technology",
    "location": "global",
    "published": "2025-07-11T23:41:45-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Amazon’s mega sale is almost over. It was twice as long as previous years, but we’re now entering the final hours. You’ve had a lot of time to shop, so we suggest checking out earlier than later to ensure your favorite deals don’t expire. In case you want to peruse what’s still discounted, you can ["
    ],
    "image_url": "",
    "titles": [
      "The Verge’s guide to Amazon Prime Day 2025"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.912,
      "consensus": 0.393,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.414,
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story is constructive as it provides actionable insights for readers on how to navigate Amazon Prime Day. It is useful for decision-making, especially for those planning to make purchases during the event."
  },
  {
    "title": "The best robot vacuum deals to pick up before Prime Day ends",
    "domain": "technology",
    "location": "global",
    "published": "2025-07-11T23:23:54-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Amazon Prime Day is in its final hours, following nearly four days of fantastic deals on headphones, TVs, fitness trackers, and — unsurprisingly — robot vacuums. Thankfully, there’s still something available for every home and budget, whether you’re looking for a robovac with self-extending arms tha"
    ],
    "image_url": "",
    "titles": [
      "The best robot vacuum deals to pick up before Prime Day ends"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.906,
      "consensus": 0.393,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.413,
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story is constructive as it provides actionable insights for readers looking for good deals on robot vacuums. It is useful for decision-making, especially for those planning to make purchases during Prime Day."
  },
  {
    "title": "Nations Eye AI for Government Efficiency Amid Democracy, Trust Concerns",
    "domain": "science",
    "location": "global",
    "published": "Fri, 11 Jul 2025 23:00:14 +0100",
    "source": "New Scientist",
    "sources": [
      "New Scientist"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Countries are eager to use AI to automate some government processes, but this risks eroding citizens’ trust and feelings of democratic control – because AI mistakes can ruin their lives"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/07/11204838/SEI_258705868.jpg",
    "titles": [
      "How government use of AI could hurt democracy"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.81,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.411,
    "summary": "Countries are increasingly interested in implementing AI to streamline government operations. However, there is a concern that this could decrease public trust and undermine democratic control due to the potential for AI errors to have significant negative impacts on individuals' lives.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The story is informative and raises awareness about the potential benefits and drawbacks of implementing AI in government operations. It provides useful context and understanding about the issue, but it doesn't report on any specific solutions or improvements to address the concerns raised."
  },
  {
    "title": "First Ancient Egyptian Genome Sequenced, Reveals 4,800-Year-Old Secrets",
    "domain": "science",
    "location": "global",
    "published": "Fri, 11 Jul 2025 20:25:11 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/scientists-sequence-first-genome-from-ancient-egypt-revealing-4800-year-old-secrets/\" rel=\"nofollow\" title=\"Scientists Sequence First Genome From Ancient Egypt, Revealing 4,800-Year-Old Secrets\"><img alt=\"Step Pyramid at Saqqara Built During Egypt’s Old Kingdom Copy"
    ],
    "image_url": "",
    "titles": [
      "Scientists Sequence First Genome From Ancient Egypt, Revealing 4,800-Year-Old Secrets"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.784,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.409,
    "summary": "Scientists have successfully sequenced the first genome from Ancient Egypt, unlocking secrets from 4,800 years ago. This groundbreaking research provides new insights into the genetic makeup and ancestry of the ancient Egyptians, offering a deeper understanding of their history and connections to other regions. The study focused on remains found near the Step Pyramid at Saqqara, dating back to Egypt's Old Kingdom period. This achievement marks a significant advancement in the field of archaeogenetics.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it reports on a significant advancement in the field of archaeogenetics. It provides readers with a deeper understanding of the genetic makeup and history of ancient Egyptians, offering actionable insights for researchers in related fields. It also highlights a solution to a long-standing problem in the field."
  },
  {
    "title": "Trump Gives ByteDance Third Extension for TikTok U.S. Divestment",
    "domain": "business",
    "location": "national",
    "published": "Fri, 11 Jul 2025 23:07:48 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "President Donald Trump granted ByteDance, TikTok's parent company, a third extension on time to sell off its U.S. TikTok operations."
    ],
    "image_url": "",
    "titles": [
      "TikTok loses bid to dismiss lawsuit alleging its 'addictive design' exploits kids"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.829,
      "consensus": 0.393,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.405,
    "summary": "President Trump has granted ByteDance, the parent company of TikTok, a third extension to divest its U.S. operations. This move allows more time for negotiations and potential deals to address national security concerns. The deadline for the sale has been extended, providing additional opportunities for ByteDance to comply with U.S. regulations.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "The story provides useful information about the ongoing negotiations between ByteDance and the US government, which could affect the future of TikTok's operations in the US. It also raises awareness about the national security concerns related to ByteDance's ownership of TikTok. However, it does not report on any progress in addressing these concerns or potential solutions."
  },
  {
    "title": "OpenAI delays the release of its open model, again",
    "domain": "technology",
    "location": "global",
    "published": "Sat, 12 Jul 2025 01:38:05 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "OpenAI CEO Sam Altman said Friday the company is delaying the release of its open model indefinitely."
    ],
    "image_url": "",
    "titles": [
      "OpenAI delays the release of its open model, again"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.874,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.404,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs readers about the delay in the release of OpenAI's open model. While it doesn't provide a solution or progress, it does increase awareness about the state of AI development and the challenges faced."
  },
  {
    "title": "IceCube Detector Sheds Light on Cosmic Rays Composition Mystery",
    "domain": "science",
    "location": "global",
    "published": "Fri, 11 Jul 2025 21:30:28 +0100",
    "source": "New Scientist",
    "sources": [
      "New Scientist"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "The IceCube neutrino detector has allowed researchers to resolve a debate about what types of particles make up ultra-high-energy cosmic rays – but much remains unknown about these rare events"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/07/11160818/SEI_258639370.jpg",
    "titles": [
      "We may have finally solved an ultra-high-energy cosmic ray puzzle"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.785,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.399,
    "summary": "The IceCube neutrino detector has helped scientists settle a dispute over the composition of ultra-high-energy cosmic rays. However, many aspects of these rare phenomena remain a mystery. The detector's findings have provided valuable insights into the nature of these particles.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful information about the composition of ultra-high-energy cosmic rays. However, it does not report on any specific solutions or improvements. It does increase awareness about the nature of these particles, but it does not provide actionable insights."
  },
  {
    "title": "Prime Day is almost over, but our favorite deals are still live",
    "domain": "technology",
    "location": "global",
    "published": "2025-07-12T01:03:24-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Editor’s note: That’s a wrap, folks! As Prime Day 2025 draws to a close, we’ll no longer be updating this article with additional deals and insights. Plenty of great deals remain, however, so be sure to check out all of our Prime Day coverage for anything you may have missed. There are mere hours le"
    ],
    "image_url": "",
    "titles": [
      "Prime Day is almost over, but our favorite deals are still live"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.938,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.399,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about ongoing deals, which could be useful for readers looking to make purchases. However, it does not provide deeper insights, report on solutions or improvements, or increase clarity around systems or trends."
  },
  {
    "title": "Some Verge-favorite gadgets are still on sale as Prime Day winds down",
    "domain": "technology",
    "location": "global",
    "published": "2025-07-11T22:25:19-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Every month, we like to ask our staff about their favorite stuff — whether it’s tech, kitchen tools, or camping gear. Their answers provide some interesting insights into what the folks here like to use when they’re at the job or enjoying some time off. Now that Amazon’s Prime Day is in its final ho"
    ],
    "image_url": "",
    "titles": [
      "Some Verge-favorite gadgets are still on sale as Prime Day winds down"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.888,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.399,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story offers useful information to readers who are interested in purchasing gadgets. It doesn't report on solutions, improvements, or attempts to solve problems, but it does provide actionable insights for potential buyers."
  },
  {
    "title": "The best Prime Day deals you can still grab on Verge-favorite 4K Blu-rays",
    "domain": "technology",
    "location": "global",
    "published": "2025-07-11T21:48:08-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Here at The Verge, we love physical media, and we know many of you do as well. That’s why it’s our duty to share the news that many great 4K Blu-ray and standard Blu-ray movies, TV shows, and box sets are on sale for Prime Day. Amazon is currently offering a ton of great Blu-ray [&#8230;]",
      "Amazon has solid discounts on laptops that are still available during the final day of its four-day Prime Day sales event. One of the nice things about shopping during Prime Day, even if you don’t have the requisite Prime subscription, is that Best Buy and others often follow suit with their own com"
    ],
    "image_url": "",
    "titles": [
      "The best Prime Day deals you can still grab on Verge-favorite 4K Blu-rays",
      "The best laptop deals you can still shop during the final hours of Prime Day"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.877,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.397,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story is constructive because it provides actionable insights for readers who are interested in purchasing 4K Blu-rays. However, it doesn't increase clarity around systems, causes, trends, or impacts that matter, nor does it report on solutions or improvements."
  },
  {
    "title": "The 55-inch Hisense U7 is a great 4K TV under $600 for Prime Day",
    "domain": "technology",
    "location": "global",
    "published": "2025-07-11T21:30:00-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Amazon Prime Day’s best deals may not last for much longer, since the sale ends later tonight. This includes a big discount on the 2025 Hisense U7, a midrange TV that’s seeing deep discounts right now. The 65-inch model is available on Amazon for $797.99, which is almost 50 percent off its original."
    ],
    "image_url": "",
    "titles": [
      "The 55-inch Hisense U7 is a great 4K TV under $600 for Prime Day"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.871,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.396,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information for readers who are in the market for a 4K TV. It doesn't report on solutions, improvements, or attempts to solve problems, but it does provide actionable insights for potential buyers."
  },
  {
    "title": "Guerrero Jr. Rejects Blue Jays' Long-Term Offer, Eyes Future Negotiations",
    "domain": "sports",
    "location": "national",
    "published": "Sat, 12 Jul 2025 06:28:42 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Guerrero Jr., having spent his entire career with the Toronto Blue Jays, bet on himself ahead of his most recent contract negotiations.  After the Blue Jays had reportedly offered him a lucrative, long-term contract, he declined.  After seeing the massive deals signed by the Dodgers, Shohei Ohtani a"
    ],
    "image_url": "",
    "titles": [
      "Vladimir Guerrero Jr. Makes Toronto Blue Jays History vs. Athletics"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.966,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.385,
    "summary": "Vladimir Guerrero Jr., a player for the Toronto Blue Jays, declined a long-term contract offer from the team, choosing to bet on himself for future negotiations. This decision came after observing significant contracts signed by other players in the league.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers basic awareness about a player's contract negotiation with his team. However, it lacks depth and insight as it doesn't provide actionable insights or deeper understanding about the broader implications of such decisions in sports contracts."
  },
  {
    "title": "DOJ Sues California Over Egg Prices, Citing Animal Welfare Laws",
    "domain": "business",
    "location": "global",
    "published": "Fri, 11 Jul 2025 20:21:23 +0000",
    "source": "Fortune",
    "sources": [
      "Fortune"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "The DOJ lawsuit blames California's animal welfare laws for soaring egg prices. Activists cry bird flu."
    ],
    "image_url": "https://fortune.com/img-assets/wp-content/uploads/2025/07/AP25190706452972-e1752265188787.jpg?w=2048",
    "titles": [
      "California pampers its chickens and Americans pay the price, Trump argues in new DOJ lawsuit"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.783,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.379,
    "summary": "The Department of Justice filed a lawsuit against California, alleging that the state's animal welfare laws have led to high egg prices. Activists argue that the laws are necessary to prevent bird flu outbreaks. The outcome of the lawsuit is pending.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the ongoing legal battle between the DOJ and California over animal welfare laws and their impact on egg prices. However, it does not delve into potential solutions or improvements, nor does it provide a comprehensive understanding of the causes, trends, or impacts involved."
  },
  {
    "title": "Sequoia bets on silence",
    "domain": "technology",
    "location": "global",
    "published": "Sat, 12 Jul 2025 04:50:00 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "There is a time-honored crisis management strategy, wherein one says nothing and waits for the outrage to pass. For Sequoia Capital, the strategy worked pretty well this week. While partner Shaun Maguire initially weathered criticism over an inflammatory social media post, that initial indignation c"
    ],
    "image_url": "",
    "titles": [
      "Sequoia bets on silence"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.934,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.349,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "This story provides no information or context, making it impossible to evaluate its constructiveness. There is no awareness, progress, or usefulness conveyed in the summary."
  }
]