[
  {
    "title": "US, China Near TikTok Deal, Trump and Xi to Finalize Soon",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-09-15T14:38:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Financial Times",
      "CNBC",
      "ABC News",
      "Deutsche Welle",
      "The Guardian"
    ],
    "domains": [
      "www.dw.com",
      "www.ft.com",
      "www.theguardian.com",
      "abcnews.go.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "US President Donald Trump and his Chinese counterpart Xi Jinping could finalize the deal on the Chinese-owned video platform TikTok in the coming days.",
      "Treasury Secretary Scott Bessent, in Madrid for trade talks with China, said on Monday they have \"a framework for a TikTok deal.\"",
      "The U.S. and China have a 'framework' deal for social media platform TikTok in place, Treasury Secretary Scott Bessent said Monday.",
      "US president says talks with Beijing have ‘gone very well’ and plans call with Xi Jinping this week",
      "<p>Framework agreement is a breakthrough in long-running dispute over TikTok’s ownership amid security concerns in Washington</p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/sep/15/uk-house-prices-drop-tax-budget-rents-financial-markets-business-live-news-updates\">Business live"
    ],
    "image_url": "",
    "titles": [
      "US says it reached 'framework' TikTok deal with China",
      "Trump admin live updates: Bessent says 'framework' for TikTok deal has been reached",
      "Bessent: TikTok deal 'framework' reached with China, Trump and Xi will finalize it Friday",
      "Trump signals US and China have struck TikTok deal",
      "US and China reach deal to transfer TikTok ownership, trade official says"
    ],
    "score_components": {
      "magnitude": 0.984,
      "recency": 0.968,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.837,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "US President Donald Trump and Chinese President Xi Jinping are nearing a deal on TikTok, as announced by Treasury Secretary Scott Bessent. They have established a 'framework' agreement aimed at resolving the long-standing dispute over the video platform's ownership due to security concerns. Bessent, speaking from Madrid, noted the progress during trade talks with China. Trump also mentioned that discussions have been successful and anticipates a call with Xi Jinping within the week to finalize the agreement.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "US-China Officials Discuss Trade, TikTok Sale in Madrid Amid Chip Probes",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Mon, 15 Sep 2025 11:44:33 -0400",
    "source": "NPR",
    "sources": [
      "TechCrunch",
      "New York Times",
      "NPR",
      "The Verge"
    ],
    "domains": [
      "www.nytimes.com",
      "techcrunch.com",
      "www.theverge.com",
      "www.npr.org"
    ],
    "snippets": [
      "U.S. officials have announced a \"framework\" that would let Chinese-owned short video platform TikTok continue operations in the United States, although the two countries are still working out the details.",
      "Top economic officials met in Madrid for a second day, with deadlines looming on tariffs and a ban on TikTok in the United States if it is not sold by its Chinese owner, ByteDance.",
      "Economic officials meeting in Madrid are seeking to head off a November tariff deadline.",
      "The US and China have reached a “framework” deal to divest TikTok from its Chinese parent company, Treasury Secretary Scott Bessent told reporters during trade talks in Madrid on Monday. As noted by Reuters, Bessent confirmed that &#8220;the framework is for a switch to a U.S.-controlled ownership.”",
      "The \"framework\" deal with China is\n\"between two private parties, but the commercial terms have been agreed upon,\" CNBC quoted Bessent as saying on the sidelines of a meeting between the two countries in Madrid on Monday."
    ],
    "image_url": "",
    "titles": [
      "Officials announce a 'framework' for keeping TikTok online in the U.S.",
      "U.S., China Conclude Talks With ‘Framework’ on TikTok Sale",
      "U.S. and China Resume Talks on Tariffs and TikTok",
      "The US and China might finally have a TikTok deal",
      "US, China reach ‘framework’ deal for TikTok"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.99,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.819,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Senior US and China officials are meeting in Madrid to address trade issues and the approaching TikTok sale deadline. Concurrently, China has initiated probes into US chip practices. They aim to prevent tariffs set for November. The US has extended TikTok's deadline to find a non-Chinese buyer to September 17, to avoid a ban.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Duplantis Sets Pole Vault World Record at 6.30m in Tokyo",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 15 Sep 2025 14:04:53 GMT",
    "source": "BBC",
    "sources": [
      "Al Jazeera",
      "Sky Sports",
      "Sportsnet",
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.theguardian.com",
      "www.sportsnet.ca",
      "www.skysports.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Armand Duplantis breaks the men's pole vault world record for the 14th time, clearing 6.30m attempt after winning gold at the World Athletics Championships in Tokyo.",
      "Armand Duplantis breaks the men's pole vault world record for the 14th time, clearing 6.30m attempt after winning gold at the World Athletics Championships in Tokyo.",
      "Sweden&#039;s Armand &#039;Mondo&#039; Duplantis sails over the bar to set 14th pole vault record at the World Athletic Championships.",
      "<ul><li><p>Swede clears 6.30m to claim gold in Tokyo</p></li><li><p>Shoes with metal spike enable faster run-up</p></li></ul><p>The pole vault competition was already two hours and 20 minutes old when Mondo Duplantis finally got serious at these World Athletics Championships. The bar had just been r",
      "Sweden's Armand Duplantis broke the men's pole vault world record for a 14th time on his way to gold at the World Athletics Championships in Tokyo.",
      "<p>Armand “Mondo” Duplantis broke the pole-vault world record for the 14th time Monday night, clearing 6.30 metres to capture his third world championship.</p>"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/c8c8/live/2caddc10-923c-11f0-84c8-99de564f0440.jpg",
    "titles": [
      "'What a legend!' - Duplantis clears 6.30m to break pole vault world record",
      "'What a legend!' Duplantis clears 6.30m to break world record",
      "Duplantis breaks pole vault world record to win gold in Tokyo",
      "Mondo Duplantis hits new heights with ‘Claw’ after 14th pole vault world record",
      "Duplantis breaks pole vault world record for 14th time",
      "Sweden’s Mondo Duplantis crushes own pole-vault world record to capture gold"
    ],
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.937,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.817,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Armand Duplantis of Sweden set a new men's pole vault world record, clearing 6.30 meters at the World Athletics Championships in Tokyo. This marks his 14th world record and secured him a gold medal. His achievement was facilitated by shoes with metal spikes, enhancing his run-up.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Bengals' Joe Burrow to Miss 3 Months for Toe Surgery After Jaguars Game",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 15 Sep 2025 11:33:47 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "Bengals QB Joe Burrow will need toe surgery that will sideline him a minimum of three months, sources told ESPN's Adam Schefter.",
      "Burrow went down injured against the Jacksonville Jaguars, and Jake Browning stepped up to finish the game.",
      "<p>Cincinnati Bengals quarterback Joe Burrow is expected to miss at least three months because of a toe injury, according to media reports on Monday.</p>"
    ],
    "image_url": "",
    "titles": [
      "Sources: Burrow needs toe surgery, out 3 months",
      "Bengals QB Joe Burrow to have toe surgery, expected to miss at least three months",
      "AP Source: QB Joe Burrow to miss three months after toe injury"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.986,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.769,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Cincinnati Bengals quarterback Joe Burrow is set to undergo toe surgery, sidelining him for at least three months following an injury sustained against the Jacksonville Jaguars. Jake Browning replaced him for the remainder of the game.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: sustain",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Week 3 College Football: Updated Rankings for Top 20 Teams and All FBS",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 15 Sep 2025 11:33:47 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "Sports Illustrated",
      "ESPN"
    ],
    "domains": [
      "www.cbssports.com",
      "news.google.com",
      "www.espn.com"
    ],
    "snippets": [
      "Now that Week 3 has come to an end, who are the early breakout players for the teams in our Top 25?",
      "SportsLine college football betting expert Thomas Casale breaks down his top 20 teams ahead of Week 4",
      "A new update to our ranking of all 136 FBS teams after Week 3 in college football",
      "<a href=\"https://news.google.com/rss/articles/CBMijwFBVV95cUxOaHZ6cjV3TGY2TnQ2ZE1qOEZMczY1Zm1jemV1NXA0SWhMYVVuMjJNNzFfaUhOa2x2T0tNcktUNzRkR3JWLWZ4TkR1N2J0WXNfUnk4LVFPU1JJeWRpRm5qTWxET0pYSlU5ckpiYzRMT2tVNmJWVjJwZHRrZkN6Q1lqVmY0d1VGeTNRVEFBbDRfaw?oc=5\" target=\"_blank\">Forde-Yard Dash: There’s a Major "
    ],
    "image_url": "",
    "titles": [
      "🏈 College Football Power Rankings after Week 3",
      "College football Week 4 power ratings: Miami moves up a tier, USC breaks into top 20 after Week 3 wins",
      "College football rankings: Miami jumps to No. 2 spot, Texas A&M joins top 10 in CBS Sports 136",
      "Forde-Yard Dash: There’s a Major Flaw With Early College Football Rankings - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.986,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.759,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Week 3 of college football has concluded, leading to updates in player and team rankings. SportsLine expert Thomas Casale provided insights on the top 20 teams, while a comprehensive ranking of all 136 FBS teams was also released. These updates reflect the early breakout players and shifts in team standings ahead of Week 4.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Proposes Biannual Financial Reporting for U.S. Companies",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Mon, 15 Sep 2025 14:29:30 GMT",
    "source": "Axios",
    "sources": [
      "Financial Times",
      "MarketWatch",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "www.marketwatch.com",
      "www.ft.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMiiAFBVV95cUxNRDhWMkwxbldLODNkVzFKdTJrUmFSdkxkbDlral94X0EyWXpLelYyQXJEYmtRMURiMy1TUmIyYkpKQ0hWUmlqSXVJR2VySmE2SFkwbWdCbVZOODFrXzNyYnRGaTBNc0ZfaTM1TmtfNWU2Q3otRG5SRlo5dEwzZVh0dHJQY0ZrWm05?oc=5\" target=\"_blank\">Trump says public companies shouldn't have ",
      "US president says forcing groups to disclose their finances every three months is ‘not good’",
      "European companies already report twice yearly. Trump wants to allow U.S. businesses to do the same."
    ],
    "image_url": "",
    "titles": [
      "Trump says public companies shouldn't have to report quarterly anymore - Axios",
      "Trump calls for US companies to ditch quarterly reporting",
      "Trump revives call to ditch quarterly earnings reports. What comes next?"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.945,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.733,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "President Trump has stated that he believes U.S. public companies should not be required to disclose their financials every quarter, suggesting a shift to a biannual reporting system similar to that of European companies.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "China Finds Nvidia's Mellanox Buyout Violates Anti-Monopoly Laws",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Mon, 15 Sep 2025 09:18:14 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Ars Technica",
      "Fortune"
    ],
    "domains": [
      "fortune.com",
      "www.cnbc.com",
      "arstechnica.com"
    ],
    "snippets": [
      "China's market regulator on Monday said that Nvidia violated the country's anti-monopoly law in relation to its aquisition of Mellanox in 2020.",
      "The chipmaker has increasingly found itself caught up in a tug of war between Washington and Beijing.",
      "Regulator’s statement comes as US and Chinese officials meet in Madrid for trade talks."
    ],
    "image_url": "",
    "titles": [
      "China says Nvidia violated anti-monopoly law after preliminary probe",
      "China says Nvidia violated antitrust laws as it ratchets up pressure ahead of U.S. trade talks",
      "China rules that Nvidia violated its antitrust laws"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.848,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.723,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "China's market regulator declared on Monday that Nvidia breached the nation's anti-monopoly laws through its 2020 acquisition of Mellanox. This development occurs amidst escalating tensions between the US and China, with both countries' officials currently engaged in trade discussions in Madrid.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Blue Jays Veteran Sets Stage for Rookie Yesavage's Debut",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Mon, 15 Sep 2025 14:26:49 +0000",
    "source": "Global News",
    "sources": [
      "Sportsnet",
      "Global News"
    ],
    "domains": [
      "www.sportsnet.ca",
      "globalnews.ca"
    ],
    "snippets": [
      "Another big outing from one of the Toronto Blue Jays' oldest players has set the stage for the newest.",
      "<p>Sho Alli and Julia Kreuz discuss the expectations for debuting Toronto Blue Jays pitcher Trey Yesavage, including the Jays positioning him as a starter and why they could use the extra innings Yesavage could provide.</p>"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2019/03/raw_3b5q_sports_article_blue_jays_a1.png",
    "titles": [
      "Springer helps Jays sweep before Yesavage debut",
      "What are Blue Jays’ expectations for Yesavage in debut and beyond?"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.964,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.698,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A veteran Toronto Blue Jays player's recent performance has paved the way for rookie pitcher Trey Yesavage's debut. Analysts Sho Alli and Julia Kreuz talked about the team's decision to use Yesavage as a starter, highlighting the need for additional innings he could offer.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Spain's PM Calls for Israel Ban from Sports Events After Vuelta Disruption",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 15 Sep 2025 11:33:47 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.espn.com"
    ],
    "snippets": [
      "Spain's prime minister called for Israel to be banned from international sporting events after pro-Palestinian activists disrupted the Spanish Vuelta cycling race.",
      "<p>Speaking after Gaza protesters forced early end to cycle race, Pedro Sánchez says Israel should not be allowed to use sports to ‘whitewash’ its ‘barbarism’</p><p>Spain’s prime minister, Pedro Sánchez, has called for Israel to be barred from international sports competitions for as long as its “ba"
    ],
    "image_url": "",
    "titles": [
      "Spain's prime minister calls for Israel sports ban",
      "Spain’s PM calls for Israel to be banned from sports events after Gaza protests force end to Vuelta race"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.986,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.691,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Spain's Prime Minister, Pedro Sánchez, advocated for banning Israel from international sporting events, following the disruption of the Spanish Vuelta cycling race by pro-Palestinian activists. Sánchez criticized Israel's actions in Gaza and accused the country of using sports to 'whitewash' its conduct. This statement was made in the context of protests that led to an early conclusion of the cycling event.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Browning Leads Bengals to Victory After Burrow Injury",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 15 Sep 2025 10:43:17 EST",
    "source": "ESPN",
    "sources": [
      "Yahoo Sports",
      "ESPN"
    ],
    "domains": [
      "people.com",
      "www.espn.com"
    ],
    "snippets": [
      "Jake Browning helped deliver a win to the Bengals on Sunday, but what's reasonable to expect from the backup?",
      "On Sept. 14, Joe Burrow suffered an injury during the second quarter of the matchup between the Cincinnati Bengals and Jacksonville Jaguars"
    ],
    "image_url": "",
    "titles": [
      "Joe Burrow out with turf toe: What is it, and what will 3 months away mean for the QB, Bengals?",
      "Will Joe Burrow Return This Season? What We Know About the Cincinnati Bengals Quarterback's Turf Toe Injury"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.969,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.674,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Jake Browning stepped in as quarterback for the Cincinnati Bengals after Joe Burrow was injured in the second quarter of the game against the Jacksonville Jaguars on Sept. 14. Browning's performance contributed to a Bengals win.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Warriors' Roster Moves Await Kuminga's Decision on Extended Offer",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 15 Sep 2025 08:39:46 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "Kuminga's future with the Warriors will determine how the team fills its remaining roster spots as training camp nears.",
      "The Warriors reportedly added a year to their offer, but Kuminga still balked at the idea of a team option"
    ],
    "image_url": "",
    "titles": [
      "Inside the Warriors' stalemate with Jonathan Kuminga",
      "Jonathan Kuminga contract: Warriors forward rejects latest offer from front office in stalemate, per report"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.929,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.673,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Golden State Warriors' decision on filling their remaining roster spots hinges on Jonathan Kuminga's future with the team. As training camp approaches, the Warriors have reportedly extended their offer by adding an additional year, but Kuminga has yet to accept, objecting to the inclusion of a team option.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UEFA Champions League Kicks Off; Experts Highlight Teams to Watch",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 15 Sep 2025 10:01:07 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "The UEFA Champions League kicks into high gear on Tuesday. But who are the favorites? How about the fashionable outsiders? Mark Ogden weighs in on the big clubs and talking points.",
      "The competition's league phase gets underway on Tuesday, and here's how our experts see the season playing out"
    ],
    "image_url": "",
    "titles": [
      "Champions League storylines: Will Arsenal win it all, PSG repeat, Barca rebound?",
      "Champions League expert picks: Will Barcelona will it all? Why Kylian Mbappe can return to the top, and more"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.955,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.671,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The UEFA Champions League began its league phase on Tuesday, with discussions focusing on potential favorites and notable teams. Experts, including Mark Ogden, have shared their insights on the teams to watch and the season's prospects, though specific predictions or outcomes were not detailed in the summary provided.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Arab, Muslim Leaders Meet in Doha Over Israel's Gaza Strike",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Mon, 15 Sep 2025 14:14:17 +0000",
    "source": "Al Jazeera",
    "sources": [
      "New York Times",
      "Al Jazeera"
    ],
    "domains": [
      "www.nytimes.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Arab and Muslim leaders are meeting in Doha for an emergency summit after Israel’s unprecedented attack on the city.",
      "At a summit in the Qatari capital, Doha, participants are deciding whether to take tangible actions against Israel following last week’s strike.",
      "Arab foreign ministers gathered on Sunday in the Qatari capital, Doha, to lay the groundwork for a summit there the next day."
    ],
    "image_url": "",
    "titles": [
      "Arab and Muslim leaders gather in Doha after Israeli attack",
      "Arab Leaders Meet to Weigh Response to Israel’s Attack in Qatar",
      "Arab Ministers Meet on Response to Israeli Attack in Qatar"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.96,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.661,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Arab and Muslim leaders convened in Doha for an emergency summit to discuss responses to Israel's recent attack on Gaza. The meeting aimed to decide on concrete actions following the strike. Arab foreign ministers met in Doha prior to the summit to prepare for the discussions.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Sierra CEO Sees AI Bubble as Positive, Foresees Economic Transformation",
    "domain": "business",
    "source_domain": "fortune.com",
    "location": "global",
    "published": "Mon, 15 Sep 2025 15:39:14 +0000",
    "source": "Fortune",
    "sources": [
      "TechCrunch",
      "Fortune"
    ],
    "domains": [
      "fortune.com",
      "techcrunch.com"
    ],
    "snippets": [
      "Sierra CEO Bret Taylor also said like the dotcom bubble, AI will “transform the economy” and create massive economic value.",
      "Like OpenAI CEO Sam Altman, Bret Taylor thinks we're in an AI bubble — but he doesn't sound too worried about it."
    ],
    "image_url": "https://fortune.com/img-assets/wp-content/uploads/2025/09/GettyImages-2181151956-e1757949091248.jpg?w=2048",
    "titles": [
      "OpenAI board chair doubles down on CEO Sam Altman’s belief we’re in an AI bubble: ‘A lot of people will lose a lot of money’",
      "OpenAI board chair Bret Taylor says we’re in an AI bubble (but that’s okay)"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.988,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.66,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Sierra CEO Bret Taylor, echoing OpenAI CEO Sam Altman, acknowledges the presence of an AI bubble but views it positively, suggesting AI will significantly transform the economy and create substantial economic value.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Investigation Underway in Charlie Kirk Murder, Suspect Uncooperative",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Mon, 15 Sep 2025 06:42:32 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "Al Jazeera"
    ],
    "domains": [
      "www.npr.org",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Authorities say the suspect in the Charlie Kirk murder investigation is not cooperating. However, the people around him are. Here's what we know. And, takeaways from the 2025 Emmys.",
      "A family member says he had turned political recently and hated Kirk. But Robinson&#039;s family is staunchly Republican."
    ],
    "image_url": "",
    "titles": [
      "What we know about the suspect arrested in Charlie Kirk's killing. And, Emmy takeaways",
      "Charlie Kirk killing: What we know about suspect Tyler Robinson’s motives"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.892,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.658,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Authorities are investigating the murder of Charlie Kirk, with the suspect currently not cooperating. However, individuals associated with the suspect are providing assistance. A family member revealed the suspect had recently become politically motivated and harbored animosity towards Kirk, despite the suspect's family being strongly Republican. The current status of the investigation or any additional details about the 2025 Emmys were not provided.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Tesla Shares Surge 8% as Musk Buys $1bn Stock, Targets 25% Ownership",
    "domain": "business",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Mon, 15 Sep 2025 14:15:18 GMT",
    "source": "The Guardian",
    "sources": [
      "Business Insider",
      "The Guardian"
    ],
    "domains": [
      "www.businessinsider.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "<p>Tesla shares rose by more than 8% after news of CEO’s transactions, a week after he was offered $1tn pay package</p><p><a href=\"https://www.theguardian.com/technology/elon-musk\">Elon Musk</a>, the <a href=\"https://www.theguardian.com/technology/tesla\">Tesla</a> CEO, has purchased nearly $1bn wort",
      "Elon Musk slightly boosted his ownership of Tesla to 12.8%, making a small step toward the 25% target he outlined last year.",
      "Tesla's share price rose roughly 6% in premarket trading on Monday after an SEC filing revealed Musk's purchase."
    ],
    "image_url": "https://i.guim.co.uk/img/media/377a107ce9754d30bc28cb81b8291035efa634b1/458_0_4583_3667/master/4583.jpg?width=140&quality=85&auto=format&fit=max&s=15ca193955442663c28719c47d7b9b7f",
    "titles": [
      "Elon Musk buys nearly $1bn in Tesla stock in push for more control",
      "Elon Musk just spent $1 billion on Tesla shares. He'll have to spend a lot more to ramp up his control.",
      "Elon Musk buys $1 billion worth of Tesla shares as he looks to gain more control over the EV maker"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.94,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.643,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Tesla shares increased by over 8% following CEO Elon Musk's purchase of nearly $1bn worth of Tesla stock, raising his ownership to 12.8%. This move came shortly after he was offered a $1tn pay package. The purchase, aiming towards a 25% ownership goal stated last year, led to a 6% rise in Tesla's share price in premarket trading after the SEC filing was disclosed.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "JD Vance to Host \"The Charlie Kirk Show\" in Tribute to Friend on Monday",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Mon, 15 Sep 2025 12:56:26 GMT",
    "source": "Axios",
    "sources": [
      "Global News",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "globalnews.ca"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMieEFVX3lxTE5ONGk0RFRJWVFaM09FYnpKOW93Q0NjWGJFbElOU1dGbnFXWXdaVjN2bVBnUDEwU2J1OXFnNGI4RVV6R2ljN1ptVkJCcEprc3lFcXdjMDZ2dTZOZEU3WGFlRGQxRHRMdGNiQk05LTNuM2NKbFd0V3o4dQ?oc=5\" target=\"_blank\">JD Vance takes the mic to host \"The Charlie Kirk Show\" Monday</a>",
      "'I will have the honor of hosting the Charlie Kirk Show. Please join me as I pay tribute to my friend,' Vance wrote on X."
    ],
    "image_url": "",
    "titles": [
      "JD Vance takes the mic to host \"The Charlie Kirk Show\" Monday - Axios",
      "JD Vance hosting return episode of Charlie Kirk podcast"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.915,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.638,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "JD Vance announced he will host \"The Charlie Kirk Show\" on Monday, inviting people to join him in paying tribute to his friend. This news was shared by Vance on the social media platform X.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Pro-Palestinian Protests Lead to Cancellation of Vuelta's Final Day",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Mon, 15 Sep 2025 11:37:49 +0000",
    "source": "Al Jazeera",
    "sources": [
      "New York Times",
      "Al Jazeera"
    ],
    "domains": [
      "www.nytimes.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Pro-Palestinian protesters forced Spain’s Vuelta cycling race to be abandoned on its final day.",
      "The final day of the three-week long Vuelta a España came to a premature end as pro-Palestinian protesters blocked streets."
    ],
    "image_url": "",
    "titles": [
      "How protests over Israeli team ended Spain’s Vuelta cycling race",
      "Protests Against an Israeli Cycling Team Shut Down a Major Race"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.909,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.637,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Pro-Palestinian protesters caused the cancellation of Spain's Vuelta cycling race's final day. The three-week-long event ended prematurely due to the street blockades by the demonstrators.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump: Foreign Workers \"Welcome\" in US Amid South Korea Outrage",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Mon, 15 Sep 2025 10:48:30 GMT",
    "source": "Axios",
    "sources": [
      "The Guardian",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMiekFVX3lxTFBCVEZRblZWTWNZTlNUa3RCTlp5Rmt5YjlFSzJnaEZKWlVDVTgtbm9ZMWR2X2VHR3pDdkRtcmxDYTZGaGxLajdOT29qMUhudnEzNkViSkljV0dLeUxiYUJOWm9ndWIwR29TUU1FbjFKcHRtNVlhU0ljU0NR?oc=5\" target=\"_blank\">Trump says foreign experts welcome after South Korean outrage o",
      "<p>US president says he doesn’t want to ‘disincentivize investment’ after images of workers chained and handcuffed caused widespread alarm in South Korea</p><p>President Donald Trump has said foreign workers sent to the United States are “welcome” and he doesn’t want to “frighten off” investors, 10 "
    ],
    "image_url": "",
    "titles": [
      "Trump says foreign experts welcome after South Korean outrage over raid - Axios",
      "Trump insists foreign workers are ‘welcome’ days after arrest of hundreds of South Koreans"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.875,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.637,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "President Donald Trump stated that foreign workers are \"welcome\" in the United States, addressing concerns after images of South Korean workers chained and handcuffed sparked outrage. He emphasized not wanting to \"disincentivize investment\" following the incident, which had caused widespread alarm in South Korea.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Interactive Game Lets You Guess Global Temperature Differences",
    "domain": "technology",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 15 Sep 2025 04:51:12 GMT",
    "source": "BBC",
    "sources": [
      "TechCrunch",
      "BBC"
    ],
    "domains": [
      "techcrunch.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Think you can work out where's hotter and colder than you today? Find out by playing our game",
      "Spotify is adding new features for free customers that let them pick and play tracks."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/9457/live/a4b0d300-8366-11f0-ab3e-bd52082cd0ae.png",
    "titles": [
      "Play now",
      "Spotify will now let free users pick and play tracks"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.773,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.61,
    "summary_source": "snippet",
    "summary_reason": "retry_exhausted",
    "summary": "Think you can work out where's hotter and colder than you today? Find out by playing our game",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Zelensky: Russian Drone Incursion Marks War Expansion; NATO Airspace Breached",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Mon, 15 Sep 2025 00:00:00 GMT",
    "source": "Axios",
    "sources": [
      "New York Times",
      "Axios"
    ],
    "domains": [
      "www.nytimes.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMieEFVX3lxTFBxVGVYR2JyeW9ORDF0bXIySXVmYi10TF9sYzVLS0stR1pvQmhRZXlGaEdMWTBBUFhlWnlkZUJOeFpYMi13dmZadjJzdTFyaXJZY09FYnhSZlZpR1pvSDFzMnJSM3NCdEV0OURaNDNvMTlkMVBTTExVRw?oc=5\" target=\"_blank\">Romania 2nd NATO nation in a week to report Russian drone in its ",
      "It was the second time in less than a week that a Russian drone had flown through a NATO member’s airspace. Last week, NATO scrambled fighter jets to shoot down Russian drones in Polish airspace."
    ],
    "image_url": "",
    "titles": [
      "Romania 2nd NATO nation in a week to report Russian drone in its airspace - Axios",
      "Romania Says Russian Drone Entered Its Airspace"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.699,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.609,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Ukraine's President Zelensky described a recent Russian drone incursion as an expansion of the war. This incident marks the second time in less than a week that Russian drones have entered NATO airspace, with NATO jets previously intercepting drones in Polish airspace.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]