[
  {
    "title": "Wrongfully Deported Man Faces New Deportation Threat Amid Legal Battle",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sat, 23 Aug 2025 11:19:41 -0400",
    "source": "NPR",
    "sources": [
      "The Guardian",
      "CNBC",
      "Global News",
      "Al Jazeera",
      "NPR",
      "Deutsche Welle"
    ],
    "domains": [
      "www.cnbc.com",
      "www.dw.com",
      "globalnews.ca",
      "www.theguardian.com",
      "www.npr.org",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Immigration officials said they intend to deport <a href=\"https://apnews.com/article/kilmar-abrego-garcia-release-deportation-tennessee-maryland-9789a9ff1e8bd2dcf1e7a22d8ce2a7ff\" target=\"_blank\">Kilmar Abrego Garcia</a> to Uganda after he declined an offer to be deported to Costa Rica, according to ",
      "Abrego Garcia’s case remains a flashpoint in US President Donald Trump’s anti-immigration crackdown.",
      "Kilmar Abrego Garcia was one of more than 200 people sent to El Salvador's CECOT prison as part of Donald Trump's crackdown on undocumented migrants. Now he's facing a second deportation.",
      "Kilmar Abrego Garcia, who in March was wrongfully deported to El Salvador's infamous CECOT prison, was released from a jail near Nashville, Tennessee on Friday.",
      "<p>Salvadorian refused offer of deportation to Costa Rica before he was released to await trial on human smuggling charges</p><p>US immigration officials said they intend to deport Kilmar Ábrego García to <a href=\"https://www.theguardian.com/world/uganda\">Uganda</a>, after he declined an offer to be",
      "The development about his possible deportation to Uganda emerged Saturday in court filings by his attorneys, who are arguing the cases against him should be dismissed."
    ],
    "image_url": "",
    "titles": [
      "US seeks to deport Kilmar Abrego Garcia to Uganda",
      "Trump administration seeks to deport Kilmar Abrego Garcia to Uganda",
      "Trump administration seeks to deport Abrego Garcia to Uganda",
      "Trump administration considering deporting Kilmar Abrego Garcia to Uganda, his lawyers say",
      "US immigration officials intend to deport Kilmar Ábrego García to Uganda",
      "Kilmar Abrego Garcia could be deported to Uganda, Trump administration says"
    ],
    "score_components": {
      "magnitude": 0.986,
      "recency": 0.833,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.837,
    "summary": "Kilmar Abrego Garcia, previously wrongfully deported to El Salvador as part of President Trump's immigration crackdown, was released from a Tennessee jail but faces deportation again, this time to Uganda, after refusing deportation to Costa Rica. His attorneys are seeking dismissal of his human smuggling charges. This case highlights ongoing tensions in U.S. immigration policy.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Phillies' Wheeler Out for Season, Set for Surgery on Thoracic Syndrome",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sat, 23 Aug 2025 19:57:44 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sports Illustrated",
      "CBS Sports",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "news.google.com",
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "Phillies ace Zack Wheeler will miss the remainder of the season and is expected to be out for six to eight months after being diagnosed with venous thoracic outlet syndrome, the team announced Saturday.",
      "Wheeler will undergo thoracic outlet decompression surgery, which typically comes with a 6-8 month recovery",
      "<a href=\"https://news.google.com/rss/articles/CBMie0FVX3lxTE1OOTJob2dTcm83bDhpRGI0YXhfZ0RBd1ZsNlAtb3E0b0Z1REtJQnlFVlotQmhuQ2tNY1J1eWlzZWtQT2xta2lCb0dDbncxM1FqVkpTd3lxcmNfd2VoU1lRVkg5WmJoSlJfaVpTeDU1QXM2SlR5bTdHaTB2Yw?oc=5\" target=\"_blank\">Phillies Ace Zack Wheeler Out for Season</a>&nbsp;&nbsp;<font",
      "<p>Philadelphia Phillies ace Zack Wheeler will be out for the remainder of the season after being recommended to undergo thoracic outlet decompression surgery.</p>"
    ],
    "image_url": "",
    "titles": [
      "Phillies' Wheeler needs surgery, out 6-8 months",
      "Zack Wheeler injury: Phillies ace needs surgery after blood clot removal, will miss remainder of season",
      "Phillies Ace Zack Wheeler Out for Season - Sports Illustrated",
      "Phillies’ Zack Wheeler to undergo season-ending surgery"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.997,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.814,
    "summary": "Philadelphia Phillies pitcher Zack Wheeler will miss the rest of the season due to venous thoracic outlet syndrome. He is scheduled for thoracic outlet decompression surgery, with a recovery period of six to eight months. This announcement was made by the team on Saturday.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Fleetwood, Cantlay Tied for Lead at 2025 Tour Championship",
    "domain": "sports",
    "source_domain": "golfweek.usatoday.com",
    "location": "national",
    "published": "Sat, 23 Aug 2025 23:56:22 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Sportsnet",
      "Yahoo Sports",
      "The Guardian"
    ],
    "domains": [
      "golfweek.usatoday.com",
      "www.nbcsports.com",
      "www.theguardian.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Tommy Fleetwood and Patrick Cantlay share the 54-hole lead at the 2025 Tour Championship, three shots clear of the field entering Sunday.",
      "One swing cost Tommy Fleetwood the lead Saturday in the Tour Championship. Another great closing stretch gave Patrick Cantlay a shot at the ideal ending to three years without winning.",
      "<ul><li><p>Home hope Cantlay birdies four of last five holes</p></li><li><p>Fleetwood tied for East Lake lead after 67</p></li></ul><p>Keegan Bradley, Scottie Scheffler, Patrick Cantlay? Just when Tommy Fleetwood looked to have a firm grip on this Tour Championship, Cantlay emerged from the shadows ",
      "<p>One swing cost Tommy Fleetwood the lead Saturday in the Tour Championship. Another great closing stretch gave Patrick Cantlay a shot at the ideal ending to three years without winning.</p>"
    ],
    "image_url": "",
    "titles": [
      "Tommy Fleetwood, Patrick Cantlay tied for 54-hole lead at Tour Championship",
      "Tommy Fleetwood, Patrick Cantlay share lead with $10 million going winner at Tour Championship",
      "Inspired Cantlay challenges Fleetwood in bid for Tour Championship glory",
      "Cantlay, Fleetwood tied for Tour Championship lead after third round"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.996,
      "consensus": 0.809,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.741,
    "summary": "Tommy Fleetwood and Patrick Cantlay are tied for the lead at the 2025 Tour Championship after 54 holes, three shots ahead of their closest competitors. Fleetwood's single swing mistake on Saturday cost him the outright lead, while Cantlay's strong finish, including birdies on four of the last five holes, positioned him for a potential first win in three years. Both players are now in a strong position to win going into Sunday's final round.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Kilauea Volcano Erupts in Hawaii, Launching Lava 100 Feet High",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sat, 23 Aug 2025 09:36:49 -0400",
    "source": "NPR",
    "sources": [
      "Phys.org",
      "NPR",
      "BBC"
    ],
    "domains": [
      "phys.org",
      "www.bbc.com",
      "www.npr.org"
    ],
    "snippets": [
      "Hawaii's Kilauea volcano resumed erupting Friday by shooting an arc of lava 100 feet into the air and across a section of its summit crater floor.",
      "Kilauea, on Hawaii's Big Island, started spewing fresh lava on 22 August, the Hawaiian Volcano Observatory said.",
      "Hawaii's Kilauea volcano resumed erupting Friday by shooting an arc of lava 100 feet (30 meters) into the air and across a section of its summit crater floor."
    ],
    "image_url": "",
    "titles": [
      "Hawaii's Kilauea volcano erupts again and shoots lava for 31st time since December",
      "Watch: Hawaii's Kilauea volcano erupts with lava fountain",
      "Kilauea's eruption is back as the Hawaii volcano shoots lava for the 31st time since December"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.804,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.73,
    "summary": "Hawaii's Kilauea volcano resumed erupting on Friday, shooting a 100-foot arc of lava into the air and across its summit crater floor. The eruption marked a return to activity for the volcano, which had been dormant for two years. Authorities are monitoring the situation closely to ensure the safety of residents and visitors in the area.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Lyle Menendez Denied Parole in First Hearing After 1989 Parents' Murder",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sat, 23 Aug 2025 07:35:10 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "LA Times",
      "Deutsche Welle"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.dw.com",
      "www.latimes.com"
    ],
    "snippets": [
      "His brother Erik was also denied parole on Thursday for the 1989 shotgun killing of their parents in Beverly Hills.",
      "The Menendez brothers were convicted and jailed in the 1989 for murdering their parents in Los Angeles.",
      "<p>A day after denying release for his younger brother, Erik, a California Parole Board ruled that Lyle Menendez should also remain in prison for gunning down his parents with a shotgun in 1989.</p>"
    ],
    "image_url": "",
    "titles": [
      "Lyle Menendez denied parole decades after murder of parents",
      "Lyle Menendez denied parole a day after brother Erik",
      "Lyle Menendez denied parole, will remain in prison along with younger brother Erik"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.709,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.679,
    "summary": "Lyle Menendez was denied parole at his first-ever hearing on Friday, following a decision a day prior against his brother, Erik. Both were convicted for the 1989 murder of their parents in their Beverly Hills mansion. The parole board's decision comes after examining Lyle's prison violations and the details of the case during a hearing that lasted over 10 hours.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Nigerian Military Strikes Armed Groups in Northeast Amid Violence Surge",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sat, 23 Aug 2025 22:26:32 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Deutsche Welle"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.dw.com"
    ],
    "snippets": [
      "Strikes are latest by the Nigerian military as it battles resurgence of attacks by armed groups in country&#039;s northeast.",
      "The West African country has seen an uptick in attacks this year, as well as counter-insurgency operations."
    ],
    "image_url": "",
    "titles": [
      "Nigeria says it killed 35 fighters in air strikes near border with Cameroon",
      "Nigeria says it killed 35 jihadis near Cameroon border"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.966,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.665,
    "summary": "The Nigerian military has conducted new strikes against armed groups in the northeast, responding to a recent increase in attacks. This action is part of ongoing counter-insurgency efforts in the West African nation, which has experienced a surge in violence this year.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Revolution Wind Farm Faces Trump Admin Challenges; Governors Pledge Support",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sat, 23 Aug 2025 11:38:19 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.npr.org"
    ],
    "snippets": [
      "The Revolution Wind farm was slated to start sending power to homes and businesses in Rhode Island and Connecticut starting next year.",
      "<p>Rhode Island and Connecticut officials say project, slated to power 350,000 homes, is essential to their climate goals</p><p>The Democratic governors of Rhode Island and Connecticut promised on Saturday to fight a <a href=\"https://www.theguardian.com/us-news/trump-administration\">Trump administra"
    ],
    "image_url": "",
    "titles": [
      "Trump administration halts work on an almost-finished wind farm",
      "New England states vow to fight Trump administration order to halt work on offshore wind farm that’s nearly complete"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.838,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.665,
    "summary": "The Revolution Wind farm, aimed at powering 350,000 homes in Rhode Island and Connecticut, was set to begin operations next year. However, the project is facing challenges from the Trump administration. Despite this, the Democratic governors of both states have vowed to continue supporting the wind farm, emphasizing its importance for achieving their climate goals.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Johnny Walker Secures Comeback KO Victory Over Zhang at UFC Shanghai",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sat, 23 Aug 2025 14:33:58 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "Johnny Walker ended a skid of two straight knockout losses by scoring a shocking knockout of his own.",
      "<p>Zhang Mingyang is looking for his fourth consecutive win to start his UFC career as he enters his first main event, taking on tough 14-fight UFC veteran Johnny Walker.</p>"
    ],
    "image_url": "",
    "titles": [
      "Walker tops Zhang at UFC Fight Night in Shanghai",
      "UFC Fight Night: Walker vs. Zhang official results"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.891,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.665,
    "summary": "Johnny Walker rebounded from two consecutive knockout losses by securing a comeback victory with a knockout against Zhang Mingyang at UFC Fight Night in Shanghai. This fight marked Zhang Mingyang's first main event in the UFC, where he was aiming for his fourth straight win since joining the league. Walker, a veteran with 14 UFC fights, successfully halted Zhang's winning streak.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Packers Beat Seahawks 20-7 in Preseason Finale",
    "domain": "sports",
    "source_domain": "packerswire.usatoday.com",
    "location": "national",
    "published": "Sat, 23 Aug 2025 23:49:16 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Sportsnet",
      "Yahoo Sports"
    ],
    "domains": [
      "packerswire.usatoday.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Miss the Packers' win over the Seahawks in the preseason finale? We have you covered with all the highlights.",
      "Highlight the standouts from the Packers' preseason finale win over the Seahawks on Saturday.",
      "<p>Malik Willis bounced back from an early interception and threw a touchdown pass to Romeo Doubs as the Green Bay Packers defeated the Seattle Seahawks 20-7 on Saturday in the pre-season finale for both teams.</p>"
    ],
    "image_url": "",
    "titles": [
      "Highlights of Packers' 20-7 win over Seahawks in preseason finale",
      "8 standouts from Packers' preseason win over the Seahawks",
      "Willis has TD pass, Packers sack Milroe five times in pre-season win over Seahawks"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.994,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.654,
    "summary": "In the preseason finale, the Green Bay Packers defeated the Seattle Seahawks 20-7 on Saturday. Malik Willis, after an early interception, threw a touchdown pass to Romeo Doubs, contributing to the Packers' victory. This game marked the end of the preseason for both teams.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Las Vegas Aces Secure 10-Game Winning Streak, Wilson Shines with 19th Double-Dou",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sat, 23 Aug 2025 21:58:28 +0000",
    "source": "CBS Sports",
    "sources": [
      "Sportsnet",
      "CBS Sports"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.cbssports.com"
    ],
    "snippets": [
      "The Aces' 10-game winning streak is the longest in the WNBA since 2021",
      "<p>A&#8217;ja Wilson had 36 points and 13 rebounds for her 19th double-double of the season and the Las Vegas Aces extended their winning streak to 10 games with a 91-81 victory over the Washington Mystics on Saturday.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/08/23/462274c1-186d-434d-ba49-02ba7ecaad34/awilson.jpg",
    "titles": [
      "A'ja Wilson continues MVP push with another 30-point game to lead Aces to 10th straight win",
      "A’ja Wilson’s 19th double-double leads Aces past Mystics for 10th straight win"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.957,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.646,
    "summary": "The Las Vegas Aces extended their winning streak to 10 games, the longest in the WNBA since 2021, with a 91-81 victory over the Washington Mystics. A'ja Wilson's impressive performance of 36 points and 13 rebounds marked her 19th double-double of the season.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UK Protests Erupt Over Asylum Seekers' Hotel Housing",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 23 Aug 2025 21:53:05 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "www.bbc.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Protests over the use of hotels for housing asylum seekers and counter protests have been taking place.",
      "<p>Counter-protests also taking place, with police separating rival groups in Bristol</p><p>Protesters have clashed with police as demonstrations against hotels housing asylum seekers began to take place across the UK.</p><p>Demonstrations under the “Abolish Asylum System” slogan were being held in "
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/128d/live/67d69950-8033-11f0-83cc-c5da98c419b8.jpg",
    "titles": [
      "Asylum hotel protesters met by counter-demonstrators across UK",
      "Police clash with protesters as asylum hotel demonstrations take place in UK"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.935,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.642,
    "summary": "Protests and counter-protests regarding the housing of asylum seekers in hotels occurred across the UK, with significant events in Bristol where police had to separate rival groups. Demonstrations were organized under the slogan “Abolish Asylum System,” leading to clashes with law enforcement. The situation highlights the division in public opinion on the asylum system and the use of hotels for asylum seekers' accommodation.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Experts Predict Group of Six Team in 2025 CFP; Release Week 0 Best Bets",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sat, 23 Aug 2025 09:41:41 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Yahoo Sports"
    ],
    "domains": [
      "www.on3.com",
      "www.espn.com"
    ],
    "snippets": [
      "Find out which teams our reporters picked for the College Football Playoff ahead of the 2025 season.",
      "Our college football experts rank the top 100 ahead of the 2025 season.",
      "In the past two decades of college football recruiting, only seven programs have signed a class that ranked No. 1 according to the Rivals Industry Team Rankings. Others have gotten plenty close on a number of occasions, but Texas, Georgia, Alabama, USC, Florida, Florida State and Texas A&amp;M stand"
    ],
    "image_url": "",
    "titles": [
      "2025 preseason College Football Playoff predictions",
      "💯 Ranking the top 100 college football players",
      "Looking back at the top college football recruiting classes every year since 2005"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.805,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.641,
    "summary": "Ahead of the 2025 College Football Playoff (CFP) season, reporters have made their team predictions, indicating that at least one Group of Six team is expected to qualify. Additionally, SportsLine's Projection Model and CBS Sports experts have released their best bets for Friday's major games, including specific picks for the Week 0 matchup between Kansas State and Iowa State, among other games.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Junior High Football Team Bus Overturns Near Pittsburgh, 21 Hospitalized",
    "domain": "general",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Sat, 23 Aug 2025 15:41:05 -0400",
    "source": "ABC News",
    "sources": [
      "The Guardian",
      "ABC News"
    ],
    "domains": [
      "abcnews.go.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "A bus carrying a junior high football team to a game crashed Saturday north of Pittsburgh, sending 21 of the 28 people on board to the hospital",
      "<p>Bus overturned about 20 miles north of Pittsburgh while carrying players from Aliquippa junior high school</p><p>A bus carrying a junior high football team to a game crashed on Saturday north of Pittsburgh, sending 21 of the 28 people onboard to the hospital, officials said.</p><p>Twenty-five Ali"
    ],
    "image_url": "https://s.abcnews.com/images/US/abc_news_default_2000x2000_update_4x3t_384.jpg",
    "titles": [
      "21 hospitalized after bus carrying junior high football team crashes near Pittsburgh",
      "Bus carrying junior high football team crashes in Pennsylvania, sending 21 people to hospital"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.912,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.637,
    "summary": "A bus transporting a junior high football team from Aliquippa to a game overturned 20 miles north of Pittsburgh on Saturday. Out of the 28 individuals on board, 21 were sent to the hospital following the accident. The bus was carrying players from Aliquippa junior high school at the time of the crash.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "OPP Officers Injured at Illegal Street Race in Ottawa, Teen Arrested",
    "domain": "general",
    "source_domain": "ottawacitizen.com",
    "location": "local",
    "published": "Sat, 23 Aug 2025 16:09:59 +0000",
    "source": "Ottawa Citizen",
    "sources": [
      "Ottawa Citizen",
      "CityNews"
    ],
    "domains": [
      "ottawacitizen.com",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "Two OPP officers suffered minor injuries late Friday when a 19-year-old Ottawa man attempted to flee arrest at an illegal car-racing gathering in a remote area of Ottawa&#8217;s southwest area. At about 11:10 p.m., officers with the OPP aerial unit spotted a large gathering of vehicles, including sp",
      "A 19-year-old from Ottawa is facing criminal charges after a street racing gathering during which two OPP officers were hit. Ottawa OPP say its aerial unit observed a large gathering of vehicles in the area of Moodie Drive and Dibblee Road shortly after 11 p.m. on Friday. One vehicle was seen doing "
    ],
    "image_url": "",
    "titles": [
      "OPP officers struck by car fleeing illegal racing event",
      "OPP officers hit by vehicle fleeing street racing gathering"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.848,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.635,
    "summary": "Two OPP officers sustained minor injuries while attempting to arrest a 19-year-old Ottawa man at an illegal street racing event. The incident occurred late Friday in Ottawa's southwest, after the OPP aerial unit identified a large vehicle gathering. The man is now facing criminal charges related to the event.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: sustain",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Tour Championship Final Round Set at East Lake Golf Club",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sat, 23 Aug 2025 18:55:07 +0000",
    "source": "CBS Sports",
    "sources": [
      "Yahoo Sports",
      "CBS Sports"
    ],
    "domains": [
      "www.nbcsports.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Here's everyone who will match up on Moving Day at East Lake Golf Club in Atlanta",
      "Tee times and TV times for the final round of the FedExCup playoff finale, the Tour Championship at East Lake Golf Club."
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/08/22/734bbbae-ed8c-4d77-a516-9411c484db6b/fleetwood-henley.jpg",
    "titles": [
      "2025 Tour Championship tee times, pairings: Saturday schedule, coverage, groupings for Round 3 at East Lake",
      "Tour Championship 2025: Final-round tee times, pairings and how to watch at East Lake"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.898,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.635,
    "summary": "The final round of the FedExCup playoff finale, the Tour Championship, is set to take place at East Lake Golf Club in Atlanta. The event will feature matchups on Moving Day, with specific tee times scheduled. Viewers can catch the action on designated TV times.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Israel Stops Currency Transfer to Gaza, Triggers Crisis",
    "domain": "science",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sat, 23 Aug 2025 15:34:13 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "SciTechDaily"
    ],
    "domains": [
      "www.aljazeera.com",
      "scitechdaily.com"
    ],
    "snippets": [
      "Israel has blocked the transfer of currency into Gaza; the result is catastrophic.",
      "<a href=\"https://scitechdaily.com/what-really-happens-when-blood-pressure-drops-below-120/\" rel=\"nofollow\" title=\"What Really Happens When Blood Pressure Drops Below 120\"><img alt=\"Male Patient Checking Blood Pressure\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdai"
    ],
    "image_url": "",
    "titles": [
      "This is what happens when money dies",
      "What Really Happens When Blood Pressure Drops Below 120"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.837,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.629,
    "summary": "Israel has halted the transfer of currency into Gaza, leading to severe consequences. The situation is described as catastrophic. The impact of this decision on the region's economy and residents is significant. The outcome of this action is ongoing, with potential long-term effects on Gaza's financial stability and well-being.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "U.S. Ends Low-Value Package Tariff Exemption, Halts Some International Shipments",
    "domain": "business",
    "source_domain": "financialpost.com",
    "location": "national",
    "published": "Sat, 23 Aug 2025 14:42:34 +0000",
    "source": "Financial Post",
    "sources": [
      "Financial Post",
      "CityNews"
    ],
    "domains": [
      "financialpost.com",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "ATHENS, Greece (AP) &#8212; The end of an exemption on tariff duties for low-value packages coming into the United States is causing multiple international postal services to pause shipping as they await more clarity on the rule. The exemption, known as the &#8221; de minimis&#8221; exemption, allow",
      "ATHENS, Greece (AP) — The end of an exemption on tariff duties for low-value packages coming into the United States is causing multiple international postal services to pause shipping as they await more clarity on the rule. The exemption, known as the “ de minimis&#8221; exemption, allows packages w"
    ],
    "image_url": "",
    "titles": [
      "European postal services suspend shipment of packages to US over tariffs",
      "European postal services suspend shipment of packages to US over tariffs"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.822,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.626,
    "summary": "The United States has ended an exemption on tariff duties for low-value packages, known as the \"de minimis\" exemption. This change has led multiple international postal services to temporarily halt shipping to the U.S. as they seek further clarification on the new rule.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Scotland Beats Wales 38-8 in Women's Rugby World Cup, McGhie Scores Hat-Trick",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 23 Aug 2025 15:40:05 GMT",
    "source": "BBC",
    "sources": [
      "Sky Sports",
      "BBC"
    ],
    "domains": [
      "www.skysports.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Francesca McGhie is the star of the show as the fullback scores a hat-trick of tries to help Scotland beat Wales in their Pool C match at the Women's Rugby World Cup at the Salford Community Stadium.",
      "Francesca McGhie stole the show with a brilliant hat-trick as Scotland started their Women's World Cup campaign with a 38-8 bonus-point win over Wales at the Salford Community Stadium."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/0cf5/live/b6786c20-8036-11f0-ab3e-bd52082cd0ae.jpg",
    "titles": [
      "Marvellous McGhie completes hat-trick as Scotland beat Wales",
      "McGhie hat-trick as Scotland hit Wales for six at Women's Rugby World Cup"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.821,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.619,
    "summary": "Francesca McGhie led Scotland to a 38-8 victory over Wales in their Women's Rugby World Cup Pool C match by scoring a hat-trick. The game, held at the Salford Community Stadium, marked Scotland's strong start in the tournament with a bonus-point win.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]