[
  {
    "title": "The Best At-Home Treatments To Help Soothe Sore Muscles and Aid Your Recovery",
    "domain": "general",
    "location": "national",
    "published": "Wed, 14 May 2025 16:00:12 +0000",
    "source": "Global News",
    "sources": [
      "Global News"
    ],
    "snippets": [
      "Thankfully, there are many ways we can treat sore muscles to help them (and you) recover faster, so you can get back to feeling your best."
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/05/wellness.jpg?quality=85&strip=all",
    "titles": [
      "The Best At-Home Treatments To Help Soothe Sore Muscles and Aid Your Recovery"
    ],
    "summary": "There are multiple effective treatments available for sore muscles that can expedite recovery, enabling individuals to return to their optimal condition more quickly.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it provides actionable insights and deeper understanding for the reader. It offers solutions for a common problem - sore muscles, and empowers readers with knowledge on how to expedite recovery at home.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.999,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.593,
    "normalized_score": 5.18
  },
  {
    "title": "York’s Dante meeting: all the latest horse racing news on day one – live",
    "domain": "general",
    "location": "global",
    "published": "Wed, 14 May 2025 15:57:28 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "snippets": [
      "<ul><li>Tips, reports and more in our live racing blog</li><li>Email Greg | <a href=\"https://www.theguardian.com/sport/2025/may/12/talking-horses-racing-derby-aidan-o-brien-kia-joorabchian\">Preview: Derby contenders jostle</a></li></ul><p>The runners are at the post for the <strong>six-furlong sprint</strong> handicap, the latest betting is:</p><p><strong>5-1 Two Tribes<br />\n  7-1 Holkham Bay<br />\n  9-1 Commanche Falls, We Never Stop &amp; Dark Thirty<br />\n  10-1 Bergerac<br />\n  11-1 bar<br /></strong></p> <a href=\"https://www.theguardian.com/sport/live/2025/may/14/yorks-dante-meeting-all-the-latest-horse-racing-news-on-day-one-live\">Continue reading...</a>"
    ],
    "image_url": "https://i.guim.co.uk/img/media/563390d09bec75b341b982a6a019eae4a70775e2/177_0_2320_1857/master/2320.jpg?width=140&quality=85&auto=format&fit=max&s=9e964a48ea07f3a28c74ec007fbd83e3",
    "titles": [
      "York’s Dante meeting: all the latest horse racing news on day one – live"
    ],
    "summary": "The live racing blog is covering a six-furlong sprint handicap race, providing updates, tips, and reports. The latest betting odds feature Two Tribes as the favorite at 5-1, followed by Holkham Bay at 7-1, and a trio of horses—Commanche Falls, We Never Stop, and Dark Thirty—at 9-1. Bergerac is listed at 10-1, with all other contenders at 11-1 or higher. Additional details and ongoing coverage can be found through the provided links.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness about a specific event, providing updates and betting odds. However, it lacks depth or insight that could contribute meaningfully to the reader’s understanding or decision-making, beyond the context of the race.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.998,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.545,
    "normalized_score": 2.35
  },
  {
    "title": "Pepe Mujica, the Former Uruguayan President, Removed the Pomp from Politics",
    "domain": "general",
    "location": "global",
    "published": "Wed, 14 May 2025 15:57:21 +0000",
    "source": "New York Times",
    "sources": [
      "New York Times"
    ],
    "snippets": [
      "The former Uruguayan president, who died on Tuesday, showed the value in world leaders living like their constituents."
    ],
    "image_url": "https://static01.nyt.com/images/2025/05/14/multimedia/14int-uruguay-mujica-kjpw/14int-uruguay-mujica-kjpw-mediumSquareAt3X.jpg",
    "titles": [
      "Pepe Mujica, the Former Uruguayan President, Removed the Pomp from Politics"
    ],
    "summary": "The former President of Uruguay, who passed away on Tuesday, was recognized for exemplifying the importance of world leaders living similarly to the people they represent. This approach highlighted a commitment to understanding and sharing the experiences of their constituents.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story informs and contextualizes usefully, even though the topic is negative (the passing of a former president). It increases clarity around a system (political leadership) and a trend (living similarly to the people they represent), which can contribute to readers' understanding of politics and leadership.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.998,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.575,
    "normalized_score": 4.12
  },
  {
    "title": "Trump Administration Live Updates: House Republicans Push Ahead With Tax and Medicaid Cuts",
    "domain": "general",
    "location": "global",
    "published": "Wed, 14 May 2025 15:55:15 +0000",
    "source": "New York Times",
    "sources": [
      "New York Times"
    ],
    "snippets": [
      "President Trump’s meeting with President Ahmed al-Shara came after he said he would lift U.S. sanctions on Syria. Mr. Trump’s Gulf tour has mostly sidestepped the war in Gaza."
    ],
    "image_url": "https://static01.nyt.com/images/2025/05/14/multimedia/14trump-news-promo-1145qm/14dc-cong-topart-whkf-mediumSquareAt3X.jpg",
    "titles": [
      "Trump Administration Live Updates: House Republicans Push Ahead With Tax and Medicaid Cuts"
    ],
    "summary": "President Trump met with President Ahmed al-Shara following his announcement to lift U.S. sanctions on Syria. This meeting occurred during Trump's tour of the Gulf, which has largely avoided addressing the ongoing war in Gaza.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the actions of the Trump administration, contributing to the reader's understanding of current political events. However, it doesn't highlight any solutions or progress, and the depth of insight into the impacts of these actions is somewhat limited.",
    "score_components": {
      "magnitude": 0.429,
      "recency": 0.997,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.571,
    "normalized_score": 3.88
  },
  {
    "title": "Attempt to protect England’s rare chalk streams in planning bill rejected by Labour MPs",
    "domain": "general",
    "location": "global",
    "published": "Wed, 14 May 2025 15:55:00 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "snippets": [
      "<p>Cross-party amendment to protect threatened chalk streams from government push to rip up environmental red tape fails </p><p>A cross-party attempt to protect England’s rare and threatened chalk streams in the government’s planning bill was rejected by Labour on Wednesday.</p><p>The attempt to give that the globally rare ecosystems the strongest protections as irreplaceable habitats failed after all the Labour MPs on the parliamentary committee examining the draft law rejected an amendment containing the extra provision.</p> <a href=\"https://www.theguardian.com/politics/2025/may/14/attempt-to-protect-englands-rare-chalk-streams-in-planning-bill-rejected-by-labour-mps\">Continue reading...</a>"
    ],
    "image_url": "https://i.guim.co.uk/img/media/080b85fe750bf69db394e14e8bef0716fb3e3f33/0_0_5000_4000/master/5000.jpg?width=140&quality=85&auto=format&fit=max&s=2853f7b2056a43455e0e72b600cbde5a",
    "titles": [
      "Attempt to protect England’s rare chalk streams in planning bill rejected by Labour MPs"
    ],
    "summary": "A cross-party amendment aimed at safeguarding England's rare chalk streams by incorporating strong protections into the government's planning bill was rejected after Labour MPs on the parliamentary committee voted against it. This decision came amidst efforts to protect these globally rare ecosystems from the impacts of environmental deregulation. The amendment's failure means these habitats remain without the proposed highest level of protection.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides a good level of awareness about the importance of protecting rare ecosystems and the political challenges involved. It provides useful context about the planning bill and the amendment, contributing to the reader's understanding of environmental policy. However, it doesn't report on any successful solutions or progress.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.997,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.575,
    "normalized_score": 4.12
  },
  {
    "title": "New Women's Rugby World Cup trophy unveiled 100 days before kick-off",
    "domain": "sports",
    "location": "global",
    "published": "Wed, 14 May 2025 16:30:00 BST",
    "source": "Sky Sports",
    "sources": [
      "Sky Sports"
    ],
    "snippets": [
      "A new Women's Rugby World Cup trophy has been unveiled in a \"symbolic moment\" which marks 100 days until the start of this year's tournament in England."
    ],
    "image_url": "https://e2.365dm.com/25/05/1920x1080/skysports-rugby-world-cup-women_6916369.jpg?20250514162211",
    "titles": [
      "New Women's Rugby World Cup trophy unveiled 100 days before kick-off"
    ],
    "summary": "A new trophy for the Women's Rugby World Cup was unveiled, marking 100 days until the tournament begins in England. This event represents a significant moment for the sport, highlighting the anticipation and importance of the upcoming competition.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about an upcoming sports event, but doesn't offer much depth or insight beyond that. It doesn't report on any particular solutions, improvements, or innovations, and doesn't increase clarity around any systems, causes, trends, or impacts that matter.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 1.006,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.527,
    "normalized_score": 1.29
  },
  {
    "title": "Whirl-wind performance from O'Brien filly in Musidora",
    "domain": "sports",
    "location": "global",
    "published": "Wed, 14 May 2025 16:18:00 BST",
    "source": "Sky Sports",
    "sources": [
      "Sky Sports"
    ],
    "snippets": [
      "There was another impressive winner of a Classic trial for Aidan O'Brien, as Whirl scorched to a bloodless victory in the Tattersalls Musidora Stakes at York."
    ],
    "image_url": "https://e2.365dm.com/25/05/1920x1080/skysports-whirl-racing_6916344.jpg?20250514161141",
    "titles": [
      "Whirl-wind performance from O'Brien filly in Musidora"
    ],
    "summary": "Aidan O'Brien's horse, Whirl, achieved a significant victory in the Tattersalls Musidora Stakes at York, demonstrating superior performance in this Classic trial race.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness of the event and the horse's performance, but it does not provide any deeper understanding or actionable insights. It does not report on solutions, improvements, or innovations. It also does not increase clarity around systems, causes, trends, or impacts that matter.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 1.003,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.527,
    "normalized_score": 1.29
  },
  {
    "title": "Rory-Bryson rivalry renewed as McIlroy questions Masters comment",
    "domain": "sports",
    "location": "global",
    "published": "Wed, 14 May 2025 16:00:00 BST",
    "source": "Sky Sports",
    "sources": [
      "Sky Sports"
    ],
    "snippets": [
      "Rory McIlroy has brushed off Bryson DeChambeau's comment about not speaking to him during the final round of his Masters win last month, saying: \"I don't know what he was expecting.\""
    ],
    "image_url": "https://e2.365dm.com/25/04/1920x1080/skysports-rory-mcilroy-golf_6886726.jpg?20250414185537",
    "titles": [
      "Rory-Bryson rivalry renewed as McIlroy questions Masters comment"
    ],
    "summary": "Rory McIlroy responded to Bryson DeChambeau's remark about not conversing during the final round of the Masters, indicating confusion over DeChambeau's expectations. McIlroy's reaction suggests he sees no issue with the lack of communication during the competition.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers basic awareness of the rivalry between Rory McIlroy and Bryson DeChambeau, but it does not provide any deeper understanding or actionable insights. It does not report on solutions, improvements, or innovations. It also does not increase clarity around systems, causes, trends, or impacts that matter.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.999,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.505,
    "normalized_score": 0.0
  },
  {
    "title": "Free MLB picks, predictions, props, best bets on Wednesday, May 14: This three-leg baseball parlay pays 9-1",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 14 May 2025 15:58:57 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports"
    ],
    "snippets": [
      "SportsLine's model has revealed its three-leg MLB parlay picks and best bets for Wednesday's MLB schedule"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/05/14/7a977eb5-de12-4397-aca8-762ee694fdb4/shohei-ohtani-cbs.jpg",
    "titles": [
      "Free MLB picks, predictions, props, best bets on Wednesday, May 14: This three-leg baseball parlay pays 9-1"
    ],
    "summary": "SportsLine's model has released its MLB parlay picks and best bets for Wednesday's schedule, focusing on three specific games. This analysis is part of their regular sports betting advice, providing targeted predictions for baseball fans and bettors.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful information for baseball fans and bettors, offering actionable insights and predictions. However, it does not report on solutions, improvements, or innovations, and it does not increase clarity around systems, causes, trends, or impacts that matter.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.998,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.555,
    "normalized_score": 2.94
  },
  {
    "title": "Patriots' Milton Williams glad Mike Vrabel called him out during team workouts: It will 'help the other guys'",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 14 May 2025 15:58:40 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports"
    ],
    "snippets": [
      "The Pats' prized free agent addition is embracing Vrabel's approach as head coach"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/05/14/4f870bd0-2c93-4a81-875c-fdd29b6954c7/milton-williams-us.jpg",
    "titles": [
      "Patriots' Milton Williams glad Mike Vrabel called him out during team workouts: It will 'help the other guys'"
    ],
    "summary": "The New England Patriots' recent free agent acquisition has publicly expressed support for head coach Mike Vrabel's coaching methods. This endorsement highlights the player's positive reception of Vrabel's approach to leadership and team management within the Patriots organization.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides some insight into the dynamics of the New England Patriots team and the coaching methods of Mike Vrabel. However, it doesn't offer much in terms of actionable insights or a deeper understanding of the sport or the team's strategy.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.998,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.535,
    "normalized_score": 1.76
  },
  {
    "title": "Boeing strikes 'largest-ever' 787 jet order with Qatar Airways, White House says",
    "domain": "business",
    "location": "national",
    "published": "Wed, 14 May 2025 16:00:09 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "snippets": [
      "Boeing and GE Aerospace secured a $96 billion agreement to sell Qatar Airways up to 210 aircraft, the White House said."
    ],
    "image_url": "",
    "titles": [
      "Boeing strikes 'largest-ever' 787 jet order with Qatar Airways, White House says"
    ],
    "summary": "Boeing and GE Aerospace have finalized a deal with Qatar Airways, valued at $96 billion, for the sale of up to 210 aircraft, according to an announcement from the White House. This agreement marks a significant transaction within the aerospace industry.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The story informs about a significant transaction within the aerospace industry, providing useful context about the business dealings of Boeing, GE Aerospace, and Qatar Airways. However, it doesn't report on solutions, improvements, or innovations, nor does it increase clarity around systems or impacts.",
    "score_components": {
      "magnitude": 0.639,
      "recency": 0.999,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.675,
    "normalized_score": 10.0
  },
  {
    "title": "R&B singer Cassie recounts humiliating details from when she lived with Diddy: ‘You make the wrong face and the next thing I knew I was getting hit in the face’",
    "domain": "business",
    "location": "global",
    "published": "Wed, 14 May 2025 15:50:03 +0000",
    "source": "Fortune",
    "sources": [
      "Fortune"
    ],
    "snippets": [
      "Cassie said eventually she was doing “freak offs” weekly. They went on for a decade, with the final one in 2017 or 2018, she said. Each time, she said, she had to recuperate from lack of sleep, alcohol, drugs"
    ],
    "image_url": "https://fortune.com/img-assets/wp-content/uploads/2025/05/GettyImages-2202304187-e1747236592737.jpg?w=2048",
    "titles": [
      "R&B singer Cassie recounts humiliating details from when she lived with Diddy: ‘You make the wrong face and the next thing I knew I was getting hit in the face’"
    ],
    "summary": "Cassie disclosed participating in weekly \"freak offs\" for a decade, ending around 2017 or 2018. These events led her to recover from sleep deprivation, alcohol, and drug use each time.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides awareness about the personal struggles of singer Cassie, potentially highlighting issues of abuse in the entertainment industry. However, it lacks depth and doesn't provide actionable insights or solutions.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.996,
      "consensus": 0.2,
      "constructiveness": 0.7
    },
    "score": 0.572,
    "normalized_score": 3.94
  },
  {
    "title": "AMD Stock Jumps as Chip Designer Announces New $6B Buyback Plan",
    "domain": "business",
    "location": "global",
    "published": "Wed, 14 May 2025 15:49:51 GMT",
    "source": "Investopedia",
    "sources": [
      "Investopedia"
    ],
    "snippets": [
      "<figure><img alt=\"Nathan Howard / Bloomberg / Getty Images Advanced Micro Devices CEO Lisa Su departs following a Senate hearing in Washington, D.C. on May 8, 2025\" src=\"https://www.investopedia.com/thmb/esXT17561xbTfEDTgpS11Z_PBVY=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2213409654-ec8ae32696b54cb9b3285714d6faead3.jpg\" title=\"Advanced Micro Devices CEO Lisa Su\" /><figcaption><i><p>Nathan Howard / Bloomberg / Getty Images</p> Advanced Micro Devices CEO Lisa Su departs following a Senate hearing in Washington, D.C. on May 8, 2025</i></figcaption></figure><br /><h3>KEY TAKEAWAYS</h3><ul><li>Advanced Micro Devices shares jumped Wednesday, as the chip designer said its board approved a new $6 billion share buyback plan.</li><li>The move will boost AMD's buyback program to $10 billion, the company said.</li><li>The gains also come a day after AMD and rival Nvidia announced partnerships with Saudi Arabian AI startup Humain.<br /></li></ul><br /><br /><p>Advanced Micro Devices (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;AMD\">AMD</a>) shares jumped Wednesday, as the chip designer said its board approved a fresh $6 billion share repurchase plan, boosting its buyback program to $10 billion.<span class=\"ql-inline-citation\"></span></p><p>“Our expanded share repurchase program reflects the Board’s confidence in AMD’s strategic direction, growth prospects, and ability to consistently generate strong free cash flow,” AMD CEO Lisa Su said. </p><p>The stock was up over 5% in recent trading, extending Tuesday's gains after the company announced a partnership with Saudi Arabian AI startup Humain.</p><p>AMD and rival Nvidia (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;NVDA\">NVDA</a>) on Tuesday said <a href=\"https://www.investopedia.com/nvidia-returns-to-usd3-trillion-club-as-stock-surges-on-saudi-ai-partnership-11734094\">they would supply semiconductors</a> to Saudi Arabian AI startup Humain, as part of <a href=\"https://www.investopedia.com/trump-touts-deals-with-saudi-arabia-11734068\">initiatives announced</a> as President Donald Trump kicked off a four-day trip to the Middle East. Shares of Nvidia were also higher Wednesday, as several AI stocks gained amid expectations the partnerships could lead to more deals.</p><p>As part of AMD's partnership with Humain, the companies said they plan to invest up to $10 billion over the next five years to build out AI computing centers \"stretching from the Kingdom of Saudi Arabia to the United States.\"<span class=\"ql-inline-citation\"></span></p><p>With this week's gains, AMD shares are close to recovering their year-to-date losses, but they've still lost roughly one-quarter of their value over the past 12 months.<br /></p>"
    ],
    "image_url": "https://www.investopedia.com/thmb/esXT17561xbTfEDTgpS11Z_PBVY=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2213409654-ec8ae32696b54cb9b3285714d6faead3.jpg",
    "titles": [
      "AMD Stock Jumps as Chip Designer Announces New $6B Buyback Plan"
    ],
    "summary": "On May 8, 2025, Advanced Micro Devices (AMD) announced a new $6 billion share buyback plan, increasing the total buyback program to $10 billion. This decision reflects the board's confidence in AMD's growth and ability to generate strong free cash flow. Additionally, AMD and Nvidia have partnered with Saudi Arabian AI startup Humain, planning to invest up to $10 billion in AI computing centers over the next five years. This partnership, announced during President Trump's trip to the Middle East, has contributed to a rise in AMD's stock, which increased over 5% recently, helping to offset its y",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it provides useful information about AMD's business strategy and future plans. It also provides context about the company's partnership with Nvidia and Humain, which could influence investment decisions. However, it does not clearly highlight solutions or empowering knowledge, hence the score is not higher.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.996,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.574,
    "normalized_score": 4.06
  },
  {
    "title": "Southwest Airlines hints at a significant international expansion",
    "domain": "business",
    "location": "global",
    "published": "Wed, 14 May 2025 15:48:51 +0000",
    "source": "Fortune",
    "sources": [
      "Fortune"
    ],
    "snippets": [
      "Filing with Transportation Department points at broader goals."
    ],
    "image_url": "https://fortune.com/img-assets/wp-content/uploads/2025/05/GettyImages-2205884105-e1747230937975.jpg?w=2048",
    "titles": [
      "Southwest Airlines hints at a significant international expansion"
    ],
    "summary": "A recent filing with the Transportation Department indicates a company's expansion into broader goals beyond its current operations. This move suggests a strategic shift or diversification in the company's objectives, aiming to explore new areas within the transportation sector. The exact details of these goals remain unspecified, but the action underscores the company's ambition to widen its scope of services or products.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness about Southwest Airlines' potential expansion but lacks depth and insight. It does not provide specific details about the company's plans or how this might impact the industry or consumers. Therefore, its usefulness and progress are limited.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.996,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.552,
    "normalized_score": 2.76
  },
  {
    "title": "Why Mastercard CEO Michael Miebach believes the future of payments is in the hands of consumers",
    "domain": "business",
    "location": "global",
    "published": "Wed, 14 May 2025 15:46:00 +0000",
    "source": "Fortune",
    "sources": [
      "Fortune"
    ],
    "snippets": [
      "\"People want simplicity. They also want safety,\" Miebach told Fortune."
    ],
    "image_url": "https://fortune.com/img-assets/wp-content/uploads/2025/05/Leadership-nxt-Mastercard.jpg?w=2048",
    "titles": [
      "Why Mastercard CEO Michael Miebach believes the future of payments is in the hands of consumers"
    ],
    "summary": "Mastercard CEO Michael Miebach emphasized the importance of simplicity and safety in consumer preferences during an interview with Fortune. His statement reflects a growing demand for straightforward and secure transactions in the financial services industry.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful insights into the perspective of Mastercard's CEO on the future of payments, contributing to readers' understanding of trends in the financial services industry. However, it does not report on specific solutions, improvements, or innovations, nor does it provide a comprehensive view of the systems or impacts involved.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.995,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.554,
    "normalized_score": 2.88
  },
  {
    "title": "Gone in a Saccade: Why You Can’t See Lightning-Fast Motion",
    "domain": "science",
    "location": "global",
    "published": "Wed, 14 May 2025 15:51:28 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/gone-in-a-saccade-why-you-cant-see-lightning-fast-motion/\" rel=\"nofollow\" title=\"Gone in a Saccade: Why You Can’t See Lightning-Fast Motion\"><img alt=\"Vision Speed Limit\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Vision-Speed-Limit-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>Our eyes perform lightning-fast movements called saccades multiple times per second, yet we never perceive the resulting motion blur. A new study reveals that this “invisibility” happens because the speed of our saccades sets a natural speed limit for what we can see. If an object moves faster than our eyes typically do during a [...]"
    ],
    "image_url": "",
    "titles": [
      "Gone in a Saccade: Why You Can’t See Lightning-Fast Motion"
    ],
    "summary": "A recent study has found that the human eye does not perceive motion blur during rapid movements known as saccades due to a natural speed limit set by the velocity of these eye movements. Objects moving faster than this speed are essentially invisible to us, explaining why we can't see extremely fast motion.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful insights into the workings of the human eye and why we can't perceive extremely fast motion. However, it doesn't necessarily report on solutions or improvements, nor does it give actionable insights for the reader.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.997,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.555,
    "normalized_score": 2.94
  },
  {
    "title": "“Zangenite” – Scientists Discover Never-Before-Seen Hollow Crystal",
    "domain": "science",
    "location": "global",
    "published": "Wed, 14 May 2025 15:26:14 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/zangenite-scientists-discover-never-before-seen-hollow-crystal/\" rel=\"nofollow\" title=\"“Zangenite” – Scientists Discover Never-Before-Seen Hollow Crystal\"><img alt=\"Crystal, Nonclassical Nucleation\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"437\" src=\"https://scitechdaily.com/images/Crystal-Nonclassical-Nucleation-777x437.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>Meet “Zangenite,” a hollow crystal structure named in honor of the NYU graduate student who discovered it. Crystals, whether found in sugar, table salt, snowflakes, or diamonds, do not always grow in a simple or predictable manner. Researchers at New York University have documented the transformation from a amorphous blob to an organized structure in [...]"
    ],
    "image_url": "",
    "titles": [
      "“Zangenite” – Scientists Discover Never-Before-Seen Hollow Crystal"
    ],
    "summary": "Scientists at New York University have discovered a new type of crystal named \"Zangenite,\" characterized by its unique hollow structure. This discovery challenges the traditional understanding of crystal formation, showing that crystals can evolve from an amorphous state to a highly organized structure in ways not previously documented. The crystal is named in honor of the NYU graduate student who discovered it.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "The discovery of a new type of crystal contributes to the reader's understanding of crystal formation and challenges traditional understanding, providing deeper knowledge. However, it doesn't offer actionable insights or report on solutions to problems.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.991,
      "consensus": 0.2,
      "constructiveness": 0.7
    },
    "score": 0.563,
    "normalized_score": 3.41
  },
  {
    "title": "Human “Super Immunity” – Man Bitten by Snakes Over 100 Times Helps Create Revolutionary Antivenom",
    "domain": "science",
    "location": "global",
    "published": "Wed, 14 May 2025 15:01:03 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/human-super-immunity-man-bitten-by-snakes-over-100-times-helps-create-revolutionary-antivenom/\" rel=\"nofollow\" title=\"Human “Super Immunity” – Man Bitten by Snakes Over 100 Times Helps Create Revolutionary Antivenom\"><img alt=\"Black Mamba\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Black-Mamba-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>Scientists have developed a potentially universal antivenom using antibodies from a hyper-immune human donor, offering broad protection against deadly snake species. In a major leap forward for snakebite treatment, scientists have developed the most broadly effective antivenom ever created. It protects against some of the world’s deadliest snakes, including the black mamba, king cobra, and [...]"
    ],
    "image_url": "",
    "titles": [
      "Human “Super Immunity” – Man Bitten by Snakes Over 100 Times Helps Create Revolutionary Antivenom"
    ],
    "summary": "Scientists have created a groundbreaking antivenom that offers wide-ranging protection against several of the world's deadliest snakes, such as the black mamba and king cobra. This development, utilizing antibodies from a donor with high immunity due to multiple snake bites, marks a significant advancement in snakebite treatment.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story clearly highlights progress and innovation in the field of snakebite treatment. It provides valuable knowledge and understanding of how immunity can be utilized to create effective treatments. This could empower readers who live in areas where snakebites are a common hazard.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.985,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.581,
    "normalized_score": 4.47
  },
  {
    "title": "Chemists discover 'anti-spice' that could make chilli peppers less hot",
    "domain": "science",
    "location": "global",
    "published": "Wed, 14 May 2025 14:02:17 +0100",
    "source": "New Scientist",
    "sources": [
      "New Scientist"
    ],
    "snippets": [
      "An analysis of compounds in chilli peppers has revealed chemicals that seem to negate their heat-giving capsaicinoids. This explains why the Scoville scale for measuring spicyness isn't always accurate, and could eventually lead to the development of an \"anti-spice\" condiment"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/05/14123105/SEI_251077396.jpg",
    "titles": [
      "Chemists discover 'anti-spice' that could make chilli peppers less hot"
    ],
    "summary": "Researchers have discovered compounds in chili peppers that counteract the heat-producing capsaicinoids, challenging the accuracy of the Scoville scale used to measure spiciness. This finding may pave the way for creating an \"anti-spice\" condiment, offering a new approach to managing the heat in spicy foods.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it provides a deeper understanding of the chemical compounds in chili peppers and their effects on our perception of spiciness. It also reports on an innovative solution for managing the heat in spicy foods, which could be useful for people who enjoy the taste of spicy foods but cannot tolerate the heat.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.957,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.573,
    "normalized_score": 4.0
  },
  {
    "title": "Heat and pollution events are deadly, especially in the Global South",
    "domain": "science",
    "location": "global",
    "published": "Wed, 14 May 2025 11:40:03 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "snippets": [
      "Small particulate matter (PM2.5) in air pollution raises the risks of respiratory problems, cardiovascular disease, and even cognitive decline. Heat waves, which are occurring more often with climate change, can cause heatstroke and exacerbate conditions such as asthma and diabetes. When heat and pollution coincide, they can create a deadly combination."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/heat-and-pollution-eve.jpg",
    "titles": [
      "Heat and pollution events are deadly, especially in the Global South"
    ],
    "summary": "Exposure to small particulate matter (PM2.5) in air pollution is linked to increased risks of respiratory and cardiovascular diseases, as well as cognitive decline. Concurrently, more frequent heat waves due to climate change can lead to heatstroke and worsen conditions like asthma and diabetes. The combination of high pollution levels and extreme heat poses a significant health risk, amplifying the potential for deadly outcomes.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it raises awareness about the combined health risks of air pollution and heat waves, particularly in the Global South. It provides useful insights into the impacts of these environmental factors on various health conditions. However, it does not offer any solutions or progress in mitigating these risks, hence the score is not at the highest end.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.938,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.557,
    "normalized_score": 3.06
  }
]