[
  {
    "title": "Trump Signs Deal Allowing TikTok U.S. Operations with Majority American Ownershi",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Thu, 25 Sep 2025 17:47:53 -0400",
    "source": "NPR",
    "sources": [
      "Business Insider",
      "The Guardian",
      "TechCrunch",
      "Axios",
      "NPR",
      "CNBC"
    ],
    "domains": [
      "www.theguardian.com",
      "www.cnbc.com",
      "www.businessinsider.com",
      "www.npr.org",
      "techcrunch.com",
      "news.google.com"
    ],
    "snippets": [
      "The new order says that the deal to turn over a majority stake in TikTok to a group of U.S. investors meets the terms ordered by Congress, and will allow it to stay online in the U.S.",
      "<a href=\"https://news.google.com/rss/articles/CBMiX0FVX3lxTE5lOEY1LVpzU2RvdUFaRW1tbkxPdmpsTDE0cmRpVnJoOFhSb0Eyd3oyS1pnc2stT1VfSEZSYkt5UHhDeWExU1cta20zWU1fS3VVdGJiVnoxT1pPbmRjbjBj?oc=5\" target=\"_blank\">Trump signs order allowing TikTok deal to proceed</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Axios</font>",
      "President Donald Trump on Thursday approved a proposed deal that would keep TikTok alive in the U.S.",
      "<p>Agreement separates app from Chinese owner ByteDance and allows US investors to take 80% stake</p><p>Donald Trump signed an executive order on Thursday <strong> </strong>outlining<strong> </strong>the terms of a deal to transfer TikTok to a US owner.</p><p>Trump said he and China’s president Xi J",
      "President Donald Trump signed an executive order approving a sale of TikTok's US business. Oracle will audit its algorithm and secure its data.",
      "Trump's executive order essentially bars the attorney general or Department of Justice from enforcing that law for 120 days while the divestiture plan presented to the president is executed."
    ],
    "image_url": "",
    "titles": [
      "Trump advances TikTok deal with new executive order",
      "Trump signs order allowing TikTok deal to proceed - Axios",
      "Trump approves TikTok deal through executive order, Vance says business valued at $14 billion",
      "Trump signs executive order to transfer TikTok to US owners",
      "Trump approved a $14 billion TikTok deal in an executive order, and employees have big questions",
      "Trump signs executive order to facilitate TikTok deal"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.805,
      "consensus": 1.0,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.846,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "President Donald Trump signed an executive order approving a deal for TikTok to transfer a majority stake to U.S. investors, allowing the app to continue operating in the U.S. The agreement involves separating TikTok from its Chinese owner ByteDance, with U.S. investors taking an 80% stake. Oracle will audit TikTok's algorithm and ensure data security. This move meets Congressional requirements and prevents the Department of Justice from enforcing any law that could shut down TikTok in the U.S. for 120 days while the plan is implemented.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Ex-FBI Director Comey Indicted for False Statements, Obstruction",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Thu, 25 Sep 2025 19:09:26 -0400",
    "source": "NPR",
    "sources": [
      "ABC News",
      "CNBC",
      "The Guardian",
      "Forbes",
      "Axios",
      "Deutsche Welle",
      "NPR",
      "BBC",
      "Al Jazeera"
    ],
    "domains": [
      "www.theguardian.com",
      "abcnews.go.com",
      "www.forbes.com",
      "www.dw.com",
      "www.bbc.com",
      "www.cnbc.com",
      "www.npr.org",
      "www.aljazeera.com",
      "news.google.com"
    ],
    "snippets": [
      "Comey faces one count of making false statements and one count of obstruction of justice in connection.<br />",
      "James Comey says he is innocent after being accused of lying to Congress in 2020 while testifying about leaks to the media.",
      "The former director of the US Federal Bureau of Investigations has been accused of lying to Congress.",
      "Comey is accused of making false statements and obstructing justice. Trump fired Comey in 2017, as he investigated the Trump 2016 presidential campaign's possible collusion with Russia.",
      "<a href=\"https://news.google.com/rss/articles/CBMifkFVX3lxTE5uWmNkeTh6bko1VlN5ejdWM255Q3cxajNQMFJKbDhCTkN0UnlBTXhHRHlvWWZvRWVqZEpjZVVMUGxxbEtSekF0UkdsYUtJSE9IVFNNeVBtUmFpVDJQMUdxTUVaNE1Sd0phVjk5RzFmekZQdndDaG9oN2pOOGc0Zw?oc=5\" target=\"_blank\">Read: Former FBI chief Comey indicted on two charges</a>&",
      "<a href=\"https://news.google.com/rss/articles/CBMif0FVX3lxTE5xbUxMdkxzOUNVRkF5UEtQU0hxb1p6UnJBTnVFLVZINGRRQjlHLVlBTkRlWEdOT2JucW1yZzdGcWFYUWp3REIyVUF5dEtVQV9vUi1RV2szNUxFT3lGenhhaHY3cVpVQVJXQmZ4bGZCMWFDYnZrVXAzWGh6dGZ2NlU?oc=5\" target=\"_blank\">Former FBI director James Comey indicted</a>&nbsp;&nbsp;",
      "In a video posted following his two-count indictment by a federal grand jury, former FBI Director James Comey says he is innocent.",
      "President Donald Trump gloated about the filing of criminal charges against James Comey, whom he fired as FBI director in 2017, in his first White House term.",
      "<p>Comey, one of Trump’s frequent targets, indicted on counts of making false statements and obstruction of a congressional proceeding</p><p>James Comey, the former FBI director and one of Donald Trump’s most frequent targets, was indicted on Thursday on one count of making a false statement to Cong",
      "Comey has long been a target of President Donald Trump, who has called the former FBI director a “sick guy” who “did terrible things” at the agency."
    ],
    "image_url": "",
    "titles": [
      "Ex-FBI Director James Comey indicted on criminal charges stemming from 2020 testimony",
      "Former FBI director James Comey indicted on two charges",
      "Why ex-FBI Director James Comey has been indicted – what it means",
      "Former FBI Director James Comey indicted on two counts",
      "Read: Former FBI chief Comey indicted on two charges - Axios",
      "Former FBI director James Comey indicted - Axios",
      "Former FBI Director James Comey posts video after indictment: 'I am innocent'",
      "Former FBI Director James Comey indicted after Trump called for charges",
      "Ex-FBI director James Comey indicted on two charges as Trump pushes to prosecute political enemies",
      "Ex-FBI Director James Comey Indicted Amid Push To Prosecute Trump Opponents"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.828,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.841,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Former FBI Director James Comey has been indicted by a federal grand jury on charges of making false statements and obstruction of justice. These charges are connected to his actions while investigating the Trump 2016 presidential campaign's potential collusion with Russia. President Donald Trump, who fired Comey in 2017, publicly expressed satisfaction over the indictment. The current status is that Comey faces legal proceedings for the accusations against him.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Opposes West Bank Annexation by Israel",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 26 Sep 2025 01:13:41 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "New York Times",
      "Axios",
      "Deutsche Welle",
      "BBC",
      "Al Jazeera"
    ],
    "domains": [
      "www.theguardian.com",
      "www.dw.com",
      "www.bbc.com",
      "www.aljazeera.com",
      "news.google.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "The US president spoke ahead the Israeli PM's address to the UN General Assembly on Friday.",
      "US president rules out Israeli annexation of the occupied West Bank but analysts question whether he&#039;ll follow through.",
      "US President Donald Trump said an Israeli annexation of the West Bank is \"not going to happen.\" It comes as several Israeli ministers have pushed for the idea. DW has more.",
      "<a href=\"https://news.google.com/rss/articles/CBMie0FVX3lxTE5xZkgzaURWUUR4SzA0dVpWenFadHFkTWdFQ21UZ2xubmJ3eUFIY3Brc2VlcjlVeTVTRTFMTFJZYU03VDUyM1VLRElGU2VvYXpXS2RObHFsUmFDMWctVVp5YUZtWWpGRWlxZmFhSUo5aENoOTN4WWlsMjRiZw?oc=5\" target=\"_blank\">Trump says he won't let Netanyahu annex the West Bank</a>&nbs",
      "<p>British officials said they feared Trump would recognise Israeli control over the West Bank in retaliation for the UK, Australia, France and other recognising Palestine</p><p>Donald Trump has said he will not allow Israel to annex the occupied West Bank, rejecting calls from some far-right politi",
      "After more countries recognized a Palestinian state this week, President Trump said on Thursday that he would not permit Israel to take over the territory."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/b4f7/live/6f935d70-9aa7-11f0-928c-71dbb8619e94.jpg",
    "titles": [
      "Trump says he 'will not allow' Netanyahu to annex West Bank",
      "Trump says he ‘will not allow’ Israel to annex occupied West Bank",
      "Middle East: Trump says Israel will not annex West Bank",
      "Trump says he won't let Netanyahu annex the West Bank - Axios",
      "Trump says he ‘will not allow’ Israel to annex West Bank after lobbying from allies",
      "Trump Says He Won’t Allow Israel to Annex the West Bank"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.847,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.819,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "US President Donald Trump announced he will not allow the annexation of the West Bank by Israel, despite several Israeli ministers advocating for it. This statement follows the recognition of a Palestinian state by more countries.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Amazon Settles for $2.5B Over Prime Subscription Deception Claims",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Fri, 26 Sep 2025 00:46:04 GMT",
    "source": "Axios",
    "sources": [
      "Business Insider",
      "TechCrunch",
      "Fortune",
      "Axios",
      "CNBC"
    ],
    "domains": [
      "fortune.com",
      "www.cnbc.com",
      "www.businessinsider.com",
      "techcrunch.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMihgFBVV95cUxOVHZfNFRhbnRJcUdkQUViQWlta041LWJOYVpnYjA1SUlhMU5yNVFaRl9tR09sSTkxXzZ3S1JqeGVkZlA5Y2tnTzVXZFdpNnFPV01iaFBEV1B2Vms2Smd1YUhjX085a3F1QVljQ0o5eGdrakt0cUJjQlFMMGNiYkk3bzBXdW1YUQ?oc=5\" target=\"_blank\">How and when you'll get a refund from the Ama",
      "<a href=\"https://news.google.com/rss/articles/CBMibEFVX3lxTFA1WXVkbk5XT0tOa2t6cUJkMHlUR1ZfVENEZmpkNWtVQ21QU19JRnRoYmFQdHRLNzFOaUxVdWRwaHNXUGZBcTZUZjUtODNCZzlMTzBrejZTdEVzRWxnSjZWWmV4b0I5RFVUNm5WRw?oc=5\" target=\"_blank\">Amazon reaches $2.5 billion settlement over FTC's Prime lawsuit</a>&nbsp;&nbsp;<f",
      "Opening arguments for the trial in Seattle took place on Tuesday and the proceedings were expected to last a month.",
      "The FTC's lawsuit stemmed from previous Business Insider reporting that found Amazon was aware users found the Prime cancellation process confusing.",
      "The surprise settlement between the online retail giant and the Trump administration happened just a few days into the trial over one of Amazon’s most important businesses. Amazon is paying a steep price—and taking a big win.",
      "The company will be required to pay a $1 billion civil penalty and provide $1.5 billion in refunds back to an estimated 35 million consumers harmed by the company's \"deceptive Prime enrollment practices,\" the FTC says."
    ],
    "image_url": "",
    "titles": [
      "How and when you'll get a refund from the Amazon Prime, FTC settlement - Axios",
      "Amazon reaches $2.5 billion settlement over FTC's Prime lawsuit - Axios",
      "Amazon reaches $2.5 billion settlement with FTC over 'deceptive' Prime program",
      "Amazon to pay $2.5 billion settlement over allegations it deceived Prime subscribers",
      "Why Amazon actually got off easy despite ‘historic’ $2.5 billion Prime deceptive practices settlement",
      "Amazon to pay $2.5B in FTC settlement over ‘deceptive’ Prime tactics"
    ],
    "score_components": {
      "magnitude": 0.964,
      "recency": 0.839,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.804,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Amazon has agreed to a $2.5 billion settlement with federal regulators over allegations of deceptive web designs that tricked millions into unwanted Prime subscriptions and made cancellation difficult. The settlement includes a $1 billion civil penalty and $1.5 billion in consumer refunds for the estimated 35 million affected. The FTC accused Amazon of using \"dark patterns\" for auto-renewals and a complex cancellation process. This resolution follows a lawsuit and a Business Insider investigation into Amazon Prime's practices.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "US President Imposes New Tariffs on Drugs, Trucks, Cabinets to Shield Manufactur",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 26 Sep 2025 07:04:50 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "Deutsche Welle",
      "BBC",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.bbc.com",
      "www.theguardian.com",
      "www.dw.com"
    ],
    "snippets": [
      "The US president said the move aims to help protect American manufacturers from foreign imports.",
      "The 100% tariff on pharmaceuticals, 25% on trucks, and 30% on furniture will come into effect on October 1.",
      "Asian stock markets fell after US President Donald Trump announced a new wave of tariffs. He said taxes on medicines, imported kitchen cabinets and sofas were needed \"for national security and other reasons.\"",
      "<p>President announces 100% tariffs on imported branded drugs, 25% on heavy-duty trucks and 50% on cabinets</p><p><a href=\"https://www.theguardian.com/us-news/donaldtrump\">Donald Trump</a> on Thursday announced a new round of punishing <a href=\"https://www.theguardian.com/us-news/trump-tariffs\">tari",
      "<p>Rolling coverage of the latest economic and financial news</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/2025/sep/25/trump-tariffs-heavy-trucks-drugs-kitchen-cabinets\"><strong>Trump says US will impose new tariffs on heavy trucks, drugs and kitchen cabinets</strong></a></p></li><li><"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/ed0c/live/0f72d480-9a6a-11f0-b39f-8faa1a82cdd5.jpg",
    "titles": [
      "Trump announces new tariffs on drugs, trucks and kitchen cabinets",
      "Trump announces ‘national security’ tariffs on drugs, trucks, furniture",
      "US: Trump's new tariffs to target drugs, furniture, trucks",
      "Trump says US will impose new tariffs on heavy trucks, drugs and kitchen cabinets",
      "Trump rattles investors with new tariffs on pharmaceuticals, trucks and kitchen cabinets – business live"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.957,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.788,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The US President announced new tariffs, including 100% on imported branded drugs, 25% on heavy-duty trucks, and 50% on cabinets. This move aims to protect American manufacturers from foreign competition.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Seahawks Beat Cardinals 23-20 with Last-Second Field Goal, Move to 3-1",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Thu, 25 Sep 2025 23:39:01 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "Sky Sports",
      "ESPN"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com",
      "www.skysports.com"
    ],
    "snippets": [
      "Seattle moves to 3-1 with a win over division-rival Arizona on \"Thursday Night Football.\"",
      "The Seattle Seahawks resisted a late rally by&#160;Kyler Murray and the Cardinals to beat&#160;Arizona 23-20 on Thursday night after&#160;Jason Myers made a 52-yard field goal as time expired and&#160;Sam Darnold threw for 242 yards and a touchdown.",
      "<p>Watch as Jason Myers nails a game-winning 52-yard field goal to lift the Seattle Seahawks over the Arizona Cardinals 23-20.</p>"
    ],
    "image_url": "",
    "titles": [
      "Seahawks hold off feisty Cardinals' comeback attempt",
      "Seahawks resist late rally to beat Cardinals",
      "Seahawks’ Myers nails last-second 52-yard field goal to beat Cardinals"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.91,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.744,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Seattle Seahawks improved their record to 3-1 after defeating the Arizona Cardinals 23-20 on \"Thursday Night Football.\" The win was secured by a 52-yard field goal from Jason Myers as time expired, following a strong performance by Sam Darnold who threw for 242 yards and a touchdown. The Seahawks managed to hold off a late rally by Kyler Murray and the Cardinals to secure the victory.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Microsoft Fires Workers Protesting Cloud Service Use by Israeli Military",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Fri, 26 Sep 2025 04:37:31 +0000",
    "source": "Al Jazeera",
    "sources": [
      "CNBC",
      "TechCrunch",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.cnbc.com",
      "techcrunch.com"
    ],
    "snippets": [
      "Microsoft said Israel&#039;s use of Azure to store data obtained through mass surveillance of Palestinians violated its terms",
      "The decision comes after Microsoft fired employees for participating in protests over the use of its cloud services by the Israeli military.",
      "The investigation was sparked by a story in The Guardian that reported that Unit 8200, the elite Israel military intelligence unit, was using Azure cloud storage to house data on phone calls obtained through the surveillance of Palestinians in Gaza and the West Bank."
    ],
    "image_url": "",
    "titles": [
      "Microsoft cuts Israeli military’s access to some cloud computing, AI",
      "Microsoft cuts off cloud services to Israeli military unit after report of storing Palestinians' phone calls",
      "Microsoft cuts cloud services to Israeli military unit over Palestinian surveillance"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.928,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.739,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Microsoft terminated employees who protested against the company's cloud services being used by the Israeli military. This action followed an investigation revealing Israel's misuse of Microsoft products to surveil Palestinian civilians, violating service terms. Microsoft stated it does not support technology for mass civilian surveillance. The probe was initiated by a report on Israel's military intelligence unit using Azure cloud for storing surveilled Palestinian phone data.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Canada Post Cuts Mail Delivery Frequency, Sparks Nationwide Strike",
    "domain": "general",
    "source_domain": "www.nytimes.com",
    "location": "global",
    "published": "Fri, 26 Sep 2025 00:46:37 +0000",
    "source": "New York Times",
    "sources": [
      "CityNews",
      "Ottawa Citizen",
      "New York Times"
    ],
    "domains": [
      "ottawacitizen.com",
      "www.nytimes.com",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "The government’s previous attempts at postal service cuts were politically unpopular, but Canada Post’s dire financial situation has expedited them.",
      "The Canadian Union of Postal Workers declared a nationwide strike in response to the announcement, calling the move an \"attack on our postal service and workers.\"",
      "Public Works and Procurement Minister Joël Lightbound says&#160;Canada&#160;Post&#160;will reduce the frequency of door-to-door letter mail delivery in an effort to shore up its finances. The minister announced today the federal government will accept all of the recommendations in the Industrial Inq"
    ],
    "image_url": "https://static01.nyt.com/images/2025/09/25/multimedia/25int-canada-mail-wkhl/25int-canada-mail-wkhl-mediumSquareAt3X.jpg",
    "titles": [
      "Canada Orders Postal Service to End Door-to-Door Mail Delivery",
      "Federal government to end door-to-door delivery in Canada Post shakeup",
      "Canada Post set to reduce frequency of letter mail delivery: minister"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.857,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.722,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Canada Post, facing financial difficulties, will decrease door-to-door letter mail delivery frequency. This decision follows previous unpopular postal service cuts. The Canadian Union of Postal Workers has initiated a nationwide strike, labeling the move as an attack on postal services and workers. Public Works and Procurement Minister Joël Lightbound announced the government's acceptance of all recommendations from the Industrial Inquiry to address the situation.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Varsho's Grand Slam Propels Blue Jays to 6-1 Win Over Red Sox",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Fri, 26 Sep 2025 01:58:55 +0000",
    "source": "Global News",
    "sources": [
      "Sportsnet",
      "Global News"
    ],
    "domains": [
      "www.sportsnet.ca",
      "globalnews.ca"
    ],
    "snippets": [
      "Daulton Varsho's grand slam in the sixth inning lifted the Blue Jays over the Boston Red Sox 6-1 on Thursday night as Toronto moved one step closer to winning the American League East Division title.",
      "<p>The Blue Jays, in the deep end after surrendering their AL East lead, began doing the hard thing Thursday night, fighting through their frustrations at the plate until Daulton Varsho released them with a sixth-inning grand slam that keyed a 6-1 win over the Boston Red Sox.</p>",
      "<p>Watch as Toronto Blue Jays outfielder Daulton Varsho delivers the biggest hit of the series against the Boston Red Sox, smashing a grand slam to break open a scoreless tie in the sixth inning.</p>",
      "<p>Toronto Blue Jays left-hander Eric Lauer discusses teammate Daulton Varsho&#8217;s go-ahead grand slam in the bottom of the sixth inning against the Boston Red Sox.</p>"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/e30f4ab9f89791575fceda0a82af25c38ec981ebe191def0fe4da71c5ac0178c.jpg?quality=65&strip=all",
    "titles": [
      "Varsho’s grand slam helps Blue Jays to key win",
      "Varsho’s grand slam steadies Blue Jays in pivotal win over Red Sox",
      "Gotta See It: Varsho’s grand slam breaks game open for Blue Jays",
      "Lauer on Varsho’s grand slam: ‘Majestic and beautiful’"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.879,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.681,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Daulton Varsho hit a grand slam in the sixth inning, leading the Toronto Blue Jays to a 6-1 victory over the Boston Red Sox. This win moved Toronto closer to clinching the American League East Division title. Varsho's grand slam was pivotal in breaking a scoreless tie and overcoming the team's recent struggles.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Ex-PM Proposes International Oversight for Gaza, Backed by White House",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 26 Sep 2025 06:24:58 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The former prime minister has been in high-level planning talks over the territory's future, the BBC understands.",
      "<p>Reported proposal for international body to oversee Gaza for up to five years counters UN-backed plan for faster transition to Palestinian rule</p><p>The White House is backing a plan that would see Tony Blair head a temporary administration of the Gaza Strip – initially without the direct involv"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/0372/live/4e7a88b0-9a80-11f0-92db-77261a15b9d2.jpg",
    "titles": [
      "Tony Blair in discussions to run transitional Gaza authority",
      "Washington backing plan for Tony Blair to head transitional Gaza authority"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.944,
      "consensus": 0.591,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.664,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The BBC reports that the former Prime Minister is involved in planning the future of Gaza, proposing an international body to oversee the area for up to five years. This plan, supported by the White House but counter to a UN-backed proposal, suggests a slower transition to Palestinian rule with Tony Blair potentially leading a temporary administration without direct involvement initially.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: plan, support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Barcelona Wins Against Real Oviedo, Credits Player Rotation by Coach Flick",
    "domain": "sports",
    "source_domain": "onefootball.com",
    "location": "national",
    "published": "Fri, 26 Sep 2025 07:36:00 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports",
      "Sports Illustrated"
    ],
    "domains": [
      "onefootball.com",
      "news.google.com"
    ],
    "snippets": [
      "Barcelona took all three points in a complicated outing against Real Oviedo last night as they were pushed to their limits quite unexpectedly.Hansi Flick rotated his troops effectively, but not many e...",
      "<a href=\"https://news.google.com/rss/articles/CBMijwFBVV95cUxQVy13VHhkMTZsQWI1V0lYOTBYOTFxbjRQNklmMC1yT1RuaVhWYzdPb2Nwb1RWbFI1c2ZOVVlzU3Myd1dyY1FVazJiZ1ZPVmo5MjNvTUUtUFh6MlZYdzRtNTFzcC1qdnVxb2w3RklUZ094T2xYVV90NVlQWElmaEotcHlWbjNVQnNXbFRnN0Noaw?oc=5\" target=\"_blank\">How to Watch Real Oviedo vs. Barc"
    ],
    "image_url": "",
    "titles": [
      "Three takeaways from Real Oviedo 1-3 Barcelona",
      "How to Watch Real Oviedo vs. Barcelona on TV, Live Stream - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.988,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.66,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Barcelona secured a victory against Real Oviedo, overcoming a challenging match with effective rotation of players by coach Hansi Flick. The win awarded Barcelona three points, highlighting their ability to prevail in tough situations.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Announces US-Led Deal With Oracle to Take Over Video App",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Thu, 25 Sep 2025 16:50:40 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "Deutsche Welle"
    ],
    "domains": [
      "www.npr.org",
      "www.dw.com"
    ],
    "snippets": [
      "President Trump on Thursday advanced a deal for a consortium of mostly U.S. investors to take over the hit video app. Trump says software company Oracle will take a major role in the new venture.",
      "Washington has been pushing to wrest control of the popular platform from Chinese ownership amid security concerns. Trump claims that Chinese leader Xi Jinping has approved the plan, which Beijing has not yet confirmed."
    ],
    "image_url": "",
    "titles": [
      "Trump signs order clearing way for takeover of U.S. version of app",
      "Trump signs order to facilitate TikTok sale to US buyers"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.789,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.655,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "President Trump announced a deal for a U.S.-led consortium, with Oracle playing a significant role, to take over the video app, addressing security concerns over its Chinese ownership. Trump stated that Chinese leader Xi Jinping has approved the plan, though Beijing has yet to confirm this.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Announces 100% Tariffs on Imported Pharmaceuticals from Oct 1",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Fri, 26 Sep 2025 04:39:20 GMT",
    "source": "CNBC",
    "sources": [
      "Forbes",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "www.forbes.com"
    ],
    "snippets": [
      "The 100% duties apply to \"any branded or patented Pharmaceutical Product\" except for companies that build manufacturing plants in the U.S., Trump said Friday.",
      "Trump said the tariffs will go into effect on October 1, but the levy won’t apply to companies that have started building manufacturing plants in the U.S."
    ],
    "image_url": "",
    "titles": [
      "Asian pharma stocks extend declines after Trump slaps 100% levies on branded drugs",
      "Asian Pharmaceutical Stocks Slump As Trump Announces 100% Tariffs On Patented Drugs"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.91,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.651,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "President Trump announced that starting October 1, there will be 100% tariffs on all branded or patented pharmaceutical products, except for companies that are constructing manufacturing plants in the U.S. This measure aims to encourage domestic production.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "China Launches Visa for STEM Graduates; US Doctors Seek H-1B Fee Exemption",
    "domain": "business",
    "source_domain": "www.nytimes.com",
    "location": "global",
    "published": "Fri, 26 Sep 2025 04:34:59 +0000",
    "source": "New York Times",
    "sources": [
      "Forbes",
      "New York Times"
    ],
    "domains": [
      "www.forbes.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "A new visa for science and engineering graduates is part of China’s effort to establish itself as the world leader in science and technology.",
      "The American Medical Association and 53 other medical societies asked the Trump administration to exempt physicians from the new $100,000 H-1B visa application fee."
    ],
    "image_url": "https://static01.nyt.com/images/2025/09/26/multimedia/26china-stem-visa-jhqz/26china-stem-visa-jhqz-mediumSquareAt3X.jpg",
    "titles": [
      "As Trump’s H-1B Visa Fee Targets Foreign Workers, China Woos Them",
      "AMA: Trump’s $100,000 H-1B Visa Fee Worsens The U.S. Doctor Shortage"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.928,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.648,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "China introduced a new visa for science and engineering graduates to bolster its position as a global leader in science and technology. Meanwhile, the American Medical Association and 53 other medical societies have requested the Trump administration to exempt physicians from a new $100,000 H-1B visa application fee.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Announces 100% Tariffs on Pharmaceuticals, Other Goods",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Fri, 26 Sep 2025 00:46:43 GMT",
    "source": "Axios",
    "sources": [
      "MarketWatch",
      "Axios"
    ],
    "domains": [
      "www.marketwatch.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMia0FVX3lxTE52dV9EQ09NUGJVWU5jMU94WTYyWWlXSzc0WFdpbjM2YktGN1U1bTRxVW16WndFQUtldGtWc0NSR3phRUVHdjZ6YlF1aXdCN0Q3Mm5OckhWNS05c3pra0ZZMGtVdW1GSUs5TEVR?oc=5\" target=\"_blank\">Trump threatens 100% tariffs on drugmakers who aren't building U.S. plants</a>&nbsp",
      "President Donald Trump announced a raft of new tariffs late Thursday, including a 100% levy on imported pharmaceuticals unless their manufacturers are actively building factories in the U.S."
    ],
    "image_url": "",
    "titles": [
      "Trump threatens 100% tariffs on drugmakers who aren't building U.S. plants - Axios",
      "Trump announces 100% tariffs on pharmaceuticals unless drug makers are building U.S. factories"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.839,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.637,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "President Donald Trump announced new tariffs, including a 100% levy on imported pharmaceuticals unless their manufacturers build factories in the U.S. The announcement, made late Thursday, also includes tariffs on heavy trucks, kitchen cabinets, and bathroom vanities.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "James Comey Indicted Amid Ongoing Trump Tension",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Fri, 26 Sep 2025 01:20:09 +0000",
    "source": "Al Jazeera",
    "sources": [
      "The Guardian",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Former FBI Director James Comey is a longtime critic of US President Donald Trump and testified against him in 2020.",
      "<p>This blog is now closed. <a href=\"https://www.theguardian.com/us-news/2025/sep/25/james-comey-fbi-director-indictment\">Read the full story here</a></p><p><strong>Dozens of House <a href=\"https://www.theguardian.com/us-news/democrats\">Democrats</a> have signed a letter to <a href=\"https://www.theg"
    ],
    "image_url": "",
    "titles": [
      "Ex-FBI Director Comey says he is ‘innocent’ after US court indictment",
      "Trump celebrates James Comey indictment as ex-FBI director says ‘I’m innocent: let’s have a trial’ – as it happened"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.867,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.635,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Former FBI Director James Comey, known for his criticism of President Donald Trump and testifying against him in 2020, has been indicted. The news comes as dozens of House Democrats have expressed their stance on the matter, highlighting the ongoing tension between Comey and Trump.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Phoenix Wins Overtime Thriller Against Minnesota in WNBA Semifinals",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Thu, 25 Sep 2025 11:53:00 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "The 2025 WNBA semifinals are underway, and Phoenix beat Minnesota in OT in an instant classic Tuesday.",
      "The series shifts to Phoenix for a pivotal Game 3 on Friday",
      "The best-of-five series is all square at 1-1 heading into Friday night's Game 3"
    ],
    "image_url": "",
    "titles": [
      "WNBA playoff schedule: Fever, Lynx take 1-0 leads in semifinals",
      "Lynx vs. Mercury schedule: Game times, where to watch and what to know about WNBA playoff semifinals",
      "Aces vs. Fever schedule: Game times, where to watch and what to know about WNBA playoff semifinals"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.712,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.629,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "In the 2025 WNBA semifinals, Phoenix defeated Minnesota in an overtime match that was hailed as an instant classic. Despite this loss, Minnesota aims to secure a 2-0 series lead in their next game on Tuesday night.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "SportsLine Simulates 2025 Ryder Cup; Highlights Top Longshot Picks",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Thu, 25 Sep 2025 23:42:26 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.cbssports.com"
    ],
    "snippets": [
      "SportsLine's model simulated the 2025 Ryder Cup 10,000 times and revealed its top longshot picks for Team USA vs. Team Europe",
      "<p>The player who once referred to the Ryder Cup as an exhibition, as “not that important an event for me,” as a competition that wouldn&#8217;t make him run around throwing fists pumps, is now the strongest voice and the only European with the career Grand Slam.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/25/7e07287a-c6d6-4dff-a09a-c059c3e038dc/rory-mcilroy-ryder-cup.jpg",
    "titles": [
      "2025 Ryder Cup longshot picks, Team USA vs. Team Europe odds, prediction, bets: Model backing Rory McIlroy",
      "How Rory McIlroy became cornerstone of Team Europe at Ryder Cup"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.838,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.623,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "SportsLine simulated the 2025 Ryder Cup 10,000 times, identifying top longshot picks for Team USA vs. Team Europe. A player who previously downplayed the Ryder Cup's importance, now the only European with a career Grand Slam, has become its most vocal supporter.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Admin Partners with Musk's AI for Gov Operations",
    "domain": "technology",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Thu, 25 Sep 2025 16:19:38 GMT",
    "source": "Axios",
    "sources": [
      "TechCrunch",
      "Axios"
    ],
    "domains": [
      "techcrunch.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMickFVX3lxTE9fMFp4Vm1RYVdnMjBJcU90X3pWQWhRS005UzIwZF93T0E4Y2l4dW50NmlXejk2bXBucTVpcFZXdlpkWlQyQUsyUG5XekZBUWUwSng2WW9KWWFZVTc3RW1vdzVwZGlxWFdnR3M4NHhLaFk2dw?oc=5\" target=\"_blank\">Trump admin to use Elon Musk's Grok chatbot for government business</a>&n",
      "xAI has reached a deal with the U.S. GSA to sell Grok to federal agencies for 42 cents over 18 months, undercutting OpenAI and Anthropic."
    ],
    "image_url": "",
    "titles": [
      "Trump admin to use Elon Musk's Grok chatbot for government business - Axios",
      "Elon Musk’s xAI offers Grok to federal government for 42 cents"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.704,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.62,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Trump administration plans to utilize Elon Musk's AI company's Grok chatbot for government operations, securing a deal through the U.S. General Services Administration (GSA). This agreement allows federal agencies to access \"Grok for Government\" at a cost of $0.42 for an 18-month period, offering a competitive price point against rivals like OpenAI and Anthropic.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "SportsLine's Eric Cohen Releases NFL Week 4 Score Predictions",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Thu, 25 Sep 2025 22:34:24 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Bleacher Report"
    ],
    "domains": [
      "news.google.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "SportsLine expert Eric Cohen reveals his score predictions for every game on the Week 4 of the NFL schedule",
      "<a href=\"https://news.google.com/rss/articles/CBMifkFVX3lxTFB0VU1IV0diMVpReGM5QmZtMGEyb0ZFQkhtTm9nbU5HS19ZRVRHUmEzS3M5MDVJOWl0RUdXM1U0TTZ3d2hhU2JsMXcta1ZRaGJDQTBHWk8wWkpHRENuR1FpdDRaZF9PNVhDRkdoYjJyQURBcGFRT3A3THZnVWlHdw?oc=5\" target=\"_blank\">2025 NFL Week 4 Expert Picks</a>&nbsp;&nbsp;<font color=\""
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/04/7076f29a-1478-47bf-af95-2a6bc8ce3130/devonta-smith-vs-cowboys-cbs-imagn.jpg",
    "titles": [
      "2025 Week 4 NFL score predictions, bets, odds, top picks today: Expert unveils exact scores for all 16 games",
      "2025 NFL Week 4 Expert Picks - Bleacher Report"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.818,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.619,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "SportsLine expert Eric Cohen has released his score predictions for every game of Week 4 in the NFL schedule. The predictions are available for viewers interested in Cohen's insights on the upcoming matchups.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Dallas ICE Facility Gunman Sought to \"Cause Terror,\" Note Reveals",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Thu, 25 Sep 2025 23:38:50 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "CNBC"
    ],
    "domains": [
      "news.google.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMihgFBVV95cUxPY01qZGJEeFlFQV9TeUNLZEoxUUR5N1VzRmVQUm1vd0hha0duNHpJcTAwWGdqV0lDMHFtMEdXUEFzNXpmSDlKajFqbFNRNW4tajUyc3VuXzBpUDZpX25LMmtJaEJTc3l1YzNJckNkaWxCMHVJZU43ckZHczB3a3lvRUw2VWdFQQ?oc=5\" target=\"_blank\">Dallas ICE facility shooter left notes detail",
      "ICE shooting gunman Joshua Jahn's search for video about Charlie Kirk, the recently assassinated conservative activist, adds to the evidence about his motive."
    ],
    "image_url": "",
    "titles": [
      "Dallas ICE facility shooter left notes detailing \"terror\" plans, officials say - Axios",
      "Dallas shooter wanted to 'kill ICE agents,' left notes, FBI says"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.82,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.619,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Joshua Jahn, the gunman in the deadly attack on a Dallas ICE facility, allegedly aimed to \"cause terror,\" as stated in a note, authorities report. His search for videos about Charlie Kirk, a recently assassinated conservative activist, further suggests motive.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Europe's Captain Picks Strong Pairings for Early Lead at Bethpage Black",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 25 Sep 2025 20:11:06 GMT",
    "source": "BBC",
    "sources": [
      "Yahoo Sports",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.independent.co.uk"
    ],
    "snippets": [
      "European captain Luke Donald picks a series of heavyweight pairings as he looks for the visitors to make a fast start at Bethpage.",
      "European captain Luke Donald picks a series of heavyweight pairings as he looks for the visitors to make a fast start at Bethpage.",
      "Luke Donald’s team battle Keegan Bradley’s home favourites at Bethpage Black, with the morning foursomes kicking things off on Friday before President Donald Trump arrives"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/1be5/live/09cc0410-9a4d-11f0-97bc-a980e58f8f49.jpg",
    "titles": [
      "McIlroy & Fleetwood to reunite in foursomes on Ryder Cup's opening day",
      "McIlroy & Fleetwood reunite in Ryder Cup foursomes",
      "Ryder Cup Day 1 pairings for foursomes announced as Rory McIlroy and Tommy Fleetwood reunite"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.763,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.615,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "European captain Luke Donald selected strong pairings for his team to secure a quick lead at Bethpage Black. The competition begins with morning foursomes on Friday, ahead of President Donald Trump's arrival. This strategy aims to challenge Keegan Bradley's favored home team.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Expected Cuts to Result in Hundreds of Layoffs",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Thu, 25 Sep 2025 19:45:04 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Axios",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "news.google.com"
    ],
    "snippets": [
      "The cuts are expected to lead to hundreds of layoffs.",
      "<a href=\"https://news.google.com/rss/articles/CBMifkFVX3lxTE1WeUNnZ0xCQ3d2cGI5Zk5HbTI3VlhfWlFfMndWVmpDUWp5dTBfT25sNDI1TlVpSnlNclh0ZkdkZEdqU09teC1ad3NGVjBSVHI0TWdIbDhEVlozVnA2a3hYQU00c1F1RGlUbWpLVWFmeXJSZU9fdnhBYzM3XzBwdw?oc=5\" target=\"_blank\">Starbucks to close stores, cut 900 jobs in $1B restructur"
    ],
    "image_url": "",
    "titles": [
      "Starbucks to close underperforming stores in restructuring efforts",
      "Starbucks to close stores, cut 900 jobs in $1B restructuring - Axios"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.772,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.609,
    "summary_source": "snippet",
    "summary_reason": "retry_exhausted",
    "summary": "The cuts are expected to lead to hundreds of layoffs.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Glasgow Ash Wins UK Tree of the Year, Beats 'King of Limbs' Oak",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 25 Sep 2025 19:00:25 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The tree defeated nine other contenders in a public vote to win the annual prize.",
      "<p>Beloved specimen triumphs in Woodland Trust contest over ‘King of Limbs’ oak in Wiltshire</p><p>A much-loved ash tree in the heart of Glasgow has won the annual tree of the year competition organised by the Woodland Trust.</p><p>While many trees that have featured in the competition are located i"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/f938/live/75681980-5dac-11f0-960d-e9f1088a89fe.jpg",
    "titles": [
      "Tree of the Year honour for Glasgow's Argyle Street Ash",
      "Argyle Street ash in Glasgow wins tree of the year competition"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.744,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.604,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A cherished ash tree in Glasgow has won the Woodland Trust's annual Tree of the Year competition, beating nine other contenders including the 'King of Limbs' oak in Wiltshire. This event highlights significant trees across the UK, showcasing the value and beauty of the country's natural heritage.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Dallas Stars' Jamie Benn Out 4 Weeks After Lung Surgery",
    "domain": "sports",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Thu, 25 Sep 2025 18:00:00 GMT",
    "source": "NHL",
    "sources": [
      "Sportsnet",
      "NHL"
    ],
    "domains": [
      "www.sportsnet.ca",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMikwFBVV95cUxOeUFTWWRrdmMwOGhXWVZ6aERSNFJfZUw2UXItUExuNWRXZE9RbFljcVowVFZEbFpLc3ZPLVU0bDY3NUp3MjFLcnBCR016dVpOTUtyMUZzMUlBTklyUkI5VDJ1YktiTWs1UjVsSWRNYzYwR1dlY2tKV3BjUFlNRlBUTmNjNFByaVh4SFRQQ3JmZ1k3R0k?oc=5\" target=\"_blank\">Benn to miss start of season",
      "<p>The Dallas Stars will be without their captain for the next four weeks. </p>"
    ],
    "image_url": "",
    "titles": [
      "Benn to miss start of season for Stars with collapsed lung - NHL.com",
      "Stars captain Jamie Benn to undergo surgery for collapsed lung"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.729,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.601,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Dallas Stars captain and left winger Jamie Benn will be sidelined for at least four weeks following surgery for a collapsed lung, as announced by the team. This means Benn will miss the start of the season.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Tesla Appeals to EPA Amidst Musk's Controversial $300M Actions",
    "domain": "technology",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Thu, 25 Sep 2025 17:44:04 GMT",
    "source": "Axios",
    "sources": [
      "TechCrunch",
      "Axios"
    ],
    "domains": [
      "techcrunch.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMiZ0FVX3lxTFBKSVU5MmZrS1BEZGRNSVRpaENOZGZkN2RZaldLQ2NrVnFhZmdGdnRtNWc2RXAzeHRuNXlUSnoydzRZWHNwNWtsZTNqaXZpNWtPZnFYNXZmOHA4R192OVdmSnp1dEFJY28?oc=5\" target=\"_blank\">Tesla urges EPA not to smash foundation for climate rules</a>&nbsp;&nbsp;<font color=\"#6",
      "The company's regulatory policy team is trying to clean up a mess that CEO Elon Musk spent $300 million to help create."
    ],
    "image_url": "",
    "titles": [
      "Tesla urges EPA not to smash foundation for climate rules - Axios",
      "Tesla asks EPA not to roll back emissions rules as Trump calls climate change a ‘con job’"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.725,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.6,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Tesla has urged the EPA not to dismantle the foundation for climate regulations, addressing a situation complicated by CEO Elon Musk's actions, which involved a $300 million expenditure. The company's regulatory policy team is actively working to mitigate the fallout from Musk's decisions.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]