[
  {
    "title": "Cyberattack Hits Major European Airports, Causes Delays and Cancellations",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sat, 20 Sep 2025 06:00:16 -0400",
    "source": "NPR",
    "sources": [
      "The Guardian",
      "Global News",
      "Financial Post",
      "BBC",
      "Business Insider",
      "NPR",
      "CityNews",
      "ABC News",
      "Al Jazeera"
    ],
    "domains": [
      "www.npr.org",
      "www.theguardian.com",
      "www.aljazeera.com",
      "abcnews.go.com",
      "globalnews.ca",
      "financialpost.com",
      "ottawa.citynews.ca",
      "www.businessinsider.com",
      "www.bbc.com"
    ],
    "snippets": [
      "A cyberattack targeting check-in and boarding systems has disrupted air traffic and caused delays at several of Europe's major airports, officials said Saturday.",
      "Travellers report multi-hour waits for some airlines as disruption also hits Brussels and Berlin.",
      "Heathrow, Brussels and Berlin airports among major European hubs confirming disruptions as a result of the attack.",
      "A cyberattack targeting check-in and boarding systems has disrupted air traffic at several major European airports",
      "<p>Attack raises questions over security as Brussels and Berlin airports’ check-in and boarding systems also affected</p><p>Flights have been delayed and cancelled at three major European airports – including London’s largest, Heathrow – after the company behind the software used for check-in and bo",
      "The disruptions to electronic systems initially reported at Brussels, Berlin’s Brandenburg and London’s Heathrow airports meant that only manual check-in and boarding was possible.",
      "Brussels Airport said a \"cyberattack\" had targeted a service provider for check-in and boarding systems.",
      "LONDON (AP) &#8212; A cyberattack targeting check-in and boarding systems disrupted air traffic and caused delays at several of Europe&#8217;s major airports on Saturday. While the impact on travelers appeared to be limited, experts said the intrusion exposed vulnerabilities in security systems. The",
      "LONDON (AP) — A cyberattack targeting check-in and boarding systems disrupted air traffic and caused delays at several of Europe’s major airports on Saturday. While the impact on travelers appeared to be limited, experts said the intrusion exposed vulnerabilities in security systems. The disruptions"
    ],
    "image_url": "",
    "titles": [
      "Cyberattack disrupts check-in systems at major European airports",
      "Cyber-attack causes delays at Heathrow and other European airports",
      "Cyberattack hits check-in systems at some of Europe’s busiest airports",
      "Cyberattack disrupts check-in systems at major European airports",
      "Heathrow flights delayed and cancelled as cyber-attack hits European airports",
      "Cyberattack causes disruption at major European airports, including Heathrow",
      "Travel chaos as 'cyberattack' disrupts European airports, including London's Heathrow",
      "Cyberattack disrupts check-in systems at major European airports",
      "Cyberattack disrupts check-in systems at major European airports"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.879,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.851,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A cyberattack disrupted check-in and boarding systems at several major European airports, including Heathrow, Brussels, and Berlin's Brandenburg, causing delays and cancellations. The attack targeted a service provider used by these airports, leading to a reliance on manual processes. Despite the disruptions, the impact on travelers was described as limited, but the incident highlighted security vulnerabilities in airport systems.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "NATO Intercepts Russian Jets in Estonian Airspace; EU Condemns Act",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 20 Sep 2025 10:47:20 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "Deutsche Welle",
      "BBC",
      "New York Times",
      "Washington Post",
      "ABC News"
    ],
    "domains": [
      "www.theguardian.com",
      "abcnews.go.com",
      "www.nytimes.com",
      "www.dw.com",
      "www.bbc.com",
      "www.washingtonpost.com"
    ],
    "snippets": [
      "Russia denies jets entered Estonian airspace in the same month as its drones violated the airspace of two other Nato members.",
      "Estonia requested a consultation of NATO powers after the Baltic nation said three Russian fighter jets violated its airspace in a \"brazen\" 12-minute incursion. Estonia's president said air defense \"must be a priority.\"",
      "Three Russian fighter jets are accused of violating Estonia's airspace, flying for about 12 minutes over NATO territory. NATO scrambled jets to intercept.",
      "<p>Russia denies what EU calls ‘dangerous provocation’ after Italian air force heads off three MiG-31s over Gulf of Finland</p><p>Nato has intercepted three Russian MiG-31 fighter jets that violated Estonia’s airspace over the Baltic Sea in a 12-minute incursion, calling it proof of Moscow’s “reckle",
      "The Russian breach of E.U. air space is the third in just a matter of days after drone incursions into Poland and Romania.",
      "Estonia’s foreign minister described the flights, which lasted for an unusually long 12 minutes, as an “unprecedentedly brazen” intrusion."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/c13f/live/c28ed850-95c6-11f0-9cf6-cbf3e73ce2b9.jpg",
    "titles": [
      "Estonia seeks Nato consultation after Russian jets violate airspace",
      "Estonia seeks NATO consultations after Russia jets incident",
      "WATCH:  3 Russian fighter jets accused of violating Estonia's airspace",
      "Nato intercepts Russian fighter jets on ‘reckless’ violation of Estonian airspace",
      "Russian fighter jets breach Estonian airspace",
      "Russian Fighter Jets Enter Airspace of Estonia, a NATO Member"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.875,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.825,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "NATO intercepted three Russian MiG-31 fighter jets that entered Estonian airspace for 12 minutes, marking a significant breach. Estonia condemned the act as an \"unprecedentedly brazen\" intrusion and summoned a Russian diplomat in response. NATO highlighted its quick response as evidence of its capability to counter such actions. Russia, however, denied the allegations, which the EU labeled a \"dangerous provocation.\" This incident is part of a series of recent airspace violations by Russia in the EU, including drone incursions into Poland and Romania.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Russia Attacks Ukraine with 600+ Drones, Missiles; Casualties Reported",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 20 Sep 2025 15:30:15 GMT",
    "source": "BBC",
    "sources": [
      "Global News",
      "CityNews",
      "ABC News",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "abcnews.go.com",
      "globalnews.ca",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "President Zelensky says Moscow seeks to \"intimidate civilians\", while Russia reports four deaths in a Ukrainian strike.",
      "Russia carried out a “massive” attack across Ukraine Friday night into Saturday morning, using more than 600 drones and missiles, according to the Ukrainian Air Force.",
      "'The enemy’s target was our infrastructure, residential areas and civilian enterprises,' said Ukrainian President Volodymyr Zelenskyy.",
      "KYIV, Ukraine (AP) — Russia launched a large-scale missile and drone attack targeting regions across Ukraine early Saturday, killing at least three people and wounding dozens more, Ukrainian officials said. Ukrainian President Volodymyr Zelenskyy said the attacks took place across nine regions, incl"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/a28a/live/11237600-961d-11f0-b5f9-bf23d14527d7.png",
    "titles": [
      "Ukraine says three killed in 'massive' Russian aerial attack",
      "Russia carries out 'massive' attack across Ukraine",
      "Russia launches attack on Ukraine, killing 3 and wounding dozens",
      "Russia launches a large-scale attack on Ukraine, killing 3 and wounding dozens"
    ],
    "score_components": {
      "magnitude": 0.932,
      "recency": 0.965,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.796,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Russia launched a large-scale attack on Ukraine, using over 600 drones and missiles, targeting infrastructure, residential areas, and civilian enterprises. Ukrainian President Zelensky reported the attack aimed to \"intimidate civilians\" and resulted in at least three deaths and multiple injuries across nine regions. Concurrently, Russia reported four deaths from a Ukrainian strike.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Chiefs' Xavier Worthy Out for Sunday's Game Against Giants Due to Injury",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sat, 20 Sep 2025 11:51:04 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Yahoo Sports",
      "CBS Sports"
    ],
    "domains": [
      "www.nbcsports.com",
      "www.espn.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Chiefs WR Xavier Worthy been ruled out for Sunday night's game against the Giants and is not traveling with the team.",
      "Worthy will miss a second straight game after dislocating his shoulder in Kansas City's season-opening loss",
      "The Kansas City receiver is not ready to return from a shoulder injury suffered in the season opener."
    ],
    "image_url": "",
    "titles": [
      "Chiefs WR Worthy (shoulder) ruled out vs. Giants",
      "Xavier Worthy injury update: Chiefs WR ruled out for Week 3 game vs. Giants despite returning to practice",
      "Xavier Worthy downgraded to out for Week 3"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.993,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.777,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Chiefs WR Xavier Worthy will miss his second consecutive game due to a shoulder dislocation sustained in the season opener. He has been ruled out for Sunday night's game against the Giants and will not travel with the team.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: sustain",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Verstappen Takes Pole in Chaotic Azerbaijan GP Qualifying with 6 Red Flags",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sat, 20 Sep 2025 10:26:51 EST",
    "source": "ESPN",
    "sources": [
      "The Guardian",
      "ESPN",
      "Sky Sports"
    ],
    "domains": [
      "www.skysports.com",
      "www.espn.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Max Verstappen denied Carlos Sainz and Williams a shock pole position in one of the great Formula 1 qualifying sessions, featuring six red flags.",
      "<ul><li><p>Session marred by driver mishaps, rain and six red flags</p></li><li><p>McLaren drivers make big errors in marathon session</p></li></ul><p>Misjudgement and error left Formula One’s leading lights flailing on the streets of Baku, but Max Verstappen delivered pole position for the Azerbaij",
      "Max Verstappen took pole position in a thrilling Qualifying for the Azerbaijan Grand Prix which featured a record six red flags after several crashes, including a shunt for championship leader Oscar Piastri."
    ],
    "image_url": "",
    "titles": [
      "F1 chaos! Verstappen on pole, Piastri 1 of 6 crashes",
      "Verstappen grabs pole for Azerbaijan GP as Piastri crashes out in F1 qualifying chaos",
      "Verstappen on pole as Piastri one of six to crash in thrilling Qualifying"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.964,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.762,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Max Verstappen secured pole position in a dramatic Azerbaijan Grand Prix qualifying session, overshadowed by six red flags due to multiple crashes and driver errors, including those from McLaren drivers and championship leader Oscar Piastri. The session was further complicated by adverse weather conditions, making it a challenging day for teams and drivers alike.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "U.S. Attorney Erik Siebert Resigns Amid Pressure from President Trump",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sat, 20 Sep 2025 08:01:59 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "ABC News",
      "Fortune"
    ],
    "domains": [
      "fortune.com",
      "abcnews.go.com",
      "www.npr.org"
    ],
    "snippets": [
      "Erik Siebert resigned after President Trump said he wanted him \"out\" after a monthslong mortgage fraud investigation into New York Attorney General Letitia James failed to result in criminal charges.",
      "U.S. Attorney Erik Siebert resigned his position Friday amid pressure from President Trump after sources said he refused to bring charges against NY AG Letitia James.",
      "Erik Siebert's monthslong mortgage fraud investigation into New York Attorney General Letitia James has not resulted in criminal charges."
    ],
    "image_url": "",
    "titles": [
      "U.S. attorney resigns under pressure from Trump to charge N.Y. AG Letitia James",
      "US attorney resigns amid pressure from Trump over NY AG probe: Sources",
      "U.S. attorney who failed to charge Trump adversary resigns under pressure from administration"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.917,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.752,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Erik Siebert, a U.S. Attorney, resigned on Friday following pressure from President Trump, who expressed a desire for Siebert's removal after a monthslong mortgage fraud investigation led by Siebert into New York Attorney General Letitia James concluded without resulting in any criminal charges.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Announces Preliminary Deal with China to Keep TikTok in US",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-09-19T21:21:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "The Guardian",
      "CNBC",
      "New York Times",
      "Deutsche Welle"
    ],
    "domains": [
      "www.theguardian.com",
      "www.dw.com",
      "www.nytimes.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "US President Donald Trump said Chinese President Xi Jinping had approved a framework agreement to keep TikTok operating in the US after a phone call. But specifics are still unclear.",
      "President Donald Trump and Chinese leader Xi Jinping held a much-anticipated call aimed at finalizing a deal to keep TikTok from going dark in the U.S.",
      "<p>Trump’s statement suggests preliminary agreement between leaders in the first direct contact between them since June</p><p>Donald Trump said on Friday that he and Xi Jinping had agreed to approve a deal over TikTok.</p><p>“He approved the TikTok deal,” Trump said about Xi to reporters in the Oval",
      "President Trump said he would meet with President Xi Jinping next month in South Korea. Mr. Xi said he welcomes a TikTok deal that would benefit both sides."
    ],
    "image_url": "",
    "titles": [
      "Trump says Xi approved a deal to keep TikTok operating in US",
      "Trump, Xi make progress on TikTok deal, but more work remains, White House says",
      "Trump says Xi Jinping has agreed to approve TikTok deal, but details unclear",
      "Trump Hails Progress on TikTok Deal After Call With Xi"
    ],
    "score_components": {
      "magnitude": 0.932,
      "recency": 0.675,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.738,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "US President Donald Trump announced that after a phone call with Chinese President Xi Jinping, a preliminary agreement has been reached to keep TikTok operating in the US. This marks the first direct contact between the two leaders since June, moving towards finalizing a deal. However, the specifics of the agreement remain unclear.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Liverpool Wins Merseyside Derby 2-1, Extends Perfect Season Start",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sat, 20 Sep 2025 14:11:17 +0000",
    "source": "Al Jazeera",
    "sources": [
      "The Guardian",
      "Sky Sports",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.skysports.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Ryan Gravenberch&#039;s 10th-minute stunner set Liverpool on their way to a 2-1 win against Everton in the Merseyside derby.",
      "<p>On paper, at least, Liverpool have thus far achieved perfection with a fifth win in five Premier League games to keep them looking down on everyone else, but they are yet to find their best form. There was a rare lack of late drama in their Merseyside derby triumph over Everton, instead having to",
      "Liverpool stay perfect in the Premier League after beating Everton 2-1 in a tense Merseyside derby to extend David Moyes' miserable record at Anfield."
    ],
    "image_url": "",
    "titles": [
      "Liverpool hold on against Everton after Gravenberch stunner opened derby",
      "Gravenberch and Ekitiké on target as Liverpool stay perfect against Everton",
      "Gravenberch stars as Liverpool edge tense Merseyside derby"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.959,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.729,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Liverpool secured a 2-1 victory over Everton in the Merseyside derby, with Ryan Gravenberch scoring in the 10th minute. This win marks Liverpool's fifth consecutive victory in the Premier League, maintaining their perfect start to the season. Despite the win, the team is still seeking to reach its best form.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "RFK Jr.'s Vaccine Panel Revises COVID, MMRV Advice; Hep B Vote Delayed",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Sat, 20 Sep 2025 11:52:54 GMT",
    "source": "Axios",
    "sources": [
      "Wired",
      "Axios",
      "CNBC"
    ],
    "domains": [
      "news.google.com",
      "www.wired.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMie0FVX3lxTE9OS2ZUejZlT1JsZmNJeVJMZ2hIdmg1blhDOGMyUkZVVUdJajNtWWFheGJtUkE1bHBCelRPWTBZSTNnZDQzX3drYkZBX3VzbmJjT2EwT0VpWHdCVVBkaks0ZkEyZE1iMWlIdGxnTXdtMld0WmJoSHVGVXdRRQ?oc=5\" target=\"_blank\">RFK Jr.'s vaccine panel drops broad COVID shot recommendation",
      "The group also voted to emphasize that the Covid vaccine is beneficial for those at high risk of severe illness from the disease.",
      "In a chaotic meeting, ACIP voted not to recommend a prescription requirement for Covid-19 vaccines. Some panelists seemed unaware of the point of the meeting, while others went on strange tangents."
    ],
    "image_url": "",
    "titles": [
      "RFK Jr.'s vaccine panel drops broad COVID shot recommendation - Axios",
      "RFK Jr.'s vaccine panel weakens Covid shot recommendations, calling it an individual decision",
      "RFK Jr.’s Vaccine Panel Votes Down Its Own Proposal to Require Prescriptions for Covid-19 Shots"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.895,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.716,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "RFK Jr.'s vaccine panel has revised its stance, no longer broadly recommending the COVID vaccine and altering its advice on the MMRV vaccine. The decision to postpone the hepatitis B vaccine vote comes as concerns are raised about a potential decline in scientific standards under RFK Jr.'s leadership as HHS secretary.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Mangione's Lawyers Seek to Block Death Penalty Over Pretrial Publicity Concerns",
    "domain": "general",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sat, 20 Sep 2025 15:09:53 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "CityNews"
    ],
    "domains": [
      "globalnews.ca",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "'There is a high bar to dismissing an indictment due to pretrial publicity,' Luigi Mangione’s lawyers wrote in their 114-page filing.",
      "NEW YORK (AP) — Luigi Mangione’s lawyers urged a judge on Saturday to bar federal prosecutors from seeking the death penalty in the killing of UnitedHealthcare CEO Brian Thompson, arguing that authorities prejudiced his case by turning his arrest into a “Marvel movie” spectacle and by publicly decla"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/6e4cf002fd6ea803ba93d03bf4cc31119aa2c22bd857acef582e31960e6ac90c.jpg?quality=65&strip=all",
    "titles": [
      "Luigi Mangione’s lawyers want death penalty case dismissed",
      "Luigi Mangione’s lawyers want death penalty off the table in UnitedHealthcare CEO murder case"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.979,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.701,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Luigi Mangione's legal team requested a judge to prevent federal prosecutors from pursuing the death penalty against him for the murder of UnitedHealthcare CEO Brian Thompson. They argued that excessive pretrial publicity and the dramatization of his arrest have biased his case. The request was detailed in a 114-page filing, highlighting concerns about the impact of public and media attention on the fairness of the legal proceedings.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Federal Judge Dismisses Trump's Defamation Suit Against NYT, Allows Revision",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-09-19T23:49:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Axios",
      "CNBC",
      "Deutsche Welle"
    ],
    "domains": [
      "news.google.com",
      "www.dw.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "A judge in Florida said the US president's defamation complaint against the newspaper was too long and full of personal invective. Trump has 28 days to file a new complaint.",
      "<a href=\"https://news.google.com/rss/articles/CBMie0FVX3lxTE43NWRlLXFTU1hON0Z5T21JVEF6OVpJVlRwUy1yRnJFMlZVMWxQYkd6RGZqS3B5bDlVY2UtR3lyRXZuN1Q5c0piV1JGSmIxWUxYX3djTVBjaUlVdHN5RXl4MGVXQ2lpYzFOVFRsalE0d0ZZLVhuZTg3NUhZSQ?oc=5\" target=\"_blank\">Trump told to refile New York Times lawsuit judge dismissed a",
      "Judge Steven Merryday noted that Trump's defamation lawsuit against The New York Times \"consumes\" 85 pages."
    ],
    "image_url": "",
    "titles": [
      "US judge tosses Trump's $15 billion New York Times lawsuit",
      "Trump told to refile New York Times lawsuit judge dismissed as too wordy - Axios",
      "Trump says 'I'm winning' after judge tosses his $15 billion NY Times lawsuit"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.711,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.693,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A US federal judge ruled that Donald Trump's defamation lawsuit against the New York Times was excessively long and filled with unnecessary personal attacks. The judge dismissed the complaint but gave Trump 28 days to submit a revised version that addresses these issues.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Week 3 Fantasy Football Projections & Advice Released by SportsLine",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sat, 20 Sep 2025 11:51:04 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Do injuries have you seeking a late-week pickup? Need a defense to stream? These options have favorable setups.",
      "SportsLine's model reveals its Week 3 Fantasy football projections, PPR rankings, start-sit advice for sites like CBS Sports, ESPN and Yahoo"
    ],
    "image_url": "",
    "titles": [
      "🏈 Fantasy football: Week 3 last-minute pickups",
      "Fantasy Football Rankings, sleepers, streamers, model cheat sheets for NFL Week 3, 2025 in PPR and standard"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.993,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.679,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "SportsLine's model released Week 3 Fantasy football projections, PPR rankings, and start-sit advice for platforms including CBS Sports, ESPN, and Yahoo. It provides recommendations for late-week pickups and defensive streams based on favorable setups.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "2025 WNBA Semifinals Begin Sunday, New Champion Guaranteed",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sat, 20 Sep 2025 02:16:00 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "The 2025 WNBA postseason is underway, with the semifinals set to begin Sunday.",
      "<p>The WNBA semifinals are set and a new champion is guaranteed after all four remaining teams were challenged in the opening round</p>"
    ],
    "image_url": "",
    "titles": [
      "WNBA playoff schedule: Semifinals set with Mercury-Lynx, Fever-Aces",
      "WNBA semifinals set: Lynx, Aces, Mercury and Fever reach second round"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.813,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.653,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The 2025 WNBA postseason has progressed to the semifinals, starting Sunday. With the completion of the opening round, all four remaining teams have faced significant challenges, ensuring that a new champion will be crowned this season.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: progress",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "CBS Experts Offer Predictions for Maryland vs. Wisconsin Game",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sat, 20 Sep 2025 15:05:00 +0000",
    "source": "CBS Sports",
    "sources": [
      "Yahoo Sports",
      "CBS Sports"
    ],
    "domains": [
      "www.behindthesteelcurtain.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Find best bets and props for the biggest games in sports on Saturday from the SportsLine Projection Model and top CBS Sports experts",
      "The Maryland Terrapins take on the Wisconsin Badgers in Week 4 of the college football season on Saturday",
      "Hang out at BTSC for another college football Saturday."
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/06/beb067e8-5ad7-4a1e-bb8f-88d2bc0445ec/john-mateer-cbs.jpg",
    "titles": [
      "Today's top games to watch, best bets, odds: College football Week 4, Astros-Mariners and more",
      "Wisconsin vs. Maryland: Where to watch college football Week 4, betting odds, picks, promos for Saturday",
      "Saturday college football open thread: Week 4"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.977,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.65,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The SportsLine Projection Model and top CBS Sports experts are offering predictions for the biggest games in sports on Saturday, including the Week 4 college football matchup between the Maryland Terrapins and the Wisconsin Badgers. Fans are invited to follow the event at BTSC for a comprehensive college football Saturday experience.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Verstappen Secures Pole in Record Six-Red-Flag Azerbaijan GP Qualifying",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 20 Sep 2025 15:01:36 GMT",
    "source": "BBC",
    "sources": [
      "Yahoo Sports",
      "BBC"
    ],
    "domains": [
      "www.bbc.com"
    ],
    "snippets": [
      "Max Verstappen takes pole position after an extraordinary qualifying session featuring a record six red flags at the Azerbaijan Grand Prix.",
      "Max Verstappen takes pole position after an extraordinary qualifying session featuring a record six red flags at the Azerbaijan Grand Prix."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/7c37/live/e61bc970-9631-11f0-baf3-df7955adb839.jpg",
    "titles": [
      "Verstappen takes Baku pole after record six red flags",
      "Verstappen takes pole after record six red flags"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.956,
      "consensus": 0.571,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.648,
    "summary_source": "snippet",
    "summary_reason": "retry_exhausted",
    "summary": "Max Verstappen takes pole position after an extraordinary qualifying session featuring a record six red flags at the Azerbaijan Grand Prix.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Ukraine Targets Russian Refineries in Drone Strikes, Aims to Curb Oil Exports",
    "domain": "business",
    "source_domain": "www.forbes.com",
    "location": "global",
    "published": "Sat, 20 Sep 2025 04:49:00 -0400",
    "source": "Forbes",
    "sources": [
      "Financial Post",
      "Forbes"
    ],
    "domains": [
      "www.forbes.com",
      "financialpost.com"
    ],
    "snippets": [
      "Ukraine’s strikes on Russian refineries coupled with Russia’s costly, ineffective offensive give Kyiv leverage for future peace negotiations.",
      "Ukraine claimed drone strikes that damaged energy infrastructure deep within Russian territory on Saturday, the latest of a series of attacks aimed at denting export revenues and stemming the flow of oil."
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/68ce6a2e6683c37554d5dee0/0x0.jpg?width=960",
    "titles": [
      "Ukraine Gains Leverage With Strikes On Russian Refineries",
      "Ukraine’s Drones Target Russian Refineries, Pumping Stations"
    ],
    "score_components": {
      "magnitude": 0.795,
      "recency": 0.858,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.648,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Ukraine conducted drone strikes on Russian refineries, damaging energy infrastructure. This action is part of a series of attacks targeting Russia's oil exports and revenue. Coupled with Russia's expensive, ineffective offensive, these strikes provide Kyiv with leverage for potential future peace negotiations.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "WWE Wrestlepalooza 2025 Debuts on ESPN, Features AJ Lee's Return",
    "domain": "business",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sat, 20 Sep 2025 14:00:50 +0000",
    "source": "CBS Sports",
    "sources": [
      "Forbes",
      "CBS Sports"
    ],
    "domains": [
      "www.forbes.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "WWE kicks off a new era on Saturday night with a massive slate on tap in Indiana",
      "WWE is set for its first PPV event on ESPN later this month",
      "What time does WWE Wrestlepalooza start? Where can you stream Wrestlepalooza through ESPN with or without a cable provider?",
      "WWE WrestlePalooza 2025 match card, start time and betting odds as AJ Lee returns to the ring and Brock Lesnar faces John Cena.",
      "AEW All Out 2025 start time, match card, odds and where to stream the early Toronto PPV as AEW goes head-to-head with Wrestlepalooza."
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/16/a249d9b4-25bd-4231-9b46-045a10836b8c/john-cena-getty.jpg",
    "titles": [
      "WWE Wrestlepalooza 2025 predictions, card, start time, matches, expert picks, date for event in Indianapolis",
      "WWE Wrestlepalooza 2025: Card, date, matches, rumors, start time, location as John Cena headlines debut event",
      "WWE Wrestlepalooza 2025 Start Time, Match Card And Where To Stream",
      "WWE WrestlePalooza 2025 Match Card, Start Time And Odds",
      "AEW All Out 2025 Start Time, Match Card, Odds And Where To Stream"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.956,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.646,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "WWE is launching a new era with Wrestlepalooza 2025, featuring AJ Lee's return and a match between Brock Lesnar and John Cena. The event starts on Saturday night in Indiana and will be the first WWE PPV available on ESPN. Fans can stream it with or without a cable provider. Concurrently, AEW All Out 2025 will also take place, presenting a competitive lineup in Toronto, available for streaming on specified platforms.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Microsoft Raises Xbox Prices in US Due to Tariffs",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Fri, 19 Sep 2025 19:37:08 GMT",
    "source": "CNBC",
    "sources": [
      "Ars Technica",
      "CNBC"
    ],
    "domains": [
      "arstechnica.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "Many consumer companies have been warning for months that higher prices are on the way following President Trump's tariffs.",
      "Asking prices for some models are up 33 percent in less than a year."
    ],
    "image_url": "",
    "titles": [
      "Microsoft raises Xbox prices in U.S. due to economic environment",
      "Microsoft raises Xbox console prices for the second time this year"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.638,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.597,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Following President Trump's tariffs, consumer companies warned of rising prices. Microsoft is increasing Xbox Series S / X prices in the US starting October 3rd, citing these tariffs. The Xbox Series X will go from $599.99 to $649.99, and the Series S from $379.99 to $399.99. This is part of a broader trend, with some product prices rising by up to 33% in less than a year.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Kane's Hat-Trick Powers Bayern to 4-1 Win Over Hoffenheim",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "national",
    "published": "Sat, 20 Sep 2025 15:46:22 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "onefootball.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Harry Kane scores his second hat-trick of the season as Bayern Munich overcome a shaky start to win at Hoffenheim.",
      "Harry Kane was the star of the show as Bayern Munich ran out 4-1 winners at Hoffenheim, the English forward scoring a hat-trick to maintain Bayern’s perfect start in the Bundesliga.Vincent Kompany m..."
    ],
    "image_url": "",
    "titles": [
      "Kane scores hat-trick as Bayern win at Hoffenheim",
      "Harry Kane’s hat-trick fires Bayern to 4-1 win"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.991,
      "consensus": 0.37,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.471,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Harry Kane scored a hat-trick, leading Bayern Munich to a 4-1 victory over Hoffenheim. This marks Kane's second hat-trick of the season, contributing to Bayern's continued perfect start in the Bundesliga.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "\"Tulsa King\" Season 3 Premieres; Farm Aid 40 Concert This Weekend",
    "domain": "business",
    "source_domain": "www.forbes.com",
    "location": "global",
    "published": "Sat, 20 Sep 2025 08:00:02 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes"
    ],
    "domains": [
      "www.forbes.com"
    ],
    "snippets": [
      "\"Tulsa King,\" Sylvester Stallone’s crime drama created by Taylor Sheridan, returns this weekend with Season 3. What time does the new season begin streaming on Paramount+?",
      "Farm Aid 40, featuring such music icons as Willie Nelson, Bob Dylan, Neil Young and John Mellencamp in a fundraising concert for America’s farmers, is Saturday. What time does the event get underway and where can you watch it on TV and streaming?"
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/68ce53c17e9e7840755afd3b/0x0.jpg?width=960",
    "titles": [
      "What Time Does Sylvester Stallone’s ‘Tulsa King’ Season 3 Begin? How To Watch",
      "What Time Does Farm Aid 40 Begin? How To Watch On Streaming And TV"
    ],
    "score_components": {
      "magnitude": 0.393,
      "recency": 0.916,
      "consensus": 0.35,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.468,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "\"Tulsa King,\" starring Sylvester Stallone, debuts its third season on Paramount+ this weekend. Meanwhile, Farm Aid 40, with Willie Nelson, Bob Dylan, Neil Young, and John Mellencamp, will support American farmers in a concert on Saturday. Both events' specific start times and streaming details were not provided.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "SportsLine Releases College Football Picks for Sept 20 at FanDuel",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sat, 20 Sep 2025 15:47:02 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com"
    ],
    "snippets": [
      "SportsLine's model reveals its top college football picks and predictions on Saturday at FanDuel Sportsbook",
      "SportsLine's model reveals its top college football best bets for Saturday, September 20"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/20/8a2f42ba-f4ee-4619-91a0-4473c9eede08/jackson-arnold-cbs-5.jpg",
    "titles": [
      "Use FanDuel promo code on Saturday: Get $300 bonus bets by backing Michigan vs. Nebraska, Illinois vs. Indiana",
      "Use DraftKings promo code for Saturday best bets: Get $200 in bonus bets by backing Notre Dame, Michigan"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.992,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.466,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "SportsLine's model has released its top college football picks and predictions for Saturday, September 20, available at FanDuel Sportsbook. These selections are based on the model's analysis for the day's games.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Shopper Finds Savings at Aldi; Costly Mistakes Ruin Vienna Trip",
    "domain": "business",
    "source_domain": "www.businessinsider.com",
    "location": "global",
    "published": "2025-09-20T12:37:02Z",
    "source": "Business Insider",
    "sources": [
      "Business Insider"
    ],
    "domains": [
      "www.businessinsider.com"
    ],
    "snippets": [
      "My first trip to Aldi in decades surprised me. I loved the savings on groceries like eggs and milk, and it's become my new go-to grocery store.",
      "During my 48-hour trip to Vienna, I made mistakes that cost me time, money, and sleep. It started with an overnight train ride."
    ],
    "image_url": "https://i.insider.com/68c04e1e57d362d375e7ced9?format=jpeg",
    "titles": [
      "I went to Aldi for the first time in 40 years. I was impressed by how far my money could go.",
      "I went to Vienna for the first time. 4 mistakes drained my energy and bank account."
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.928,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.454,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A shopper revisited Aldi after decades and was pleasantly surprised by the savings on groceries, making it their preferred store. Meanwhile, another person's 48-hour trip to Vienna was marred by costly mistakes, including a problematic overnight train ride, leading to lost time, money, and sleep.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]