[
  {
    "title": "Smartmatic alleges Fox News destroyed text messages as Fox wins new documents",
    "domain": "general",
    "location": "national",
    "published": "Wed, 14 May 2025 21:04:19 -0400",
    "source": "ABC News",
    "sources": [
      "ABC News"
    ],
    "snippets": [
      "Smartmatic, in its defamation lawsuit against Fox News, accuses Fox executives of deleting text messages, while a new ruling for Fox could help its defense."
    ],
    "image_url": "https://s.abcnews.com/images/US/fox-news-election-debate-ap-moe-068-230820_1692706458199_hpMain_2_4x3t_384.jpg",
    "titles": [
      "Smartmatic alleges Fox News destroyed text messages as Fox wins new documents"
    ],
    "summary": "Smartmatic has accused Fox News executives of deleting text messages in its defamation lawsuit against the network. Additionally, a recent court ruling may benefit Fox News' defense in the case.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about an ongoing lawsuit between Smartmatic and Fox News. However, it lacks depth and insight into the broader implications of the case or actionable insights for the reader.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.68,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.43,
    "normalized_score": 0.84
  },
  {
    "title": "WATCH:  Famed Big Bear eaglets prepare to leave their nest",
    "domain": "general",
    "location": "national",
    "published": "Wed, 14 May 2025 20:16:00 -0400",
    "source": "ABC News",
    "sources": [
      "ABC News"
    ],
    "snippets": [
      "Two baby eagles, Sunny and Gizmo, whom thousands have watched via livestream since they were born two-and-a-half months ago, are getting ready to leave their nest in Big Bear, California."
    ],
    "image_url": "https://s.abcnews.com/images/WNT/250514_wn_ender_hpMain_4x3_384.jpg",
    "titles": [
      "WATCH:  Famed Big Bear eaglets prepare to leave their nest"
    ],
    "summary": "Two baby eagles named Sunny and Gizmo, observed by thousands through a livestream since their birth 2.5 months ago, are preparing to leave their nest in Big Bear, California.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "While this story may be interesting to some readers, it doesn't provide actionable insights or deeper understanding. It doesn't report on solutions, improvements, or attempts to solve problems, nor does it increase clarity around systems, causes, trends, or impacts that matter.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.669,
      "consensus": 0.2,
      "constructiveness": 0.2
    },
    "score": 0.416,
    "normalized_score": 0.0
  },
  {
    "title": "NAIT pausing 18 programs as part of review",
    "domain": "general",
    "location": "national",
    "published": "Thu, 15 May 2025 23:56:26 +0000",
    "source": "Global News",
    "sources": [
      "Global News"
    ],
    "snippets": [
      "The post-secondary's vice-president, academic Peter Leclaire says the changes are to ensure NAIT can meet the needs of students and industry."
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2017/02/nait-cat.jpg?quality=85&strip=all",
    "titles": [
      "NAIT pausing 18 programs as part of review"
    ],
    "summary": "NAIT's Vice-President Academic, Peter Leclaire, announced changes aimed at aligning the institution's offerings more closely with student and industry needs. This move is part of NAIT's effort to enhance its relevance and effectiveness in providing education and training.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story informs about NAIT's decision to pause 18 programs as part of a review to align its offerings with student and industry needs. It provides useful context and insight into the institution's efforts to enhance its relevance and effectiveness in providing education and training. However, it could have been more constructive if it had provided more information on the specific programs affected and the expected impact on students and the industry.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.998,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.583,
    "normalized_score": 10.0
  },
  {
    "title": "Australia news live: PM heads for Rome but Trump meeting doubtful; woman charged over Brisbane childcare centre bomb hoaxes",
    "domain": "general",
    "location": "global",
    "published": "Thu, 15 May 2025 23:51:24 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "snippets": [
      "<p>Anthony Albanese on his way to attend inaugural mass of Pope Leo XVI after a flying visit to Jakarta on Thursday. Follow the day’s news live</p><ul><li>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></li></ul><p>After a marathon legal battle spanning seven years, disgraced special forces veteran <strong>Ben Roberts-Smith</strong> will learn this morning whether he has cleared his name of war crime allegations, Australian Associated Press reports.</p><p>The Victoria Cross recipient sued Nine newspapers and journalists <strong>Nick McKenzie</strong> and <strong>Chris Masters</strong> for defamation over their reports in 2018 which claimed he had committed war crimes.</p> <a href=\"https://www.theguardian.com/australia-news/live/2025/may/16/australia-news-live-ben-roberts-smith-appeal-verdict-ntwnfb\">Continue reading...</a>",
      "<p>Anthony Albanese on his way to attend inaugural mass of Pope Leo XVI after a flying visit to Jakarta on Thursday. Follow the day’s news live</p><ul><li>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></li></ul><p>After a marathon legal battle spanning seven years, disgraced special forces veteran <strong>Ben Roberts-Smith</strong> will learn this morning whether he has cleared his name of war crime allegations, Australian Associated Press reports.</p><p>The Victoria Cross recipient sued Nine newspapers and journalists <strong>Nick McKenzie</strong> and <strong>Chris Masters</strong> for defamation over their reports in 2018 which claimed he had committed war crimes.</p> <a href=\"https://www.theguardian.com/australia-news/live/2025/may/16/australia-news-live-ben-roberts-smith-appeal-verdict-ntwnfb\">Continue reading...</a>"
    ],
    "image_url": "https://i.guim.co.uk/img/media/35c266e73f827920d06ca5ac43e2f806f91dd6ce/1054_0_6071_4857/master/6071.jpg?width=140&quality=85&auto=format&fit=max&s=4338d112fe601b7e7fe2d4ff8098cb18",
    "titles": [
      "Australia news live: PM heads for Rome but Trump meeting doubtful; woman charged over Brisbane childcare centre bomb hoaxes",
      "Australia news live: PM heads for Rome but Trump meeting doubtful; woman charged over Brisbane childcare centre bomb hoaxes"
    ],
    "summary": "Australian Prime Minister Anthony Albanese is en route to attend the inaugural mass of Pope Leo XVI, following a brief visit to Jakarta. Meanwhile, after a prolonged seven-year legal battle, Ben Roberts-Smith, a former special forces soldier and Victoria Cross recipient, awaits a verdict on whether he has successfully cleared his name of allegations of war crimes. Roberts-Smith had sued Nine newspapers and journalists Nick McKenzie and Chris Masters for defamation following their 2018 reports accusing him of committing war crimes.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information about the Prime Minister's international visit and the outcome of a significant legal case. However, it doesn't highlight any solutions or improvements, and its depth in explaining the systems, causes, or impacts at play is limited.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.997,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.563,
    "normalized_score": 8.8
  },
  {
    "title": "Lethbridge hosts annual Canadian College World Series",
    "domain": "general",
    "location": "national",
    "published": "Thu, 15 May 2025 23:49:07 +0000",
    "source": "Global News",
    "sources": [
      "Global News"
    ],
    "snippets": [
      "Despite a rain delay launching the tournament, fans cheered their teams on as a weekend full of baseball comes to southern Alberta."
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/05/CCWS.bmp",
    "titles": [
      "Lethbridge hosts annual Canadian College World Series"
    ],
    "summary": "Despite a rain delay, a baseball tournament successfully commenced in southern Alberta, drawing enthusiastic support from fans cheering for their teams throughout the weekend.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "While the story offers basic awareness about a local event, it doesn't provide deeper insights or understanding. It doesn't report on any solutions, improvements, or innovations, and it doesn't increase clarity around any significant systems, causes, trends, or impacts.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.996,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.524,
    "normalized_score": 6.47
  },
  {
    "title": "Jamal Murray active for Game 6 despite illness as Nuggets try to extend series vs. Thunder",
    "domain": "sports",
    "location": "national",
    "published": "Thu, 15 May 2025 23:59:14 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports"
    ],
    "snippets": [
      "Murray was listed as questionable but will play with the Nuggets' season on the line"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/05/15/7adc0710-03fe-4882-abe4-cb69a0ddad0e/jamal-murray-nuggets-g.jpg",
    "titles": [
      "Jamal Murray active for Game 6 despite illness as Nuggets try to extend series vs. Thunder"
    ],
    "summary": "Despite being listed as questionable due to concerns about his health, Murray will participate in the upcoming game, crucial for the Nuggets' season. This decision underscores his commitment to the team as they face a pivotal moment.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about an upcoming sports event and a player's commitment to his team. However, it doesn't offer actionable insights or deeper understanding, and it doesn't report on any solutions or improvements outside of the specific context of this game.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.999,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.525,
    "normalized_score": 6.53
  },
  {
    "title": "Ex-Patriots QB compares one part of Drake Maye's game to Patrick Mahomes",
    "domain": "sports",
    "location": "national",
    "published": "Thu, 15 May 2025 23:53:12 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "snippets": [
      "Former New England Patriots quarterback Drew Bledsoe compared one aspect of Drake Maye's game to Patrick Mahomes."
    ],
    "image_url": "",
    "titles": [
      "Ex-Patriots QB compares one part of Drake Maye's game to Patrick Mahomes"
    ],
    "summary": "Former New England Patriots quarterback Drew Bledsoe made a comparison between Drake Maye and Patrick Mahomes, specifically highlighting a similarity in one aspect of Maye's game to that of Mahomes.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about the comparison between Drake Maye and Patrick Mahomes, but it doesn't provide any deeper insights or actionable information for the reader. It doesn't report on solutions or improvements, nor does it increase clarity around systems or impacts that matter.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.997,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.525,
    "normalized_score": 6.53
  },
  {
    "title": "Catching up with former area athletes: Lukas Bennett claims 100-meter crown at North Star championships",
    "domain": "sports",
    "location": "national",
    "published": "Thu, 15 May 2025 23:48:00 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "snippets": [
      "May 15—DICKINSON, N.D. — Mitchell native Lukas Bennett continued a stellar track campaign for Dakota State University with a strong showing at the North Star Athletic Association track and field championships on May 8-9. The sophomore sprinter claimed the NSAA title in the men's 100-meter dash with a time of 10.71 seconds and added runner-up placements at 200 meters (21.47) and 400 meters ..."
    ],
    "image_url": "",
    "titles": [
      "Catching up with former area athletes: Lukas Bennett claims 100-meter crown at North Star championships"
    ],
    "summary": "Mitchell native Lukas Bennett, a sophomore at Dakota State University, excelled at the North Star Athletic Association track and field championships on May 8-9. He won the men's 100-meter dash title with a time of 10.71 seconds and secured runner-up positions in both the 200 meters (21.47 seconds) and 400 meters, showcasing his sprinting prowess at the event.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about Lukas Bennett's achievements and his performance at the North Star Athletic Association track and field championships. However, it doesn't report on solutions or improvements, nor does it increase clarity around systems or impacts that matter.",
    "score_components": {
      "magnitude": 0.359,
      "recency": 0.996,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.542,
    "normalized_score": 7.54
  },
  {
    "title": "Weather impacts Thursday and Friday's area sports schedule",
    "domain": "sports",
    "location": "national",
    "published": "Thu, 15 May 2025 23:47:00 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "snippets": [
      "May 15—MITCHELL — Forecasted weather for the remainder of the week has forced several changes to the local sports calendar. The Mitchell High School girls golf team's home invitational on Friday, May 16, at Lakeview Golf Course has been canceled. Additionally, the Eastern South Dakota Conference middle school track meet in Pierre, which would've featured Mitchell's middle school team, was also ..."
    ],
    "image_url": "",
    "titles": [
      "Weather impacts Thursday and Friday's area sports schedule"
    ],
    "summary": "Due to forecasted adverse weather conditions, the Mitchell High School girls golf team's home invitational at Lakeview Golf Course scheduled for Friday, May 16, has been canceled. Furthermore, the Eastern South Dakota Conference middle school track meet in Pierre, which was to include Mitchell's middle school team, has also been canceled. These changes have been made to the local sports calendar for safety reasons.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful information about changes in the sports schedule due to weather conditions. It helps readers to plan accordingly and avoid any inconvenience. It increases clarity around the impact of weather on sports events, even though it doesn't report on solutions or improvements.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.996,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.554,
    "normalized_score": 8.26
  },
  {
    "title": "Avon softball blending youth, experience on the diamond",
    "domain": "sports",
    "location": "national",
    "published": "Thu, 15 May 2025 23:47:00 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "snippets": [
      "May 15—AVON, S.D. — The Avon High School softball team is aiming high this season. With a 12-6 record, the Pirates sit in sixth in the Class B standings and are seeking an extended run in the postseason. Behind a blend of experience, youth and the ability to come back against most opponents, Avon is ready for anything. After only winning six games last season, the Pirates quickly emerged as ..."
    ],
    "image_url": "",
    "titles": [
      "Avon softball blending youth, experience on the diamond"
    ],
    "summary": "The Avon High School softball team, with a current season record of 12-6, ranks sixth in the Class B standings. After a significant improvement from last season's six wins, the team is focused on making a deep run in the postseason. Avon's success is attributed to a mix of experienced and young players, along with their resilience in games.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The article provides useful information about the Avon High School softball team's performance, progress from the previous season, and factors contributing to their success. However, it does not offer insights into broader trends or systems in high school sports or provide actionable insights for readers.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.996,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.534,
    "normalized_score": 7.07
  },
  {
    "title": "Walmart's former U.S. CEO Bill Simon thinks retailer can easily absorb tariff costs, criticizes its 'doom and gloom' commentary",
    "domain": "business",
    "location": "national",
    "published": "Thu, 15 May 2025 23:53:25 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "snippets": [
      "Bill Simon, who ran Walmart from 2010 to 2014, suggests the company may be overstating challenges tied to tariffs."
    ],
    "image_url": "",
    "titles": [
      "Walmart's former U.S. CEO Bill Simon thinks retailer can easily absorb tariff costs, criticizes its 'doom and gloom' commentary"
    ],
    "summary": "Former Walmart CEO Bill Simon, who led the company from 2010 to 2014, has raised concerns that Walmart might be exaggerating the difficulties associated with tariffs. Simon suggests that the retail giant could be overstating these challenges, though specific details of the alleged exaggeration were not provided.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The article provides basic awareness about the former CEO's opinion on Walmart's handling of tariffs. However, it lacks depth and actionable insights, as it does not detail the specific exaggerations alleged or provide context about the impact of tariffs on retail businesses.",
    "score_components": {
      "magnitude": 0.429,
      "recency": 0.997,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.561,
    "normalized_score": 8.68
  },
  {
    "title": "Cerebras CEO says chipmaker's 'aspiration' is to hold IPO in 2025",
    "domain": "business",
    "location": "national",
    "published": "Thu, 15 May 2025 23:52:42 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "snippets": [
      "Cerebras CEO Andrew Feldman said his hope is that the AI chipmaker goes public in 2025 after a delay last year."
    ],
    "image_url": "",
    "titles": [
      "Cerebras CEO says chipmaker's 'aspiration' is to hold IPO in 2025"
    ],
    "summary": "Cerebras CEO Andrew Feldman announced plans for the AI chipmaker to potentially go public in 2025. This comes after a previous delay in their initial public offering (IPO) timeline last year.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The article informs readers about the company's plans for an IPO, which could be useful for potential investors. However, it does not provide a deeper understanding of the company's operations, the reasons behind the previous delay, or the potential impacts of the IPO.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.997,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.555,
    "normalized_score": 8.32
  },
  {
    "title": "Warren Buffett's Berkshire Hathaway Sheds Citi Stake, Trims Other Big Bank Holdings",
    "domain": "business",
    "location": "global",
    "published": "Thu, 15 May 2025 23:22:53 GMT",
    "source": "Investopedia",
    "sources": [
      "Investopedia"
    ],
    "snippets": [
      "<figure><img alt=\" Investopedia / Photo Illustration by Alice Morgan / Getty Images Berkshire Hathaway shares have taken a hit since Warren Buffett said earlier this month that he plans to step down as CEO at year-end, but they've still outperformed the broader market in 2025 so far\" src=\"https://www.investopedia.com/thmb/sLwvlKDiifD0q0CixemTXLT4LYg=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/WarrenBuffet1-13bb5491733149e8b1c61de425c56eaa.jpg\" title=\"illustration of warrren buffett and berkshire hathaway\" /><figcaption><i><p> Investopedia / Photo Illustration by Alice Morgan / Getty Images</p> Berkshire Hathaway shares have taken a hit since Warren Buffett said earlier this month that he plans to step down as CEO at year-end, but they've still outperformed the broader market in 2025 so far</i></figcaption></figure><p>Warren Buffett’s Berkshire Hathaway (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;BRK.A\">BRK.A</a>, <a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;BRK.B\">BRK.B</a>) sold its shares of Citigroup (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;C\">C</a>) during the first quarter, while trimming its stakes in Bank of America (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;BAC\">BAC</a>) and Capital One (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;COF\">COF</a>).</p><p>Berkshire shed its more than 14.6 million shares of Citigroup in the first three months of the year, a <a href=\"https://www.investopedia.com/terms/f/form-13f.asp\">13-F</a> filing revealed Thursday.<span class=\"ql-inline-citation\"></span> The form, which offers a snapshot of Berkshire's portfolio at the end of the quarter, does not capture any changes the company would have made since the end of March.</p><p>The conglomerate also trimmed its long-term holding in Bank of America by 48.6 million shares. It reduced its stake in Capital One by 300,000 shares, and shed all its shares in Brazilian fintech firm Nu Holdings (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;NU\">NU</a>).<span class=\"ql-inline-citation\"></span> Berkshire shrank its Liberty Media Series C Formula One (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;FWONK\">FWONK</a>) stake, and sold shares of Charter Communications (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;CHTR\">CHTR</a>), DaVita (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;DVA\">DVA</a>), and T-Mobile (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;TMUS\">TMUS</a>) too.<br /></p><p>Meanwhile, Buffett's firm more than doubled its position in alcoholic beverage maker Constellation Brands (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;STZ\">STZ</a>) to just over 12 million shares. Shares of the Modelo parent climbed close to 3% in after-hours trading.</p><p>Berkshire also added nearly 240,000 shares of Dominos Pizza (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;DPZ\">DPZ</a>) and over 112,000 shares of electronics firm Heico (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;HEI\">HEI</a>). It expanded positions in VeriSign (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;VRSN\">VRSN</a>), Sirius XM (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;SIRI\">SIRI</a>), Pool Corp. (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;POOL\">POOL</a>), and Occidental Petroleum (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;OXY\">OXY</a>) as well.</p><p>After trimming its stake in Apple (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;aapl\">AAPL</a>) last year, Berkshire did not make any changes to its position in the iPhone maker during the period.</p><p>Shares of Berkshire have taken a hit in the wake of Buffett's <a href=\"https://www.investopedia.com/warren-buffett-to-step-down-as-ceo-of-berkshire-hathaway-at-year-end-11727785\">announcement earlier this month</a> that he plans to step down as CEO, with vice chair Greg Abel set to take the helm at year-end. Still, they’ve outperformed the broader market, with shares up about 12% since the start of the year, while the S&amp;P 500 added just 0.6%.<br /></p>"
    ],
    "image_url": "https://www.investopedia.com/thmb/sLwvlKDiifD0q0CixemTXLT4LYg=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/WarrenBuffet1-13bb5491733149e8b1c61de425c56eaa.jpg",
    "titles": [
      "Warren Buffett's Berkshire Hathaway Sheds Citi Stake, Trims Other Big Bank Holdings"
    ],
    "summary": "Warren Buffett's Berkshire Hathaway sold its Citigroup shares and reduced holdings in Bank of America, Capital One, and several others in the first quarter, as revealed by a 13-F filing. Meanwhile, it increased investments in Constellation Brands, Dominos Pizza, Heico, and others. Despite Buffett announcing his plan to step down as CEO by year-end, Berkshire Hathaway's shares have risen about 12% since the start of the year, outperforming the S&P 500's 0.6% increase. Greg Abel is set to succeed Buffett.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The story is constructive as it provides useful insights into Berkshire Hathaway's investment strategy, which could inform readers' understanding of market trends and investment decisions. However, it doesn't report on solutions or improvements, nor does it increase awareness about systems or causes.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.99,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.573,
    "normalized_score": 9.4
  },
  {
    "title": "Musk's Grok AI chatbot says it 'appears that I was instructed' to talk about 'white genocide'",
    "domain": "business",
    "location": "national",
    "published": "Thu, 15 May 2025 23:21:45 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "snippets": [
      "By Thursday morning, Grok's answer had changed, and the chatbot said it \"wasn't programmed to give any answers promoting or endorsing harmful ideologies.\""
    ],
    "image_url": "",
    "titles": [
      "Musk's Grok AI chatbot says it 'appears that I was instructed' to talk about 'white genocide'"
    ],
    "summary": "On Thursday morning, Grok, a chatbot, altered its responses to clarify that it is not programmed to support or endorse harmful ideologies. This change addresses concerns about the content it was generating.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides some awareness about the potential misuse of AI technology, but it doesn't offer a deep understanding or actionable insights. There's no mention of solutions or improvements to prevent such issues in the future.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.99,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.561,
    "normalized_score": 8.68
  },
  {
    "title": "Tax dodging by rich could be ‘much greater than thought’, says UK audit office",
    "domain": "business",
    "location": "global",
    "published": "Thu, 15 May 2025 23:01:10 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times"
    ],
    "snippets": [
      "Watchdog issues warning after tax authority succeeds in raising more tax from wealthy than previously estimated"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F889ab68a-7135-433c-8526-dd9fe1e29cb9.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Tax dodging by rich could be ‘much greater than thought’, says UK audit office"
    ],
    "summary": "A watchdog has issued a warning following the tax authority's success in collecting more taxes from the wealthy than initially estimated. This development indicates a significant increase in tax revenue from high-income individuals, prompting the watchdog to caution about the potential implications of this outcome.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "The story is highly constructive as it increases awareness about the issue of tax evasion among the wealthy, potentially influencing public opinion and policy discussions. It also reports on the progress made by the tax authority in collecting more taxes from high-income individuals, suggesting a solution to the problem.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.985,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.581,
    "normalized_score": 9.88
  },
  {
    "title": "Caltech’s Smart Bandage Detects Infection Days in Advance",
    "domain": "science",
    "location": "global",
    "published": "Thu, 15 May 2025 22:04:11 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/caltechs-smart-bandage-detects-infection-days-in-advance/\" rel=\"nofollow\" title=\"Caltech’s Smart Bandage Detects Infection Days in Advance\"><img alt=\"The Smart Bandage Technology Is Flexible and Stretches With the Skin\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"466\" src=\"https://scitechdaily.com/images/The-Smart-Bandage-Technology-Is-Flexible-and-Stretches-With-the-Skin-777x466.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>Caltech’s iCares bandage samples fluid and tracks wound biomarkers to detect infection early and predict healing outcomes. Caltech professor of medical engineering Wei Gao and his team are developing a next-generation smart bandage—a “lab on skin”—that could help patients and caregivers monitor chronic wounds, deliver treatment, and accelerate healing. Designed for cuts, incisions, scrapes, and [...]"
    ],
    "image_url": "",
    "titles": [
      "Caltech’s Smart Bandage Detects Infection Days in Advance"
    ],
    "summary": "Caltech has developed a smart bandage, named iCares, which can detect infections in wounds days before they become apparent. Created by Professor Wei Gao and his team, this innovative \"lab on skin\" technology samples fluid and tracks biomarkers to predict healing outcomes. It aims to improve care for chronic wounds by enabling early detection and treatment, potentially speeding up the healing process.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive. It provides useful information about a new technology that has the potential to improve wound care. It also highlights progress in the field of medical technology, reporting on an innovative solution to a common problem.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.972,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.577,
    "normalized_score": 9.64
  },
  {
    "title": "Scientists Discover Temperature-Controlled Switch That Powers Fertility",
    "domain": "science",
    "location": "global",
    "published": "Thu, 15 May 2025 21:39:50 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/scientists-discover-temperature-controlled-switch-that-powers-fertility/\" rel=\"nofollow\" title=\"Scientists Discover Temperature-Controlled Switch That Powers Fertility\"><img alt=\"Sperm Cell Science Illustration\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Sperm-Cell-Science-Illustration-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>A mouse study may pave the way for new approaches to contraception and infertility treatment. Sperm are surprisingly picky when it comes to temperature. In mammals, including humans, they perform best in environments that are a few degrees cooler than normal body temperature. This raises an intriguing question: how do these heat-sensitive cells manage to [...]"
    ],
    "image_url": "",
    "titles": [
      "Scientists Discover Temperature-Controlled Switch That Powers Fertility"
    ],
    "summary": "Scientists have discovered a temperature-controlled switch in sperm that could lead to new contraception and infertility treatments. This finding, based on a mouse study, highlights how sperm performance is optimal in environments slightly cooler than the normal body temperature of mammals, including humans. This research may significantly impact future reproductive health strategies.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it provides useful insights into the field of reproductive health. It reports on a new discovery that could lead to new treatments for contraception and infertility. However, it doesn't provide actionable insights for the reader.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.966,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.565,
    "normalized_score": 8.92
  },
  {
    "title": "This Popular Anti-Aging Supplement Might Be a Waste of Money",
    "domain": "science",
    "location": "global",
    "published": "Thu, 15 May 2025 21:14:07 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/this-popular-anti-aging-supplement-might-be-a-waste-of-money/\" rel=\"nofollow\" title=\"This Popular Anti-Aging Supplement Might Be a Waste of Money\"><img alt=\"Woman Holding Green Capsule Supplement\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Woman-Holding-Green-Capsule-Supplement-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>Despite an 85% reduction in NAD+ levels, mice maintained normal muscle health and function, according to new research from the Treebak Group. Since natural aging typically causes only up to a 30% decline in NAD levels, these findings cast doubt on the purported health benefits promoted by NAD+ supplement companies. In the Netflix documentary Don’t [...]"
    ],
    "image_url": "",
    "titles": [
      "This Popular Anti-Aging Supplement Might Be a Waste of Money"
    ],
    "summary": "New research from the Treebak Group shows that even with an 85% reduction in NAD+ levels, mice still maintained normal muscle health and function. This finding challenges the effectiveness of NAD+ supplements, which are marketed for anti-aging benefits, especially since natural aging usually results in up to a 30% decline in NAD levels. This casts doubt on the claims made by NAD+ supplement companies regarding their health benefits.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it provides useful information challenging the effectiveness of a popular supplement. It increases awareness about the potential misinformation in the supplement industry and could influence readers' decision-making regarding their health and wellness purchases.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.96,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.564,
    "normalized_score": 8.86
  },
  {
    "title": "Are entangled qubits following a quantum Moore's law?",
    "domain": "science",
    "location": "global",
    "published": "Thu, 15 May 2025 20:43:48 +0100",
    "source": "New Scientist",
    "sources": [
      "New Scientist"
    ],
    "snippets": [
      "Several recent experiments showcase a sharp increase in the number of quantum bits that can be entangled, echoing Moore’s law for increasing computing power on traditional chips"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/05/15193703/SEI_251379472.jpg",
    "titles": [
      "Are entangled qubits following a quantum Moore's law?"
    ],
    "summary": "Recent experiments have significantly increased the number of entangled quantum bits (qubits), mirroring the growth pattern of Moore's law, which describes the doubling of computing power on traditional chips approximately every two years. This advancement in quantum computing demonstrates a notable leap in the potential for more powerful and efficient computing capabilities.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it provides an understanding of recent advancements in quantum computing, which could be useful for readers interested in technology and its progress. It also gives insight into the potential future of computing, thus empowering the reader with knowledge.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.939,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.567,
    "normalized_score": 9.04
  },
  {
    "title": "Baby with rare disease given world-first personal CRISPR gene therapy",
    "domain": "science",
    "location": "global",
    "published": "Thu, 15 May 2025 19:00:28 +0100",
    "source": "New Scientist",
    "sources": [
      "New Scientist"
    ],
    "snippets": [
      "An infant with a severe genetic condition has shown signs of improvement after receiving a gene-editing treatment tailored to his specific mutation"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/05/15143847/SEI_251387277.jpg",
    "titles": [
      "Baby with rare disease given world-first personal CRISPR gene therapy"
    ],
    "summary": "An infant diagnosed with a severe genetic condition has exhibited signs of improvement following a personalized gene-editing treatment aimed at correcting his specific mutation. This marks a significant step in the application of gene-editing technology for treating genetic disorders.",
    "constructiveness_score": 1.0,
    "constructiveness_reason": "This story is highly constructive. It not only informs readers about a significant medical innovation, but also provides a clear example of how this technology can be used to solve real-world problems. It increases awareness about the potential of gene-editing technology in treating genetic disorders, thus offering both depth and insight.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.915,
      "consensus": 0.2,
      "constructiveness": 1.0
    },
    "score": 0.57,
    "normalized_score": 9.22
  }
]