[
  {
    "title": "Illinois Sues Trump Administration Over National Guard Deployment",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Mon, 06 Oct 2025 12:49:28 -0400",
    "source": "NPR",
    "sources": [
      "Deutsche Welle",
      "Al Jazeera",
      "Global News",
      "NPR",
      "Axios",
      "Forbes"
    ],
    "domains": [
      "www.aljazeera.com",
      "news.google.com",
      "www.npr.org",
      "globalnews.ca",
      "www.dw.com",
      "www.forbes.com"
    ],
    "snippets": [
      "The parties are asking a judge to block the Trump administration from federalizing the Illinois National Guard and from sending to Illinois any guard members from other states, including Texas.",
      "US state accuses Trump of &#039;unlawful and unconstitutional&#039; use of National Guard in latest effort to stop deployment.",
      "The Democratic-led state said the Trump administration's planned troop deployment is unconstitutional. A lawsuit said Americans should not \"live under the threat of military occupation\" for opposing the president.",
      "<a href=\"https://news.google.com/rss/articles/CBMiiAFBVV95cUxPUVhfLTJLLVpld2FXbFlueVlESHZzUGpmNkt4SXlCaHJ4cFFXZTVpWE54d3FwdVBEaG50eFB1TTZEamh5MFozUS15VFBWa2xoR0d3NG54TzZnS3VvYVFTck9xRVVJMmNVTi05Rl9kOUpRQ1NXU1BoTWF2THZ1VVRvNElfc0VkcFM3?oc=5\" target=\"_blank\">Illinois sues Trump over National Guard dep",
      "<a href=\"https://news.google.com/rss/articles/CBMikAFBVV95cUxQSU83ZkFnMmR4eDlDN2l1Rk1DbVNjclFRaHM4VWZWcG1UWUJkbERQTE13MDBHTWVNRFRDcE1tWTc3NGx2TFJJTHRHN2pGQXROZ3FzR2I5Ny13eGpHSkZwVnBnOTA0YXU2bl9NUDdCbGtYZzRoS1Rvb05MMGVWYVJqQjRRNTJ1aUpIZG9WRFRaN3o?oc=5\" target=\"_blank\">Judge temporarily blocks Trump f",
      "'He is using our military as political pawns to build up his own ego,' said California Gov. Gavin Newsom, who also vowed to sue.",
      "The administration is trying to send hundreds of members of the Texas National Guard to Chicago."
    ],
    "image_url": "",
    "titles": [
      "Illinois and Chicago sue the Trump administration over National Guard deployment",
      "Illinois lawsuit seeks to block Trump sending National Guard to Chicago",
      "US: Illinois sues Trump over Chicago troop deployment",
      "Illinois sues Trump over National Guard deployment to Chicago - Axios",
      "Judge temporarily blocks Trump from any sending National Guard troops to Oregon - Axios",
      "Illinois, Chicago sue Trump admin over National Guard deployment",
      "Illinois Sues Trump—Just Like Oregon And California—Challenging National Guard Orders"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.932,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.861,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Illinois has filed a lawsuit against the Trump administration, challenging the decision to deploy National Guard troops to the state, labeling it \"unlawful and unconstitutional.\" The suit argues against the federalization of the Illinois National Guard and the deployment of out-of-state guard members, including those from Texas, claiming it threatens citizens with \"military occupation.\" A judge has temporarily blocked the Trump administration's move. California's Governor, Gavin Newsom, criticized the use of the military as political tools and announced intentions to sue as well.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Connor McDavid Signs $25M Extension with Oilers, Avoids Free Agency",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 6 Oct 2025 15:28:57 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Yahoo Sports",
      "NHL",
      "Sportsnet",
      "CBS Sports"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.sportico.com",
      "news.google.com",
      "www.espn.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Star center Connor McDavid will remain with the Edmonton Oilers, signing a two-year contract extension with an average annual value of $12.5 million.",
      "The NHL's biggest star will be staying in Edmonton",
      "Connor McDavid isn’t going anywhere. The Edmonton Oilers star, who was set to be an unrestricted free agent next year, has inked a two-year contract extension that carries an average annual value of $12.5 million. McDavid’s extension comes on the eve of the NHL regular season; the captain was set to",
      "<a href=\"https://news.google.com/rss/articles/CBMie0FVX3lxTE9ZX3dkUHpMYTQ1dXpZY2dyU29jVFFVdk1NT2Y1VWVaanBtdDRETF9IN1QyNm8xWHRzN1Y3N05FenJZcHNrd2xBZWJIWU5uY0N4YkszTzhQNU9IVTBkaXcyaElCY2FYZFJEMWRuTURuY2xOdFVWUHVNZkJrYw?oc=5\" target=\"_blank\">McDavid signs 2-year, $25 million contract with Oilers</a>&nb",
      "<p>Edmonton Oilers GM Stan Bowman discusses how the Connor McDavid extension came together, detailing how negotiating with a superstar of his stature is a unique process, and why the future for the team was an important factor in the captain&#8217;s decision.</p>"
    ],
    "image_url": "",
    "titles": [
      "McDavid signs 2-year, $25M extension with Oilers",
      "Connor McDavid, Oilers agree to contract extension: Edmonton signs three-time league MVP to two-year deal",
      "Connor McDavid Signs Team-Friendly Extension With Oilers",
      "McDavid signs 2-year, $25 million contract with Oilers - NHL.com",
      "Oilers’ Bowman explains how McDavid extension talks came together"
    ],
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.985,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.851,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Connor McDavid, the Edmonton Oilers' star center, has signed a two-year contract extension, avoiding free agency next year. The deal is worth $25 million, with an average annual value of $12.5 million. This contract ensures McDavid, the NHL's leading star, remains with the Oilers, as confirmed by the team's GM, Stan Bowman. The extension was finalized just before the start of the NHL regular season.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Ghislaine Maxwell's Supreme Court Appeal Declined, Transferred to Texas Camp",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 06 Oct 2025 19:11:11 GMT",
    "source": "BBC",
    "sources": [
      "Al Jazeera",
      "CNBC",
      "ABC News",
      "BBC",
      "Axios"
    ],
    "domains": [
      "www.aljazeera.com",
      "abcnews.go.com",
      "news.google.com",
      "www.bbc.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "The British socialite is serving a 20-year prison sentence on sex-trafficking charges related to former boyfriend Jeffrey Epstein.",
      "Former girlfriend of convicted sex abuser Jeffrey Epstein is serving a 20-year prison sentence for sex trafficking.",
      "<a href=\"https://news.google.com/rss/articles/CBMifEFVX3lxTE10cURkM1huYWlic0RVWWJVQ0F1ZUprbUYzdkE3Y0VhTUZSR04yV2s4Y0hoWHlvMU9aWkRabVdpTzNxc1h0N05SUGphQUxEUEh2azBRRUFhb2xrYmY5SHBUYkFoUzYxTmthQjhyTV9nejE5OUNBZ0JsZzhNSUQ?oc=5\" target=\"_blank\">Supreme Court rejects Epstein associate Ghislaine Maxwell's ",
      "The Supreme Court has declined to take up the appeal of Maxwell, who was contesting her prosecution and conviction on grounds that the government had violated an agreement made with Jeffrey Epstein before his death.",
      "Ghislaine Maxwell, the convicted procurer of Jeffrey Epstein, may now focus efforts to get a pardon or sentence commutation from President Donald Trump."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/fd26/live/1f0875e0-a2d4-11f0-92db-77261a15b9d2.jpg",
    "titles": [
      "US Supreme Court rejects Ghislaine Maxwell appeal in Epstein case",
      "US Supreme Court declines to hear Ghislaine Maxwell appeal",
      "Supreme Court rejects Epstein associate Ghislaine Maxwell's appeal - Axios",
      "WATCH:  Supreme Court denies Ghislaine Maxwell appeal",
      "Supreme Court rejects appeal of Ghislaine Maxwell for Epstein abetting conviction"
    ],
    "score_components": {
      "magnitude": 0.964,
      "recency": 0.959,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.828,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Ghislaine Maxwell, associated with Jeffrey Epstein, is serving a 20-year sentence for sex trafficking and related crimes as of 2022. Her appeal to the US Supreme Court was declined. Maxwell attempted to argue her indictment was invalid due to Epstein's 2007 non-prosecution agreement. Recently, she was transferred from a low-security prison in Florida to a minimum-security camp in Texas.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "ICC Convicts Janjaweed Leader of War Crimes in Darfur",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Mon, 06 Oct 2025 15:05:55 -0400",
    "source": "NPR",
    "sources": [
      "The Guardian",
      "NPR",
      "Deutsche Welle",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.dw.com",
      "www.theguardian.com",
      "www.npr.org"
    ],
    "snippets": [
      "The International Criminal Court in The Hague handed down its first-ever Darfur war crimes conviction, finding Janjaweed leader Ali Kushayb, guilty of atrocities committed more than two decades ago.",
      "The International Criminal Court has found Sudanese militia chief Ali Muhammad Ali Abd-Al-Rahman guilty of war crimes.",
      "The 27 guilty verdicts are the first handed down by The Hague-based court over war crimes in Sudanese region in 2000s.",
      "For the first time, the ICC has found a militia leader guilty of war crimes committed in Sudan's Darfur region more than 20 years ago.",
      "<p>Janjaweed commander Ali Muhammad Ali Abd-al-Rahman, known as Ali Kushayb, found guilty over atrocities</p><p>The international criminal court has convicted a leader of the Janjaweed militia of playing a leading role in a campaign of atrocities committed in the Sudanese region of Darfur more than "
    ],
    "image_url": "",
    "titles": [
      "ICC finds former Sudan militia leader guilty of war crimes in Darfur",
      "ICC convicts first militia leader for brutal attacks in Darfur",
      "ICC convicts ex-Janjaweed leader Ali Kushayb of war crimes in Darfur",
      "Darfur militia leader convicted by ICC for war crimes",
      "ICC convicts former Sudan militia leader for war crimes in Darfur"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.977,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.81,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The International Criminal Court (ICC) has convicted Janjaweed militia leader Ali Muhammad Ali Abd-Al-Rahman, known as Ali Kushayb, of war crimes in Sudan's Darfur region, marking the court's first conviction for crimes in this area. Abd-Al-Rahman was found guilty on 27 counts of war crimes committed over 20 years ago.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Pro-Israel, Anti-'Woke' Commentator to Lead US News Network",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Mon, 06 Oct 2025 15:44:21 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "Forbes",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.forbes.com",
      "www.npr.org"
    ],
    "snippets": [
      "Provocative columnist Bari Weiss publicly quit the <em>New York Times</em> in 2020, then cofounded The Free Press as an alternative to legacy media. Here's what to know as she takes the helm of CBS News.",
      "Appointment of media figure known for pro-Israel, anti-&#039;woke&#039; stances comes as US media firms feel Trump pressure.",
      "Bari Weiss, founder of The Free Press, is joining CBS News as its first editor-in-chief following her site’s acquisition by Paramount Skydance."
    ],
    "image_url": "",
    "titles": [
      "Who is Bari Weiss? CBS News' new editor-in-chief is a vocal critic of legacy media",
      "Conservative writer Bari Weiss named editor-in-chief of CBS News",
      "Who Is Bari Weiss? What To Know About The New CBS News Editor-In-Chief"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.99,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.767,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A commentator known for pro-Israel and anti-'woke' views has been appointed to lead a prominent US news network, marking their return five years after leaving the New York Times under tense circumstances. This move comes as US media companies, including CBS News' owner Paramount, which is acquiring the Free Press, a media startup, face pressure in the current political climate influenced by Trump.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Connor McDavid Signs Extension with Oilers Through 2027-28",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 6 Oct 2025 15:44:48 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Yahoo Sports",
      "Sportsnet"
    ],
    "domains": [
      "ftw.usatoday.com",
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "No. 97 is sticking with the Oilers through 2027-28 -- with a wide range of downstream impacts around the NHL.",
      "Connor McDavid is sticking around in Edmonton for a few more years, but the length of the new contract is a pretty telling sign.",
      "<p>Mark Spector joins The FAN Hockey Show to discuss Connor McDavid&#8217;s contract extension with the Oilers, discussing what may have been behind the decision to hold out through the summer, and how the team should be positioned for success around him.</p>"
    ],
    "image_url": "",
    "titles": [
      "Winners and losers of Connor McDavid's contract extension",
      "Connor McDavid’s new contract sends clear message to Oilers",
      "What factored into McDavid’s decision to wait on an extension?"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.99,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.76,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Connor McDavid has extended his contract with the Edmonton Oilers through the 2027-28 season. The decision, discussed by Mark Spector on The FAN Hockey Show, reflects strategic planning for the Oilers' future success around McDavid. This extension is expected to have significant implications for the NHL.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Raises Tariff on Brazil to 40%; Discusses Cooperation with Lula",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Mon, 06 Oct 2025 17:41:00 +0000",
    "source": "Al Jazeera",
    "sources": [
      "The Guardian",
      "Deutsche Welle",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.dw.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Trump had imposed a 40% tariff on Brazil in July on top of a 10% earlier even though US has a trade surplus with Brazil.",
      "Brazil's leader held a \"positive\" call with US President Donald Trump, and discussed punitive measures imposed by the US president who has claimed a criminal case against Brazil's ex-president Jair Bolsonaro was biased.",
      "<p>Presidents spoke on a video call as expert speculates that Haiti could be an area where the two leaders can cooperate</p><p>Brazil’s president, Luiz Inácio Lula da Silva, has urged Donald Trump to scrap tariffs on his country’s imports and sanctions against its officials, as the two men held what"
    ],
    "image_url": "",
    "titles": [
      "Lula asks Trump to lift 40 percent tariff from Brazilian goods",
      "Brazil's Lula asks Trump to lift tariffs in video call",
      "Brazil’s president asks US to scrap tariffs in ‘friendly’ call with Trump"
    ],
    "score_components": {
      "magnitude": 0.887,
      "recency": 0.949,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.748,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In July, President Trump imposed a 40% tariff on Brazil, adding to a previous 10% tariff despite the US having a trade surplus with Brazil. Following a \"positive\" video call between Brazil's President Luiz Inácio Lula da Silva and Trump, discussions were held on the punitive measures, including tariffs and sanctions against Brazilian officials. The call also touched on cooperation opportunities, such as in Haiti. Lula urged Trump to reconsider the tariffs and sanctions.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "France's PM Lecornu Resigns After Less Than 24 Hours Amid Political Crisis",
    "domain": "business",
    "source_domain": "www.ft.com",
    "location": "global",
    "published": "Mon, 06 Oct 2025 19:57:14 GMT",
    "source": "Financial Times",
    "sources": [
      "New York Times",
      "Washington Post",
      "Financial Times"
    ],
    "domains": [
      "www.ft.com",
      "www.washingtonpost.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "Sébastien Lecornu, who quit on Monday, is asked by Emmanuel Macron to quickly negotiate a stability plan",
      "Sébastien Lecornu, a former defense minister, was in the job less than a month. He was appointed after a no-confidence vote toppled his predecessor.",
      "Sébastien Lecornu’s departure ratcheted up pressure on President Emmanuel Macron to call snap parliamentary elections."
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Fa8203189-4539-47a3-b3ee-407e11ff91b2.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "France in fresh political and market turmoil after prime minister resigns",
      "Prime minister of France resigns hours after naming new government",
      "French Prime Minister Sébastien Lecornu Resigns"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.974,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.742,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Sébastien Lecornu, France's newly appointed Prime Minister, resigned less than 24 hours after forming his government and less than a month in office, citing deep political divisions and criticism from various factions, including threats from rightwing allies to withdraw support. His resignation, accepted by President Emmanuel Macron, follows criticism over the largely unchanged cabinet lineup and plunges the country into a political crisis. Lecornu, a former defense minister, had assumed the role after a no-confidence vote ousted his predecessor.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Ja Morant Sidelined Indefinitely with Left Ankle Sprain",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Mon, 06 Oct 2025 16:21:23 +0000",
    "source": "CBS Sports",
    "sources": [
      "Sports Illustrated",
      "Sportsnet",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "www.sportsnet.ca",
      "news.google.com"
    ],
    "snippets": [
      "Morant's status for the start of the regular season is in jeopardy after spraining his ankle at practice",
      "<a href=\"https://news.google.com/rss/articles/CBMib0FVX3lxTE1IeVZmRGpvX0NYOGhBMm43NU1UeVhJcjdqTE5jQU5iSEM5bi1nU3BBWF9GRWNHOTRndVpPMGtLTkRiNnlkM29PaWw3VHFoXzEtaTN2UnF0YVd0c045cHhuSlZ4Uk1SV2llaC1aMnhOaw?oc=5\" target=\"_blank\">Ja Morant Suffers Ankle Injury in Practice as Grizzlies’ Injury Woes Continue",
      "<p>The Memphis Grizzlies all-star guard is out week-to-week after spraining his left ankle in practice, a team spokesperson said, per DaMichael Cole of Memphis News.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/10/06/99f95abb-2403-4b9c-bcf0-cecfe5a57bf5/morant.jpg",
    "titles": [
      "Ja Morant injury: Grizzlies star point guard sprains ankle in practice, considered week-to-week",
      "Ja Morant Suffers Ankle Injury in Practice as Grizzlies’ Injury Woes Continue - Sports Illustrated",
      "Grizzlies’ Ja Morant sprains ankle, out week-to-week"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.923,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.738,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Ja Morant, the Memphis Grizzlies all-star guard, is out on a week-to-week basis following a left ankle sprain sustained during practice. This injury puts his availability for the start of the regular season in doubt.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: sustain",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Netanyahu Optimistic on Hostage Release by Oct. 13 Amid Gaza Ceasefire Talks",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 06 Oct 2025 17:27:02 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian",
      "New York Times"
    ],
    "domains": [
      "www.bbc.com",
      "www.bbc.co.uk",
      "www.theguardian.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "The talks are expected to be among the most consequential since the start of the war two years ago.",
      "Negotiators from Israel and Hamas are heading to Sharm El-Sheikh, Egypt, to start indirect talks about ending the Israel-Gaza war.",
      "Trump urges mediators to “move fast” as key Gaza talks begin.",
      "Though significant issues remain to be hashed out between Israel and Hamas, some are saying that after two years of death and destruction, a breakthrough may be near.",
      "Israel and Hamas said they will work with President Trump’s proposal to end the Gaza war. But persistent sticking points could derail a diplomatic breakthrough.",
      "<p>Hamas’s acceptance of key conditions of deal galvanises momentum but large gaps remain between camps</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/oct/06/gaza-ceasefire-peace-talks-hamas-israel-trump-egypt-middle-east-crisis-live-news-updates\">Gaza ceasefire talks – live upda"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/3501/live/d3778430-a2de-11f0-a01f-432b14e9b57f.jpg",
    "titles": [
      "Israel and Hamas begin indirect talks in Egypt on Trump's Gaza peace plan",
      "What are the key sticking points in Trump's Gaza peace plan?",
      "Will Trump’s Gaza Peace Plan Work?",
      "Israel and Hamas Meet in Egypt to Discuss Gaza Peace Plan",
      "Trump’s Gaza Peace Plan: What to Know",
      "Israel and Hamas begin indirect talks as hopes rise of ending Gaza war"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.925,
      "consensus": 0.809,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.737,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Israeli Prime Minister Netanyahu expressed hope for the release of all hostages by Hamas by Oct. 13, following partial agreement to President Trump's 20-point Gaza ceasefire plan. While Hamas has agreed to release hostages and discuss governing Gaza with Palestinian technocrats, negotiations on several aspects of the plan remain. Both Israel and Hamas have shown willingness to work towards ending the conflict, but unresolved issues could impede a diplomatic breakthrough. The US President has cautioned Hamas about the limited time available to finalize the deal.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Announces Truck Levies Before Trade Talks with Canadian PM",
    "domain": "business",
    "source_domain": "www.ft.com",
    "location": "global",
    "published": "Mon, 06 Oct 2025 19:11:11 GMT",
    "source": "Financial Times",
    "sources": [
      "Global News",
      "Financial Post",
      "Financial Times"
    ],
    "domains": [
      "globalnews.ca",
      "www.ft.com",
      "financialpost.com"
    ],
    "snippets": [
      "Announcement comes on eve of talks in Washington with Canadian Prime Minister Mark Carney",
      "The announcement comes a day before Trump is set to host Prime Minister Mark Carney in the White House, with trade dominating the agenda between the two leaders.",
      "Trump originally said last month that heavy-duty truck levies would start Oct. 1"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F2246ca49-2bc4-46e6-b079-34b71130625a.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Trump says US truck imports to face 25% tariff from November 1",
      "Trump says new 25% tariff on heavy trucks coming in weeks",
      "Trump: U.S. tariffs on heavy truck imports to begin Nov. 1"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.959,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.736,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "On the eve of discussions in Washington, President Trump announced heavy-duty truck levies, initially set to start Oct. 1, ahead of hosting Canadian Prime Minister Mark Carney at the White House. The talks are expected to focus on trade issues between the two countries.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Rescue Efforts Underway for Hikers Trapped on Everest's North Slope",
    "domain": "general",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Mon, 06 Oct 2025 12:38:23 -0400",
    "source": "ABC News",
    "sources": [
      "ABC News",
      "Washington Post",
      "New York Times"
    ],
    "domains": [
      "abcnews.go.com",
      "www.washingtonpost.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "An effort is underway to rescue hundreds of hikers who became trapped on Mount Everest due to an unexpected blizzard.",
      "Some 350 hikers were rescued and 200 remain stranded, Chinese state media reported Monday, as rescue efforts continued in China’s Tibet Autonomous Region.",
      "The snowfall buried tents and reduced visibility. The local authorities said that they were in contact with the hikers and that rescue efforts were underway."
    ],
    "image_url": "https://s.abcnews.com/images/International/251006_abc_social_everest_hpMain_4x3_384.jpg",
    "titles": [
      "WATCH:  Hundreds of hikers trapped by blizzard on Mount Everest",
      "Snowstorm traps hundreds on Mount Everest",
      "Snowstorm Traps Hundreds of Everest Hikers"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.928,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.732,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Rescue workers in Tibet are assisting hundreds of hikers trapped by a snowstorm on Mount Everest's northern slope. Chinese state media reported that tents at tourist campsites were damaged, and there are casualties. The heavy snowfall has buried tents and blocked rescue roads, but local authorities are in contact with the hikers and rescue efforts are ongoing.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Social Security Chief Named IRS CEO in Major Leadership Shift",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Mon, 06 Oct 2025 17:00:47 GMT",
    "source": "Axios",
    "sources": [
      "MarketWatch",
      "Axios",
      "Fortune"
    ],
    "domains": [
      "fortune.com",
      "www.marketwatch.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMibEFVX3lxTE1xMHpJeXhtOHM1YXpzNjVRSk9ibVZTT25WMTc5MkJxNjJEXzZVSTFLSjNFRXVlY3JZbS1Eb3RrWkh5c183cTVkNC1LWkNkdzhTTG5oQXlnZTN2S0NZZU1sLWRRMkUyamlQS2JrUA?oc=5\" target=\"_blank\">Social Security chief to be IRS CEO</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Axios</f",
      "Bisignano will report to Treasury Secretary Scott Bessent, who currently serves as acting commissioner of the IRS.",
      "The appointment, which would not require Senate confirmation, puts Frank Bisignano at the helm of two embattled, data-heavy agencies."
    ],
    "image_url": "",
    "titles": [
      "Social Security chief to be IRS CEO - Axios",
      "An ‘IRS CEO’ now exists, and Social Security Administrator Frank Bisignano is the first to fill the position",
      "Social Security chief tapped to oversee another struggling agency: The IRS"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.916,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.72,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Social Security chief has been appointed as the IRS CEO, a position that does not require Senate confirmation. This move marks a significant leadership change within two major U.S. government agencies.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "2025 Nobel Prize in Medicine Awarded for Autoimmunity Research",
    "domain": "science",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 06 Oct 2025 10:28:37 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "New Scientist",
      "Deutsche Welle"
    ],
    "domains": [
      "www.bbc.com",
      "www.dw.com",
      "www.newscientist.com"
    ],
    "snippets": [
      "The prize-winning discovery explains how the immune system attacks hostile infections, but not the body's own cells.",
      "Mary E. Brunkow, Fred Ramsdell, and Shimon Sakaguchi will be awarded the Nobel Prize in physiology or medicine for their instrumental work in improving our understanding of how the immune system functions.",
      "The 2025 Nobel prize in physiology or medicine has gone to Mary Brunkow, Fred Ramsdell and Shimon Sakaguchi for their discoveries around how we keep our immune system under control"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/7d22/live/4ce477f0-a29a-11f0-b5fb-09dc1426da0e.jpg",
    "titles": [
      "Scientists win Nobel Prize for discovering why immune system does not destroy the body",
      "Trio wins Nobel Prize in medicine for immune system research",
      "Nobel prize for medicine goes to trio for work on immune tolerance"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.8,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.707,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Mary E. Brunkow, Fred Ramsdell, and Shimon Sakaguchi were awarded the 2025 Nobel Prize in Physiology or Medicine for their groundbreaking research on how the immune system is regulated to prevent it from attacking the body's own tissues. Their work, which involves the identification of mechanisms that help maintain immune system balance, has been pivotal in advancing our understanding of autoimmunity. This US-Japanese team's discoveries have significantly contributed to the field of immunology.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: research",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Optimistic on Israel-Hamas Talks Amid Gaza Violence",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-10-06T07:20:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "The Guardian",
      "Deutsche Welle",
      "Washington Post"
    ],
    "domains": [
      "www.dw.com",
      "www.theguardian.com",
      "www.washingtonpost.com"
    ],
    "snippets": [
      "Delegations from Israel and Hamas are holding indirect talks on US President Donald Trump's plan for Gaza. Germany's foreign minister is heading to Egypt for talks on the negotiations. DW has the latest.",
      "<p>Talks on Monday expected to focus on release of hostages and end to war, after Israel kills 63 people in Gaza in past day</p><p>Donald Trump has urged negotiators to “move fast” in talks focused on the release of hostages held by Hamas in Gaza and a broader end to the war, as representatives arri",
      "Israel and Hamas gathered in Egypt for indirect talks over a U.S.-backed plan to end the Gaza war after months of deadlock."
    ],
    "image_url": "",
    "titles": [
      "Middle East updates: Gaza ceasefire talks start in Egypt",
      "Trump urges negotiators to ‘move fast’ as Gaza ceasefire talks set to begin in Egypt",
      "Gaza ceasefire talks begin in Egypt, as Israel strikes enclave"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.765,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.704,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "US President Donald Trump expressed optimism about the speed of negotiations between Israel and Hamas, focusing on the release of hostages and ending the conflict. This comes as talks are set to begin, following a deadly day in Gaza where 63 people were killed by Israeli forces. Trump has urged for quick action in these discussions.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "RJ Barrett's Early Rise Shows Excitement for NBA Game",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Mon, 06 Oct 2025 19:25:48 +0000",
    "source": "Global News",
    "sources": [
      "Sportsnet",
      "Global News"
    ],
    "domains": [
      "globalnews.ca",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "RJ Barrett woke up early on Monday morning.",
      "<p>RJ Barrett woke up early on Monday morning.  The prospect of once again playing a competitive NBA game spurred too much excitement for the Raptors star to sleep in.</p>"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/10/0ef027bad0c9a39bd7fb3db07716587c1a4eb337f6d67977872f07113ac2a528.jpg?quality=65&strip=all",
    "titles": [
      "Raptors Barrett buzzing for pre-season basketball",
      "Raptors star RJ Barrett buzzing for pre-season basketball"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.984,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.702,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "RJ Barrett, a star player for the Raptors, woke up early on Monday due to his excitement about playing in an upcoming competitive NBA game. This reflects his enthusiasm and dedication to basketball.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Patriots' Antonio Gibson Suffers Torn ACL Against Bills",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 6 Oct 2025 15:28:57 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "Patriots running back Antonio Gibson suffered a torn ACL in Sunday's game against the Bills, sources told ESPN's Adam Schefter on Monday.",
      "Gibson suffered a torn left ACL in New England's win in Buffalo on Sunday night"
    ],
    "image_url": "",
    "titles": [
      "Sources: Patriots lose RB Gibson to torn ACL",
      "Antonio Gibson injury: Patriots RB, special teams player to miss rest of season with torn ACL, per report"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.985,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.694,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Antonio Gibson, Patriots running back, sustained a torn left ACL during Sunday's game against the Bills, as reported by ESPN's Adam Schefter. This injury occurred in New England's victory in Buffalo.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: sustain",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Phillies' Bader Misses NLDS Game 2 Due to Groin Injury",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 6 Oct 2025 15:50:49 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "Phillies center fielder Harrison Bader was not in the starting lineup for Game 2 of the NL Division Series because of a groin injury.",
      "<p>Philadelphia Phillies centre fielder Harrison Bader was not in the starting lineup for Game 2 of the NL Division Series because of a groin injury.</p>"
    ],
    "image_url": "",
    "titles": [
      "Bader not in Phils' G2 lineup due to groin injury",
      "Phillies’ Harrison Bader out of Game 2 starting lineup due to groin injury"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.993,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.679,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Philadelphia Phillies center fielder Harrison Bader missed Game 2 of the NL Division Series due to a groin injury. His absence from the starting lineup was notable, impacting the team's lineup strategy for the game.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Mark Sanchez Charged With Felony Battery After Altercation in Indianapolis",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 6 Oct 2025 15:28:57 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "Mark Sanchez is facing a felony battery charge over the altercation between the former NFL quarterback and a 69-year-old truck driver early Saturday in Indianapolis.",
      "<p>Former NFL quarterback Mark Sanchez is now facing a felony charge of battery involving serious bodily injury in addition to the misdemeanor charges stemming from a weekend incident in Indianapolis that led to his arrest.</p>"
    ],
    "image_url": "",
    "titles": [
      "Sanchez now facing felony charge for altercation",
      "Former NFL QB Mark Sanchez facing felony charge in Indianapolis altercation"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.985,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.677,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Former NFL quarterback and Fox Sports commentator Mark Sanchez has been charged with felony battery following an altercation with a 69-year-old truck driver in Indianapolis early Saturday.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UEFA Approves Barcelona-Villarreal LaLiga Match in Miami",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 6 Oct 2025 15:28:57 EST",
    "source": "ESPN",
    "sources": [
      "Sports Illustrated",
      "ESPN"
    ],
    "domains": [
      "news.google.com",
      "www.espn.com"
    ],
    "snippets": [
      "UEFA has reluctantly approved a proposal to stage a LaLiga game between Barcelona and Villarreal in Miami, the governing body said on Monday.",
      "<a href=\"https://news.google.com/rss/articles/CBMijgFBVV95cUxPVTE3RE5SS0R2WWhPNGdydDBkdFRTT2FnZTg4QXRnaC04c2gzTUItTzdlWTducGZrVXBOQnozeGZ1bXBxSC1RYTJjQ2RqQm9BM0xsYVp1ZC1XZVVWN1pmNDdPSEJOX2VGTWFIV1ZJeDNla19SX0pZc0FiY1ZYdWlvWTI1S3RISFNpZU8wcWV3?oc=5\" target=\"_blank\">UEFA ’Reluctantly’ Approves Oversea"
    ],
    "image_url": "",
    "titles": [
      "UEFA reluctantly approves Barça game in Miami",
      "UEFA ’Reluctantly’ Approves Overseas La Liga, Serie A Games Requests - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.985,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.677,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "UEFA has given its approval, albeit reluctantly, for a LaLiga match between Barcelona and Villarreal to be played in Miami. This decision marks a significant move in staging European domestic league games overseas.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Judge Killed in Tirana Courtroom Attack; Assailant Arrested",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Mon, 06 Oct 2025 18:41:09 +0000",
    "source": "Al Jazeera",
    "sources": [
      "The Guardian",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Astrit Kalaja, an appeals court judge, died on his way to hospital after the courtroom attack on Monday.",
      "<p>Man opens fire in Tirana court, killing judge and injuring two other people, and is arrested after fleeing scene</p><p>A man on trial opened fire in a courtroom in the Albanian capital, Tirana, killing the judge and injuring two other people, police have said.</p><p>The judge, Astrit Kalaja, was "
    ],
    "image_url": "",
    "titles": [
      "Man on trial in Albania kills judge, injures two others in shooting",
      "Judge killed in courtroom shooting in Albania"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.969,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.656,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In Tirana, Albania, a man on trial attacked a courtroom, resulting in the death of judge Astrit Kalaja and injuries to two others. The assailant fled the scene but was later arrested by the police. This incident occurred on Monday, and Judge Kalaja died en route to the hospital.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Approves US Investors, Including Ellison, to Buy TikTok",
    "domain": "business",
    "source_domain": "www.businessinsider.com",
    "location": "global",
    "published": "2025-10-06T15:54:30Z",
    "source": "Business Insider",
    "sources": [
      "Fortune",
      "Business Insider"
    ],
    "domains": [
      "fortune.com",
      "www.businessinsider.com"
    ],
    "snippets": [
      "Last week, Donald Trump gave formal approval to a group of US investors, including Larry Ellison, to purchase TikTok.",
      "Trump endorsed the idea of a TikTok ban all the way back in 2020."
    ],
    "image_url": "https://i.insider.com/68e3e49b5dbc4fd10daa4050?format=jpeg",
    "titles": [
      "Trump posts message for Gen Zers on TikTok: 'You owe me big'",
      "Trump’s message to ‘the young people of TikTok’ and Gen Z: ‘You owe me big’"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.914,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.655,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Last week, Donald Trump formally approved a proposal by US investors, including Larry Ellison, to buy TikTok. This move comes after Trump previously supported the idea of banning TikTok in 2020.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Acclaimed Author Jilly Cooper Passes Away After Fall",
    "domain": "general",
    "source_domain": "www.nytimes.com",
    "location": "global",
    "published": "Mon, 06 Oct 2025 18:07:54 +0000",
    "source": "New York Times",
    "sources": [
      "The Guardian",
      "New York Times"
    ],
    "domains": [
      "www.theguardian.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "A prolific writer and keen observer, she sold millions of copies of her juicy, sometimes racy “Rutshire Chronicles” series.",
      "<p>The author of 18 ‘bonkbuster’ novels including Riders, Rivals and Bella has died following a fall</p><ul><li><p><a href=\"https://www.theguardian.com/global/2025/oct/06/share-your-tributes-and-memories-of-rivals-author-jilly-cooper\">Share your memories of Jilly Cooper</a></p></li><li><p><a href=\"h"
    ],
    "image_url": "https://static01.nyt.com/images/2024/10/10/multimedia/00xp-jillycooper-01-hcgf/00xp-jillycooper-01-hcgf-mediumSquareAt3X-v2.jpg",
    "titles": [
      "Jilly Cooper, British Romance Novelist, Is Dead at 88",
      "Jilly Cooper, author of Rivals and Riders, dies aged 88"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.958,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.654,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Jilly Cooper, the acclaimed author known for her \"Rutshire Chronicles\" series, including popular novels such as \"Riders\" and \"Rivals,\" has passed away following a fall. Cooper was celebrated for her engaging storytelling and vibrant characters, selling millions of copies worldwide. Fans and readers are invited to share their memories and tributes.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Police Seize Kilograms of Psilocybin in Mushroom Store Raids",
    "domain": "general",
    "source_domain": "ottawacitizen.com",
    "location": "local",
    "published": "Mon, 06 Oct 2025 17:21:02 +0000",
    "source": "Ottawa Citizen",
    "sources": [
      "Ottawa Citizen",
      "CityNews"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "ottawacitizen.com"
    ],
    "snippets": [
      "The raid comes after three magic mushroom stores caught on fire last month.",
      "Officers executed nine search warrants and seized kilograms of psilocybin, known as magic mushrooms, in a 24-hour bust. In a press release, officials shared that on Oct. 2 and 3, police, with help from several neighbourhood resource teams, went to nine search buildings that were suspected locations "
    ],
    "image_url": "",
    "titles": [
      "Ottawa police raid nine illegal 'magic mushroom' shops",
      "9 charged after police raid several magic mushroom stores"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.942,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.65,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Following a series of fires at three magic mushroom stores last month, police conducted a 24-hour operation on Oct. 2 and 3, executing nine search warrants across suspected locations. With assistance from neighborhood resource teams, they seized several kilograms of psilocybin, commonly known as magic mushrooms.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "OpenAI Introduces Feature for Third-Party App Integration",
    "domain": "technology",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Mon, 06 Oct 2025 17:52:35 GMT",
    "source": "Axios",
    "sources": [
      "TechCrunch",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "techcrunch.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMiakFVX3lxTE9BME9PcGhMV0FFcEdkTXlDclRQMlRQdTk1RWtKZEF5NWJEZExxM1VnQVRldWZUVTB1elZibk9xR3JodTVWWnhTa05vWUxrUkM0SnlQT1VzZkc1UUpUNDlaU3FUaUxrZS1XSnc?oc=5\" target=\"_blank\">OpenAI launches new feature to integrate third-party apps</a>&nbsp;&nbsp;<font color",
      "OpenAI is launching a new way for developers to build applications that appear directly inside of ChatGPT's conversations."
    ],
    "image_url": "",
    "titles": [
      "OpenAI launches new feature to integrate third-party apps - Axios",
      "OpenAI launches apps inside of ChatGPT"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.933,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.649,
    "summary_source": "snippet",
    "summary_reason": "retry_exhausted",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMiakFVX3lxTE9BME9PcGhMV0FFcEdkTXlDclRQMlRQdTk1RWtKZEF5NWJEZExxM1VnQVRldWZUVTB1elZibk9xR3JodTVWWnhTa05vWUxrUkM0SnlQT1VzZkc1UUpUNDlaU3FUaUxrZS1XSnc?oc=5\" target=\"_blank\">OpenAI launches new feature to integrate third-party apps</a>&nbsp;&nbsp;<font color",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "MrBeast Warns AI Video Tech May Threaten Creator Earnings as Sora Tops App Store",
    "domain": "business",
    "source_domain": "www.businessinsider.com",
    "location": "global",
    "published": "2025-10-06T16:17:50Z",
    "source": "Business Insider",
    "sources": [
      "TechCrunch",
      "Business Insider"
    ],
    "domains": [
      "www.businessinsider.com",
      "techcrunch.com"
    ],
    "snippets": [
      "MrBeast is worried that recent advancements in AI video generation could threaten the livelihoods of content creators.",
      "As Sora tops the App Store, MrBeast says AI could threaten creators' ability to make money."
    ],
    "image_url": "https://i.insider.com/68e3df115dbc4fd10daa3f98?format=jpeg",
    "titles": [
      "MrBeast calls out AI as a threat to YouTubers' livelihoods: 'Scary times'",
      "MrBeast says AI could threaten creators’ livelihoods, calling it ‘scary times’ for the industry"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.922,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.646,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "MrBeast expressed concerns that advancements in AI video generation technology could pose a threat to content creators' earnings. This comes as the AI app Sora becomes the top app on the App Store, highlighting the growing influence of AI in content creation.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Consulting Firm to Refund for Report Errors, Admits Using GPT-4o",
    "domain": "technology",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Mon, 06 Oct 2025 06:46:24 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "Ars Technica"
    ],
    "domains": [
      "arstechnica.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "<p>Partial refund to be issued after several errors were found in a report into a department’s compliance framework</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"ht",
      "Consulting firm quietly admitted to GPT-4o use after fake citations were found in August."
    ],
    "image_url": "https://i.guim.co.uk/img/media/515a0bf6dc96a2183fa9f4bc90a2fbeac2d91271/209_0_3292_2635/master/3292.jpg?width=140&quality=85&auto=format&fit=max&s=8962fcf918cd8a7bb9fd43f347b78c8c",
    "titles": [
      "Deloitte to pay money back to Albanese government after using AI in $440,000 report",
      "Deloitte will refund Australian government for AI hallucination-filled report"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.74,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.603,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A consulting firm will issue a partial refund due to multiple errors, including fake citations, found in a compliance framework report. The errors were acknowledged after the firm admitted to using GPT-4o in August.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Amazon Launches Prime Big Deal Days Sale on Oct 7 with Major Discounts",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-10-06T13:21:12-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "www.theverge.com"
    ],
    "snippets": [
      "If the past is any indication, Prime Big Deal Days — Amazon’s upcoming fall Prime Day event — should deliver a wave of deals on Apple devices, letting you save on everything from AirPods and AirTags to the latest iPad. However, if you can’t wait until the sale kicks off tomorrow, October 7th, to lan",
      "Amazon’s Prime Big Deal Days is one of the biggest shopping events of the year, and it officially kicks off tomorrow, October 7th. The two-day shopping affair will grant Prime members access to some of the best prices of the year on Amazon devices, as well as products from Sony, Sonos, Bose, Anker, "
    ],
    "image_url": "",
    "titles": [
      "The best Apple deals to shop ahead of Amazon’s fall Prime Day event",
      "How to find the best deals during Amazon’s October Prime Day sale"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.942,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.456,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Amazon's Prime Big Deal Days, starting October 7th, is a major two-day sale event offering significant discounts for Prime members on a wide range of products, including Apple devices, Amazon gadgets, and brands like Sony, Sonos, Bose, and Anker.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]