[
  {
    "title": "President Orders Troops to Portland to Guard Immigration Sites",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sat, 27 Sep 2025 11:12:33 -0400",
    "source": "NPR",
    "sources": [
      "The Guardian",
      "Axios",
      "Fortune",
      "NPR",
      "Forbes",
      "Deutsche Welle"
    ],
    "domains": [
      "fortune.com",
      "www.dw.com",
      "www.npr.org",
      "news.google.com",
      "www.theguardian.com",
      "www.forbes.com"
    ],
    "snippets": [
      "President Trump is authorizing the deployment of troops to \"protect\" Portland and ICE facilities there from \"domestic terrorists\" as he expands his controversial deployments to more U.S. cities.",
      "US President Donald Trump claimed that Antifa is waging \"war\" on the famously progressive city. Portland's mayor has rejected these claims.",
      "<a href=\"https://news.google.com/rss/articles/CBMic0FVX3lxTE5PWU9Wdzh0Vmo1QlBWYjhpaTdpU2dFeV9ZcFVUVFN0SXl2SnhVOHlDTUNjdGV6YnVqQ20xQWVzdmpIZlo2ZGkwdUFib3ZHMGNXSXoyaWJIdjZuVmZ0cXg1QWN3VGdNd0UzRlN3NUJFMElTVFk?oc=5\" target=\"_blank\">Trump directs troops to Portland with \"full force\" directive</a>&nbsp;&n",
      "<p>Apparently misled by hyperbolic reporting from conservative outlets on a single small protest, president described peaceful city as ‘war ravaged’</p><p>Donald Trump said on Saturday he is deploying troops to Portland, Oregon, “authorizing Full Force, if necessary”, ignoring pleas from local offic",
      "President Donald Trump ordered a crackdown on alleged “organized political violence,” claiming “riots” targeted ICE agents.",
      "Trump said the decision was necessary to protect U.S. Immigration and Customs Enforcement facilities."
    ],
    "image_url": "",
    "titles": [
      "Trump says he will send troops to Portland to deal with 'domestic terrorists'",
      "Trump sends troops to Portland over 'domestic terrorists'",
      "Trump directs troops to Portland with \"full force\" directive - Axios",
      "Donald Trump says he is deploying troops to Portland, Oregon",
      "Trump Orders Troops To Portland—Authorizes ‘Full Force’",
      "Trump says he’ll send troops to Portland, Oregon, in latest deployment to US cities"
    ],
    "score_components": {
      "magnitude": 0.986,
      "recency": 0.83,
      "consensus": 1.0,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.846,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The president has directed troops to Portland with a \"full force\" directive, stating it is necessary to protect immigration detention facilities from what he terms \"domestic terrorists.\" This action is part of a broader initiative to address security concerns at these facilities.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: initiative",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Europe Nears Ryder Cup Victory with Record Lead Over US",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sat, 27 Sep 2025 18:53:55 EST",
    "source": "ESPN",
    "sources": [
      "The Guardian",
      "Yahoo Sports",
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com",
      "sports.yahoo.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Europe is on the verge of retaining the Ryder Cup after a dominant Saturday left it just 2.5 points from victory over the United States at Bethpage Black.",
      "Europe battled through a torrent of insults from a raucous crowd to grab a record seven-point lead over the United States and move to the brink of retaining the Ryder Cup with a dominant display at Bethpage Black on Saturday.Asked if the crowd went too far, McIlroy replied, &quot;When you play an aw",
      "<ul><li><p>Europe maintain dominance as insults fly from crowd</p></li><li><p>Rory McIlroy calls abuse ‘really, really challenging’</p></li></ul><p>Quite incredibly, this managed to be an even uglier day for the United States of America off the golf course than it was on it. Never in his wildest of ",
      "<p>President Donald Trump did not attend Day 2 at the Ryder Cup. That was about the only difference Saturday as Europe sent out its same foursomes teams, filled the scoreboard with blue points and delivered a crushing blow to the Americans.</p>"
    ],
    "image_url": "",
    "titles": [
      "Europe holds historic lead, on brink of Ryder Cup",
      "Europe shrugs off intense abuse to reach brink of Ryder Cup win",
      "Europe seize high ground and 11½-4½ lead over USA into Ryder Cup singles",
      "Europe takes record lead into Ryder Cup’s Sunday singles"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.974,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.809,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Europe is on the verge of retaining the Ryder Cup after taking a record seven-point lead over the United States at Bethpage Black, despite facing a barrage of insults from the crowd. Rory McIlroy described the abuse as \"really, really challenging.\" Europe needs just 2.5 points to secure victory, following a dominant performance on Saturday. President Donald Trump did not attend the event.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "England Wins Third Women's Rugby World Cup, Defeating Canada 33-13",
    "domain": "sports",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Sat, 27 Sep 2025 17:01:37 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "Global News",
      "Sportsnet",
      "CityNews"
    ],
    "domains": [
      "globalnews.ca",
      "www.sportsnet.ca",
      "www.theguardian.com",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "<ul><li><p>Final: Canada 13-33 England</p></li><li><p>Ellie Kildunne shines for largest crowd in women’s rugby history</p></li></ul><p>If this were a movie, the scriptwriters would be shoo-ins for an Oscar, the plot centred on a dominant team who overcame the heartbreak of losing two back-to-back Ru",
      "England finally has a Women's Rugby World Cup title to confirm its world domination after outclassing Canada 33-13 in front of a record crowd at Twickenham on Saturday.",
      "<p>England finally has a Women&#8217;s Rugby World Cup title to confirm its world domination after outclassing Canada 33-13 in front of a record crowd at Twickenham on Saturday.</p>",
      "England finally has a Women&#8217;s&#160;Rugby&#160;World Cup title to confirm its world domination after outclassing Canada 33-13 in front of a record crowd at Twickenham on Saturday. Victory by five tries to three capped an astonishing World Cup cycle in which England won every match, 33 in a row,"
    ],
    "image_url": "https://i.guim.co.uk/img/media/419f43299f7512584409b061464caf5943147a87/1909_1397_1898_1519/master/1898.jpg?width=140&quality=85&auto=format&fit=max&s=a347528da6d8c7807fe8f96c7fca0554",
    "titles": [
      "England outclass Canada to capture glorious Women’s Rugby World Cup triumph",
      "Canada loses in Women’s Rugby World Cup final",
      "Canada drops Women’s Rugby World Cup final against England",
      "Canada loses Women’s Rugby World Cup final 33-13 to England"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.844,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.758,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "England won their third Women's Rugby World Cup title by defeating Canada 33-13 at Twickenham, in front of a record crowd of 81,885. Ellie Kildunne stood out in a game that marked England's dominance in women's rugby, completing a perfect World Cup cycle with 33 consecutive wins. This victory cements England's status as a powerhouse in the sport.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Anaheim Ducks Sign Mason McTavish to $42M, Six-Year Extension",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sat, 27 Sep 2025 15:30:47 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "NHL",
      "ESPN"
    ],
    "domains": [
      "news.google.com",
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "The Anaheim Ducks and restricted free agent center Mason McTavish, the 2021 third overall pick who is entering his fifth season, agreed to a six-year extension, the club announced on Saturday, and an NHL source told ESPN the deal is worth $42 million.",
      "<a href=\"https://news.google.com/rss/articles/CBMie0FVX3lxTFB6ZVNVb0VVb3RRd0xNYUdMVFFfYlNseUt0RDRyb01LQ3BOQ0FtdGZRLWNrUE9MR3JwMGtTTnVGTXY3dFczQ0Zxalpyc05HYmZodXExQ2RRRHVjMFhBS0ZmNk16dFdQTFY0VjZZUmtWNHptYTM4cDdRamxIaw?oc=5\" target=\"_blank\">Ducks Sign McTavish to Six-Year Contract</a>&nbsp;&nbsp;<font",
      "<p>Sportsnet&#8217;s Elliotte Friedman reported on Saturday that the 22-year-old centre is closing in on a six-year contract extension worth $42 million. The deal carries a $7 million average annual value.</p>"
    ],
    "image_url": "",
    "titles": [
      "Source: Ducks give McTavish six-year, $42M deal",
      "Ducks Sign McTavish to Six-Year Contract - NHL.com",
      "Ducks, Mason McTavish agree to six-year, $42M extension"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.907,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.743,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Anaheim Ducks have signed restricted free-agent center Mason McTavish to a six-year extension worth $42 million, as announced by the club and reported by ESPN and Sportsnet's Elliotte Friedman. McTavish, the 2021 third overall pick entering his fifth season, will have an average annual value of $7 million under this deal.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "US to Revoke Colombian President's Visa Over Incitement Claims",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-09-27T03:53:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "The Guardian",
      "Washington Post",
      "Deutsche Welle",
      "New York Times"
    ],
    "domains": [
      "www.washingtonpost.com",
      "www.nytimes.com",
      "www.dw.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "The left-wing Colombian president is a critic of Trump and vocally opposes Israel's operation in Gaza. Petro is in New York for the UN General Assembly and had called on US soldiers to disobey Trump.",
      "<p>At a pro-Palestine protest, Petro urged US soldiers to ‘disobey Trump’s order’ and ‘not point their rifles at humanity’</p><p>The US state department said on Friday it would revoke the visa of <a href=\"https://www.theguardian.com/world/colombia\">Colombian</a> leftist president Gustavo Petro for h",
      "The State Department accused Petro of urging U.S. soldiers to disobey orders in remarks at a pro-Palestinian rally in New York.",
      "The State Department called President Gustavo Petro of Colombia reckless after he called for U.S. soldiers to disobey President Trump at a pro-Palestinian rally."
    ],
    "image_url": "",
    "titles": [
      "Gustavo Petro: US to revoke visa of leftist Colombian leader",
      "US revokes visa for Colombian president Gustavo Petro after ‘reckless’ actions in New York",
      "State Department revokes visa for Colombian President Gustavo Petro",
      "U.S. Says It Will Revoke Colombian President’s Visa"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.655,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.727,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The US State Department announced it will revoke the visa of Colombian President Gustavo Petro after he encouraged US soldiers to disobey orders during a pro-Palestinian protest in New York. Petro, who was in the city for the UN General Assembly, criticized Trump and opposed Israel's actions in Gaza. His comments were deemed by the US as incitement to violence.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Lavrov: Russia Won't Attack Europe but Will Respond to Aggression",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sat, 27 Sep 2025 18:37:52 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Global News",
      "Al Jazeera",
      "CityNews"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "globalnews.ca",
      "www.aljazeera.com"
    ],
    "snippets": [
      "The Russian foreign minister made the comment in an address to the United Nations General Assembly on Saturday.",
      "Russian Foreign Minister Sergey Lavrov spoke at the U.N. General Assembly after weeks in which unauthorized flights into NATO’s airspace have raised alarm around Europe.",
      "UNITED NATIONS (AP) — As new tensions rise between Russia and NATO powers, Moscow&#8217;s top diplomat insisted to world leaders Saturday that his nation doesn&#8217;t intend to attack Europe but will mount a “decisive response” to any aggression. At the same time, Foreign Minister Sergey Lavrov too"
    ],
    "image_url": "",
    "titles": [
      "Russia will give ‘decisive response’ if provoked by West, says Lavrov",
      "Russia warns of ‘decisive response’ to any act of aggression against it",
      "Russia tells UN: No intent to attack Europe, but aggression will get a ‘decisive response’"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.891,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.725,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "At the U.N. General Assembly, Russian Foreign Minister Sergey Lavrov stated Russia does not plan to attack Europe but will respond decisively to any aggression. This comes amid rising tensions and unauthorized flights into NATO airspace, raising concerns across Europe.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UN Sanctions on Iran to Be Reimposed After Russian-Chinese Bid Fails",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sat, 27 Sep 2025 13:05:20 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Washington Post",
      "Financial Times",
      "Al Jazeera"
    ],
    "domains": [
      "www.washingtonpost.com",
      "www.ft.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "The UN has reimposed sanctions on Iran, a decade after they were lifted as part of the nuclear deal called the JCPOA.",
      "Tehran fails to meet deadline set by European powers",
      "Rebuffed by the Trump administration, Iran failed Friday in a last-ditch effort to prevent the “snapback” of global sanctions that were lifted as part of the 2015 nuclear deal."
    ],
    "image_url": "",
    "titles": [
      "Iran slams ‘illegal’ vote as UN reimposes decade-old sanctions",
      "UN reimposes sanctions on Iran over its nuclear programme",
      "U.N. to reimpose sanctions on Iran after weeks of failed diplomacy"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.794,
      "consensus": 0.789,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.723,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "UN sanctions on Iran, lifted under the 2015 nuclear deal, are set to be reimposed early Sunday after a Russian-Chinese bid to delay them failed. The Security Council voted against the delay, and Iran's last-ditch effort to prevent the sanctions' \"snapback\" was unsuccessful. This development follows the Trump administration's rebuff of Iran's attempts to avoid these sanctions over its nuclear program.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: development, effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UK Backs £1.5bn Loan for JLR to Recover from Cyber-Attack, Restart Production",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 27 Sep 2025 21:00:13 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "Financial Times",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.ft.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Ministers hope the loan, from a commercial bank and underwritten by the government, will give certainty to suppliers.",
      "Government says guarantee from UK Export Finance will protect the automotive supply chain",
      "<p>Britain’s largest automotive employer plans to restart engine manufacturing in early October, report says</p><p>The government has said it will underwrite a £1.5bn loan guarantee to Jaguar Land Rover (JLR) as the carmaker battles the consequences of a recent cyber-attack.</p><p>JLR had to suspend"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/1505/live/303c0ab0-9be6-11f0-bddd-5f1abb8b5445.jpg",
    "titles": [
      "Government to guarantee £1.5bn loan to Jaguar Land Rover after cyber shutdown",
      "Jaguar Land Rover wins £1.5bn UK loan support after cyber attack",
      "UK government will underwrite £1.5bn loan guarantee to Jaguar Land Rover after cyber-attack"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.917,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.72,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The UK government has underwritten a £1.5bn loan guarantee to Jaguar Land Rover (JLR), Britain's largest automotive employer, to help it recover from a cyber-attack and restart engine manufacturing in early October. This move, involving a loan from a commercial bank backed by UK Export Finance, aims to protect the automotive supply chain and provide certainty to suppliers.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "36 Dead, 50+ Injured in Stampede at Tamil Nadu Rally",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sat, 27 Sep 2025 19:22:07 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Washington Post",
      "Al Jazeera",
      "Deutsche Welle"
    ],
    "domains": [
      "www.washingtonpost.com",
      "www.dw.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Vijay, who is a well-known actor and goes by only one name, launched a political party last year.",
      "At least 36 people were killed in a stampede at a campaign rally for the popular Tamil actor-turned-politician, officials said.",
      "At least 36 people were killed and dozens injured in a stampede Saturday at a political rally in India for a popular actor-turned-politician, authorities said."
    ],
    "image_url": "",
    "titles": [
      "At least 31 dead, over 50 injured at Indian actor-politician Vijay’s rally",
      "India: Dozens killed at rally for actor-politician Vijay",
      "At least 36 killed at Indian actor’s political rally"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.905,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.718,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "At least 36 people were killed and over 50 injured in a stampede at a rally in Tamil Nadu, India, led by popular actor and politician Vijay. The incident occurred during an election campaign gathering, with eight children among the victims.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "36 Dead, 50+ Injured in Stampede at Vijay's Tamil Nadu Rally",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 27 Sep 2025 20:04:05 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC",
      "New York Times"
    ],
    "domains": [
      "www.nytimes.com",
      "www.bbc.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Tens of thousands had gathered at a campaign event for actor-turned-politician Vijay in India's southern state of Tamil Nadu.",
      "<p>Victims include eight children at election campaign gathering in Tamil Nadu led by popular actor and politician</p><p>At least 36 people have been killed and more than 50 injured in a crush at a rally for a popular actor and politician in India.</p><p>The health minister in the southern Indian st",
      "The stampede took place at an event for Joseph Vijay Chandrasekhar, the popular actor known professionally as Vijay. A health official said the toll was likely to rise."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/2b4a/live/55e79ee0-9bc9-11f0-928c-71dbb8619e94.jpg",
    "titles": [
      "More than 30 dead in crush at political rally in India",
      "At least 36 dead and more than 50 injured in crush at Vijay rally in India",
      "Stampede at Actor’s Political Rally Kills at Least 36 in India"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.899,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.717,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "At least 36 people were killed and over 50 injured in a stampede at a campaign rally in Tamil Nadu, India, for actor-turned-politician Joseph Vijay Chandrasekhar, known as Vijay. The tragic event occurred during a large gathering, which included children among the victims. Health officials have indicated that the death toll may rise.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Blue Jays Beat Rays 5-1, Clement Scores Twice, Yesavage Pitches Shutout",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sat, 27 Sep 2025 21:43:05 +0000",
    "source": "Global News",
    "sources": [
      "Sportsnet",
      "Global News"
    ],
    "domains": [
      "globalnews.ca",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Ernie Clement scored twice and drove in two runs while rookie starter Trey Yesavage threw five shutout innings as the Toronto Blue Jays defeated the Tampa Bay Rays 5-1 on Saturday afternoon.",
      "<p>Watch as Ernie Clement hits a ground ball down the third base line for a two-run double before Andres Gimenez follows suit with an RBI single to get the Blue Jays out in front in the second inning against the Tampa Bay Rays.</p>"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/cb5558399663a5e2770ee6f5aa1407e6ce43cf1c990bc61c3c5b33a944f3b252.jpg?quality=65&strip=all",
    "titles": [
      "Clement leads the way as Blue Jays top Rays 5-1",
      "Clement, Gimenez get Blue Jays on the board with back-to-back RBIs"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.95,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.695,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Ernie Clement scored twice and had two RBIs, and Trey Yesavage pitched five shutout innings, leading the Toronto Blue Jays to a 5-1 victory over the Tampa Bay Rays on Saturday. Clement's performance included a two-run double, and Andres Gimenez added an RBI single in the second inning to secure the win for the Blue Jays.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Drones Spotted Over Danish Military Sites; Security Investigating",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sat, 27 Sep 2025 12:11:58 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Deutsche Welle",
      "Financial Post"
    ],
    "domains": [
      "financialpost.com",
      "www.dw.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Unidentified drones seen at several places, including the biggest army base, after a slew of earlier sightings.",
      "Danish security authorities said drones were seen over the country's biggest military base overnight.",
      "BERLIN (AP) &#8212; The Danish defense ministry said Saturday that &#8220;drones have been observed at several of Danish defense facilities.&#8221; The new drone sightings overnight Friday into Saturday come after there were several drone sightings in the Nordic country earlier this week, with some "
    ],
    "image_url": "",
    "titles": [
      "Denmark reports new drone sightings overnight at military sites",
      "Denmark: New drone sightings over military infrastructure",
      "Denmark reports new drone sightings at military facilities"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.779,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.693,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Unidentified drones were observed flying over several Danish military sites, including the country's largest base, Karup airbase, on Friday night. Danish security authorities are investigating the incidents, which they have described as part of a \"hybrid attack.\" The current status of the investigation remains ongoing.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Ravens' Nnamdi Madubuike on Injured Reserve After Neck Injury",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sat, 27 Sep 2025 17:30:41 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "The Baltimore Ravens placed Nnamdi Madubuike, sidelined in Monday's loss to the Detroit Lions, on injured reserve Saturday, which creates more uncertainty about the Pro Bowl defensive tackle's neck injury, as the veteran will now miss at least four games.",
      "Baltimore's defense takes another hit after three rough weeks to start the season"
    ],
    "image_url": "",
    "titles": [
      "Ravens place DT Madubuike on injured reserve",
      "Nnamdi Madubuike injury: Ravens place Pro Bowl defensive lineman on injured reserve with neck injury"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.946,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.679,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Baltimore Ravens have placed Pro Bowl defensive tackle Nnamdi Madubuike on injured reserve due to a neck injury sustained in Monday's loss to the Detroit Lions. This move sidelines him for a minimum of four games, adding to the challenges faced by Baltimore's defense, which has struggled in the first three weeks of the season.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: sustain",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Jones' Hit Secures Tigers' Playoff Spot with 2-1 Win Over Red Sox",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sat, 27 Sep 2025 19:11:33 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "Jahmai Jones hit a two-run single to rally the struggling Detroit Tigers from an early deficit, and his team hung on to defeat the Boston Red Sox 2-1 on Saturday, clinching a spot in the American League playoffs for the second straight season.",
      "<p>Jamhai Jones hit a two-run single to rally Detroit from an early deficit, and the Tigers beat the Boston Red Sox 2-1 on Saturday to clinch a spot in the AL playoffs.</p>"
    ],
    "image_url": "",
    "titles": [
      "Tigers win, secure second straight playoff berth",
      "Tigers clinch AL playoff berth with win over Red Sox"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.98,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.676,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Jahmai Jones hit a two-run single, helping the Detroit Tigers overcome an early deficit to defeat the Boston Red Sox 2-1 on Saturday. This victory secured the Tigers a spot in the American League playoffs for the second consecutive season.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Americans Lead Ryder Cup After Day One, Young and DeChambeau Shine",
    "domain": "sports",
    "source_domain": "sports.yahoo.com",
    "location": "national",
    "published": "Sat, 27 Sep 2025 23:39:58 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports",
      "Sports Illustrated"
    ],
    "domains": [
      "news.google.com",
      "sports.yahoo.com"
    ],
    "snippets": [
      "Young, the best U.S. player on Day 1, nearly holed out after DeChambeau hit his opening drive to 70 yards.  Aberg made an 11-footer to tie that hole and not until No. 3 did the Americans take a lead they wouldn’t relinquish.",
      "<a href=\"https://news.google.com/rss/articles/CBMigwFBVV95cUxPX0cyaXRvWnhfLUFhLWVxdXROczdncE1zNmM4YzFzRDQwTUNMR013emFxYnhmZGpNZlhKWXcxLUIyV245Y2NwNDA4cWg2d1hkM3ltSjhJbXVFdEFpYnd6SjRMWUlEYU80TkpLbldMTmhtdUI0Tk45R1pnZEFzdDNMY2VyZw?oc=5\" target=\"_blank\">America’s Ryder Cup Losers Were Outside the Ropes"
    ],
    "image_url": "",
    "titles": [
      "Ryder Cup summaries from Saturday's matches at Bethpage Black",
      "America’s Ryder Cup Losers Were Outside the Ropes Saturday at Bethpage Black - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.989,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.653,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "On the first day of the Ryder Cup, Young, the top U.S. player, nearly secured a hole with DeChambeau's opening drive, but Aberg's 11-footer tied the hole. It wasn't until the third hole that the Americans took a lead, which they maintained throughout.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "U.S. Revokes Colombian President's Visa After Protest Remarks",
    "domain": "business",
    "source_domain": "fortune.com",
    "location": "global",
    "published": "Sat, 27 Sep 2025 23:26:05 +0000",
    "source": "Fortune",
    "sources": [
      "Fortune",
      "CityNews"
    ],
    "domains": [
      "fortune.com",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "During a protest Friday over the war in Gaza, he said “I ask all the soldiers of the United States' army, don't point your rifles against humanity\" and “disobey the orders of Trump.”",
      "WASHINGTON (AP) — Tensions between the United States and Colombia have escalated with the State Department announcing it was revoking a visa for Gustavo Petro, president of the Latin American country, after he participated in a New York protest where he called on American soldiers to disobey Preside"
    ],
    "image_url": "https://fortune.com/img-assets/wp-content/uploads/2025/09/AP25266820328000-e1759015209306.jpg?w=2048",
    "titles": [
      "U.S. revokes visa for Colombia’s president after he went to a protest and urged American soldiers to disobey Trump",
      "US revokes visa for Colombia’s president after he urges American soldiers to disobey Trump"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.985,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.652,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The U.S. State Department revoked the visa of Colombian President Gustavo Petro after he urged American soldiers to disobey President Trump's orders during a protest in New York against the war in Gaza. This action has heightened tensions between the United States and Colombia.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Europe Leads Ryder Cup With Record Advantage After Dominating Fourballs",
    "domain": "sports",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Sat, 27 Sep 2025 23:27:17 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "Sky Sports"
    ],
    "domains": [
      "www.theguardian.com",
      "www.skysports.com"
    ],
    "snippets": [
      "<p>Europe won three out of four fourballs matches to put themselves in a commanding position at Bethpage Black</p><p><strong>Matt Fitzpatrick and Cameron Young send their drives at 2 down the middle.</strong> Ludvig Åberg finds the green with his approach but the ball spins back into the fringe. Bry",
      "Highlights of the Saturday fourballs session from the Ryder Cup at Bethpage as Europe dominate Team USA and build a record lead!"
    ],
    "image_url": "https://i.guim.co.uk/img/media/fa4777c1d81d121555bfa762c236eca71fdda303/149_0_3819_3057/master/3819.jpg?width=140&quality=85&auto=format&fit=max&s=dccea51e237410eda80bd60eba36979e",
    "titles": [
      "Ryder Cup: Europe dominate fourballs to stretch lead over USA to 11½-4½ on fiery day two – as it happened",
      "Europe dominate Team USA at Ryder Cup! | Saturday fourballs highlights!"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.965,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.648,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Europe dominated the Ryder Cup Saturday fourballs session at Bethpage Black, winning three out of four matches against Team USA. This victory puts Europe in a commanding position with a record lead. Key moments included Matt Fitzpatrick and Cameron Young hitting strong drives, and Ludvig Åberg's approach shot reaching the green.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Golden Lion Tamarins, Sloths Share Habitat at Palm Beach Zoo",
    "domain": "science",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Sat, 27 Sep 2025 16:55:00 -0400",
    "source": "ABC News",
    "sources": [
      "ABC News",
      "Phys.org"
    ],
    "domains": [
      "abcnews.go.com",
      "phys.org"
    ],
    "snippets": [
      "Golden lion tamarins and Hoffman's two-toed sloths have become unlikely roommates in a brand new habitat at the Palm Beach Zoo and Conservation Society.",
      "Golden lion tamarins and Hoffman's two-toed sloths have become unlikely roommates in a brand new habitat at the Palm Beach Zoo and Conservation Society in Florida."
    ],
    "image_url": "https://s.abcnews.com/images/Entertainment/250927_abc_social_monkey_hpMain_4x3_384.jpg",
    "titles": [
      "WATCH:  Golden lion tamarins and sloths become unlikely roommates at Florida zoo",
      "Golden lion tamarins and sloths become unlikely roommates at Palm Beach Zoo"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.934,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.642,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Golden lion tamarins and Hoffman's two-toed sloths are now cohabiting in a new habitat at the Palm Beach Zoo and Conservation Society in Florida, showcasing an unusual pairing of species.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "President Deploys Troops to Protect Immigration Facilities in Major US City",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 27 Sep 2025 21:42:04 GMT",
    "source": "BBC",
    "sources": [
      "Financial Times",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.ft.com"
    ],
    "snippets": [
      "The president says the latest move to send troops to a major US city is \"necessary\" to protect immigration detention facilities.",
      "Move to protect immigration enforcement facilities is fourth deployment in Democrat-controlled US cities"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/f35b/live/f3e23540-9bcb-11f0-abc3-59cd99a67fd1.jpg",
    "titles": [
      "Trump authorises 'full force' as Portland set to become latest city to see troops deployed",
      "Trump authorises ‘full force’ as he orders troops to ‘war-ravaged’ Portland"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.93,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.641,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The President has announced the deployment of troops to a major US city, marking the fourth such action in Democrat-controlled cities. This move aims to safeguard immigration detention facilities, deemed \"necessary\" for their protection.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Admin Seeks Court Approval Amid Legal Battles; Decision Months Away",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 27 Sep 2025 17:01:08 GMT",
    "source": "BBC",
    "sources": [
      "Fortune",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "fortune.com"
    ],
    "snippets": [
      "The Trump administration asks the court to clear the way for the order, which has faced a series of legal challenges.",
      "Any decision on whether to take up the case probably is months away and arguments probably would not take place until the late winter or early spring."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/9b10/live/22759610-9bb6-11f0-852e-075d0572b37f.jpg",
    "titles": [
      "Trump officials ask Supreme Court to uphold ban on birthright citizenship",
      "Trump asks Supreme Court to back his limits on birthright citizenship and upend how the 14th Amendment’s been interpreted for 125 years"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.844,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.631,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Trump administration has requested a court to allow an order to proceed, despite ongoing legal challenges. A decision on whether the case will be heard is expected to take months, with potential arguments not occurring until late winter or early spring.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Prince William Shares 2024 as Toughest Year on \"The Reluctant Traveler\"",
    "domain": "general",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Sat, 27 Sep 2025 08:01:02 -0400",
    "source": "ABC News",
    "sources": [
      "ABC News",
      "CityNews"
    ],
    "domains": [
      "abcnews.go.com",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "Prince William has told &ldquo;Schitt's Creek&rdquo; star Eugene Levy that 2024 was the hardest year of his life",
      "LONDON (AP) — Prince William has told “Schitt&#8217;s Creek” star Eugene Levy that 2024 was the hardest year of his life. The royal made an appearance on Levy&#8217;s show “The Reluctant Traveler” and spoke about last year, which saw his wife Kate, the Princess of Wales, and his father King Charles "
    ],
    "image_url": "https://s.abcnews.com/images/Entertainment/wirestory_a352852fc546e7182d2354cf5356a967_4x3_384.jpg",
    "titles": [
      "Prince William says 2024 was the hardest year of his life",
      "Prince William says 2024 was the hardest year of his life"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.776,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.61,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Prince William revealed to Eugene Levy on \"The Reluctant Traveler\" show that 2024 was the most challenging year of his life. This disclosure was made during an appearance that highlighted personal difficulties, involving his wife Kate, the Princess of Wales, and his father, King Charles.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Two Women Die Crossing Channel to Britain in Makeshift Boat",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 27 Sep 2025 09:54:22 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Authorities say the pair died off the coast of northern France after about 100 people set off by makeshift boat.",
      "<p>French authorities say about 100 people were attempting to reach the UK on a makeshift boat</p><p>Two women have died while trying to cross the Channel to Britain, French authorities said.</p><p>The incident occurred south of the beaches of Neufchâtel-Hardelot, where about 100 people were trying "
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/e9fb/live/b3e81c80-9b8e-11f0-bdeb-9de9348d5d1d.jpg",
    "titles": [
      "Two women die during failed Channel crossing attempt",
      "Two women die trying to cross Channel from France"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.727,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.607,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Two women died attempting to cross the Channel to Britain in a makeshift boat, according to French authorities. The incident involved around 100 people and occurred south of Neufchâtel-Hardelot, off the coast of northern France.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Iran Recalls Ambassadors from E3 Over Nuclear Sanctions Move",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sat, 27 Sep 2025 08:31:33 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Deutsche Welle"
    ],
    "domains": [
      "www.dw.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "The E3 countries triggered the mechanism one month ago to reimpose sanctions, which come into effect on Sunday.",
      "As Iran braces for potential sanctions, it has recalled its ambassadors to Germany, France and the UK. Meanwhile, Lebanon's Hezbollah group marks the first anniversary of the killing of its leader Nasrallah. Follow DW."
    ],
    "image_url": "",
    "titles": [
      "Iran recalls envoys to UK, France, Germany as UN sanctions reimposed",
      "Iran summons European envoys ahead of expected sanctions"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.722,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.606,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Iran has recalled its ambassadors from France, Germany, and the UK in response to the E3 countries triggering a mechanism to reimpose U.N. nuclear sanctions, set to take effect on Sunday. This move comes as Iran prepares for the potential impact of these sanctions.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "U.S. Faces Government Shutdown Over Border Wall Funding Dispute",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Sat, 27 Sep 2025 03:23:09 GMT",
    "source": "CNBC",
    "sources": [
      "Financial Post",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "financialpost.com"
    ],
    "snippets": [
      "The government previously shut down during President Donald Trump's first term over disputes about funding his planned U.S.-Mexico border wall.",
      "US government shutdowns have become so common in recent decades that every federal agency has a playbook for how to implement them."
    ],
    "image_url": "",
    "titles": [
      "Here's what to know about a federal government shutdown",
      "Here’s What Happens When the US Government Shuts Down"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.635,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.589,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "During President Donald Trump's first term, the U.S. government experienced a shutdown due to disagreements over funding for a proposed U.S.-Mexico border wall. Government shutdowns have occurred frequently enough in recent years that all federal agencies now have specific guidelines for operating during such shutdowns.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "US Lawmakers Release Epstein Documents; Musk Labels News Story \"False\"",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 27 Sep 2025 03:39:38 GMT",
    "source": "BBC",
    "sources": [
      "Global News",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "globalnews.ca"
    ],
    "snippets": [
      "More documents related to the late convicted paedophile Jeffrey Epstein have been released by lawmakers in the US.",
      "In an X post referencing a news story about the documents' release, Elon Musk wrote: \"This is false.\""
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/4e42/live/89472f60-9b53-11f0-92db-77261a15b9d2.jpg",
    "titles": [
      "Elon Musk and Prince Andrew named in new Epstein files",
      "Elon Musk, Peter Thiel named in newly released Epstein estate documents"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.639,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.583,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "US lawmakers released additional documents connected to the late convicted paedophile Jeffrey Epstein. Following this, Elon Musk, on X, labeled a news story about the document release as \"false.\"",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]