[
  {
    "title": "King Charles Hosts Trump; Challenging Talks Await with Starmer",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Thu, 18 Sep 2025 11:22:51 -0400",
    "source": "NPR",
    "sources": [
      "BBC",
      "CNBC",
      "Al Jazeera",
      "New York Times",
      "Financial Times",
      "NPR"
    ],
    "domains": [
      "www.ft.com",
      "www.nytimes.com",
      "www.cnbc.com",
      "www.bbc.com",
      "www.bbc.co.uk",
      "www.aljazeera.com",
      "www.npr.org"
    ],
    "snippets": [
      "After a day of royal pomp, President Trump's visit to the United Kingdom closes with a business reception and a meeting with Prime Minister Keir Starmer.",
      "King Charles hosts Donald Trump at Windsor Castle on the first full day of his UK state visit.",
      "And the row over free speech after Charlie Kirk’s assassination",
      "Demonstrators have been protesting against Donald Trump’s second state visit to the United Kingdom.",
      "Trump is  heading to Chequers, the official country residence of Prime Minister Keir Starmer, for talks with the British leader and business delegations.",
      "In different ways, the reputations of the royal family, the British government and President Trump have each been tarnished by the sex offender Jeffrey Epstein.",
      "Leaders hail joint efforts on ending wars in Ukraine and Gaza but acknowledge differences on Palestinian statehood"
    ],
    "image_url": "",
    "titles": [
      "Trump wraps up state visit to U.K.",
      "Watch: Pomp and protests on day one of Trump state visit",
      "What does Donald Trump want from his UK state visit?",
      "Donald Trump’s UK state visit met with protests",
      "The pomp and pageantry ends as Trump's state visit gets down to business",
      "The Ghost of Jeffrey Epstein Hangs Over Trump’s U.K. State Visit",
      "Trump and Starmer seek to present united front after lavish state visit"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.983,
      "consensus": 1.0,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.882,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "King Charles hosted US President Donald Trump at Windsor Castle during Trump's first full day of his UK state visit. The visit comes amid discussions on free speech following Charlie Kirk's assassination. Trump is expected to have challenging talks with Sir Keir Starmer following his time with the King. Additionally, other nations like France, Australia, and Canada plan to recognize a Palestinian state at the upcoming UN summit, a move Starmer will reportedly also make after Trump's visit. Visitors to British royals are reminded to use formal titles and avoid physical contact beyond a bow or c",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "\"ABC Suspends 'Jimmy Kimmel Live' After Host's Controversial Remarks\"",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Thu, 18 Sep 2025 05:00:00 -0400",
    "source": "NPR",
    "sources": [
      "Axios",
      "Deutsche Welle",
      "Global News",
      "CNBC",
      "Al Jazeera",
      "NPR"
    ],
    "domains": [
      "www.dw.com",
      "www.cnbc.com",
      "news.google.com",
      "www.aljazeera.com",
      "www.npr.org",
      "globalnews.ca"
    ],
    "snippets": [
      "ABC announced Wednesday that <em>Jimmy Kimmel Live!</em> would be off the air indefinitely following comments regarding speculation swirling around the suspect in the killing of Charlie Kirk.",
      "US show host Jimmy Kimmel was taken off air after he joked about the political reaction to the killing of Charlie Kirk.",
      "ABC network is taking \"Jimmy Kimmel Live\" off the air indefinitely in response to comments the late-night host made about the killing of conservative activist Charlie Kirk.",
      "<a href=\"https://news.google.com/rss/articles/CBMiggFBVV95cUxQZXNjSFVmMWhZaGxKOEJBU0xRbXFGdElMdGxUOGxsenY0ZmstTkNray0yMkUzbU5acDVDYnZ6aG92dFhjY1BjQjBldmhwUFZSUldFTUhOd3piWlA1QjRqMHNESXF2ZmE4UWdmV3hYVUZJeTI2TUFnNnZZQmg2ZHJEa1VR?oc=5\" target=\"_blank\">What Jimmy Kimmel said about Charlie Kirk's killing",
      "<a href=\"https://news.google.com/rss/articles/CBMib0FVX3lxTE1UUENQRkYxZGt6M1MyX1YxaVVHVGlvUEtEYWJ5RjNaMXVDV2I4dVJUbllIOHBSX0FreHhMa2NybTQ1U1pjdFRNN0kxVnFnaE1GZDdETkhCZ09NeDFCMm1ubVBrSWN4aTdpUFUwTnVHZw?oc=5\" target=\"_blank\">ABC pulls Jimmy Kimmel after Charlie Kirk comments</a>&nbsp;&nbsp;<font color",
      "President Trump has praised ABC's suspension of Jimmy Kimmel'show after its host suggested the alleged killer of Charlie Kirk was linked to his MAGA movement.",
      "Jimmy Kimmel has not released a statement following ABC's decision to pull his show but many others have spoken out against the move, including SAG-AFTRA."
    ],
    "image_url": "",
    "titles": [
      "ABC pulls Jimmy Kimmel off air after comments made about the Charlie Kirk killing",
      "What did Jimmy Kimmel say about Charlie Kirk’s killing?",
      "'Jimmy Kimmel Live' pulled off air over Charlie Kirk comment",
      "What Jimmy Kimmel said about Charlie Kirk's killing - Axios",
      "ABC pulls Jimmy Kimmel after Charlie Kirk comments - Axios",
      "FCC's Carr says Jimmy Kimmel appeared to 'mislead' public on Charlie Kirk killing",
      "Here’s what Jimmy Kimmel said about the Charlie Kirk shooting"
    ],
    "score_components": {
      "magnitude": 0.986,
      "recency": 0.86,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.842,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "ABC has indefinitely suspended \"Jimmy Kimmel Live\" following remarks made by the host regarding the killing of conservative activist Charlie Kirk. Jimmy Kimmel suggested that Kirk's alleged killer was aligned with Trump's MAGA movement, leading to backlash. The decision came after Nexstar, an affiliate owner, announced it would pre-empt the show indefinitely, influenced by FCC chairman Brendan Carr's warning about pulling broadcast licenses over the comments. The show will be replaced by another ABC program for the foreseeable future.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "King Charles Hosts Trump; Challenging Talks Await with Starmer",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Thu, 18 Sep 2025 10:25:45 -0400",
    "source": "NPR",
    "sources": [
      "The Guardian",
      "Financial Post",
      "NPR",
      "New York Times"
    ],
    "domains": [
      "www.theguardian.com",
      "www.nytimes.com",
      "www.npr.org",
      "financialpost.com"
    ],
    "snippets": [
      "President Trump and British Prime Minister Keir Starmer talked about foreign affairs privately for about an hour, including the conflicts in Gaza and Ukraine.",
      "<p>Other nations including France, Australia and Canada plan to take the same step at next week’s UN summit </p><p>Keir Starmer will reportedly recognise a Palestinian state over the weekend after Donald Trump concludes his state visit to the UK.</p><p>The prime minister has previously said he plans",
      "President Trump and Prime Minister Keir Starmer discussed the wars in Gaza and Ukraine during Mr. Trump’s state visit. Earlier, the two leaders signed a technology partnership agreement.",
      "Prime Minister Keir Starmer is expected to confirm that the British government will vote to recognize a Palestinian state hours or days after President Trump’s visit to Britain.",
      "Donald Trump reaffirmed his opposition to a looming UK decision to recognize a Palestinian state, but the US president passed up the chance to personally urge Prime Minister Keir Starmer to reconsider the move.",
      "President Donald Trump said Russian President Vladimir Putin had “really let me down” after meeting with UK Prime Minister Keir Starmer to discuss efforts to heighten pressure on Russia to enter negotiations that could help bring the Kremlin’s three-year war in Ukraine to an end."
    ],
    "image_url": "",
    "titles": [
      "Trump says he disagrees with Starmer's decision to recognize Palestinian state",
      "Starmer to recognise Palestinian state ‘after Trump state visit’",
      "Live Updates: Trump and Starmer Acknowledge Divide Over Palestinian Statehood",
      "U.K. to Formally Recognize Palestinian Statehood After Trump Departs",
      "Trump Says He Disagrees With Starmer Bid to Recognize Palestine",
      "Trump Says Putin ‘Let Me Down’ After Meeting Starmer on Ukraine"
    ],
    "score_components": {
      "magnitude": 0.932,
      "recency": 0.963,
      "consensus": 0.908,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.831,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "King Charles hosted US President Donald Trump at Windsor Castle during Trump's first full day of his UK state visit. The visit comes amid discussions on free speech following Charlie Kirk's assassination. Trump is expected to have challenging talks with Sir Keir Starmer following his time with the King. Additionally, other nations like France, Australia, and Canada plan to recognize a Palestinian state at the upcoming UN summit, a move Starmer will reportedly also make after Trump's visit. Visitors to British royals are reminded to use formal titles and avoid physical contact beyond a bow or c",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Nvidia Invests $5 Billion in Intel for Data Center, PC Product Development",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Thu, 18 Sep 2025 13:13:01 GMT",
    "source": "Axios",
    "sources": [
      "TechCrunch",
      "Axios",
      "CNBC",
      "Financial Times",
      "The Guardian"
    ],
    "domains": [
      "www.ft.com",
      "www.theguardian.com",
      "www.cnbc.com",
      "techcrunch.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMiXEFVX3lxTE5SNEgyOXVRcjRCUDNCc1VQLUU5Uk1ZeHZWZFcxN25IRkJGbVRSY2JGLUZhSlVFX1gzT0g0VjY5OHFpNURVS1VaWFJtTVBTZW0xbU5jRHk5blpBYWNL?oc=5\" target=\"_blank\">Nvidia to invest $5 billion in Intel and co-develop chips</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Axios</f",
      "Nvidia said it will invest $5 billion in Intel as part of a deal to co-develop data center and PC products with the troubled chipmaker.",
      "Deal will see the two US groups co-develop chips for PCs and data centres",
      "<p>Deal gives Intel a lifeline as firms team up on AI datacenters and PC chips after Trump stake sparks market surge</p><p><a href=\"https://www.theguardian.com/technology/nvidia\">Nvidia</a>, the world’s leading chipmaker, announced plans to invest $5bn in Intel and collaborate with the struggling se",
      "Nvidia has agreed to invest $5 billion in Intel as part of a broader deal to together develop \"multiple generations\" of data center and PC products. Nvidia will buy Intel stock."
    ],
    "image_url": "",
    "titles": [
      "Nvidia to invest $5 billion in Intel and co-develop chips - Axios",
      "Intel surges 32% with Nvidia to invest $5 billion in chipmaker, co-develop data center and PC chips",
      "Nvidia to invest $5bn in rival Intel",
      "Nvidia to invest $5bn in Intel after Trump administration’s 10% stake",
      "Nvidia buys $5 billion stake in Intel, planning AI chip collaboration"
    ],
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.92,
      "consensus": 0.995,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.823,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Nvidia has announced a $5 billion investment in Intel, alongside a partnership to co-develop multiple generations of data center and PC products. This collaboration aims to bolster Intel's position in the market, particularly in AI datacenters and PC chips, following a significant market surge.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: collaboration",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Jose Mourinho Appointed Benfica Manager, Returns to Portugal After 21 Years",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 18 Sep 2025 14:42:50 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "ESPN",
      "Sportsnet",
      "Yahoo Sports",
      "The Guardian"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.theguardian.com",
      "www.bbc.com",
      "www.espn.com",
      "sports.yahoo.com"
    ],
    "snippets": [
      "Benfica appoint Jose Mourinho as their new manager on a deal until the summer of 2027.",
      "Jose Mourinho has returned to Portuguese football as coach of Benfica less than three weeks after being sacked by Fenerbahce.",
      "Benfica appointed Jose Mourinho as their coach on Thursday, with the Portuguese returning to work in his homeland 21 years after leaving Porto for Chelsea.&quot;It's been 25 years in which I've had the opportunity to work for the biggest clubs in the world,&quot; said Mourinho, of the time since he ",
      "<p>Benfica said on Thursday it reached a deal with Mourinho, sealing his return to the country 21 years after he led rival Porto to the Champions League title in 2004.</p>",
      "<ul><li><p>His contract to 2027 includes break clause this summer</p></li><li><p>Benfica play at Chelsea in Champions League</p></li></ul><p>José Mourinho has been confirmed as Benfica’s head coach on a contract until the summer of 2027, with a break clause at the end of this season. His fourth game"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/e467/live/cc849530-949e-11f0-84c8-99de564f0440.jpg",
    "titles": [
      "Mourinho appointed Benfica manager",
      "Mourinho returns to first coaching job at Benfica",
      "Mourinho appointed at Benfica as he returns to Portugal",
      "Jose Mourinho is back in Portugal to coach after reaching a deal with Benfica",
      "José Mourinho confirmed as Benfica manager and faces swift Chelsea return"
    ],
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.949,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.819,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Jose Mourinho has been appointed as Benfica's new manager on a contract until the summer of 2027, returning to Portuguese football 21 years after leaving Porto. This move comes shortly after his departure from Fenerbahce. Mourinho's contract includes a break clause this summer. His return marks a significant moment in his career, as he reflects on 25 years of coaching top clubs around the world.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "US Faces 70,000 Deaths by 2050 from Wildfire Pollution, Study Finds",
    "domain": "general",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Thu, 18 Sep 2025 15:00:22 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "New York Times",
      "Phys.org"
    ],
    "domains": [
      "www.theguardian.com",
      "www.nytimes.com",
      "phys.org"
    ],
    "snippets": [
      "<p>A separate research found that at the current rate of global heating, more than 70,000 people will die in the US by 2050</p><p>Smoke billowing from wildfires will cause a growing number of deaths around the world in the decades ahead as the planet continues to heat up, new research has found.</p>",
      "Pollution from fires, intensified by rising temperatures, is on track to become one of America’s deadliest climate disasters.",
      "Wildfires burning across Canada and the Western United States are spewing smoke over millions of Americans—the latest examples of ashy haze becoming a regular experience, with health impacts far greater than scientists previously estimated."
    ],
    "image_url": "https://i.guim.co.uk/img/media/af0ff28117d194286cf8d9f065d1ad4ad83e0264/421_0_4219_3374/master/4219.jpg?width=140&quality=85&auto=format&fit=max&s=f96f6368615edac97d792eef92381ce2",
    "titles": [
      "Wildfire smoke will kill nearly 1.4m each year by end of century if emissions not curbed – study",
      "Wildfire Smoke Will Kill Thousands More by 2050, Study Finds",
      "U.S. faces rising death toll from wildfire smoke, study finds"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.955,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.738,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "New research indicates that by 2050, over 70,000 people in the US could die due to the effects of global heating, with pollution from wildfires, exacerbated by rising temperatures, being a significant factor. This pollution is set to become one of America's deadliest climate disasters, as wildfires in Canada and the Western US already impact millions with hazardous smoke, indicating a trend where such health impacts are becoming increasingly severe and frequent.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: research",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "ABC Suspends Jimmy Kimmel, Sparks Political Controversy",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Thu, 18 Sep 2025 13:23:43 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "The Guardian",
      "New York Times"
    ],
    "domains": [
      "www.theguardian.com",
      "www.nytimes.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMiigFBVV95cUxNTFNfTDQtME41NW0xZUZNQjh6MHJVSEJPSFlEQXdpSTRLdnNXRVBna21CS0ZLdXRYMlM5N3pSMDlERkxFWjNmMG1iUWpWR2ZIVHU1QnNINUpoQXcxanVhamRpT082V05QVi1ldE1WaWNyTTdvWHYweTItM25rSkFjMXlHSWNfemhmWWc?oc=5\" target=\"_blank\">Jimmy Kimmel suspension spurs House Demo",
      "<a href=\"https://news.google.com/rss/articles/CBMid0FVX3lxTE9QbWlXcks2VTBwNEZKRnRTR3htRW1HMEh3NUYtNVVId0VwY3JodkdYQVBuNjFqV2pyeG9HMGQ0THQ5WWdIVDJrS0Q4NHRYNDNUOXdiTkgzekZiaFYyVTYwTkZuUkphbzhSLVRJQlpEa1lIakR6N0JB?oc=5\" target=\"_blank\">White House, Trump cheer ABC over Kimmel suspension: \"Jimmy is a si",
      "<p>US president says comedian ‘fired for lack of talent’; Democratic House leadership say Trump’s media official Brendan Carr should resign </p><ul><li><p><a href=\"https://www.theguardian.com/tv-and-radio/2025/sep/18/jimmy-kimmel-live-suspended-indefinitely-after-hosts-charlie-kirk-comments\">Full re",
      "President Trump has accused Britain of mounting a crackdown on political expression. But he welcomed the ABC network’s suspension of Jimmy Kimmel."
    ],
    "image_url": "",
    "titles": [
      "Jimmy Kimmel suspension spurs House Democratic leaders to demand FCC chair resign - Axios",
      "White House, Trump cheer ABC over Kimmel suspension: \"Jimmy is a sick freak!\" - Axios",
      "Trump claims Jimmy Kimmel suspension not a free speech issue as Democrats call for FCC chair to quit over ‘abuse of power’ – live",
      "Trump Hails Kimmel Suspension After Criticizing UK on Free Speech"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.923,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.721,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "ABC suspended Jimmy Kimmel, leading to mixed reactions. President Trump criticized the move as a crackdown on expression but welcomed the suspension. The White House and Trump praised ABC's decision, while Democratic House leadership called for the resignation of Trump's media official, Brendan Carr, citing the incident. The current status is that Kimmel has been indefinitely suspended following his comments, sparking a significant political and media response.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Three Arrested in UK for Allegedly Spying for Russia",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 18 Sep 2025 11:25:51 GMT",
    "source": "BBC",
    "sources": [
      "Financial Times",
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "www.ft.com",
      "www.bbc.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "The two men and a woman were all arrested in Grays, Essex, the Metropolitan Police says.",
      "Two men and a woman taken to London police station for questioning before being released on bail with conditions",
      "<p>Arrests follow counter-terrorism investigation into suspected National Security Act offences, Met police say</p><p>Two men and a woman have been arrested on suspicion of spying for Russia amid increasing alarm at the activities of Moscow’s intelligence services in the UK.</p><p>The Metropolitan p"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/f36e/live/271086b0-947e-11f0-9cf6-cbf3e73ce2b9.jpg",
    "titles": [
      "Three arrested on suspicion of spying for Russia",
      "UK police arrest three people on suspicion of spying for Russia",
      "Two men and a woman arrested in Essex on suspicion of spying for Russia"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.886,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.714,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Three individuals, two men and a woman, were arrested in Grays, Essex, as part of a counter-terrorism investigation for suspected National Security Act offenses, specifically for allegedly spying for Russia. Following their arrest by the Metropolitan Police, they were taken to a London police station for questioning and later released on bail with conditions. This action highlights growing concerns over the activities of Moscow's intelligence services in the UK.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Sault Ste. Marie, Hamilton Oshawa Port Authority to Develop Ontario Trade Corrid",
    "domain": "general",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Thu, 18 Sep 2025 15:23:27 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "CityNews"
    ],
    "domains": [
      "globalnews.ca",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "Sault Ste. Marie, Ont., and the Hamilton Oshawa Port Authority have signed a partnership to develop a trade corridor connecting northern and southern Ontario.",
      "Sault Ste. Marie, Ont., and the Hamilton Oshawa Port Authority have signed a partnership to develop a trade corridor connecting northern and southern Ontario. The corridor is expected to include integrated rail, highway, and marine links with extended-season service. The partners say the plan will b"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/92104388faa115837ead9579bf9df94533055d77423f343744b737ae653365f9.jpg?quality=65&strip=all",
    "titles": [
      "Northern, Southern Ontario to be connected with new trade corridor",
      "Trade corridor partnership connecting northern and southern Ontario announced"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.983,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.702,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Sault Ste. Marie and the Hamilton Oshawa Port Authority have agreed to develop a trade corridor between northern and southern Ontario. This corridor will feature integrated rail, highway, and marine links, aiming to provide extended-season service. This partnership intends to enhance trade efficiency across the region.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "McLaughlin-Levrone Breaks 40-Year 400m Record, Wins Gold at World Championships",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Thu, 18 Sep 2025 11:09:55 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Yahoo Sports"
    ],
    "domains": [
      "sports.yahoo.com",
      "www.espn.com"
    ],
    "snippets": [
      "Sydney McLaughlin-Levrone became the first woman in nearly 40 years to crack the 48-second barrier in the 400 meters, finishing in 47.78 in a historically fast race to claim gold at the world championships.",
      "Sydney McLaughlin-Levrone teased the possibility of running an extraordinary 400 metre double at her home 2028 Olympics after a sizzling world gold in the flat race Thursday silenced the doubters.The 26-year-old American is the world record holder and two-time Olympic gold medallist in the 400m hurd"
    ],
    "image_url": "",
    "titles": [
      "McLaughlin-Levrone dazzles in historic 400m win",
      "McLaughlin-Levrone mulls Olympic 400m double after silencing doubters"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.978,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.676,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Sydney McLaughlin-Levrone broke a nearly 40-year record by finishing the 400 meters in 47.78 seconds at the world championships, winning gold. This victory adds to her achievements as a world record holder and two-time Olympic gold medalist in the 400m hurdles. She hinted at competing in a 400m double at the 2028 Olympics.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UN Panel Accuses Israel of Genocide in Gaza; Israel Denies Claims",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Thu, 18 Sep 2025 13:53:57 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Washington Post",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.washingtonpost.com"
    ],
    "snippets": [
      "A UN inquiry may have declared that a genocide is being committed in Gaza, but can anyone make Israel stop?",
      "His move comes a day after a U.N. panel said Israel was committing genocide in Gaza. Israel rejected the findings, which echo those of a growing number of governments and rights groups."
    ],
    "image_url": "",
    "titles": [
      "Who can stop Israel’s genocide in Gaza?",
      "For the first time, Bernie Sanders calls Israel’s war in Gaza a genocide"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.953,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.66,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A UN panel concluded that Israel is committing genocide in Gaza, a finding Israel has rejected. This conclusion aligns with the views of several governments and human rights organizations. The current status is that the declaration has been made, but Israel disputes the findings.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Charlie Kirk Assassinated; Trump Blames Radical Leftists",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Thu, 18 Sep 2025 11:36:05 EDT",
    "source": "Phys.org",
    "sources": [
      "Ars Technica",
      "Phys.org"
    ],
    "domains": [
      "phys.org",
      "arstechnica.com"
    ],
    "snippets": [
      "After the Sept. 10, 2025, assassination of conservative political activist Charlie Kirk, President Donald Trump claimed that radical leftist groups foment political violence in the U.S., and \"they should be put in jail.\"",
      "President Trump's assertions about political violence ignore the facts."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/stop-violence.jpg",
    "titles": [
      "Right-wing extremist violence is more frequent and more deadly than left-wing violence—what the data shows",
      "Right-wing political violence is more frequent, deadly than left-wing violence"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.987,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.659,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "On Sept. 10, 2025, conservative activist Charlie Kirk was assassinated. Following this, President Trump accused radical leftist groups of inciting political violence in the U.S. and advocated for their imprisonment. Critics argue that Trump's claims disregard the actual facts surrounding political violence.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Ukrainian Drone Hits Gazprom Plant in Russia, Ignites Fire",
    "domain": "business",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-09-18T13:51:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Financial Times",
      "Deutsche Welle"
    ],
    "domains": [
      "www.ft.com",
      "www.dw.com"
    ],
    "snippets": [
      "A key Gazprom refinery in Russia's Bashkortostan region caught fire after a Ukrainian drone strike. The attack on one of Russia's largest plants — far from Ukraine — comes as fuel shortages grow Follow DW for the latest.",
      "Strikes hit electricity substations that power trains and locomotive depots"
    ],
    "image_url": "",
    "titles": [
      "Ukraine updates: Drones target key Russian refinery",
      "Russian drones target Ukraine’s railway network"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.952,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.652,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A Ukrainian drone strike ignited a fire at a major Gazprom refinery in Russia's Bashkortostan region, significantly distant from Ukraine. This incident at one of Russia's largest plants exacerbates existing fuel shortages. Additionally, the attack targeted electricity substations and locomotive depots, impacting train operations. Follow DW for ongoing updates.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Paulino Wins Silver in Women's 400m; McLaughlin-Levrone Sets 40-Year Record",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Thu, 18 Sep 2025 14:57:25 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Dominican Republic's Marileidy Paulino won silver with the third-fastest run of all time",
      "<ul><li><p>US runner takes title in 47.78 sec at World Championship</p></li><li><p>Botswana’s Busang Collen Kebinatshipi wins men’s 400m</p></li></ul><p>Sydney McLaughlin-Levrone ran the fastest women’s 400 metres in 40 years to claim world championship gold in 47.78 sec on Thursday and complete her"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/18/619f0f46-ecf2-45d8-9c8a-9591c9956ff9/gettyimages-2236093332-1.jpg",
    "titles": [
      "Sydney McLaughlin-Levrone wins 400m gold with world championship record, runs second-fastest time in history",
      "McLaughlin-Levrone runs fastest women’s 400m in 40 years to claim world gold"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.974,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.65,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Marileidy Paulino from the Dominican Republic won a silver medal in the women's 400m at the World Championships, marking the third-fastest run ever in this event. Sydney McLaughlin-Levrone from the US claimed gold with a time of 47.78 seconds, the fastest in 40 years. In the men's category, Busang Collen Kebinatshipi of Botswana secured the 400m title.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Bank of England Warns of Inflation Risk, Adjusts Debt Strategy",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 18 Sep 2025 14:03:19 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The Bank of England governor warns \"we're not out of the woods yet\" in terms of rising inflation.",
      "<p>Decision on government debt holdings could reduce market jitters and Treasury’s borrowing costs</p><ul><li><p><a href=\"https://bank%20of%20england%20slows%20quantitative%20tightening%20programme,%20and%20leaves%20uk%20interest%20rates%20on%20hold/\">Business live – updates</a></p></li></ul><p>The "
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/2d9e/live/f92b02e0-93b3-11f0-af04-cd07e8e3d1e7.jpg",
    "titles": [
      "UK not out of woods on inflation, says Bank of England as interest rates held",
      "Bank of England holds interest rates at 4% and slows scheme to sell stock of UK bonds"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.936,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.649,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Bank of England's governor has issued a warning about the ongoing risk of rising inflation, indicating that the situation remains challenging. In response, a decision on government debt holdings aims to ease market concerns and lower the Treasury's borrowing costs. This approach includes slowing down the quantitative tightening programme and maintaining current UK interest rates.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "SportsLine's Eric Cohen Predicts Week 3 NFL Game Outcomes",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Thu, 18 Sep 2025 14:50:17 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Bleacher Report"
    ],
    "domains": [
      "news.google.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "SportsLine expert Eric Cohen reveals his score predictions for every game on the Week 3 of the NFL schedule",
      "<a href=\"https://news.google.com/rss/articles/CBMifkFVX3lxTE9LUDlVWmdXd2tScE5OV0VvNW5SRnpKY2E1WXlTdmtRUVhEM0x4ckM1N2xlSk00dklEaXp2b2NrZ0RPbTBOQlBoeElJVi1BT3pQa1RnenU0OXNVaGwtWnRBbkJwUl9hcHJOc0RpeWdHMjZ4N0ZaZThfQkl3cWpfdw?oc=5\" target=\"_blank\">2025 NFL Week 3 Expert Picks</a>&nbsp;&nbsp;<font color=\"",
      "<a href=\"https://news.google.com/rss/articles/CBMiogFBVV95cUxPMnJ5V09uYnpmejI1UlVldEZpeExmajE1eTRyMWc2NHBpb3Q3UndNXzBTaHZHdThKRTB2aVdTanRoMjBxVWh1OF93aFpOdVVJZnRuNThsVE85RnJibXJtSkZXU05XU3o5SkdEWllXRXlYOUZ0Y01KdUdMMkhHVV9sdlY3SGh2SjNBajJsWWdsT1BvTmEyalJ4c1BWMDR2eGFxUWc?oc=5\" target=\"_blank\">6 NFL Ro"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/08/47f0f520-93a8-431f-89ea-f3b75b48568a/caleb-williams-bears-imagn-images-2.jpg",
    "titles": [
      "2025 Week 3 NFL score predictions, odds, picks today: Expert reveals exact scores for all 16 games",
      "2025 NFL Week 3 Expert Picks - Bleacher Report",
      "6 NFL Rookies That Already Look Like Draft Steals Entering Week 3 - Bleacher Report"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.972,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.649,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Eric Cohen from SportsLine has provided his score predictions for all the games in Week 3 of the NFL season. These predictions are intended to guide fans and bettors with insights on the outcomes of the upcoming games.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Arctic Sea Ice Hits 10th-Lowest Record at 1.78 Million Square Miles",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Thu, 18 Sep 2025 10:37:04 EDT",
    "source": "Phys.org",
    "sources": [
      "NASA",
      "Phys.org"
    ],
    "domains": [
      "www.nasa.gov",
      "phys.org"
    ],
    "snippets": [
      "With the end of summer approaching in the Northern Hemisphere, the extent of sea ice in the Arctic shrank to its annual minimum on Sept. 10, according to NASA and the National Snow and Ice Data Center. The total sea ice coverage was tied with 2008 for the 10th-lowest on record at 1.78 million square",
      "With the end of summer approaching in the Northern Hemisphere, the extent of sea ice in the Arctic shrank to its annual minimum on Sept. 10, according to NASA and the National Snow and Ice Data Center. The total sea ice coverage was tied with 2008 for the 10th-lowest on record at 1.78 million square"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/arctic-sea-ice-reaches.jpg",
    "titles": [
      "Arctic sea ice reaches annual low",
      "Arctic Sea Ice Reaches Annual Low"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.967,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.648,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "On September 10, the Arctic's sea ice reached its annual minimum, recording 1.78 million square miles. This measurement, confirmed by NASA and the National Snow and Ice Data Center, ties with 2008 as the 10th-lowest extent on record, highlighting ongoing changes in Arctic ice coverage.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Teens Charged in Cyberattack on London's TfL Linked to Scattered Spider Group",
    "domain": "technology",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 18 Sep 2025 14:32:17 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Verge"
    ],
    "domains": [
      "www.theverge.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The police say the hack caused \"significant disruption\" and \"millions in losses\" for TfL.",
      "Two teenagers have been charged in connection with a cyberattack against London&#8217;s public transportation network in August 2024. UK investigators believe the “network intrusion” that impacted Transport for London (TfL) last year was carried out by members of the Scattered Spider online criminal"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/a76c/live/e94482d0-9493-11f0-8e88-0f11af0637c1.jpg",
    "titles": [
      "Two teenagers charged over Transport for London cyber attack",
      "&#8216;Scattered Spider&#8217; teens charged over London transportation hack"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.946,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.644,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Two teenagers were charged for a cyberattack on London's Transport for London (TfL) in August 2024, causing significant disruption and financial losses. UK investigators attribute the attack to the Scattered Spider group, confirming its impact on TfL's operations.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Company to Add Manual Door Releases After Trapping Incidents",
    "domain": "business",
    "source_domain": "www.businessinsider.com",
    "location": "global",
    "published": "2025-09-18T10:19:21Z",
    "source": "Business Insider",
    "sources": [
      "TechCrunch",
      "Business Insider"
    ],
    "domains": [
      "techcrunch.com",
      "www.businessinsider.com"
    ],
    "snippets": [
      "Tesla does build its cars with a manual door release in case of emergencies, but owners have complained that these can be hard to find.",
      "Chief designer Franz von Holzhausen said Wednesday that the company is \"working on\" combining the electronic and manual door releases after owners have reported getting trapped."
    ],
    "image_url": "https://i.insider.com/62fe969cec781d001868bb04?format=jpeg",
    "titles": [
      "Tesla is redesigning its door handles after some parents reported children getting trapped inside",
      "Tesla is redesigning its door handles following safety probe, Bloomberg investigation"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.884,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.642,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Chief designer Franz von Holzhausen announced that the company plans to integrate electronic and manual door releases in response to reports of owners, including children and dogs, being trapped inside cars due to loss of 12 V power.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Lynx Overcome 17-Point Deficit to Beat Valkyries, Advance in WNBA Playoffs",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Thu, 18 Sep 2025 00:20:00 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "The 2025 WNBA postseason is underway, with the first round continuing Thursday.",
      "Minnesota advances, while Phoenix and New York head to a decisive Game 3"
    ],
    "image_url": "",
    "titles": [
      "WNBA playoff schedule: Mercury force Game 3, Lynx rally to sweep Valkyries",
      "Where to watch WNBA playoffs: Schedule, scores, TV channel as Lynx eliminate Valkyries, Mercury stay alive"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.781,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.636,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The 2025 WNBA playoffs are in progress, with Minnesota Lynx advancing after a comeback victory over the Golden State Valkyries, 75-74, overcoming a 17-point deficit. Napheesa Collier led the Lynx with 24 points, including a crucial go-ahead 18-footer. Meanwhile, Phoenix and New York will proceed to a decisive Game 3 in their series.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Meta Unveils $799 Ray-Ban Smart Glasses with Display at Connect 2025",
    "domain": "technology",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Thu, 18 Sep 2025 12:12:00 GMT",
    "source": "CNBC",
    "sources": [
      "TechCrunch",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "techcrunch.com"
    ],
    "snippets": [
      "Mark Zuckerberg on Wednesday unveiled the $799 Meta Ray-Ban Display glasses, the company's first consumer-ready glasses with a built-in display.",
      "Meta showed off its newest AI-powered smart glasses, which have a display and are controlled by a wristband, at Meta Connect 2025.",
      "The new smart glasses are geared toward runners, cyclists, and other athletes."
    ],
    "image_url": "",
    "titles": [
      "Mark Zuckerberg unveils $799 Meta Ray-Ban Display glasses",
      "Meta unveils new smart glasses with a display and wristband controller",
      "Meta unveils its new Oakley Meta Vanguard smart glasses for athletes"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.901,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.635,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Mark Zuckerberg introduced the $799 Meta Ray-Ban Display glasses, Meta's first consumer-ready smart glasses with a built-in display, at Meta Connect 2025. Zuckerberg, who frequently uses these glasses for sending text messages, especially through WhatsApp to his executives, described managing the company predominantly via text. The glasses are part of Meta's latest AI-powered technology and are controlled using a wristband.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Syrian-Israeli Border Security Talks Mediated by US Show Promise",
    "domain": "business",
    "source_domain": "www.ft.com",
    "location": "global",
    "published": "Thu, 18 Sep 2025 09:04:02 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times",
      "New York Times"
    ],
    "domains": [
      "www.ft.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "Ahmed al-Sharaa suggests talks may yield results in coming days",
      "Syrian and Israeli officials have been holding talks about security arrangements along their shared border as part of U.S.-mediated efforts to reset decades of hostility."
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Fac0eafdb-e298-4ab2-a1e8-a04aa63094a2.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Syria nears security deal with Israel, says president",
      "Syria’s President Says Border Deal With Israel Could Come ‘Within Days’"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.844,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.631,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Syrian and Israeli officials, mediated by the U.S., are discussing security arrangements along their border. Ahmed al-Sharaa indicated that these talks might produce results soon, aiming to ease long-standing tensions between the two nations.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Palestinians Flee Gaza Conflict; StubHub IPO Drops 6% Despite Milestone",
    "domain": "technology",
    "source_domain": "www.nytimes.com",
    "location": "global",
    "published": "Thu, 18 Sep 2025 09:56:11 +0000",
    "source": "New York Times",
    "sources": [
      "TechCrunch",
      "New York Times"
    ],
    "domains": [
      "www.nytimes.com",
      "techcrunch.com"
    ],
    "snippets": [
      "A single image captures the desperation of Palestinians in Gaza City who have once again grabbed what belongings they could and fled the fighting.",
      "Although StubHub's shares fell 6% in first day of trading, the IPO is testament to the co-founder's 25-year effort."
    ],
    "image_url": "https://static01.nyt.com/images/2025/09/17/world/oneimage-fleeing/oneimage-fleeing-mediumSquareAt3X.jpg",
    "titles": [
      "The Road",
      "Eric Baker’s long, winding road to taking StubHub public"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.877,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.63,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In Gaza City, Palestinians were seen fleeing the fighting, taking their belongings with them, highlighting ongoing conflict in the area. Meanwhile, despite a 6% drop in its shares on the first day, StubHub's IPO marks a significant milestone in the co-founder's 25-year journey in the business.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Macrons Sue Candace Owens for Defamation Over False Gender Claims",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 18 Sep 2025 05:01:55 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "They have filed a lawsuit against US right-wing influencer Candace Owens who claims the French first lady was born male.",
      "<p>French president and wife allege rightwing influencer Candace Owens is using defamatory attacks against them to boost media profile</p><p>The French president, Emmanuel Macron, and his wife plan to present scientific evidence to a US court to prove that Brigitte Macron was not born a man, the law"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/4650/live/5eb4f630-93ef-11f0-9cf6-cbf3e73ce2b9.jpg",
    "titles": [
      "Macrons to offer 'scientific evidence' to US court to prove Brigitte is a woman, lawyer says",
      "Macrons to submit scientific evidence to US court to prove Brigitte was not born a man"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.776,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.627,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "French President Emmanuel Macron and his wife, Brigitte, have filed a lawsuit against US right-wing influencer Candace Owens, accusing her of defamation. They allege Owens made false claims suggesting Brigitte was born male, using these attacks to enhance her media profile. The Macrons plan to present scientific evidence in a US court to refute these claims and prove Brigitte Macron's gender at birth.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Company Expands Free Users' Access to Any Song Worldwide",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 18 Sep 2025 05:33:26 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Yahoo Sports"
    ],
    "domains": [
      "www.nbcsports.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Think you can work out where's hotter and colder than you today? Find out by playing our game",
      "Nine months after suffering a torn ACL and meniscus in his right knee, Lions defensive tackle Alim McNeill says he could play right now if he had to."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/9457/live/a4b0d300-8366-11f0-ab3e-bd52082cd0ae.png",
    "titles": [
      "Play now",
      "Alim McNeill says he could play now, but Lions will be cautious as his knee heals"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.784,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.612,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "On Monday, a company announced that its free users worldwide can now search for and play any song of their choice, as well as play songs shared by friends or artists they follow on social media.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Susan Monarez Testifies RFK Jr. Pressured Her on Vaccine Stance, Staff Firings",
    "domain": "science",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Wed, 17 Sep 2025 18:17:35 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "Wired"
    ],
    "domains": [
      "www.wired.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMickFVX3lxTE80VTBScC0yZ3ZrVkcwU3l2QWI2LVdiaWgwaW8tYW1xTGhQU09TVGFhU2tqSWd3Vk1vMFNtRUpFbEp0Y2xuSlFNS001c1JGTW5yMDZGRWZJa25IdlM2TFAxYnF4NzVoQ0tCUkJ0Q0QwcExtZw?oc=5\" target=\"_blank\">Ex-CDC official says RFK Jr. pressured her to stay silent</a>&nbsp;&nbsp;",
      "Susan Monarez told a Senate committee that Robert F. Kennedy Jr. demanded she dismiss career officials without cause—and accept vaccine recommendations regardless of whether science backed them up."
    ],
    "image_url": "",
    "titles": [
      "Ex-CDC official says RFK Jr. pressured her to stay silent - Axios",
      "Fired CDC Director Says RFK Jr. Pressured Her to Blindly Approve Vaccine Changes"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.62,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.589,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Susan Monarez testified before a Senate committee that Robert F. Kennedy Jr. pressured her to fire career officials without cause and to accept vaccine recommendations without scientific support.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Article Content Needed for Accurate Headline Creation",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Thu, 18 Sep 2025 12:00:00 GMT",
    "source": "Bloomberg",
    "sources": [
      "Bloomberg"
    ],
    "domains": [
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMib0FVX3lxTE9OTWQ2U2NMRldKZ21BNmZhVUM4bEp1M1A2VEtsZXAxVWt5WGhIT3FYc29YRE9NWDQ4amdxU0FFYkV0aFJGcWZsVHg1a2F5cWNBQTlkQ2M2RVNKb19wdE1sTFZoa2tDTFlOOENDNTBuaw?oc=5\" target=\"_blank\">Where to Invest $100,000 Right Now</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Bloom",
      "<a href=\"https://news.google.com/rss/articles/CBMijgFBVV95cUxNLWlyNzloSW81NE5XQndEbVZTYmFvd0cxSkZwekFHVjdDQkdQWWMwOHdQc0dRMW5oSGxjZTVwYVFCNmQ4cHBSQi1OOEJzemZTLURZRVpmNnRSUWtNdzVSeGdfNmYtbXVNbE0yVlQ5eEwzQ3c4eG9jVGdTMTVxQWFLOHZ5bDZDNElMQXE0ZWJ3?oc=5\" target=\"_blank\">Which Premium Credit Card is Right "
    ],
    "image_url": "",
    "titles": [
      "Where to Invest $100,000 Right Now - Bloomberg.com",
      "Which Premium Credit Card is Right For You? - Bloomberg.com"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.897,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.447,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "This summary cannot be generated as the provided links lead to unspecified articles, and without specific content from these articles, it's impossible to create an accurate and objective summary. Please provide the key details or conclusions from the articles for a summary to be crafted.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]