[
  {
    "title": "Renowned Primatologist Jane Goodall Dies at 91",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Wed, 01 Oct 2025 14:28:16 -0400",
    "source": "NPR",
    "sources": [
      "CityNews",
      "NPR",
      "Deutsche Welle",
      "Forbes",
      "Al Jazeera",
      "The Guardian"
    ],
    "domains": [
      "www.forbes.com",
      "www.npr.org",
      "www.aljazeera.com",
      "www.theguardian.com",
      "www.dw.com",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "Jane Goodall, primatologist who transformed our understanding of the lives of apes, has died, according to an announcement from the Jane Goodall Institute.",
      "The Jane Goodall Institute says famed primatologist died in California during US speaking tour.",
      "The Jane Goodall Institute said the renowned chimpanzee researcher died of natural causes at the age of 91.",
      "<p>Jane Goodall Institute says ‘tireless advocate’ for natural world died in California during US speaking tour</p><p>The world-renowned primatologist Jane Goodall has died at the age of 91, her institute has said.</p><p>The Jane Goodall Institute announced that she had died of natural causes while ",
      "Goodall is best known for her groundbreaking research into chimpanzee behavior and customs.",
      "Dr. Jane Goodall, one of the world&#8217;s most beloved animal behaviorists and a pioneer in primatology has died at the age of 91, the Jane Goodall Institute confirmed Wednesday. The British scientist, best known for her groundbreaking work with chimpanzees in Tanzania&#8217;s Gombe Stream National"
    ],
    "image_url": "",
    "titles": [
      "Jane Goodall, legendary primatologist, has died at age 91",
      "Jane Goodall, conservationist and chimpanzee expert, dies aged 91",
      "Primatologist Jane Goodall has died at the age of 91, her institute has said",
      "Jane Goodall, world-renowned primatologist, dies aged 91",
      "Jane Goodall Institute Says Legendary Ethologist Is Dead At 91",
      "Renowned primatologist Dr. Jane Goodall dead at 91"
    ],
    "score_components": {
      "magnitude": 0.986,
      "recency": 0.888,
      "consensus": 1.0,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.858,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Jane Goodall, the celebrated primatologist known for her pioneering research on chimpanzee behavior, has died at the age of 91. The Jane Goodall Institute announced she passed away of natural causes during a speaking tour in the US. Goodall, a British scientist, transformed our understanding of apes and was a tireless advocate for the natural world.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: research",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Israeli Navy Stops Flotilla Near Gaza; Red Cross Halts Gaza Activities",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Wed, 01 Oct 2025 16:12:53 -0400",
    "source": "NPR",
    "sources": [
      "Al Jazeera",
      "NPR",
      "Deutsche Welle",
      "BBC"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.bbc.com",
      "www.npr.org",
      "www.dw.com"
    ],
    "snippets": [
      "The Global Sumud Flotilla, with Greta Thunberg, Nelson Mandela's grandson and European lawmakers aboard, includes some 50 boats and 500 activists and is carrying a symbolic amount of humanitarian aid.",
      "Climate activist Greta Thunberg is among activists on the Global Sumud Flotilla being taken to an Israeli port.",
      "Activists on the Global Sumud Flotilla shared a video they said showed Israeli vessels intercepting the fleet.",
      "The Israeli Navy intercepted the Global Sumud Flotilla from advancing to the Gaza coast. Meanwhile, the Red Cross says Israel's offensive has \"forced\" it to pause activities in Gaza City. DW has more."
    ],
    "image_url": "",
    "titles": [
      "Activists say Israel's navy has begun intercepting a Gaza-bound aid flotilla",
      "Israeli naval ships intercept Gaza-bound flotilla",
      "Israel begins to intercept Global Sumud Flotilla vessels",
      "Middle East: Israel intercepts Gaza aid flotilla"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.921,
      "consensus": 0.908,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.815,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Israeli Navy intercepted the Global Sumud Flotilla, which was heading towards the Gaza coast. The flotilla had entered what it described as a \"high-risk zone.\" Following the interception, the Red Cross announced a pause in its activities in Gaza City due to Israel's offensive. This development was reported by activists on the flotilla and covered by DW.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Supreme Court Blocks Trump's Bid to Dismiss Fed's Cook Amid Fraud Claims",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Wed, 01 Oct 2025 16:33:34 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Axios",
      "Financial Times",
      "LA Times",
      "Al Jazeera",
      "CNBC"
    ],
    "domains": [
      "news.google.com",
      "www.latimes.com",
      "www.cnbc.com",
      "www.aljazeera.com",
      "www.ft.com"
    ],
    "snippets": [
      "High court to hear arguments in January on whether Cook will lose her job but says she may stay in her post until then.",
      "<a href=\"https://news.google.com/rss/articles/CBMia0FVX3lxTFA2cnJlZ3pzUFl1b3Z0MXdHbFJzN2o3UndHdEFwb0pUVmg3dTd5ZU5pSnYtVnRVSWtMRWh6VXFYbHN0VFh0SFgwV1VnT1MzLUwtaVpjYjk3cjVMcVVPNEZoOTRITWVBWkNsOXRn?oc=5\" target=\"_blank\">Supreme Court says Fed governor Cook can remain in job pending arguments</a>&nbsp;&",
      "President Donald Trump has sought to fire Federal Reserve Governor Lisa Cook, citing claims that she committed mortgage fraud in connection with two homes.",
      "Justices defer decision on president’s bid to sack central banker until January 2026",
      "<p>If Trump can oust Lisa Cook, he could have majority control of the Federal Reserve.</p>"
    ],
    "image_url": "",
    "titles": [
      "Supreme Court temporarily blocks Fed Governor Cook firing",
      "Supreme Court says Fed governor Cook can remain in job pending arguments - Axios",
      "Supreme Court lets Fed Governor Lisa Cook keep job pending January oral argument",
      "Supreme Court blocks Trump from immediately firing Fed’s Lisa Cook",
      "Supreme Court puts off decision on whether Trump may fire Federal Reserve Governor Lisa Cook"
    ],
    "score_components": {
      "magnitude": 0.984,
      "recency": 0.853,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.814,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Supreme Court has temporarily halted President Trump's attempt to dismiss Federal Reserve Governor Lisa Cook, amidst allegations of mortgage fraud. This decision preserves the central bank's independence for now and marks a significant moment as it's the first instance of a president attempting to fire a Fed official. Cook will maintain her position pending further court deliberations.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "US Faces Government Shutdown Amid Failed Party Negotiations",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 01 Oct 2025 18:25:22 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Axios",
      "MarketWatch",
      "Bloomberg",
      "The Guardian"
    ],
    "domains": [
      "news.google.com",
      "www.bbc.com",
      "www.theguardian.com",
      "www.marketwatch.com"
    ],
    "snippets": [
      "At some point, public pressure and political pain will see one side yield to bring this latest US government shutdown to an end.",
      "<a href=\"https://news.google.com/rss/articles/CBMikAFBVV95cUxOQjIyY0NZSTlTM0RUaDFLbWFUUFRxMmRxdmt5a2V4bW5aNFIwRTZmeHo0dEo0MEhQeVZ5cWtDYThhM2tLdjVyYnFNemJKM29ha29Hczh0V0xlbjV3TFUwQ0xmY1hXSXR6R0NqZlpfSnNFM2dBcGRXd0NDclhYUThkbUNkZ3ViTkFVQ1Q3ZFBxcTk?oc=5\" target=\"_blank\">The seven Democratic senators wh",
      "<a href=\"https://news.google.com/rss/articles/CBMikAFBVV95cUxPSmo1bGlBQjhwYmIwQnEtWHZhcmUycEJLUzU5TGpLaFpJQmN5WExKZWJzd2RuZi02VTI2M1VhQnlFNmV4OVdra0V2eVVUSkNKenFma2d4QzJfT0JGV0hlby1sYmtZRE1yU0NjYjVXRmpwckVEVHFQQkM1RlFub1pLOHdVMnVLV2o0Tl9RRk1Kb2s?oc=5\" target=\"_blank\">How the government shutdown coul",
      "<a href=\"https://news.google.com/rss/articles/CBMid0FVX3lxTE01UGNibVdPTktuZVRPNmt1OE1WbTNnUm5uVW5XR1NnVERQWWhUWnd6SldNVDJ4ajZsU2ZmbXp4Mmk3c0tfV29mMmhVaHJOVHpYMmlkUDFaR2Rrdld3RGlHTkhtWl9NXzNaMmlxS1RvUllrM1ZLT1Nr?oc=5\" target=\"_blank\">Democrats take the fight to Trump on government shutdown</a>&nbsp;&",
      "<a href=\"https://news.google.com/rss/articles/CBMimwFBVV95cUxNc3FTdjJNd1ZmUGRNSnNldl9DNGhtem8tSHNrRnZjOGlEODdicEdBTFUxY0tGT0psUGl1X0w0V3gyMHVwTlVRbXA2MkpoWVMxWDdNOUxhb2liS0NMWDliT2Z5V0tRYkh3OFFSOWN1ZFhrNkJzRk5HVG11QUpULXRvRTVZOE1DUEhmaDRJX0Y1UkFWZ0JubkFpZjlVOA?oc=5\" target=\"_blank\">How the federal g",
      "<a href=\"https://news.google.com/rss/articles/CBMihAFBVV95cUxNZWs1VTJ6cXZPcWNldWwzYWd1UkNPbmkxTWxnOHRGemZKZXh2YktHTENmS1d5c1R5RnZxWEt3a1BQU002X2poU3l2aV9EbWNEc1dUYUVfbzBuQ0RHSDhqYVpXNmxkQVM0VlF4V0otZXRZNFcxZzJ2V1hoaVN1RVFmZEFsbnU?oc=5\" target=\"_blank\">Federal government shutdown begins after Congres",
      "<a href=\"https://news.google.com/rss/articles/CBMigAFBVV95cUxPc2FrNE5HdEtPQXE1VmkwSHJMWU5ySzFMLVZrclluZkFTd1FLX04tQlhWMlJlRWVBclpVeC04cHBONHR4NjJTZHJmYlA4T0duNWdfOE9ZMkZGc0wyV0IxNmxud01SOTJDcmc0V2cxazhiRDZTSlFpUDlyS2ZrMEdhVA?oc=5\" target=\"_blank\">House Democrat rages against his own party on the gov",
      "<p>After weeks of threats from both sides and negotiations that went nowhere, the US is once again experiencing a government shutdown. This week, Jonathan Freedland speaks to Marianna Sotomayor, a congressional reporter at the Washington Post, to look at who should take the blame, who suffers, and w",
      "<a href=\"https://news.google.com/rss/articles/CBMimAFBVV95cUxOZEY2THVMcW5BREdYSml2YXp2dWlOamVnc0twN2NTVFJLNmlCN0tjelFEYjZBeEtfWnZWdW9BSzlZbEFPTl9IcUtIUUFZYUl1ZmlIQkZPNmpYUEZ1b0pVUEdydHVVYUp3Qkg3VWVxRDN1WDlhNkJPY29sUXNYOVAzdS15X1dPM0dheS05TEs4bVl0ZjRrMmcyaw?oc=5\" target=\"_blank\">Another US Government",
      "The threat of mass layoffs makes this shutdown different, and the “reductions in force” could start in a day or two."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/843d/live/f62328b0-9ef9-11f0-92db-77261a15b9d2.jpg",
    "titles": [
      "Four ways US government shutdown could end",
      "The seven Democratic senators whose votes could be key to ending the government shutdown - Axios",
      "How the government shutdown could disrupt daily life - Axios",
      "Democrats take the fight to Trump on government shutdown - Axios",
      "How the federal government shutdown will impact Arizona - Axios",
      "Federal government shutdown begins after Congress fails to act - Axios",
      "House Democrat rages against his own party on the government shutdown - Axios",
      "US government shutdown: now what? – podcast",
      "Another US Government Shutdown Is Here. Why It Keeps Happening - Bloomberg.com",
      "How much could the government shutdown cost? These numbers show the potential economic hit."
    ],
    "score_components": {
      "magnitude": 0.984,
      "recency": 0.869,
      "consensus": 0.975,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.812,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The US is experiencing another government shutdown after negotiations between parties failed. Public pressure and political dynamics suggest one side may eventually yield to end the deadlock. This shutdown is marked by the threat of mass layoffs, with potential \"reductions in force\" starting imminently. The situation remains unresolved, impacting various sectors and government functions.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Oktoberfest Reopens After Closure Due to Bomb Threat Linked to Domestic Dispute",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-10-01T14:42:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "CityNews",
      "Deutsche Welle",
      "New York Times",
      "Washington Post",
      "The Guardian"
    ],
    "domains": [
      "www.nytimes.com",
      "www.washingtonpost.com",
      "www.theguardian.com",
      "www.dw.com",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "Explosions and a fire at a detached house in northern Munich triggered a large police response. The suspect was found injured and later died, but authorities found no link or threat to the Oktoberfest beer festival.",
      "Germany's world-famous Oktoberfest beer festival was closed to visitors for much of Wednesday, following a house fire and suspected suicide with a potential link to the event. DW has more.",
      "<p>Beer festival had closed after 57-year-old man shot parents, set house on fire, and left note mentioning event</p><p>A German man went on a deadly gun, explosives and arson rampage against his family and then killed himself on Wednesday, prompting security fears in Munich that closed the world-fa",
      "Hours after a written threat, by a suspect who killed himself, authorities said the beer celebration would reopen after a search of the grounds found no explosives.",
      "The German authorities said the decision to close the festival grounds was taken after an earlier explosion in a residential area of the city that appeared linked to a domestic dispute.",
      "MUNICH (AP) — The Oktoberfest fairgrounds closed for several hours Wednesday as police conducted a security sweep of the famed beer festival due to a bomb threat by a suspect linked to an explosion across town in northern Munich. Police in Bavaria, the state where Munich is located, said the suspect"
    ],
    "image_url": "",
    "titles": [
      "Oktoberfest back on after Munich bomb scare",
      "Germany news: Oktoberfest reopens after Munich bomb scare",
      "Munich Oktoberfest reopens after man’s deadly arson attack and bomb threat",
      "Oktoberfest in Munich cleared to reopen after bomb threat",
      "Bomb Threat Delays Oktoberfest in Munich",
      "Police say Oktoberfest reopens after a security sweep due to a bomb threat"
    ],
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.821,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.793,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Oktoberfest beer festival in Munich, Germany, was temporarily closed due to a bomb threat linked to an explosion and fire in a residential area, suspected to be connected to a domestic dispute. The threat came from a suspect who later committed suicide. After a thorough security sweep of the festival grounds revealed no explosives, authorities announced the event would reopen on Wednesday evening. The closure was a precautionary measure to ensure public safety.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "49ers to Play Rams Without Purdy, Pearsall, Jennings Due to Injuries",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Wed, 1 Oct 2025 19:24:03 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "Brock Purdy, Ricky Pearsall and Jauan Jennings are out for the Niners on Thursday against the Rams.",
      "Purdy will miss his third game this season due to a toe injury",
      "<p>The San Fransicso 49ers&#8217; offence will be severely shorthanded for a divisional matchup with the Los Angeles Rams on Thursday.</p>"
    ],
    "image_url": "",
    "titles": [
      "Niners rule out Purdy, Pearsall, Jennings for TNF",
      "49ers injuries: QB Brock Purdy, WRs Ricky Pearsall, Jauan Jennings out for 'Thursday Night Football' vs. Rams",
      "49ers’ Purdy, Pearsall, Jennings all out vs. Rams"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.984,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.758,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The San Francisco 49ers will face the Los Angeles Rams without key offensive players Brock Purdy, Ricky Pearsall, and Jauan Jennings. Purdy is sidelined for his third game this season due to a toe injury, impacting the team's offense for the upcoming divisional matchup.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Jane Goodall, Celebrated Primatologist, Dies at 91",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 01 Oct 2025 22:47:06 GMT",
    "source": "BBC",
    "sources": [
      "Business Insider",
      "BBC",
      "Phys.org"
    ],
    "domains": [
      "www.bbc.com",
      "phys.org",
      "www.businessinsider.com"
    ],
    "snippets": [
      "Dr Goodall was a world-leading expert on chimpanzees and a renowned conservationist.",
      "Jane Goodall's powers of observation revealed facts scholars had overlooked for years. She died at 91 on October 1.",
      "British primatologist Jane Goodall, who transformed the study of chimpanzees and became one of the world's most prominent wildlife advocates, has died at the age of 91, her institute announced Wednesday."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/0031/live/f07cc970-9f08-11f0-928c-71dbb8619e94.jpg",
    "titles": [
      "Conservationist Dame Jane Goodall dies aged 91",
      "Jane Goodall, chimpanzee researcher and conservationist, is dead at 91",
      "Renowned British chimpanzee expert Jane Goodall dies at 91"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.951,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.737,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Renowned British primatologist and conservationist Jane Goodall, celebrated for her groundbreaking research on chimpanzees and advocacy for wildlife, passed away at the age of 91 on October 1, as announced by her institute.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: research",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Eric Dier's Late Penalty Secures 2-2 Draw for Monaco Against Man City",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 01 Oct 2025 21:19:07 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC",
      "Sky Sports"
    ],
    "domains": [
      "www.bbc.com",
      "www.theguardian.com",
      "www.skysports.com"
    ],
    "snippets": [
      "Former Tottenham Hotspur defender Eric Dier wins a dramatic late penalty before converting to seal a 2-2 draw for Monaco against Manchester City in the Champions League.",
      "<p>It had been a subdued night in Monaco, with Manchester City sleepwalking to victory until Nico González kicked Eric Dier in the face in a failed attempt to defend a free-kick. Chaos ensued with a melee as City lost their cool and the chance of a perfect Champions League start, before Dier calmly ",
      "Manchester City's awayday blues haunted them again as Monaco snatched a late 2-2 draw in their Champions League league phase clash through Eric Dier's controversial late penalty."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/f77f/live/936f2a60-9f0e-11f0-928c-71dbb8619e94.jpg",
    "titles": [
      "Late Dier penalty helps Monaco snatch draw against Man City",
      "Late Dier penalty for Monaco pegs back Manchester City after Haaland double",
      "Wasteful Man City held by Monaco after controversial late penalty"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.923,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.728,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Eric Dier, a former Tottenham Hotspur defender, secured a 2-2 draw for Monaco against Manchester City in the Champions League by winning and converting a dramatic late penalty. The match turned chaotic after Nico González's failed attempt to clear a free-kick resulted in him kicking Dier in the face, leading to a melee. This incident prevented Manchester City from achieving a perfect start in the competition.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Arsenal Beats Olympiakos 2-0, Maintains Perfect Season Start",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 01 Oct 2025 21:15:52 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC",
      "Sky Sports"
    ],
    "domains": [
      "www.bbc.com",
      "www.theguardian.com",
      "www.skysports.com"
    ],
    "snippets": [
      "Goals from Gabriel Martinelli and Bukayo Saka help Arsenal continue their perfect start to the Champions League season as the Gunners secure a 2-0 victory against Olympiakos.",
      "<p>They like to talk about invincibility in this part of north London and it remains the only way to describe Mikel Arteta’s record with Arsenal in European group‑phase games at the Emirates Stadium. It is now eight wins out of eight in the Champions League with zero goals conceded. And if you add i",
      "Arsenal made it two wins out of two in the Champions League as Bukayo Saka&#8217;s stoppage-time goal sealed a 2-0 victory over Olympiakos at the Emirates Stadium."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/8b42/live/806e3180-9f0a-11f0-b741-177e3e2c2fc7.jpg",
    "titles": [
      "Martinelli and Saka lead Arsenal to victory against Olympiacos",
      "Martinelli and Saka on the money as Arsenal sweep Olympiakos aside",
      "Odegaard shines as Saka strike seals 'dynamic' Arsenal win over Olympiakos"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.921,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.728,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Arsenal secured a 2-0 win against Olympiakos in the Champions League, with goals from Gabriel Martinelli and Bukayo Saka. This victory maintains Arsenal's perfect start to the season, making it two wins from two games. It also continues Mikel Arteta's flawless record in European group-phase games at the Emirates Stadium, with eight wins and no goals conceded.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Week 5 Fantasy Football: QB Start/Sit Recommendations Plus TE & RB Tips",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Wed, 01 Oct 2025 21:54:06 +0000",
    "source": "CBS Sports",
    "sources": [
      "Yahoo Sports",
      "Sports Illustrated",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "news.google.com",
      "touchdownwire.usatoday.com"
    ],
    "snippets": [
      "Running backs you want in Week 5 lineups and those you should avoid",
      "Which NFL defenses should you start and which should you sit on your fantasy football team during Week 5?",
      "Which kickers you should start and which you should sit in your fantasy football league in Week 5.",
      "Tight end continues to be one of the most unpredictable yet crucial fantasy football positions, and Week 5 is no different.",
      "<a href=\"https://news.google.com/rss/articles/CBMinwFBVV95cUxQVHlZaGhBeldtNXI3aTZ3ZW1MX2l2emFRbE9XT042ZE5WVW5Kel9HSFBodTdxRHg2TE9rN3FSdTNqX2Y2LXA2Wi13T2xNTENpbHNSSHJ4U3VoaHh1SzhlUENOSGdWU0gwX2wxYkFwNVRlcDNDQVltYXdXb01qb1BLbktWNE5FRE1KWlJYamFMMmRLeWtINjdnOFdlX3J5eWc?oc=5\" target=\"_blank\">Defense & Ki",
      "<a href=\"https://news.google.com/rss/articles/CBMinAFBVV95cUxORXpxY09rUjFpdnlXaEhFRnEwNFFva1h4LUVucjNxT3M3dV9mTVNhd2VYVllCWEVjd0loYV8wSzlyNVRzMUxMU0x1b29KZnRRc091UnhROVJGUmNBazdfcUxkbjZZdDVLX0dmMUU0VjFqeEhWbFhXZEgycndUZHpRNzlWQ2tYM09fc2ZrLVd3SktPZElOdGlBenRaSkQ?oc=5\" target=\"_blank\">Running Back Sta",
      "<a href=\"https://news.google.com/rss/articles/CBMimAFBVV95cUxOSXVFam5vQVJOXzRtV25DTEN4WWpLYWdqVHdwcTNfdnAxWTRFQXdhOC1JZk1aZ0ZNNEVDQ2JzNHFQa1pkR0I5ZTJMalZGUm14a0h1MXpNdXRjd2xzVndQOW9UVURwVWxSUHp6Smo4R0M4c3IzdjhHdUFGLUtZNXBCUGRVbTZRR2V5OWl6aHRsckpyTW5HNVV3Mg?oc=5\" target=\"_blank\">Tight End Start 'Em, "
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/22/b3cad7d0-ed33-4400-9e5b-ed4ee20d4ab4/cam-skattebo-getty.jpg",
    "titles": [
      "Fantasy Football Week 5 Start 'Em & Sit 'Em Running Backs: Cardinals, Bucs, Panthers injuries change landscape",
      "Fantasy Football Start 'Em, Sit 'Em Week 5: Defense Edition",
      "Fantasy Football Start 'Em, Sit 'Em Week 5: Kicker Edition",
      "Fantasy Football Start 'Em, Sit 'Em Week 5: TE Edition",
      "Defense & Kicker Start 'Em, Sit 'Em For Fantasy Football Week 5 - Sports Illustrated",
      "Running Back Start 'Em, Sit 'Em For Fantasy Football Week 5 - Sports Illustrated",
      "Tight End Start 'Em, Sit 'Em For Fantasy Football Week 5 - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.953,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.727,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "In Week 5 fantasy football lineups, certain quarterbacks are recommended starts, while others are advised to be avoided, according to multiple news sources. Additionally, advice is provided for tight end and running back positions, indicating who to start or bench. The specific players to target or avoid were not listed in the provided content.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Three Arrested in Berlin for Alleged Plot Against Jewish Targets",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Wed, 01 Oct 2025 18:19:42 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Washington Post",
      "Al Jazeera",
      "Deutsche Welle"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.dw.com",
      "www.washingtonpost.com"
    ],
    "snippets": [
      "The men are suspected of of being &#039;foreign operatives&#039; for Hamas and will appear in court Thursday, prosecutors say.",
      "Authorities said two Germans and one Lebanese national had procured weapons to be used in violent acts targeting Israeli or Jewish institutions in Germany.",
      "Police seized weapons and ammunition while arresting the three men in Berlin, Germany’s federal prosecutor’s office said."
    ],
    "image_url": "",
    "titles": [
      "Germany arrests three men suspected of targeting Jewish institutions",
      "Germany arrests 3 suspected Hamas members",
      "Germany arrests three suspected Hamas members in plot to attack Jews"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.885,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.721,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Two Germans and one Lebanese national, suspected of being Hamas operatives, were arrested in Berlin for planning violent acts against Israeli or Jewish institutions in Germany. Authorities seized an AK-47, pistols, and ammunition. They are set to appear in court Thursday, according to prosecutors.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Pope Leo XIV Criticizes Climate Change Skeptics, Echoes Francis's Concerns",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 01 Oct 2025 16:58:20 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC",
      "New York Times"
    ],
    "domains": [
      "www.bbc.com",
      "www.theguardian.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "In his first major statement on climate change, the pontiff criticises those who minimise climate change.",
      "The pope invoked his predecessor, Francis, for whom the environment was a core issue, but stopped short of criticizing world leaders dismissive of climate change.",
      "<p>Pontiff laments that some ‘ridicule those who speak of global warming’, days after Trump’s claims of ‘con job’</p><p>Pope Leo XIV has taken aim at people who “ridicule those who speak of global warming” as he embraced Pope Francis’s environmental legacy and made it his own in some of his stronges"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/db01/live/edb94e60-9ee1-11f0-98b1-59d49dad95e6.jpg",
    "titles": [
      "Pope Leo condemns climate change critics",
      "Pope Leo Calls for Unity on Climate at a Divided Moment",
      "‘Listen to the cry of the Earth’: Pope Leo takes aim at climate change sceptics"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.843,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.705,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Pope Leo XIV criticized individuals who minimize or ridicule the issue of climate change, aligning with his predecessor Pope Francis's emphasis on environmental concerns. This statement came shortly after President Trump dismissed global warming as a \"con job.\" The Pope did not directly criticize world leaders but expressed concern over the dismissal of climate change discussions.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UK Orders Apple for iCloud Access Again Amid Privacy Dispute",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 01 Oct 2025 14:26:29 GMT",
    "source": "BBC",
    "sources": [
      "Financial Times",
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.theguardian.com",
      "www.ft.com"
    ],
    "snippets": [
      "It is the latest development in a privacy row which has pitted the UK against the tech giant and the Trump administration.",
      "Order issued in September comes after Trump administration said London had backed down in fight over encryption",
      "<p>New access order by Home Office would seek access to the tech company’s encrypted cloud backups</p><p>The UK government has renewed its confrontation with Apple over <a href=\"https://www.theguardian.com/technology/2025/feb/07/uk-confronts-apple-with-demand-for-cloud-backdoor-to-users-encrypted-da"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/6c43/live/45f4f830-9eca-11f0-8281-d137a399b095.jpg",
    "titles": [
      "Government issues new data demand for UK Apple users",
      "UK makes new attempt to access Apple cloud data",
      "UK government resumes row with Apple by demanding access to British users’ data"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.799,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.704,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The U.K. Home Office has issued a second order for access to Apple users' encrypted iCloud backups, following a failed attempt earlier this year. This action is part of an ongoing privacy dispute involving the UK, the tech giant, and the Trump administration. The controversy escalated after the Trump administration claimed that London had conceded in a battle over encryption.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "6.9 Earthquake in Philippines Kills 60, Injures 140 in Cebu and Bogo",
    "domain": "general",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Wed, 01 Oct 2025 15:42:47 GMT",
    "source": "The Guardian",
    "sources": [
      "Washington Post",
      "The Guardian",
      "New York Times"
    ],
    "domains": [
      "www.theguardian.com",
      "www.nytimes.com",
      "www.washingtonpost.com"
    ],
    "snippets": [
      "<p>More than 700 aftershocks recorded while rescuers search for casualties in coastal city of Bogo</p><p>Rescuers in the Philippines combed through rubble and mud after the deadliest earthquake in more than a decade killed at least 69 people, with patients overwhelming hospitals on the island of Ceb",
      "A 6.9-magnitude earthquake struck the central Philippines, damaging numerous businesses and leaving towns without power. Casualty numbers are expected to rise.",
      "The 6.9-magnitude earthquake shook the province of Cebu, killing at least 69 people and injuring more than 150. Heavy rainfall has hampered rescue efforts."
    ],
    "image_url": "https://i.guim.co.uk/img/media/9c1cba601e3a57b1545419a6bd406cb035ce4e0f/408_0_2500_2000/master/2500.jpg?width=140&quality=85&auto=format&fit=max&s=fd5e030becb8499f9a24ab32e6e9e223",
    "titles": [
      "Philippines earthquake death toll rises to at least 69 as Cebu hospitals struggle",
      "Powerful earthquake in central Philippines kills at least 69",
      "Earthquake in Philippines Kills Dozens, Officials Say"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.821,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.701,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A magnitude 6.9 earthquake hit central Philippines, affecting the province of Cebu and the coastal city of Bogo, resulting in at least 60 deaths and over 140 injuries, according to a civil defence official. The quake caused widespread power outages, building and road damage, and hampered rescue operations due to heavy rainfall. Rescuers continue to search for survivors amidst the debris.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Seven Men Sentenced in Rochdale Child Abuse Case",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 01 Oct 2025 12:52:11 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC",
      "New York Times"
    ],
    "domains": [
      "www.bbc.com",
      "www.theguardian.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "Two girls were repeatedly raped and assaulted from the age of 13 in the Greater Manchester town.",
      "Seven men in all were sentenced on Wednesday over their roles in a decades-old national scandal in Britain involving child sexual abuse.",
      "<p>Six other men sentenced to terms of up to 29 years after two girls treated as ‘sex slaves’ from the age of 13 </p><p>Seven men who groomed two vulnerable teenage girls in Rochdale and treated them as “sex slaves” have been jailed for between 12 and 35 years.</p><p>The ringleader, Mohammed Zahid, "
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/2076/live/e2ba9430-9ed0-11f0-b741-177e3e2c2fc7.jpg",
    "titles": [
      "Rochdale grooming gang ringleader jailed for 35 years",
      "U.K. ‘Grooming Gang’ Leader Sentenced to 35 Years for Rape",
      "Ringleader of Rochdale grooming gang jailed for 35 years for rape and abuse"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.774,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.692,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Seven men were sentenced for grooming and sexually abusing two teenage girls in Rochdale, Greater Manchester, starting when the victims were 13. The sentences ranged from 12 to 35 years, with Mohammed Zahid identified as the ringleader. This case is part of a larger national scandal in Britain concerning child sexual abuse.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Big Ten Seeks $2 Billion in Capital with 10-Year Rights Extension Deal",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Wed, 1 Oct 2025 19:24:03 EST",
    "source": "ESPN",
    "sources": [
      "Yahoo Sports",
      "ESPN"
    ],
    "domains": [
      "nittanylionswire.usatoday.com",
      "www.espn.com"
    ],
    "snippets": [
      "The Big Ten is in talks about a private capital deal, which includes a 10-year grant of rights extension through 2046, that would infuse at least $2 billion into the league and its schools, sources told ESPN.",
      "The Big Ten is working on securing a massive new private capital deal that will provide financial security for years to come. But who is investing?"
    ],
    "image_url": "",
    "titles": [
      "Sources: Big Ten mulling $2B private capital deal",
      "Big Ten working on new private capital deal with private investor"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.984,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.677,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Big Ten is negotiating a deal involving a 10-year rights extension through 2046, aiming to secure at least $2 billion in private capital for the league and its schools. The identity of the investors has not been disclosed.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Las Vegas, Phoenix Vie for 2025 WNBA Title Starting Friday",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Wed, 1 Oct 2025 19:16:19 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "Las Vegas hosts Phoenix on Friday to open the WNBA Finals. The team whose big three plays the best will win the title.",
      "It's Las Vegas vs. Phoenix for the 2025 title"
    ],
    "image_url": "",
    "titles": [
      "WNBA Finals first look: How the Aces and Mercury match up",
      "2025 WNBA Finals: Aces vs. Mercury schedule, prediction, players to watch"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.981,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.676,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Las Vegas and Phoenix are set to compete in the WNBA Finals starting Friday, with the 2025 title at stake. The outcome will likely hinge on which team's top three players perform best.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Israeli Forces Intercept Flotilla, Arrest Thunberg; Gaza Exodus Intensifies",
    "domain": "general",
    "source_domain": "www.washingtonpost.com",
    "location": "global",
    "published": "Wed, 01 Oct 2025 23:07:36 +0000",
    "source": "Washington Post",
    "sources": [
      "Washington Post",
      "New York Times"
    ],
    "domains": [
      "www.nytimes.com",
      "www.washingtonpost.com"
    ],
    "snippets": [
      "As Israel cut off northern Gaza, the Global Sumud Flotilla was intercepted by Israeli forces, who arrested the activist Greta Thunberg aboard one of the vessels.",
      "Hundreds of thousands of Palestinians have fled Israel’s assault on Gaza City, but many are believed to remain, having nowhere to go or no means to leave."
    ],
    "image_url": "",
    "titles": [
      "Israel steps up Gaza City assault as Hamas weighs Trump peace deal",
      "Israel Escalates Gaza Offensive as Hamas Mulls Trump Plan"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.978,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.658,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Israeli forces intercepted the Global Sumud Flotilla, arresting activist Greta Thunberg among others, as they attempted to reach northern Gaza. Concurrently, Israel's military actions in Gaza City prompted hundreds of thousands of Palestinians to flee, though many remain trapped due to lack of resources or escape routes.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Israeli Navy Intercepts Ships with Activists, Including Thunberg, Near Gaza",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Wed, 01 Oct 2025 22:54:42 +0000",
    "source": "Al Jazeera",
    "sources": [
      "The Guardian",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "At least six ships have been boarded by the Israeli navy so far and more interceptions are expected to take place.",
      "At least 73 Palestinians have been killed in Gaza as Israeli forces arrest activists, including Greta Thunberg.",
      "<p>Greta Thunberg arrested and taken into custody after six of the flotilla’s boats were boarded</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/oct/01/israel-gaza-aid-global-sumud-flotilla-middle-east-crisis-latest-updates\">Middle East crisis live</a></p></li></ul><p>At least two",
      "<p>Israeli foreign ministry posts video of Thunberg’s arrest; vessels carrying about 500 activists intercepted about 75 miles off coast of war-torn territory</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/oct/01/israeli-military-vessels-pro-palestinian-flotilla-gaza\">Israeli naval for"
    ],
    "image_url": "",
    "titles": [
      "Israeli forces board Gaza flotilla, detain Greta Thunberg, other activists",
      "Updates: Israeli forces kill 73 in Gaza; arrest flotilla activists",
      "Israeli naval forces board pro-Palestinian flotilla 75 miles from Gaza",
      "Greta Thunberg arrested by Israeli forces after military boards aid flotilla headed for Gaza – Middle East crisis live"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.974,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.657,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Israeli navy has intercepted at least six ships carrying around 500 activists, including Greta Thunberg, about 75 miles off the coast of Gaza. Thunberg has been arrested and taken into custody. This action is part of a broader conflict that has resulted in at least 73 Palestinian deaths in Gaza as Israeli forces arrest activists. Further interceptions are anticipated.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Miller Sets Playoff Record with 104.5 mph Pitch, Padres Beat Cubs 3-0",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Wed, 01 Oct 2025 23:58:12 +0000",
    "source": "CBS Sports",
    "sources": [
      "Sportsnet",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Miller's 104.5 mph pitch is the fastest playoff pitch on record",
      "<p>Manny Machado hit a two-run homer, Mason Miller dominated again and the San Diego Padres beat the Chicago Cubs 3-0 on Wednesday, sending their NL Wild Card Series to a decisive third game.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/10/01/9a6ad93f-8538-495f-ae8d-d403490c2135/miller-getty.png",
    "titles": [
      "Mason Miller makes history, but Wild Card Series Game 3 may put Padres flamethrower to the test vs. Cubs",
      "Machado, Miller star as Padres beat Cubs to extend NL Wild Card Series"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.995,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.654,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Mason Miller set a record for the fastest playoff pitch at 104.5 mph during the NL Wild Card Series. His performance, alongside Manny Machado's two-run homer, led the San Diego Padres to a 3-0 victory over the Chicago Cubs, pushing the series to a decisive third game.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Bogaerts' Key Play Spurs Padres to Shutout Win, Forces Game 3 with Cubs",
    "domain": "sports",
    "source_domain": "www.sportingnews.com",
    "location": "national",
    "published": "Wed, 01 Oct 2025 23:35:33 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports",
      "Sportsnet"
    ],
    "domains": [
      "www.sportingnews.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "It all comes down to this.",
      "<p>Watch as Padres’ Xander Bogaerts flashes the leather on a hard ground ball before flipping the ball to Cronenworth at second, who fired a missile to first to turn a clutch 6-4-3 double play to seal a shutout win over the Cubs and force Game 3.</p>"
    ],
    "image_url": "",
    "titles": [
      "Cubs, Padres announce Game 3 starters",
      "Padres turn clutch double play to seal win over Cubs and force Game 3"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.988,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.653,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In a decisive moment, Padres' Xander Bogaerts made a key defensive play by catching a hard ground ball and initiating a 6-4-3 double play with Jake Cronenworth, which secured a shutout victory against the Cubs. This win forced a Game 3.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Social Security Payments Unaffected by Shutdown; Neptune Insurance Goes Public",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Wed, 01 Oct 2025 19:23:04 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Business Insider"
    ],
    "domains": [
      "www.cnbc.com",
      "www.businessinsider.com"
    ],
    "snippets": [
      "Social Security benefit payments will still go out on time, according to the agency. But certain services may not be available.",
      "Neptune Insurance, the nation's largest private flood insurance, goes public on the New York Stock Exchange Wednesday.",
      "The government shutdown could mean travel delays, closed parks, and Social Security customer service disruptions."
    ],
    "image_url": "",
    "titles": [
      "What the government shutdown means for Social Security benefits",
      "Government shutdown means opportune timing for Neptune Flood IPO",
      "How the shutdown impacts everything from Social Security to the post office"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.886,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.639,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Social Security payments will continue as scheduled despite the government shutdown, which may cause travel delays, park closures, and disruptions in Social Security customer services. Neptune Insurance, the largest private flood insurer in the U.S., went public on the New York Stock Exchange.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Disney Escalates Legal Action Against AI Firms with Cease and Desist to Characte",
    "domain": "technology",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Wed, 01 Oct 2025 17:35:21 GMT",
    "source": "Axios",
    "sources": [
      "TechCrunch",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "techcrunch.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMickFVX3lxTE9naW4zYmdWaGMzRUdseTJzRVdLOTVLNDJKZXoyNS1SVjhOY0ZuN2pvUFE1cTh0M0o3UlJ4QnF2U1JpWTlWaDFLSVVINGozTzJHMEVQRl9oeG9TOTlOVWthZXh6MHBiN0ptc21LSF9JOEp2Zw?oc=5\" target=\"_blank\">Scoop: Disney sends cease and desist letter to Character.AI</a>&nbsp;&nbs",
      "\"Character.ai is freeriding off the goodwill of Disney’s famous marks and brands, and blatantly infringing Disney’s copyrights,\" a Disney lawyer wrote."
    ],
    "image_url": "",
    "titles": [
      "Scoop: Disney sends cease and desist letter to Character.AI - Axios",
      "CharacterAI removes Disney characters after receiving cease-and-desist letter"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.854,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.633,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Disney has issued a cease and desist letter to Character.AI, escalating its legal actions in the tech space. This follows an ongoing lawsuit against AI image creator Midjourney, indicating Disney's increasing legal scrutiny of AI companies using its copyrighted content.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "US Government Acquires 10% Stake in Major Lithium Mine Projects",
    "domain": "technology",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Wed, 01 Oct 2025 18:23:59 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "The Verge"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.theverge.com"
    ],
    "snippets": [
      "Vancouver-based Lithium Americas is developing one of world&#039;s largest lithium mines in northern Nevada.",
      "Donald Trump’s administration is taking a 5 percent equity ownership of mining company Lithium Americas, on top of another 5 percent stake in the company’s joint mining project with GM in Nevada, the Department of Energy announced yesterday. The mine at Thacker Pass is expected to become the largest"
    ],
    "image_url": "",
    "titles": [
      "US takes a stake in another firm, this time a large lithium mine",
      "US government takes equity stake in one of the world’s largest lithium mines"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.886,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.632,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The U.S. Department of Energy, under Donald Trump's administration, acquired a 5% equity stake in Lithium Americas, a Vancouver-based company developing one of the world's largest lithium mines in northern Nevada. Additionally, the government secured another 5% stake in the company's joint venture with GM at the same location, Thacker Pass, which is anticipated to become the largest lithium mine.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "OpenAI Launches Sora App for AI Video Cameo Exchanges Among Friends",
    "domain": "technology",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Wed, 01 Oct 2025 16:43:40 GMT",
    "source": "Axios",
    "sources": [
      "Ars Technica",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "arstechnica.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMiakFVX3lxTE82OHk5bkFKT1N6eGdYc0QzTnFfZEo5Qk9HTDQ4UnNKRjI0SF85dFFHQnFxQ0JMUmozSWMzaERHNlZNYldjMU11SW5iZmo0ZmxEYkg3UjNfbllSdGlWbldGWmx4MER5TTE3TXc?oc=5\" target=\"_blank\">OpenAI's Sora app lets friends swap AI video cameos</a>&nbsp;&nbsp;<font color=\"#6f6",
      "Sora social app launches with deepfake-style \"cameos\" and feed controls."
    ],
    "image_url": "",
    "titles": [
      "OpenAI's Sora app lets friends swap AI video cameos - Axios",
      "OpenAI’s Sora 2 lets users insert themselves into AI videos with sound"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.838,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.63,
    "summary_source": "snippet",
    "summary_reason": "retry_exhausted",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMiakFVX3lxTE82OHk5bkFKT1N6eGdYc0QzTnFfZEo5Qk9HTDQ4UnNKRjI0SF85dFFHQnFxQ0JMUmozSWMzaERHNlZNYldjMU11SW5iZmo0ZmxEYkg3UjNfbllSdGlWbldGWmx4MER5TTE3TXc?oc=5\" target=\"_blank\">OpenAI's Sora app lets friends swap AI video cameos</a>&nbsp;&nbsp;<font color=\"#6f6",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Pfizer Strikes Deal with Trump to Lower Drug Prices, Calms Investors",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Wed, 01 Oct 2025 10:09:20 GMT",
    "source": "Axios",
    "sources": [
      "Forbes",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "www.forbes.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMic0FVX3lxTFA2UlR5OW9ISG1mNXo3MktWVWsyQlBjNExoMlhKZ3I5V0tXbnZ6MC03TVZnVzAzTkF6bVVqWm1PVzhYNldWdDJwMlVvSmgtbW1Zb1RBSTQ2R0tUX3ZnN0JhLTFMRnQ4RUxJUi1UR1R4ckcydEE?oc=5\" target=\"_blank\">Pfizer's drug pricing deal with Trump ratchets up pressure on other phar",
      "The pharmaceutical giant’s deal with Trump to cut prices has little impact on the bottom line–but removes a lot of regulatory uncertainty. Investors love it."
    ],
    "image_url": "",
    "titles": [
      "Pfizer's drug pricing deal with Trump ratchets up pressure on other pharma companies - Axios",
      "Pfizer’s Art Of The Deal"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.731,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.615,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Pfizer reached a deal with Trump to cut drug prices, easing regulatory uncertainty and pleasing investors. The agreement has minimal effect on Pfizer's financials but significantly reduces potential regulatory challenges.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "NASA Rover Finds Signs of Ancient Lake, Possible Microbial Activity on Mars",
    "domain": "science",
    "source_domain": "www.sciencedaily.com",
    "location": "global",
    "published": "Wed, 01 Oct 2025 00:54:17 EDT",
    "source": "ScienceDaily",
    "sources": [
      "ScienceDaily",
      "SciTechDaily"
    ],
    "domains": [
      "scitechdaily.com",
      "www.sciencedaily.com"
    ],
    "snippets": [
      "Perseverance rover data shows Jezero Crater once held a calm lake, leaving behind mudstones rich in organic-linked minerals. The presence of iron-phosphate and iron-sulfide nodules suggests processes resembling microbial activity on Earth. Scientists caution that only Earth-based labs can confirm th",
      "<a href=\"https://scitechdaily.com/scientists-just-found-the-oldest-dome-head-dinosaur-ever/\" rel=\"nofollow\" title=\"Scientists Just Found the Oldest Dome-Head Dinosaur Ever\"><img alt=\"Pachycephalosaurs Illustration\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"474\" src=\"https://scitechdaily.c"
    ],
    "image_url": "",
    "titles": [
      "Scientists just found the strongest signs of life on Mars yet",
      "Scientists Just Found the Oldest Dome-Head Dinosaur Ever"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.669,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.589,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "NASA's Perseverance rover has discovered that Jezero Crater on Mars once contained a calm lake, evidenced by mudstones rich in organic-linked minerals. The detection of iron-phosphate and iron-sulfide nodules within these rocks suggests processes that could be similar to microbial activity found on Earth. However, scientists emphasize that definitive confirmation of microbial life requires analysis in Earth-based laboratories.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Stocks Hit Record High, Marking Fourth Day of Gains",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Wed, 01 Oct 2025 22:30:03 GMT",
    "source": "Bloomberg",
    "sources": [
      "Bloomberg"
    ],
    "domains": [
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMilAFBVV95cUxOR2FDOHpSRUF5cG1Bc3Z4RVZ0ZzQxeDBqbFFRWlJQWm9tQ3JXdFAzSUNTQ0pYbF9VQUxRNTNoSnFLWEdscy1SbW9MNDNCaVByWDJNalp4REhwYXBIbnlxS3hpaHRROWwwWjFTcFFzcWIzUG0zRHJBNGdHZlNOTTRBSDRaVlpyYndTSG95QU5XSVhTTFBo?oc=5\" target=\"_blank\">Stocks Hit Record as Trader",
      "<a href=\"https://news.google.com/rss/articles/CBMilAFBVV95cUxPLTVUTk1QakRkSkl2SWEzYUo0V1RwRlhLdVlld2UxMjRWVUhNS0lNcW84a2FvMlZJX2ZMM1gxOXl4Zmx4WjdUTnpBNjBxdFp1bGxTSE0weVppd3IyYjRSbElZWFhYR2FPUnNlVkZDV0l1ZmtKcHJiRXAxQlljbkxVNEkycTZrLTI3VU41Rnd1TlhLcTBm?oc=5\" target=\"_blank\">Stocks Rise for Fourth Day;"
    ],
    "image_url": "",
    "titles": [
      "Stocks Hit Record as Traders Shrug Off US Shutdown: Markets Wrap - Bloomberg.com",
      "Stocks Rise for Fourth Day; Treasuries Rally: Markets Wrap - Bloomberg.com"
    ],
    "score_components": {
      "magnitude": 0.393,
      "recency": 0.946,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.464,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Stocks reached a record high, continuing their upward trend for the fourth consecutive day. This surge is reflected across various market indicators, showcasing a robust performance in the trading session.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "California Mandates AI Safety Transparency, First State to Do So",
    "domain": "technology",
    "source_domain": "techcrunch.com",
    "location": "global",
    "published": "Wed, 01 Oct 2025 20:00:00 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com"
    ],
    "snippets": [
      "“Are bills like SB 53 the thing that will stop us from beating China? No,” said Adam Billen, vice president of public policy at youth-led advocacy group Encode AI. “I think it is just genuinely intellectually dishonest to say that that is the thing that will stop us in the race.”",
      "California just made history as the first state to require AI safety transparency from the biggest labs in the industry. Governor Newsom signed SB 53 into law this week, mandating that AI giants like OpenAI and Anthropic disclose, and stick to, their safety protocols. The decision is already sparkin"
    ],
    "image_url": "",
    "titles": [
      "California’s new AI safety law shows regulation and innovation don’t have to clash",
      "Why California’s new AI safety law succeeded where SB 1047 failed"
    ],
    "score_components": {
      "magnitude": 0.393,
      "recency": 0.916,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.458,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "California has become the first state to mandate AI safety transparency from major labs, with Governor Newsom signing SB 53 into law. This requires companies like OpenAI and Anthropic to disclose their safety protocols. Adam Billen from Encode AI commented that attributing the slowing of U.S. competitiveness with China to such laws is \"intellectually dishonest.\"",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]