[
  {
    "title": "U.S. Strike Kills 11 in Caribbean, Escalating Tensions with Venezuela",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Wed, 03 Sep 2025 14:52:47 +0000",
    "source": "Al Jazeera",
    "sources": [
      "The Guardian",
      "Al Jazeera",
      "New York Times",
      "Washington Post"
    ],
    "domains": [
      "www.nytimes.com",
      "www.washingtonpost.com",
      "www.aljazeera.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Trump says, ‘We took it out,’ referring to a military strike in international waters amid Washington-Caracas tensions.",
      "Donald Trump says a US strike has killed 11 ‘narcoterrorists’ from a Venezuelan gang smuggling drugs in the Caribbean.",
      "<p>Trump says ‘we took it out’ referring to the operation in international waters, amid US-Caracas tensions </p><p>The US military has killed 11 drug traffickers from Venezuela during a “a kinetic strike” in the Caribbean Sea, the US president, Donald Trump, has claimed amid growing tensions between",
      "The attack is a dramatic escalation that coincides with the administration’s growing counternarcotics focus and its intensifying feud with the Venezuelan leader, Nicolás Maduro.",
      "The vessel was transporting illegal narcotics through international waters to the United States, the president said."
    ],
    "image_url": "",
    "titles": [
      "How did US strike on Venezuelan boat come about? What it means",
      "Trump says US strike targeted Venezuelan drug smuggling boat",
      "US conducts ‘kinetic strike’ against drug boat from Venezuela, killing 11, Trump says",
      "U.S. kills 11 in strike on alleged drug vessel from Venezuela, Trump says",
      "Trump Says U.S. Attacked Boat Carrying Venezuelan Gang Members, Killing 11"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.974,
      "consensus": 0.908,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.801,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The U.S. military conducted a strike on a drug-laden vessel in the southern Caribbean, killing 11 \"narcoterrorists\" as it left Venezuela, according to President Trump. This action, described by Trump as taking out the vessel in international waters, escalates tensions between the U.S. and Venezuela. It follows the recent deployment of U.S. warships to the region, aligning with the administration's increased focus on counternarcotics efforts and its ongoing feud with Venezuelan leader Nicolas Maduro.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "China Marks WWII Anniversary with Military Parade, Showcases New Missile",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 03 Sep 2025 09:07:04 GMT",
    "source": "BBC",
    "sources": [
      "Al Jazeera",
      "New York Times",
      "BBC",
      "Deutsche Welle"
    ],
    "domains": [
      "www.dw.com",
      "www.nytimes.com",
      "www.aljazeera.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Beijing has unveiled a range of military hardware in a show of might to Western powers.",
      "China showcased a new generation of weapons at a military parade in Bejing, including unmanned submarines and aircraft.",
      "China held its largest ever military parade in Beijing to mark 80 years since World War II, overseen by President Xi Jin",
      "China has held a massive military parade to commemorate 80 years since Japan surrendered at the end of World War II. North Korea's Kim and Russia's Putin were at the event hosted by China's Xi.",
      "The parade, attended by the leaders of Russia and North Korea, had a defiant message. President Trump fired back, accusing Xi Jinping of ignoring America’s role in World War II.",
      "China used a parade of fighter jets, missiles and goose-stepping troops to honor the country’s wartime sacrifice and issue a defiant warning to rivals."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/1fa7/live/4eab1860-88d6-11f0-b391-6936825093bd.jpg",
    "titles": [
      "What new weapons on show at huge parade say about China's military strength",
      "What China unveiled at its military parade",
      "China stages huge military parade with Putin and Kim in attendance",
      "China's Xi hosts Putin, Kim at Beijing military parade",
      "China Projects Power at Military Parade With Putin and Kim",
      "China’s Military Spectacle"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.846,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.765,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "China held a significant military parade in Tiananmen Square, Beijing, commemorating 80 years since Japan's WWII surrender, attended by President Xi Jinping, North Korea's Kim Jong Un, and Russia's Vladimir Putin. This marked the first public appearance together for the three leaders. The event showcased China's military capabilities, including the unveiling of the DF-5C intercontinental strategic nuclear missile. The parade served both as a remembrance of wartime sacrifices and a demonstration of China's growing military strength.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Israel Plans to Annex West Bank Lands, Excludes Major Palestinian Cities",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Wed, 03 Sep 2025 15:45:33 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Global News",
      "Al Jazeera",
      "New York Times"
    ],
    "domains": [
      "www.nytimes.com",
      "www.aljazeera.com",
      "globalnews.ca"
    ],
    "snippets": [
      "Israeli Finance Minister Bezalel Smotrich says maps are being drawn up to annex &quot;maximum territory” in the West Bank.",
      "Bezalel Smotrich said Israel should take over most of the territory, partly in response to growing international moves to recognize a Palestinian state.",
      "At a press conference in Jerusalem, Bezalel Smotrich stood before a map that suggested the annexation of most of the West Bank with the exception of six large Palestinian cities."
    ],
    "image_url": "",
    "titles": [
      "Israeli Finance Minister outlines plan to annex West Bank territory",
      "Far-right Israeli Minister Calls for West Bank Annexation",
      "Israeli far-right minister says he is drawing up West Bank annexation maps"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.992,
      "consensus": 0.789,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.762,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Israeli Finance Minister Bezalel Smotrich announced plans for Israel to annex \"maximum territory\" in the West Bank, excluding six large Palestinian cities. This move is partly in response to international efforts recognizing a Palestinian state. Smotrich revealed these plans at a press conference in Jerusalem, showcasing a map of the proposed annexations.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: effort, plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Jets' Vera-Tucker Suffers Major Arm Injury, May Miss Season Opener",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Wed, 3 Sep 2025 11:38:19 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.sportsnet.ca",
      "www.cbssports.com"
    ],
    "snippets": [
      "Jets starting guard Alijah Vera-Tucker has a significant arm injury, sources told ESPN.",
      "New York kicks off the season vs. Pittsburgh on Sunday",
      "<p>New York Jets right guard Alijah Vera-Tucker has an injury that could sideline him for the season opener and perhaps longer, a person with knowledge of the situation told The Associated Press on Wednesday.</p>"
    ],
    "image_url": "",
    "titles": [
      "Sources: Jets' Vera-Tucker has significant injury",
      "Jets OL Alijah Vera-Tucker suffers significant arm injury that could require surgery, per report",
      "AP Source: Jets OL Alijah Vera-Tucker faces injury setback before season opener"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.989,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.76,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "New York Jets starting guard Alijah Vera-Tucker has suffered a significant arm injury, potentially sidelining him for the season opener against Pittsburgh and possibly for an extended period. This information comes from sources cited by ESPN and a person familiar with the situation speaking to The Associated Press.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Experts and AI Make Week 1 NFL Survivor Picks",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Wed, 3 Sep 2025 09:32:59 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.sportsnet.ca",
      "www.cbssports.com"
    ],
    "snippets": [
      "NFL survivor pool strategy, predictions and picks for ESPN Eliminator Challenge Week 1.",
      "SportsLine's No. 1 NFL expert R.J. White just locked in his top Week 1 NFL survivor pick",
      "SportsLine's advanced computer model just locked in its top Week 1 NFL survivor picks",
      "<p>By The Books&#8217; Dave Ross and Jensen Lewis break down their top picks for NFL survivor pools in Week 1, saying the Arizona Cardinals, Jacksonville Jaguars and Indianapolis Colts are among their favourite plays.</p>"
    ],
    "image_url": "",
    "titles": [
      "Survivor pool strategy: The top teams to take in NFL's Week 1",
      "Week 1 NFL survivor pool picks, advice, strategy tips: NFL expert releases knockout pick, teams to avoid",
      "NFL football knockout, survivor pool picks, advice, optimal strategy for Week 1, 2025: Stay away from Arizona",
      "Who are best picks for NFL survivor pools in Week 1?"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.947,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.758,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "SportsLine's top NFL expert, R.J. White, and its advanced computer model have both made their Week 1 NFL survivor picks. Additionally, Dave Ross and Jensen Lewis from By The Books recommend the Arizona Cardinals, Jacksonville Jaguars, and Indianapolis Colts as their top picks for NFL survivor pools in Week 1.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "NFL's Goodell Open to Taylor Swift Super Bowl Show, No Talks Confirmed",
    "domain": "sports",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Wed, 03 Sep 2025 14:44:21 GMT",
    "source": "Axios",
    "sources": [
      "CBS Sports",
      "Axios",
      "Forbes"
    ],
    "domains": [
      "www.forbes.com",
      "news.google.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMigAFBVV95cUxQRWszbkRXT2VqTHRSV2F4a215WmktenVNVjZMa211STlRNEpveEw5X2JJdnRhbjR4VE81R0d3eUZhakdyVWM2dGtqMy1WQkczSGtoLXdvbTlWaF9maXB6Z195VUhQZEZ0MlVZbjA0ano3Ri1NaWpzeTZ2VWs4clVaYw?oc=5\" target=\"_blank\">Taylor Swift Super Bowl halftime not ruled out by NFL",
      "Goodell wouldn't confirm if any official talks have happened, but noted the NFL would 'love' to have Swift perform",
      "Mentions of sourdough bread and references to the numbers 60, 47 and 1973 have fans convinced Taylor Swift is the NFL's next big performer."
    ],
    "image_url": "",
    "titles": [
      "Taylor Swift Super Bowl halftime not ruled out by NFL commissioner - Axios",
      "Roger Goodell would love a Taylor Swift Super Bowl halftime show: 'She would be welcome any time'",
      "NFL Commissioner: Taylor Swift Super Bowl ‘A Maybe’—Here’s Why Swifties Are Convinced It’s Happening"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.951,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.727,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "NFL Commissioner Roger Goodell did not confirm any official discussions regarding Taylor Swift performing at the Super Bowl halftime show but expressed that the NFL would be thrilled to have her. Despite the lack of confirmation, fan speculation is high, with some pointing to cryptic references in Swift's work as hints she might be the next performer.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Rayner Refers Herself to Ethics Adviser Over £800K Tax Error",
    "domain": "general",
    "source_domain": "www.ft.com",
    "location": "global",
    "published": "Wed, 03 Sep 2025 13:49:54 GMT",
    "source": "Financial Times",
    "sources": [
      "The Guardian",
      "Financial Times",
      "New York Times"
    ],
    "domains": [
      "www.nytimes.com",
      "www.ft.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Labour politician refers herself to government’s ethics adviser over £800,000 Hove flat",
      "Angela Rayner, the deputy to Prime Minister Keir Starmer, said the property tax underpayment was a mistake related to care arrangements for her disabled son.",
      "<p>Exclusive: Deputy PM refers herself to ethics adviser as confirmation puts her position under threat</p><ul><li><p><a href=\"https://www.theguardian.com/politics/2025/sep/03/angela-rayners-full-statement-on-her-stamp-duty-underpayment\">Read Rayner’s full statement</a></p></li><li><p><a href=\"https"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F2ae5f777-b762-4725-b676-1205310625b3.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "UK deputy prime minister Angela Rayner admits underpaying tax",
      "Angela Rayner, UK’s Deputy Prime Minister, Admits Underpaying Tax",
      "Angela Rayner admits underpaying stamp duty on £800,000 seaside flat"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.933,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.723,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Angela Rayner, Deputy Prime Minister under Keir Starmer, has referred herself to the government's ethics adviser due to an £800,000 underpayment in property tax for a Hove flat, attributing the mistake to care arrangements for her disabled son. This action puts her position at risk, as confirmed by her public statement.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Criticizes China's Military Parade Attended by Putin, Kim Jong Un",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 03 Sep 2025 03:45:58 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "CNBC",
      "BBC"
    ],
    "domains": [
      "www.cnbc.com",
      "www.bbc.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Donald Trump's comments came as China held a massive military parade attended by the Russian and North Korean leaders.",
      "Russian President Vladimir Putin and North Korea's Kim Jong Un are among the leaders from more than 20 countries attending the \"Victory Day\" military parade in Beijing.",
      "<p>Trump criticises victory day event as China caps off week of diplomatic grandstanding seen as rebuke to the west</p><p>Xi Jinping said the world was facing a choice between peace or war as he held China’s largest-ever military parade, joined by Vladimir Putin and Kim Jong-un in a show of defiance"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/f29c/live/0334e570-8843-11f0-b391-6936825093bd.jpg",
    "titles": [
      "Trump accuses Xi of conspiring against US with Putin and Kim",
      "China's Xi says the world faces 'peace or war' as Trump claims Beijing conspiring against U.S.",
      "Xi Jinping says world faces ‘peace or war’, as Putin and Kim join him for military parade"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.757,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.702,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Donald Trump criticized China's \"Victory Day\" military parade, which was attended by Russian President Vladimir Putin and North Korean leader Kim Jong Un, among leaders from over 20 countries. The event, described as China's largest-ever military parade, was seen as a display of defiance to the West. Chinese President Xi Jinping framed the occasion as a choice between peace or war.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Poilievre Calls for End to Foreign Worker Program, Citing Youth Job Crisis",
    "domain": "general",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Wed, 03 Sep 2025 14:40:29 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "CityNews"
    ],
    "domains": [
      "globalnews.ca",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "The proposal comes amid growing scrutiny and concerns about whether access to less expensive labour through the program can hurt the potential for wage growth.",
      "Conservative Leader Pierre Poilievre is calling on the Liberals to scrap the temporary foreign worker program and stop issuing visas under the program, arguing it has caused an employment crisis among young Canadians. &#8220;The Liberals have to answer why is it that they&#8217;re shutting our own y"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/Poilievre-TFW.jpg?quality=65&strip=all",
    "titles": [
      "End Canada’s temporary foreign worker program, Poilievre says",
      "Poilievre calls on Liberals to scrap the temporary foreign worker program"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.97,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.699,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Conservative Leader Pierre Poilievre has urged the Liberals to eliminate the temporary foreign worker program, claiming it contributes to an employment crisis among young Canadians by potentially suppressing wage growth. This proposal arises amid increased scrutiny over the program's impact on the domestic labor market.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Cadillac Joins F1 in 2026 with Bottas, Perez, and Herta as American Test Driver",
    "domain": "sports",
    "source_domain": "sports.yahoo.com",
    "location": "national",
    "published": "Wed, 03 Sep 2025 15:54:00 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Sportsnet",
      "Yahoo Sports"
    ],
    "domains": [
      "sports.yahoo.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Cadillac is joining F1 in 2026 with Valtteri Bottas and Sergio Perez as its main drivers.",
      "<p>Colton Herta on Wednesday was named the test driver for the new Cadillac Formula 1 team — a move that gives the program its first American driver and takes Herta from IndyCar into the global series.</p>"
    ],
    "image_url": "",
    "titles": [
      "Colton Herta leaving IndyCar Series to become test driver for new Cadillac Formula 1 team",
      "Colton Herta moving on from IndyCar to Cadillac’s Formula 1 team"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.995,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.679,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Cadillac is entering Formula 1 in 2026, with Valtteri Bottas and Sergio Perez as its lead drivers. Colton Herta has been named the test driver, marking his transition from IndyCar to F1 and becoming the first American driver for Cadillac's F1 team.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "NFL Returns to São Paulo: Kansas City vs. Los Angeles Picks Released",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Wed, 03 Sep 2025 13:42:40 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Forbes"
    ],
    "domains": [
      "www.forbes.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "The SportsLine projection model has revealed its Kansas City vs. Los Angeles picks for the 2025 NFL Sao Paulo Game on Friday",
      "The NFL returns to São Paulo, Brazil for another regular season game on Friday night. Here's what time the game starts, how to watch and who's playing."
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/02/08/eee98bb8-acc1-41ea-85aa-63a9f7411687/patrick-mahomes-kansas-city-chiefs-usatsi.jpg",
    "titles": [
      "Chiefs vs. Chargers in Brazil prediction, odds, time: 2025 NFL Sao Paulo Game picks from proven model",
      "What Time Is Chargers Vs. Chiefs In Brazil? Here’s How To Watch"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.95,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.67,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The SportsLine projection model released its picks for the 2025 NFL São Paulo Game between Kansas City and Los Angeles, scheduled for Friday night. This marks the NFL's return to São Paulo, Brazil for a regular-season game. Details on the game's start time and viewing options were also provided.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Nawrocki Meets Trump; Putin Warns of Military Use, Eyes EU Sanctions Impact",
    "domain": "general",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Wed, 03 Sep 2025 11:55:04 -0400",
    "source": "ABC News",
    "sources": [
      "The Guardian",
      "ABC News"
    ],
    "domains": [
      "abcnews.go.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "24/7 coverage of breaking news and live events",
      "<p>Karol Nawrocki has joined Trump at the White House for his first overseas visit; Putin warns Russia will use ‘military means’ to achieve objectives if diplomacy fails</p><p><strong>Putin</strong> was also asked about the prospect of more EU sanctions against Russia or its allies, including China "
    ],
    "image_url": "https://s.abcnews.com/images/Live/abc_news_live-abc-ml-250210_1739199021469_hpMain_4x3t_384.jpg",
    "titles": [
      "LIVE:  Trump holds meeting with Polish president: ABC News Live",
      "Polish president meeting with Donald Trump as Putin calls on Zelenskyy to ‘come to Moscow’ for peace talks – Europe live"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.995,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.661,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Karol Nawrocki visited the White House to meet with Trump during his first overseas trip. Concurrently, Putin warned that Russia is prepared to use military means to achieve its objectives if diplomacy fails. Additionally, Putin addressed the possibility of facing further EU sanctions, potentially extending to Russia's allies, including China.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UN: 132K Yemeni Children Risk Malnutrition Death; Houthis Attack Israel",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Wed, 03 Sep 2025 12:31:48 +0000",
    "source": "Al Jazeera",
    "sources": [
      "The Guardian",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Estimated 132,000 children below the age of five are projected to be at risk of death from acute malnutrition by June.",
      "<p>More than 40,000 have suffered ‘new war-related injuries’ with more than half left disabled, says UN Committee on the Rights of Persons with Disabilities</p><p><strong>Yemen</strong>’s <strong>Houthis</strong> have claimed responsibility for a missile launched at <strong>Israel</strong> (<a href="
    ],
    "image_url": "",
    "titles": [
      "Israeli attacks disabled 21,000 Palestinian children in Gaza war, UN says",
      "Middle East crisis: at least 21,000 children disabled in Gaza during war, says UN committee – as it happened"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.927,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.657,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "An estimated 132,000 children under five in Yemen are at risk of death from acute malnutrition by June, as reported by the UN. Additionally, over 40,000 people have sustained new war-related injuries, with more than half resulting in disabilities. The Houthis in Yemen have also launched a missile at Israel, claiming responsibility for the attack.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: sustain",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Astros' Valdez Apologizes for Hitting Catcher Salazar After Grand Slam Incident",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Wed, 03 Sep 2025 14:07:40 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.cbssports.com"
    ],
    "snippets": [
      "Valdez and Salazar were reportedly called into their manager's office after the loss to the Yankees Tuesday",
      "<p>Houston Astros starter Framber Valdez said he apologized to catcher César Salazar after hitting him in the chest with a pitch Tuesday night, but he insisted that he didn’t hit his teammate on purpose.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/03/862bc901-f058-4590-96fb-cb977bb08c5e/valdez-getty.png",
    "titles": [
      "Astros' Framber Valdez denies that he intentionally crossed up catcher César Salazar after Yankees home run",
      "Astros starter Valdez says he did not intentionally hit catcher Salazar"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.959,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.647,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Astros pitcher Framber Valdez apologized to catcher César Salazar for accidentally hitting him with a pitch after allowing a grand slam to Yankees' Trent Grisham. Valdez insists the incident was not intentional.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Netflix Enhances \"Moments\" Feature for Custom Clip Sharing",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Wed, 03 Sep 2025 14:44:25 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "The Verge"
    ],
    "domains": [
      "www.cnbc.com",
      "www.theverge.com"
    ],
    "snippets": [
      "Netflix announced an update Wednesday to its \"Moments\" feature, now allowing viewers to choose a start and end point to save, rewatch and share clips.",
      "Netflix will now let you create and share highlight clips of your favorite shows and movies right from the Netflix app on your phone. Last year, Netflix launched a feature that let you bookmark spots from shows and movies and save them to your account to watch again later or share with others. Start"
    ],
    "image_url": "",
    "titles": [
      "Netflix will let users customize and share clips on mobile",
      "Netflix will let you make your own highlight clips"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.951,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.645,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Netflix updated its \"Moments\" feature, enabling users to select start and end points for clips from shows and movies to save, rewatch, and share directly from the app. This enhancement builds on last year's launch, which allowed bookmarking scenes for later viewing or sharing.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Bruce Marshall Shares Top College Football Picks for Week 2",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Wed, 03 Sep 2025 13:25:29 +0000",
    "source": "CBS Sports",
    "sources": [
      "Bleacher Report",
      "CBS Sports"
    ],
    "domains": [
      "news.google.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Legendary Vegas handicapper Bruce Marshall reveals the best betting values for the Week 2 college football schedule",
      "<a href=\"https://news.google.com/rss/articles/CBMinAFBVV95cUxPZno5VWg2SktRTThIUmN4Vy1pbnlibVhoMmhjM2dtMkN2M2NpTEVjZVhMVmNkZExQZ1JZWXNsOHFmUnBpMUIyTzBQS3otRkpzcDRva1ZZOGpOaGFlV3dDeG5SUTlreGVtVG8xazNIdk1PeTRkSWEwTWZyU2lhWVVxUl96UTVxZ1MtbVdMSk90T0d6YXRKdmdXWWl6dkY?oc=5\" target=\"_blank\">2025 Week 2 Coll"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/02/dec0b35a-d93b-49b7-a8e2-f3790cc5e24b/austin-simmons-ole-miss-imagn-images-1.jpg",
    "titles": [
      "2025 college football Week 2 picks against the spread, odds, lines, trends: Expert locks in picks",
      "2025 Week 2 College Football Predictions for Every Game - Bleacher Report"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.945,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.644,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Bruce Marshall, a renowned Las Vegas handicapper, has shared his top betting picks for Week 2 of the college football season. The specifics of his recommendations, including which games offer the best betting values, were not disclosed in the summary provided.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Shein Pulls Image Resembling Mangione After Backlash, Cites Third-Party Seller",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 03 Sep 2025 14:08:55 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Forbes"
    ],
    "domains": [
      "www.bbc.com",
      "www.forbes.com"
    ],
    "snippets": [
      "An image with the likeness of Mr Mangione was used to advertise a white, short-sleeved shirt.",
      "Shein told the BBC the image of what appears to be Mangione’s likeness was provided by a third-party seller, and the image has since been removed from Shein’s website."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/1eb6/live/3a2a64b0-88cf-11f0-b391-6936825093bd.png",
    "titles": [
      "Luigi Mangione's likeness used to model shirt on Shein",
      "Luigi Mangione’s Likeness Appeared As Model On Shein Website"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.939,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.643,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Shein removed an image resembling Mr. Mangione from their website after it was used to advertise a white shirt. The image was supplied by a third-party seller, according to Shein's statement to the BBC.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Alphabet Stock Up 9% After Favorable Google Antitrust Ruling",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Wed, 03 Sep 2025 14:05:00 GMT",
    "source": "CNBC",
    "sources": [
      "TechCrunch",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "techcrunch.com"
    ],
    "snippets": [
      "Alphabet stock climbed 9% as investors viewed the result of Google's antitrust case as broadly favorable.",
      "U.S. District Court Judge Amit P. Mehta outlined remedies on Tuesday that would bar Google from entering or maintaining exclusive deals that tie the distribution of Search, Chrome, Google Assistant, or Gemini to other apps or revenue arrangements."
    ],
    "image_url": "",
    "titles": [
      "Alphabet stock pops 9% after Google avoids breakup in antitrust case",
      "Google avoids breakup, but has to give up exclusive search deals in  antitrust trial"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.938,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.643,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Alphabet's stock rose by 9% after a U.S. District Court ruling on Google's antitrust case was seen as favorable by investors. Judge Amit P. Mehta imposed remedies preventing Google from making exclusive deals for distributing Search, Chrome, Google Assistant, or Gemini with other apps or in revenue agreements.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Olympic Boxer Barred Under New Sex Testing Rules, Misses Championship",
    "domain": "sports",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Wed, 03 Sep 2025 13:15:35 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "Sky Sports"
    ],
    "domains": [
      "www.theguardian.com",
      "www.skysports.com"
    ],
    "snippets": [
      "<ul><li><p>Olympic boxing body stands firm over new testing rules</p></li><li><p>Gold medalist has appealed to Cas over eligibility bar</p></li></ul><p>Imane Khelif has the right to appeal against World Boxing’s decision barring her from events unless she undergoes genetic sex testing but the Algeri",
      "Algerian Olympic boxing champion Imane Khelif will not have an appeal hearing heard at the Court of Arbitration for Sport (CAS) in time for her to compete at the World Boxing Championships which begin in Liverpool on Thursday."
    ],
    "image_url": "https://i.guim.co.uk/img/media/9f83b4cc4975ec61a1ae7beb7e13b04edbb625c0/378_0_3783_3026/master/3783.jpg?width=140&quality=85&auto=format&fit=max&s=d34fe47ee26ede17941a9c9a3df0ac27",
    "titles": [
      "Imane Khelif ‘has right to appeal’ over gender tests but will miss world championships",
      "Imane Khelif unable to compete in World Boxing Championship with appeal yet to be heard"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.922,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.639,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Olympic boxing body has implemented new testing rules, which include genetic sex testing. Algerian Olympic boxing champion Imane Khelif has been barred from competing under these rules and appealed to the Court of Arbitration for Sport (CAS). However, her appeal will not be heard in time for her to participate in the World Boxing Championships in Liverpool.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Google Won't Sell Chrome, Faces Deal Restrictions After Antitrust Ruling",
    "domain": "technology",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Wed, 03 Sep 2025 12:28:25 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "Ars Technica"
    ],
    "domains": [
      "arstechnica.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMibEFVX3lxTE42Ymk1ZG1rOFFTQnFtWHNIWUplalVqdnZBQUoyeXJPMHk4Q2tycWhBcklrY082V3Rnb0podGpuYmNhR3hucFJnaXBTbGV1Z2tlTkpPQ0s4R0h2WlRfckZoMm90aUJ0MVZ2TG1aYQ?oc=5\" target=\"_blank\">Google won't have to sell Chrome in antitrust win</a>&nbsp;&nbsp;<font color=\"#6f",
      "Google's penalty for being a search monopoly does not include selling Chrome."
    ],
    "image_url": "",
    "titles": [
      "Google won't have to sell Chrome in antitrust win - Axios",
      "Google won’t have to sell Chrome, judge rules"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.907,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.636,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A federal judge ruled that Google, previously found to violate the Sherman Antitrust Act, will not have to sell its Chrome browser. However, the company is prohibited from making exclusive deals for its search engine and other products like Chrome, Google Assistant, and the Gemini app on devices. This decision by U.S. District Court Judge Amit Mehta comes after considering the impact of generative AI on the market.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump to Appeal Tariff Decision to SCOTUS, Cites Emergency",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Tue, 02 Sep 2025 19:46:25 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "Forbes"
    ],
    "domains": [
      "www.forbes.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMibEFVX3lxTE1QRmFKem5IRUNkUUxIUE5kbUhKdHQ4RWRsRWZYNHZsZEQ0cTdUTlhfTjQydUZZTm9mMTRJVjVOcGRoMWZzWVFoQzVlcjhhVDg4ZkdqYVdSRzdWWDdmMjYzNHNTNmxhcDY1c19WRg?oc=5\" target=\"_blank\">Trump: Tariff decision \"an emergency,\" will appeal to SCOTUS as soon as Wednesday",
      "The president said he’ll ask the court to decide the tariffs’ legality on Wednesday."
    ],
    "image_url": "",
    "titles": [
      "Trump: Tariff decision \"an emergency,\" will appeal to SCOTUS as soon as Wednesday - Axios",
      "Trump Will Appeal Tariff Decision To Supreme Court, He Says—Here’s What To Know"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.64,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.597,
    "summary_source": "snippet",
    "summary_reason": "retry_exhausted",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMibEFVX3lxTE1QRmFKem5IRUNkUUxIUE5kbUhKdHQ4RWRsRWZYNHZsZEQ0cTdUTlhfTjQydUZZTm9mMTRJVjVOcGRoMWZzWVFoQzVlcjhhVDg4ZkdqYVdSRzdWWDdmMjYzNHNTNmxhcDY1c19WRg?oc=5\" target=\"_blank\">Trump: Tariff decision \"an emergency,\" will appeal to SCOTUS as soon as Wednesday",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Disney Pays $10M to Settle FTC Child Data Complaint",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Tue, 02 Sep 2025 18:00:26 GMT",
    "source": "Axios",
    "sources": [
      "CNBC",
      "Axios"
    ],
    "domains": [
      "www.cnbc.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMimAFBVV95cUxONjVBMnFibGNBS2lXMzhOdWl0WFlhcFgtWldqZ2ZPVkFRUHJqeWtGajZFSnoyVTdXTFZwWmh1UnZUSzhXODAyWFlOOHB2UHNUUWM0OE5jQnZHMjByVXlCRnJ4b3c0SFBMMFlKeS1adk1rMkhZLWROazV2QUtCck5rQ2xIUjBSVzB6MlhXcGRKQzBWUkJxOHFfSw?oc=5\" target=\"_blank\">Exclusive: Disney wil",
      "Disney to pay $10 million to settle FTC complaint over unlawful collection of children's personal data."
    ],
    "image_url": "",
    "titles": [
      "Exclusive: Disney will pay $10M to settle children's privacy lawsuit with FTC - Axios",
      "Disney to pay $10 million to settle FTC complaint over collection of children's personal data on YouTube"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.617,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.585,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Disney has agreed to pay $10 million to settle an FTC complaint regarding the unauthorized collection of children's personal data. The settlement resolves allegations that Disney's subsidiary, Playdom, violated the Children's Online Privacy Protection Act.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Putin, Kim Attend WWII Parade in Beijing After Xi-Modi-Putin Summit",
    "domain": "business",
    "source_domain": "www.bbc.co.uk",
    "location": "global",
    "published": "Tue, 02 Sep 2025 19:52:00 GMT",
    "source": "BBC",
    "sources": [
      "Financial Times",
      "BBC"
    ],
    "domains": [
      "www.bbc.co.uk",
      "www.ft.com"
    ],
    "snippets": [
      "Russia’s Vladimir Putin and North Korean leader Kim Jong Un head to Beijing.",
      "North Korean leader thwarts ‘perpetual underestimation’ by turning adversaries into partners"
    ],
    "image_url": "https://ichef.bbci.co.uk/images/ic/240x135/p0l7jnbt.jpg",
    "titles": [
      "The big Putin, Xi and Kim Jong Un meeting",
      "From outcast to ally: Kim Jong Un takes his place beside Xi and Putin"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.642,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.583,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Russian President Vladimir Putin and North Korean leader Kim Jong Un traveled to Beijing to attend a World War II memorial parade. This event occurred shortly after Chinese President Xi Jinping hosted a summit with India's Prime Minister Narendra Modi and Putin.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "NASA Seeks New Wheel Designs for Moon Missions Through Challenge",
    "domain": "science",
    "source_domain": "www.nasa.gov",
    "location": "global",
    "published": "Wed, 03 Sep 2025 13:58:14 +0000",
    "source": "NASA",
    "sources": [
      "NASA"
    ],
    "domains": [
      "www.nasa.gov"
    ],
    "snippets": [
      "The next era of lunar exploration demands a new kind of wheel &#8211; one that can sprint across razor-sharp regolith, shrug off extremely cold nights, and keep a rover rolling day after lunar day. The Rock and Roll with NASA Challenge seeks that breakthrough. If you can imagine a lightweight, compl",
      "NASA’s Human Lander Challenge (HuLC) is an initiative supporting its Exploration Systems Development Mission Directorate’s (ESDMD’s) efforts to explore innovative solutions for a variety of known technology development areas for human landing systems (HLS). Landers are used to safely ferry astronaut"
    ],
    "image_url": "",
    "titles": [
      "Rock and Roll with NASA Challenge",
      "NASA 2026 Human Lander Challenge"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.955,
      "consensus": 0.35,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.509,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "NASA has launched the Rock and Roll with NASA Challenge to find a new wheel design for lunar exploration, capable of handling the moon's harsh terrain and extreme temperatures. This initiative supports the Human Lander Challenge (HuLC), aimed at developing innovative solutions for human landing systems (HLS) to safely transport astronauts as part of the Exploration Systems Development Mission Directorate’s (ESDMD’s) efforts.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "keywords: development, effort, initiative, solution, support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "\"Dancing with the Stars Season 34 Cast Announced for Fall Competition\"",
    "domain": "business",
    "source_domain": "www.forbes.com",
    "location": "global",
    "published": "Wed, 03 Sep 2025 09:13:42 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes"
    ],
    "domains": [
      "www.forbes.com"
    ],
    "snippets": [
      "ABC’s \"Dancing with the Stars\" has unveiled the latest lineup of celebrity contestants ready to hit the ballroom floor.",
      "The full \"Dancing With the Stars\" Season 34 cast has finally been announced. Here are all the celebrities and pros competing this fall for the Len Goodman Mirrorball Trophy."
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/68b83dd9b467b3b60a9f638a/0x0.jpg?width=960",
    "titles": [
      "‘Dancing With The Stars’ Unveils New Celebrity Cast",
      "‘Dancing With The Stars’ Season 34 Cast Revealed—Who Are The Celebrities And Pros?"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.941,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.456,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "ABC's \"Dancing with the Stars\" announced the full cast for Season 34, featuring a lineup of celebrities paired with professional dancers. They will compete this fall for the Len Goodman Mirrorball Trophy.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Nintendo Unveils Switch 2; Legal Debate on Tariffs Persists",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Tue, 02 Sep 2025 21:00:00 GMT",
    "source": "Bloomberg",
    "sources": [
      "Bloomberg"
    ],
    "domains": [
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMiaEFVX3lxTFBFdzdOZy0zUkkwY0hyWkd1MjBmQ2hhQlcyZDdQbXhEUHhWRVVqUVFyUk44LXRyLUNXbjFoOVJZS2dkUG9FTmZQbHNNUUFRRURkV0VyS3dRREdyb0hVN0pzNUpuV1hXdmdH?oc=5\" target=\"_blank\">Switch 2 Shows Nintendo Is Still the Weird Genius of Gaming</a>&nbsp;&nbsp;<font color=",
      "<a href=\"https://news.google.com/rss/articles/CBMijwFBVV95cUxPeHNyUkZKTmlKTWxBeVdDNm5SVEcxQkZWWlB2SUlkZHdISUNmQ2RCODNTRjBMR2wxamh6NzFrckxlX0NablpEWE96WWd0Y2ZCbzktZU9Dd1lubGNCWmRfdkVtMnBwYWUtM2VyZHFOc3FDb1V2bmNqcmstekotSGZMWXh4RlJaWW9IQ3VoNmhuaw?oc=5\" target=\"_blank\">The Tariffs Are Still Illegal</a>"
    ],
    "image_url": "",
    "titles": [
      "Switch 2 Shows Nintendo Is Still the Weird Genius of Gaming - Bloomberg.com",
      "The Tariffs Are Still Illegal - Bloomberg.com"
    ],
    "score_components": {
      "magnitude": 0.393,
      "recency": 0.657,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.406,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Nintendo has launched the Switch 2, reinforcing its reputation as a unique and innovative force in the gaming industry. Separately, a legal analysis continues to argue that certain tariffs remain illegal, without any change in their legal status being reported.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]