[
  {
    "title": "Sean \"Diddy\" Combs Sentenced to Over 4 Years for Prostitution Charges",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Fri, 03 Oct 2025 17:17:13 -0400",
    "source": "NPR",
    "sources": [
      "Deutsche Welle",
      "Al Jazeera",
      "BBC",
      "Business Insider",
      "CityNews",
      "Axios",
      "The Guardian",
      "NPR"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "news.google.com",
      "www.npr.org",
      "www.businessinsider.com",
      "www.bbc.com",
      "www.dw.com",
      "www.aljazeera.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Combs had been convicted in July on two counts of transportation for prostitution. During his sentencing hearing he spoke at length for the first time in the trial, addressing the judge at length.",
      "Combs apologised to his mother, children, and victims, specifically naming his two ex-girlfriends, Casandra Ventura and \"Jane\".",
      "The famed hip-hop mogul told the court that his actions were &#039;disgusting&#039; and &#039;shameful&#039; in a plea for leniency.",
      "The US rapper and record producer was convicted over sexual encounters, capping a sordid federal case that featured harrowing testimony. The judge said \"these were serious offenses that irreparably harmed two women.\"",
      "<a href=\"https://news.google.com/rss/articles/CBMihwFBVV95cUxNNGVad0ZMd0hIWDZMV1dpdmxQZ2tTdTM2UncxRlMtLWlGdkM2aEZrMHEwb3dCejM2RGRiYXFmcW5XTHdRQ2VFcEJaX0YxYlphV2hLNzd6UlpKUTd2OGtpenNxM3laXzVLYnVvS3I2bXI1US1yc0IxaUxHRGZHQkVnVF9nQkc3Um8?oc=5\" target=\"_blank\">Sean \"Diddy\" Combs sentenced to four years f",
      "<p>Combs, who was convicted of ‘transportation to engage in prostitution’, sentenced in New York. This blog is now closed.</p><p><strong>The prosecution <a href=\"https://viewer.gutools.co.uk/us-news/2025/sep/30/sean-diddy-combs-sentence-recommendation\">submitted several victim impact </a>statements ",
      "Sean \"Diddy\" Combs was sentenced to four years in prison Friday after he was convicted in July of two prostitution-related counts.",
      "NEW YORK (AP) —&#160;Sean “Diddy” Combs&#160;was sentenced Friday to four years and two months in prison for transporting people across state lines for sexual encounters, capping a sordid federal case that featured harrowing testimony and ended in a forceful reckoning for&#160;one of the most influe"
    ],
    "image_url": "",
    "titles": [
      "Sean Combs sentenced to over four years in prison for prostitution-related charges",
      "Sean 'Diddy' Combs sentenced to more than four years in prison",
      "Musician Sean ‘Diddy’ Combs sentenced to four years in prison after apology",
      "US: Sean 'Diddy' Combs sentenced to over 4 years in prison",
      "Sean \"Diddy\" Combs sentenced to four years for prostitution charges - Axios",
      "Sean ‘Diddy’ Combs sentenced to more than four years in prison and given $500,000 fine – as it happened",
      "Diddy sentenced to over 4 years in prison for transporting sex workers to 'freak offs'",
      "Sean ‘Diddy’ Combs is sentenced to over 4 years in prison"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.866,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.848,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Sean \"Diddy\" Combs was sentenced to 4 years and 2 months in prison after being convicted on two counts of transportation for prostitution. In his trial, he admitted his actions were \"disgusting\" and \"shameful.\" Despite his plea for leniency and the prosecution's push for a longer sentence of 11 years and three months, the judge determined the crimes caused irreparable harm to two women and emphasized the need for a lengthy sentence to serve as a deterrent.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Hamas Agrees to Release Hostages, Engages in Peace Talks with Trump's Plan",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Fri, 03 Oct 2025 12:26:36 -0400",
    "source": "NPR",
    "sources": [
      "New York Times",
      "Al Jazeera",
      "Axios",
      "Financial Times",
      "The Guardian",
      "Fortune",
      "NPR",
      "ABC News"
    ],
    "domains": [
      "www.nytimes.com",
      "news.google.com",
      "www.npr.org",
      "www.ft.com",
      "abcnews.go.com",
      "www.aljazeera.com",
      "www.theguardian.com",
      "fortune.com"
    ],
    "snippets": [
      "Hamas said it would agree to release the remaining Israeli hostages in exchange for Palestinian prisoners. Despite not agreeing to the full U.S. peace proposal, President Trump said the group seemed ready for peace.",
      "US leader tells Israel it &#039;must immediately stop&#039; bombing Gaza, says he believes Hamas is &#039;ready for a lasting peace&#039;.",
      "<a href=\"https://news.google.com/rss/articles/CBMif0FVX3lxTE1vUzN3NUNhdW5KdGZNLW0tdndmRk0tU3p3aDhxMkdHLW84YVJCTGR0RnFvTl8zVHNLU090NTBfMEpzN3JFbUQ1VERoV1phR1RRX1g0QXhnWmk3ektQTFdNZFBDcm8ydERPWVI3U01vaGZfMHR5cy1jTm5qV1NYLVE?oc=5\" target=\"_blank\">Trump tells Israel to stop bombing Gaza after Hamas resp",
      "Hamas said Friday it will release all remaining hostages if Israel withdraws from Gaza and \"proper field conditions are met.\"",
      "US president says he ‘believes’ Palestinian militant group is ‘ready for a lasting peace’",
      "<p>Palestinian militant group accepts part of US president’s plan but seeks further negotiations on many terms</p><p>Donald Trump ordered Israel to “immediately” stop bombing Gaza as he welcomed Hamas’s partial acceptance of his ultimatum to end the nearly two-year war.</p><p>Hamas has agreed to rel",
      "Hamas said it would release the Israeli hostages but wanted to negotiate elements of the Trump plan. Later, in a video, President Trump said, “Everybody was unified in wanting this war to end and seeing peace in the Middle East, and we’re very close to achieving that.”",
      "President Trump said he believed Hamas was “ready for a lasting peace” after the militant group offered to release hostages and discuss the U.S.-led peace proposal.",
      "Hamas said it was willing to release the hostages and hand over power to other Palestinians, but that other aspects of the plan require further consultations among Palestinians."
    ],
    "image_url": "",
    "titles": [
      "Trump tells Israel to stop bombing Gaza after Hamas agrees to release Israeli hostages",
      "LIVE: Trump says Hamas ‘ready for peace’, tells Israel to stop bombing Gaza",
      "Trump tells Israel to stop bombing Gaza after Hamas responds to peace plan - Axios",
      "Israel-Gaza live updates: Trump weighs in on Hamas response to Gaza plan",
      "Trump tells Israel to stop bombing Gaza after Hamas agrees to release hostages",
      "Donald Trump orders Israel to ‘immediately’ stop bombing Gaza as Hamas agrees to free hostages",
      "Middle East Updates: Trump Says Hamas Is Ready for Peace and Tells Israel to Stop Bombing",
      "Trump Calls on Israel to Stop Bombing Gaza After Hamas Agrees to Parts of Cease-Fire Plan",
      "Trump orders Israel to stop bombing Gaza after Hamas partially accepts his peace plan"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.783,
      "consensus": 1.0,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.842,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Hamas has agreed to release Israeli hostages and accepted parts of President Trump's peace plan to end the nearly two-year war, but seeks further negotiations on many terms. Trump has ordered Israel to immediately stop bombing Gaza, signaling a potential move towards peace. Despite not fully agreeing to the U.S. proposal, Hamas's willingness to discuss the plan and release hostages has been acknowledged by Trump as a step towards achieving lasting peace in the Middle East.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "U.S. Strike Kills 4 on Suspected Drug Boat in Caribbean",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 20:07:02 +0000",
    "source": "Al Jazeera",
    "sources": [
      "New York Times",
      "Deutsche Welle",
      "Al Jazeera",
      "Washington Post",
      "The Guardian"
    ],
    "domains": [
      "www.nytimes.com",
      "www.washingtonpost.com",
      "www.dw.com",
      "www.aljazeera.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "The US has released video it says shows its military striking a boat near the coast of Venezuela, killing four.",
      "The US said it carried out another strike on a small boat in the Caribbean Sea, killing four people on board. Pentagon chief Pete Hegseth said \"narco-terrorists\" were the target.",
      "<p>Pentagon chief says strike – fourth by US military in recent weeks – targeted boat with ‘substantial amounts’ of drugs</p><p>The United States carried out a strike against an alleged drug-trafficking boat on Friday that killed four people, US defense secretary <a href=\"https://www.theguardian.com",
      "The U.S. strike near Venezuela is the latest in the Trump administration’s legally nebulous campaign targeting Latin American drug cartels.",
      "It was the fourth strike in the Trump administration’s legally disputed campaign targeting suspected drug runners in the Caribbean Sea."
    ],
    "image_url": "",
    "titles": [
      "US releases video of another strike on a boat near Venezuela",
      "US strikes drug alleged boat near Venezuelan waters",
      "Hegseth says four killed in US strike on alleged drug boat off Venezuelan coast",
      "U.S. kills 4 alleged drug smugglers near Venezuela, Hegseth says",
      "U.S. Military Attacked Boat Off Venezuela, Killing Four Men, Hegseth Says"
    ],
    "score_components": {
      "magnitude": 0.964,
      "recency": 0.845,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.805,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The U.S. conducted a strike in the Caribbean Sea, killing four individuals on a boat suspected of drug trafficking. This action, confirmed by Pentagon Chief Pete Hegseth, marks the fourth similar strike by the U.S. military under the Trump administration's campaign against Latin American drug cartels. The operation is part of a series targeting vessels believed to be carrying substantial amounts of drugs.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Sarah Mullally Appointed First Female Archbishop of Canterbury",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 17:58:26 +0000",
    "source": "Al Jazeera",
    "sources": [
      "New York Times",
      "Deutsche Welle",
      "Al Jazeera",
      "Washington Post",
      "The Guardian"
    ],
    "domains": [
      "www.nytimes.com",
      "www.washingtonpost.com",
      "www.dw.com",
      "www.aljazeera.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Announcement draws criticism from Anglican churches that oppose female bishops.",
      "Sarah Mullally will become the first female leader when she officially takes charge of the church in March 2026. A group of conservative Anglican churches across Africa and Asia criticized the appointment.",
      "Sarah Mullally, previously the bishop of London, is the first woman to serve as spiritual leader of the Church of England in its nearly 500-year history.",
      "Sarah Mullally, the bishop of London, has been appointed archbishop of Canterbury. She has been a vocal supporter of the rights of women in the church.",
      "<p>Former chief nursing officer for England will legally assume role at Canterbury Cathedral ceremony in January</p><p>Dame Sarah Mullally has been named as the first female leader in the history of the Church of England as Downing Street announced the 106th archbishop of Canterbury nearly a year on"
    ],
    "image_url": "",
    "titles": [
      "Church of England names first female archbishop of Canterbury",
      "First female Archbishop appointed to lead Church of England",
      "First woman is named archbishop of Canterbury, leader of Church of England",
      "Sarah Mullally Is Named as First Female Archbishop of Canterbury",
      "Sarah Mullally is named as first female archbishop of Canterbury"
    ],
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.809,
      "consensus": 0.995,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.801,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Sarah Mullally has been appointed as the new Archbishop of Canterbury, marking the first time a woman will lead the Church of England and its 85 million Anglicans globally. Previously the Bishop of London and a former chief nursing officer, Mullally's historic appointment follows Justin Welby's resignation last year. She is recognized for her support of women's rights within the church. Mullally will officially assume her role in a ceremony at Canterbury Cathedral in January, becoming the 106th archbishop in the Church's history.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Supreme Court Backs Trump Policy, Ends Protections for 300K Immigrants",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 21:48:49 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Washington Post",
      "LA Times",
      "Forbes",
      "Al Jazeera"
    ],
    "domains": [
      "www.latimes.com",
      "www.aljazeera.com",
      "www.forbes.com",
      "www.washingtonpost.com"
    ],
    "snippets": [
      "The US court&#039;s conservative supermajority once again backed Trump&#039;s efforts to limit temporary immigration pathways.",
      "A federal judge had ruled on Sept. 5 that Homeland Security Secretary Kristi L. Noem broke the law by revoking the temporary protected status of Venezuelan and Haitian immigrants.",
      "<p>Trump's lawyers said the new administration had the right to cancel Biden's temporary protections for immigrants.</p>",
      "The Supreme Court, in a 6-3 split, granted another emergency request to revoke Temporary Protected Status to about 300,000 Venezuelans."
    ],
    "image_url": "",
    "titles": [
      "Supreme Court allows Trump to nix temporary status for Venezuelan migrants",
      "Supreme Court will let Trump end protected status for Venezuelans for now",
      "Supreme Court says again Trump may cancel temporary protections for Venezuelans granted under Biden",
      "Supreme Court Lets Trump Administration End Protections For Venezuelan Immigrants"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.876,
      "consensus": 0.908,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.781,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The US Supreme Court, with a conservative supermajority, supported the Trump administration's move to revoke Temporary Protected Status for Venezuelan and Haitian immigrants, affecting about 300,000 individuals. This decision came after a lower court had ruled that Homeland Security Secretary Kristi L. Noem's cancellation of the protections was unlawful. The court's 6-3 split decision temporarily halts the lower court's ruling.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Deputy PM Heckled at Vigil for Manchester Synagogue Attack Victims",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 21:24:36 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Washington Post",
      "Financial Times",
      "Deutsche Welle",
      "Al Jazeera"
    ],
    "domains": [
      "www.dw.com",
      "www.aljazeera.com",
      "www.ft.com",
      "www.washingtonpost.com"
    ],
    "snippets": [
      "Deputy Prime Minister David Lammy heckled by members of the public at vigil for victims of attack.",
      "Two people were killed and three seriously injured in an attack on a synagogue in Manchester on Thursday. Police said one victim may have been accidentally shot by officers, as the attacker had no firearm.",
      "More details emerge about the attacker, who had recently been arrested on suspicion of rape and bailed",
      "The police identified two people killed in an attack at a synagogue in Manchester, England, and said they were still trying to learn more about the assailant’s motives."
    ],
    "image_url": "",
    "titles": [
      "Police say one victim possibly shot by officer during Manchester attack",
      "UK synagogue attack: Police likely shot one victim",
      "Victim killed in Manchester synagogue attack was shot by police",
      "One victim in Yom Kippur synagogue attack in England was shot dead by police"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.869,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.763,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "At a vigil for victims of a Manchester synagogue attack, Deputy Prime Minister David Lammy was heckled. The attack resulted in two deaths and three serious injuries. Police stated one victim might have been accidentally shot by officers, as the attacker was unarmed. The assailant, previously arrested on suspicion of rape, had been bailed before the attack. Authorities are investigating the motive behind the incident.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Proposes 20-Point Gaza Peace Plan, Threatens Hamas with Consequences",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Fri, 03 Oct 2025 16:19:01 -0400",
    "source": "NPR",
    "sources": [
      "Axios",
      "NPR",
      "Al Jazeera"
    ],
    "domains": [
      "news.google.com",
      "www.aljazeera.com",
      "www.npr.org"
    ],
    "snippets": [
      "Hamas said it has accepted some elements of President Trump's plan, including giving up power and releasing all remaining hostages, but that others require further consultations among Palestinians.",
      "Palestinian group says it is ready to release all Israeli captives held in Gaza after US president issues ultimatum.",
      "<a href=\"https://news.google.com/rss/articles/CBMieEFVX3lxTE4yS2JEQU1ySW5fRXd3Tkxsc0hsYWVSb2Z0SW1xWFY3dTF5RUlPd0pYWFRKMFYweEs3emJ4NWpsR2FieU1MLW1zei1ZTi1wQjczYmxNVWRKVFRnU20wcGo2VmhfVnZpeW1ldkJWWVZIdG1tcDhvYUROYQ?oc=5\" target=\"_blank\">Trump says Hamas must accept Gaza peace deal by Sunday, or war es"
    ],
    "image_url": "",
    "titles": [
      "Hamas says it accepts some elements of Gaza peace plan after Trump issues ultimatum",
      "Hamas says it agrees to parts of Trump’s Gaza plan but seeks more talks",
      "Trump says Hamas must accept Gaza peace deal by Sunday, or war escalates - Axios"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.849,
      "consensus": 0.789,
      "constructiveness": 0.2,
      "proximity": 0.75
    },
    "score": 0.758,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "President Trump has proposed a 20-point plan aimed at ending the conflict in Gaza, which includes an immediate ceasefire, the release of hostages and detained Gazans, and the temporary control of Gaza by a \"Board of Peace\" chaired by himself. Critics argue the plan does not support Palestinian sovereignty. Trump warned that failure to accept the deal by Sunday would lead to severe consequences against Hamas, which is currently divided on the response. Egypt and Qatar are attempting to persuade Hamas to agree to the ultimatum.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: plan, support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "WNBA's Engelbert Responds to Criticism, Seeks to Mend Player Relations",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sat, 04 Oct 2025 01:16:46 +0000",
    "source": "CBS Sports",
    "sources": [
      "Sportsnet",
      "CityNews",
      "CBS Sports"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "www.cbssports.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "'Obviously, I did not make those comments,' Engelbert said",
      "Engelbert has come under significant fire this week, particularly from the players",
      "Engelbert faces blazing criticism from WNBA players, but the NBA's ownership and influence remain the central challenge to the league's future",
      "<p>WNBA commissioner Cathy Engelbert said Friday there&#8217;s work to be done to repair relationships with players in the league, while adding that there were “inaccuracies” in some of the comments attributed to her by Napheesa Collier in a blistering assessment earlier this week.</p>",
      "LAS VEGAS (AP) — WNBA Commissioner Cathy Engelbert said Friday there&#8217;s work to be done to repair relationships with players in the league, while adding that there were “inaccuracies” in some of the comments attributed to her by Napheesa Collier in a blistering assessment earlier this week. “I "
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/10/04/68ec3d3e-1822-4d6d-b484-c8c24681dbea/untitled-design-30.png",
    "titles": [
      "WNBA commissioner Cathy Engelbert denies saying Caitlin Clark needs to be 'grateful' for WNBA platform",
      "WNBA commissioner Cathy Engelbert says she won't resign: 'I've never been a quitter'",
      "WNBA commissioner Cathy Engelbert is under fire, but the NBA is the real power worth challenging",
      "WNBA commissioner Cathy Engelbert vows to repair trust after facing criticism",
      "WNBA Commissioner Cathy Engelbert vows to repair player relationships"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.941,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.725,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "WNBA Commissioner Cathy Engelbert addressed criticism from players, stating there are inaccuracies in comments attributed to her by Napheesa Collier. Engelbert acknowledged the need to repair relationships with players amid the controversy. She refuted making certain remarks and highlighted ongoing challenges, including the NBA's influence on the WNBA's future.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Coalition Sues Over $100K H-1B Visa Fee, Claiming Excess Authority",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 22:09:43 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Business Insider",
      "Financial Post",
      "Al Jazeera"
    ],
    "domains": [
      "financialpost.com",
      "www.aljazeera.com",
      "www.businessinsider.com"
    ],
    "snippets": [
      "The lawsuit claims Trump does not have the authority to override the law that created the H-1B visa programme.",
      "A coalition of unions and other groups called President Donald Trump's new H-1B visa fee \"extortionate\" and \"draconian\" in a lawsuit filed Friday.",
      "SEATTLE (AP) &#8212; In what appears to be the first major challenge to the new $100,000 fee required for H-1B visa applications, a coalition of health care providers, religious groups, university professors and others filed a federal lawsuit Friday to stop the plan, saying it has &#8220;thrown empl"
    ],
    "image_url": "",
    "titles": [
      "First lawsuit filed challenging Trump’s $100,000 H-1B visa fee",
      "Trump administration's $100,000 H-1B visa fee challenged in new lawsuit",
      "Lawsuit seeks to stop Trump’s $100,000 fee for H-1B visas"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.882,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.72,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A coalition, including health care providers and university professors, filed a lawsuit to challenge a new $100,000 fee for H-1B visa applications, claiming it exceeds Trump's authority and disrupts employment. This marks a significant legal opposition to the fee imposed on the visa program designed for specialized foreign workers.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Yom Kippur Attack at Synagogue Kills 2; Israel Detains Activists, Starbucks Cuts",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 20:49:28 GMT",
    "source": "BBC",
    "sources": [
      "Financial Times",
      "New York Times",
      "BBC"
    ],
    "domains": [
      "www.nytimes.com",
      "www.ft.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Two Jewish people were killed in a car and stabbing attack at Heaton Park Hebrew Congregation Synagogue in Manchester on the holiest day in the Jewish religious calendar.",
      "Shocked family condemns atrocity as ‘heinous act’",
      "Japan’s beleaguered governing party will convene for a crucial election that could pave the way for the first female prime minister or the youngest leader in 140 years.",
      "Two people were killed on Yom Kippur after a driver rammed a vehicle into people in Manchester and stabbed others. One man who died was accidentally shot by the police, who also killed the attacker."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/4d22/live/aa332190-a079-11f0-b741-177e3e2c2fc7.jpg",
    "titles": [
      "What we know about the attack",
      "What we know about Manchester synagogue attacker Jihad Al-Shamie",
      "What to Know About Japan’s Leadership Election",
      "Synagogue Attack on Yom Kippur in Manchester, UK: What We Know"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.84,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.719,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Two individuals were killed in a car and stabbing attack at Heaton Park Hebrew Congregation Synagogue during Yom Kippur, with the assailant also deceased. Meanwhile, Israeli forces detained activists from several aid boats in international waters, amidst criticism of international inaction on the situation in Gaza. Additionally, Starbucks announced the closure of 1% of its North American stores, though specific locations were not disclosed.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Munich Airport Halts Flights Amid Drone Sightings, Affects Oktoberfest",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-10-03T21:40:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "New York Times",
      "Deutsche Welle",
      "The Guardian"
    ],
    "domains": [
      "www.dw.com",
      "www.nytimes.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Both runways at Munich Airport have been closed for the second time in 24 hours after further \"unconfirmed drone sightings.\" A drone was earlier sighted over a nearby military facility. DW has more.",
      "The disruption comes as Munich hosts its world-famous Oktoberfest beer festival, which runs until Sunday. Last week, Denmark and Norway closed airports due to drones.",
      "<p>About 6,500 passengers stranded as interior minister says earlier drone incident a ‘wake-up call’</p><p>Munich airport was forced to halt operations for the second day in a row on Friday over drone sightings, with dozens of flights and more than 6,000 passengers affected.</p><p>Airports in Denmar",
      "The airport in Germany was the latest in Europe to shut because of drone sightings. Officials have blamed Russia, which has denied being behind the drone incursions."
    ],
    "image_url": "",
    "titles": [
      "Germany: Munich Airport closes again amid drone sightings",
      "Germany: Drone sightings disrupt Munich Airport",
      "Munich airport forced to suspend flights for second day in a row over drone sightings",
      "Flights Are Briefly Halted at Munich Airport After Drone Sightings"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.873,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.718,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Munich airport suspended operations due to drone sightings on Thursday evening, affecting the Oktoberfest beer festival. This led to 17 flight cancellations and disrupted nearly 3,000 travelers. This incident is part of a series of drone disruptions in European aviation, with officials blaming Russia, which has denied the accusations.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Senators Trade for MacDermid from Devils, Seek Roster Toughness",
    "domain": "sports",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Fri, 03 Oct 2025 21:54:29 GMT",
    "source": "NHL",
    "sources": [
      "Sportsnet",
      "Ottawa Citizen",
      "NHL"
    ],
    "domains": [
      "news.google.com",
      "ottawacitizen.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMikgFBVV95cUxPMFN3d3kxMmdzNk16MjJCS1lucWYxdWsxRWRaUGk3dENvd3FBQ3BlVGtaV05jdWxhcHlpSEIwUk5JdjA5XzVVR3V2WXd2T2wtX3ZXamdNWEd1a0ZVOWdOVHFESGZsLXAzT1JBaURLWjhwcUF6d1RnbnB4YTZqSnVPTTVTRGtoWWU2bmlZZjNyMkVzUQ?oc=5\" target=\"_blank\">Senators acquire Kurtis MacDe",
      "<a href=\"https://news.google.com/rss/articles/CBMilAFBVV95cUxNWEdNck9VVExkWWtIUU5oOTlYWUlTVGo4bDRNak55Y0ZSOWZJMU9JVzZZTHV6WFhTY19WSGhZUXpzczZoS1B3Wk12RzFIeGNYV3hGTV9xZU1KMC1fQ2dhbHVxam01NjdFWUczTUVKX251OWs2WDNtQ1pwX056SnBZbWVzV0cwZDJIMTJ0LTRpNGJQUnBX?oc=5\" target=\"_blank\">Senators acquire winger Kur",
      "<a href=\"https://news.google.com/rss/articles/CBMiigFBVV95cUxQX2F0Nk83YWQtRUJzQTJkMFV5ekpDd3lzNDI5eWktZ2QxVGg4a2tIMFBmMnlZeHpTVEpSbjJ4WjlPcVh1TURIWmg0LXJYanNNZkNxak5ibjJQeXVuM0dybDBhbmFkcFNwNDdGWW9sVW44WU10Z2d5QjVNaEVJMVhiOWdWZFlGb3pTTkE?oc=5\" target=\"_blank\">Devils Acquire MacEwen from Ottawa | REL",
      "<p>The Ottawa Senators added some depth on Friday, acquiring veteran enforcer Kurtis MacDermid from the New Jersey Devils in exchange for Zack MacEwen.</p>",
      "The Ottawa Senators have served notice to the Atlantic Division that they won&#8217;t be pushed around. After taking it on the chin from the Montreal Canadiens in a 5-0 loss on Tuesday in Quebec City, the Senators served notice on Friday night that they won&#8217;t stand still by acquiring Kurtis Ma"
    ],
    "image_url": "",
    "titles": [
      "Senators acquire Kurtis MacDermid in trade with Devils - NHL.com",
      "Senators acquire winger Kurtis MacDermid from New Jersey - NHL.com",
      "Devils Acquire MacEwen from Ottawa | RELEASE | New Jersey Devils - NHL.com",
      "Senators acquire Kurtis MacDermid from Devils in exchange for Zack MacEwen",
      "Ottawa Senators add muscle by acquiring Kurtis MacDermid from Devils"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.86,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.716,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Ottawa Senators acquired winger Kurtis MacDermid from the New Jersey Devils in exchange for Zack MacEwen, aiming to add depth and toughness to their roster. This move comes after a significant 5-0 loss to the Montreal Canadiens, signaling the Senators' intent to enhance their competitiveness in the Atlantic Division.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Wigan Warriors Beat Leigh Leopards 18-6, Eye Third Straight Super League Title",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 21:09:19 GMT",
    "source": "BBC",
    "sources": [
      "Sky Sports",
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "www.skysports.com",
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Bevan French keeps Wigan on course for a hat-trick of Super League titles as the Warriors see off Leigh Leopards to reach the Grand Final.",
      "<ul><li><p>Super League playoff semi-final: Wigan 18-6 Leigh</p></li><li><p>Wigan grateful to Jai Field’s amazing second-half tackle</p></li></ul><p>It was a week which began with unexpected controversy and the prospect of this game not even taking place. But, in the end, there was an all too famili",
      "Wigan Warriors booked a spot in the Super League Grand Final with an 18-6 victory over neighbours Leigh Leopards at The Brick Community Stadium."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/6c84/live/89979f10-a092-11f0-b1b3-b903aa8071ae.jpg",
    "titles": [
      "French double books Grand Final return for Wigan",
      "French sees off Leigh to put Wigan in Grand Final after week of acrimony",
      "Wigan book spot in Grand Final with victory over Leigh"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.846,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.713,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Wigan Warriors advanced to the Super League Grand Final after defeating Leigh Leopards 18-6, keeping their hopes for a third consecutive title alive. Key contributions included Bevan French's performance and Jai Field's crucial second-half tackle. The match, held at The Brick Community Stadium, followed a week of controversy but ultimately proceeded as planned.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Bournemouth Beats Fulham 3-1, Climbs to Second in Premier League",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 21:29:54 GMT",
    "source": "BBC",
    "sources": [
      "Sportsnet",
      "Sky Sports",
      "BBC"
    ],
    "domains": [
      "www.skysports.com",
      "www.sportsnet.ca",
      "www.bbc.com"
    ],
    "snippets": [
      "Antoine Semenyo nets twice and Justin Kluivert scores a screamer as Bournemouth come from behind to beat Fulham in stormy conditions and move up to second in the Premier League table.",
      "Pieces of individual brilliance from Antoine Semenyo and Justin Kluivert helped Bournemouth come from behind against Fulham to climb up to second in the Premier League.",
      "<p>Bournemouth came from 1-0 down and scored three late goals to defeat Fulham 3-1 in a pulsating and blustery Premier League encounter on Friday.</p>"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/8cf8/live/da102220-a09f-11f0-b741-177e3e2c2fc7.jpg",
    "titles": [
      "Semenyo scores twice as Bournemouth beat Fulham",
      "Semenyo and Kluivert stunners send Bournemouth second after Fulham comeback",
      "Semenyo salvages win for Bournemouth against Fulham on wet and windy night"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.852,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.707,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Antoine Semenyo scored twice and Justin Kluivert netted a spectacular goal as Bournemouth overcame a 1-0 deficit to defeat Fulham 3-1 in challenging weather conditions. This victory propelled Bournemouth to second place in the Premier League standings.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UK Police Arrest 3 More in Manchester Synagogue Attack, Total Now 6",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 20:44:04 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "ABC News",
      "The Guardian"
    ],
    "domains": [
      "abcnews.go.com",
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Counter terrorism police arrest three more people as part of the investigation into Thursday's attack.",
      "Police on Friday identified the two men who were killed in an attack on a synagogue in Manchester, as Britain’s chief rabbi said an “unrelenting wave” of antisemitism lay behind the crime.",
      "<p>Police arrest three more people, bringing the total to six, Justice secretary faces calls of ‘shame on you’ as crowd gathers to remember victims of terror attack</p><ul><li><p><a href=\"https://www.theguardian.com/uk-news/2025/oct/03/what-do-we-know-about-jihad-al-shamie-the-manchester-synagogue-a"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/6aa9/live/24098e70-a096-11f0-a918-e111dd54869c.jpg",
    "titles": [
      "Three more arrests over synagogue attack",
      "WATCH:  UK authorities search for motive in synagogue attack",
      "Three more arrests in synagogue attack investigation; Lammy heckled at vigil for Manchester synagogue attack – as it happened"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.839,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.705,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "British counter-terrorism police arrested three additional individuals in connection to the attack on a Manchester synagogue, raising the total number of arrests to six. The incident, which resulted in the deaths of two men, has been linked by Britain’s chief rabbi to a surge of antisemitism. Public outcry and memorials for the victims are ongoing, with some voices directing criticism towards the Justice Secretary.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Lamar Jackson Out for Week 5, Ravens Miss 4 Pro Bowlers Against Texans",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Fri, 3 Oct 2025 22:52:37 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.espn.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "After not practicing all week, quarterback Lamar Jackson has been ruled out for the Ravens, who will be without four Pro Bowlers in all against the Texans.",
      "<p>Superstar quarterback Lamar Jackson has officially been ruled out of the Ravens&#8217; Week 5 matchup against the Houston Texans, the team announced Friday. </p>"
    ],
    "image_url": "",
    "titles": [
      "Ravens rule out QB Jackson due to hamstring",
      "Ravens rule out QB Lamar Jackson for Week 5 matchup vs. Texans"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.973,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.682,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Lamar Jackson, the Ravens' quarterback, will not play in Week 5 against the Texans after not practicing all week. This adds to the team's challenges as they are already off to a 1-3 start and will be missing four Pro Bowlers in total for the game.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Evans Leads Aces to 89-86 Victory Over Mercury in WNBA Finals Game 1",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Fri, 3 Oct 2025 22:52:37 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.espn.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Dana Evans (21 points) led an Aces bench that outscored the Mercury's reserves 41-16 en route to an 89-86 win in Game 1 of the WNBA Finals on Friday night.",
      "<p>The Aces series-opening win against the Mercury was an appetizer into how these teams, and in particular, how A&#8217;ja Wilson and Alyssa Thomas could match up for the rest of the series.</p>\n<p>Kai Gammage covers that and more in his takeaways from Game 1 of the WNBA Finals.</p>"
    ],
    "image_url": "",
    "titles": [
      "Aces' bench leads way in Game 1 win vs. Mercury",
      "WNBA Finals Game 1 Takeaways: Wilson, Aces get upper hand vs. Thomas, Mercury"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.973,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.675,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Dana Evans scored 21 points, leading the Aces' bench to outscore the Mercury's reserves 41-16, securing an 89-86 victory in Game 1 of the WNBA Finals. This win highlights the potential matchups between A'ja Wilson and Alyssa Thomas for the series.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Justice Dept. Urges Apple to Remove ICE Tracking Apps, Citing Risks",
    "domain": "technology",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-10-03T06:17:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Ars Technica",
      "Deutsche Welle",
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com",
      "www.dw.com",
      "arstechnica.com"
    ],
    "snippets": [
      "The Justice Department reportedly reached out to Apple to take down ICEBlock and similar apps, citing security risks to immigration enforcement officers.",
      "The app, which went viral earlier this year, allowed users to lawfully share information about where they've seen ICE agents within a 5-mile radius of their location, and also share details of the clothing agents are wearing.",
      "Apple nixes tracking apps after Trump admin claimed they put ICE agents at risk."
    ],
    "image_url": "",
    "titles": [
      "Apple pulls ICE tracking apps after Trump admin request",
      "Apple removes ICEBlock and similar tracking apps from the App Store",
      "Apple removes ICEBlock, won’t allow apps that report locations of ICE agents"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.634,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.664,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Justice Department requested Apple to remove ICEBlock and similar apps, arguing they pose security risks to ICE agents by allowing users to share their locations and clothing details. Following these concerns, Apple has removed these tracking apps, which had gained popularity for enabling users to lawfully report sightings of ICE agents.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Gavin McKenna Shines in NCAA Debut, Records Two Assists",
    "domain": "sports",
    "source_domain": "sports.yahoo.com",
    "location": "national",
    "published": "Sat, 04 Oct 2025 03:56:49 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Sportsnet",
      "Yahoo Sports"
    ],
    "domains": [
      "sports.yahoo.com",
      "www.sportsnet.ca",
      "www.abc27.com"
    ],
    "snippets": [
      "Gavin McKenna had two first-period assists in his Penn State debut Friday night, and the Nittany Lions trailed Arizona State 3-2 after two periods.  Expected to be the No. 1 pick next year in the NHL draft, the 17-year-old McKenna set up Aiden Fink's power-play goal with 9:05 left in the first and a",
      "(WHTM) — Gavin McKenna scored his first two points in the first period of his NCAA Division 1 ice hockey debut Friday night as the Penn State Nittany Lions faced Arizona State. The NHL’s consensus top draft prospect was credited with an assist on both goals, giving the Nittany Lions a 2-0 advantage ",
      "<p>Watch as Gavin McKenna holds the offensive zone and delays, before finding Aiden Fink for a power play, to record his first career point in his NCAA debut for Penn State.</p>"
    ],
    "image_url": "",
    "titles": [
      "Gavin McKenna has 2 1st-period assists in his Penn State debut at Arizona State",
      "McKenna scores two assists in first period of Penn State debut",
      "Gavin McKenna shows off his vision to record assist in NCAA debut"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.995,
      "consensus": 0.611,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.659,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In his NCAA debut, 17-year-old Gavin McKenna, expected to be next year's No. 1 NHL draft pick, recorded two assists in the first period for Penn State against Arizona State. His contributions helped the Nittany Lions to a 2-0 lead before they ultimately trailed 3-2 after two periods. McKenna's performance highlighted his potential impact in collegiate ice hockey and his promising future in the sport.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Las Vegas, Phoenix Vie for 2025 WNBA Title Starting Friday",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sat, 04 Oct 2025 02:18:32 +0000",
    "source": "CBS Sports",
    "sources": [
      "Yahoo Sports",
      "CBS Sports"
    ],
    "domains": [
      "www.sportingnews.com",
      "sports.yahoo.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Las Vegas struck first, taking a 1-0 lead in the best-of-seven series",
      "It's Las Vegas vs. Phoenix for the 2025 title",
      "Here is everything that you need to know about watching the 2025 WNBA Playoffs, including a full schedule with TV and streaming information for every game.",
      "Here is everything you need to know about the 2025 WNBA Finals, including TV channels and streaming options for the championship series between the Aces and Mercury.",
      "Las Vegas guard Dana Evans drilled a go-ahead three-pointer with 3:40 remaining and the Aces held on to beat the Phoenix Mercury 89-86 in game one of the WNBA Finals in Las Vegas on Friday.Jewell Loyd added 18 points off the bench for Las Vegas while Kahleah Copper led the Mercury with 21 points."
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/10/01/0120b163-8721-4176-89f8-9dbe170dc6b7/wnba-playoff-bracket-mercury-aces-finals1.png",
    "titles": [
      "WNBA playoff bracket, Finals schedule: Aces vs. Mercury game times, TV channel, where to watch",
      "2025 WNBA Finals: Aces vs. Mercury schedule, prediction, players to watch",
      "WNBA Playoffs schedule 2025: Full bracket, times, TV channels, live streams to watch every series",
      "WNBA Finals schedule 2025: Times, TV channels, live streams to watch Aces vs. Mercury series",
      "Aces hold off Mercury in WNBA Finals game one"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.962,
      "consensus": 0.611,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.652,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Las Vegas and Phoenix are set to compete in the WNBA Finals starting Friday, with the 2025 title at stake. The outcome will likely hinge on which team's top three players perform best.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Aces Rally to Beat Mercury 89-86 in WNBA Finals Game 1",
    "domain": "business",
    "source_domain": "sports.yahoo.com",
    "location": "national",
    "published": "Sat, 04 Oct 2025 03:04:54 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Forbes",
      "Yahoo Sports"
    ],
    "domains": [
      "sports.yahoo.com",
      "www.forbes.com"
    ],
    "snippets": [
      "The Las Vegas Aces did what championship teams do: they bent without breaking.  After trailing for much of Friday night’s Game 1, they stormed back behind a blistering fourth-quarter surge to edge the Phoenix Mercury 89-86 and take the opener of the WNBA finals in Las Vegas.  Phoenix seemed in contr",
      "The Las Vegas Aces take game one of the WNBA Finals over the Phoenix Mercury. Historically, teams that win the first game of the series overwhelmingly win the WNBA title."
    ],
    "image_url": "",
    "titles": [
      "Unyielding Aces rally late to edge Mercury in WNBA finals opener",
      "Las Vegas Aces Take WNBA Finals Game One Over The Phoenix Mercury"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.978,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.651,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Las Vegas Aces rallied in the fourth quarter to defeat the Phoenix Mercury 89-86 in Game 1 of the WNBA Finals in Las Vegas. After trailing for most of the game, the Aces' late surge secured them the opening victory. Historically, winning the first game significantly increases a team's chances of claiming the WNBA title.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UK EV Sales Hit Record in September, Over Half of New Cars Electric or Hybrid",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 04 Oct 2025 00:41:12 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Sales of fully electric or hybrid vehicles made up more than half of all new car registrations in the UK last month.",
      "<p>EVs rise nearly a third in September compared with a year earlier, as plug-in hybrids jump by 56%</p><p>British electric car sales hit a record high in September as new taxpayer subsidies helped to attract buyers in the most important month for the market.</p><p>Battery EV sales rose by nearly a "
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/e058/live/ac7c44b0-a06d-11f0-8687-4726d7177866.jpg",
    "titles": [
      "Sales of electric cars hit record high in September",
      "UK electric car sales hit record high as taxpayer subsidies help attract buyers"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.911,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.637,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In September, the UK saw a record high in electric vehicle (EV) sales, with fully electric and hybrid vehicles comprising over half of all new car registrations. This surge, nearly a third higher for EVs and a 56% increase for plug-in hybrids compared to the previous year, was significantly boosted by new taxpayer subsidies, marking September as a pivotal month for the market.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Drone Kills Journalist in Ukraine, a First: European Federation",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-10-03T19:38:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "New York Times",
      "Deutsche Welle"
    ],
    "domains": [
      "www.dw.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "The European Federation of Journalists said Antoni Lallican's death marks the first time a journalist had been killed by a drone in the Ukraine conflict.",
      "Antoni Lallican, a Paris-based photographer, is the first working journalist to be killed by a remotely piloted drone during the war, according to press associations."
    ],
    "image_url": "",
    "titles": [
      "Ukraine: French photojournalist killed by Russian drone",
      "French Photojournalist Killed in Drone Attack in Ukraine"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.837,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.636,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Antoni Lallican, a Paris-based photographer, became the first journalist to be killed by a drone in the Ukraine conflict, as confirmed by the European Federation of Journalists. This incident marks a tragic milestone in the war, highlighting the dangers journalists face while reporting.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Jihad Al-Shamie Attacks Synagogue, Was on Bail for Prior Alleged Crime",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 22:02:32 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Counter terror police also say Al-Shamie may have been influenced by \"extreme Islamist ideology\".",
      "<p>Exclusive: Jihad al-Shamie had been under investigation over alleged sexual attack earlier this year, sources say</p><p>The Manchester synagogue terrorist was on police bail for an alleged rape when he carried out the attack, the Guardian can reveal.</p><p>Jihad al-Shamie, 35, was being investiga"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/7014/live/b50aaa10-a09d-11f0-85af-1377c963b9be.jpg",
    "titles": [
      "Synagogue attacker was on bail after rape arrest, police say",
      "Manchester synagogue terrorist was on bail for alleged rape"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.862,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.634,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Jihad Al-Shamie, who attacked individuals at the Heaton Park Congregation synagogue in northwestern England, had previously been under investigation for an alleged sexual attack. He was known as a weightlifting enthusiast who kept to himself. Despite the ongoing investigation, he was released on bail prior to the synagogue attack.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Jeff Bezos Criticizes AI as an \"Industrial Bubble\"",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Fri, 03 Oct 2025 21:29:40 GMT",
    "source": "Axios",
    "sources": [
      "CNBC",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMieEFVX3lxTFBVa2J0U2ZhaXlvYXVLUm02WkZGY2lMeG5zS1lUTDdCeUVHR2Z6TEViUVE5aURJUklYWmpTSWlVWVN1TnhVQlZZN3RWUVB2MWVHWnZ3bTAwSkV5YmxsQlNmdWF2cWdscXlmcVA4LVVvZG9WRHE3UnVfQg?oc=5\" target=\"_blank\">Jeff Bezos slams AI \"industrial bubble,\" while Goldman Sachs' CEO",
      "Amazon founder Jeff Bezos said that artificial intelligence is showing signs of being in an \"industrial bubble.\""
    ],
    "image_url": "",
    "titles": [
      "Jeff Bezos slams AI \"industrial bubble,\" while Goldman Sachs' CEO expects \"drawdown\" - Axios",
      "Jeff Bezos says AI is in an industrial bubble but society will get 'gigantic' benefits from the tech"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.852,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.632,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Jeff Bezos, Amazon's founder, criticized the current state of artificial intelligence, describing it as an \"industrial bubble.\" This statement reflects his perspective on the hype and investment surrounding AI technologies.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]