[
  {
    "title": "Experts Release Predictions and Analysis for 2026 NFL Divisional Round",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Sat, 17 Jan 2026 00:59:47 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports",
      "Sports Illustrated",
      "Yahoo Sports"
    ],
    "domains": [
      "espn.com",
      "cbssports.com",
      "news.google.com",
      "sports.yahoo.com"
    ],
    "snippets": [
      "Bills-Broncos. 49ers-Seahawks. Texans-Patriots. Rams-Bears. We have picks, stats to know, X factors and more for the divisional round.",
      "SportsLine AI evaluated the 2026 divisional round NFL odds and revealed its NFL score predictions and best NFL picks",
      "Key Matchups, Predictions for Every 2025 NFL Divisional Round Playoff Game Sports Illustrated",
      "Here's your weekly dose of John Breech's NFL picks",
      "CBS Sports and SportsLine break down every game of the divisional round",
      "Eric Cohen reveals all of his 2026 NFL divisional round score predictions and best bets",
      "SportsLine's model has analyzed the NFL playoff bracket and locked in its score predictions, best bets, and prop picks for the NFL Divisional Round",
      "The SportsLine Projection Model has revealed its San Francisco vs. Seattle picks for NFL divisional round matchup on Saturday",
      "SportsLine's model has revealed its Buffalo vs. Denver picks for their divisional round matchup in the 2026 NFL playoffs",
      "SportsLine's model simulated Tennessee Volunteers vs. Kentucky Wildcats 10,000 times and revealed Saturday college basketball picks",
      "SportsLine's model simulated Georgetown Hoyas vs. Connecticut Huskies on Saturday and revealed its college basketball picks",
      "SportsLine's model simulated Kansas Jayhawks vs. Baylor Bears on Friday night and revealed its college basketball picks",
      "SportsLine's model reveals its New Orleans Pelicans vs. Indiana Pacers picks for the NBA matchup on Friday",
      "SportsLine's model simulated Philadelphia vs. Cleveland 10,000 times and revealed its NBA picks today",
      "The SportsLine Projection Model has revealed its Miami Hurricanes vs. Indiana Hoosiers picks for the 2026 CFP national championship on Monday, Jan. 19",
      "SportsLine's advanced model has simulated every game 10,000 times and locked in its NFL playoff best bets today",
      "The SportsLine Machine Learning Model has locked in its top NFL Divisional Round anytime TD picks for players like Christian McCaffrey, Kyren Williams, Courtland Sutton",
      "Expect Sean Payton to deploy a run-heavy game plan, and RJ Harvey should be the primary beneficiary in the red zone.",
      "Odds, game picks, prop plays, betting advice and daily fantasy tips for the 49ers-Seahawks divisional round matchup.",
      "CBS Sports writers Jordan Dajani and Jared Dubin predict this weekend's top games",
      "SportsLine expert Jeff Hochman breaks down his top money line parlay for the 2026 NFL Divisional Playoffs",
      "Five bold predictions for this weekend's divisional round",
      "Saturday night’s playoff matchup will be Witherspoon’s second game as captain this season.",
      "Odds, game picks, prop plays, betting advice and daily fantasy tips for the Bills-Broncos divisional round matchup.",
      "Pete Prisco reveals all of his divisional picks, including Patriots and Seahawks advancing",
      "SportsLine's top NFL experts reveal their NFL picks, NFL predictions, NFL betting tips, and NFL best bets for the divisional round 2026",
      "SportsLine's computer simulation model has locked in a $10 six-leg NFL divisional round parlay that pays out $1 million",
      "Here's the full schedule for every NFL playoff game being played this year",
      "Here's what will decide every game of the divisional round"
    ],
    "image_url": "",
    "titles": [
      "Everything you need to know for all four NFL divisional games: Score picks, predictions and storylines",
      "Self-learning AI generates NFL picks, score predictions for every 2026 divisional round matchup",
      "Key Matchups, Predictions for Every 2025 NFL Divisional Round Playoff Game - Sports Illustrated",
      "2026 NFL playoff bracket picks, predictions: Bills storm past Broncos in divisional round, Rams beat Bears",
      "NFL divisional round odds, predictions, expert picks: Can 49ers pull off upset of Seahawks?",
      "2026 NFL Divisional Round odds, bracket picks, score predictions: Proven expert backing Broncos, Seahawks",
      "2026 NFL playoff bracket picks: Model reveals score predictions, player props, best bets for Divisional Round",
      "Seahawks vs. 49ers prediction, odds, time: 2026 NFL divisional round Saturday picks by proven model",
      "Bills vs. Broncos prediction, odds, start time: NFL divisional round Saturday picks from 10,000 simulations",
      "Kentucky vs. Tennessee odds, spread, time: 2026 college basketball picks for Jan. 17 from proven model",
      "UConn vs. Georgetown odds, prediction, time: 2026 college basketball picks for January 17 from proven model",
      "Kansas vs. Baylor odds, prediction, time: 2026 college basketball picks for January 16 from proven model",
      "Pelicans vs. Pacers odds, prediction, time: 2026 NBA picks for Friday, January 16 from proven model",
      "Cavaliers vs. 76ers odds, prediction, line, time: 2026 NBA picks for Jan. 16 from proven model",
      "Indiana vs. Miami prediction, odds, time: 2026 CFP National Championship Game best bets by top model",
      "2026 NFL divisional round odds, lines, picks, best bets: Computer model backs Chicago Bears",
      "NFL Divisional Round anytime touchdown scorer picks, odds: Model locks in anytime TD scorer best bets",
      "Anytime Touchdown Scorer Bills vs Broncos Prediction: TD Picks for AFC Divisional Round",
      "Divisional round betting: Count on run game to lead Seahawks past 49ers",
      "NFL divisional round picks: Our experts face off on Bills at Broncos, 49ers vs. Seahawks and more",
      "NFL picks: 49ers vs. Seahawks a part of expert's top money line parlay for Divisional Round",
      "NFL divisional round bold predictions: Travel-weary 49ers shock Seahawks, Josh Allen's playoff streak ends",
      "Seahawks make JSN, Devon Witherspoon game captains for Divisional Round vs. 49ers",
      "Betting: Broncos too much for Josh Allen to overcome?",
      "Prisco's NFL divisional picks: Bills, Josh Allen too much for Broncos D, Rams end Bears' Cinderella season",
      "NFL picks this week, Vegas odds: 2026 divisional round expert predictions against the spread, parlay and props",
      "NFL longshot parlay picks, props for divisional round, 2026: Get an epic return of more than +10,000,000",
      "2026 NFL playoff schedule and bracket: Dates, times, TV for every round from divisional to Super Bowl",
      "2026 NFL divisional round: Christian McCaffrey vs. Seahawks' second-level defenders and other key matchups"
    ],
    "url": "https://www.espn.com/nfl/story/_/page/viewersguide47602151/nfl-divisional-predictions-schedule-odds-injuries-stats-2025-playoffs",
    "alternate_urls": [
      "https://www.cbssports.com/nfl/news/nfl-divisional-round-2026-picks-ai-score-predictions-playoff-best-bets/",
      "https://news.google.com/rss/articles/CBMinAFBVV95cUxNU2MxZUVGVlVfUmN0R3Nia0VabXRnQzRTaXNRQURIelNhdXBOc2NKQWF5RnJCUC1yT1pfVmhtT3djU0xfOVpnU2J6QzZ3Q1BUUkNTNDlBdGVEdDdUMXRIOHFwVGNtMTE1dGhqNlNDeXQ3UGpiTjc1TjIwa0JXcjlhMUNaU3pOV19SUEIyeUNSSHR5b2RQVl9Ld29rUlE?oc=5",
      "https://www.cbssports.com/nfl/news/2026-nfl-playoff-bracket-picks-predictions-divisional-round/",
      "https://www.cbssports.com/nfl/news/nfl-divisional-round-odds-predictions-expert-picks-can-49ers-pull-off-upset-of-seahawks/",
      "https://www.cbssports.com/nfl/news/2026-nfl-divisional-round-odds-bracket-picks-score-predictions-proven-expert-backing-broncos-seahawks/",
      "https://www.cbssports.com/nfl/news/2026-nfl-playoff-bracket-picks-model-reveals-score-predictions-player-props-best-bets-divisional-round/",
      "https://www.cbssports.com/nfl/news/seahawks-49ers-prediction-odds-spread-time-2026-nfl-divisional-round-saturday-picks-best-bets/",
      "https://www.cbssports.com/nfl/news/bills-broncos-prediction-odds-spread-time-nfl-divisional-round-saturday-picks-best-bets/",
      "https://www.cbssports.com/college-basketball/news/kentucky-tennessee-odds-spread-time-2026-college-basketball-picks-saturday-january-17/",
      "https://www.cbssports.com/college-basketball/news/uconn-georgetown-odds-prediction-time-2026-college-basketball-picks-saturday-january-17/",
      "https://www.cbssports.com/college-basketball/news/kansas-baylor-odds-prediction-spread-time-2026-college-basketball-picks-friday-january-16/",
      "https://www.cbssports.com/nba/news/pelicans-pacers-odds-prediction-spread-time-2026-nba-picks-friday-january-16/",
      "https://www.cbssports.com/nba/news/cavaliers-76ers-odds-prediction-line-time-2026-nba-picks-friday-january-16f/",
      "https://www.cbssports.com/college-football/news/indiana-miami-prediction-odds-date-start-time-2026-college-football-playoff-national-championship-game-picks-bets/",
      "https://www.cbssports.com/nfl/news/2026-nfl-divisional-round-odds-betting-lines-spreads-picks-best-bets-predictions/",
      "https://www.cbssports.com/nfl/news/nfl-divisional-round-anytime-touchdown-scorer-picks-odds-anytime-td-scorer-best-bets/",
      "https://sports.yahoo.com/articles/anytime-touchdown-scorer-bills-vs-003900028.html",
      "https://www.espn.com/espn/betting/story/_/id/47589608/2025-nfl-playoffs-divisional-round-odds-lines-spread-betting-picks-dfs-tips-saturday-football-preview-49ers-seahawks",
      "https://www.cbssports.com/nfl/news/nfl-divisional-round-expert-picks-bills-broncos-49ers-seahawks/",
      "https://www.cbssports.com/nfl/news/nfl-picks-49ers-vs-seahawks-a-part-of-experts-top-money-line-parlay-for-divisional-round/",
      "https://www.cbssports.com/nfl/news/nfl-divisional-round-bold-predictions-49ers-seahawks-josh-allen-playoff-streak/",
      "https://sports.yahoo.com/articles/seahawks-jsn-devon-witherspoon-game-225149242.html",
      "https://www.espn.com/espn/betting/story/_/id/47589313/2025-nfl-playoffs-divisional-round-odds-lines-spread-betting-picks-dfs-tips-saturday-football-preview-bills-broncos",
      "https://www.cbssports.com/nfl/news/priscos-nfl-divisional-picks-best-bets-odds/",
      "https://www.cbssports.com/nfl/news/nfl-picks-vegas-odds-2026-divisional-round-expert-predictions-spread-parlay-player-props-best-bets/",
      "https://www.cbssports.com/nfl/news/nfl-parlay-longshot-picks-predictions-odds-player-props-divisional-round-2026/",
      "https://www.cbssports.com/nfl/news/2026-nfl-playoff-schedule-dates-times-tv-wild-card-to-super-bowl/",
      "https://www.cbssports.com/nfl/news/2026-nfl-divisional-round-key-matchups-for-each-nfc-afc-game/"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/nfl/story/_/page/viewersguide47602151/nfl-divisional-predictions-schedule-odds-injuries-stats-2025-playoffs",
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.872,
      "consensus": 0.908,
      "constructiveness": 0.8,
      "proximity": 0.75
    },
    "score": 0.866,
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful information for NFL fans who want to understand the upcoming divisional games. It gives actionable insights through score picks and predictions, and provides deeper understanding through the discussion of storylines. However, it doesn't necessarily report on progress, solutions, or improvements.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "SportsLine and CBS Sports experts have released predictions, betting tips, and analysis for all 2026 NFL Divisional Round playoff games, including matchups for Bills-Broncos, 49ers-Seahawks, Texans-Patriots, and Rams-Bears. SportsLine's models have simulated each game and provided best bets, prop picks, and score predictions ahead of the weekend's action.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Trump Names Rubio Blair Kushner to Gaza Reconstruction Board",
    "domain": "politics",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Sat, 17 Jan 2026 05:35:26 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "BBC",
      "Financial Times",
      "Reuters",
      "The Guardian"
    ],
    "domains": [
      "aljazeera.com",
      "bbc.com",
      "ft.com",
      "news.google.com",
      "theguardian.com"
    ],
    "snippets": [
      "Israeli raids cause rising casualties in Gaza, as attacks persist despite the ceasefire agreement.",
      "Former UK prime minister's role on Trump-led Gaza oversight committee expected to spur widespread condemnation.",
      "The former UK prime minister and US Secretary of State Marco Rubio will sit on the \"founding executive board\", the White House says.",
      "US president will chair executive body that he says will guide reconstruction of war-ravaged enclave",
      "US names Rubio, Tony Blair, Kushner to Gaza board under Trump's plan Reuters",
      "White House says seven-strong board, chaired by Trump, will steer Gaza through next phase of reconstruction Donald Trump has appointed the US secretary of state, Marco Rubio, and former British prime minister Tony Blair to a newly created Gaza “board of peace”, a body he claims will steer the next p"
    ],
    "image_url": "",
    "titles": [
      "LIVE: Gaza death toll rises by Israeli raids, Trump names ‘Board of Peace’",
      "Trump names Tony Blair, Jared Kushner to Gaza ‘Board of Peace’",
      "Sir Tony Blair appointed to Trump's 'Board of Peace' for Gaza",
      "Trump names Tony Blair, Jared Kushner and Marc Rowan to advise Gaza ‘Board of Peace’",
      "US names Rubio, Tony Blair, Kushner to Gaza board under Trump's plan - Reuters",
      "Trump appoints Blair, Kushner and Rubio to Gaza ‘board of peace’"
    ],
    "url": "https://www.aljazeera.com/news/liveblog/2026/1/17/live-gaza-death-toll-rises-by-israeli-raids-trump-names-board-of-peace?traffic_source=rss",
    "alternate_urls": [
      "https://www.aljazeera.com/news/2026/1/16/trump-names-tony-blair-jared-kushner-to-gaza-board-of-peace?traffic_source=rss",
      "https://www.bbc.com/news/articles/c07xv92vrz2o?at_medium=RSS&at_campaign=rss",
      "https://www.ft.com/content/e98e3cbd-9653-44a8-b9e7-daa467ddc945",
      "https://news.google.com/rss/articles/CBMisAFBVV95cUxPMXRxUExRdXIyZS1ydVpzN1BtYnEzR2s0TVYzUVZial9nNXVHYzFoQjlPRUtMTV96a25TMnhyaElNY3lBRTRDdFF5WllnVlEwdnRzSnZOdHZ4LXIyU29BSDZ2UTExdnZuSlk0Q1V3VWU5R05zS1VsR0FSaUtZYkVqZnNwSmZqN1gxT2hYQUFYeUhFTU5DbVJYTmVjanNUSmFTRFRyZUNnTWVfSGh5M0dQcw?oc=5",
      "https://www.theguardian.com/us-news/2026/jan/16/trump-gaza-board-rubio-blair"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/liveblog/2026/1/17/live-gaza-death-toll-rises-by-israeli-raids-trump-names-board-of-peace?traffic_source=rss",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.862,
      "consensus": 0.995,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.838,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about the ongoing conflict in Gaza and the formation of a 'Board of Peace' by Trump. However, it lacks depth and insight into the situation, the reasons behind the conflict, or potential solutions.",
    "constructiveness_source": "gpt",
    "summary_source": "snippet",
    "summary_reason": "invalid_roles",
    "headline_source": "gpt",
    "summary": "Israeli raids cause rising casualties in Gaza, as attacks persist despite the ceasefire agreement.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Machado Gives Nobel Peace Prize Medal to Trump",
    "domain": "politics",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Fri, 16 Jan 2026 21:20:52 -0500",
    "source": "ABC News",
    "sources": [
      "ABC News",
      "Washington Post",
      "New York Times",
      "Bloomberg",
      "The Guardian",
      "CNBC"
    ],
    "domains": [
      "abcnews.go.com",
      "washingtonpost.com",
      "nytimes.com",
      "news.google.com",
      "theguardian.com",
      "cnbc.com"
    ],
    "snippets": [
      "After giving President Trump her Nobel Peace Prize medal on Thursday, Venezuelan opposition leader Maria Corina Machado said Friday she was \"absolutely grateful\" to Trump.",
      "President Donald Trump said it was a “wonderful gesture of mutual respect.” The Nobel Committee said the medal can change hands, but “the title of a Nobel Peace Prize laureate cannot.”",
      "The Venezuelan opposition leader’s efforts to share her award with the U.S. president have shaken some Norwegians’ faith in their signature soft-power tool.",
      "Norway Stunned After Machado Gifts Nobel Peace Prize Medal to Trump Bloomberg.com",
      "US president criticised for accepting medal awarded to Venezuelan opposition leader María Corina Machado Political leaders in Norway have condemned the Venezuelan opposition leader María Corina Machado’s “absurd” decision to present her Nobel peace prize medal to Donald Trump, accusing the US presid",
      "\"This is incredibly embarrassing,\" Raymond Johansen, a Norwegian lawmaker for the center-left Labour Party, said in a Facebook post.",
      "Machado presents her Nobel award to Trump, prompting incredulity in Norway CNBC",
      "The Nobel Committee has said the prize cannot be transferred, but it has been sold in a few auctions over the award’s history."
    ],
    "image_url": "https://s.abcnews.com/images/US/260116_abc_social_wang_machado_hpMain_4x3_384.jpg",
    "titles": [
      "WATCH:  María Corina Machado speaks after giving her Nobel Peace Prize to President Trump",
      "Machado gave her Peace Prize to Trump. Can a Nobel be gifted?",
      "Machado Presents Trump With Nobel Peace Prize",
      "Norway Stunned After Machado Gifts Nobel Peace Prize Medal to Trump - Bloomberg.com",
      "Giving Trump the Nobel peace prize medal is ‘absurd’, say Norwegian politicians",
      "Machado presents her Nobel award to Trump, prompting incredulity in Norway",
      "Machado presents her Nobel award to Trump, prompting incredulity in Norway - CNBC",
      "The Nobel Peace Prize Medal Has Been Sold Before for Millions"
    ],
    "url": "https://abcnews.go.com/US/video/mara-corina-machado-speaks-after-giving-nobel-peace-129293746",
    "alternate_urls": [
      "https://www.washingtonpost.com/politics/2026/01/16/us-trump-venezuela-machado-nobel-peace-prize-gift/",
      "https://www.nytimes.com/2026/01/15/world/americas/machado-trump-meeting-nobel-peace-prize.html",
      "https://news.google.com/rss/articles/CBMiygFBVV95cUxOV1pYNGVRcUFrLTlGTE52am1TZDktMzRZaVpIMW9EYVo0MjJOakFJODJFdHZJQXlIOUpnbnhFd3l1aV9KT0hxVVdKR21FOVJVTmFTemFiOGM4cTJTeTBfc0ZDdGRrMFZ5aGpmQjZNNGZVNjdkWERnWmVLaGpoVWUzVm4tcWFESi1GMW9EMFZ0VkNVR0Frc3NEWUZMc2hiM3NlMHMwVEk1MUprXzZJOE9lY1ZSY3A3RWlVSk4tZWFWcXZvaTVNN0ltVDNR?oc=5",
      "https://www.theguardian.com/world/2026/jan/16/maria-corina-machado-giving-trump-nobel-peace-prize-medal-absurd-say-norwegian-politicians",
      "https://www.cnbc.com/2026/01/16/trump-machado-norway-.html",
      "https://news.google.com/rss/articles/CBMiakFVX3lxTE4xdFRUNzFWbjRKd1pQYVlYTnFRVlQyNXk0ZDd1OGFFVlhWWXZBeEViS3RrQlg5UWhrRFVEVVlhRGhVcjdhaS1qMDNSV0ljN3p0Z3gyQzgyYmFRYnJFWXZkRDRjLU12clliX1HSAW9BVV95cUxPc1gzbFFGeU9OMXN2eFZZbkt5NTl3X1hDSjlyV18zV0NwcGxJTDhEQ0RYRGttT194VW55amVIVlczV29GdDRFYmhYLWx5dHBCbWFDZ1F4SDJrMEJLb2h5Q2pOb2IyNTFhVnlkNmo4RWc?oc=5",
      "https://www.nytimes.com/2026/01/15/world/americas/nobel-peace-prize-sold-auctions.html"
    ],
    "location_scope": "national",
    "link": "https://abcnews.go.com/US/video/mara-corina-machado-speaks-after-giving-nobel-peace-129293746",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.788,
      "consensus": 1.0,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.836,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story offers awareness about María Corina Machado's action of giving her Nobel Peace Prize to President Trump. However, it doesn't provide deeper understanding or actionable insights about the implications of this act.",
    "constructiveness_source": "gpt",
    "summary_source": "snippet",
    "summary_reason": "invalid_roles",
    "headline_source": "gpt",
    "summary": "After giving President Trump her Nobel Peace Prize medal on Thursday, Venezuelan opposition leader Maria Corina Machado said Friday she was \"absolutely grateful\" to Trump.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Emma Raducanu Criticizes Australian Open Scheduling",
    "domain": "sports",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Sat, 17 Jan 2026 08:03:50 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Sky Sports",
      "BBC Sport",
      "The Guardian"
    ],
    "domains": [
      "bbc.com",
      "skysports.com",
      "bbc.co.uk",
      "theguardian.com"
    ],
    "snippets": [
      "While players are used to short turnarounds, Emma Raducanu questions the logic of her Australian Open first-round match being played on Sunday night in Melbourne.",
      "Emma Raducanu has been left less than impressed by the Australian Open's scheduling after being forced to scramble to get ready for the tournament.",
      "We relive the three epic Grand Slam finals contested by Jannik Sinner and Alcaraz in 2025",
      "Here’s how to follow along with our coverage – the finest writing and up-to-the-minute reports Continue reading..."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/ca3c/live/de758e00-f373-11f0-84f4-f99e35a67dc7.jpg",
    "titles": [
      "Why Australian Open schedule 'doesn't make sense' to Raducanu",
      "Raducanu criticises Australian Open scheduling",
      "5 Live Sport: All About... Australian Open",
      "Your Guardian sport weekend: Australian Open, NFL playoffs and the Afcon final"
    ],
    "url": "https://www.bbc.com/sport/tennis/articles/clym6g85eveo?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://www.skysports.com/tennis/news/12040/13495244/emma-raducanu-voices-frustrations-at-australian-open-scheduling",
      "https://www.bbc.co.uk/sounds/play/p0mvfcbt?at_medium=RSS&at_campaign=rss",
      "https://www.theguardian.com/sport/2026/jan/16/your-guardian-sport-weekend-australian-open-nfl-playoffs-and-the-afcon-final"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/sport/tennis/articles/clym6g85eveo?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.924,
      "consensus": 0.908,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.836,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides some context and understanding about Raducanu's perspective on the Australian Open schedule. It could potentially increase clarity around the systems and trends in tennis scheduling. However, it does not appear to highlight progress, solutions, or empowering knowledge.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Emma Raducanu has criticized the Australian Open's scheduling after being assigned a first-round match on Sunday night in Melbourne, expressing frustration with the short preparation time.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Justice Department Investigates Walz and Frey Over Immigration",
    "domain": "politics",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Sat, 17 Jan 2026 01:18:45 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "Al Jazeera",
      "NPR",
      "CBC News",
      "Reuters"
    ],
    "domains": [
      "news.google.com",
      "aljazeera.com",
      "npr.org",
      "cbc.ca"
    ],
    "snippets": [
      "Trump DOJ investigating Tim Walz, Minneapolis mayor Jacob Frey Axios",
      "Reports of Trump administration investigating top Democrats in Minnesota as violent ICE crackdown continues.",
      "Federal prosecutors are investigating Minnesota Gov. Tim Walz and Minneapolis Mayor Jacob Frey. In response to the news, Frey said in a social media post: \"I will not be intimidated.\"",
      "The U.S. Justice Department is investigating whether Minnesota Gov. Tim Walz and Minneapolis Mayor Jacob Frey have impeded federal immigration enforcement through public statements they have made, according to two people familiar with the matter.",
      "US Justice Department probing Minnesota Governor Walz, other officials, source says Reuters"
    ],
    "image_url": "",
    "titles": [
      "Trump DOJ investigating Tim Walz, Minneapolis mayor Jacob Frey - Axios",
      "Minneapolis mayor says reported DOJ probe ‘intimidation’ amid ICE raids",
      "Justice Department opens investigation into Minnesota governor and Minneapolis mayor",
      "U.S. Justice Department probing Minnesota Gov. Tim Walz, Minneapolis Mayor Jacob Frey over ICE raid comments",
      "US Justice Department probing Minnesota Governor Walz, other officials, source says - Reuters"
    ],
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxOVzRETXRCTm5FNFhWTkdIUmlFV3Bub19VYVBEN0Z2bG5MWGRzaU1kb0k0Q0tsekRwNHNkNlFBUUJoY1pHcVNpTlhBeHZVRV9aMWtLODhLMHVjT3NLeUhfdnR3bjB0SWtoMERDd3o1S3N2ZndhNng3SkI5a0ZMYXI0ZzV0dkZ5SFFNTUtkWXZpTjh1Zw?oc=5",
    "alternate_urls": [
      "https://www.aljazeera.com/news/2026/1/17/minneapolis-mayor-says-reported-doj-probe-intimidation-amid-ice-raids?traffic_source=rss",
      "https://www.npr.org/2026/01/16/nx-s1-5680368/justice-department-minnesota-tim-walz-jacob-frey-investigation",
      "https://www.cbc.ca/news/world/tim-walz-jacob-frey-investigation-doj-9.7049625?cmp=rss",
      "https://news.google.com/rss/articles/CBMiuwFBVV95cUxQcWsxYlVBX1ZDVnAwOE9KSkJtLTd5c21OY19aN2JNQUFmdE45OTMxMHl6SExhOTBkSTJ0YXdLWUhCVWsyWmIyZXJfWW45T1cxdU5NNG1KRjByQzBWcnhtTXVGYVByNEN1RkxMeC02eEZ3SzYzUVZLQ3dOUjh4T2dQdjd4VTNjY2p0Z3BBMWo0aWZreHBBbzFocFhQdHBmaTFORzZiaVBJSWJxUzFrSWVlUzZxRmRtY1A1Zm84?oc=5"
    ],
    "location_scope": "national",
    "link": "https://news.google.com/rss/articles/CBMikgFBVV95cUxOVzRETXRCTm5FNFhWTkdIUmlFV3Bub19VYVBEN0Z2bG5MWGRzaU1kb0k0Q0tsekRwNHNkNlFBUUJoY1pHcVNpTlhBeHZVRV9aMWtLODhLMHVjT3NLeUhfdnR3bjB0SWtoMERDd3o1S3N2ZndhNng3SkI5a0ZMYXI0ZzV0dkZ5SFFNTUtkWXZpTjh1Zw?oc=5",
    "score_components": {
      "magnitude": 0.964,
      "recency": 0.766,
      "consensus": 0.975,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.824,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs about an investigation being carried out by the Department of Justice, which can be useful for readers to understand the political dynamics. However, it does not provide information on what the investigation might mean for these individuals or the wider implications.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The U.S. Justice Department is investigating Minnesota Governor Tim Walz and Minneapolis Mayor Jacob Frey for allegedly impeding federal immigration enforcement through their public statements. Both Walz and Frey have acknowledged the investigation, with Frey publicly stating he will not be intimidated.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Bo Bichette Joins Mets on Three Year",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Sat, 17 Jan 2026 01:01:06 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet",
      "Yahoo Sports",
      "Bleacher Report"
    ],
    "domains": [
      "espn.com",
      "sportsnet.ca",
      "sports.yahoo.com",
      "news.google.com"
    ],
    "snippets": [
      "Inter Miami is prepared to pay the $15 million release clause for Monterrey forward Germán Berterame, sources told ESPN.",
      "After missing out on Kyle Tucker, the Mets have agreed to a three-year, $126 million contract with Bo Bichette, sources confirmed to ESPN. New York plans to play Bichette at third base for the first time in his pro career.",
      "Bo Bichette has found a new home. The longtime Toronto Blue Jays infielder has agreed to join the New York Mets on a three-year deal, The Athletic’s Will Sammon reported on Friday. The Athletic’s Ken Rosenthal reports the deal is for $126 million over the three years, with opt-outs after years one and two. The deal also includes a $5 million opt-out bonus and a full no-trade clause, per the New York Post’s Jon Heyman . After playing almost exclusively shortstop with the Blue Jays, Bichette is expected to play third base with the Mets, MLB Network’s Jon Morosi reported. The Phillies, who met...",
      "The benefits of the Mets’ Bo Bichette signing are twofold.",
      "Bo Bichette, Mets Reportedly Agree to $126M Contract, Updated Roster, Payroll for 2026 Season Bleacher Report",
      "Realmuto, who turns 35 in March, hit .257 with 12 homers and 52 RBIs in 134 games last year.",
      "First the Mets pivoted, then the Phillies did.",
      "J.T. Realmuto and the Phillies agreed to a new three-year deal worth $45 million.",
      "Philadelphia made a play for Bichette, but instead it's bringing back another member of its core."
    ],
    "image_url": "",
    "titles": [
      "Sources: Miami eyeing Berterame in $15M deal",
      "Sources: Mets, Bichette reach 3-year, $126M deal",
      "Report: Bo Bichette, Mets agree to three-year, $126-million deal",
      "Mets stole Bo Bichette from the Phillies after they reportedly offered $200M deal",
      "Bo Bichette, Mets Reportedly Agree to $126M Contract, Updated Roster, Payroll for 2026 Season - Bleacher Report",
      "Report: J.T. Realmuto agrees to $45 million, 3-year deal to stay with Phillies",
      "Phillies re-sign J.T. Realmuto to $45 million deal after missing out on Bo Bichette",
      "J.T. Realmuto returns to Phillies on $45 million contract after Bichette miss",
      "Phillies reportedly re-sign catcher J.T. Realmuto to 3-year, $45 million deal after Mets land Bo Bichette"
    ],
    "url": "https://www.espn.com/soccer/story/_/id/47635848/inter-miami-eyeing-15m-move-monterrey-german-berterame",
    "alternate_urls": [
      "https://www.espn.com/mlb/story/_/id/47631398/sources-mets-bo-bichette-agree-3-year-126m-contract",
      "https://sports.yahoo.com/articles/mets-stole-bo-bichette-phillies-233336352.html",
      "https://news.google.com/rss/articles/CBMixgFBVV95cUxQeWQxTnI0cFQ3RG9vdlpaNkxHcXh2dnBZWG9UWkhpcmpYU3BHMGhSc2RtQm02MnVQZS1XQmVmNWtUWURDeVBWR2FJNGs0SFI5Sk1DTW9ZdFliUzY3YU5yR1JPMnF1ZXlPc3hkN3FkYTNra09yekp6ckhQMWVEMERvTDhjVzRCbG96eXFYRGlsS2xEUWY4NWI0Z0hpbEQ2dlExR2wwa0syWXRzbFktQ0I2TWpRVjZjdDdMS1NIeEpHUEhwQ0FYVlE?oc=5",
      "https://sports.yahoo.com/articles/report-j-t-realmuto-agrees-225319012.html",
      "https://sports.yahoo.com/articles/phillies-sign-j-t-realmuto-191404889.html",
      "https://sports.yahoo.com/articles/j-t-realmuto-returns-phillies-191128556.html",
      "https://sports.yahoo.com/mlb/breaking-news/article/phillies-reportedly-re-sign-catcher-jt-realmuto-to-3-year-45-million-deal-after-mets-land-bo-bichette-183821287.html"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/soccer/story/_/id/47635848/inter-miami-eyeing-15m-move-monterrey-german-berterame",
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.873,
      "consensus": 0.908,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.816,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "While this story might offer basic awareness about Miami's potential deal with Berterame, it lacks depth or insight based on the provided information. It doesn't give actionable insights or deeper understanding, nor does it report on progress or solutions.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Bo Bichette has agreed to a three-year, $126 million contract with the New York Mets, with opt-outs after each of the first two years, a $5 million opt-out bonus, and a full no-trade clause. Bichette, previously with the Blue Jays, is expected to play third base for the Mets. The Phillies, after pursuing Bichette, re-signed J.T. Realmuto to a three-year, $45 million deal.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Trump Signals Preference to Keep Hassett in White House Role",
    "domain": "politics",
    "source_domain": "ft.com",
    "location": "global",
    "published": "Fri, 16 Jan 2026 21:41:09 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times",
      "Reuters",
      "MarketWatch",
      "CNBC"
    ],
    "domains": [
      "ft.com",
      "news.google.com",
      "marketwatch.com"
    ],
    "snippets": [
      "US president says moving National Economic Council director to central bank would be a ‘serious concern for me’",
      "Trump tells Hassett he may want to keep him at White House Reuters",
      "The contest to become the next chair of the Federal Reserve took another turn Friday, as President Donald Trump hinted that he may want to keep economist Kevin Hassett in his current White House job.",
      "Trump tells Hassett he wants to keep him where he is; Warsh Fed chair odds jump CNBC"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F58664646-f527-49e6-931b-9edec483fff1.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Trump says he wants Fed chair contender Hassett to stay in White House job",
      "Trump tells Hassett he may want to keep him at White House - Reuters",
      "Warsh’s chances of becoming Fed chair jump as Trump suggests he doesn’t want Hassett in that job",
      "Trump tells Hassett he wants to keep him where he is; Warsh Fed chair odds jump - CNBC"
    ],
    "url": "https://www.ft.com/content/ef716145-8e4b-461d-8b09-b61160f7f9d2",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMingFBVV95cUxOemJ3MXcycm13UE4zOTF1Y1BLZjBFREZfVVhiMUxfX2FhcHhxUUg2cFFuNzZMNDRFZUp0dE5KWkxDNW9xSEpBSFo3SUZtaW1QNzBwRVpsUUdxQ0JHcTBUWmFCZU1xRXZSVWh3aW5JZmhDUnNTRDFJLTdJMlJsanNIdDkzZ1d1UzVSVDhObnRSaVpGZXVSZ2FLN3FWbjNuQQ?oc=5",
      "https://www.marketwatch.com/story/warshs-chances-of-becoming-fed-chair-jump-as-trump-suggests-he-doesnt-want-hassett-in-that-job-146fb6a9?mod=mw_rss_topstories",
      "https://news.google.com/rss/articles/CBMizwFBVV95cUxOUEVFYXlBLXdfaU5qY1lHc2UzVEdPdWhnaDBsZDRWN3hRZF9MUzMtZmFXSnROQWN1bkJuOFhhMVJneWoxWXpqYmRBeEF4SXR1TG5uak04TEtiUkhrVXBPX3FLRk5ibk8wc0ItSHpCOTh5WjJEWjh4ZjktcTlLcnE3ZjZXSm9BUldDNWlYTWsyMFBDZTJLWmkweS1VYnRvaE90eFVsb21SeTAxY21xaXZ3aEpfTjY3c1JpR2R1Q1JadklMbnZUUUdpWVlSMjFPb2_SAdQBQVVfeXFMTzd5bWtvNUNZaUQ3OXl0R0ZPWDEzTGtaSkZKNmZRalNTd1ZadTh5MWxwQmVhazdHTnVIRXdSQldSNl9QcVVZRGI3WktEdjIwZlh4Uk9EX052OWRmdXdvYTFQOXpyNjNZNmFrRzBuUF92LXJmOWtWNlNZS3VTSmdxdmdSTERIUkpZN2RxSjFQcXpHRmZmUWlnMDBxRE1kbFhQWnBqcUh3a1NhUXpCZWQ4dDRuZjRnZ2xScnI5WHRFa2o0WDdYeW1nNk93N2tmWi1GMDllVHc?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.ft.com/content/ef716145-8e4b-461d-8b09-b61160f7f9d2",
    "score_components": {
      "magnitude": 0.932,
      "recency": 0.692,
      "consensus": 0.888,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.775,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the current state of affairs in the White House and the Federal Reserve. However, it doesn't provide much depth or insight into the implications of this decision.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "President Trump indicated he may keep Kevin Hassett in his current White House position, expressing concern about moving him to the Federal Reserve. This development affects the ongoing selection process for the next Fed chair, increasing speculation about other candidates.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Judge Restricts Immigration Agents Actions Toward Minnesota Protesters",
    "domain": "general",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Sat, 17 Jan 2026 08:29:17 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Reuters"
    ],
    "domains": [
      "aljazeera.com",
      "news.google.com"
    ],
    "snippets": [
      "The court injunction bars federal ​agents from detaining or retaliating against peaceful protesters or observers.",
      "U.S. judge orders curbs on immigration agents' tactics toward Minnesota protesters Reuters"
    ],
    "image_url": "",
    "titles": [
      "US judge orders curbs on ICE agents’ actions against Minnesota protesters",
      "U.S. judge orders curbs on immigration agents' tactics toward Minnesota protesters - Reuters"
    ],
    "url": "https://www.aljazeera.com/news/2026/1/17/us-judge-orders-curbs-on-ice-agents-actions-against-minnesota-protesters?traffic_source=rss",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMivgFBVV95cUxPRWx4dUNkTVJ4MFZWajlOSE10WlhJZk03azNvSnRDRzV1VkFLUy1WY1M1bzZrMDNJb1hMTXRjc1hLOEVQd2tocDgzX0FJRFpZaDdpSjFzWGNHMDNheXZ1elE5YThVSklJUkR2d09fWHpzU3VtTjVkdmljSG1LY0gtUWNhRkxZQmtjZGNiSk5DNENfcVUydUl6S2hpYWg0b0k0UWw3NjJyZXhsYzlCSl9DTkY4dUFGdWwxYWh1SUJR?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2026/1/17/us-judge-orders-curbs-on-ice-agents-actions-against-minnesota-protesters?traffic_source=rss",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.935,
      "consensus": 0.591,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.755,
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story informs about a decision that has immediate implications for protesters and law enforcement. It provides useful context on the legal dynamics surrounding protests, but it does not highlight progress or solutions.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "A U.S. judge has issued an injunction restricting federal immigration agents from detaining or retaliating against peaceful protesters and observers in Minnesota.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Canada Reduces Tariffs on Chinese EVs in Exchange for Lower Farm",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Sat, 17 Jan 2026 01:50:04 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "Associated Press"
    ],
    "domains": [
      "news.google.com"
    ],
    "snippets": [
      "Chinese EVs closing in on America after Canadian tariffs deal Axios",
      "Canada agrees to cut tariff on Chinese EVs in return for lower tariffs on Canadian farm products AP News"
    ],
    "image_url": "",
    "titles": [
      "Chinese EVs closing in on America after Canadian tariffs deal - Axios",
      "Canada agrees to cut tariff on Chinese EVs in return for lower tariffs on Canadian farm products - AP News"
    ],
    "url": "https://news.google.com/rss/articles/CBMibEFVX3lxTFA3SlROZjN5Y044OTg5Vl90eGliX3dBajBmWFB5eVRVb2dJS0lvbnV2RkVTUzI1UjIyWElGSV85UTJXS1FrOHZ5UVB0OUZXbnRxNFVHZXI1ZmZFX3FkQUMyVjBOTW1XNjRmSFkwYg?oc=5",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMilAFBVV95cUxQS0M0cVV1eGRHei1NZWlIUFRVLWpWRzAzRWw1X1dEam9WT1p2Q3JNNEFYbndoWmQtaUIxUW81eGtKVmIzdHNBSUxnRlNTMGpGYURNM0RqVWJzZEFLUzRkRTFQYWE3VWZfdzd0Rk55bUVaVmZfeVNHcC11VWlEbGduamhYTkFkbmRLcHZPTUR5QzZwZl9G?oc=5"
    ],
    "location_scope": "national",
    "link": "https://news.google.com/rss/articles/CBMibEFVX3lxTFA3SlROZjN5Y044OTg5Vl90eGliX3dBajBmWFB5eVRVb2dJS0lvbnV2RkVTUzI1UjIyWElGSV85UTJXS1FrOHZ5UVB0OUZXbnRxNFVHZXI1ZmZFX3FkQUMyVjBOTW1XNjRmSFkwYg?oc=5",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.777,
      "consensus": 0.571,
      "constructiveness": 0.7,
      "proximity": 1.0
    },
    "score": 0.744,
    "constructiveness_score": 0.7,
    "constructiveness_reason": "The story provides useful information about the international trade dynamics between China, Canada, and the US, specifically in the electric vehicle industry. However, it lacks a clear focus on solutions or progress in addressing the trade challenges.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Canada has agreed to reduce tariffs on Chinese electric vehicles as part of a deal in which China will lower tariffs on Canadian agricultural products. The agreement could make it easier for Chinese EVs to enter the North American market.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "California Orders xAI to Halt Groks Generation of Sexualized Deepfakes",
    "domain": "politics",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Fri, 16 Jan 2026 23:09:38 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "Reuters",
      "Business Insider"
    ],
    "domains": [
      "news.google.com",
      "businessinsider.com"
    ],
    "snippets": [
      "California orders Musk's xAI to stop allowing fake sexualized images of minors Axios",
      "California demands Elon Musk's xAI stop producing sexual deepfake content Reuters",
      "California's Attorney General sent a cease-and-desist letter to xAI to prevent Grok from continuing to create sexualized deepfake images of children."
    ],
    "image_url": "",
    "titles": [
      "California orders Musk's xAI to stop allowing fake sexualized images of minors - Axios",
      "California demands Elon Musk's xAI stop producing sexual deepfake content - Reuters",
      "California sends xAI cease-and-desist letter, demanding it prevent sexualized deepfake images of minors"
    ],
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPNThIRFRGcl93QWI4SUJXb0lDYWNZamlsdDd2blBLZGd5Z3lDQXIwVVp4bVVZQjNraVlTTE5YV3RBZE1rM2tRN2xkUzFBVmU3VFc5RjdiQ0Q2blhQUm5BbTdKWlJ1VDhISFIweDkxSWtIN1V2c1ZTbzFvUnpsOWR3TnVnVVNzWlFj?oc=5",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMi1AFBVV95cUxPMFRVUzJ4bzlwUEx3akN1cXVGZU5HeGk0MGI1OXg2ZGthRHNNMkFHbVVKekRUWEI0RHhub0tibGp5X3FXRUFhN1ZjQ2pSeG5qSHhYQmxfN0Q5THZIbl91aWxiQ25icE0tWFc4T0FTaWNNMHBRbUQ3TGxRNjVodnlCYWNxYkpqTWp0NkVvbUxGU1l5VVdPeldBRGJYVWdoaTRTUmlPMzBNbEp6N1hHNk5aRXgyTWtQSkZSa29yTkFqLXlvS21HbUo5aV9fOVdYbHd3dGNBaQ?oc=5",
      "https://www.businessinsider.com/california-demands-xai-stop-allowing-sexualized-deepfake-images-minors-2026-1"
    ],
    "location_scope": "national",
    "link": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPNThIRFRGcl93QWI4SUJXb0lDYWNZamlsdDd2blBLZGd5Z3lDQXIwVVp4bVVZQjNraVlTTE5YV3RBZE1rM2tRN2xkUzFBVmU3VFc5RjdiQ0Q2blhQUm5BbTdKWlJ1VDhISFIweDkxSWtIN1V2c1ZTbzFvUnpsOWR3TnVnVVNzWlFj?oc=5",
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.721,
      "consensus": 0.769,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.734,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story is constructive as it informs readers about the legal actions being taken against misuse of technology, contributing to their understanding of the issue. However, it does not provide actionable insights or solutions to the problem.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "California's Attorney General has issued a cease-and-desist letter to Elon Musk's xAI, ordering the company to stop its Grok AI system from generating sexualized deepfake images of minors.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "U.S. Utility Bills Rise as Trump",
    "domain": "politics",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Sat, 17 Jan 2026 06:23:28 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "CNBC"
    ],
    "domains": [
      "news.google.com",
      "cnbc.com"
    ],
    "snippets": [
      "Trump, governors push tech companies to pay for rising power costs Axios",
      "Trump government stakes give Midas touch to companies Axios",
      "Utility bills are rising in many parts of the U.S. despite Trump's promise to lower energy prices during his presidential campaign."
    ],
    "image_url": "",
    "titles": [
      "Trump, governors push tech companies to pay for rising power costs - Axios",
      "Trump government stakes give Midas touch to companies - Axios",
      "Trump wants tech companies to foot the bill for new power plants because of AI"
    ],
    "url": "https://news.google.com/rss/articles/CBMic0FVX3lxTE1WdG9Sd2NwUmlFcUloWEJEMno4THpKUmd6aEF5dlJqVXRwODVrU09CZnVtcnk3ZDVlS3ctTDRGR09vTEd3eHdGTmdGMXhZQklYWTVhZmZraDdrUG4xYktNemFVUGtiMFNpUzFLcW9lV19mbmM?oc=5",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMic0FVX3lxTE9DRHl3bDJnTUVuRGVUUVR4Y1dsVFdxWVJQSDdWSWVobThTWmFWdXpHZ0hORkpiWVVlelpjQ1pnVlJ0TkJ4a0JpSk55cDhtUzJ5MTJNdTFJMEpUNXVlSGxCbER6R3NYS0R3YlEzdHJiUHJ1eEU?oc=5",
      "https://www.cnbc.com/2026/01/16/trump-wants-tech-companies-to-foot-the-bill-for-new-power-plants-because-of-ai.html"
    ],
    "location_scope": "national",
    "link": "https://news.google.com/rss/articles/CBMic0FVX3lxTE1WdG9Sd2NwUmlFcUloWEJEMno4THpKUmd6aEF5dlJqVXRwODVrU09CZnVtcnk3ZDVlS3ctTDRGR09vTEd3eHdGTmdGMXhZQklYWTVhZmZraDdrUG4xYktNemFVUGtiMFNpUzFLcW9lV19mbmM?oc=5",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.882,
      "consensus": 0.591,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.729,
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story is constructive as it informs readers about a significant policy push and its potential impacts on tech companies. It provides useful context and increases clarity around a current trend, but it doesn't offer solutions or improvements.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Utility bills are increasing across the U.S., even as Trump and state governors urge tech companies to contribute more to cover rising power costs. This comes despite Trump's earlier campaign promise to lower energy prices.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Iran Protests Subside After Crackdown Leaves Over 3",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Sat, 17 Jan 2026 09:27:19 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "New York Times"
    ],
    "domains": [
      "news.google.com",
      "nytimes.com"
    ],
    "snippets": [
      "Death toll in Iran protests over 3,000, rights group says Reuters",
      "Iran protests abate after deadly crackdown, Trump says Tehran calls off mass hangings Reuters",
      "“There is massive disappointment and disillusionment,” one Tehran resident said. A human rights group acknowledged that demonstrations had been subdued since Sunday, with thousands of people detained."
    ],
    "image_url": "",
    "titles": [
      "Death toll in Iran protests over 3,000, rights group says - Reuters",
      "Iran protests abate after deadly crackdown, Trump says Tehran calls off mass hangings - Reuters",
      "Iran Protests Quelled Since Deadly Crackdown, Residents Say"
    ],
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxQM2FFeTJiMnZPd2d3NUZuMkdsby1Bb3NpOFpJYldCRXlMT3J0bkpCUUsybkhwaFY0VzMtQ1FfUmF3cHRsRkkzZzZpSGlCOFEyeTVsZDI4R3pPWXhkMGRmLUcxZGppMEJ3aktPQmh2enpiTUd0X0xqR2ZfZzMzY1gxTEpQZ0hlOC01am12NFROTnNCdFJMdmplMkFTb1VzeHNOTEQ1ZnJKQmpzdw?oc=5",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiuAFBVV95cUxPb2V5aVlhWDg4QmdwMC02WmdDTWJIci1BYlJzdElVOFJEWlR1dkM1aVhDN1Q5MlVVNmxkZ252Q01mZW1mZGRWVktaTXFpQkpid2tRU1Fya05SLTVrdnlyQ0F1QlBoMldRRWhMb2tGZ3VOY3lPakJ0Nm0yX3FSY2FFRXAwZWVoQ0hkY2Z2SVlZcG9HZ2VkbnZHVHZSMkN2Ry1sRnNWb0thMk91Nmp4STcxZ1c1cHVvR0R5?oc=5",
      "https://www.nytimes.com/2026/01/16/world/middleeast/iran-protests-deadly-crackdown.html"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxQM2FFeTJiMnZPd2d3NUZuMkdsby1Bb3NpOFpJYldCRXlMT3J0bkpCUUsybkhwaFY0VzMtQ1FfUmF3cHRsRkkzZzZpSGlCOFEyeTVsZDI4R3pPWXhkMGRmLUcxZGppMEJ3aktPQmh2enpiTUd0X0xqR2ZfZzMzY1gxTEpQZ0hlOC01am12NFROTnNCdFJMdmplMkFTb1VzeHNOTEQ1ZnJKQmpzdw?oc=5",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.96,
      "consensus": 0.591,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.727,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story raises awareness about the situation in Iran, but it does not provide actionable insights, solutions, or a deeper understanding of the causes or impacts.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Protests in Iran have subsided following a deadly crackdown that left over 3,000 people dead, according to a rights group. Thousands have been detained, and Tehran has reportedly called off planned mass executions. Public sentiment remains marked by disappointment and disillusionment.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "CIA Director Ratcliffe Meets Venezuelas Rodriguez After Maduro Seizure",
    "domain": "politics",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Fri, 16 Jan 2026 13:30:14 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "CBC News",
      "New York Times",
      "Financial Times"
    ],
    "domains": [
      "news.google.com",
      "cbc.ca",
      "nytimes.com",
      "ft.com"
    ],
    "snippets": [
      "CIA director Ratcliffe meets with Venezuela's Rodriguez in Caracas Reuters",
      "CIA Director John Ratcliffe met Venezuela's interim leader in Caracas to discuss co-operation, a U.S. official said on Friday, in ​the most senior known visit by a U.S. official since the United States toppled Venezuelan president Nicolás Maduro this month.",
      "The high-profile visit, which could be seen as snubbing the opposition, comes nearly two weeks after the U.S. military seized President Nicolás Maduro in a raid.",
      "John Ratcliffe arrived for talks two weeks after US capture of Nicolás Maduro"
    ],
    "image_url": "",
    "titles": [
      "CIA director Ratcliffe meets with Venezuela's Rodriguez in Caracas - Reuters",
      "CIA chief has face-to-face meeting with Venezuela's interim leader: U.S. official",
      "C.I.A. Director Meets With Venezuela’s Interim President in Caracas",
      "CIA chief met Venezuela’s interim leader Delcy Rodríguez in Caracas"
    ],
    "url": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxOWGFOMS1GZ1E4Vk9wNTdRbDdldk5ZMEpvYnJtNVhfY2MteUQ5bC02a3U3RDIxSVhPQlY2SXktMVpRMXdkN1pKMkpDeXBaeEMtbE5PMWI0aUd0ZmU1VmJVQTFnZXBaM09CV2dsOFZQa2JUeUNocmRlN3Rpa1oxMkFqZUNoMzhpc0x3b3JkTUtLVFAwOHI2dmNiQUtyNjJPU0poSF9DZnJKRHdReFpQZmV1X2lTeU1qWk5Nc1FrUmkwUFV3Mkk?oc=5",
    "alternate_urls": [
      "https://www.cbc.ca/news/world/cia-director-meets-venezuela-rodriguez-9.7049125?cmp=rss",
      "https://www.nytimes.com/2026/01/16/us/politics/cia-director-ratcliffe-venezuela.html",
      "https://www.ft.com/content/fcf7ad4f-c490-43a2-808f-06e842b0ec98"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMiwwFBVV95cUxOWGFOMS1GZ1E4Vk9wNTdRbDdldk5ZMEpvYnJtNVhfY2MteUQ5bC02a3U3RDIxSVhPQlY2SXktMVpRMXdkN1pKMkpDeXBaeEMtbE5PMWI0aUd0ZmU1VmJVQTFnZXBaM09CV2dsOFZQa2JUeUNocmRlN3Rpa1oxMkFqZUNoMzhpc0x3b3JkTUtLVFAwOHI2dmNiQUtyNjJPU0poSF9DZnJKRHdReFpQZmV1X2lTeU1qWk5Nc1FrUmkwUFV3Mkk?oc=5",
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.552,
      "consensus": 0.908,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.725,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs about an important meeting between high-ranking officials which could have significant implications. However, without more context or analysis, it's hard to say how useful this information is to the reader.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "CIA Director John Ratcliffe met with Venezuela's interim leader Rodriguez in Caracas, marking the most senior U.S. visit since the U.S. military seized Nicolás Maduro earlier this month. Discussions focused on cooperation between the two countries, according to a U.S. official.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Education Department Delays Student Loan Collections",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Sat, 17 Jan 2026 05:55:38 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "CNBC",
      "The Guardian"
    ],
    "domains": [
      "news.google.com",
      "cnbc.com",
      "theguardian.com"
    ],
    "snippets": [
      "Trump administration pauses involuntary collections on defaulted student loans Axios",
      "The Education Department has announced it will delay the implementation of wage garnishment and other collections efforts for defaulted student loans.",
      "Any Lucía López Belloza was detained at Boston’s airport in November and flown to Honduras two days later US citizens and permanent residents: have you been racially profiled by ICE? The Trump administration apologized in court for a “mistake” in the deportation of a Massachusetts college student wh",
      "Education Department to delay collections on defaulted student loans CNBC"
    ],
    "image_url": "",
    "titles": [
      "Trump administration pauses involuntary collections on defaulted student loans - Axios",
      "Education Department to delay collections on defaulted student loans",
      "Trump administration says deporting college student trying to surprise family was a ‘mistake’",
      "Education Department to delay collections on defaulted student loans - CNBC"
    ],
    "url": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxQNnB3cjBHV29jeWI5cm5ubE5TNF9vaDMxOWFuaWZMc2p4aVNjQTlCdG40WjJSYmoxN3hubG1YX2FDYkQ0U2xYVTA2TEp6alhPSWtmOGJ3blFvUkdwVDNQbnlSVjBlSDlQQkU3NUtiNkd3Vk9wdGs0Z1lTQjc3M1laaVJiTkFBdlJa?oc=5",
    "alternate_urls": [
      "https://www.cnbc.com/2026/01/16/student-loan-collections-paused.html",
      "https://www.theguardian.com/us-news/2026/jan/16/trump-administration-mistake-college-student-detained",
      "https://news.google.com/rss/articles/CBMid0FVX3lxTE9ORGo0MXJUYVo0THZzNUpGOUJWLXR4WmFNVzdqWl9ITEhDYk5KaGowSXZOY050a2Z2OUM2WVJsM2RNSldBYXpDcVJXNDNwRmxndHpjbnJTYWFtUUJpcjhMcFg2NERVcWlQakc2NGhMLTZVM2lxTnQ40gF8QVVfeXFMTnJpb0ZiRGhOSDloRmpRTXZ4alJsamRyS2lYMVB0UWZjcnVpdDlvTi0zZk9NS2NkRWJ3ODlBNmF1UFVVUXFzWjNlWC1IRVNBdXZMaS1MemtQVE9YSnVZZW1GREFjYUsyQmJKLVgxM05QbFpwWW1IUW0xV1pxTA?oc=5"
    ],
    "location_scope": "national",
    "link": "https://news.google.com/rss/articles/CBMiiAFBVV95cUxQNnB3cjBHV29jeWI5cm5ubE5TNF9vaDMxOWFuaWZMc2p4aVNjQTlCdG40WjJSYmoxN3hubG1YX2FDYkQ0U2xYVTA2TEp6alhPSWtmOGJ3blFvUkdwVDNQbnlSVjBlSDlQQkU3NUtiNkd3Vk9wdGs0Z1lTQjc3M1laaVJiTkFBdlJa?oc=5",
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.87,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.723,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The Education Department announced it will delay wage garnishment and other collection efforts for defaulted student loans. Additionally, the Trump administration apologized in court for mistakenly deporting Massachusetts college student Lucía López Belloza from Boston to Honduras in November.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Trump Threatens Tariffs Over Greenland Annexation Plan",
    "domain": "politics",
    "source_domain": "cnbc.com",
    "location": "national",
    "published": "Fri, 16 Jan 2026 19:32:38 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Financial Times",
      "The Guardian"
    ],
    "domains": [
      "cnbc.com",
      "ft.com",
      "theguardian.com"
    ],
    "snippets": [
      "The comments show Trump considering applying his aggressive tariff strategies to his efforts to acquire Greenland.",
      "US president redoubles demands for Danish territory two days after Washington agreed to be part of high-level working group",
      "President raises pressure on European allies as US envoy says deal to take island ‘should and will be made’ Fear in Greenland as threat of invasion looms Donald Trump has threatened to impose tariffs on countries that do not “go along” with his plan to annex Greenland, increasing pressure on Europea"
    ],
    "image_url": "",
    "titles": [
      "Trump floats new tariffs in push to acquire Greenland",
      "Trump threatens tariffs on allies over opposition to Greenland plan",
      "Trump threatens tariffs against those who oppose him taking Greenland"
    ],
    "url": "https://www.cnbc.com/2026/01/16/trump-greenland-tariffs.html",
    "alternate_urls": [
      "https://www.ft.com/content/8c804726-aecb-4d48-b532-91334be8cd1b",
      "https://www.theguardian.com/world/2026/jan/16/trump-greenland-envoy-us-denmark"
    ],
    "location_scope": "national",
    "link": "https://www.cnbc.com/2026/01/16/trump-greenland-tariffs.html",
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.652,
      "consensus": 0.789,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.714,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about a political move, but it lacks depth and insight into the implications of such a decision, hence it doesn't contribute significantly to the reader's understanding or decision-making.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Donald Trump has threatened to impose tariffs on countries opposing his plan to annex Greenland, intensifying pressure on European allies. The US recently agreed to join a high-level working group on the issue, while a US envoy stated a deal for the island 'should and will be made.' Concerns have been raised in Greenland over the possibility of invasion.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Bo Bichette Signs Three Year",
    "domain": "sports",
    "source_domain": "cbssports.com",
    "location": "national",
    "published": "Fri, 16 Jan 2026 22:23:08 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sportsnet",
      "Yahoo Sports",
      "Sports Illustrated"
    ],
    "domains": [
      "cbssports.com",
      "sportsnet.ca",
      "sports.yahoo.com",
      "news.google.com"
    ],
    "snippets": [
      "Also, the biggest free agent prize has finally come off the board, going to the exact team you'd expect",
      "When Bo Bichette returned from injury and played second base in the World Series for the Toronto Blue Jays last season, it seemed to give the longtime shortstop more defensive versatility heading into free agency. Little did anyone know that a third position could be a possibility for Bichette. Jon Heyman of the New York Post and Ken Rosenthal of The Athletic reported Bichette is expected to play third base for the New York Mets after agreeing to a three-year, $126-million deal on Friday. Bichette, 27, never has started at third base in his seven-year MLB career. He had made all his starts at...",
      "On an emergency episode of The Mets Pod recorded live, Connor Rogers and Joe DeMayo are joined by SNY's Steve Gelbs for real-time reaction to the news that the Mets signed free agent infielder Bo Bichette to a three-year contract.",
      "The New York Mets came out of nowhere to sign Bo Bichette on Friday. David Singh has more what Bichette will bring to his new team.",
      "The addition of the right-handed bat lengthens the Mets lineup.",
      "If Ronny Mauricio is on the move, the Reds should be calling.",
      "Bo Bichette will likely play his first game with the New York Mets against the Pittsburgh Pirates.",
      "Bo Bichette is expected to be the Mets' third baseman in 2026 after signing a three-year deal worth $126 million.",
      "Phillies' Contract Offer to Bo Bichette Revealed After Star Spurns Club for Mets Sports Illustrated",
      "Mets’ Projected Opening Day Lineup After Adding Bo Bichette in Free Agency Sports Illustrated",
      "Bo Bichette Mets' Signing Was Yankees Worst Possible Outcome Sports Illustrated",
      "Suspense quickly turned to disappointment for the Blue Jays over the past 24 hours as Kyle Tucker landed with the Dodgers and Bo Bichette chose the Mets. Sportsnet’s Ben Nicholson-Smith examines the ramifications of both deals in Toronto.",
      "Infielder Bo Bichette is reportedly joining the Mets"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2026/01/16/63ce38b8-a11f-4097-9614-819b3c035971/bo-bichette.jpg",
    "titles": [
      "Fantasy Baseball Offseason Tracker: Mets sign Bo Bichette to play third base, casting doubt on Brett Baty",
      "Reports: Bo Bichette expected to play third base for Mets",
      "The Mets get Bo Bichette, after Kyle Tucker flies to LA | The Mets Pod",
      "What surprising Bo Bichette signing means for Mets",
      "How the Mets’ lineup looks with Bo Bichette in it",
      "Did the Bo Bichette signing and Gavin Lux trade pave the way for a Mets/Reds deal?",
      "Pirates will face Bo Bichette in his Mets debut",
      "Mets' Bo Bichette signing creates world of possibilities for infield alignment and lineup",
      "Phillies' Contract Offer to Bo Bichette Revealed After Star Spurns Club for Mets - Sports Illustrated",
      "Mets’ Projected Opening Day Lineup After Adding Bo Bichette in Free Agency - Sports Illustrated",
      "Bo Bichette Mets' Signing Was Yankees Worst Possible Outcome - Sports Illustrated",
      "What’s next for Blue Jays after missing out on Kyle Tucker, Bo Bichette",
      "Bichette to the Mets, per reports"
    ],
    "url": "https://www.cbssports.com/fantasy/baseball/news/fantasy-baseball-offseason-tracker-mets-sign-bo-bichette-to-play-third-base-casting-doubt-on-brett-baty/",
    "alternate_urls": [
      "https://sports.yahoo.com/articles/mets-bo-bichette-kyle-tucker-193002214.html",
      "https://sports.yahoo.com/articles/mets-lineup-looks-bo-bichette-200500755.html",
      "https://sports.yahoo.com/articles/did-bo-bichette-signing-gavin-194824337.html",
      "https://sports.yahoo.com/articles/pirates-face-bo-bichette-mets-191609134.html",
      "https://sports.yahoo.com/articles/mets-bo-bichette-signing-creates-191020717.html",
      "https://news.google.com/rss/articles/CBMiigFBVV95cUxNcExSR1UwZlpWWjhMbEFmMW1ub3FOWngtWUpFREJHQXNEUUFWbHU2MVFJWUJZbGtneEZKQ0lzekd0Z1R1VUZYc0JfdEJjcWwxeF9tcVRfVkdrWWZLZUlUWVhHdlZDeHpldTF1RVNTWDJKemItMFJHRkFDY1hNQUppT0JzOGJSbFFnVGc?oc=5",
      "https://news.google.com/rss/articles/CBMifkFVX3lxTFBIVU9DdjI4V2NMVVprbmxJaTBPV3o0TUNrN0tJYnJEUVMyeUdRWUM4RFhmNUJ3VjJ1X1g0U0VSbzNIak9yUEN4dkVmRzVLX3ZpNnZxcnE3cm1VcVdySTlPRUFCeDU5b2VTSmNnYndVRnBrcXd4R0Jnd1NEVFhhQQ?oc=5",
      "https://news.google.com/rss/articles/CBMiqAFBVV95cUxQT1VlVXIxQ3ItTEc2STA1T3VLczl3TFlYREJBV2xUeE1OODlnRlNCUXdFVUFlM19kQW5UY1d2SnpiaWRSVll0dGZkaTE4b2hva3BKUXBub1lTZUpHZ2xaa0t1eGpZUUdmVTkxRkpySG1xWVdwdEZLLTVwMG9wSHRQdm9JdlNOdUhEWXF2T2xaY3cyT2ZoZmE4YWxIYWpjRENEbXVJUHIwM2Y?oc=5",
      "https://sports.yahoo.com/articles/bichette-mets-per-reports-183310643.html"
    ],
    "location_scope": "national",
    "link": "https://www.cbssports.com/fantasy/baseball/news/fantasy-baseball-offseason-tracker-mets-sign-bo-bichette-to-play-third-base-casting-doubt-on-brett-baty/",
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.706,
      "consensus": 0.908,
      "constructiveness": 0.03,
      "proximity": 0.5
    },
    "score": 0.714,
    "constructiveness_score": 0.03,
    "constructiveness_reason": "actions: sign; semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Bo Bichette has signed a three-year, $126 million contract with the New York Mets and is expected to play third base in 2026. Bichette, who previously played for the Toronto Blue Jays, will make his Mets debut against the Pittsburgh Pirates. The signing was confirmed on Friday, ending speculation about his free agency.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Over 100 Killed Hundreds of Thousands Displaced by Southern Africa",
    "domain": "general",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Sat, 17 Jan 2026 07:29:16 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Associated Press"
    ],
    "domains": [
      "aljazeera.com",
      "news.google.com"
    ],
    "snippets": [
      "Torrential rains have devastated communities from Mozambique to South Africa, displacing hundreds of thousands.",
      "More than 100 dead in torrential rains and floods across southern Africa AP News"
    ],
    "image_url": "",
    "titles": [
      "Floods kill more than 100 across southern Africa as rains intensify",
      "More than 100 dead in torrential rains and floods across southern Africa - AP News"
    ],
    "url": "https://www.aljazeera.com/news/2026/1/17/floods-kill-more-than-100-across-southern-africa-as-rains-intensify?traffic_source=rss",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiogFBVV95cUxQX1dHWEhKcXBFaVVQWENFM01feEdpbTdrQ3lPS3BKVE5vWjhNLV90V3A2OHhFbkZQc2FFS0hnTlN2cDJQcjBzUndSSG9qVWlocjRBeTJkUkljRjNpM1l5X0tJY21GMnk5TEFWdXJJN2tjUi13SnJxX185MzlBOFF3MWdMZEtOQ2lHT19ucVdxQ0o0c2xYaVVxMk1EakFMWVl4Zmc?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2026/1/17/floods-kill-more-than-100-across-southern-africa-as-rains-intensify?traffic_source=rss",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.909,
      "consensus": 0.591,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.697,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "While this story raises awareness about a disaster, it does not provide actionable insights, deeper understanding, or report on attempts to solve the problem.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Torrential rains and floods across southern Africa have killed more than 100 people and displaced hundreds of thousands, with communities in countries from Mozambique to South Africa heavily affected.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Mirra Andreeva Wins Adelaide International Final Over Victoria Mboko",
    "domain": "sports",
    "source_domain": "sportsnet.ca",
    "location": "national",
    "published": "Fri, 16 Jan 2026 22:49:57 EST",
    "source": "Sportsnet",
    "sources": [
      "Sportsnet",
      "Yahoo Sports"
    ],
    "domains": [
      "sportsnet.ca",
      "sports.yahoo.com"
    ],
    "snippets": [
      "Canada’s Victoria Mboko fell just short of earning her first title of the 2026 season. The 19-year-old from Toronto fell 6-3, 6-1 to third-seeded Russian Mirra Andreeva in the Adelaide International women’s tennis final on Saturday local time.",
      "Third-seeded Mirra Andreeva trailed 3-0 but came back to win nine games in a row and 12 of the last 13 to beat Victoria Mboko 6-3, 6-1 in the Adelaide International final on Saturday. The match featured the only players aged under 20 inside the top 20 on the WTA Tour. The Canadian took a 3-0 lead in"
    ],
    "image_url": "https://www.sportsnet.ca/wp-content/uploads/2026/01/mboko.jpg",
    "titles": [
      "Canada’s Mboko falls in straight sets to Andreeva in Adelaide International final",
      "Andreeva comes back from early deficit to beat Mboko in the Adelaide International final"
    ],
    "url": "https://sports.yahoo.com/articles/andreeva-comes-back-early-deficit-034226046.html",
    "alternate_urls": [],
    "location_scope": "national",
    "link": "https://sports.yahoo.com/articles/andreeva-comes-back-early-deficit-034226046.html",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.821,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.691,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Mirra Andreeva defeated Victoria Mboko 6-3, 6-1 to win the Adelaide International women's tennis final. Andreeva, the third seed, overcame a 3-0 deficit to claim her first title of the 2026 season. Both finalists are under 20 and ranked in the WTA top 20.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Steve Ballmer Seeks Dismissal of Fraud Lawsuit Involving Kawhi Leonard",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Sat, 17 Jan 2026 01:01:33 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "espn.com",
      "cbssports.com"
    ],
    "snippets": [
      "Attorneys representing Steve Ballmer are seeking to dismiss a lawsuit that alleges the LA Clippers owner participated in a fraud by funneling money to star Kawhi Leonard through a now-defunct green banking company.",
      "Ballmer was named in a lawsuit brought by former Aspiration employees"
    ],
    "image_url": "",
    "titles": [
      "Ballmer aims to dismiss fraud suit over Kawhi pay",
      "Clippers' Steve Ballmer seeks to dismiss fraud lawsuit tied to Kawhi Leonard cap circumvention allegations"
    ],
    "url": "https://www.espn.com/nba/story/_/id/47630738/clippers-ballmer-aims-dismiss-fraud-suit-kawhi-leonard-pay",
    "alternate_urls": [
      "https://www.cbssports.com/nba/news/clippers-steve-ballmer-fraud-lawsuit-kawhi-leonard-allegations/"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/nba/story/_/id/47630738/clippers-ballmer-aims-dismiss-fraud-suit-kawhi-leonard-pay",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.873,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.682,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "negative_penalty=0.08 (keywords: fraud); semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Steve Ballmer's attorneys have filed a motion to dismiss a lawsuit by former Aspiration employees, which alleges Ballmer participated in fraud by channeling funds to Kawhi Leonard through a defunct green banking company.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Danny Boyle Plans Third 28 Years Later Film Focused on Jim",
    "domain": "business",
    "source_domain": "forbes.com",
    "location": "global",
    "published": "Fri, 16 Jan 2026 19:43:36 -0500",
    "source": "Forbes",
    "sources": [
      "Forbes",
      "The Guardian",
      "Business Insider"
    ],
    "domains": [
      "forbes.com",
      "theguardian.com",
      "businessinsider.com"
    ],
    "snippets": [
      "The \"28 Years Later\" sequel \"28 Years Later: The Bone Temple\" is new in theaters, but will the \"28 Years Later\" story continue with another film?",
      "The rage virus zombie thriller “28 Years Later: The Bone Temple,” starring Ralph Fiennes, is new in theaters. How soon will the film be available on streaming?",
      "Another visit to the UK’s putrid zombie aftermath, and the polymath rapper returns after eight years with a collb-packed blockbuster 28 Years Later: The Bone Temple Out now It would have been hard to imagine in 2002 that 28 Days Later would spawn something so different (and that’s probably a good th",
      "\"28 Years Later\" director Danny Boyle plans to have Cillian Murphy's Jim character be the main focus of a third movie.",
      "After Jimmy Savile's death, hundreds accused him of abuse. Danny Boyle says the Jimmy Crystal character reflects what society chooses to remember."
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/696ad5ec3c864910e4277197/0x0.jpg?width=960",
    "titles": [
      "Will There Be A ’28 Years Later 3’ After ‘The Bone Temple’? Here’s The Good News",
      "When Is ’28 Years Later: The Bone Temple’ Coming To Streaming?",
      "From 28 Years Later: The Bone Temple to A$AP Rocky: your complete entertainment guide to the week ahead",
      "Cillian Murphy's Jim plays a big part in the '28 Years Later: The Bone Temple' ending",
      "Danny Boyle confirms Jack O'Connell's cult leader in '28 Years Later: The Bone Temple' was inspired by British TV presenter Jimmy Savile"
    ],
    "url": "https://www.forbes.com/sites/timlammers/2026/01/16/will-there-be-a-28-years-later-3-after-the-bone-temple-heres-the-good-news/",
    "alternate_urls": [
      "https://www.forbes.com/sites/timlammers/2026/01/16/when-is-28-years-later-the-bone-temple-coming-to-streaming/",
      "https://www.theguardian.com/culture/2026/jan/17/going-out-staying-in-complete-entertainment-guide-week-ahead-rental-family-asap-rocky",
      "https://www.businessinsider.com/cillian-murphy-jim-the-bone-temple-28-years-later-ending",
      "https://www.businessinsider.com/jack-oconnell-28-years-later-character-jimmy-crystal-jimmy-savile-2025-6"
    ],
    "location_scope": "global",
    "link": "https://www.forbes.com/sites/timlammers/2026/01/16/will-there-be-a-28-years-later-3-after-the-bone-temple-heres-the-good-news/",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.753,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.682,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "\"28 Years Later: The Bone Temple\" has been released in theaters. Director Danny Boyle has announced plans for a third film in the series, with Cillian Murphy's character Jim set to be the main focus.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Charlotte Bankes Claims Snowboard Cross World Cup Win in Dongbeiya",
    "domain": "sports",
    "source_domain": "sports.yahoo.com",
    "location": "national",
    "published": "Sat, 17 Jan 2026 09:47:19 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports",
      "BBC Sport"
    ],
    "domains": [
      "sports.yahoo.com",
      "bbc.com"
    ],
    "snippets": [
      "Great Britain's Charlotte Bankes wins her first snowboard cross World Cup of the season with a dominant display in Dongbeiya."
    ],
    "image_url": "",
    "titles": [
      "Bankes wins first World Cup race since injury",
      "GB snowboarder Bankes wins first World Cup race since injury"
    ],
    "url": "https://sports.yahoo.com/articles/bankes-wins-first-world-cup-094719012.html",
    "alternate_urls": [
      "https://www.bbc.com/sport/articles/cj3vyr6g738o?at_medium=RSS&at_campaign=rss"
    ],
    "location_scope": "national",
    "link": "https://sports.yahoo.com/articles/bankes-wins-first-world-cup-094719012.html",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.969,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.679,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Charlotte Bankes won her first snowboard cross World Cup of the season in Dongbeiya, delivering a dominant performance to secure victory for Great Britain.",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Dragons Defeat Newcastle 35 12 in Challenge Cup",
    "domain": "sports",
    "source_domain": "sports.yahoo.com",
    "location": "national",
    "published": "Sat, 17 Jan 2026 09:43:05 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports",
      "BBC Sport"
    ],
    "domains": [
      "sports.yahoo.com",
      "bbc.com"
    ],
    "snippets": [
      "Dragons beat Newcastle 35-12 in the Challenge Cup at Rodney Parade to move to within touching distance of the last 16."
    ],
    "image_url": "",
    "titles": [
      "Dragons on brink of last 16 after thrashing Newcastle"
    ],
    "url": "https://sports.yahoo.com/articles/dragons-brink-last-16-thrashing-220745735.html",
    "alternate_urls": [
      "https://www.bbc.com/sport/rugby-union/articles/c0q47egwlxpo?at_medium=RSS&at_campaign=rss"
    ],
    "location_scope": "national",
    "link": "https://sports.yahoo.com/articles/dragons-brink-last-16-thrashing-220745735.html",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.967,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.679,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt_short",
    "summary_reason": "too_short",
    "headline_source": "gpt",
    "summary": "Dragons defeated Newcastle 35-12 in the Challenge Cup at Rodney Parade, moving close to securing a place in the last 16.",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Elon Musk Sues OpenAI and Microsoft",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Sat, 17 Jan 2026 09:04:10 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "Bloomberg"
    ],
    "domains": [
      "news.google.com"
    ],
    "snippets": [
      "Musk seeks up to $134 billion from OpenAI, Microsoft in 'wrongful gains' Reuters",
      "Musk Seeks Up to $134 Billion Damages From OpenAI, Microsoft Bloomberg.com"
    ],
    "image_url": "",
    "titles": [
      "Musk seeks up to $134 billion from OpenAI, Microsoft in 'wrongful gains' - Reuters",
      "Musk Seeks Up to $134 Billion Damages From OpenAI, Microsoft - Bloomberg.com"
    ],
    "url": "https://news.google.com/rss/articles/CBMipAFBVV95cUxOMkhieklLaWNDajZpQlZZWVFxdjFxMUZPT09ObDlPcmxXcDJyV2FQQVZfZW9tWXZXZG1xZ0MtR3JTWkR0dE5pNXpRM0UwWVJXWURwWXE5Tk8tVW9qYnVSSF9QVm1rb3pVU0hSYUpUcDcxX09QVkdBd1d2REtFTEJKa2dWUXpjMTVhT2FiRGg0cUZXVW5xLWNYQUMyNUNJUzJ5b1c3NQ?oc=5",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMirgFBVV95cUxONFRnbTJjMmp4QnVnTzh0OVA4TW9kYTdKTkFVSmh4YmhsT3dCOTFuMk9EaHZzQTJFMm92UGZfRlRRT0FsTjhGMDhncXFQYXhsOWtWUkdQR1J5bENxVjRta3o0TTZjQlJsOGNBXzAtbHh1QXJJckthX0V0QmtzX3pTdjhtWi1ZMHhXc2hWTFM2ZG9lQ2JPM1ZHNFI2cW80TV8wQXRKRWk1TDVaaUg0elE?oc=5"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMipAFBVV95cUxOMkhieklLaWNDajZpQlZZWVFxdjFxMUZPT09ObDlPcmxXcDJyV2FQQVZfZW9tWXZXZG1xZ0MtR3JTWkR0dE5pNXpRM0UwWVJXWURwWXE5Tk8tVW9qYnVSSF9QVm1rb3pVU0hSYUpUcDcxX09QVkdBd1d2REtFTEJKa2dWUXpjMTVhT2FiRGg0cUZXVW5xLWNYQUMyNUNJUzJ5b1c3NQ?oc=5",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.95,
      "consensus": 0.571,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.676,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Elon Musk has filed a lawsuit against OpenAI and Microsoft, seeking up to $134 billion in damages. Musk alleges that the companies made 'wrongful gains' related to their business activities.",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "NASA Set to Launch Artemis II Crewed Moon Mission as Early as",
    "domain": "science",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Sat, 17 Jan 2026 07:50:56 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "NASA"
    ],
    "domains": [
      "bbc.com",
      "nasa.gov"
    ],
    "snippets": [
      "The first crewed Moon mission in 50 years could launch in February, ahead of a future lunar landing.",
      "NASA is weeks away from sending astronauts farther than any crew has traveled before, with the agency’s second mission in its Artemis campaign. The Artemis II Press Kit now is available with information on the mission, astronauts, and other resources for media. “Artemis II will be a momentous step f"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/1a00/live/e35f0660-ed44-11f0-8cc8-8329494b82ad.png",
    "titles": [
      "When does the Nasa Moon mission launch and who are the Artemis II crew?",
      "What You Need to Know About NASA’s Artemis II Moon Mission"
    ],
    "url": "https://www.bbc.com/news/articles/c0q4w3l0wdvo?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://www.nasa.gov/news-release/what-you-need-to-know-about-nasas-artemis-ii-moon-mission/"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/news/articles/c0q4w3l0wdvo?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.918,
      "consensus": 0.591,
      "constructiveness": 0.06,
      "proximity": 0.5
    },
    "score": 0.67,
    "constructiveness_score": 0.06,
    "constructiveness_reason": "keywords (1): launch; actions: launch; semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "NASA is preparing to launch Artemis II, its first crewed Moon mission in 50 years, as early as February. The mission will send astronauts farther from Earth than any previous crewed flight, marking a major milestone in the Artemis program ahead of a future lunar landing.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "US Lawmakers Visit Denmark After Trumps Greenland Comments",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Fri, 16 Jan 2026 22:48:21 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "New York Times"
    ],
    "domains": [
      "news.google.com",
      "nytimes.com"
    ],
    "snippets": [
      "US lawmakers in Denmark seek to 'lower temperature' after Trump's Greenland threats Reuters",
      "Our reporter Jeffrey Gettleman is on the ground in Greenland, seeing how people have reacted to Trump’s desire to take it over. He and our senior writer Katrin Bennhold discuss what Greenland means to the United States, Denmark and Greenlanders."
    ],
    "image_url": "",
    "titles": [
      "US lawmakers in Denmark seek to 'lower temperature' after Trump's Greenland threats - Reuters",
      "How Greenland Is Reacting to Trump’s Threats"
    ],
    "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxOMEg3aWdHUW50UE1CT0x4SFZrV1hqakFwRnhWVTlydnNKLXlRdVhuTG9UMDNMLW9HZk9EVko4SW9UZHpGeXdocG1rWTU1RVRmMmFBX0ZPb0plUW45OXc0eGZxc25wUko5ZnBUb3FUYW5GZDcxQUw0WkhQU1drNU81TXF3Mk40QTQzSWM3LUlsZUh0emxGQ19KTG5sYlNKYkhBZ3JSa1pNTTI?oc=5",
    "alternate_urls": [
      "https://www.nytimes.com/video/world/europe/100000010642168/how-greenland-is-reacting-to-trumps-threats.html"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxOMEg3aWdHUW50UE1CT0x4SFZrV1hqakFwRnhWVTlydnNKLXlRdVhuTG9UMDNMLW9HZk9EVko4SW9UZHpGeXdocG1rWTU1RVRmMmFBX0ZPb0plUW45OXc0eGZxc25wUko5ZnBUb3FUYW5GZDcxQUw0WkhQU1drNU81TXF3Mk40QTQzSWM3LUlsZUh0emxGQ19KTG5sYlNKYkhBZ3JSa1pNTTI?oc=5",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.714,
      "consensus": 0.591,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.669,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful context about the political dynamics between the US and Denmark, and the potential impacts of Trump's threats. However, it does not offer solutions or significant insights into the broader implications.",
    "constructiveness_source": "gpt",
    "summary_source": "cache",
    "summary_reason": "",
    "headline_source": "cache",
    "summary": "US lawmakers visited Denmark to ease tensions following Donald Trump's statements about acquiring Greenland. The visit aimed to address concerns raised by Trump's comments and discuss Greenland's significance to the US, Denmark, and Greenlanders.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Defendant in Charlie Kirk Case Seeks Disqualification of Prosecutors",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Sat, 17 Jan 2026 01:45:00 GMT",
    "source": "Associated Press",
    "sources": [
      "Associated Press",
      "Globe and Mail"
    ],
    "domains": [
      "news.google.com"
    ],
    "snippets": [
      "Defendant in Charlie Kirk’s killing asks judge to disqualify prosecutors AP News",
      "Defence for man charged with Charlie Kirk’s killing asks judge to disqualify prosecutors The Globe and Mail"
    ],
    "image_url": "",
    "titles": [
      "Defendant in Charlie Kirk’s killing asks judge to disqualify prosecutors - AP News",
      "Defence for man charged with Charlie Kirk’s killing asks judge to disqualify prosecutors - The Globe and Mail"
    ],
    "url": "https://news.google.com/rss/articles/CBMimwFBVV95cUxOTHpjd09aa1FoY0RLRU5CeXdpNHM5N3hPekxoSmprVFQ0QmplYXVmaUxBeE1QZ3FDWjB4VGRiVUE4RkVNUFhCYTRkdjd3VjFDOUtjQ0hHbjJ0Q19DZTRMVDVwTVoxUFEwZTRwS1cyWks0ME5EbEtIc25HX2NsT2VuUkRIN3hkdnNUenFPM2JHLUN4Um5BUDdjY1RyOA?oc=5",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMisAFBVV95cUxPS3puUFdxbEtvVmhJT3pSMGxrdVRuaDY0Q2QwYktoU3UtSTNrZV9qcTNTYk1BVDh3OGhlZE1KS0VWX2hjT0ZNOC0zbDJNZzhkTWxQVkZraU1IQUw5djJLMUk5bjIzeHNxa2k1b3NydXI4bmdOWW5mZ0plczQ5Q0ZzVHJCVVZTRXJXY1hwekRrMnRWVmFVWlJSTzBKQzNZeVZKTVBGN3oza0F2ZkRkbXNKVQ?oc=5"
    ],
    "location_scope": "national",
    "link": "https://news.google.com/rss/articles/CBMimwFBVV95cUxOTHpjd09aa1FoY0RLRU5CeXdpNHM5N3hPekxoSmprVFQ0QmplYXVmaUxBeE1QZ3FDWjB4VGRiVUE4RkVNUFhCYTRkdjd3VjFDOUtjQ0hHbjJ0Q19DZTRMVDVwTVoxUFEwZTRwS1cyWks0ME5EbEtIc25HX2NsT2VuUkRIN3hkdnNUenFPM2JHLUN4Um5BUDdjY1RyOA?oc=5",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.775,
      "consensus": 0.571,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.667,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story provides some awareness about a court case, but it does not provide any actionable insights or deeper understanding. It does not report on solutions, improvements, innovations, or attempts to solve problems.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The defendant charged in Charlie Kirk's killing has requested that the judge disqualify the current prosecutors from the case. The court has not yet ruled on the request.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "OpenAI to Test Targeted Ads in ChatGPT to Boost Revenue",
    "domain": "business",
    "source_domain": "cnbc.com",
    "location": "national",
    "published": "Fri, 16 Jan 2026 21:14:45 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Reuters",
      "Bloomberg"
    ],
    "domains": [
      "cnbc.com",
      "news.google.com"
    ],
    "snippets": [
      "OpenAI said ads would not influence ChatGPT's responses and that it will \"never\" sell user data to advertisers.",
      "OpenAI to test ads in ChatGPT in bid to boost revenue Reuters",
      "OpenAI to Test Targeted Ads in ChatGPT, Stepping Up Revenue Push Bloomberg.com"
    ],
    "image_url": "",
    "titles": [
      "OpenAI to begin testing ads on ChatGPT in the U.S.",
      "OpenAI to test ads in ChatGPT in bid to boost revenue - Reuters",
      "OpenAI to Test Targeted Ads in ChatGPT, Stepping Up Revenue Push - Bloomberg.com"
    ],
    "url": "https://www.cnbc.com/2026/01/16/open-ai-chatgpt-ads-us.html",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMilwFBVV95cUxOckJWY2FPejVYUHFkN2ZrSEt6cW9xZ0ZEVmZVcFEwTEdjWW4tQjB3Z3dWM0Z3SW56TGtOYkdTVHZVUUtUSVZTak4xYVNzTjBmZU9FdzU0NTFpdWpPZklCa1drT3F4cmdxeHpsRGRXTHpPQ2VIci10dHdaU2tEN1NpSGlMNTVCeFplUklWX1ludU5QNU1yaWZZ?oc=5",
      "https://news.google.com/rss/articles/CBMitAFBVV95cUxQZ1hZX1hQYXZZREc5RFJQRmZVeklXNGRyeUJWVndjNHk0UTJPT25IblNhaG50SUdtNjZFcEVieEIxSTVuTXh0WGZlX3pGM1BVNzA1cVZFUWdOX3NZbndIbGNOMkFFeGRHTmF3OG9KZm0tYkI2UThWNkdsZVI5RGlBY01iOXlfN3BhNTNYTGV1WmV0aU9BLUZvUVBDWU5LX0RvRGJKeU1hVjdHcXotVFdKc1RFakE?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.cnbc.com/2026/01/16/open-ai-chatgpt-ads-us.html",
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.684,
      "consensus": 0.769,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.663,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "OpenAI announced it will begin testing targeted ads in ChatGPT to increase revenue. The company stated that ads will not affect ChatGPT's responses and user data will not be sold to advertisers.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Controlled Avalanche on Mount Elbrus Engulfs Ski Resort Without",
    "domain": "general",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Fri, 16 Jan 2026 20:28:11 -0500",
    "source": "ABC News",
    "sources": [
      "ABC News",
      "BBC"
    ],
    "domains": [
      "abcnews.go.com",
      "bbc.com"
    ],
    "snippets": [
      "Heart-stopping video shows the moment a controlled avalanche in Russia sends a powerful wall of snow down a mountainside and engulfed a ski resort.",
      "Authorities deliberately triggered the avalanche on Mount Elbrus to release a build up of snow."
    ],
    "image_url": "https://s.abcnews.com/images/WNT/260116_wn_avalanche_vo_hpMain_4x3_384.jpg",
    "titles": [
      "WATCH:  Video shows moment controlled avalanche roars down Russian mountainside",
      "Watch: Artificial avalanche tumbles down Russian mountain"
    ],
    "url": "https://abcnews.go.com/WNT/video/video-shows-moment-controlled-avalanche-roars-russian-mountainside-129299495",
    "alternate_urls": [
      "https://www.bbc.com/news/videos/c338r7zgydvo?at_medium=RSS&at_campaign=rss"
    ],
    "location_scope": "national",
    "link": "https://abcnews.go.com/WNT/video/video-shows-moment-controlled-avalanche-roars-russian-mountainside-129299495",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.769,
      "consensus": 0.591,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.655,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about a controlled avalanche, but it does not offer any actionable insights or deeper understanding. It also lacks information on any improvements, innovations, or attempts to solve problems.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Authorities in Russia conducted a controlled avalanche on Mount Elbrus to safely release built-up snow. Video footage shows the avalanche sending a large wall of snow down the mountain and engulfing a ski resort. No injuries or major damage were reported.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Shell and Mitsubishi Weigh Sale of Stakes in LNG Canada",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Fri, 16 Jan 2026 19:31:46 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "Globe and Mail"
    ],
    "domains": [
      "news.google.com"
    ],
    "snippets": [
      "Exclusive: Shell, Mitsubishi exploring sale options for their stakes in LNG Canada, sources say Reuters",
      "Shell and Mitsubishi exploring sale options for stakes in LNG Canada The Globe and Mail"
    ],
    "image_url": "",
    "titles": [
      "Exclusive: Shell, Mitsubishi exploring sale options for their stakes in LNG Canada, sources say - Reuters",
      "Shell and Mitsubishi exploring sale options for stakes in LNG Canada - The Globe and Mail"
    ],
    "url": "https://news.google.com/rss/articles/CBMixgFBVV95cUxQc1l2Q09jWkIzMFlWekJzb09aSUIyQkxWVW9VZy1xeWdqSWozNU5kUlI5M0w3LWtkTk55a3FubDMzbS0wYVVpWl9Ud2FWR1VTc1JJd19WNGc1cVBQdUdwY0dPb3dzQ1o4YmVzMFB1d09tR0VvbGpyRlBuTHpSeVZpSmlPNm40dlNZa0J6bEllNnBTQy1ERURhS25ad1JucEV0NTZwSE5KZTNLRjlFaXA1YVhfWDlHMmwtcEpEelg5NTRkSl9taWc?oc=5",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMi1gFBVV95cUxOUWxNTzlubHZqTWdFekxMa2s2WGJzZERSMjVQVTkzVzFVX2RjSHo3NjJ3MFFNTzBvRHk2aWN3WFhfUnl3ZFZWZFRoVnd2UTNxbGJaVGhRMS15THVBbDZtbUNTX2FxeVRodnctVmpVTFBaN1MxTWZSTTlmbDNNM0R0UXRlcmRXSGx4ZjJfSFdnMHIxb3ZuQm8xVERJMGNqeUNYNnNFSUlqZ2RLVC15UXZ6Q2ItMEJMQ2JCVUdFNG54em0wR3FheUZSekFuSkRTb0xPRnlTM1Rn?oc=5"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMixgFBVV95cUxQc1l2Q09jWkIzMFlWekJzb09aSUIyQkxWVW9VZy1xeWdqSWozNU5kUlI5M0w3LWtkTk55a3FubDMzbS0wYVVpWl9Ud2FWR1VTc1JJd19WNGc1cVBQdUdwY0dPb3dzQ1o4YmVzMFB1d09tR0VvbGpyRlBuTHpSeVZpSmlPNm40dlNZa0J6bEllNnBTQy1ERURhS25ad1JucEV0NTZwSE5KZTNLRjlFaXA1YVhfWDlHMmwtcEpEelg5NTRkSl9taWc?oc=5",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.652,
      "consensus": 0.571,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.64,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs readers about a potential business decision by Shell and Mitsubishi, providing some useful context. However, it does not clearly highlight progress, solutions, or empowering knowledge.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Shell and Mitsubishi are considering selling their stakes in LNG Canada, according to reports from The Globe and Mail and Reuters. Both companies are exploring potential sale options but have not made final decisions.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "US Issues Airline Warnings Amid Latin America Military Activity",
    "domain": "business",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Sat, 17 Jan 2026 03:37:12 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Bloomberg"
    ],
    "domains": [
      "aljazeera.com",
      "news.google.com"
    ],
    "snippets": [
      "Warnings come as Mexico's Sheinbaum says 'compelling results' in tackling drug cartels, following Trump strike threats.",
      "US Warns Airlines About Military Activity in Parts of Latin America Bloomberg.com"
    ],
    "image_url": "",
    "titles": [
      "US air authority warns of ‘military activities’ over Mexico, South America",
      "US Warns Airlines About Military Activity in Parts of Latin America - Bloomberg.com"
    ],
    "url": "https://www.aljazeera.com/news/2026/1/17/us-air-authority-warns-of-military-activities-over-mexico-south-america?traffic_source=rss",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiugFBVV95cUxNWXVPemI0YjFGVXVxR3dFb29vNzhadjI4Qm81ekdWOW9uQXlMSnJCQWJSaWprcG9scHQxeGxWNnpUemh6Z0gzR2JqdU5Wc0NMNGdWRnZrM3NCSkxJVElwbHgzY0tYc1hRV2lLMUNJQmx3dG1nT0wyVlMyQVUzNzk4ZV9SemhGOTF5QmFrNWlzWmFfTlBxbnA5ZFNtX1lzRDN3NldnMkZLYlBoRlhEOFZhT0pIa28ydEJOeFE?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2026/1/17/us-air-authority-warns-of-military-activities-over-mexico-south-america?traffic_source=rss",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.816,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.639,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "speculative_penalty=0.03 (tokens: warn); semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The US government has issued warnings to airlines about increased military activity in parts of Latin America. The alerts follow statements from Mexico's Sheinbaum on progress against drug cartels and recent threats from Trump regarding strikes in the region.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Trump Urges Emergency Power Auction for AI Driven Data Centers",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Sat, 17 Jan 2026 00:56:00 GMT",
    "source": "Bloomberg",
    "sources": [
      "Bloomberg",
      "Financial Times"
    ],
    "domains": [
      "news.google.com",
      "ft.com"
    ],
    "snippets": [
      "Trump Pushes for Emergency Power Auction to Support AI Boom Bloomberg.com",
      "President urges nation’s largest grid operator to have data centre companies bid for contracts to build plants"
    ],
    "image_url": "",
    "titles": [
      "Trump Pushes for Emergency Power Auction to Support AI Boom - Bloomberg.com",
      "Trump calls for emergency energy auction to make tech giants pay for AI power"
    ],
    "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxQVlA0WXhQZDMybURsWEQzaVVCM0UxalRzVXNNWGlZLTR5cEV5UVlZZjBmUUZNalJwd3NKTW9PdG9DNkc1TDRTQzFVNzhiNGN3WDNiam1YSFM0RGNsNzIwd0x4SkhjMUxPcEtNaVc2ZnRUZTVmWHlTbVF0QXY3TmN2WHAwN1hSekJYNFNzMHdGckxSVWhUUzhQdUVkOWV3YkdtNmFrYkoxRVcxSmc?oc=5",
    "alternate_urls": [
      "https://www.ft.com/content/9b3d179e-129c-4aa1-a5c0-1cc1703b0234"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxQVlA0WXhQZDMybURsWEQzaVVCM0UxalRzVXNNWGlZLTR5cEV5UVlZZjBmUUZNalJwd3NKTW9PdG9DNkc1TDRTQzFVNzhiNGN3WDNiam1YSFM0RGNsNzIwd0x4SkhjMUxPcEtNaVc2ZnRUZTVmWHlTbVF0QXY3TmN2WHAwN1hSekJYNFNzMHdGckxSVWhUUzhQdUVkOWV3YkdtNmFrYkoxRVcxSmc?oc=5",
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.758,
      "consensus": 0.591,
      "constructiveness": 0.053,
      "proximity": 0.5
    },
    "score": 0.633,
    "constructiveness_score": 0.053,
    "constructiveness_reason": "keywords (1): support; semantic: pos_sim=0.09, neg_sim=0.00; semantic_boost=0.02; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Trump has called on the nation's largest grid operator to hold an emergency power auction, allowing data center companies to bid for contracts to build new power plants to meet increased electricity demand from the AI sector.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Nvidia H200 Chip Parts Production Halts After China Blocks Shipments",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Sat, 17 Jan 2026 02:11:57 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "Financial Times"
    ],
    "domains": [
      "news.google.com",
      "ft.com"
    ],
    "snippets": [
      "Nvidia H200 chip parts suppliers halt output after China blocks shipments, FT reports Reuters",
      "Parts makers concerned about whether Beijing will allow imports of AI processors"
    ],
    "image_url": "",
    "titles": [
      "Nvidia H200 chip parts suppliers halt output after China blocks shipments, FT reports - Reuters",
      "Nvidia suppliers halt H200 output after China blocks chip shipments"
    ],
    "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxPMXNQQ2FBTWdXcDEzdjFPdGJwOFhpUkFEWE5mMmwxRERYS1BlTDhmLXFDODcwSUFsQ213WEVRUXBqZjhicFhQRnZoNW5nRUptUkR4NzdVRjIyWTFPTWhzMEN4bVRTZHlVaU1mSHF5enJrcWhyMU1tUlJYdWtDb2l5ZjE0ZFd4ZDJneVlQZXFTcU1jbTJDSkY2bTNVS0J6Y3djbVBYUV8xc1RQTlN5V3FJXy1oNlZhYldJRnhxNjNLdmRRSTBJ?oc=5",
    "alternate_urls": [
      "https://www.ft.com/content/02a3eb7c-684f-4e39-87b8-36e9595ef800"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMixAFBVV95cUxPMXNQQ2FBTWdXcDEzdjFPdGJwOFhpUkFEWE5mMmwxRERYS1BlTDhmLXFDODcwSUFsQ213WEVRUXBqZjhicFhQRnZoNW5nRUptUkR4NzdVRjIyWTFPTWhzMEN4bVRTZHlVaU1mSHF5enJrcWhyMU1tUlJYdWtDb2l5ZjE0ZFd4ZDJneVlQZXFTcU1jbTJDSkY2bTNVS0J6Y3djbVBYUV8xc1RQTlN5V3FJXy1oNlZhYldJRnhxNjNLdmRRSTBJ?oc=5",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.785,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.63,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Nvidia H200 chip parts suppliers have stopped production after China blocked shipments of the AI processors, raising concerns among parts makers about future import approvals by Beijing.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Sharks are famous for fearsome teeth, but ocean acidification could make them weaker - AP News",
    "domain": "science",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Sat, 17 Jan 2026 01:06:00 GMT",
    "source": "Associated Press",
    "sources": [
      "Associated Press",
      "Phys.org"
    ],
    "domains": [
      "news.google.com",
      "phys.org"
    ],
    "snippets": [
      "Sharks are famous for fearsome teeth, but ocean acidification could make them weaker AP News",
      "Sharks are the most feared predators in the sea, and their survival hinges on fearsome teeth that regrow throughout their lives. But changes in the ocean's chemistry could put those weapons at risk."
    ],
    "image_url": "",
    "titles": [
      "Sharks are famous for fearsome teeth, but ocean acidification could make them weaker - AP News",
      "Sharks are famous for fearsome teeth, but ocean acidification could make them weaker"
    ],
    "url": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxNekpweDFXZmdUQUZvM3RxbHRLcENldHVXSzhwUnh0YjZNYXZPdFQxYjB1YjBqek1wZjFOelM2YTkxY1dpYmhkTENrVHhNazZGSHpkNlBjVFFSelNCbEVpUEJuRWpwVF9Nc2ZnMDJuUzFzUS1tUHhBcDZlWm1vbUVKX25qMzRQQVhlVXMyUkdkQ1l6ME5RbERmbHhEVjFodFY1R0l4SGdBRjlIZVE?oc=5",
    "alternate_urls": [
      "https://phys.org/news/2026-01-sharks-famous-fearsome-teeth-ocean.html"
    ],
    "location_scope": "national",
    "link": "https://news.google.com/rss/articles/CBMiqwFBVV95cUxNekpweDFXZmdUQUZvM3RxbHRLcENldHVXSzhwUnh0YjZNYXZPdFQxYjB1YjBqek1wZjFOelM2YTkxY1dpYmhkTENrVHhNazZGSHpkNlBjVFFSelNCbEVpUEJuRWpwVF9Nc2ZnMDJuUzFzUS1tUHhBcDZlWm1vbUVKX25qMzRQQVhlVXMyUkdkQ1l6ME5RbERmbHhEVjFodFY1R0l4SGdBRjlIZVE?oc=5",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.761,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.617,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "speculative_penalty=0.03 (tokens: could); semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "skipped",
    "summary_reason": "skipped_due_to_budget",
    "headline_source": "",
    "summary": "",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Hassett pivots to possible 'Trump cards' amid credit card interest rate battle with banks",
    "domain": "business",
    "source_domain": "cnbc.com",
    "location": "national",
    "published": "Fri, 16 Jan 2026 19:33:45 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Reuters"
    ],
    "domains": [
      "cnbc.com",
      "news.google.com"
    ],
    "snippets": [
      "Trump called for banks to cap credit card interest rates at 10%, an idea that has been roundly rejected by industry executives and their lobbyists this week.",
      "Hassett pivots to possible 'Trump cards' amid credit card interest rate battle with banks CNBC",
      "Wall Street banks face test with Trump's call for credit card rate cap Reuters"
    ],
    "image_url": "",
    "titles": [
      "Hassett pivots to possible 'Trump cards' amid credit card interest rate battle with banks",
      "Hassett pivots to possible 'Trump cards' amid credit card interest rate battle with banks - CNBC",
      "Wall Street banks face test with Trump's call for credit card rate cap - Reuters"
    ],
    "url": "https://www.cnbc.com/2026/01/16/white-house-hassett-trump-cards-credit-card-battle.html",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMikAFBVV95cUxNT3JkZ2xJbmV3RzFMeU1uRkxZYWpjamxrelFxdWFmWmZIUjVRdzhDMTJoZUtZREhlS1hReVJ6d1RPMzFGYzl2cHVKc1AwNVpsTmRwNmFEbk05bmVqaEo2YUdiaDlXWG1qaW9MM0VhWGh2SDBJSEd2SlhkWkNTYjFWeHpWNUhOaDM0UXZZSVplYWLSAZYBQVVfeXFMUDBVNE8wcE9BYjhzMHNZU3UwbkJsMUNJbk4wYjI4Y2tNV1VQcXVtcFJWTW1XMUp5aWxpQnZheVFxak9pUERsR1N1NGlRWGQxYUtPdmJ6VFhTelcyN2pDV1NhMTluMVV2ejlTcWkzcXFsYTJJZzBSQ0o1SWd6WDl5d1czNVBiWkpKbHNlV0lZcHBHR1ZQRDR3?oc=5",
      "https://news.google.com/rss/articles/CBMi2AFBVV95cUxQdWFZMnlSbWpUS2JRcHIxcGRFdzNVQXUzcXRZVi1aazZmUkoxQlpzWF9IWGl6SThqVHR0S0dtT2E5YlZudnNvQi1XVXZ5dTdOX0NVbXBOQW5rZWx4Q3U1N1J1VE0yVmcxajhfVHo1OFk1QVFHdW56ZlMteWgzX1VtMjhjQnZJRmVJTWpULXQwa05tRWU5UnlITUYxS1BmUlRxVUxFR09RQ25SSmRxYV9Ma0UycGlXbFcxVDhVOGFaWmhlSVR4cjdGOGxGYnNUb281andJWU5odlY?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.cnbc.com/2026/01/16/white-house-hassett-trump-cards-credit-card-battle.html",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.653,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.591,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "speculative_penalty=0.03 (tokens: possible); semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "skipped",
    "summary_reason": "skipped_due_to_budget",
    "headline_source": "",
    "summary": "",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "New map reveals hidden landscape under Antarctica's ice sheet - Reuters",
    "domain": "science",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Fri, 16 Jan 2026 13:42:05 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "Phys.org"
    ],
    "domains": [
      "news.google.com",
      "phys.org"
    ],
    "snippets": [
      "New map reveals hidden landscape under Antarctica's ice sheet Reuters",
      "Scientists have discovered there is more to Antarctica than meets the eye. A new map of the landscape beneath the frozen continent's ice sheet has revealed a previously hidden world of mountains, deep canyons and rugged hills in unprecedented detail."
    ],
    "image_url": "",
    "titles": [
      "New map reveals hidden landscape under Antarctica's ice sheet - Reuters",
      "New map reveals a rugged world beneath the Antarctic ice sheet"
    ],
    "url": "https://news.google.com/rss/articles/CBMixAFBVV95cUxOYjhZZW03RDVzWVduV21Fa2JBZFNaWXc0Vm5HQmNRcThBMkNodWVyYXpvRzJFbmluZkJVeDE0NkFOX21oOGpyekxfR0M0RFBnOTVSOW53YjYxdWNSWWlfdWZTeDVmOFh2WHctYzVuWDBaQVJQaUZnLVE2Uk1rdmV1T2JPMnU0RzBLbUhRSVI0MGZKWThfYnVWWFZWd1FYdjVPZWhiSjdaYjdKWGhFVENVNHZ6dGNNX0JpRXJsa05VaFdJTFha?oc=5",
    "alternate_urls": [
      "https://phys.org/news/2026-01-reveals-rugged-world-beneath-antarctic.html"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMixAFBVV95cUxOYjhZZW03RDVzWVduV21Fa2JBZFNaWXc0Vm5HQmNRcThBMkNodWVyYXpvRzJFbmluZkJVeDE0NkFOX21oOGpyekxfR0M0RFBnOTVSOW53YjYxdWNSWWlfdWZTeDVmOFh2WHctYzVuWDBaQVJQaUZnLVE2Uk1rdmV1T2JPMnU0RzBLbUhRSVI0MGZKWThfYnVWWFZWd1FYdjVPZWhiSjdaYjdKWGhFVENVNHZ6dGNNX0JpRXJsa05VaFdJTFha?oc=5",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.555,
      "consensus": 0.591,
      "constructiveness": 0.05,
      "proximity": 0.5
    },
    "score": 0.56,
    "constructiveness_score": 0.05,
    "constructiveness_reason": "semantic: pos_sim=0.20, neg_sim=0.00; semantic_boost=0.05; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "skipped",
    "summary_reason": "skipped_due_to_budget",
    "headline_source": "",
    "summary": "",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "NASA’s Crawler Preps for Artemis II Rollout",
    "domain": "science",
    "source_domain": "nasa.gov",
    "location": "global",
    "published": "Fri, 16 Jan 2026 14:37 GMT",
    "source": "NASA EO",
    "sources": [
      "NASA EO",
      "NASA"
    ],
    "domains": [
      "nasa.gov"
    ],
    "snippets": [
      "NASA’s crawler-transporter 2 moves toward the Vehicle Assembly Building at NASA’s Kennedy Space Center in Florida on Friday, Jan. 9, 2026. The crawler will transport NASA’s SLS (Space Launch System) rocket with the Orion spacecraft to Launch Complex 39B ahead of the Artemis II launch.",
      "NASA’s Crawler-transporter 2 moves toward the Vehicle Assembly Building at NASA’s Kennedy Space Center in Florida on Friday, Jan. 9, 2026. The crawler will transport NASA’s SLS (Space Launch System) rocket with the Orion spacecraft to Launch Complex 39B ahead of the Artemis II launch which will jour"
    ],
    "image_url": "https://www.nasa.gov/wp-content/uploads/2026/01/ksc-20260109-ph-jbs01-0009orig.jpg",
    "titles": [
      "NASA’s Crawler Preps for Artemis II Rollout"
    ],
    "url": "https://www.nasa.gov/image-detail/afs-8-101-1235/",
    "alternate_urls": [
      "https://www.nasa.gov/image-article/nasas-crawler-preps-for-artemis-ii-rollout/"
    ],
    "location_scope": "global",
    "link": "https://www.nasa.gov/image-detail/afs-8-101-1235/",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.569,
      "consensus": 0.571,
      "constructiveness": 0.017,
      "proximity": 0.5
    },
    "score": 0.557,
    "constructiveness_score": 0.017,
    "constructiveness_reason": "actions: rollout; semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "skipped",
    "summary_reason": "skipped_due_to_budget",
    "headline_source": "",
    "summary": "",
    "is_trending": false,
    "trending_score": 0.0
  }
]