[
  {
    "title": "Trump Suggests Putin Summit Could Lead to Ukraine Negotiations",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Fri, 15 Aug 2025 23:15:00 GMT",
    "source": "Axios",
    "sources": [
      "New York Times",
      "Axios",
      "Financial Times",
      "Washington Post",
      "The Guardian"
    ],
    "domains": [
      "news.google.com",
      "www.theguardian.com",
      "www.washingtonpost.com",
      "www.ft.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMid0FVX3lxTFB0cXYwRk5TMmY5VEVCdnhRNTBwYlRJRzQ5NDh3NEF4U19uTm5iSFlfUHRNUlozb0VXb3l2bXFBa0RveVcway1LSTVjQUNqZGNMak5xTk1jckFQQlMtTjdpd2hqcW9JM2k2aEEwUHJKRG5Gejhoa0c4?oc=5\" target=\"_blank\">Trump: Putin summit productive but \"we didn't get there\" on Ukraine",
      "‘We didn’t get there,’ Trump says after nearly 3-hour meeting with Putin",
      "After promising to solve the Ukraine war throughout his campaign, the US president faces a moment of truth in Alaska",
      "<p>US president’s comment that Russian and Ukrainian leaders may have to ‘divvy’ things up likely to raise alarm</p><p>Donald Trump has said he believes Vladimir Putin is ready to make a deal on the war in Ukraine as the two leaders prepare for their summit in Alaska on Friday, but his suggestion th",
      "European officials are nervous that in this one-on-one meeting, Putin will once again succeed in flattering Trump and flip the narrative away from Russia’s invasion.",
      "President Trump and President Vladimir V. Putin of Russia offered vague statements about progress after their nearly three-hour meeting. But they took no questions.",
      "The talks on Friday in Alaska pull the Russian leader out of diplomatic isolation from the West, and Ukrainian and European leaders fear it gives him an opening to sway the American president."
    ],
    "image_url": "",
    "titles": [
      "Trump: Putin summit productive but \"we didn't get there\" on Ukraine deal - Axios",
      "Trump and Putin fail to reach Ukraine peace deal but tout ‘progress’",
      "Trump the ‘dealmaker’ and the Putin summit",
      "Putin ready to make Ukraine deal, Trump says before Alaska summit",
      "How Putin, ex-KGB officer, will seek to sway Trump at Alaska summit",
      "Live Updates: Trump Says There Is ‘No Deal’ on Ukraine After Summit With Putin",
      "Russia and Ukraine Agree: A Trump Summit Is a Big Win for Putin"
    ],
    "score_components": {
      "magnitude": 0.96,
      "recency": 0.962,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.828,
    "summary": "During preparations for their summit in Alaska, President Donald Trump suggested that the meeting with Russian President Vladimir Putin could pave the way for direct negotiations with Ukraine. Trump's comment about the possibility of Russian and Ukrainian leaders having to \"divvy things up\" has sparked concerns. He expressed belief in Putin's readiness to strike a deal on the conflict in Ukraine, highlighting contrasting priorities as the leaders head into talks.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 72 tokens",
    "image": {
      "src": "icons/ukraine.svg",
      "thumbnail": "icons/ukraine.svg",
      "alt": "ukraine flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Trump Meets Putin in Anchorage, Puts Business on Hold Over Ukraine Conflict",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Fri, 15 Aug 2025 19:39:00 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Forbes",
      "ABC News",
      "CNBC",
      "CityNews",
      "Al Jazeera"
    ],
    "domains": [
      "abcnews.go.com",
      "www.aljazeera.com",
      "www.forbes.com",
      "www.cnbc.com",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "US President Donald Trump and Russian President Vladimir Putin greeted each other today in Anchorage, Alaska.",
      "President Trump and Russian President Putin arrived in Alaska for their high-stakes summit about the war in Ukraine.",
      "ABC News’ Chief Global Affairs Correspondent Martha Raddatz says the imagery surrounding the summit is “devastating” to watch for Ukrainians.",
      "“That was a very friendly welcome,” ABC News' Chief White House correspondent Mary Bruce tells David Muir.",
      "\"Trump wants to exhaust all options to have a peaceful end to war,\" the White House said in advance of his meeting with Vladimir Putin.",
      "The two are expected to hold a joint press conference following the meeting.",
      "The West has long sought to make Vladimir Putin a pariah over the bloodshed in Ukraine. But on Friday, the Russian leader will break out of international isolation and step foot on U.S. soil, welcomed by an American president eager to fulfill his promise of stopping the war. European leaders who hel"
    ],
    "image_url": "",
    "titles": [
      "Trump greets Putin in Alaska for Russia-Ukraine talks",
      "WATCH:  President Trump and Russian President Putin arrive in Alaska",
      "WATCH:  President Trump and Russian President Putin meet in Alaska",
      "WATCH:  President Trump and Vladimir Putin greet each other at Alaska summit",
      "Trump meets Putin in Alaska for summit on Ukraine war",
      "Trump Meets Putin In Alaska (Live Updates)",
      "What’s at stake as Trump and Putin meet in Alaska?"
    ],
    "score_components": {
      "magnitude": 0.96,
      "recency": 0.911,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.818,
    "summary": "President Donald Trump met with Russian President Vladimir Putin in Anchorage to discuss the situation in Ukraine. Trump expressed a willingness to engage in business discussions with Putin but emphasized that no deals would be made until the conflict in Ukraine is resolved. The White House indicated that while major agreements were unlikely at this meeting, Trump aimed to explore all options for a peaceful end to the war. This meeting marked a significant moment as Putin, who has been widely criticized by the West for his role in the Ukraine conflict, was welcomed in the U.S. by Trump, highli",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 101 tokens",
    "image": {
      "src": "icons/ukraine.svg",
      "thumbnail": "icons/ukraine.svg",
      "alt": "ukraine flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Trump, Putin Hold Summit in Alaska on Ukraine, European Security",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 15 Aug 2025 21:13:00 GMT",
    "source": "BBC",
    "sources": [
      "Al Jazeera",
      "Global News",
      "New York Times",
      "BBC"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.nytimes.com",
      "www.bbc.com",
      "globalnews.ca"
    ],
    "snippets": [
      "The two leaders are meeting in Anchorage to discuss how to end of the war in Ukraine.",
      "Trump and Putin will meet one-on-one Friday at a historic summit in Alaska. What’s on the table?",
      "Putin will hope to appeal to Trump’s business instincts by discussing economic ties alongside the future of Ukraine.",
      "The delegations include top diplomatic, military and economic officials, a sign that the U.S. and Russia will discuss more than the war in Ukraine.",
      "Many say Saskatchewan is a province whose roots run deep with Ukrainian heritage, with Saskatchewan residents banning together to make impactful change across the sea."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/427c/live/cbb44f70-7a1c-11f0-ab3e-bd52082cd0ae.jpg",
    "titles": [
      "Why Alaska? Why now? What to know about the Trump-Putin meeting",
      "Why is Trump meeting Putin in Alaska?",
      "Can Putin sway Trump with economic offers in Alaska?",
      "Who’s Attending the Trump-Putin Meeting in Alaska",
      "Saskatchewan reacts to the Trump-Putin meeting in Alaska"
    ],
    "score_components": {
      "magnitude": 0.96,
      "recency": 0.922,
      "consensus": 0.985,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.817,
    "summary": "U.S. President Donald Trump is meeting with Russian President Vladimir Putin in Alaska for a summit aimed at addressing the war in Ukraine and European security. The meeting, involving top diplomatic, military, and economic officials from both nations, indicates a broad discussion agenda beyond the conflict. The outcome could significantly influence the direction of the Ukraine war and the overall security landscape in Europe.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 65 tokens",
    "image": {
      "src": "icons/ukraine.svg",
      "thumbnail": "icons/ukraine.svg",
      "alt": "ukraine flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Liverpool Wins 4-2 Against Bournemouth Amid Tributes and Racial Abuse Report",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 15 Aug 2025 21:35:19 GMT",
    "source": "BBC",
    "sources": [
      "Al Jazeera",
      "ESPN",
      "Sportsnet",
      "BBC"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.sportsnet.ca",
      "www.espn.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Liverpool begin their Premier League title defence with a win but needed late goals to beat Bournemouth on a night dedicated to former player Diogo Jota.",
      "Bournemouth fight back from two down but Liverpool secure late win on emotional Anfield night.",
      "Liverpool launched the Premier League with a dramatic 4-2 win over Bournemouth at Anfield on Friday in an emotionally charged match.",
      "In Liverpool's first Premier League match since Diogo Jota's tragic death, late goals from Federico Chiesa and Mohamed Salah sealed victory in an opening match to remember.",
      "<p>Defending champion Liverpool launched the Premier League with a dramatic 4-2 win over Bournemouth at Anfield on Friday in an emotionally charged match featuring tributes to Diogo Jota and a player reporting racial abuse.</p>"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/00b5/live/30b4d3d0-7a1e-11f0-83cc-c5da98c419b8.jpg",
    "titles": [
      "Liverpool leave it late to beat Bournemouth in six-goal thriller",
      "Liverpool avoid late Bournemouth scare to win Premier League opener",
      "Liverpool strike late to win emotional PL opener",
      "On an emotional night, Liverpool summon inner strength for dramatic win in Premier League opener",
      "Late goals, Jota tributes, racism claim as Liverpool wins Premier League opener"
    ],
    "score_components": {
      "magnitude": 0.92,
      "recency": 0.929,
      "consensus": 0.985,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.804,
    "summary": "Liverpool began their Premier League title defence with a 4-2 victory over Bournemouth at Anfield, in a match marked by tributes to former player Diogo Jota. The game, which was emotionally charged, saw Liverpool secure the win with late goals from Federico Chiesa and Mohamed Salah. The night was also notable for an incident of a player reporting racial abuse.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 61 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "DEA Head to Lead D.C. Police, Sparks Legal Challenge from City Leaders",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 15 Aug 2025 16:54:21 GMT",
    "source": "BBC",
    "sources": [
      "Axios",
      "Deutsche Welle",
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.dw.com",
      "www.theguardian.com",
      "news.google.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The city has asked a judge to block Attorney General Bondi's order that put in place an \"emergency police commissioner\".",
      "The nation's capital has been challenging the president's move to seize control of its police force. City leaders have called it the gravest threat to autonomy from federal power in decades.",
      "<a href=\"https://news.google.com/rss/articles/CBMiigFBVV95cUxPWXFfakpTSDRzNUNIT0R3MkZhWXRDSVNETlJlNV80VVR2eGxnRlBiZzFNUTdORDhLLWQtNjRyV0Fqc0xCVTJsUXBIVDZJT0dlMHFFLTdPRTQ3UlhWcmpBV3Z6WWZacnNFTFhwLXJsQTNYTkJCWVBzWUt2SFlGOFh6MlBnY0hYTnhwT2c?oc=5\" target=\"_blank\">D.C. attorney general sues to stop Trump",
      "<p>US capital city’s law enforcement will remain under control of its chief, Pamela Smith</p><p>White House officials and attorneys for Washington DC have agreed to scale back the Trump administration’s takeover of the city’s police department.</p><p>Under an agreement announced early Friday evening"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/5056/live/0eefa990-79e3-11f0-9cfe-35292c1863f3.jpg",
    "titles": [
      "Washington DC sues federal government over police takeover",
      "Washington legal chief sues Trump over police takeover",
      "D.C. attorney general sues to stop Trump's police takeover - Axios",
      "Washington DC and White House agree to scale back Trump ‘takeover’ of city police"
    ],
    "score_components": {
      "magnitude": 0.9,
      "recency": 0.843,
      "consensus": 0.985,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.78,
    "summary": "The DEA head, Terry Cole, has been appointed to assume control over the Metropolitan Police Department in Washington D.C., as stated by Pam Bondi. This move comes amidst a crackdown on crime by the White House. The city's leaders, viewing this as a significant threat to their autonomy, are challenging the president's decision. The D.C. attorney general has filed a lawsuit against this action, seeking an emergency restraining order to prevent the transfer of power.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 79 tokens",
    "image": {
      "src": "icons/newspaper.svg",
      "thumbnail": "icons/newspaper.svg",
      "alt": "general",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "UFC 319: Experts Predict du Plessis vs. Chimaev, Betting Advice Available",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Fri, 15 Aug 2025 17:56:12 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Forbes",
      "CBS Sports"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com",
      "www.forbes.com"
    ],
    "snippets": [
      "Former UFC fighters and analysts give predictions for UFC 319 main event. Ian Parker provides betting advice.",
      "This weekend offers plenty of options to place a wager or two with UFC in Chicago",
      "Get the latest UFC 319 fight card odds, prop bets, expert picks, and predictions for Dricus du Plessis Vs. Khamzat Chimaev and the full UFC 319 PPV card."
    ],
    "image_url": "",
    "titles": [
      "Expert picks, best bets for UFC 319",
      "UFC 319 predictions, odds, best bets: Dricus du Plessis, Aaron Pico among top picks to consider",
      "UFC 319 Fight Card: Odds, Lines, Prop Bets, Predictions And Picks"
    ],
    "score_components": {
      "magnitude": 0.82,
      "recency": 0.956,
      "consensus": 0.897,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.777,
    "summary": "Former UFC fighters and analysts have shared their predictions for the UFC 319 main event, focusing on the matchup between Dricus du Plessis and Khamzat Chimaev. Ian Parker has offered betting advice for the event. The latest odds, prop bets, expert picks, and predictions for UFC 319, which is set to take place in Chicago, are now available for enthusiasts looking to place wagers on the fights.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 67 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Cloudburst in Pakistan and India Causes Flash Floods, 185 Dead",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 15 Aug 2025 15:04:55 GMT",
    "source": "BBC",
    "sources": [
      "Al Jazeera",
      "The Guardian",
      "New York Times",
      "BBC"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.theguardian.com",
      "www.nytimes.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The majority of deaths were recorded in Pakistan's mountainous Khyber Pakhtunkhwa area.",
      "Disaster agency says the majority of deaths happened in Khyber Pakhtunkhwa in northwest Pakistan.",
      "<p>Search for the missing continues in north-west after downpour also sparks deadly flooding and landslides in India</p><p>A massive cloudburst has triggered flash floods in north-west Pakistan, killing at least 157 people, as rescuers continued to search for people missing after floods in neighbour",
      "The country has endured heavier rain during monsoon seasons, which scientists have attributed to climate change. The authorities said that at least 194 people died on Friday."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/d6ee/live/931139e0-79d5-11f0-bad9-e7f03dd8181e.jpg",
    "titles": [
      "Flash floods kill nearly 200 in Pakistan and Pakistan-administered Kashmir",
      "Nearly 200 people killed in Pakistan in heavy rains, flash floods",
      "Flash floods kill at least 159 people in Pakistan after huge cloudburst",
      "Flash Floods in Pakistan Kill at Least 150 People in a Single Day"
    ],
    "score_components": {
      "magnitude": 0.9,
      "recency": 0.811,
      "consensus": 0.985,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.773,
    "summary": "A massive cloudburst in north-west Pakistan has resulted in flash floods, killing at least 157 people, with the majority of fatalities occurring in the Khyber Pakhtunkhwa area. The incident also caused deadly flooding and landslides in neighboring India. Rescue operations are ongoing for those still missing. The region has experienced heavier monsoon rains, which scientists link to climate change. The total death toll reported by authorities on Friday reached at least 185.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 73 tokens",
    "image": {
      "src": "icons/india.svg",
      "thumbnail": "icons/india.svg",
      "alt": "india flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Michigan to Challenge NCAA Sanctions Over Sign-Stealing Scandal",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Fri, 15 Aug 2025 20:32:57 +0000",
    "source": "CBS Sports",
    "sources": [
      "Yahoo Sports",
      "Sportsnet",
      "CBS Sports"
    ],
    "domains": [
      "sports.yahoo.com",
      "www.sportsnet.ca",
      "www.cbssports.com"
    ],
    "snippets": [
      "Michigan will challenge the NCAA sanctions, claiming the decision 'makes fundamental errors in interpreting NCAA bylaws'",
      "The Wolverines fired Partridge in 2023 in the wake of the Connor Stalions scandal.",
      "<p>The NCAA fined Michigan tens of millions of dollars Friday and suspended coach Sherrone Moore for a third game as punishment for a sprawling sign-stealing scandal that has loomed over college football’s winningest program for nearly two years, including its national championship season in 2023.</"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/08/15/c9dd50d6-54d1-4b91-b7e8-9fbc705e702a/manuel.jpg",
    "titles": [
      "Michigan announces appeal of NCAA's punishment in sign-stealing scandal",
      "Fired Michigan assistant Chris Partridge takes victory lap after NCAA clears him in sign-stealing scandal",
      "Michigan football fined millions, coach suspended three games in sign-stealing scandal"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.928,
      "consensus": 0.897,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.74,
    "summary": "Michigan plans to contest NCAA sanctions, arguing mistakes in the interpretation of bylaws. The penalties, including a multi-million dollar fine and the suspension of coach Sherrone Moore for a third game, come in response to a sign-stealing scandal that overshadowed the program, including during its 2023 national championship season. The scandal also led to the firing of Partridge in connection with the Connor Stalions incident.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 67 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Trump, Putin Meet in Alaska; US Shows Military Might as Zelenskyy Critiques Russ",
    "domain": "general",
    "source_domain": "www.bbc.co.uk",
    "location": "global",
    "published": "Fri, 15 Aug 2025 14:54:00 GMT",
    "source": "BBC",
    "sources": [
      "Al Jazeera",
      "Axios",
      "BBC"
    ],
    "domains": [
      "www.aljazeera.com",
      "news.google.com",
      "www.bbc.co.uk"
    ],
    "snippets": [
      "Trump and Putin head to Alaska for talks.",
      "Zelenskyy decries Russia’s attempt to gain battlefield edge pre-US summit maintains its army is holding back &#039;occupier&#039;.",
      "<a href=\"https://news.google.com/rss/articles/CBMiakFVX3lxTE1JM2h0a3IwNkhpQ3ozOGZ6MXk0RzJzSC13NUFOaHpRcmdRZGttekY3T0lkd25UX1pxWk1YRUYxaHo0OHhPY3kxeURNSjFTeU1NWmh0Q09HcWhMejdkRjEzSllpLU9Rbng3WEE?oc=5\" target=\"_blank\">At Trump-Putin summit, a flex of F-22 and B-2 warplanes</a>&nbsp;&nbsp;<font color=\""
    ],
    "image_url": "https://ichef.bbci.co.uk/images/ic/240x135/p0l7jnbt.jpg",
    "titles": [
      "The Trump-Putin summit: Tactics and trolling?",
      "Russia gains in east before Trump-Putin summit, Ukraine says holding off",
      "At Trump-Putin summit, a flex of F-22 and B-2 warplanes - Axios"
    ],
    "score_components": {
      "magnitude": 0.82,
      "recency": 0.808,
      "consensus": 0.897,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.723,
    "summary": "Trump and Putin have traveled to Alaska for discussions. Concurrently, Zelenskyy criticized Russia's efforts to gain an advantage on the battlefield ahead of the US summit, asserting that Ukraine's military is successfully resisting the occupier. Amidst these diplomatic activities, the US showcased its military strength by deploying F-22 and B-2 warplanes during the Trump-Putin summit. This series of events highlights ongoing international tensions and the complex dynamics of US-Russia-Ukraine relations.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 77 tokens",
    "image": {
      "src": "icons/usa.svg",
      "thumbnail": "icons/usa.svg",
      "alt": "us flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Global Plastic Pollution Treaty Talks End Without Agreement",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-08-15T06:46:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "New York Times",
      "Deutsche Welle",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.nytimes.com",
      "www.dw.com"
    ],
    "snippets": [
      "Negotiations aimed at tacking plastic pollution have concluded without an agreement. Countries differed on how ambitious the treaty should be and whether to focus on cutting plastic production or waste management.",
      "Countries failed to bridge wide gaps on whether the world should limit plastic manufacturing and restrict the use of harmful plastic chemicals.",
      "<p>NGOs say deadlock over legally binding deal to curb production and toxic chemicals is ‘blow to multilateralism’</p><p>Global talks to reach agreement on a treaty aimed at ending the growing scourge of plastic pollution have collapsed, with no deal agreed and no clear path forward.</p><p>Countries"
    ],
    "image_url": "",
    "titles": [
      "UN talks on plastic pollution fail to reach deal",
      "United Nations Plastic Treaty Talks End Without Deal",
      "Plastic pollution talks fail as negotiators in Geneva reject draft treaties"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.697,
      "consensus": 0.897,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.694,
    "summary": "Negotiations to create a global treaty on plastic pollution ended without an agreement. Countries could not agree on the treaty's ambition level, whether to focus on reducing plastic production or improving waste management, and if it should include legally binding measures to curb production and address toxic chemicals. The talks aimed at addressing the increasing issue of plastic pollution concluded with no consensus reached.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 65 tokens",
    "image": {
      "src": "icons/newspaper.svg",
      "thumbnail": "icons/newspaper.svg",
      "alt": "general",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "MacIntyre Leads BMW Championship by 5, Largest Since 2015",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Fri, 15 Aug 2025 19:51:07 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sky Sports"
    ],
    "domains": [
      "www.skysports.com",
      "www.espn.com"
    ],
    "snippets": [
      "Robert MacIntyre shot a 6-under 64 on Friday for a five-shot lead over Scottie Scheffler going into the weekend at the BMW Championship. It was the largest 36-hole lead at the tournament since Jason Day led by five shots in 2015.",
      "Scotland's Robert MacIntyre continued his superb start to the BMW Championship to move five shots clear of Scottie Scheffler at the halfway point of the FedExCup Playoffs event."
    ],
    "image_url": "",
    "titles": [
      "MacIntyre builds 5-shot BMW lead over Scheffler",
      "MacIntyre extends lead over Scheffler to five shots at BMW Championship"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.994,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.689,
    "summary": "Robert MacIntyre leads the BMW Championship by five shots over Scottie Scheffler after shooting a 6-under 64 on Friday. This marks the largest 36-hole lead at the tournament since 2015, when Jason Day was ahead by five shots. MacIntyre's performance positions him strongly at the halfway point of the FedExCup Playoffs event.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 55 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Trump, Putin End Talks Without Ukraine Deal, Remain Optimistic",
    "domain": "business",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Fri, 15 Aug 2025 23:52:40 GMT",
    "source": "The Guardian",
    "sources": [
      "Fortune",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "fortune.com"
    ],
    "snippets": [
      "<p>Pair decline to take questions in short press conference as US president says ‘we didn’t get there … but we have a good chance of getting there’</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/2025/aug/15/trump-putin-alaska-meeting-ukraine\">No deal after brief Trump-Putin talks on Ukra",
      "\"We had an extremely productive meeting, and many points were agreed to and there are just a very few that are left.\""
    ],
    "image_url": "https://i.guim.co.uk/img/media/b09fa74b72cfaa077cd0bc2d634de7bc39005fb2/814_0_4962_3971/master/4962.jpg?width=140&quality=85&auto=format&fit=max&s=475a890af5d418da593cda5fac3c168a",
    "titles": [
      "Trump says ‘no deal until there’s a deal’ on Ukraine war after talks with Putin – live",
      "Trump says ‘we didn’t get there’ but touts progress as meeting with Putin ends without a deal to stop Ukraine war"
    ],
    "score_components": {
      "magnitude": 0.76,
      "recency": 0.974,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.681,
    "summary": "During a brief press conference, US President Trump and Russian President Putin did not take questions and did not reach a deal regarding Ukraine. Trump stated, \"we didn’t get there … but we have a good chance of getting there,\" indicating optimism despite the lack of a finalized agreement. He described the meeting as \"extremely productive,\" noting that while many points were agreed upon, a few remain unresolved.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 68 tokens",
    "image": {
      "src": "icons/ukraine.svg",
      "thumbnail": "icons/ukraine.svg",
      "alt": "ukraine flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "US-Russia Alaska Meeting May Shift Ukraine War Dynamics, Excludes Allies",
    "domain": "business",
    "source_domain": "www.ft.com",
    "location": "global",
    "published": "Fri, 15 Aug 2025 22:14:24 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times",
      "The Guardian"
    ],
    "domains": [
      "www.ft.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "US president’s warm Alaska greeting brings Russian leader in from the cold",
      "<p>Discussions could reshape war in Ukraine and US-Moscow relations – without Zelenskyy or European leaders</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/aug/15/trump-putin-alaska-meeting-summit-news-updates\"><strong>Trump-Putin summit – live updates</strong></a></p></li></ul><p"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F88f2108b-31c7-439a-b5c6-6c7dded3b2f0.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Trump rolls out red carpet for Putin as Ukrainians watch from afar",
      "Trump rolls out red carpet for Putin in Alaska – as Ukraine hopes he won’t roll over"
    ],
    "score_components": {
      "magnitude": 0.74,
      "recency": 0.942,
      "consensus": 0.682,
      "constructiveness": 0.059,
      "proximity": 0.5
    },
    "score": 0.674,
    "summary": "The US President's welcoming approach to the Russian leader during a meeting in Alaska has the potential to significantly alter the dynamics of the war in Ukraine and the relationship between the US and Moscow. Notably, Ukrainian President Zelenskyy and European leaders were not involved in these discussions. This development suggests a pivotal moment in international relations, focusing on the direct dialogue between the US and Russia.",
    "constructiveness_score": 0.059,
    "constructiveness_reason": "1 constructive keywords out of 68 tokens",
    "image": {
      "src": "icons/usa.svg",
      "thumbnail": "icons/usa.svg",
      "alt": "us flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Du Plessis vs. Chimaev at UFC 319: Hailed as Year's Top Fight",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Fri, 15 Aug 2025 23:00:44 +0000",
    "source": "CBS Sports",
    "sources": [
      "Sportsnet",
      "CBS Sports"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.cbssports.com"
    ],
    "snippets": [
      "Du Plessis vs. Chimaev is one of the best fights MMA can produce this year",
      "The middleweight title is on the line on Saturday in one of the best matchups of the year",
      "<p>Sportsnet&#8217;s Aaron Bronsteter and Diana Belbita discuss the fiery exchange between Dricus Du Plessis and Khamzat Chimaev at the weigh-ins for UFC 319 in Chicago along with other big developments to follow leading up to the event.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/07/22/7c920111-8520-4e4a-97bd-c7f77c612304/khamzat-chimaev-head.jpg",
    "titles": [
      "UFC 319 -- Dricus du Plessis vs. Khamzat Chimaev: Fight card, date, odds, rumors, start time, complete guide",
      "UFC 319 fight card -- Dricus du Plessis vs. Khamzat Chimaev: Five biggest storylines to watch in Chicago",
      "Breaking down the biggest storylines ahead of UFC 319"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.977,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.668,
    "summary": "The middleweight title fight between Dricus Du Plessis and Khamzat Chimaev at UFC 319 in Chicago is highlighted as one of the year's best matchups. Sports analysts Aaron Bronsteter and Diana Belbita have discussed the intense altercation between the two fighters during the weigh-ins, emphasizing the high stakes and anticipation surrounding this event.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 55 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Attack on Cargo Ship and Ukraine Strikes Ahead of Trump-Putin Summit",
    "domain": "business",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Fri, 15 Aug 2025 14:55:15 GMT",
    "source": "The Guardian",
    "sources": [
      "Business Insider",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.businessinsider.com"
    ],
    "snippets": [
      "<p>Attack on cargo vessel more than 500 miles from frontline is show of force before Trump-Putin meeting</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/aug/15/trump-putin-alaska-meeting-summit-news-updates\"><strong>Trump-Putin summit – live updates</strong></a></p></li></ul><p>Uk",
      "Ukrainian forces have used domestically produced drones and missiles to attack Russia's critical military and energy facilities."
    ],
    "image_url": "https://i.guim.co.uk/img/media/8ec3a9cddccb30a038baa441d0ae9006b82bfdd6/268_0_3158_2526/master/3158.jpg?width=140&quality=85&auto=format&fit=max&s=5f82c59a42e7111585fcd8088c274d04",
    "titles": [
      "Ukraine says it has bombed Russian ship carrying drone parts at Caspian port",
      "Ukraine says its forces bombed a Russian ship carrying Iranian ammo as it ramps up deep-strike operations"
    ],
    "score_components": {
      "magnitude": 0.78,
      "recency": 0.809,
      "consensus": 0.682,
      "constructiveness": 0.056,
      "proximity": 0.5
    },
    "score": 0.661,
    "summary": "An attack on a cargo vessel over 500 miles from the frontline occurred as a show of force ahead of a meeting between Trump and Putin. Concurrently, Ukrainian forces targeted Russia's critical military and energy facilities using domestically produced drones and missiles. This development comes amidst heightened tensions between the involved countries and is reported in the context of the Trump-Putin summit, with live updates available through provided news links.",
    "constructiveness_score": 0.056,
    "constructiveness_reason": "1 constructive keywords out of 72 tokens",
    "image": {
      "src": "icons/ukraine.svg",
      "thumbnail": "icons/ukraine.svg",
      "alt": "ukraine flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Astros' Josh Hader Sidelined with Shoulder Strain, Eyes Playoff Return",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Fri, 15 Aug 2025 20:27:45 +0000",
    "source": "CBS Sports",
    "sources": [
      "Sportsnet",
      "CBS Sports"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.cbssports.com"
    ],
    "snippets": [
      "Houston hopes to have its 31-year-old LHP back before the playoffs",
      "<p> Houston Astros All-Star closer Josh Hader will be shut down from throwing for approximately three weeks after the team announced Friday he has been diagnosed with left shoulder capsule strain.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/08/15/da61de4b-4925-420f-832b-6dc4f5f3f6c0/josh-hader-astros-g.jpg",
    "titles": [
      "Josh Hader injury: Astros closer diagnosed with shoulder capsule strain, won't throw for three weeks",
      "Astros all-star closer Josh Hader shut down for three weeks"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.927,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.658,
    "summary": "The Houston Astros announced that their All-Star closer, 31-year-old left-handed pitcher Josh Hader, has been diagnosed with a left shoulder capsule strain. As a result, Hader will be shut down from throwing for about three weeks. The team hopes to have him back in action before the playoffs.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 52 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Jacob Bethell Set to Be Youngest England Men's T20 Captain",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 15 Aug 2025 21:19:56 GMT",
    "source": "BBC",
    "sources": [
      "Sky Sports",
      "BBC"
    ],
    "domains": [
      "www.skysports.com",
      "www.bbc.com"
    ],
    "snippets": [
      "All-rounder Jacob Bethell, 21, is set to become the youngest man to captain England in an international when he leads an understrength T20 side on a tour of Ireland.",
      "Jacob Bethell is set to become the youngest England men's captain for an international match, named as skipper for their T20 series in Ireland in September."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/b969/live/c6fbb8f0-79e6-11f0-ab39-5f560085c471.jpg",
    "titles": [
      "Bethell to become England's youngest men's captain",
      "'Proud' Bethell named youngest England captain for T20 series vs Ireland"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.924,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.657,
    "summary": "Jacob Bethell, 21, is poised to make history as the youngest man to captain England's men's cricket team during their T20 series in Ireland. This appointment comes as he leads an understrength side on tour in September, marking a significant milestone in his career and England cricket history.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 50 tokens",
    "image": {
      "src": "icons/uk.svg",
      "thumbnail": "icons/uk.svg",
      "alt": "england flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "New Orleans Mayor LaToya Cantrell Indicted on Corruption Charges",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Fri, 15 Aug 2025 21:27:13 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "The Guardian"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "LaToya Cantrell is accused of ‘defrauding’ city, paying Jeffrey Vappie as if he were on duty while on trips and trysts.",
      "<p>Grand jury charges LaToya Cantrell with using city property and resources for purported affair</p><p>The <a href=\"https://www.theguardian.com/us-news/new-orleans\">New Orleans</a> mayor, LaToya Cantrell, was indicted by a federal grand jury Friday on corruption charges involving a purported romanc"
    ],
    "image_url": "",
    "titles": [
      "New Orleans mayor indicted on fraud charges linked to affair with bodyguard",
      "New Orleans mayor indicted for corruption over alleged bodyguard romance"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.946,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.655,
    "summary": "LaToya Cantrell, the Mayor of New Orleans, has been indicted by a federal grand jury on corruption charges. She is accused of defrauding the city by misusing city property and resources, including paying Jeffrey Vappie as though he were on duty during their trips and alleged romantic encounters. This indictment marks a significant legal challenge for Cantrell, focusing on the misuse of city assets for personal benefit.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 67 tokens",
    "image": {
      "src": "icons/newspaper.svg",
      "thumbnail": "icons/newspaper.svg",
      "alt": "general",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Hull KR Defeats Wigan 10-6, Nears Top Spot in Betfred Super League",
    "domain": "sports",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Fri, 15 Aug 2025 21:15:13 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "Sky Sports"
    ],
    "domains": [
      "www.theguardian.com",
      "www.skysports.com"
    ],
    "snippets": [
      "<ul><li><p>Wigan 6-10 Hull KR</p></li><li><p>Hadley try and three Martin goals enough for victory</p></li></ul><p>Hull KR underlined their position as Super League’s new dominant force with a statement victory at the home of the reigning champions and took a giant step towards completing the second ",
      "Hull KR clung on for a dramatic 10-6 win at defending champions Wigan that all but confirmed top spot in this year's Betfred Super League after a blockbuster clash at the Brick Community Stadium."
    ],
    "image_url": "https://i.guim.co.uk/img/media/ec11f70a3b764e23755e5046a517bd35bf6a06d3/336_0_1468_1174/master/1468.jpg?width=140&quality=85&auto=format&fit=max&s=732ed467f0e85683f0222d672eb74a58",
    "titles": [
      "Dominant Hull KR see off Wigan to go six points clear at top of Super League",
      "Hull KR hold off Wigan in dramatic finale to move six points clear"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.923,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.65,
    "summary": "Hull KR secured a significant victory in the Betfred Super League, defeating defending champions Wigan 10-6 at the Brick Community Stadium. The win was highlighted by a try from Hadley and three goals by Martin, marking Hull KR as the new dominant force in the league and nearly guaranteeing them the top spot for the year. This dramatic win underscores Hull KR's strong performance throughout the season.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 69 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Arteta Predicts Toughest Premier League Season for Arsenal",
    "domain": "business",
    "source_domain": "www.forbes.com",
    "location": "global",
    "published": "Fri, 15 Aug 2025 16:18:17 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes",
      "Sky Sports"
    ],
    "domains": [
      "www.skysports.com",
      "www.forbes.com"
    ],
    "snippets": [
      "Is this finally Arsenal's season to end its long wait to win the Premier League title after three seasons of finishing second?",
      "Arsenal manager Mikel Arteta believes the Premier League competition is \"like nothing we've seen before\" as he prepares his Gunners team for the \"most difficult\" title race he's seen."
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/689f95ad71b4b1767feccdab/0x0.jpg?width=960",
    "titles": [
      "Is Arsenal The Frontrunner To Win The Premier League This Season?",
      "Arteta: This is the most difficult Premier League season yet"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.924,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.65,
    "summary": "Arsenal manager Mikel Arteta sees the upcoming Premier League season as the toughest title race yet, describing the competition as unprecedented. He believes this season will be the most challenging for Arsenal. The team aims to end its long wait for a Premier League title.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 45 tokens",
    "image": {
      "src": "icons/briefcase.svg",
      "thumbnail": "icons/briefcase.svg",
      "alt": "business",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Sen. Hawley Launches Investigation into Meta, Urges Document Preservation",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Fri, 15 Aug 2025 18:23:51 GMT",
    "source": "CNBC",
    "sources": [
      "TechCrunch",
      "CNBC"
    ],
    "domains": [
      "techcrunch.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "Sen. Josh Hawley called on Meta CEO Mark Zuckerberg to preserve relevant materials, including emails.",
      "“Is there anything - ANYTHING - Big Tech won’t do for a quick buck?” Hawley wrote in a post on X announcing the investigation."
    ],
    "image_url": "",
    "titles": [
      "Sen. Hawley to probe Meta AI bot policies for children following damning report",
      "Sen. Hawley to probe Meta after report finds its AI chatbots flirt with kids"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.869,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.639,
    "summary": "Sen. Josh Hawley has initiated an investigation into Meta, requesting CEO Mark Zuckerberg to retain all pertinent documents, such as emails. Hawley's inquiry was announced via a post on X, where he questioned the extent of Big Tech's actions for financial gain.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 44 tokens",
    "image": {
      "src": "icons/briefcase.svg",
      "thumbnail": "icons/briefcase.svg",
      "alt": "business",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Companies Rated on Support for Trump's Agenda",
    "domain": "business",
    "source_domain": "www.forbes.com",
    "location": "global",
    "published": "Fri, 15 Aug 2025 18:26:06 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes"
    ],
    "domains": [
      "www.forbes.com"
    ],
    "snippets": [
      "Factors in the rating system, which revolves around companies’ efforts to support Trump’s “Big Beautiful Bill,” reportedly includes attendance at White House events, social media posts and advertisements."
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/689fb317dfdb49646a40dff4/0x0.jpg?width=960&precrop=6000%2C4000%2Cx0%2Cy0",
    "titles": [
      "White House Creates Loyalty Rating System For 553 U.S. Companies—Here’s What Trump Has Said In The Past"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.965,
      "consensus": 0.393,
      "constructiveness": 0.111,
      "proximity": 0.5
    },
    "score": 0.499,
    "summary": "Companies' ratings are influenced by their support for Trump's legislative agenda. Factors like attending White House events, social media activity, and ads are considered. The system aims to gauge alignment with the \"Big Beautiful Bill.\"",
    "constructiveness_score": 0.111,
    "constructiveness_reason": "1 constructive keywords out of 36 tokens",
    "image": {
      "src": "icons/briefcase.svg",
      "thumbnail": "icons/briefcase.svg",
      "alt": "business",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Trump-Putin Summit Focuses on Ukraine Crisis, Outcome Uncertain",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Fri, 15 Aug 2025 20:55:11 GMT",
    "source": "Bloomberg",
    "sources": [
      "Bloomberg"
    ],
    "domains": [
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMihgFBVV95cUxNaWF6R1JKMmhRSHpLYllrY3hzeE1kdHlHVlJMRE9vaTVzT2dDODBvaks4OHExVFFWVS1WTDhzbjg3MmI3ZHZabDU0c2t3Z0xXMW1IMkcyWXpNUGJ3RlA3N20xOENZcFQ0eTN3NlpFNEdTVTFsQklaNTlndjBYWTdKMEVvdFRvZw?oc=5\" target=\"_blank\">Trump-Putin Summit Live News: Latest on War i"
    ],
    "image_url": "",
    "titles": [
      "Trump-Putin Summit Live News: Latest on War in Ukraine at Alaska Meeting - Bloomberg.com"
    ],
    "score_components": {
      "magnitude": 0.46,
      "recency": 0.916,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.492,
    "summary": "The latest news on the Trump-Putin summit reports on the ongoing conflict in Ukraine. The situation remains tense as both leaders discuss the crisis. The outcome of the summit and any potential agreements are still uncertain. The focus is on addressing the conflict and finding a resolution.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 48 tokens",
    "image": {
      "src": "icons/ukraine.svg",
      "thumbnail": "icons/ukraine.svg",
      "alt": "ukraine flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "NASA Develops Affordable Alloys for 3D Printing Space Engine Parts",
    "domain": "science",
    "source_domain": "www.nasa.gov",
    "location": "global",
    "published": "Fri, 15 Aug 2025 20:13:43 +0000",
    "source": "NASA",
    "sources": [
      "NASA"
    ],
    "domains": [
      "www.nasa.gov"
    ],
    "snippets": [
      "Until now, additive manufacturing, commonly known as 3D printing, of engine components was limited by the lack of affordable metal alloys that could withstand the extreme temperatures of spaceflight. Expensive metal alloys were the only option for 3D printing engine parts until NASA’s Glenn Research"
    ],
    "image_url": "",
    "titles": [
      "NASA-Developed Printable Metal Can Take the Heat"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.922,
      "consensus": 0.393,
      "constructiveness": 0.151,
      "proximity": 0.5
    },
    "score": 0.488,
    "summary": "NASA's Glenn Research Center has developed affordable metal alloys suitable for 3D printing engine components that can withstand the extreme temperatures of spaceflight. This innovation overcomes the previous limitation of having to use expensive metal alloys for such parts, potentially reducing costs and expanding the capabilities of additive manufacturing in aerospace applications.",
    "constructiveness_score": 0.151,
    "constructiveness_reason": "2 constructive keywords out of 53 tokens",
    "image": {
      "src": "icons/telescope.svg",
      "thumbnail": "icons/telescope.svg",
      "alt": "nasa",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Laura Loomer and the limits of posting everything",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-08-15T19:36:49-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "www.theverge.com"
    ],
    "snippets": [
      "For all the power she wields with the White House's affairs, Laura Loomer does not have the traditional tools that her rivals in the MAGA influencer industrial complex have - the highest follower count, the most political power, the most internet platforms, etc. But the fact remains that she's the i"
    ],
    "image_url": "",
    "titles": [
      "Laura Loomer and the limits of posting everything"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.989,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.486,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 8 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Sam Altman, over bread rolls, explores life after GPT-5",
    "domain": "technology",
    "source_domain": "techcrunch.com",
    "location": "global",
    "published": "Fri, 15 Aug 2025 22:20:59 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com"
    ],
    "snippets": [
      "At a dinner with reporters in San Francisco, OpenAI CEO Sam Altman spilled details on the company's ambitions beyond ChatGPT."
    ],
    "image_url": "",
    "titles": [
      "Sam Altman, over bread rolls, explores life after GPT-5"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.964,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.481,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 10 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Carrier Urged to Settle Negotiations for Labor Peace",
    "domain": "business",
    "source_domain": "financialpost.com",
    "location": "national",
    "published": "Fri, 15 Aug 2025 22:07:09 +0000",
    "source": "Financial Post",
    "sources": [
      "Financial Post"
    ],
    "domains": [
      "financialpost.com"
    ],
    "snippets": [
      "Says carrier should settle to 'secure labour peace'"
    ],
    "image_url": "",
    "titles": [
      "Air Canada risks ‘pyrrhic victory’ in sending flight attendants to the picket lines, says TD analyst"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.959,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.48,
    "summary": "A carrier has been advised to settle negotiations to ensure labor peace. This suggests that reaching an agreement is seen as crucial for maintaining harmonious work relations and avoiding potential conflicts or disruptions. The statement implies that settling is in the best interest of both the carrier and its workforce to promote stability.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 53 tokens",
    "image": {
      "src": "icons/briefcase.svg",
      "thumbnail": "icons/briefcase.svg",
      "alt": "business",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "SpaceX reveals why the last two Starships failed as another launch draws near",
    "domain": "technology",
    "source_domain": "arstechnica.com",
    "location": "global",
    "published": "Fri, 15 Aug 2025 20:20:24 +0000",
    "source": "Ars Technica",
    "sources": [
      "Ars Technica"
    ],
    "domains": [
      "arstechnica.com"
    ],
    "snippets": [
      "\"SpaceX can now proceed with Starship Flight 10 launch operations under its current license.\""
    ],
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/08/ship37staticfire-1152x648.jpg",
    "titles": [
      "SpaceX reveals why the last two Starships failed as another launch draws near"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.924,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.48,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 13 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "How your solar rooftop became a national security issue",
    "domain": "technology",
    "source_domain": "techcrunch.com",
    "location": "global",
    "published": "Fri, 15 Aug 2025 20:58:45 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com"
    ],
    "snippets": [
      "Texas solar company EG4 became the poster child for home energy cybersecurity risks this week after federal officials published an advisory detailing how hackers could hijack its inverters."
    ],
    "image_url": "",
    "titles": [
      "How your solar rooftop became a national security issue"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.937,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.476,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 9 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "TikTok’s new guidelines add subtle changes for LIVE creators, AI content, and more",
    "domain": "technology",
    "source_domain": "techcrunch.com",
    "location": "global",
    "published": "Fri, 15 Aug 2025 19:17:48 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com"
    ],
    "snippets": [
      "TikTok is preparing an update to its Community Guidelines, which dictate the rules for participating on the social video platform as well as what standards the company uses to determine the videos that make it onto its For You feed."
    ],
    "image_url": "",
    "titles": [
      "TikTok’s new guidelines add subtle changes for LIVE creators, AI content, and more"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.904,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.476,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 14 tokens",
    "image": {
      "src": "icons/robot.svg",
      "thumbnail": "icons/robot.svg",
      "alt": "ai",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Breakthrough in Virus Packaging Could Boost Antivirals, Gene Therapy",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Fri, 15 Aug 2025 14:16:21 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "phys.org"
    ],
    "snippets": [
      "Researchers at San Diego State University and Michigan State University are shedding new light on how viruses meticulously pack their genetic material — a breakthrough that could help researchers engineer antivirals and gene therapies."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/how-viruses-know-whats.jpg",
    "titles": [
      "Study finds viruses rely on diverse RNA traits to pack their genomes with precision"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.885,
      "consensus": 0.393,
      "constructiveness": 0.098,
      "proximity": 0.5
    },
    "score": 0.475,
    "summary": "Researchers from San Diego State University and Michigan State University have made a breakthrough in understanding how viruses pack their genetic material. This discovery could aid in the development of new antivirals and gene therapies, offering potential advancements in medical treatments.",
    "constructiveness_score": 0.098,
    "constructiveness_reason": "1 constructive keywords out of 41 tokens",
    "image": {
      "src": "icons/beaker.svg",
      "thumbnail": "icons/beaker.svg",
      "alt": "science",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "The best budget smartphone you can buy",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-08-15T16:29:35-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "www.theverge.com"
    ],
    "snippets": [
      "Some of us take a kind of “I eat to live” rather than an “I live to eat” approach to gadgets. They’re tools that help you get things done, not something you want to invest a lot of time or money in. If that’s you — and there’s no judgment here from a certifiable gadget [&#8230;]"
    ],
    "image_url": "",
    "titles": [
      "The best budget smartphone you can buy"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.927,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.474,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 7 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Study Finds Common Food Thickeners Digestible, Challenging Old Views",
    "domain": "science",
    "source_domain": "scitechdaily.com",
    "location": "global",
    "published": "Fri, 15 Aug 2025 18:33:42 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "scitechdaily.com"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/for-decades-scientists-believed-these-common-food-thickeners-were-indigestible-they-were-wrong/\" rel=\"nofollow\" title=\"For Decades, Scientists Believed These Common Food Thickeners Were Indigestible. They Were Wrong\"><img alt=\"Pouring Ketchup\" class=\"webfeedsFeature"
    ],
    "image_url": "",
    "titles": [
      "For Decades, Scientists Believed These Common Food Thickeners Were Indigestible. They Were Wrong"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.891,
      "consensus": 0.393,
      "constructiveness": 0.068,
      "proximity": 0.5
    },
    "score": 0.473,
    "summary": "Recent research has overturned the long-held belief that common food thickeners, such as those found in ketchup and other similar products, are indigestible. Scientists have now discovered that these substances can actually be broken down and digested by the body, challenging decades of scientific consensus. This new understanding could have implications for dietary guidelines and the food industry.",
    "constructiveness_score": 0.068,
    "constructiveness_reason": "1 constructive keywords out of 59 tokens",
    "image": {
      "src": "icons/beaker.svg",
      "thumbnail": "icons/beaker.svg",
      "alt": "science",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "New Crystal Discovered for Efficient Oxygen Management in Clean Energy",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Fri, 15 Aug 2025 14:12:48 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "phys.org"
    ],
    "snippets": [
      "A team of scientists from Korea and Japan has discovered a new type of crystal that can \"breathe\"—releasing and absorbing oxygen repeatedly at relatively low temperatures. This unique ability could transform the way we develop clean energy technologies, including fuel cells, energy-saving windows, a"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/scientists-discover-a-9.jpg",
    "titles": [
      "A new crystal that 'breathes' oxygen expands possibilities for clean energy and electronics"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.884,
      "consensus": 0.393,
      "constructiveness": 0.077,
      "proximity": 0.5
    },
    "score": 0.473,
    "summary": "Scientists from Korea and Japan have discovered a new crystal capable of repeatedly absorbing and releasing oxygen at low temperatures. This breakthrough could significantly impact the development of clean energy technologies, such as fuel cells and energy-saving windows, by offering a more efficient way to manage oxygen levels in various applications.",
    "constructiveness_score": 0.077,
    "constructiveness_reason": "1 constructive keywords out of 52 tokens",
    "image": {
      "src": "icons/beaker.svg",
      "thumbnail": "icons/beaker.svg",
      "alt": "science",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Here are the best AirPods deals you can get right now",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-08-15T14:29:53-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "www.theverge.com"
    ],
    "snippets": [
      "If you know where to look, you can often score discounts on Apple’s ever-expanding AirPods lineup. Both the newer AirPods Max and AirPods 4 (with and without ANC) now consistently receive discounts, as do the latest AirPods Pro with USB-C. Events like Amazon Prime Day, Black Friday, and Cyber Monday"
    ],
    "image_url": "",
    "titles": [
      "Here are the best AirPods deals you can get right now"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.889,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.473,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 11 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Les Amis, the European app helping women form friendships, launches in New York",
    "domain": "technology",
    "source_domain": "techcrunch.com",
    "location": "global",
    "published": "Fri, 15 Aug 2025 20:04:50 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com"
    ],
    "snippets": [
      "Les Amis is an app designed to make it easy for women to form friendships and attend local events."
    ],
    "image_url": "",
    "titles": [
      "Les Amis, the European app helping women form friendships, launches in New York"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.919,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.472,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 13 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "5M-Year-Old Deer Fossil Found in Tennessee, 26M-Year-Old \"Shark-Whale\" in Austra",
    "domain": "science",
    "source_domain": "scitechdaily.com",
    "location": "global",
    "published": "Fri, 15 Aug 2025 19:23:45 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "scitechdaily.com"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/5-million-year-old-deer-fossil-discovered-in-tennessee/\" rel=\"nofollow\" title=\"5-Million-Year-Old Deer Fossil Discovered in Tennessee\"><img alt=\"5 Million Year Old Deer Fossil Graphic\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"539\" src=\"https://scitechdai",
      "<a href=\"https://scitechdaily.com/bizarre-26-million-year-old-fossil-of-shark-whale-discovered-in-australia/\" rel=\"nofollow\" title=\"Bizarre 26-Million-Year-Old Fossil of “Shark-Whale” Discovered in Australia\"><img alt=\"Janjucetus dullardi Calf and Mother\" class=\"webfeedsFeaturedVisual wp-post-image\""
    ],
    "image_url": "",
    "titles": [
      "5-Million-Year-Old Deer Fossil Discovered in Tennessee",
      "Bizarre 26-Million-Year-Old Fossil of “Shark-Whale” Discovered in Australia"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.906,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.469,
    "summary": "Scientists have discovered a 5-million-year-old deer fossil in Tennessee, marking a significant paleontological find. Additionally, a 26-million-year-old fossil of a unique \"shark-whale\" has been uncovered in Australia, offering new insights into prehistoric marine life. These discoveries provide valuable information on the biodiversity and evolutionary history of these regions.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 55 tokens",
    "image": {
      "src": "icons/beaker.svg",
      "thumbnail": "icons/beaker.svg",
      "alt": "science",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Human-Rating Certification Ensures Space System Safety for Crew Missions",
    "domain": "science",
    "source_domain": "www.nasa.gov",
    "location": "global",
    "published": "Fri, 15 Aug 2025 18:34:58 +0000",
    "source": "NASA",
    "sources": [
      "NASA"
    ],
    "domains": [
      "www.nasa.gov"
    ],
    "snippets": [
      "Human-rating&#160;is a critical certification process that validates the safety, reliability, and suitability of space systems—including orbiters, launch vehicles, rovers, spacesuits, habitats, and other crewed elements—for human use and interaction. This process ensures that systems are designed no"
    ],
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/06/round-motion-graphic-gif.mp4",
    "titles": [
      "Human Rating and NASA-STD-3001"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.891,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.466,
    "summary": "Human-rating is a certification process ensuring space systems like orbiters, launch vehicles, and habitats are safe and suitable for human use. This critical validation covers design, reliability, and safety, confirming that these systems meet strict standards for human interaction in space missions.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 43 tokens",
    "image": {
      "src": "icons/telescope.svg",
      "thumbnail": "icons/telescope.svg",
      "alt": "space",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "NASA Astronauts to Host Space Call with Minnesota Students on STEM Topics",
    "domain": "science",
    "source_domain": "www.nasa.gov",
    "location": "global",
    "published": "Fri, 15 Aug 2025 18:32:05 +0000",
    "source": "NASA",
    "sources": [
      "NASA"
    ],
    "domains": [
      "www.nasa.gov"
    ],
    "snippets": [
      "NASA astronauts Michael Fincke and Zena Cardman will connect with students in Minnesota as they answer prerecorded science, technology, engineering, and mathematics (STEM) questions aboard the International Space Station. The Earth-to-space call will begin at 11 a.m. EDT on Wednesday, Aug. 20, and w"
    ],
    "image_url": "",
    "titles": [
      "NASA Astronauts to Answer Questions from Students in Minnesota"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.89,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.466,
    "summary": "NASA astronauts Michael Fincke and Zena Cardman will engage with Minnesota students via an Earth-to-space call on Wednesday, Aug. 20, at 11 a.m. EDT. During this interaction, they will answer prerecorded questions related to science, technology, engineering, and mathematics (STEM) from aboard the International Space Station.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 49 tokens",
    "image": {
      "src": "icons/telescope.svg",
      "thumbnail": "icons/telescope.svg",
      "alt": "nasa",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Exploring Damped Oscillators: From Guitars to Swings",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Fri, 15 Aug 2025 14:08:03 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "phys.org"
    ],
    "snippets": [
      "A plucked guitar string can vibrate for seconds before falling silent. A playground swing, emptied of its passenger, will gradually come to rest. These are what physicists call \"damped harmonic oscillators\" and are well understood in terms of Newton's laws of motion."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/solved-90-year-old-mys.jpg",
    "titles": [
      "Physicists solve 90-year-old puzzle of quantum damped harmonic oscillators"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.883,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.465,
    "summary": "A plucked guitar string and an empty playground swing are examples of \"damped harmonic oscillators,\" which slowly stop moving due to energy loss. These phenomena are explained by Newton's laws of motion, demonstrating how forces act on objects to gradually cease their motion over time.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 46 tokens",
    "image": {
      "src": "icons/beaker.svg",
      "thumbnail": "icons/beaker.svg",
      "alt": "science",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  }
]