[
  {
    "title": "Trump to Nominate Heritage Foundation Economist as BLS Commissioner",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Mon, 11 Aug 2025 19:50:34 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "Deutsche Welle",
      "BBC",
      "Financial Post"
    ],
    "domains": [
      "www.npr.org",
      "financialpost.com",
      "www.dw.com",
      "www.bbc.com"
    ],
    "snippets": [
      "President Trump plans to tap an economist from the conservative Heritage Foundation to oversee the Bureau of Labor Statistics. He fired the previous leader after a disappointing jobs report.",
      "The president said that EJ Antoni would ensure the jobs numbers were \"HONEST and ACCURATE\".",
      "E.J. Antoni is a chief economist of conservative think tank Heritage Foundation. Trump fired the former BLS chief over a report showing a slowdown in hiring.",
      "WASHINGTON (AP) &#8212; President Donald Trump said Monday that he has nominated E.J. Antoni, chief economist at the conservative Heritage Foundation, to head the agency that compiles and publishes the nation&#8217;s employment and inflation figures. &#8220;Our Economy is booming, and E.J. will ensu"
    ],
    "image_url": "",
    "titles": [
      "Trump taps conservative economist to lead statistics agency",
      "Trump picks conservative economist to lead jobs data agency",
      "US: Trump taps conservative economist as Labor Stats head",
      "Trump nominates conservative economist to head agency that compiles jobs, inflation data"
    ],
    "score_components": {
      "magnitude": 0.92,
      "recency": 0.927,
      "consensus": 0.985,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.829,
    "summary": "President Donald Trump announced his intention to nominate E.J. Antoni, a chief economist at the conservative Heritage Foundation, as the new commissioner of the Bureau of Labor Statistics (BLS). This decision follows Trump's firing of the previous commissioner, Erika McEntarfer, citing dissatisfaction with a recent jobs report and accusing her of manipulating data. Trump asserts that Antoni will provide \"honest and accurate\" employment data.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 66 tokens",
    "image": {
      "src": "icons/newspaper.svg",
      "thumbnail": "icons/newspaper.svg",
      "alt": "general",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Trump to Discuss Ukraine War End with Putin in Alaska Summit",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Mon, 11 Aug 2025 14:15:08 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "Axios",
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.npr.org",
      "news.google.com",
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "President Trump says he thinks Russian President Vladimir Putin is ready to end his war on Ukraine, but he will use a Friday summit to \"feel out\" his counterpart.",
      "The US president says talks with Putin on Friday will be a \"feel-out meeting\" aimed at urging Russia to end the war in Ukraine.",
      "<a href=\"https://news.google.com/rss/articles/CBMiekFVX3lxTE5qUV9GWDRudDU5ckp3Qzk1LWZmZ1pnVG9QSFBnS2V5QUNmY05PbFhjaXpvWnFjRGV2NzVxU181VFp4RVctbnFjUmJfZVFhc1ljZUV5SkpSeVdLUEw5TWVaNTFwVFBFeTRaamZIeEhxb3BTYno3azJYdTRR?oc=5\" target=\"_blank\">Trump says he and Putin will discuss Ukraine's future borders</",
      "<p>US president gives details on Alaska meeting and expresses frustration with Zelenskyy’s conditions for any peace deal</p><p>Donald Trump has confirmed that he and Vladimir Putin will discuss “land swapping” when they meet on Friday in Alaska for a <a href=\"https://www.theguardian.com/world/2025/a"
    ],
    "image_url": "",
    "titles": [
      "Trump says he will 'feel out' Putin in Alaska on ending the war in Ukraine",
      "Trump says he will try to get back territory for Ukraine in talks with Putin",
      "Trump says he and Putin will discuss Ukraine's future borders - Axios",
      "Trump says he and Putin will discuss ‘land swapping’ at Ukraine war summit"
    ],
    "score_components": {
      "magnitude": 0.96,
      "recency": 0.825,
      "consensus": 0.985,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.822,
    "summary": "President Trump plans to use a summit in Alaska on Friday to discuss the potential end of the war in Ukraine with Russian President Vladimir Putin. Trump mentioned the meeting would serve as a \"feel-out meeting\" to urge Russia towards peace and will include discussions on Ukraine's future borders, specifically the possibility of \"land swapping.\" This announcement follows Trump's expression of frustration with Ukrainian President Zelenskyy's conditions for a peace deal.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 75 tokens",
    "image": {
      "src": "icons/ukraine.svg",
      "thumbnail": "icons/ukraine.svg",
      "alt": "ukraine flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Trump says Nvidia will hand the U.S. 15% of its H20 chip sales to China",
    "domain": "technology",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Mon, 11 Aug 2025 13:04:57 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "Ars Technica",
      "Deutsche Welle",
      "TechCrunch"
    ],
    "domains": [
      "www.npr.org",
      "arstechnica.com",
      "techcrunch.com",
      "www.dw.com"
    ],
    "snippets": [
      "The president said that Nvidia would pay the government in exchange for easing export restrictions — and that he'd initially asked for a larger cut.",
      "The US government began issuing artificial intelligence chip export licenses after the revenue-sharing deal, despite security concerns.",
      "The global AI chip race narrative used to be about U.S. national security, but apparently now it's about tariffs: Nvidia and AMD have agreed to pay the U.S. government 15% of the revenue they make from sales of high-end AI chips to China in exchange for licenses to sell those chips in the country, t",
      "The deal won’t resolve national security concerns."
    ],
    "image_url": "",
    "titles": [
      "Trump says Nvidia will hand the U.S. 15% of its H20 chip sales to China",
      "Nvidia, AMD to pay US 15% of AI chip sales to China",
      "Nvidia, AMD may sell high-end AI chips to China if they pay US a cut",
      "Trump strikes “wild” deal making US firms pay 15% tax on China chip sales"
    ],
    "score_components": {
      "magnitude": 0.94,
      "recency": 0.805,
      "consensus": 0.985,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.811,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 16 tokens",
    "image": {
      "src": "icons/cpu.svg",
      "thumbnail": "icons/cpu.svg",
      "alt": "chip",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Trump to Nominate Heritage Foundation Economist as BLS Commissioner",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Tue, 12 Aug 2025 01:37:05 GMT",
    "source": "Axios",
    "sources": [
      "CNBC",
      "Axios",
      "MarketWatch",
      "The Guardian"
    ],
    "domains": [
      "news.google.com",
      "www.cnbc.com",
      "www.theguardian.com",
      "www.marketwatch.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMif0FVX3lxTE9yNXNQcUpRYTkwc3VRRlgyTzZzSmJrYjFMSjJDRmJKdDVCYVlITF81bGZlQWRRVk1xbWFBM3IzMGF5b3lYdkZmZUd2QUp0Z091d3g1RGRXcV9fQ0JseEJUZUQ1YWRjQ1VrTUVlTkVkR2hSaXBzS1d4akhQMjI3RXc?oc=5\" target=\"_blank\">Trump names Heritage's E.J. Antoni to lead Bureau of Lab",
      "President Trump, who claimed former BLS Commissioner Erika McEntarfer manipulated jobs data, said Antoni would release \"honest and accurate\" numbers.",
      "<p>This blog is now closed. Read our latest story <a href=\"https://www.theguardian.com/us-news/2025/aug/11/trump-ej-antoni-heritage-foundation-bls\">here</a></p><p><strong>Donald Trump</strong> said on Truth Social today that DC “will be LIBERATED today”.</p><p>Ahead of his press conference, in just ",
      "<p>EJ Antoni, longtime critic of Bureau of Labor Statistics, nominated to replace Erika McEntarfer, who Trump fired</p><p>Donald Trump has announced he is nominating EJ Antoni, the chief economist at the conservative Heritage Foundation, as the next commissioner of the Bureau of Labor Statistics.</p",
      "President Donald Trump said late Monday he plans to nominate E.J. Antoni, the chief economist of the conservative Heritage Foundation, to become commissioner of the Bureau of Labor Statistics."
    ],
    "image_url": "",
    "titles": [
      "Trump names Heritage's E.J. Antoni to lead Bureau of Labor Statistics - Axios",
      "Trump says he's nominating E.J. Antoni as Bureau of Labor Statistics commissioner",
      "Trump nominates chief economist at rightwing Heritage Foundation to lead Bureau of Labor Statistics – as it happened",
      "Trump nominates Heritage Foundation economist as labor statistics chief",
      "Trump picks conservative economist E.J. Antoni to lead Bureau of Labor Statistics"
    ],
    "score_components": {
      "magnitude": 0.92,
      "recency": 0.942,
      "consensus": 0.985,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.807,
    "summary": "President Donald Trump announced his intention to nominate E.J. Antoni, a chief economist at the conservative Heritage Foundation, as the new commissioner of the Bureau of Labor Statistics (BLS). This decision follows Trump's firing of the previous commissioner, Erika McEntarfer, citing dissatisfaction with a recent jobs report and accusing her of manipulating data. Trump asserts that Antoni will provide \"honest and accurate\" employment data.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 66 tokens",
    "image": {
      "src": "icons/newspaper.svg",
      "thumbnail": "icons/newspaper.svg",
      "alt": "general",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Explosion at Pennsylvania Steel Plant Kills One, Leaves One Missing",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 12 Aug 2025 01:29:17 GMT",
    "source": "BBC",
    "sources": [
      "Axios",
      "BBC",
      "Business Insider",
      "Al Jazeera",
      "The Guardian",
      "ABC News"
    ],
    "domains": [
      "abcnews.go.com",
      "www.theguardian.com",
      "www.aljazeera.com",
      "www.bbc.com",
      "news.google.com",
      "www.businessinsider.com"
    ],
    "snippets": [
      "A second death is confirmed after a search operation for a missing person stretched into Monday evening.",
      "The massive US Steel coking plant is the largest such facility in North America.",
      "<a href=\"https://news.google.com/rss/articles/CBMikgFBVV95cUxOQU5KNWZuU24yWHJjSGdnVFNOR2YyMFpTZ3BlRXc1cG8tRlZ5QkdXYU9ldW5yN0R4UFdTZHJ4Y0hQLU5MODhEaC1tMkl4WnVid05sSlVfbWZXeFQ3Z3dVZ1dYbjNRM196cVBzb0htOUdtSDBNMGxsbnh3VS13SzNwV0k3WElfVU9ZWW8tMV9JcVVHQQ?oc=5\" target=\"_blank\">Explosions at U.S. Steel plan",
      "One person has died, one is unaccounted for and 10 are injured following an explosion at a Pennsylvania steel plant on Monday, local police said.",
      "<p>Second fatality reported after body of one worker pulled from wreckage of coking facility in Clairton after explosion sent black smoke into the sky</p><p>An explosion at a US Steel plant in <a href=\"https://www.theguardian.com/us-news/pennsylvania\">Pennsylvania</a>, near Pittsburgh, has killed tw",
      "The explosion took place at the US Steel Clairton Coke Works plant, located south of Pittsburgh, Pennsylvania."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/994f/live/2d9e3ce0-771c-11f0-a975-cb151ca452f4.jpg",
    "titles": [
      "Two dead and 10 injured in Pennsylvania steel plant explosion",
      "One dead, dozens injured in steel plant explosion in Pennsylvania",
      "Explosions at U.S. Steel plant leave 2 dead, 10 injured - Axios",
      "WATCH:  One dead, 10 injured in explosion at Pennsylvania steel plant, officials say",
      "Explosion ‘like thunder’ at Pennsylvania US Steel plant leaves two dead",
      "One dead, one missing after explosion at US Steel plant in Pennsylvania"
    ],
    "score_components": {
      "magnitude": 0.9,
      "recency": 0.94,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.803,
    "summary": "An explosion at the US Steel Clairton Coke Works plant in Pennsylvania resulted in one death, one person missing, and 10 injuries. The incident occurred south of Pittsburgh at North America's largest coking facility. The cause of the explosion is currently unknown, and a search and rescue operation is underway for the missing individual.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 55 tokens",
    "image": {
      "src": "icons/newspaper.svg",
      "thumbnail": "icons/newspaper.svg",
      "alt": "general",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Trump Extends Tariff Pause on Chinese Imports for 90 Days",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Mon, 11 Aug 2025 20:35:12 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Deutsche Welle",
      "Axios",
      "CNBC",
      "MarketWatch",
      "Al Jazeera",
      "The Guardian",
      "New York Times"
    ],
    "domains": [
      "www.theguardian.com",
      "www.dw.com",
      "www.marketwatch.com",
      "www.nytimes.com",
      "www.aljazeera.com",
      "news.google.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "US President Donald Trump signed an extension just before midnight in Beijing, when the pause was to expire.",
      "The decision delays a trade showdown between the world's two biggest economies.",
      "<a href=\"https://news.google.com/rss/articles/CBMicEFVX3lxTE9FNnZTQUw0dlRTUjdpTmpCTmRfWHJnbnNGTEtsVjhwVEdRaTRjOXVjV0FsbGFxQXVnUVJ1NHl1Sl85WmpxZERIeVFxRXo0Vk9wZFFoZW5xZ1ZMYnFNN1NRMjJXdU9ieElRbXZZS3VpMFU?oc=5\" target=\"_blank\">U.S., China extend tariff pause another 90 days</a>&nbsp;&nbsp;<font color=\"",
      "President Donald Trump has signed an executive order that will prevent U.S. tariffs on Chinese goods from spiking for another 90 days.",
      "<p>President signs executive order extending deadline for higher tariffs hours before agreement was due to expire</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/live/2025/aug/11/donald-trump-washington-crime-homelessness-redistricting-tariffs-us-politics-news-live-updates\">US politics li",
      "President Trump’s order continues a reprieve from the threat of escalating tariffs and export controls, which rocked the global economy earlier this year.",
      "U.S. levies on Chinese goods like toys, footwear and furniture could rise sharply if a deal is not approved by Tuesday’s deadline."
    ],
    "image_url": "",
    "titles": [
      "US to extend China tariff pause another 90 days",
      "Trump, China extend tariffs pause for 90 more days",
      "U.S., China extend tariff pause another 90 days - Axios",
      "Trump extends China tariff deadline by 90 days",
      "Trump announces another 90-day pause on China tariffs",
      "Trump Extends China Tariff Truce by Three Months",
      "Trump extends trade truce with China. What it means for tariffs."
    ],
    "score_components": {
      "magnitude": 0.94,
      "recency": 0.866,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.802,
    "summary": "President Donald Trump signed an executive order extending the pause on increasing tariffs against Chinese imports for another 90 days, just before the previous pause was set to expire at midnight in Beijing. This action prevents the expected rise in tariffs that was scheduled for Tuesday.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 46 tokens",
    "image": {
      "src": "icons/china.svg",
      "thumbnail": "icons/china.svg",
      "alt": "chinese flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Al Jazeera Reporter and Colleagues Killed in Israeli Airstrike in Gaza",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 11 Aug 2025 17:16:51 GMT",
    "source": "BBC",
    "sources": [
      "Deutsche Welle",
      "BBC",
      "Al Jazeera",
      "LA Times",
      "New York Times"
    ],
    "domains": [
      "www.latimes.com",
      "www.dw.com",
      "www.nytimes.com",
      "www.aljazeera.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Sharif was killed when Israel targeted a tent used by media in northern Gaza, alongside six others, Al Jazeera said.",
      "Israel has killed nearly 270 journalists and media workers since it launched its war on Gaza.",
      "Anas al-Sharif, a reporter previously threatened by Israel, and four colleagues were killed in an Israeli airstrike.",
      "Officials accused Anas al-Sharif of being a Hamas operative posing as a reporter. Al Jazeera says he and the other four victims all worked for the network.",
      "<p>Al Jazeera reporter Anas al-Sharif, 28, drew millions of followers on social media and emerged as one of the top voices in the Arab world for his chronicling of the war in Gaza.</p>"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/a03b/live/5b0875e0-76d8-11f0-a20f-3b86f375586a.jpg",
    "titles": [
      "Who was Anas al-Sharif, prominent Gaza journalist killed by Israel?",
      "Here are the names of the journalists Israel killed in Gaza",
      "Israel kills Al Jazeera journalist Anas al-Sharif in Gaza",
      "Who Were the Al Jazeera Journalists Killed in an Israeli Strike in Gaza?",
      "Prominent Al Jazeera journalist among several killed in Israeli strike on Gaza press tent"
    ],
    "score_components": {
      "magnitude": 0.96,
      "recency": 0.792,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.794,
    "summary": "Anas al-Sharif, a 28-year-old Al Jazeera reporter with a significant social media following, and four colleagues were killed in an Israeli airstrike targeting a media tent in northern Gaza. Israel has accused al-Sharif of being a Hamas operative, a claim disputed by Al Jazeera. This incident is part of a broader conflict in which nearly 270 journalists and media workers have been killed since Israel launched its war on Gaza.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 74 tokens",
    "image": {
      "src": "icons/newspaper.svg",
      "thumbnail": "icons/newspaper.svg",
      "alt": "general",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Trump to Deploy National Guard, Control D.C. Police Amid Crime Concerns",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 11 Aug 2025 19:31:16 GMT",
    "source": "BBC",
    "sources": [
      "Deutsche Welle",
      "Axios",
      "BBC",
      "CNBC",
      "Financial Times",
      "Al Jazeera",
      "LA Times",
      "The Guardian"
    ],
    "domains": [
      "www.latimes.com",
      "www.dw.com",
      "www.bbc.co.uk",
      "www.theguardian.com",
      "www.aljazeera.com",
      "www.bbc.com",
      "news.google.com",
      "www.cnbc.com",
      "www.ft.com"
    ],
    "snippets": [
      "The president also takes control of the city's police force, as the mayor rejects his claims of a crime wave.",
      "President Trump says he will deploy hundreds of troops to Washington DC to address crime there.",
      "And how JD Vance’s English holiday is causing havoc in the Cotswolds",
      "US President Donald Trump said he is taking control of Washington, DC’s police force and deploying the National Guard.",
      "US President Donald Trump claimed the city had been taken over by criminals and gangs. But police statistics show that violent crimes have decreased significantly in recent years.",
      "<a href=\"https://news.google.com/rss/articles/CBMiiwFBVV95cUxQakxHQVgzZ19lVkx0YVpKYVlud28zb0F0bmh3UGlRU1ZRenNzNmVKNXpFcmE3NE56RjNTRklVTktLU0RSR2dfaVY5UlZMZUlORWFwWWlsNWJ0SnpkQ1V5cUt6QzZ0LWN0UDZlVUNHX2xOWXlyUFBpYzhsNm8yMmdSeS1Tc2FpU2ExTlZv?oc=5\" target=\"_blank\">Trump to deploy National Guard to D.C. ",
      "Trump in a social media post on Sunday declared that \"the Homeless\" in Washington, D.C., will \"have to move out.\"",
      "Mayor Muriel Bowser acknowledges crime ‘spike’ in 2023 but says there has been a sharp decline since",
      "<p>President claims US capital ‘overtaken by violent gangs and bloodthirsty criminals … and homeless people’</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/live/2025/aug/11/donald-trump-washington-crime-homelessness-redistricting-tariffs-us-politics-news-live-updates\">US politics – live ",
      "<p>Trump is invoking Section 740 of the District of Columbia Home Rule Act that places the Metropolitan Police Department under direct federal control.</p>"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/8608/live/ea34de40-76ef-11f0-a20f-3b86f375586a.jpg",
    "titles": [
      "Trump deploys National Guard to Washington DC and pledges crime crackdown",
      "Is crime in Washington DC 'out of control', as Trump claims?",
      "Americanswers…on 5 Live! Why is Donald Trump deploying the National Guard to Washington DC?",
      "Trump to deploy National Guard to Washington DC",
      "Trump announces National Guard deployment in Washington DC",
      "Trump to deploy National Guard to D.C. and federalize city police - Axios",
      "Trump puts Washington, DC, police under federal control, deploys National Guard",
      "Trump deploys National Guard in Washington over ‘safety emergency’",
      "Trump seizes control of Washington DC police and deploys national guard",
      "Trump expands L.A. military tactics by sending National Guard to Washington, D.C."
    ],
    "score_components": {
      "magnitude": 0.92,
      "recency": 0.83,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.788,
    "summary": "President Donald Trump announced plans to deploy the National Guard and take control of Washington D.C.'s Metropolitan Police Department, citing concerns over crime and homelessness. Despite Trump's claims of the city being \"overtaken\" by criminals and gangs, police statistics indicate a significant decrease in violent crimes in recent years. D.C.'s mayor has criticized the comparison to a war-torn country as exaggerated and misleading. Trump's actions are based on invoking section 740 of the District of Columbia Home Rule Act.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 86 tokens",
    "image": {
      "src": "icons/newspaper.svg",
      "thumbnail": "icons/newspaper.svg",
      "alt": "general",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Browns' Myles Garrett Cited for Speeding, Caught at 100 mph in 60 Zone",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 11 Aug 2025 21:47:58 EST",
    "source": "ESPN",
    "sources": [
      "Sports Illustrated",
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.cbssports.com",
      "news.google.com",
      "www.espn.com"
    ],
    "snippets": [
      "Browns defensive end Myles Garrett was issued a citation for speeding on the interstate in a Cleveland suburb early Saturday morning, according to court records, after he was clocked going 100 mph in a 60 mph zone.",
      "Garrett has a history of speeding tickets",
      "<a href=\"https://news.google.com/rss/articles/CBMikgFBVV95cUxQWFVLN3ZnQXFzNVlHLUVjWHNwemdjT3drOWxJYUpUUWVtbTA5elVRNUY5ZWZSRmh1bnBDM05ncmhVZDA3V0F3Rl9aXzdOdzVWaTQtX0l0X2F5ZzdIZkhQRDV1VDNzd282ekF1Q3NJcFdzTkdFSWZzZmx4dG5fOFp4eXJGcGR5d2lvOWUwSmN0bkYwdw?oc=5\" target=\"_blank\">Myles Garrett Cited for Speed"
    ],
    "image_url": "",
    "titles": [
      "Browns' Garrett cited for driving 40 mph over limit",
      "Browns star Myles Garrett cited for driving 100 mph after team's preseason opener",
      "Myles Garrett Cited for Speeding Saturday After Browns Preseason Game - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.966,
      "consensus": 0.897,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.772,
    "summary": "Browns defensive end Myles Garrett was cited for speeding early Saturday in a Cleveland suburb after being caught driving 100 mph in a 60 mph zone, as per court records. This incident adds to Garrett's history of speeding tickets, highlighting a recurring issue with traffic violations.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 47 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Australia to Recognize Palestinian State at UN, Aligns with Allies",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-08-11T11:18:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "Axios",
      "New York Times",
      "Washington Post"
    ],
    "domains": [
      "www.nytimes.com",
      "news.google.com",
      "www.washingtonpost.com",
      "www.dw.com"
    ],
    "snippets": [
      "Despite widespread international recognition of Palestine as a state, many Western nations say they will only endorse Palestinian statehood as part of a comprehensive peace agreement with Israel.",
      "<a href=\"https://news.google.com/rss/articles/CBMiekFVX3lxTE1YQzZidTlNWnRPYWN4SjRTOGZNYVlLeWtWcUFkN0M0UVdLZEF5UGo4cWpSR3g5Z0IxanYwNTA5OEVlMG9naVlGZld6Wjg2dGlkZWxMbEdlandZU0NXaTlNUHF4NjZnVEdnRjJXU1FiU1dIbkZ2LVlBc2ln?oc=5\" target=\"_blank\">Australia will recognize a Palestinian state, PM Albanese says<",
      "Anger over Israel’s conduct in Gaza has left it increasingly isolated as key allies move toward declarations of Palestinian statehood.",
      "Canberra is the latest U.S. ally to announce such a move in the face of growing global outrage over the dire humanitarian situation in Gaza.",
      "After similar announcements by France, Britain and Canada, Australia said it would act at the United Nations General Assembly session next month."
    ],
    "image_url": "",
    "titles": [
      "Which countries recognize Palestinian statehood?",
      "Australia will recognize a Palestinian state, PM Albanese says - Axios",
      "Here are countries that recognize a Palestinian state — or may do so soon",
      "Australia to recognize a Palestinian state, joining France, Canada and U.K.",
      "Australia to Recognize Palestinian Statehood"
    ],
    "score_components": {
      "magnitude": 0.9,
      "recency": 0.714,
      "consensus": 0.985,
      "constructiveness": 0.053,
      "proximity": 0.5
    },
    "score": 0.759,
    "summary": "Australia, led by Prime Minister Anthony Albanese, has announced it will recognize a Palestinian state at the upcoming UN General Assembly. This decision aligns with actions by France, Canada, and the UK, and comes amid international concerns over the humanitarian situation in Gaza. Albanese highlighted that a two-state solution offers the best hope for ending the conflict and suffering in the region. New Zealand is also considering a similar stance, with a decision expected soon.",
    "constructiveness_score": 0.053,
    "constructiveness_reason": "1 constructive keywords out of 76 tokens",
    "image": {
      "src": "icons/newspaper.svg",
      "thumbnail": "icons/newspaper.svg",
      "alt": "general",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Trump Critiques Intel CEO's Ties, Plans Collaboration",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Mon, 11 Aug 2025 17:46:39 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Business Insider",
      "Fortune",
      "Al Jazeera"
    ],
    "domains": [
      "www.businessinsider.com",
      "fortune.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "US President Trump said last week that Intel’s CEO Lip-Bu Tan was &#039;highly conflicted&#039; due to ties with Chinese firms.",
      "Last week, President Donald Trump called Intel CEO Lip-Bu Tan \"highly CONFLICTED\" on Truth Social. On Monday, he posted calling Tan a \"success.\"",
      "\"Mr. Tan and my Cabinet members are going to spend time together, and bring suggestions to me during the next week.\""
    ],
    "image_url": "",
    "titles": [
      "Trump meets with Intel CEO after calling for his ouster",
      "Trump praises Intel's CEO, days after calling for him to resign",
      "Trump says Intel CEO has ‘amazing story,’ sets Cabinet talks"
    ],
    "score_components": {
      "magnitude": 0.82,
      "recency": 0.817,
      "consensus": 0.897,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.725,
    "summary": "Last week, US President Donald Trump labeled Intel CEO Lip-Bu Tan as \"highly conflicted\" due to connections with Chinese companies, expressing his concerns on Truth Social. However, Trump later referred to Tan as a \"success\" and announced plans for Tan and Cabinet members to collaborate and bring forward suggestions to him in the coming week.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 56 tokens",
    "image": {
      "src": "icons/briefcase.svg",
      "thumbnail": "icons/briefcase.svg",
      "alt": "business",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "La Liga Approves First-Ever US Game: Villarreal vs Barcelona in Miami",
    "domain": "sports",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Mon, 11 Aug 2025 17:31:31 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Sportsnet",
      "Al Jazeera",
      "Yahoo Sports"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.aljazeera.com",
      "onefootball.com"
    ],
    "snippets": [
      "Spain&#039;s football federation has approved a request for Villarreal&#039;s home La Liga game with Barcelona to move to Miami.",
      "La Liga eyes first ever official match in the United StatesHistoric Move on the Horizon: Villarreal vs Barcelona Could Be Played in MiamiSpanish football could witness landmark moment as La Liga's pus...",
      "<p>The Spanish league is closer to playing a regular-season game in the United States.</p>\n<p>The Spanish soccer federation on Monday approved a request for the match between Villarreal and Barcelona to be played in Miami on Dec. 20.</p>"
    ],
    "image_url": "",
    "titles": [
      "Barcelona and Villarreal set for La Liga game at Messi’s Miami",
      "Historic Move on the Horizon: Villarreal vs Barcelona Could Be Played in Miami",
      "Spanish league proposes Barcelona and Villarreal play regular-season game in Miami"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.813,
      "consensus": 0.897,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.717,
    "summary": "The Spanish football federation has approved Villarreal and Barcelona's La Liga match to be played in Miami on December 20. This decision marks a significant step towards hosting the first-ever official La Liga game in the United States, potentially setting a historic milestone for Spanish football.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 48 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Exclusive: GitHub CEO to step down - Axios",
    "domain": "technology",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Mon, 11 Aug 2025 18:07:32 GMT",
    "source": "Axios",
    "sources": [
      "Ars Technica",
      "Axios",
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com",
      "news.google.com",
      "arstechnica.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMibEFVX3lxTE1EeklEczZkc1JFa1BWRjZGbmF5ZG1QbGFHWDJEQkxWWTQ3MVpxeDluMnFFbVE3b2dtcHJFaXZUUUE3d3VoUWRtMXdIUEtjVXBlbmJEN21WX2pVa180QU1ydkQyS0NoTFN5bzJDcA?oc=5\" target=\"_blank\">Exclusive: GitHub CEO to step down</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Axios</fo",
      "The move comes as GitHub is facing growing competition from companies like Google and Cursor over AI tools for programmers.",
      "Microsoft bought GitHub for $7.5 billion in 2018."
    ],
    "image_url": "",
    "titles": [
      "Exclusive: GitHub CEO to step down - Axios",
      "GitHub CEO to step down",
      "GitHub will be folded into Microsoft proper as CEO steps down"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.806,
      "consensus": 0.897,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.715,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 7 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Paramount Secures Exclusive Rights to UFC Broadcasts in $7.7B Deal",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Mon, 11 Aug 2025 15:50:50 GMT",
    "source": "Axios",
    "sources": [
      "Forbes",
      "CNBC",
      "Axios"
    ],
    "domains": [
      "www.forbes.com",
      "news.google.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMie0FVX3lxTE5hR3hXUnpTRnJhVTRWTFhmRURjT0VPM1JabUNaYkZRako4ZVFEZkV1YVRlRGhoc0JWUmxVdVRFLXZmSjR1Z0dBWnpHTUg1aHRSd0VWNVdFR01SX0stYWoxT0hNOXFBNmNPQnRfTHREMl84cEtRVEE3V0YtSQ?oc=5\" target=\"_blank\">UFC, Paramount strike new deal for $7.7 billion over 7 years<",
      "The Paramount deal will eliminate the pay-per-view model used by ESPN in its current UFC deal, making all events available for no extra charge on Paramount+.",
      "UFC's CEO reveals why he wanted David Ellison's muscle behind his MMA giant, why pay-per-view events no longer work, and what a potential UFC fight at the White House would look like on CBS."
    ],
    "image_url": "",
    "titles": [
      "UFC, Paramount strike new deal for $7.7 billion over 7 years - Axios",
      "Paramount buys UFC rights in $7.7 billion, 7-year deal in first major move post-Skydance merger",
      "Dana White On How UFC Landed Its Blockbuster $7.7 Billion Streaming Deal With Paramount"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.769,
      "consensus": 0.897,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.708,
    "summary": "Paramount has entered a seven-year, $7.7 billion agreement to become the exclusive U.S. broadcaster of Ultimate Fighting Championship (UFC) events, starting in 2026. This deal, the first major agreement following Paramount's merger with Skydance, will see UFC events move from ESPN to Paramount+, eliminating the current pay-per-view model and making all events available at no additional cost to subscribers.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 65 tokens",
    "image": {
      "src": "icons/briefcase.svg",
      "thumbnail": "icons/briefcase.svg",
      "alt": "business",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Ty Simpson Named Alabama's Starting QB for 2025 Season",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 11 Aug 2025 21:47:58 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "Alabama players were informed that Ty Simpson would be the team's starting quarterback on Monday, sources said.",
      "The redshirt junior has won the quarterback competition in Tuscaloosa for the first time in his career"
    ],
    "image_url": "",
    "titles": [
      "Sources: Alabama names Simpson starting QB",
      "Alabama expected to name Ty Simpson starting QB: Veteran earns long-awaited chance to run Crimson Tide offense"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.966,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.684,
    "summary": "Ty Simpson has been officially named Alabama's starting quarterback for the 2025 season, winning the position for the first time in his career. After a competitive process, Head Coach Kalen DeBoer announced the decision, choosing Simpson over Austin Mack and Keelon Russe. The Alabama football team was informed of Simpson's new role on Monday, Aug. 11, ahead of their game against FSU.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 64 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "NFL Rookies, Free Agents Shine in Preseason Debut",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 11 Aug 2025 20:55:06 EST",
    "source": "ESPN",
    "sources": [
      "Sports Illustrated",
      "ESPN"
    ],
    "domains": [
      "news.google.com",
      "www.espn.com"
    ],
    "snippets": [
      "How did rookies and top free agent acquisitions fare in the NFL's first full preseason week?",
      "<a href=\"https://news.google.com/rss/articles/CBMimwFBVV95cUxQdWNMelNPY3k5dUJudjNtd2NvemQyVFI0ZXBzMkhWTnprMWs4THdfVWtRQ182eXMxLTV0UDZIMEdLWDZfZnpmS0dvZmluWF8wTzlKbUZDZFVXWndqaXZLRFNOSG5RdG9URmM0Vk9tWkZ3OUNzM1dMd0k1Q0NMWmxDdzFvVWEzbVRiUlB0U29mbjNSeHVZUG1ia2c4NA?oc=5\" target=\"_blank\">How Tyler Shough’"
    ],
    "image_url": "",
    "titles": [
      "NFL preseason Week 1 takeaways: Tyler Shough's debut a mixed bag for Saints",
      "How Tyler Shough’s Performance in Preseason Debut Impacts Saints QB Battle - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.948,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.68,
    "summary": "In the NFL's first full preseason week, rookies and top free agent acquisitions showcased their talents, with varying degrees of success. Specific performances, such as that of Tyler Shough, were highlighted, indicating a focus on individual achievements and potential impacts on their teams. The overall assessment of these players' performances provides insights into their readiness for the regular season and their potential contribution to their teams' successes.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 68 tokens",
    "image": {
      "src": "icons/football.svg",
      "thumbnail": "icons/football.svg",
      "alt": "nfl",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Ottawa Senators Secure Land for New Downtown Arena at LeBreton Flats",
    "domain": "sports",
    "source_domain": "www.sportsnet.ca",
    "location": "national",
    "published": "Mon, 11 Aug 2025 19:51:38 EDT",
    "source": "Sportsnet",
    "sources": [
      "CityNews",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "<p>A new downtown arena for the Ottawa Senators has sometimes seemed like a more distant hope than a Stanley Cup. On Monday, one of those dreams took a leap forward. </p>",
      "OTTAWA — The Ottawa Senators are one step closer to having a new arena in the city&#8217;s downtown core. The Senators and the National Capital Commission have agreed on the sale of 4.5 hectares (11 acres) of land at LeBreton Flats for the project. The agreement of purchase and sale with Capital Spo"
    ],
    "image_url": "https://www.sportsnet.ca/wp-content/uploads/2025/08/lebreton-flats.jpg",
    "titles": [
      "Senators’ land purchase in LeBreton Flats gives optimism for downtown arena",
      "Ottawa Senators, NCC finalize land deal for new arena at LeBreton Flats"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.928,
      "consensus": 0.682,
      "constructiveness": 0.123,
      "proximity": 0.5
    },
    "score": 0.67,
    "summary": "The Ottawa Senators have made significant progress toward building a new arena in Ottawa's downtown area by agreeing with the National Capital Commission on the purchase of 4.5 hectares (11 acres) of land at LeBreton Flats. This development moves the team closer to realizing the long-discussed project, marking a key milestone in the efforts to secure a new venue for the team.",
    "constructiveness_score": 0.123,
    "constructiveness_reason": "2 constructive keywords out of 65 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Astros Beat Red Sox 7-6, Urías and McCormick Shine",
    "domain": "sports",
    "source_domain": "sports.yahoo.com",
    "location": "national",
    "published": "Tue, 12 Aug 2025 03:06:18 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Sportsnet",
      "Yahoo Sports"
    ],
    "domains": [
      "sports.yahoo.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Ramón Urías had three hits with a two-run homer and Chas McCormick hit his first homer this season as the Houston Astros built a big lead and held on for a 7-6 win over the Boston Red Sox on Monday night.  Carlos Correa hit an RBI single to help the Astros to the victory after they were swept in Bos",
      "<p>Ramón Urías had three hits with a two-run homer and Chas McCormick hit his first homer this season as the Houston Astros built a big lead and held on for a 7-6 win over the Boston Red Sox on Monday night.</p>"
    ],
    "image_url": "",
    "titles": [
      "Astros hold off Red Sox rally for 7-6 win, Urías and McCormick homer",
      "Astros hold off Red Sox in Bregman’s return to Houston"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.992,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.664,
    "summary": "The Houston Astros secured a 7-6 victory over the Boston Red Sox, with notable performances from Ramón Urías, who had three hits including a two-run homer, and Chas McCormick, who hit his first homer of the season. Carlos Correa also contributed with an RBI single. This win comes after the Astros were previously swept by the Red Sox.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 60 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Apple Integrates ChatGPT Amid Musk's Antitrust Criticism",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Tue, 12 Aug 2025 03:22:03 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Business Insider"
    ],
    "domains": [
      "www.businessinsider.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "Apple has tied up with OpenAI to integrate ChatGPT into its iPhone, iPad and Mac laptop and desktop products.",
      "Musk said in an X post that Apple's actions were an \"unequivocal antitrust violation.\""
    ],
    "image_url": "",
    "titles": [
      "Musk threatens 'immediate' legal action against Apple over alleged antitrust violations",
      "Elon Musk is threatening to sue Apple for what he says are antitrust violations related to Grok's rankings"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.977,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.661,
    "summary": "Apple has partnered with OpenAI to incorporate ChatGPT into its iPhone, iPad, and Mac devices. Elon Musk criticized Apple, alleging it committed an \"unequivocal antitrust violation.\" The outcome of this situation is ongoing, with Apple's integration of ChatGPT being the current focus.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 43 tokens",
    "image": {
      "src": "icons/briefcase.svg",
      "thumbnail": "icons/briefcase.svg",
      "alt": "business",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Detroit Lions' Norris Back, Enters Concussion Protocol After Injury",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Mon, 11 Aug 2025 23:36:07 +0000",
    "source": "CBS Sports",
    "sources": [
      "Sportsnet",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "The team plans to ease Norris back into football activities",
      "<p>Detroit Lions safety Morice Norris, who was taken off the field in an ambulance late in a pre-season game last week, is in concussion protocol and doing well, coach Dan Campbell said Monday.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/08/10/5fa947d2-998e-48bf-a595-d3c5ab4a8ede/norris.jpg",
    "titles": [
      "Morice Norris injury: Lions safety in concussion protocol but 'doing well' after scary hit vs. Falcons",
      "Lions’ Norris, who left game in ambulance, in concussion protocol"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.923,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.65,
    "summary": "Detroit Lions safety Morice Norris, who suffered a serious injury during a preseason game and was taken off the field in an ambulance, is now back with the team and has entered concussion protocol. According to Coach Dan Campbell, Norris is \"doing well\" following the incident.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 46 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Trump Meets Intel CEO to Discuss Chip Manufacturing Woes",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Mon, 11 Aug 2025 22:11:59 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Financial Times"
    ],
    "domains": [
      "www.ft.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "President Trump said Monday that he met with Intel CEO Lip-Bu Tan, days after calling on the chipmaker to resign.",
      "Lip-Bu Tan to offer ‘suggestions’ on how government can work with group as it struggles with chip manufacturing"
    ],
    "image_url": "",
    "titles": [
      "Trump flip-flops on Intel CEO, calls him 'success' days after demanding resignation",
      "Trump softens stance on Intel boss after demanding resignation"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.878,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.648,
    "summary": "President Trump met with Intel CEO Lip-Bu Tan to discuss the company's struggles in chip manufacturing. During the meeting, Tan offered suggestions on how the government could assist the industry. This comes shortly after Trump publicly called for Tan's resignation.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 43 tokens",
    "image": {
      "src": "icons/cpu.svg",
      "thumbnail": "icons/cpu.svg",
      "alt": "chip",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Dolphins' Mattison Out for Season, Team Signs Replacement RB",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Mon, 11 Aug 2025 22:48:43 +0000",
    "source": "CBS Sports",
    "sources": [
      "Sports Illustrated",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "news.google.com"
    ],
    "snippets": [
      "Miami's running back suffered a season-ending injury in the first preseason game",
      "<a href=\"https://news.google.com/rss/articles/CBMijgFBVV95cUxPcHJ0X0NsenlmUlFid3lab3pDbU5LT2FST3pDSHNlVFBJUHFqYTJSQ1FwOEdJbzFMVFk3NFRMeXJHSTQwN0JaTklQYmRXNlVibnM1b3Q0cmJoeVcwU2xRYVlKazhxaDFpSnhxZFJVNjZEMWlMUkZDSC1ZR1ZfWVdmZ0FlRGVZVE9DelBtOEpR?oc=5\" target=\"_blank\">Dolphins Lose RB Alexander Mattison"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/08/11/b0b21f66-49fe-4b5e-8436-80ba5ebb978c/mattison.jpg",
    "titles": [
      "Dolphins RB Alexander Mattison placed on season-ending injured reserve after neck surgery",
      "Dolphins Lose RB Alexander Mattison for 2025 After He Suffered Preseason Neck Injury - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.908,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.647,
    "summary": "Miami Dolphins' running back Alexander Mattison suffered a season-ending injury during the team's first preseason game. As a result, the Dolphins have found a new running back to replace him. The team is making adjustments to cope with the loss as they prepare for the upcoming season.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 49 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Revel shutters rideshare business, pivots to EV charging",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-08-11T15:04:26-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge",
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com",
      "www.theverge.com"
    ],
    "snippets": [
      "Revel is shutting down its ridehail business, citing heightened competition from rideshare leaders like Uber and Lyft. The company, which began as an electric moped business before shifting to rideshare, plans to pivot to electric vehicle charging. “At the end of the day, rideshare is a very competi",
      "Revel has abandoned its small Uber and Lyft competitor four years after it started, and is looking to sell or return its bright-blue Tesla and Kia EVs."
    ],
    "image_url": "",
    "titles": [
      "Revel shutters rideshare business, pivots to EV charging",
      "Revel shuts down its ride-hail business to focus on EV charging"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.84,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.634,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 8 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "ESPN and Fox Launch Bundled Streaming in October, Offering $10 Monthly Savings",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Mon, 11 Aug 2025 18:36:28 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Fortune"
    ],
    "domains": [
      "fortune.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "ESPN and Fox will offer their upcoming direct-to-consumer streaming services as a bundle beginning in October.",
      "You can save $10 a month by signing up for this bundle, instead of ESPN’s and Fox’s separate stand-alone services, debuting in August."
    ],
    "image_url": "",
    "titles": [
      "ESPN, Fox to bundle upcoming streaming services for $39.99 a month",
      "Disney adds to sports streaming war chest with ESPN/Fox bundle priced at $39.99 per month"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.814,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.628,
    "summary": "Starting in October, ESPN and Fox will provide a bundled direct-to-consumer streaming service. This bundle will allow subscribers to save $10 monthly compared to signing up for the separate stand-alone services, which are set to launch in August.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 41 tokens",
    "image": {
      "src": "icons/briefcase.svg",
      "thumbnail": "icons/briefcase.svg",
      "alt": "business",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "NASA's Lunar Trailblazer Mission Lost After Launch",
    "domain": "science",
    "source_domain": "www.sciencedaily.com",
    "location": "global",
    "published": "Mon, 11 Aug 2025 10:57:49 EDT",
    "source": "ScienceDaily",
    "sources": [
      "SciTechDaily",
      "ScienceDaily"
    ],
    "domains": [
      "www.sciencedaily.com",
      "scitechdaily.com"
    ],
    "snippets": [
      "NASA’s Lunar Trailblazer, a mission designed to create high-resolution maps of water on the Moon, ended after losing contact with the spacecraft just one day after its February 26 launch. Despite extensive global efforts to reestablish communication, the small satellite’s misaligned solar arrays pre",
      "<a href=\"https://scitechdaily.com/nasas-lunar-trailblazer-moon-mission-lost-just-a-day-after-launch/\" rel=\"nofollow\" title=\"NASA’s Lunar Trailblazer Moon Mission Lost Just a Day After Launch\"><img alt=\"NASA Lunar Trailblazer in Orbit\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"437\" src=\"ht"
    ],
    "image_url": "",
    "titles": [
      "How NASA’s Lunar Trailblazer was lost before reaching the Moon",
      "NASA’s Lunar Trailblazer Moon Mission Lost Just a Day After Launch"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.771,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.627,
    "summary": "NASA's Lunar Trailblazer mission, aimed at mapping water on the Moon, was declared lost a day after its launch. Despite initial success, contact with the spacecraft was unexpectedly lost, and recovery efforts have since failed, marking an early end to the mission.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 43 tokens",
    "image": {
      "src": "icons/telescope.svg",
      "thumbnail": "icons/telescope.svg",
      "alt": "nasa",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Reddit will block the Internet Archive",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-08-11T13:00:00-04:00",
    "source": "The Verge",
    "sources": [
      "Ars Technica",
      "The Verge"
    ],
    "domains": [
      "www.theverge.com",
      "arstechnica.com"
    ],
    "snippets": [
      "Reddit says that it has caught AI companies scraping its data from the Internet Archive’s Wayback Machine, so it’s going to start blocking the Internet Archive from indexing the vast majority of Reddit. The Wayback Machine will no longer be able to crawl post detail pages, comments, or profiles; ins",
      "The Internet Archive confirmed it's in ongoing discussions with Reddit after block."
    ],
    "image_url": "",
    "titles": [
      "Reddit will block the Internet Archive",
      "Reddit blocks Internet Archive to end sneaky AI scraping"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.804,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.626,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 6 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Lee Jae Myung to Meet Trump in Washington for Trade, Defense Talks",
    "domain": "business",
    "source_domain": "financialpost.com",
    "location": "national",
    "published": "Tue, 12 Aug 2025 02:52:40 +0000",
    "source": "Financial Post",
    "sources": [
      "Financial Post"
    ],
    "domains": [
      "financialpost.com"
    ],
    "snippets": [
      "SEOUL, South Korea (AP) &#8212; South Korea&#8217;s new President Lee Jae Myung will travel to Washington later this month to meet with U.S. President Donald Trump, Lee&#8217;s office said Tuesday, for talks on trade and defense cooperation in the face of nuclear-armed North Korea and other threats."
    ],
    "image_url": "",
    "titles": [
      "South Korean President Lee will travel to Washington for Aug. 25 meeting with Trump"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.988,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.518,
    "summary": "South Korea's President Lee Jae Myung is set to meet U.S. President Donald Trump in Washington later this month, as announced by Lee's office. The talks will focus on trade and defense cooperation, addressing concerns over North Korea's nuclear capabilities and other threats.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 47 tokens",
    "image": {
      "src": "icons/briefcase.svg",
      "thumbnail": "icons/briefcase.svg",
      "alt": "business",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Day 1,265: Ongoing Conflict in Ukraine with Military and Civilian Impacts",
    "domain": "business",
    "source_domain": "www.forbes.com",
    "location": "global",
    "published": "Mon, 11 Aug 2025 21:50:38 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes"
    ],
    "domains": [
      "www.forbes.com"
    ],
    "snippets": [
      "Dispatches from Ukraine. Day 1,265."
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/689a9d15050fa8aa26619993/0x0.jpg?width=960",
    "titles": [
      "Monday, August 11. Russia’s War On Ukraine: News And Information From Ukraine"
    ],
    "score_components": {
      "magnitude": 0.44,
      "recency": 0.967,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.496,
    "summary": "As of day 1,265 of the conflict, detailed updates from Ukraine continue to be reported. The situation remains dynamic, with ongoing military and civilian impacts. Specific events or outcomes from this particular day were not provided, indicating the conflict's persistent and evolving nature.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 45 tokens",
    "image": {
      "src": "icons/ukraine.svg",
      "thumbnail": "icons/ukraine.svg",
      "alt": "ukraine flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Mineros Buys 80% More of La Pepa Project for $40M, Boosts Gold Holdings",
    "domain": "business",
    "source_domain": "financialpost.com",
    "location": "national",
    "published": "Tue, 12 Aug 2025 01:04:45 +0000",
    "source": "Financial Post",
    "sources": [
      "Financial Post"
    ],
    "domains": [
      "financialpost.com"
    ],
    "snippets": [
      "$40 million for 80% of the La Pepa Project that Mineros does not already own Estimated Mineral Resources at the La Pepa Project, effective October 31, 2021: Measured Mineral Resources: 58,816 thousand tonnes (kt) averaging 0.61 g/t Au, containing 1,150 thousand ounces (koz) Au. Indicated Mineral Res"
    ],
    "image_url": "",
    "titles": [
      "Mineros S.A. Acquires 80% of La Pepa from Pan American to Own 100%"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.951,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.478,
    "summary": "Mineros has agreed to purchase an additional 80% stake in the La Pepa Project for $40 million, adding to its existing holdings. As of October 31, 2021, the La Pepa Project's estimated mineral resources include 58,816 thousand tonnes of measured resources with an average of 0.61 g/t Au, totaling 1,150 thousand ounces of gold.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 59 tokens",
    "image": {
      "src": "icons/briefcase.svg",
      "thumbnail": "icons/briefcase.svg",
      "alt": "business",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Seoul-based Datumo raises $15.5M to take on Scale AI, backed by Salesforce",
    "domain": "technology",
    "source_domain": "techcrunch.com",
    "location": "global",
    "published": "Mon, 11 Aug 2025 23:00:00 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com"
    ],
    "snippets": [
      "Datumo began as an AI data labeling company and now wants to help businesses build safer AI with tools and data that enable testing, monitoring, and improving their models — without requiring technical expertise."
    ],
    "image_url": "",
    "titles": [
      "Seoul-based Datumo raises $15.5M to take on Scale AI, backed by Salesforce"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.911,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.477,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 14 tokens",
    "image": {
      "src": "icons/robot.svg",
      "thumbnail": "icons/robot.svg",
      "alt": "ai",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Pronto’s 10-minute house help pitch sparked a 3.6x valuation jump in just 90 days",
    "domain": "technology",
    "source_domain": "techcrunch.com",
    "location": "global",
    "published": "Tue, 12 Aug 2025 00:30:00 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com"
    ],
    "snippets": [
      "Pronto has raised $11 million in an all-equity Series A round co-led by General Catalyst and Glade Brook Capital at a post-money valuation of $45 million."
    ],
    "image_url": "",
    "titles": [
      "Pronto’s 10-minute house help pitch sparked a 3.6x valuation jump in just 90 days"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.94,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.476,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 17 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "US Movement to Introduce Chaplains in Public Schools",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Mon, 11 Aug 2025 15:29:26 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "phys.org"
    ],
    "snippets": [
      "There is an ongoing push to make chaplains available in public schools across the United States. Chaplains, also called spiritual caregivers, are religious professionals who work in secular institutions and can be of any tradition or none at all."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2022/chaplain.jpg",
    "titles": [
      "Schools are looking for chaplains, but the understanding of who and what chaplains are varies widely"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.847,
      "consensus": 0.393,
      "constructiveness": 0.103,
      "proximity": 0.5
    },
    "score": 0.475,
    "summary": "There is a movement in the United States to introduce chaplains, or spiritual caregivers, into public schools. These professionals, who may belong to any religious tradition or none, aim to work within these secular institutions to provide spiritual support.",
    "constructiveness_score": 0.103,
    "constructiveness_reason": "1 constructive keywords out of 39 tokens",
    "image": {
      "src": "icons/beaker.svg",
      "thumbnail": "icons/beaker.svg",
      "alt": "science",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "High-severity WinRAR 0-day exploited for weeks by 2 groups",
    "domain": "technology",
    "source_domain": "arstechnica.com",
    "location": "global",
    "published": "Tue, 12 Aug 2025 00:13:14 +0000",
    "source": "Ars Technica",
    "sources": [
      "Ars Technica"
    ],
    "domains": [
      "arstechnica.com"
    ],
    "snippets": [
      "Exploits allow for persistent backdooring when targets open booby-trapped archive."
    ],
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/05/malware-threat-1000x648.jpg",
    "titles": [
      "High-severity WinRAR 0-day exploited for weeks by 2 groups"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.935,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.475,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 11 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Canadian Firm Experiments with Mining Waste for CO2 Capture",
    "domain": "science",
    "source_domain": "www.newscientist.com",
    "location": "global",
    "published": "Mon, 11 Aug 2025 22:04:44 +0100",
    "source": "New Scientist",
    "sources": [
      "New Scientist"
    ],
    "domains": [
      "www.newscientist.com"
    ],
    "snippets": [
      "A carbon dioxide removal company in Canada is experimenting with ways to treat mining waste to capture and store more CO2"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/08/11202206/SEI_261841944.jpg",
    "titles": [
      "Microwaving rocks could help mining operations pull CO2 out of the air"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.875,
      "consensus": 0.393,
      "constructiveness": 0.073,
      "proximity": 0.5
    },
    "score": 0.471,
    "summary": "A Canadian carbon dioxide removal company is conducting experiments on treating mining waste to enhance CO2 capture and storage. This initiative aims to reduce atmospheric carbon levels by leveraging the byproducts of mining operations. The current status of this innovative approach is in the experimental phase, focusing on practical applications and effectiveness in carbon sequestration.",
    "constructiveness_score": 0.073,
    "constructiveness_reason": "1 constructive keywords out of 55 tokens",
    "image": {
      "src": "icons/canada.svg",
      "thumbnail": "icons/canada.svg",
      "alt": "canadian flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Ancient Coins Reveal Long-Distance Trade in Southeast Asia",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Mon, 11 Aug 2025 19:00:01 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "phys.org"
    ],
    "snippets": [
      "Archaeologists have analyzed more than 200 coins from the first millennium AD mainland Southeast Asia, revealing long-distance economic connections across the region which facilitated extensive trade and cultural interaction."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/ancient-rising-sun-coi.jpg",
    "titles": [
      "Ancient 'Rising Sun' coins show connections from Bangladesh to Vietnam"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.911,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.47,
    "summary": "Archaeologists studying over 200 coins from the first millennium AD in mainland Southeast Asia have discovered evidence of long-distance economic connections. This finding indicates that extensive trade and cultural interactions were facilitated across the region during this period.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 39 tokens",
    "image": {
      "src": "icons/beaker.svg",
      "thumbnail": "icons/beaker.svg",
      "alt": "science",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "NASA Partners with Firms to Boost Spacecraft Orbit Technology",
    "domain": "science",
    "source_domain": "www.nasa.gov",
    "location": "global",
    "published": "Mon, 11 Aug 2025 19:55:09 +0000",
    "source": "NASA",
    "sources": [
      "NASA"
    ],
    "domains": [
      "www.nasa.gov"
    ],
    "snippets": [
      "To drive the development of key space-based capabilities for the United States, NASA is exploring an opportunity to demonstrate technology to raise a spacecraft&#8217;s orbit to a higher altitude. Two American companies – Cambrian Works of Reston, Virginia, and Katalyst Space Technologies of Flagsta"
    ],
    "image_url": "",
    "titles": [
      "NASA Explores Industry Possibilities to Raise Swift Mission’s Orbit"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.854,
      "consensus": 0.393,
      "constructiveness": 0.098,
      "proximity": 0.5
    },
    "score": 0.469,
    "summary": "NASA is advancing U.S. space capabilities by testing technology to elevate spacecraft orbits, partnering with Cambrian Works from Reston, Virginia, and Katalyst Space Technologies from Flagstaff. This initiative aims to enhance the operational range and efficiency of future space missions.",
    "constructiveness_score": 0.098,
    "constructiveness_reason": "1 constructive keywords out of 41 tokens",
    "image": {
      "src": "icons/telescope.svg",
      "thumbnail": "icons/telescope.svg",
      "alt": "nasa",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "The GPT-5 rollout has been a big mess",
    "domain": "technology",
    "source_domain": "arstechnica.com",
    "location": "global",
    "published": "Mon, 11 Aug 2025 22:25:34 +0000",
    "source": "Ars Technica",
    "sources": [
      "Ars Technica"
    ],
    "domains": [
      "arstechnica.com"
    ],
    "snippets": [
      "OpenAI faces backlash as users complain about broken workflows and losing AI friends."
    ],
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2024/09/openai_tectonic_shift_3-1152x648.jpg",
    "titles": [
      "The GPT-5 rollout has been a big mess"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.9,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.468,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 9 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Morning Routine Unfolds at Charles de Gaulle Airport Terminal 2E",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Mon, 11 Aug 2025 16:02:41 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "phys.org"
    ],
    "snippets": [
      "It is 7.30am at Terminal 2E at Charles de Gaulle airport near Paris, and in the line leading to the security gates, an executive is removing his belt with a mechanical gesture, a mother is taking baby bottles out of her bag, and a tourist is sighing as he unties his shoes. Everyone is moving forward"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2024/tying-shoes.jpg",
    "titles": [
      "Why do we agree to take off our shoes at the airport?"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.857,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.467,
    "summary": "At 7:30 am at Charles de Gaulle airport's Terminal 2E, passengers, including an executive, a mother, and a tourist, are preparing for security checks by removing belts, taking baby bottles out of bags, and untying shoes, respectively. The scene depicts a typical morning at the airport as travelers comply with security protocols.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 54 tokens",
    "image": {
      "src": "icons/beaker.svg",
      "thumbnail": "icons/beaker.svg",
      "alt": "science",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Study Shows Long-Term Impact of Offensive Ads on Discriminated Groups",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Mon, 11 Aug 2025 15:37:04 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "phys.org"
    ],
    "snippets": [
      "Time plays a key role in consumer behavior, especially concerning the purchasing patterns of vulnerable groups in society who have been ridiculed in offensive and discriminatory ads. Ben-Gurion University researcher Dr. Enav Friedmann examined the long-term reactions of consumers from discriminated "
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2022/advertising-2.jpg",
    "titles": [
      "Discriminatory ads can paradoxically increase brand preference among targeted groups"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.849,
      "consensus": 0.393,
      "constructiveness": 0.066,
      "proximity": 0.5
    },
    "score": 0.465,
    "summary": "Dr. Enav Friedmann from Ben-Gurion University conducted a study on the long-term consumer reactions of discriminated groups to offensive ads. The research highlights the significant impact of time on purchasing patterns among these vulnerable groups, revealing that such ads can deeply affect consumer behavior. This study underscores the importance of understanding the consequences of discriminatory advertising on affected communities.",
    "constructiveness_score": 0.066,
    "constructiveness_reason": "1 constructive keywords out of 61 tokens",
    "image": {
      "src": "icons/beaker.svg",
      "thumbnail": "icons/beaker.svg",
      "alt": "science",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Water Deemed Essential for Life Beyond Earth in Habitability Studies",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Mon, 11 Aug 2025 15:43:04 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "phys.org"
    ],
    "snippets": [
      "Water is essential for life on Earth. So, the liquid must be a requirement for life in other worlds. For decades, scientists' definition of habitability on other planets has rested on this assumption."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/planets-without-water.jpg",
    "titles": [
      "Planets without water could still produce certain liquids, a new study finds"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.851,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.458,
    "summary": "Scientists have long believed that water is crucial for life on Earth and likely a requirement for life on other planets. This assumption has guided the definition of habitability on other worlds for many years.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 35 tokens",
    "image": {
      "src": "icons/beaker.svg",
      "thumbnail": "icons/beaker.svg",
      "alt": "science",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  }
]