[
  {
    "title": "Moldova's Pro-European Party Wins Majority, Eyes Closer EU Ties",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Mon, 29 Sep 2025 05:41:54 -0400",
    "source": "NPR",
    "sources": [
      "Washington Post",
      "Deutsche Welle",
      "Al Jazeera",
      "BBC",
      "NPR",
      "The Guardian"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.bbc.com",
      "www.dw.com",
      "www.theguardian.com",
      "www.washingtonpost.com",
      "www.npr.org"
    ],
    "snippets": [
      "Moldova's pro-Western governing party won a clear parliamentary majority, defeating pro-Russian groups in an election that was widely viewed as a stark choice between East and West.",
      "The election was seen as critical for Moldova's EU path, and President Maia Sandu warned the country's future was in danger.",
      "The governing party decisively victorious in parliamentary election widely viewed as a choice between Europe and Russia.",
      "Moldovans voted in a high-stakes election to decide whether the country moves closer to the European Union or Russia. The defeated pro-Russian party has called for a protest against the results. Follow DW for more.",
      "<p>PAS garners 50.03% of vote after more than 99.5% of ballots counted in poll deciding whether country steers closer to EU or Russia</p><p>Moldova’s ruling pro-European party has retained its parliamentary majority after Sunday’s pivotal election, seen as a test of the president’s push to keep the ",
      "The results brought a sign of relief for the European Union, as Moldova showed firm public support for the ruling party’s pro-Europe course."
    ],
    "image_url": "",
    "titles": [
      "Moldova's pro-EU party wins clear parliamentary majority, defeating pro-Russian groups",
      "Moldova's pro-EU party wins vote mired in claims of Russian interference",
      "Moldova’s pro-EU party wins election hit by Russian interference claims",
      "Moldova: Ruling pro-EU party wins election",
      "Moldova’s pro-European party retains majority in key election",
      "In defeat for Russia, pro-E.U. party wins Moldovan parliamentary majority"
    ],
    "score_components": {
      "magnitude": 0.986,
      "recency": 0.95,
      "consensus": 1.0,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.87,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Moldova's pro-European governing party won a parliamentary majority in a critical election, defeating pro-Russian factions. The victory is seen as a pivotal moment for Moldova's future direction, with the country expressing strong support for closer ties with the European Union. President Maia Sandu hailed the outcome as crucial for Moldova's EU path. The election, marking a significant choice between aligning with Europe or Russia, concluded with over 50% of votes for the pro-European party. The defeated pro-Russian party has called for protests against the results.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Bad Bunny to Headline 2026 Super Bowl Halftime Show",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 29 Sep 2025 08:33:30 GMT",
    "source": "BBC",
    "sources": [
      "Forbes",
      "CBS Sports",
      "Axios",
      "BBC",
      "Sky Sports",
      "The Guardian"
    ],
    "domains": [
      "www.bbc.com",
      "www.theguardian.com",
      "www.cbssports.com",
      "www.skysports.com",
      "www.forbes.com",
      "news.google.com"
    ],
    "snippets": [
      "The Puerto Rican pop star has otherwise avoided the US on his forthcoming world tour because of ICE.",
      "<a href=\"https://news.google.com/rss/articles/CBMigwFBVV95cUxOWTA4MnZGLTNwMVViRVhST3dHWG5xQmJ6UFVpTklSbFBxSy1rMGctY1Nlb2pIdGpRSnpyTld1SEhLUVFPNlR4NFBEWlhzNExvRUh2TDRCNkhNanhOWTdEc1R0bUVNWDdsNWdZM2I1aWFzMFZENUVZMlJMVlFkRl9tbE92VQ?oc=5\" target=\"_blank\">Bad Bunny to headline Super Bowl halftime show in",
      "Bad Bunny, a three-time Grammy Award winner, is the most-streamed artist in the world",
      "Check out the list of artists who've taken the stage in the history of the iconic event",
      "<p>Latin trap and reggaeton artist to lead NFL half-time celebration on 8 February, following Kendrick Lamar’s record-breaking 2025 show</p><p>Bad Bunny will headline the NFL’s biggest stage next year: the Super Bowl half-time show in northern California.</p><p>The NFL, Apple Music and Roc Nation an",
      "Get to know who is Bad Bunny before he performs at the NFL's 2026 Super Bowl LX Halftime Show that could mark a politically charged moment.",
      "Puerto Rican reggaeton star Bad Bunny will headline next year's Super Bowl half-time show in Santa Clara, California, the NFL has announced."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/3e26/live/5555a220-9d08-11f0-92db-77261a15b9d2.jpg",
    "titles": [
      "Bad Bunny revealed as Super Bowl half-time show performer",
      "Bad Bunny to headline Super Bowl halftime show in 2026 - Axios",
      "Bad Bunny selected to perform during 2026 Super Bowl LX halftime show",
      "Full list of every Super Bowl halftime performer in history: Bad Bunny to headline show in 2026",
      "Puerto Rican superstar Bad Bunny to headline 2026 Super Bowl half-time show",
      "Bad Bunny To Play 2026 Super Bowl LX Halftime Show: All The Details",
      "Bad Bunny to headline 2026 Super Bowl half-time show"
    ],
    "score_components": {
      "magnitude": 0.986,
      "recency": 0.909,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.827,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Puerto Rican artist Bad Bunny, a three-time Grammy winner and the world's most-streamed artist, is set to headline the Apple Music Super Bowl Halftime Show at Levi's Stadium in Santa Clara, California, on Feb. 8. His performance at the 2026 Super Bowl LX could be a significant, potentially politically charged event.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Chris Woakes Retires from International Cricket After 15-Year Career",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 29 Sep 2025 11:44:51 GMT",
    "source": "BBC",
    "sources": [
      "Sky Sports",
      "BBC",
      "Yahoo Sports",
      "The Guardian"
    ],
    "domains": [
      "www.bbc.com",
      "sports.yahoo.com",
      "www.theguardian.com",
      "www.skysports.com",
      "www.independent.co.uk"
    ],
    "snippets": [
      "England all-rounder Chris Woakes says \"the moment has come\" for him to retire from international cricket.",
      "England fast bowler Chris Woakes announced his immediate retirement from international cricket on Monday after 62 test matches and World Cup wins in the ODI and Twenty20 formats.  The 36-year-old Woakes was left out of England squad for the upcoming Ashes series Down Under after failing to fully rec",
      "England all-rounder Chris Woakes says &quot;the moment has come&quot; for him to retire from international cricket.",
      "The England all-rounder has retired from Three Lions duty with immediate effect",
      "<ul><li><p>‘The nicest man in cricket’ closes 15-year England career</p></li><li><p>Dislocated shoulder ruled him out of winter Ashes tour</p></li></ul><p>Chris Woakes has announced his retirement from international cricket, bringing to a close a near 15-year England career that delivered two World ",
      "England bowler Chris Woakes has announced his immediate retirement from international cricket."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/4fb4/live/a63318d0-9d26-11f0-8d30-39a07caee29f.jpg",
    "titles": [
      "England's Woakes retires from international cricket",
      "Woakes retires from international cricket for England as a double World Cup winner",
      "England's Woakes retires from international cricket",
      "Chris Woakes announces retirement from international cricket",
      "Chris Woakes retires from international cricket to end 15-year England career",
      "England bowler Woakes retires from international cricket"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.971,
      "consensus": 0.928,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.788,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "England all-rounder Chris Woakes announced his immediate retirement from international cricket, concluding a nearly 15-year career. Woakes, known as \"the nicest man in cricket,\" played 62 Test matches and was part of England's World Cup-winning teams in the ODI and Twenty20 formats. His decision comes after being left out of the England squad for the upcoming Ashes series, partly due to a dislocated shoulder.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Typhoon Bualoi Hits Vietnam: 11 Dead, 21 Missing, 250K Evacuated",
    "domain": "science",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Mon, 29 Sep 2025 07:53:59 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Phys.org",
      "Deutsche Welle",
      "New York Times"
    ],
    "domains": [
      "www.aljazeera.com",
      "phys.org",
      "www.nytimes.com",
      "www.dw.com"
    ],
    "snippets": [
      "In advance of the typhoon&#039;s landfall, the government had evacuated more than 28,500 people.",
      "Typhoon Bualoi has hit Vietnam's coast earlier than expected, causing death and extensive destruction. Residents have been warned of flash floods and landslides.",
      "At least 13 people were killed and dozens more injured in central Vietnam, where 2 million were without power. Bualoi’s deadly path had started with 10 deaths in the Philippines.",
      "Typhoon Bualoi ripped roofs from buildings and uprooted electrical poles along Vietnam's coast, killing at least 11 people, local and national officials said on Monday."
    ],
    "image_url": "",
    "titles": [
      "At least 12 dead, more missing as Typhoon Bualoi makes landfall in Vietnam",
      "Typhoon Bualoi lashes Vietnam, killing at least 13",
      "Typhoon Bualoi Slams Into Central Vietnam, Adding to Death Toll",
      "Typhoon Bualoi batters Vietnam coast, killing 11"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.915,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.772,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Typhoon Bualoi struck Vietnam's coast, causing significant damage, including deaths and destruction. It killed at least 11 people, left 21 missing, and prompted the evacuation of over 250,000 residents due to threats of flash floods, landslides, and multiple natural disasters. The storm, which began in the Philippines, damaged buildings and infrastructure in Vietnam, where recovery from a previous storm is still ongoing.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Gunman Kills 4, Injures 8 at Michigan Church; Shot Dead by Police",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Mon, 29 Sep 2025 07:11:39 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com",
      "www.npr.org"
    ],
    "snippets": [
      "The FBI is searching for answers as to why a man drove his truck into a church yesterday and opened fire. And, Trump has a new proposed plan to end the war in Gaza.",
      "The attacker drove a vehicle into the church during a service and opened fire, before being killed himself.",
      "<p>Church allegedly set ablaze by gunman on weekend when shooting attacks also took place in North Carolina, Texas and New Orleans</p><p>At least four people were killed and eight others injured after a gunman opened fire at a Mormon church in <a href=\"https://www.theguardian.com/us-news/michigan\">M"
    ],
    "image_url": "",
    "titles": [
      "The latest on the Michigan church shooting. And, Trump's new plan to end war in Gaza",
      "Death toll rises to four after Michigan church shooting and arson attack",
      "At least four dead and eight injured after shooting at Mormon church in Michigan"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.98,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.758,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A gunman attacked the Church of Jesus Christ of Latter-day Saints in Grand Blanc, Michigan, during a Sunday service, killing at least four and injuring eight others before being shot dead by police. The assailant drove into the church, opened fire on attendees, and set the building on fire. The incident, described by the FBI as an \"act of targeted violence,\" occurred amidst several other shooting attacks across the U.S.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Senators Secure 2-0 Pre-Season Win Against Devils",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sun, 28 Sep 2025 23:41:33 +0000",
    "source": "Global News",
    "sources": [
      "Sportsnet",
      "Global News",
      "Ottawa Citizen"
    ],
    "domains": [
      "globalnews.ca",
      "ottawacitizen.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Stephen Halliday scored on the power play and Olle Lycksell scored into an empty net as the Ottawa Senators defeated the New Jersey Devils 2-0 in NHL pre-season action on Sunday at the Videotron Centre.",
      "<p>Stephen Halliday scored on the power play and Olle Lycksell scored into an empty net as the Ottawa Senators defeated the New Jersey Devils 2-0 in NHL pre-season action on Sunday at the Videotron Centre.</p>",
      "Rookie centre Stephen Halliday scored the third-period winner as the Senators picked up their second victory of the pre-season"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/5ee59b15d0a74103bbd3509d2c16e975c33e42411b2fa0a44b19f3473754a80d.jpg?quality=65&strip=all",
    "titles": [
      "Ullmark nets shutout as Senators beat Devils 2-0",
      "Ullmark nets shutout as Senators beat Devils",
      "Takeaways: Linus Ullmark makes 14 stops in Ottawa Senators' victory over Devils"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.771,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.755,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Stephen Halliday and Olle Lycksell scored for the Ottawa Senators in a 2-0 win against the New Jersey Devils during an NHL pre-season game on Sunday at the Videotron Centre. Halliday's goal came in the third period on a power play, securing the Senators' second pre-season victory. Lycksell's goal was scored into an empty net.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Blue Jays Win AL East Title, Kirk Hits 2 HRs in 13-4 Victory Over Rays",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Mon, 29 Sep 2025 01:14:37 +0000",
    "source": "Global News",
    "sources": [
      "Sportsnet",
      "Global News",
      "CityNews"
    ],
    "domains": [
      "globalnews.ca",
      "ottawa.citynews.ca",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Blue Jays manager John Schneider was only 20 seconds into his post-game speech Sunday when he was drowned out by his roaring players and doused in champagne.",
      "Alejandro Kirk hit two homers and drove in six runs to power the Blue Jays to a 13-4 victory over the Tampa Bay Rays on Sunday to give Toronto its first American League East Division title since 2015.",
      "<p>For the first time in a decade, the Toronto Blue Jays are AL East champions.</p>",
      "<p>For the first time in a decade, the Toronto Blue Jays are back atop the American League East.</p>",
      "<p>Watch as John Schneider gives an impassioned speech to the Blue Jays after clinching the AL East division title before the team popped their celebratory champagne in the clubhouse.</p>",
      "<p>Toronto Blue Jays stars Alejandro Kirk, George Springer and manager John Schneider speak with Sportsnet&#8217;s Hazel Mae immediately after clinching the team&#8217;s first AL East title since 2015.</p>",
      "TORONTO – Six months of grinding to qualify for the meaningful games of the seventh are over and this&#160;Toronto Blue Jays&#160;season spent walking through a dream continues, with the chance to push back the awakening deep into October.&#160; An American League East title, the club’s first since "
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/b2296baf516a6ce31fbf6e507300f3362189c81b55f415341b8fa20bc5c636e1.jpg?quality=65&strip=all",
    "titles": [
      "Jays beat Rays to take East, earn bye to ALDS",
      "Blue Jays beat Rays 13-4, take East title",
      "Blue Jays beat Rays to clinch first AL East title since 2015",
      "‘A wagon’: Sports world reacts to Blue Jays winning AL East title",
      "Blue Jays pop champagne in locker room after clinching AL East title",
      "Blue Jays’ Schneider, Kirk and Springer speak after clinching AL East title",
      "Blue Jays beat Rays to clinch first AL East title since 2015"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.797,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.746,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Alejandro Kirk led the Toronto Blue Jays to a 13-4 win over the Tampa Bay Rays with two home runs, securing their first AL East title since 2015. The victory in their regular-season finale was highlighted by Kirk's first career grand slam. George Springer and Addison Barger also contributed with home runs. This triumph marks the team's notable return to the top of the American League East after a decade.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Phoenix Mercury Overcomes Deficit to Reach WNBA Finals",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 29 Sep 2025 02:52:30 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.cbssports.com",
      "www.espn.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "The Phoenix Mercury overcame a 13-point fourth-quarter deficit to defeat the short-handed Minnesota Lynx 86-81 in Game 4 on Sunday to advance to the WNBA Finals for the first time since 2021, and in that round, they'll take on Indiana or Las Vegas.",
      "Alyssa Thomas had 23 points, 10 assists and 8 rebounds",
      "Phoenix punched its ticket to the WNBA Finals on Sunday",
      "<p>Alyssa Thomas scored 23 points, DeWanna Bonner made two key 3-pointers in the fourth quarter and the Phoenix Mercury overcame a 13-point deficit in the final period to beat the short-handed Minnesota Lynx 86-81 in Game 4 on Sunday night and advance to the WNBA Finals for the first time since 2021"
    ],
    "image_url": "",
    "titles": [
      "Mercury top short-handed Lynx, make WNBA Finals",
      "WNBA playoffs: Phoenix Mercury fend off short-handed Minnesota Lynx in Game 4 to reach WNBA Finals",
      "WNBA playoff bracket, where to watch: Schedule, scores, TV channel as Mercury eliminate Lynx to reach Finals",
      "Mercury overcome 13-point deficit, beat Lynx to advance to WNBA Finals"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.896,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.741,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Phoenix Mercury rallied from a 13-point fourth-quarter deficit to defeat the Minnesota Lynx 86-81 in Game 4, advancing to the WNBA Finals for the first time since 2021. Alyssa Thomas led with 23 points, 10 assists, and 8 rebounds, while DeWanna Bonner contributed crucial fourth-quarter 3-pointers. They will face either Indiana or Las Vegas in the Finals.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Netanyahu, Trump Meet in Washington for Gaza Peace Deal Talks",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-09-29T10:40:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "Axios",
      "New York Times"
    ],
    "domains": [
      "www.dw.com",
      "www.nytimes.com",
      "news.google.com"
    ],
    "snippets": [
      "After a cold reception at the UN General Assembly, Israel's Benjamin Netanyahu is visiting Trump at the White House to discuss ending the nearly two-year-long war in Gaza. Follow DW for more.",
      "<a href=\"https://news.google.com/rss/articles/CBMihgFBVV95cUxQUnppeVpLakpmYkM3bklyeHgyRmNrcHRvYzVkdGlNVzVZR20tSVZiem12amh5RDRrNElWSWJTQ1BLWFhmRGJNVVd4QUJyRVhLanRFanRkUVhPYXBRNlRxUTlkTTdHMGFaVTI0Q3Q2MExWUUtCTU51amN3MWQ0aWw4VnB2WFlhUQ?oc=5\" target=\"_blank\">Trump plans to squeeze Netanyahu to sign Gaza",
      "<a href=\"https://news.google.com/rss/articles/CBMidkFVX3lxTE0tSk44TTlRSDRWeUE0aW1OZEFEVnZxbkc3QkVaXzl6VmtRcnkwMzZqZjZBS1dsajlnemRQWlRqcE1TRjNxUXZVWTFpTVotbmc2cVJpM3FPVFJROFE1SFA2N2diN2YxR3p0TlpqaVo4MF9XRGJyOWc?oc=5\" target=\"_blank\">Exclusive: Trump says Gaza peace deal in \"final stages\"</a>&nbsp;&nb",
      "The president and Prime Minister Benjamin Netanyahu of Israel are set to meet in Washington after a week in which Israel grew more isolated internationally."
    ],
    "image_url": "",
    "titles": [
      "Middle East: Trump, Netanyahu set to discuss peace in Gaza",
      "Trump plans to squeeze Netanyahu to sign Gaza peace deal, aides say - Axios",
      "Exclusive: Trump says Gaza peace deal in \"final stages\" - Axios",
      "Trump and Netanyahu to Discuss Plans for Postwar Gaza"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.969,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.738,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Israeli Prime Minister Benjamin Netanyahu is meeting with President Trump in Washington to discuss a peace deal to end the nearly two-year-long war in Gaza. This comes after Netanyahu received a cold reception at the UN General Assembly and amid growing international isolation for Israel. Trump has indicated that the peace deal is in its \"final stages.\"",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Calgary Stampeders Acquire Lorenzo Mauldin IV from Ottawa Redblacks",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sun, 28 Sep 2025 22:39:08 +0000",
    "source": "Global News",
    "sources": [
      "Sportsnet",
      "Global News",
      "Ottawa Citizen"
    ],
    "domains": [
      "globalnews.ca",
      "ottawacitizen.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "The Calgary Stampeders acquired all-star American defensive lineman Lorenzo Mauldin IV on Sunday in a trade with the Ottawa Redblacks.",
      "<p>The Calgary Stampeders acquired all-star American defensive lineman Lorenzo Mauldin IV on Sunday in a trade with the Ottawa Redblacks.</p>",
      "The Calgary Stampeders acquired all-star American defensive lineman Lorenzo Mauldin IV on Sunday in a trade with the Ottawa Redblacks. Ottawa got a fourth-round pick in the 2026 Canadian Football League draft in return. The Redblacks have a 4-10 record this season, which is the worst record among th"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/35f544e9af9cb37edc23a029a411c340477b8d6f03ee5b12fd023f39dc225093.jpg?quality=65&strip=all",
    "titles": [
      "Stampeders get all-star Lorenzo Mauldin IV",
      "Stampeders get all-star Lorenzo Mauldin IV in trade with Redblacks",
      "Redblacks trade all-star Lorenzo Mauldin IV to Stampeders"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.755,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.738,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Calgary Stampeders traded for all-star American defensive lineman Lorenzo Mauldin IV from the Ottawa Redblacks on Sunday, exchanging a fourth-round pick in the 2026 CFL draft. The trade comes as the Redblacks hold a 4-10 season record, the lowest in the league.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "India Wins Asia Cup T20 Final; Refuses Trophy from Pakistan Minister",
    "domain": "sports",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Mon, 29 Sep 2025 09:30:42 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Deutsche Welle",
      "Sky Sports"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.skysports.com",
      "www.dw.com"
    ],
    "snippets": [
      "Indian leader controversially refers to the politically-charged win as an extension of &#039;Operation Sindoor&#039;.",
      "India won the Asia Cup Twenty20 final by five wickets in Dubai on Sunday, but refused to collect the championship trophy from Pakistan's interior minister.",
      "This is a cricket article but we are going to start with some golf."
    ],
    "image_url": "",
    "titles": [
      "PM Modi invokes conflict with Pakistan after India’s Asia Cup cricket win",
      "Asia Cup 2025: India, Pakistan cricket teams spar",
      "Is it India's time to win Women's Cricket World Cup?"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.946,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.726,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "India won the Asia Cup Twenty20 final against Pakistan by five wickets in Dubai. The Indian team controversially refused to collect the championship trophy from Pakistan's interior minister, citing political tensions. This incident occurred after the Indian leader referred to the victory as an extension of 'Operation Sindoor'.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Oregon Sues Trump Over National Guard Deployment to Portland",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Mon, 29 Sep 2025 04:26:41 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Forbes",
      "Axios"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.forbes.com",
      "news.google.com"
    ],
    "snippets": [
      "The Democrat-run state is challenging Trump&#039;s authority to deploy soldiers to what he has called &#039;war ravaged Portland&#039;.",
      "<a href=\"https://news.google.com/rss/articles/CBMilAFBVV95cUxOYTdZLVBwcEFSRkdrbTNPY1BzNHdLdnBhdzNrTjA0M3hXeHozYzh2Zm5mZkpVZkZmdnhzSWFycEVpNEx2VGhkZ0JHUmNNYk8zekFaaU8tVXdCQURxdnpsQzBWNjI1STN5RDlxY1hUNFdVX3Y0cWtLV21KVks0eldZZXJ5d3VTUVJGZEhOazZWTTBrNktO?oc=5\" target=\"_blank\">Oregon sues Trump in bid to",
      "The suit was filed after the Defense Department sent a memo to Oregon state leaders informing them about the deployment of 200 National Guard troops in Portland."
    ],
    "image_url": "",
    "titles": [
      "Trump to deploy 200 National Guard troops to Oregon as state leaders sue",
      "Oregon sues Trump in bid to stop National Guard deployment to Portland - Axios",
      "What We Know About The National Guard Deployment In Portland As Oregon Sues Trump Administration"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.851,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.714,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Oregon has filed a lawsuit against President Trump's decision to deploy 200 National Guard troops to Portland, challenging his authority. The legal action comes after the Defense Department notified Oregon state leaders of the deployment, aimed at addressing what Trump referred to as 'war ravaged' conditions in the city.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "JuJu Watkins to Miss Season Due to ACL Injury from NCAA Tournament",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Mon, 29 Sep 2025 01:36:46 +0000",
    "source": "CBS Sports",
    "sources": [
      "Sportsnet",
      "CBS Sports",
      "Sports Illustrated"
    ],
    "domains": [
      "www.cbssports.com",
      "www.sportsnet.ca",
      "news.google.com"
    ],
    "snippets": [
      "Watkins said she wants to \"fully focus on continuing to recover\"",
      "<a href=\"https://news.google.com/rss/articles/CBMijwFBVV95cUxNTXdMVGl6OURnQnZBdTFIdXd6N3FxYjRzWk41M3FuYkRDMldlZ3B4TWNFT3FYTlFmYk1QUVFPZDUwNXdMRk85bVlhay05c1Z1TXVVVDN2ZXZZb2RhcWUwR2cxcTkwdEhVbk42OXNiQ1Zyd3NkZ0Q5b2JfU3puVVNZUUZPUjhmdmFsekU2eTh4WQ?oc=5\" target=\"_blank\">JuJu Watkins Announces She's Out ",
      "<p>Southern California star JuJu Watkins announced on social media that she will be sidelined for the season after suffering an ACL injury in the NCAA Tournament last season.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/29/6e4d6f05-f8f3-455d-bc4c-fb852950644d/untitled-design-12.png",
    "titles": [
      "JuJu Watkins out for 2025-26 season: USC star tore ACL during NCAA Tournament",
      "JuJu Watkins Announces She's Out for Entire 2025-26 Season - Sports Illustrated",
      "USC star JuJu Watkins says she’ll be out for season as she recovers from ACL injury"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.803,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.707,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Southern California basketball star JuJu Watkins announced she will miss the season due to an ACL injury sustained in the last NCAA Tournament. Watkins expressed her intention to focus on recovery.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: sustain",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Hong Kong Activist Denied Entry into Singapore Amid Political Concerns",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Mon, 29 Sep 2025 06:56:02 -0400",
    "source": "NPR",
    "sources": [
      "Al Jazeera",
      "NPR"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.npr.org"
    ],
    "snippets": [
      "The activist wanted by the Hong Kong government said he was denied entry to Singapore over the weekend for what he presumes were political reasons.",
      "Pro-democracy campaigner says he held a valid visa and was given no reason for the refusal."
    ],
    "image_url": "",
    "titles": [
      "Overseas Hong Kong pro-democracy activist Nathan Law denied entry to Singapore",
      "Hong Kong activist Nathan Law says he was denied entry to Singapore"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.975,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.675,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A pro-democracy activist, sought by the Hong Kong government, was denied entry into Singapore despite holding a valid visa. The refusal occurred over the weekend, and the activist believes the denial was for political reasons. No specific reason for the entry denial was provided to him.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "US President Nears Gaza Peace Deal; $1bn Trump Plaza Planned in Jeddah",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 29 Sep 2025 11:20:37 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "www.bbc.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "The US president has talked up prospects of an agreement, but Netanyahu said it was not finalised - and Hamas say they haven't been sent the proposal.",
      "<p>US president to push Israeli prime minister to agree to new framework to end war in Gaza and free remaining hostages held by Hamas</p><p><strong>Saudi real estate developer Dar Global plans to build a $1bn Trump Plaza project in Saudi Arabia’s Jeddah as US president Donald Trump’s family business"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/24bb/live/c92eae90-9d11-11f0-a8fe-677b0b0b2d56.jpg",
    "titles": [
      "Trump to push new peace plan in talks with Netanyahu",
      "Donald Trump and Benjamin Netanyahu to discuss Gaza peace plan at the White House – US politics live"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.963,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.665,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The US President is working to finalize an agreement to end the war in Gaza and secure the release of hostages held by Hamas, though Israeli Prime Minister Netanyahu stated the deal is not yet complete. Meanwhile, Hamas claims they have not received the proposal. Additionally, Dar Global plans to construct a $1bn Trump Plaza in Jeddah, Saudi Arabia, linked to the Trump family business.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Taliban Releases US Citizen, Fifth American Freed This Year",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Mon, 29 Sep 2025 08:09:26 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "The Guardian"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "An American citizen who had been detained in Afghanistan since December has been released through Qatari mediation.",
      "<p>Secretary of state Marco Rubio welcomes release as ‘important step forward’ as Taliban seek to normalise relations with US</p><p>The Taliban on Sunday freed a US citizen from an Afghan prison, weeks after they said they had reached an agreement with US envoys on a prisoner exchange as part of an "
    ],
    "image_url": "",
    "titles": [
      "US citizen Amir Amiri freed by Taliban following Qatari mediation",
      "US citizen Amir Amiry freed by Taliban in Afghanistan"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.92,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.649,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Taliban released a US citizen from an Afghan prison, marking the fifth American freed this year. Secretary of State Marco Rubio hailed the release as a significant progress in efforts to normalize relations between the US and the Taliban. This comes after an agreement on a prisoner exchange was reached with US envoys.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Dolly Parton Delays Las Vegas Residency Due to Health Concerns",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 29 Sep 2025 07:43:19 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "www.bbc.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "The star delays her Las Vegas residency by almost a year, saying she needs \"multiple procedures\".",
      "<p>Country music superstar was due to play six-concert run at Caesars Palace in December</p><p>Dolly Parton has postponed her upcoming Las Vegas concert residency due to health issues.</p><p>Parton, 79, was due to begin a six-concert run at the Colosseum at Caesars Palace on 4 December. She announce"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/52a6/live/5cf4bbc0-9d07-11f0-a8fe-677b0b0b2d56.jpg",
    "titles": [
      "Dolly Parton postpones shows over 'health challenges'",
      "Dolly Parton postpones Las Vegas residency, citing ‘health challenges’"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.893,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.634,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Dolly Parton has postponed her six-concert Las Vegas residency at Caesars Palace, originally scheduled to start on December 4, due to health issues requiring \"multiple procedures.\" The events are delayed by almost a year.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Namibia Deploys Soldiers to Fight Fire in Etosha National Park",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Mon, 29 Sep 2025 06:39:01 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "The Guardian"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "The fire has burned through one-third of Etosha National Park, home to the endangered black rhinoceros.",
      "<p>Vast tract of park that is home to 114 mammal species, including critically endangered black rhino, affected</p><p>Namibia has begun deploying hundreds of soldiers to fight a fire that has burned through a third of the vast Etosha national park, one of Africa’s largest game reserves, officials sa"
    ],
    "image_url": "",
    "titles": [
      "Namibia deploys army to fight fire in one of Africa’s largest reserves",
      "Namibia deploys army to fight wildfire burning third of Etosha game reserve"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.891,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.633,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A fire has consumed one-third of Etosha National Park in Namibia, affecting an area home to 114 mammal species, including the critically endangered black rhinoceros. In response, Namibia has deployed hundreds of soldiers to combat the blaze in one of Africa's largest game reserves.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Starbucks to Close 1% of North American Stores, Locations Unspecified",
    "domain": "business",
    "source_domain": "www.businessinsider.com",
    "location": "global",
    "published": "2025-09-29T04:55:55Z",
    "source": "Business Insider",
    "sources": [
      "Ottawa Citizen",
      "Business Insider"
    ],
    "domains": [
      "ottawacitizen.com",
      "www.businessinsider.com"
    ],
    "snippets": [
      "Starbucks on Thursday said it would close 1% of its North American stores, but didn't announce which ones. Business Insider has compiled a list.",
      "Chain closures are cutting into local coffee routines. Here’s what we've confirmed so far."
    ],
    "image_url": "https://i.insider.com/68d724611c1f80efbec473c1?format=jpeg",
    "titles": [
      "Starbucks is closing over 100 North American stores &mdash;&nbsp;here are the locations we know so far",
      "Which Starbucks locations are closing in Ottawa?"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.86,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.627,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Starbucks announced on Thursday it will close 1% of its North American stores, but did not specify which ones. Business Insider has compiled a list of the closures. These closures are impacting local coffee routines.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]