[
  {
    "title": "Pro-European centrist beats right-wing nationalist in Romanian vote",
    "domain": "general",
    "location": "global",
    "published": "Sun, 18 May 2025 23:51:24 +0000",
    "source": "Washington Post",
    "sources": [
      "Washington Post"
    ],
    "snippets": [
      "Analysts called the presidential election the country’s most consequential since the 1989 fall of communism."
    ],
    "image_url": "",
    "titles": [
      "Pro-European centrist beats right-wing nationalist in Romanian vote"
    ],
    "summary": "Analysts have described the recent presidential election in the country as the most significant since the fall of communism in 1989. This characterization underscores the pivotal nature of the election in shaping the country's future direction.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful context about the significance of the recent presidential election in Romania, aiding in the reader's understanding of the country's political landscape. However, it doesn't offer actionable insights or report on solutions or improvements.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.775,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.488,
    "normalized_score": 3.21
  },
  {
    "title": "EU floats security pact with Australia as Albanese meets with world leaders in Rome",
    "domain": "general",
    "location": "global",
    "published": "Sun, 18 May 2025 23:33:24 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "snippets": [
      "<p>European Commission president raises prospect to two-way ‘stability’ as PM reaffirms support for Ukraine and speaks to Pope Leo XIV about his mother </p><ul><li><a href=\"https://www.theguardian.com/australia-news/live/2025/may/19/australia-news-live-albanese-zelenskyy-europe-pope-coalition-sussan-ley-nuclear-power-net-zero-ntwnfb\">Australia news live: latest politics updates</a></li><li>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></li></ul><p>The European Union has raised the prospect of a security pact with Australia as Anthony Albanese met with world leaders in Rome, including a brief conversation with Pope Leo XIV following the pontiff’s inauguration mass.</p><p>The prime minister met with European Commission president Ursula von der Leyen overnight in the Italian capital to discuss the “constructive relationship” Australia can play in “today’s uncertain world”.</p><p><strong><a href=\"https://www.theguardian.com/email-newsletters?CMP=copyembed\">Sign up for Guardian Australia’s breaking news email</a></strong></p> <a href=\"https://www.theguardian.com/world/2025/may/19/eu-australia-security-pact\">Continue reading...</a>"
    ],
    "image_url": "https://i.guim.co.uk/img/media/39378b998b2b627e3412dbd4ea5e9524826cf38a/423_90_1308_1047/master/1308.jpg?width=140&quality=85&auto=format&fit=max&s=0300e9de4c0080594d762359f0f1c7a6",
    "titles": [
      "EU floats security pact with Australia as Albanese meets with world leaders in Rome"
    ],
    "summary": "The European Union, through discussions between European Commission President Ursula von der Leyen and Australian Prime Minister Anthony Albanese in Rome, has proposed a security pact with Australia. This proposal aims to enhance the stability and constructive relationship between Australia and the EU in response to global uncertainties. Additionally, PM Albanese had a brief meeting with Pope Leo XIV following the pontiff's inauguration mass, where personal topics such as Albanese's mother were discussed. The meetings underscore Australia's engagement with global leaders on security and person",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story clearly highlights progress in the form of a proposed security pact between the EU and Australia. It also provides empowering knowledge about Australia's engagement with global leaders, contributing to the reader's understanding of international relations.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.77,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.517,
    "normalized_score": 5.29
  },
  {
    "title": "Ancient India review – snakes, shrines and sexual desire power a passionate show",
    "domain": "general",
    "location": "global",
    "published": "Sun, 18 May 2025 23:01:48 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "snippets": [
      "<p><strong>British Museum, London</strong><br />A lovable elephant deity and a floating serpent goddess are just two of the highlights in this sensual show about three of the country’s great religions</p><p>About 2,000 years ago, Indian art went through a stunning transformation led, initially, by Buddhists. From being enigmatically abstract it became incredibly accomplished at portraying the human body – and soul.</p><p>You can see this happen in the bustling yet harmonious crowd of pilgrims and gift-givers you meet about a third of the way through this ethereal and sensual show. Two horses bearing courtiers or merchants are portrayed in perfect perspective, their rounded chests billowing, their bodies receding. Around them a crowd of travelling companions, on horseback and foot, are depicted with the same depth. Their bodies and faces are full of life, in a frenetic pageant, a bustling carnival, yet this human hubbub is composed with order and calm.</p> <a href=\"https://www.theguardian.com/artanddesign/2025/may/19/ancient-india-review-british-museum-london\">Continue reading...</a>"
    ],
    "image_url": "https://i.guim.co.uk/img/media/2778112193a05c92bbe18b006d6982e3cedbbeb1/0_863_4386_3506/master/4386.jpg?width=140&quality=85&auto=format&fit=max&s=33ac46ba81448767b35831901d509f96",
    "titles": [
      "Ancient India review – snakes, shrines and sexual desire power a passionate show"
    ],
    "summary": "The British Museum in London is showcasing an exhibition that explores the transformation of Indian art around 2,000 years ago, particularly highlighting the shift from abstract forms to detailed human representations. This change, initially led by Buddhists, is evident in the portrayal of a diverse array of figures, including a lovable elephant deity and a floating serpent goddess, which symbolize India's major religions. The exhibition features a scene with pilgrims and gift-givers, where horses and humans are depicted in perfect perspective, showcasing the era's advanced artistic techniques",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides a deeper understanding of the transformation of Indian art around 2,000 years ago, contributing to the reader's knowledge of art history. However, it doesn't offer actionable insights or report on solutions or improvements.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.763,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.504,
    "normalized_score": 4.36
  },
  {
    "title": "Nicusor Dan Beats George Simion in Romana’s Presidential Election",
    "domain": "general",
    "location": "global",
    "published": "Sun, 18 May 2025 22:23:24 +0000",
    "source": "New York Times",
    "sources": [
      "New York Times"
    ],
    "snippets": [
      "Nicusor Dan, the mayor of Bucharest, defeated George Simion, a nationalist aligned with President Trump who had been seen as the front-runner."
    ],
    "image_url": "https://static01.nyt.com/images/2025/05/18/multimedia/18int-romania-election-photo-pvzk/18int-romania-election-photo-pvzk-mediumSquareAt3X.jpg",
    "titles": [
      "Nicusor Dan Beats George Simion in Romana’s Presidential Election"
    ],
    "summary": "Nicusor Dan, the mayor of Bucharest, won against George Simion, a nationalist who had support from President Trump and was considered the leading candidate. This outcome marks a significant political event in Bucharest.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "The story provides basic awareness about the outcome of the presidential election in Romania but does not provide any deeper insight or context about the implications of the result, the political landscape, or the candidates' platforms.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.754,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.452,
    "normalized_score": 0.64
  },
  {
    "title": "Israeli army begins ‘extensive’ new ground operations in Gaza",
    "domain": "general",
    "location": "global",
    "published": "Sun, 18 May 2025 21:43:13 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "snippets": [
      "<p>Netanyahu signals openness to deal with Hamas and says Israel will allow some aid into Gaza</p><p>The Israeli army has announced the start of a large-scale offensive in Gaza, describing “extensive ground operations” to seize “operational control” of swaths of the devastated Palestinian territory as a second day of indirect ceasefire talks in Qatar ended without any breakthrough.</p><p>Israeli military officials said its forces had “eliminated dozens of terrorists, dismantled terrorist infrastructure sites … and [were] currently being deployed in key positions”.</p> <a href=\"https://www.theguardian.com/world/2025/may/18/gaza-ceasefire-talks-continue-as-israel-carries-out-fresh-wave-of-strikes\">Continue reading...</a>"
    ],
    "image_url": "https://i.guim.co.uk/img/media/0c5029ea236e6e18cf869c0d93e65e697ad01021/427_0_4618_3693/master/4618.jpg?width=140&quality=85&auto=format&fit=max&s=b04eeaf562ac7c51c33dcd0688eea632",
    "titles": [
      "Israeli army begins ‘extensive’ new ground operations in Gaza"
    ],
    "summary": "Israeli Prime Minister Netanyahu has indicated a willingness to engage in a deal with Hamas, alongside allowing some aid into Gaza. Concurrently, the Israeli army has launched a significant offensive in Gaza, aiming for control over parts of the territory. This move comes amidst ongoing, yet unsuccessful, ceasefire negotiations in Qatar. The military operation has resulted in the death of numerous militants, the destruction of terrorist infrastructure, and the strategic deployment of Israeli forces in Gaza.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs about a significant event, providing some context about the ongoing conflict and ceasefire negotiations. However, it lacks a clear focus on solutions or improvements, and does not provide actionable insights for the reader.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.745,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.487,
    "normalized_score": 3.14
  },
  {
    "title": "Free agency and draft plans for Maple Leafs, Capitals, every other eliminated team",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 18 May 2025 22:26:06 EST",
    "source": "ESPN",
    "sources": [
      "ESPN"
    ],
    "snippets": [
      "We explore the next moves each team should make this summer and forecast its 2025-26 outlook."
    ],
    "image_url": "",
    "titles": [
      "Free agency and draft plans for Maple Leafs, Capitals, every other eliminated team"
    ],
    "summary": "The article provides an analysis of the strategic moves that various sports teams should consider during the upcoming summer to improve their performance. It also offers predictions on how these strategies could affect each team's prospects by the 2025-26 season. The focus is on identifying key actions for enhancement and projecting future success based on those actions.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story clearly highlights strategies for progress and potential solutions for sports teams. It provides actionable insights for the teams involved and deepens the reader's understanding of the strategic moves in sports management.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.755,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.492,
    "normalized_score": 3.5
  },
  {
    "title": "'Plan to invest' and 'more to come' - so what does Arsenal's summer look like?",
    "domain": "sports",
    "location": "global",
    "published": "Sun, 18 May 2025 21:20:00 BST",
    "source": "Sky Sports",
    "sources": [
      "Sky Sports"
    ],
    "snippets": [
      "During this season, Patrice Evra said something about Arsenal that went viral. \"They are like Netflix,\" he said. \"You're always waiting for the next season.\""
    ],
    "image_url": "https://e0.365dm.com/25/05/1920x1080/skysports-arsenal-transfers_6921265.jpg?20250519094456",
    "titles": [
      "'Plan to invest' and 'more to come' - so what does Arsenal's summer look like?"
    ],
    "summary": "Patrice Evra made a comment about Arsenal that gained widespread attention, comparing the football club to Netflix by saying, \"They are like Netflix. You're always waiting for the next season.\" This analogy suggests that, similar to a streaming service known for eagerly anticipated seasons of shows, fans are in constant anticipation of Arsenal's next phase or improvement.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides some insight into the future plans of Arsenal, but it does not provide actionable insights or deeper understanding. It does not report on specific solutions, improvements, or innovations, but it does increase awareness about the club's situation and fan expectations.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.74,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.458,
    "normalized_score": 1.07
  },
  {
    "title": "Merson's Arteta warning: 'Top two by Christmas or Arsenal will go for someone else'",
    "domain": "sports",
    "location": "global",
    "published": "Sun, 18 May 2025 20:10:00 BST",
    "source": "Sky Sports",
    "sources": [
      "Sky Sports"
    ],
    "snippets": [
      "Paul Merson thinks Mikel Arteta has until Christmas to prove he is the right manager for Arsenal after another trophyless season at the Emirates Stadium.."
    ],
    "image_url": "https://e2.365dm.com/25/05/1920x1080/skysports-arteta-merse-arsenal_6920982.jpg?20250518190523",
    "titles": [
      "Merson's Arteta warning: 'Top two by Christmas or Arsenal will go for someone else'"
    ],
    "summary": "Paul Merson has expressed his opinion that Arsenal manager Mikel Arteta has until Christmas to demonstrate his suitability for the role following another season without winning any trophies at the Emirates Stadium.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story offers basic awareness about the situation at Arsenal and the pressure on the manager, but it does not provide a deeper understanding or actionable insights. It does not report on solutions or improvements, rather it speculates on potential future actions.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.723,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.443,
    "normalized_score": 0.0
  },
  {
    "title": "Stokes gives up alcohol to aid latest injury rehabilitation",
    "domain": "sports",
    "location": "global",
    "published": "Sun, 18 May 2025 18:00:00 BST",
    "source": "Sky Sports",
    "sources": [
      "Sky Sports"
    ],
    "snippets": [
      "Ben Stokes has binned the booze during his latest injury rehabilitation in a bid to be firing on all cylinders for England this summer."
    ],
    "image_url": "https://e2.365dm.com/24/10/1920x1080/skysports-ben-stokes-england_6719561.jpg?20241020091208",
    "titles": [
      "Stokes gives up alcohol to aid latest injury rehabilitation"
    ],
    "summary": "Ben Stokes has decided to stop drinking alcohol while recovering from a recent injury. His goal is to be fully prepared and in top condition to play for England in the upcoming summer cricket matches.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The story provides useful information about Ben Stokes' approach to injury rehabilitation, which could be actionable for readers. It does not report on a solution or innovation, but it does highlight an individual's attempt to solve a personal problem. It also increases awareness about the impact of lifestyle choices on injury recovery.",
    "score_components": {
      "magnitude": 0.359,
      "recency": 0.693,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.471,
    "normalized_score": 2.0
  },
  {
    "title": "Is Miami paying too much for 5-star OT Jackson Cantwell? College insiders react to massive NIL deal",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 19 May 2025 15:52:55 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports"
    ],
    "snippets": [
      "Is it wise to spend 10% of the salary cap on a high school offensive tackle? That's a question many have wrestled with after five-star Jackson Cantwell's Miami commitment"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/05/19/23367a12-7c20-4cca-b4e2-13a4b211c637/miami-ol.jpg",
    "titles": [
      "Is Miami paying too much for 5-star OT Jackson Cantwell? College insiders react to massive NIL deal"
    ],
    "summary": "The debate centers on whether allocating 10% of a salary cap for high school offensive tackle Jackson Cantwell, following his commitment to Miami, is a prudent financial decision. Critics and supporters alike are evaluating the potential impact of investing a significant portion of the budget on a single, albeit highly-touted, player.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful insights into the financial decisions behind college sports recruitment, and the debate around allocating significant budget portions to single players. However, it does not report on any solutions or improvements, and its depth of insight is somewhat limited.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.997,
      "consensus": 0.2,
      "constructiveness": 0.7
    },
    "score": 0.545,
    "normalized_score": 7.29
  },
  {
    "title": "President Trump Says Walmart Should 'Eat the Tariffs'",
    "domain": "business",
    "location": "global",
    "published": "Sun, 18 May 2025 21:41:09 GMT",
    "source": "Investopedia",
    "sources": [
      "Investopedia"
    ],
    "snippets": [
      "<figure><img alt=\"Jakub Porzycki / NurPhoto via Getty Images\" src=\"https://www.investopedia.com/thmb/7udapjElB5ozt0LMGhr65X9fx6Y=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2151427806-0eaf1bd2aa074f06a7de8cafcdbdc169.jpg\" title=\"Cars are parked in a Walmart parking lot. \" /><figcaption><i><p>Jakub Porzycki / NurPhoto via Getty Images</p></i></figcaption></figure><br /><h3>KEY TAKEAWAYS </h3><ul><li>Walmart has become the latest example of a big company catching high profile political pushback in a still-fluid trade environment, as President Trump said on social media Saturday that the retail giant should \"eat the tariffs.\" </li><li>“Walmart should STOP trying to blame Tariffs as the reason for raising prices throughout the chain,” Trump said in a Saturday message on Truth Social. </li><li>Walmart CEO Doug McMillon said during the company's earnings call last week that even with the tariffs reduced, the company isn't \"able to absorb all the pressure given the reality of narrow retail margins.\"</li></ul><br /><br /><p>Walmart is accustomed to attracting attention for its prices. This weekend, it caught the eyes—and ire—of the president.<span class=\"ql-inline-citation\"></span></p><p>The episode marked the latest example of a big company catching high profile political pushback in a still-fluid trade environment. </p><p>Walmart (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;wmt\">WMT</a>) CEO Doug McMillon last week during the company’s earnings conference call thanked President Donald Trump and Treasury Secretary Scott Bessent for “progress” lowering tariffs since Trump’s “<a href=\"https://www.investopedia.com/liberation-day-tariffs-go-into-effect-11711517\">Liberation Day</a>” announcement. News of a framework for trade talks with China, along with <a href=\"https://www.investopedia.com/trade-war-truce-leaves-30-tariff-on-china-in-place-11732864\">a scaling back</a> of steep tariffs imposed by both countries on each other, has supported markets lately.</p><p>“We will do our best to keep our prices as low as possible,” McMillon said on Thursday’s call, a transcript of which was made available by AlphaSense. The retailer turned in more than $165 billion of <a href=\"https://www.investopedia.com/walmart-q1-fy2026-earnings-11732833\">first-quarter revenue</a>. But it also left open the possibility that profits <a href=\"https://www.investopedia.com/tariffs-may-pinch-profits-at-walmart-retailer-says-11735725\">might fall this year</a> depending on the direction of trade policy. </p><p>“Given the magnitude of the tariffs, even at the reduced levels announced this week, we aren't able to absorb all the pressure given the reality of narrow retail margins,” McMillon said. </p><h2>Trump Says on Truth Social that Walmart Should 'Eat the Tariffs'</h2><p>“Walmart should STOP trying to blame Tariffs as the reason for raising prices throughout the chain,” Trump said in a Saturday message on Truth Social. “Walmart made BILLIONS OF DOLLARS  last year, far more than expected. Between Walmart and China they should, as is said, ‘EAT THE TARIFFS,’ and not charge valued customers ANYTHING. I’ll be watching, and so will your customers!!!”</p><p>Several companies have in recent weeks said that tariffs may lead them <a href=\"https://www.investopedia.com/companies-weigh-price-increases-manufacturing-moves-as-trump-tariffs-hit-11722314\">to raise the prices</a> customers pay in order to sustain their markets. The Trump administration has not taken them all on publicly, but it has called out some large retailers. </p><p>When reports landed suggesting that Amazon.com (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;PG\">AMZN</a>) might detail the effect of tariffs on the prices on its site, members of the Trump administration called it <a href=\"https://www.investopedia.com/the-white-house-on-tuesday-called-plans-to-show-users-how-tariffs-impact-prices-on-amazon-amzn-a-hostile-and-political-act-11723993\">a “hostile and political” act</a>. (The company later said the idea was confined to a comparatively small part of its business and was never set to take effect.)</p><p>“We have always worked to keep our prices as low as possible and we won’t stop,” Walmart Corporate Affairs Director Joe Pennington told <em>Investopedia</em> in a Sunday email. “We’ll keep prices as low as we can for as long as we can given the reality of small retail margins.”<br /></p>"
    ],
    "image_url": "https://www.investopedia.com/thmb/7udapjElB5ozt0LMGhr65X9fx6Y=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2151427806-0eaf1bd2aa074f06a7de8cafcdbdc169.jpg",
    "titles": [
      "President Trump Says Walmart Should 'Eat the Tariffs'"
    ],
    "summary": "President Trump criticized Walmart on Truth Social for blaming tariffs for price increases across its stores, urging the company to \"eat the tariffs\" instead of passing costs to customers. Despite Trump's comments, Walmart CEO Doug McMillon stated during the company's earnings call that due to narrow retail margins and the magnitude of tariffs, even at reduced levels, Walmart cannot absorb all the pressure. This situation highlights the ongoing challenges big companies face in a fluctuating trade environment. Walmart, which reported over $165 billion in first-quarter revenue, aims to keep pric",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "While this story does not offer any solutions or improvements, it does provide a useful context for understanding the impacts of tariffs on retail prices and the challenges big companies face in a fluctuating trade environment. The story could have been more constructive if it delved deeper into the potential solutions or strategies for businesses to navigate these challenges.",
    "score_components": {
      "magnitude": 0.429,
      "recency": 0.744,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.495,
    "normalized_score": 3.71
  },
  {
    "title": "Top Stock Movers Now: Tesla, AutoZone, Novavax, and More",
    "domain": "business",
    "location": "global",
    "published": "Mon, 19 May 2025 15:55:43 GMT",
    "source": "Investopedia",
    "sources": [
      "Investopedia"
    ],
    "snippets": [
      "<figure><img alt=\"CFOTO / Future Publishing via Getty Images Tesla shares lost ground when China’s Xiaomi announced that its new electric SUV that looks to challenge Tesla's Model Y will be launched in China on Thursday.\" src=\"https://www.investopedia.com/thmb/JOJpINIwbvCCRFuE2tcxKDfU_Ns=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2214655236-b3259eaaf9014411b97c1c68645ecf4e.jpg\" title=\"shares lost ground when China’s Xiaomi announced that its new electric SUV that looks to challenge Tesla's Model Y will be launched in China on Thursday\" /><figcaption><i><p>CFOTO / Future Publishing via Getty Images</p> Tesla shares lost ground when China’s Xiaomi announced that its new electric SUV that looks to challenge Tesla's Model Y will be launched in China on Thursday.</i></figcaption></figure><br /><h3>Key Takeaways</h3><ul><li>A downgrade of the U.S. debt rating by Moody's sent U.S. equities lower and Treasury yields higher at midday.</li><li>Tesla's Chinese rival Xiaomi announced its electric SUV set to compete with Tesla's Model Y will be launched Thursday.</li><li>TXNM Energy agreed to be purchased by Blackstone's infrastructure division for $11.5 billion in cash and debt.</li></ul><br /><br /><p>U.S. equities were down at midday, while the yield on the 10-year Treasury jumped, as the market reacted to Moody's downgrading the U.S. debt rating. The <a href=\"https://www.investopedia.com/terms/d/djia.asp\">Dow Jones Industrial Average</a>, <a href=\"https://www.investopedia.com/terms/s/sp500.asp\">S&amp;P 500</a>, and <a href=\"https://www.investopedia.com/terms/n/nasdaq.asp\">Nasdaq</a> all slid.</p><p>Tesla (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;TSLA\">TSLA</a>) shares lost ground when Chinese rival Xiaomi announced that its new electric SUV that looks to challenge Tesla's Model Y will be launched in China on Thursday.</p><p>Higher bond yields sent shares of Builders FirstSource (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;BLDR\">BLDR</a>) and those of others in the homebuilding sector tumbling on worries about higher borrowing costs.</p><p>Bath &amp; Body Works (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;BBWI\">BBWI</a>) shares declined when the personal care and home fragrance retailer replaced its CEO, reported preliminary first-quarter profit and sales, and reiterated its 2025 outlook. </p><p>AutoZone (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;AZO\">AZO</a>) shares advanced when Evercore added the auto parts retailer to its \"Tactical Outperform\" list, pointing to the company's focus on expanding its mega-hub stores and boosting inventory.</p><p>Shares of Novavax (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;NVAX\">NVAX</a>) soared after the <a href=\"https://www.investopedia.com/terms/f/fda.asp\">Food and Drug Administration (FDA)</a> approved its new, protein-based COVID-19 vaccine.</p><p>TXNM Energy (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;TXNM\">TXNM</a>) shares were trading at a record high when the power provider for New Mexico and Texas agreed to be acquired by the infrastructure unit of Blackstone (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;BX\">BX</a>) for $11.5 billion in cash and debt. </p><p>Oil and gold prices gained. The U.S. dollar lost ground on the euro, pound, and yen. Most major cryptocurrencies traded higher. <br /></p><figure><img alt=\"TradingView\" src=\"https://www.investopedia.com/thmb/ITS2V7bfmTGxeDVHEu6xtJJoqU4=/fit-in/640x480/TSLA_2025-05-19_11-37-57-e31e5f3dbfc94953a4757ff589724003.png\" title=\"TSLA\" /><figcaption><i><p>TradingView</p></i></figcaption></figure>"
    ],
    "image_url": "https://www.investopedia.com/thmb/JOJpINIwbvCCRFuE2tcxKDfU_Ns=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2214655236-b3259eaaf9014411b97c1c68645ecf4e.jpg",
    "titles": [
      "Top Stock Movers Now: Tesla, AutoZone, Novavax, and More"
    ],
    "summary": "Tesla's stock declined following Xiaomi's announcement of launching a new electric SUV in China, aiming to compete with Tesla's Model Y. Concurrently, U.S. equities fell and Treasury yields rose after Moody's downgraded the U.S. debt rating. In other market news, TXNM Energy's acquisition by Blackstone for $11.5 billion in cash and debt pushed its shares to a record high. Additionally, various sectors reacted to market conditions, with Novavax shares surging after FDA approval of its COVID-19 vaccine, and AutoZone shares rising due to an analyst upgrade. Oil and gold prices increased, while th",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful insights into the current stock market trends and the factors influencing them, such as product launches, acquisitions, and regulatory approvals. It also highlights the impacts of these trends on various sectors. However, it does not report on any solutions or improvements, and its depth of insight is somewhat limited.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.998,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.575,
    "normalized_score": 9.43
  },
  {
    "title": "Third man arrested over arson attacks on Starmer’s London home",
    "domain": "business",
    "location": "global",
    "published": "Mon, 19 May 2025 15:55:39 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times"
    ],
    "snippets": [
      "34-year-old held on suspicion of conspiracy to commit arson with intent to endanger life"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Fed78c246-af73-4e0b-81e1-e66161c7f29a.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Third man arrested over arson attacks on Starmer’s London home"
    ],
    "summary": "A 34-year-old individual has been arrested under suspicion of conspiring to commit arson with the intent to endanger life. The current status of the case involves the suspect being held for further investigation as authorities work to determine the extent of the alleged conspiracy and any potential threats to public safety.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about an ongoing investigation into an arson attack. It doesn't provide deeper insights or actionable information for readers, nor does it report on solutions or improvements.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.998,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.545,
    "normalized_score": 7.29
  },
  {
    "title": "Trump’s DOJ accuses Medicare Advantage insurers of paying ‘kickbacks’ for primo customers",
    "domain": "business",
    "location": "global",
    "published": "Mon, 19 May 2025 15:51:37 +0000",
    "source": "Fortune",
    "sources": [
      "Fortune"
    ],
    "snippets": [
      "Major health insurers dispute DOJ claims that they paid brokerages “hundreds of millions of dollars in kickbacks” to get consumers into their Medicare Advantage plans."
    ],
    "image_url": "https://fortune.com/img-assets/wp-content/uploads/2025/05/GettyImages-2198561434-e1747669673860.jpg?w=2048",
    "titles": [
      "Trump’s DOJ accuses Medicare Advantage insurers of paying ‘kickbacks’ for primo customers"
    ],
    "summary": "Major health insurers are contesting claims from the Department of Justice (DOJ) that they engaged in illegal activities by paying brokerages \"hundreds of millions of dollars in kickbacks\" to enroll consumers in their Medicare Advantage plans. The insurers argue against the allegations, emphasizing their compliance with the law.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story informs readers about allegations of illegal activities in the health insurance industry. It provides useful context about the dispute between the DOJ and health insurers, but it doesn't clearly highlight solutions or empowering knowledge.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.997,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.583,
    "normalized_score": 10.0
  },
  {
    "title": "China says U.S. undermined trade talks with Huawei chip warning",
    "domain": "business",
    "location": "national",
    "published": "Mon, 19 May 2025 15:36:33 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "snippets": [
      "China accused the United States of undermining the two countries' preliminary trade agreement reached in Geneva, Switzerland."
    ],
    "image_url": "",
    "titles": [
      "China says U.S. undermined trade talks with Huawei chip warning"
    ],
    "summary": "China has accused the United States of undermining a preliminary trade agreement the two countries reached in Geneva, Switzerland. This accusation points to tensions between China and the U.S. regarding their trade relations, although specific details of the alleged undermining were not provided.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the ongoing trade tensions between China and the U.S. However, it lacks specific details about the alleged undermining and doesn't report on potential solutions or improvements.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.993,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.562,
    "normalized_score": 8.5
  },
  {
    "title": "New Clues to Alien Life: Researchers Revive 4-Billion-Year-Old Metabolic Process",
    "domain": "science",
    "location": "global",
    "published": "Sun, 18 May 2025 21:54:39 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/new-clues-to-alien-life-researchers-revive-4-billion-year-old-metabolic-process/\" rel=\"nofollow\" title=\"New Clues to Alien Life: Researchers Revive 4-Billion-Year-Old Metabolic Process\"><img alt=\"Origin of Life Concept\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Origin-of-Life-Concept-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>The earliest cells harnessed energy through geochemical reactions, a process that LMU researchers have now successfully replicated in the lab. The earliest ancestor of all life on Earth likely thrived in warm environments, relied on hydrogen for energy, and produced methane as a byproduct. Researchers at LMU Munich have reached this conclusion through fossil evidence [...]"
    ],
    "image_url": "",
    "titles": [
      "New Clues to Alien Life: Researchers Revive 4-Billion-Year-Old Metabolic Process"
    ],
    "summary": "Researchers at LMU Munich have successfully replicated a 4-billion-year-old metabolic process in the laboratory, suggesting the earliest forms of life on Earth thrived in warm environments, utilized hydrogen for energy, and produced methane as a byproduct. This breakthrough provides new insights into the origins of life and potential clues to the existence of alien life, based on fossil evidence.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive as it provides readers with new insights into the origins of life and potential existence of alien life. It also reports on a significant scientific achievement, which is the successful replication of a 4-billion-year-old metabolic process, highlighting progress in the field of astrobiology.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.748,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.51,
    "normalized_score": 4.79
  },
  {
    "title": "Our DNA May Evolve Much Faster Than Previously Thought",
    "domain": "science",
    "location": "global",
    "published": "Sun, 18 May 2025 21:29:55 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/our-dna-may-evolve-much-faster-than-previously-thought/\" rel=\"nofollow\" title=\"Our DNA May Evolve Much Faster Than Previously Thought\"><img alt=\"DNA Genetics Evolution Artist&#039;s Concept\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/DNA-Genetics-Evolution-Artists-Concept-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>Rapidly mutating DNA regions were mapped using a multi-generational family and advanced sequencing tools. Understanding how human DNA changes over generations is crucial for estimating genetic disease risks and tracing our evolutionary history. However, some of the most variable regions of our DNA have been difficult for researchers to access, until now. Scientists from University [...]"
    ],
    "image_url": "",
    "titles": [
      "Our DNA May Evolve Much Faster Than Previously Thought"
    ],
    "summary": "Scientists have discovered that human DNA may evolve more rapidly than previously believed, thanks to advanced sequencing tools and studies on a multi-generational family. This research has allowed access to previously difficult-to-study, highly variable DNA regions, enhancing our understanding of genetic disease risks and human evolutionary history.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it offers readers a deeper understanding of human DNA and its rapid evolution, which is a new discovery. It also informs about the use of advanced sequencing tools and their role in enhancing our understanding of genetic disease risks and human evolutionary history.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.742,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.498,
    "normalized_score": 3.93
  },
  {
    "title": "4 Tiny DNA Tweaks That Supercharged the Human Brain",
    "domain": "science",
    "location": "global",
    "published": "Sun, 18 May 2025 21:04:05 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/4-tiny-dna-tweaks-that-supercharged-the-human-brain/\" rel=\"nofollow\" title=\"4 Tiny DNA Tweaks That Supercharged the Human Brain\"><img alt=\"Human Homo Sapien Concept Art Illustration Enhanced\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Human-Homo-Sapien-Concept-Art-Illustration-Enhanced-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>How Four Small DNA Changes Helped Shape the Human Brain A tiny sliver of our genome may hold the key to what makes us human. Duke scientists have zeroed in on “Human Accelerated Regions,” mysterious stretches of DNA that don&#8217;t code for proteins but play a crucial role in brain development. Unlocking the Genetic Secrets [...]"
    ],
    "image_url": "",
    "titles": [
      "4 Tiny DNA Tweaks That Supercharged the Human Brain"
    ],
    "summary": "Duke University scientists have identified four small DNA changes, known as \"Human Accelerated Regions,\" that significantly contributed to the development of the human brain. These regions do not code for proteins but are crucial for brain development, suggesting they play a key role in distinguishing humans from other species. This discovery sheds light on the genetic factors that may underlie human cognitive abilities.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive as it provides readers with empowering knowledge about the genetic factors that may underlie human cognitive abilities. It reports on the discovery of four small DNA changes that significantly contributed to the development of the human brain, highlighting progress in the field of genetics and neuroscience.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.736,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.514,
    "normalized_score": 5.07
  },
  {
    "title": "Brisk Walking for Just 5 Minutes Could Boost Brain Power",
    "domain": "science",
    "location": "global",
    "published": "Sun, 18 May 2025 16:42:20 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/brisk-walking-for-just-5-minutes-could-boost-brain-power/\" rel=\"nofollow\" title=\"Brisk Walking for Just 5 Minutes Could Boost Brain Power\"><img alt=\"Wireframe Longevity Exercise Glowing Human\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Wireframe-Longevity-Exercise-Glowing-Human-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>New research reveals how physical activity boosts brain health as we age. A brisk walk, a session of water aerobics, or a light jog, any activity that raises your heart rate, can significantly improve brain health, according to new research from the University of South Australia. In collaboration with the AdventHealth Research Institute in the [...]"
    ],
    "image_url": "",
    "titles": [
      "Brisk Walking for Just 5 Minutes Could Boost Brain Power"
    ],
    "summary": "New research from the University of South Australia, in collaboration with the AdventHealth Research Institute, has found that engaging in physical activities like brisk walking, water aerobics, or light jogging can significantly improve brain health in aging individuals. These activities, which increase heart rate, are linked to enhanced brain power.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "The story is constructive because it provides actionable insights for readers (brisk walking, water aerobics, or light jogging) to improve their brain health. It also reports on a new research finding, indicating progress in understanding the link between physical activity and brain health.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.675,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.496,
    "normalized_score": 3.79
  },
  {
    "title": "This Common Fungus Found on Human Skin Wipes Out Deadly Superbug",
    "domain": "science",
    "location": "global",
    "published": "Sun, 18 May 2025 16:17:49 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/this-common-fungus-found-on-human-skin-wipes-out-deadly-superbug/\" rel=\"nofollow\" title=\"This Common Fungus Found on Human Skin Wipes Out Deadly Superbug\"><img alt=\"Skin Close Up\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"434\" src=\"https://scitechdaily.com/images/Skin-Close-Up-777x434.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>The yeast Malassezia helps protect the skin from bacterial infections, but only up to a certain point. Scientists at the University of Oregon have identified a molecule produced by a common yeast found on human skin that exhibits strong antimicrobial activity against Staphylococcus aureus, a bacterium responsible for approximately 500,000 hospitalizations each year in the [...]"
    ],
    "image_url": "",
    "titles": [
      "This Common Fungus Found on Human Skin Wipes Out Deadly Superbug"
    ],
    "summary": "Researchers at the University of Oregon discovered that the yeast Malassezia, commonly found on human skin, produces a molecule with potent antimicrobial properties against Staphylococcus aureus, a harmful bacterium linked to around 500,000 hospital admissions annually. This finding highlights Malassezia's role in protecting the skin from bacterial infections.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is useful as it provides deeper understanding about the beneficial role of a common yeast found on human skin. It reports on a new research finding, which is a potential solution to combat harmful bacterial infections. However, it could be more constructive if it provided more actionable insights or implications for the reader.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.67,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.477,
    "normalized_score": 2.43
  }
]