[
  {
    "title": "8.8 Magnitude Earthquake Triggers Tsunami Alerts Across Pacific",
    "domain": "general",
    "location": "global",
    "published": "Wed, 30 Jul 2025 07:20:29 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Deutsche Welle",
      "Forbes",
      "ABC News",
      "Al Jazeera",
      "Washington Post",
      "The Guardian"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "Tsunami alerts have been issued from Japan to the US coast after a magnitude 8.8 earthquake struck near Russia.",
      "Dozens of other countries, including in Latin America, Asia and parts of the US, are bracing for potential tsunamis.",
      "A powerful earthquake off Russia's east coast has triggered evacuations throughout the Pacific, from Japan to Peru. The US states of Hawaii and Alaska are also impacted by the waves. DW has the latest.",
      "Tsunami alerts were issued for Alaska and Hawaii on Tuesday after a major, 8.8 magnitude earthquake struck off the coast of Russia, according to officials.",
      "<p>Powerful 8.8-magnitude earthquake triggers tsunami alerts across Pacific including US coast and Japan</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/jul/30/tsunami-alert-pacific-islands-japan-russia-magnitude-8-earthquake-follow-live-updates\">Tsunami warning live updates<br />",
      "The strongest earthquake of the year struck off Russia’s Kamchatka Peninsula, triggering tsunami warnings along the U.S. West Coast, Hawaii, Japan and across the Pacific.",
      "<p>Hazardous waves after 8.8-magnitude earthquake are possible on the coast of Russia, Japan, Hawaii, Alaska, California and some Pacific islands</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/2025/jul/29/honolulu-tsunami-preparation-russia-earthquake\">Tsunami warnings across Pacific as ",
      "Japanese officials said around 900,000 people across the country were under evacuation orders, while Hawaii residents were urged to seek higher ground."
    ],
    "image_url": "",
    "titles": [
      "Tsunami alert after massive earthquake east of Russia",
      "Tsunamis strike parts of Russia, Japan, Hawaii after massive Russia quake",
      "Tsunami waves lash Hawaii after Russia east coast quake",
      "Tsunami waves begin hitting Hawaii after 8.8 earthquake near Russia",
      "Tsunami warnings across Pacific as first waves hit Hawaii after earthquake off Russia",
      "Live updates: First tsunami waves reach Hawaii after 8.8-magnitude Russia quake",
      "Tsunami updates live: first waves hit Hawaii after huge earthquake off Russia triggers tsunami alerts across Pacific, Japan and US",
      "Tsunami Waves Reach Hawaii And Japan Coasts After Powerful Quake In Russia (Live Updates)"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.983,
      "consensus": 1.0,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.857,
    "summary": "An 8.8 magnitude earthquake off Russia's east coast has prompted tsunami alerts across the Pacific, affecting areas from Japan to the US coast, including Hawaii and Alaska. The quake, the strongest of the year, has led to widespread evacuations, with around 900,000 people in Japan advised to evacuate and residents in Hawaii urged to seek higher ground. Countries across Latin America and Asia are also on alert for potential tsunamis.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The story provides important information about a natural disaster, which could be actionable for people in affected areas. It also raises awareness about the potential impacts of such events. However, it does not report on solutions or improvements, and the depth of understanding it provides is limited to the immediate situation.",
    "image": {
      "src": "https://live.staticflickr.com/5589/15147968852_3f9aa97d20_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/6d73b4de-e43e-44cd-afdc-e561e58e8ee0/thumb/",
      "alt": "Staraya Russa, Russia",
      "credit": "Lex Kravetski / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Senate Confirms Emil Bove as Federal Judge Amid Controversy",
    "domain": "general",
    "location": "national",
    "published": "Wed, 30 Jul 2025 01:25:43 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "The Guardian",
      "LA Times",
      "Axios"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "The Senate confirmed former Trump lawyer Emil Bove as a federal appeals court judge as Republicans dismissed whistleblower complaints about his conduct at the Justice Department.",
      "<a href=\"https://news.google.com/rss/articles/CBMikgFBVV95cUxPU2FGWUlEV21feE9QaV9ockJfSDJYZ3dCNlQtM0RVTkZyUG5OdnVRS3Fhc2M4LTE4QTFRSkVua1RHWk9rM2xmZFlSd1FQTXkxYmpKOVJXTWwwU3BCMFNkQmhrX1RkTG9sTFNuZklZcWx1OXJESnJGZHpQZ0ZYWmY0cEJYbWZfdVZrWE9qdzNrQUFpUQ?oc=5\" target=\"_blank\">Senate confirms former Trump ",
      "<p>Top justice department official confirmed 50-49 despite claims that he advocated for ignoring court’s orders</p><p>The Senate on Tuesday confirmed Emil Bove, a top justice department official and former defense attorney for <a href=\"https://www.theguardian.com/us-news/donaldtrump\">Donald Trump</a",
      "<p>Emil Bove was confirmed to a U.S. appeals court on a party-line vote. Bove led a purge of prosecutors who worked on cases stemming from the 2021 attack on the Capitol.</p>"
    ],
    "image_url": "",
    "titles": [
      "Senate confirms Trump lawyer Emil Bove for appeals court",
      "Senate confirms former Trump lawyer Bove as federal judge - Axios",
      "Ex-Trump lawyer Emil Bove confirmed to federal appeals court by US Senate",
      "Senate votes to confirm Trump's defense lawyer Emil Bove to a U.S. appeals court"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.944,
      "consensus": 0.935,
      "constructiveness": 0.6,
      "proximity": 0.75
    },
    "score": 0.838,
    "summary": "The Senate confirmed Emil Bove, a former lawyer for Donald Trump and a top Justice Department official, as a federal appeals court judge with a party-line vote of 50-49. This decision came despite whistleblower complaints alleging that Bove advocated for ignoring court orders and led a purge of prosecutors involved in cases related to the 2021 Capitol attack.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about a significant political event and the controversy surrounding it, which can help readers understand the current political climate. However, it does not offer solutions, improvements, or innovations, nor does it increase clarity around systems or impacts in a substantial way.",
    "image": {
      "src": "https://live.staticflickr.com/65535/54613615156_a05c293509_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/382fdbbe-71c7-4f70-9719-68148b8b25a6/thumb/",
      "alt": "Emil Bove",
      "credit": "",
      "license": "cc0",
      "license_version": "1.0",
      "license_url": "https://creativecommons.org/publicdomain/zero/1.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "8.8 Magnitude Earthquake in Russia Triggers Tsunami Warnings Across Pacific",
    "domain": "business",
    "location": "national",
    "published": "Wed, 30 Jul 2025 08:01:13 GMT",
    "source": "CNBC",
    "sources": [
      "CityNews",
      "CNBC",
      "Financial Times",
      "The Guardian"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "The earthquake, which struck early Wednesday, triggered evacuation orders in Hawaii and Japan.",
      "Japan and US issue evacuation orders for coastal areas after 8.8-magnitude shock",
      "<p>People in Guam and Japan move to higher ground, while highways in Hawaii busy as residents flee to find safety</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/jul/30/tsunami-alert-pacific-islands-japan-russia-magnitude-8-earthquake-follow-live-updates\">Tsunami warning live upda",
      "TOKYO (AP) — One of the world&#8217;s strongest earthquakes struck Russia&#8217;s Far East early Wednesday, an 8.8-magnitude temblor that caused a tsunami in the northern Pacific region and prompted warnings for Alaska, Hawaii and other coasts south toward New Zealand. Several locations advised evac"
    ],
    "image_url": "",
    "titles": [
      "Russia massive earthquake triggers tsunami warnings: Here's what we know so far",
      "Powerful Russia earthquake triggers tsunami warnings across Pacific",
      "‘Prepared for a long stay’: tsunami alert triggers mass evacuations across Pacific",
      "8.8-magnitude earthquake causes tsunami in Russia and Japan, sets off warnings for Alaska and Hawaii"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.997,
      "consensus": 0.985,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.836,
    "summary": "An 8.8-magnitude earthquake hit Russia's Far East early Wednesday, leading to tsunami warnings across the northern Pacific, including Alaska, Hawaii, New Zealand, Guam, and Japan. Evacuation orders were issued in these areas, with residents moving to higher ground and highways in Hawaii experiencing increased traffic as people sought safety.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the earthquake and its immediate aftermath, including tsunami warnings and evacuation orders. However, it does not delve into the causes, potential solutions for disaster management, or the long-term impacts of such natural disasters.",
    "image": {
      "src": "https://live.staticflickr.com/8703/17557928942_b5195e10b8_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/e778bf4f-ea76-4f92-a67f-548a8d37d1ea/thumb/",
      "alt": "7.3 magnitude earthquake in Nepal [Image 3 of 3]",
      "credit": "DVIDSHUB / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Browns' Emerson Jr. Out with Torn Achilles After Practice Injury",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 30 Jul 2025 02:47:59 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports",
      "Sports Illustrated",
      "Sportsnet"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Browns cornerback Martin Emerson Jr. was carted off the field during Tuesday's practice after suffering an Achilles injury.",
      "Emerson started at cornerback for the Browns each of the last two seasons",
      "<a href=\"https://news.google.com/rss/articles/CBMijgFBVV95cUxQd3gtTFZQR1I5ZTRxVVhNTzJpdjNNcXJ5dExLN2RDWHdDc0lJOVlPdXNPSm44dVNBNjZ6S3lucWhqQ2x5VUd5YTNIWmRRekx2T2l5Q25SQ3pRUFVaenJxQVJRSmxzdW44cktpTFZkZjRNTXJwcTZZZFFVQTNtRlhzSV9Jd2pfQmJrU2tNREZ3?oc=5\" target=\"_blank\">Browns Cornerback Suffers Achilles ",
      "<p>The Cleveland Browns will be without starting cornerback Martin Emerson Jr. due to a torn Achilles, reported by NFL Network’s Mike Garafolo on Tuesday. </p>"
    ],
    "image_url": "",
    "titles": [
      "Browns' Emerson carted off with Achilles injury",
      "Browns' Martin Emerson Jr. suffers Achilles injury in training camp practice, per report",
      "Browns Cornerback Suffers Achilles Injury During Training Camp - Sports Illustrated",
      "Report: Browns cornerback Martin Emerson Jr. suffers Achilles tear"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.972,
      "consensus": 0.935,
      "constructiveness": 0.5,
      "proximity": 0.75
    },
    "score": 0.833,
    "summary": "Cleveland Browns cornerback Martin Emerson Jr. was carted off the field during Tuesday's practice due to a torn Achilles injury, as reported by NFL Network's Mike Garafolo. Emerson, who has been a starting cornerback for the Browns for the last two seasons, will be unable to play for an unspecified amount of time due to this injury.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about a sports injury. However, it does not offer any actionable insights or deeper understanding of the issue, nor does it report on any solutions or improvements. It does provide some insight into the potential impact on the team and the player's career.",
    "image": {
      "src": "https://live.staticflickr.com/40/100129426_77514d2252_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/f217da0b-0630-4f00-b3d2-4d74c7c2aa4e/thumb/",
      "alt": "Here is Another Picture of My Brown Recluse Spider Bite",
      "credit": "wigu / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Trump Expelled Epstein from Mar-a-Lago for Poaching Staff, Amid Abuse Claims",
    "domain": "general",
    "location": "national",
    "published": "Tue, 29 Jul 2025 16:00:18 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "CNBC",
      "Al Jazeera",
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "Trump has said he kicked Epstein out of his club for hiring workers away from Mar-a-Lago. When asked Tuesday if the workers included young women, Trump responded, \"the answer is yes, they were.\"",
      "Trump told reporters his falling out with Epstein was due to the disgraced financier poaching his employees.",
      "Trump says he cut off his relationship with Epstein because the sex offender poached workers from his Florida resort.",
      "Virginia Giuffre had said she was sexually abused by Jeffrey Epstein after Ghislaine Maxwell spotted her working at Trump's club in Florida.",
      "<p>This blog is now closed. Read our latest story <a href=\"https://www.theguardian.com/us-news/2025/jul/29/trump-epstein-virginia-giuffre\">here</a></p><p><strong>The <a href=\"https://www.theguardian.com/us-news/trump-administration\">Trump administration</a> must continue reimbursing Planned Parentho",
      "<p>President says pair fell out because Epstein poached staffers, including Epstein accuser who died in April</p><p>Donald Trump suggested on Tuesday that Jeffrey Epstein, the late sex offender he socialized with for more than a decade, “stole” Virginia Giuffre and other young female staffers whom h"
    ],
    "image_url": "",
    "titles": [
      "Trump says his falling out with Jeffrey Epstein was over spa workers at Mar-a-Lago",
      "Trump says Epstein 'stole' young women from his Mar-a-Lago spa",
      "Trump says Epstein ‘stole’ young women staff from his Mar-a-Lago resort",
      "Trump says Jeffrey Epstein 'stole' Virginia Giuffre from Mar-a-Lago spa",
      "Trump suggests Epstein ‘stole’ Virginia Giuffre among young female staff he hired away from Mar-a-Lago – as it happened",
      "Trump says Epstein ‘stole’ Virginia Giuffre from Mar-a-Lago staff role"
    ],
    "score_components": {
      "magnitude": 0.84,
      "recency": 0.776,
      "consensus": 1.0,
      "constructiveness": 0.5,
      "proximity": 0.75
    },
    "score": 0.824,
    "summary": "Donald Trump confirmed he expelled Jeffrey Epstein from his Mar-a-Lago club for poaching employees, including young women. This revelation came amidst discussions about Virginia Giuffre, who claimed she was sexually abused by Epstein after being spotted working at Trump's Florida club. Trump's acknowledgment occurred while addressing questions about his past association with Epstein, emphasizing the hiring away of spa staff as the reason for their fallout. Ghislaine Maxwell, implicated in facilitating Epstein's abuse, has sought immunity before testifying to Congress, highlighting the ongoing ",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness about Trump's past association with Epstein and the reasons for their fallout. However, it doesn't provide a deep insight into the broader system of abuse or its impacts. It doesn't empower the reader with actionable insights or solutions.",
    "image": {
      "src": "https://live.staticflickr.com/8644/16528411470_5acd7de013_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/0169ef76-d32f-46ef-88ca-ac02a1fce37a/thumb/",
      "alt": "Mars",
      "credit": "Kevin M. Gill / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "UK to Recognize Palestine if Israel Rejects Ceasefire and Peace Steps",
    "domain": "general",
    "location": "global",
    "published": "Tue, 29 Jul 2025 17:09:10 +0000",
    "source": "Al Jazeera",
    "sources": [
      "CityNews",
      "Deutsche Welle",
      "Axios",
      "Al Jazeera",
      "New York Times",
      "Washington Post",
      "The Guardian"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "PM Keir Starmer said the UK will recognise Palestine unless Israel agrees to a ceasefire.",
      "Prime Minister Keir Starmer said the UK would make the move unless Israel agrees to a ceasefire in Gaza and meets other conditions. Israel has slammed the announcement, saying it \"rewards\" Hamas.",
      "<a href=\"https://news.google.com/rss/articles/CBMigAFBVV95cUxOb2dtYkZpRDBiNWtXZ3A4TmdBTV9oeC04RjRGejFBZC1mMnBwRkw1Q1FrZkoxTXdEWnFneExCSkZIaUtPcnYxNV90SGUyX0R2UUZsRHcyck5PM1RqN3FyeXJwUFdCN1lJLUJxU0lOUk9rYlFxS1E2R1htVTZqanRoZQ?oc=5\" target=\"_blank\">U.K. to recognize Palestine in September if Israel do",
      "<p>Cabinet agrees to support Middle East roadmap at emergency meeting called amid humanitarian crisis in Gaza</p><p>The UK will formally recognise the state of Palestine this September as a result of the “increasingly intolerable” situation on the ground in Gaza, unless Israel abides by a ceasefire ",
      "The U.K. leader’s demands came amid what he said was British revulsion over starvation in Gaza.",
      "Prime Minister Keir Starmer said his government would act unless there was a truce, citing the “intolerable” humanitarian crisis in Gaza.",
      "LONDON (AP) — The U.K. will recognize a Palestinian state in September unless Israel agrees to a ceasefire in Gaza, allows the U.N. to bring in aid and takes other steps toward long-term peace, Prime Minister Keir Starmer said Tuesday. Starmer, who is under mounting domestic pressure over the issue "
    ],
    "image_url": "",
    "titles": [
      "UK to recognise Palestine unless Israel agrees to ceasefire",
      "UK to recognize Palestine state unless Israel stops Gaza war",
      "U.K. to recognize Palestine in September if Israel doesn't change course - Axios",
      "UK to recognise state of Palestine in September unless Israel holds to ceasefire",
      "Starmer vows to recognize Palestinian state unless Israel shifts Gaza policy",
      "UK Will Recognize Palestinian Statehood In September, Unless Israel-Hamas Cease-Fire is Reached",
      "Starmer says UK will recognize Palestinian state unless Israel agrees ceasefire, ends Gaza suffering"
    ],
    "score_components": {
      "magnitude": 0.82,
      "recency": 0.731,
      "consensus": 1.0,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.823,
    "summary": "UK Prime Minister Keir Starmer announced that the UK will formally recognize Palestine as a state in September unless Israel agrees to a ceasefire in Gaza, allows U.N. aid, and takes steps toward long-term peace. This decision comes amid growing domestic pressure and the \"increasingly intolerable\" humanitarian situation in Gaza, according to Starmer. Israel's Prime Minister Benjamin Netanyahu criticized the move, claiming it rewards Hamas. The UK's stance was confirmed following an emergency Cabinet meeting focused on the Middle East crisis.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "The story clearly highlights a potential solution (recognition of Palestine) to the ongoing Middle East crisis. It provides useful information about the UK's stance and the conditions under which it would recognize Palestine. It also increases awareness about the humanitarian situation in Gaza and the domestic pressures influencing the UK's decision.",
    "image": {
      "src": "https://live.staticflickr.com/1595/26246679326_6336ec5f1c_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/3e56d481-a95f-462f-9908-0ba68325aa86/thumb/",
      "alt": "Reading, UK",
      "credit": "VV Nincic / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Trey Hendrickson Ends Holdout, Reports to Bengals Camp Without New Deal",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 30 Jul 2025 02:47:59 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports",
      "Sportsnet"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Bengals All-Pro defensive end Trey Hendrickson is set to end his holdout and report for training camp on Wednesday, sources told ESPN's Adam Schefter.",
      "Hendrickson led the NFL with 17.5 sacks in 2024",
      "<p>Trey Hendrickson is ending his holdout and will report to the Cincinnati Bengals on Wednesday, a person familiar with the matter said Tuesday night.</p>"
    ],
    "image_url": "",
    "titles": [
      "Sources: Hendrickson set to end Bengals holdout",
      "Bengals' Trey Hendrickson reportedly plans to end holdout, report to camp despite ongoing contract dispute",
      "AP Source: All-Pro Trey Hendrickson ends holdout, will report to Bengals"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.972,
      "consensus": 0.847,
      "constructiveness": 0.6,
      "proximity": 0.75
    },
    "score": 0.786,
    "summary": "Trey Hendrickson, the Bengals Pro Bowl defensive end who led the NFL with 17.5 sacks in 2024, will end his holdout and report to the Cincinnati Bengals' training camp on Wednesday without a new contract, according to a source familiar with the situation.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information for fans and followers of the Cincinnati Bengals and the NFL in general. It informs about the situation of Trey Hendrickson, a significant player, but it doesn't provide any insight into the reasons behind his decision or its potential impacts on the team or the league.",
    "image": {
      "src": "https://live.staticflickr.com/3303/3247853557_da302f9570_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/23d726f3-f607-4e43-afc1-3a78985c4418/thumb/",
      "alt": "Tour of Consumer Reports labs",
      "credit": "edrugsearch / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "ChatGPT's new study mode won't give you the answers - Axios",
    "domain": "technology",
    "location": "national",
    "published": "Tue, 29 Jul 2025 23:12:24 GMT",
    "source": "Axios",
    "sources": [
      "Ars Technica",
      "The Verge",
      "Axios"
    ],
    "domains": [
      "general",
      "technology"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMiakFVX3lxTE1uZ0paamxoRzl0YjAwcjAxXzhqd2pjT3pGaWdMUTQ2T2sybklNanFZQjZPQlFJVEhqUFJ5UmRpMjhzRktwX3NOdll2a0lDMTFCdm16RU0tLXBEUHdYY0hJM0tFS2RmOFB0T1E?oc=5\" target=\"_blank\">ChatGPT's new study mode won't give you the answers</a>&nbsp;&nbsp;<font color=\"#6f6",
      "OpenAI is adding a new study mode for ChatGPT that “helps you work through problems step by step instead of just getting an answer,” according to an OpenAI blog post. It will be available today for ChatGPT Free, Plus, Pro, and Team users and for ChatGPT Edu users “in the next few weeks.” When you [&",
      "New set of system prompts promote understanding with guided questions, \"Socratic dialogue.\""
    ],
    "image_url": "",
    "titles": [
      "ChatGPT's new study mode won't give you the answers - Axios",
      "ChatGPT’s new AI study mode won’t just give you the answer",
      "ChatGPT’s new Study Mode is designed to help you learn, not just give answers"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.83,
      "consensus": 0.897,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.775,
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it highlights an innovation in AI technology and its application in education. It provides readers with useful information about the new study mode of ChatGPT, which can help them make informed decisions about using this tool for learning.",
    "image": {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a8/UK_national_football_team_considering_compete_in_UEFA_Euro_and_FIFA_World_Cup_%E2%80%93_ChatGPT.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/d42ef1c3-17e5-4cfb-bf47-cc4f88da54ab/thumb/",
      "alt": "UK national football team considering compete in UEFA Euro and FIFA World Cup – ChatGPT",
      "credit": "",
      "license": "cc0",
      "license_version": "1.0",
      "license_url": "https://creativecommons.org/publicdomain/zero/1.0/deed.en/",
      "provider": "wikimedia",
      "source": "Openverse"
    }
  },
  {
    "title": "Australia Extends Social Media Ban to YouTube for Under-16s to Protect Youth",
    "domain": "general",
    "location": "global",
    "published": "Wed, 30 Jul 2025 01:24:49 GMT",
    "source": "BBC",
    "sources": [
      "Deutsche Welle",
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "The Australian government says the world-first ban is aimed at protecting youth from online harm.",
      "Australia has reversed a decision that omitted YouTube from its ban on social media platforms for teenagers. A youth social media law will come into effect starting in December.",
      "<p>Communications minister Anika Wells announces the decision to include YouTube in the social media ban for children under 16, but says YouTube Kids will remain exempt. Wells attributes the decision to advice from the eSafety commissioner, saying the government can’t ignore evidence that 'four out "
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/04b2/live/f0cf0aa0-6ce0-11f0-8522-c3d778aa6764.jpg",
    "titles": [
      "YouTube to be included in Australia's teen social media ban",
      "Australia adds YouTube to social media ban for under 16s",
      "YouTube included in Australia's social media ban for children, communications minister says – video"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.869,
      "consensus": 0.847,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.771,
    "summary": "Australia has revised its youth social media law to include YouTube in a ban aimed at protecting those under 16 from online harm, effective December. Initially excluded, YouTube was added following advice from the eSafety commissioner, highlighting the government's commitment to child safety online. However, YouTube Kids will remain accessible. Communications Minister Anika Wells announced the change, emphasizing the necessity of the decision based on evidence of online risks to youth.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive as it highlights a government's solution to a problem (online harm to youth), thereby showing progress. It also provides useful information for parents, educators, and young people about changes in social media access rules. The story increases awareness about the risks of social media use for young people and the measures being taken to mitigate them.",
    "image": {
      "src": "https://live.staticflickr.com/6080/6081951459_1dabfed8d2.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/cf720128-702c-4e65-bfe9-dd297b9d092a/thumb/",
      "alt": "youtube partner",
      "credit": "Sean MacEntee / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "UCLA Settles for $6.5M in Lawsuit Over Antisemitic Discrimination Claims",
    "domain": "general",
    "location": "national",
    "published": "Wed, 30 Jul 2025 01:16:03 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "The Guardian"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "The settlement comes after Jewish students and a professor argued their civil rights were violated when pro-Palestinian protesters blocked access to campus buildings during 2024 demonstrations.",
      "<p>Lawsuit alleges protesters made antisemitic threats with the ‘knowledge and acquiescence’ of university officials </p><p>The University of California, Los Angeles, will pay nearly $6.5m to settle a lawsuit by Jewish students and a professor who said the university allowed antisemitic discriminati"
    ],
    "image_url": "",
    "titles": [
      "UCLA reaches $6 million settlement with Jewish students over campus protests",
      "UCLA agrees to $6.5m settlement with Jewish students over pro-Palestinian protests"
    ],
    "score_components": {
      "magnitude": 0.69,
      "recency": 0.941,
      "consensus": 0.632,
      "constructiveness": 0.7,
      "proximity": 0.75
    },
    "score": 0.733,
    "summary": "The University of California, Los Angeles (UCLA) agreed to pay nearly $6.5 million to settle a lawsuit filed by Jewish students and a professor. They claimed their civil rights were violated during 2024 pro-Palestinian protests, where demonstrators blocked access to campus buildings and made antisemitic threats, allegedly with the knowledge of university officials. This settlement addresses the accusations of antisemitic discrimination facilitated by the university.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story is constructive as it provides useful information about the outcome of a significant lawsuit, which could influence readers' understanding of civil rights and university responsibilities. It also raises awareness about the issue of antisemitism on campuses. However, it doesn't clearly report on any solutions or improvements, limiting its score.",
    "image": {
      "src": "https://live.staticflickr.com/52/162102944_07e9a14d52_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/dd18d682-9d06-4182-acaa-e2f952d28a86/thumb/",
      "alt": "not the momma?",
      "credit": "hudsonthego / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Russia Strikes Ukraine Prison After Trump's Ultimatum, 16 Dead",
    "domain": "general",
    "location": "global",
    "published": "Tue, 29 Jul 2025 18:19:28 GMT",
    "source": "The Guardian",
    "sources": [
      "Washington Post",
      "The Guardian"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "<p>Missile attack on prison in frontline region of Zaporizhzhia kills 16 as Kyiv hopes for US action against Moscow</p><p>Russia launched one of its deadliest night assaults on Ukraine for months in the early hours of Tuesday, the day after Donald Trump said he was setting a new deadline of “10 or 1",
      "The overnight attacks came after President Donald Trump expressed frustration with Russian President Vladimir Putin and brought closer the deadline for a ceasefire."
    ],
    "image_url": "https://i.guim.co.uk/img/media/409306a1bf7e977a14f008f4ea3d9a761d4728c2/40_0_1200_960/master/1200.jpg?width=140&quality=85&auto=format&fit=max&s=009e9ea679d657fdb2f15b429a50e719",
    "titles": [
      "Overnight strikes on Ukraine kill 25 as Trump sets Russia new truce deadline",
      "Russian strikes on Ukraine kill dozens, despite Trump push for ceasefire"
    ],
    "score_components": {
      "magnitude": 0.89,
      "recency": 0.749,
      "consensus": 0.632,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.729,
    "summary": "Following President Donald Trump's tightened ultimatum for a truce with Russia, the country executed one of its most lethal air strikes on Ukraine in months, targeting a prison in the frontline region of Zaporizhzhia and resulting in 16 deaths. This aggressive action occurred shortly after Trump's expression of frustration towards Russian President Vladimir Putin and the advancement of a ceasefire deadline. The attack underscores the escalating tensions and the anticipation of US intervention against Moscow's aggression.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful context about the escalating tensions between the US, Russia, and Ukraine, and the potential implications of Trump's ultimatum. However, it doesn't report on any solutions, improvements, or attempts to solve the problem. It does increase clarity around the impacts of the conflict, but offers limited insight into the underlying causes or systems at play.",
    "image": {
      "src": "https://live.staticflickr.com/1051/996019743_38f08f637e_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/891ff1d9-ffc5-4fd9-b6ea-d47fe07f41d4/thumb/",
      "alt": "The Fish Ultimatum",
      "credit": "Jasen Miller / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Manhattan Shooter Cited CTE, NFL in Note, Hit Wrong Building: Police",
    "domain": "general",
    "location": "national",
    "published": "Tue, 29 Jul 2025 21:05:28 GMT",
    "source": "Axios",
    "sources": [
      "ESPN",
      "ABC News",
      "Axios"
    ],
    "domains": [
      "sports",
      "general"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMiggFBVV95cUxPX1ZIYTFEdXpsNi0wc2F2YWh5SE5mT1NlZlRuRG85YTdHWVZMZjdYdGZ4TjAtOEpzaEpjSjNrNjlFMW1BTFE5bEJuZTlEd2M0Njl6S3U0dUN5MkNiazdQWUJzZ3VGaFdvdkRsak9KRDE4dm1XNWpkcVg3bG5hanJXTEpB?oc=5\" target=\"_blank\">NYC shooting suspect claimed he had CTE: What to kn",
      "Shane Tamura, the suspect in the deadly shooting in Midtown Manhattan, carried a note in his pocket claiming he suffered from CTE and also made references to the NFL, police sources told ABC News.",
      "A gunman who killed four people at a Manhattan office building was trying to target the headquarters of the NFL but took the wrong elevator."
    ],
    "image_url": "",
    "titles": [
      "NYC shooting suspect claimed he had CTE: What to know about the disease - Axios",
      "WATCH:  Manhattan shooting suspect claimed to have CTE, mentioned the NFL in a note",
      "Shooter targeted NFL HQ, claimed to have CTE"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.794,
      "consensus": 0.897,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.728,
    "summary": "Shane Tamura, identified as the gunman in a Midtown Manhattan shooting that left four dead, had a note indicating he suffered from CTE and mentioned the NFL, according to police sources. Tamura mistakenly targeted a different building instead of the NFL headquarters due to an elevator error.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story provides basic awareness about a violent incident and its potential connection to chronic traumatic encephalopathy (CTE), a condition associated with repeated head injuries. However, it lacks depth and actionable insights, and it does not report on solutions or improvements.",
    "image": {
      "src": "https://live.staticflickr.com/7271/7734098362_2dd854d516_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/977b0237-5cfd-43d5-a9c7-208195c430f2/thumb/",
      "alt": "CPSC, NFL Tout Safer Play",
      "credit": "USCPSC / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Sportsnet Launches Trade Tracker for Major League Roster Updates",
    "domain": "sports",
    "location": "national",
    "published": "Tue, 29 Jul 2025 19:00:03 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sports Illustrated"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "You know the major leaguers on the move -- but what about the potential stars of tomorrow headed the other way in those deals?",
      "<a href=\"https://news.google.com/rss/articles/CBMiggFBVV95cUxNSmFfR3l2d3NpZXYxS29PVVE3QWJkVDNEM3lrdnRjSTZ6blhrVnlZY0JQTGZmZ2h6U1ljQ2RJV2dPQ3dncWlJcGptR1RqMGduYWsteU5GTzkzMGhMbkVjYjd6MTNidUo4RzJXZkdfOTBzQTM4elBUOXViSzVJYVc3ZUx3?oc=5\" target=\"_blank\">Four Ideal Fits for Dodgers at 2025 MLB Trade Deadl",
      "<a href=\"https://news.google.com/rss/articles/CBMingFBVV95cUxOb3hFLWdFRk8zUGFoZ2hoS1JzMzJNRXgyRjhxVXk1aGkzM3gwOWlxdmM4N25FLTBnajNvZ2tTUUxoeVVkem42blpyQWFsZ3ZPRG5OeUNTUUFJdzVxTS11bU1RUlgyNW4yQkxibUlaMjRTWFhhVGRRcG9rOHBhLURaVnNJSWVLZU91aGExanNNX0EyS1pvU1dYQ2tPVUh1Zw?oc=5\" target=\"_blank\">Blue Jays Cou"
    ],
    "image_url": "",
    "titles": [
      "Ranking every prospect dealt before the 2025 MLB trade deadline",
      "Four Ideal Fits for Dodgers at 2025 MLB Trade Deadline - Sports Illustrated",
      "Blue Jays Could Be Long-Term Fit for Athletics Left-Hander at Trade Deadline - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.826,
      "consensus": 0.632,
      "constructiveness": 0.9,
      "proximity": 0.75
    },
    "score": 0.698,
    "summary": "Sportsnet's trade tracker offers updates on all major league trades before the deadline, focusing not only on current stars but also on potential future talents moving between teams. This tool is designed to keep fans informed about roster changes as contending teams strengthen their lineups for the post-season.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive as it introduces a new tool for fans to stay informed about roster changes in Major League Baseball. It empowers the reader with actionable insights and a deeper understanding of the dynamics of player trades. It also highlights an innovation in the way sports news is reported."
  },
  {
    "title": "OpenAI Launches Study Mode in ChatGPT to Boost Critical Thinking Skills",
    "domain": "business",
    "location": "national",
    "published": "Tue, 29 Jul 2025 17:00:01 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "TechCrunch"
    ],
    "domains": [
      "technology",
      "business"
    ],
    "snippets": [
      "OpenAI said it built study mode as \"a first step in a longer journey to improve learning in ChatGPT.\"",
      "OpenAI's Study Mode aims to help students develop their own critical thinking skills, rather than just giving answers."
    ],
    "image_url": "",
    "titles": [
      "OpenAI announces new 'study mode' product for students",
      "OpenAI launches Study Mode in ChatGPT"
    ],
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.729,
      "consensus": 0.682,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.673,
    "summary": "OpenAI introduced Study Mode in ChatGPT, designed to enhance students' critical thinking skills by guiding them in their learning process instead of merely providing answers. This feature represents OpenAI's initial effort to enhance educational experiences through their AI technology.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story clearly highlights an innovation aimed at improving education and fostering critical thinking skills. It provides readers with insights into how AI technology can be used in education, which is empowering knowledge.",
    "image": {
      "src": "https://upload.wikimedia.org/wikipedia/commons/a/a8/UK_national_football_team_considering_compete_in_UEFA_Euro_and_FIFA_World_Cup_%E2%80%93_ChatGPT.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/d42ef1c3-17e5-4cfb-bf47-cc4f88da54ab/thumb/",
      "alt": "UK national football team considering compete in UEFA Euro and FIFA World Cup – ChatGPT",
      "credit": "",
      "license": "cc0",
      "license_version": "1.0",
      "license_url": "https://creativecommons.org/publicdomain/zero/1.0/deed.en/",
      "provider": "wikimedia",
      "source": "Openverse"
    }
  },
  {
    "title": "Dating App Tea Faces Lawsuits After Second Data Breach",
    "domain": "business",
    "location": "global",
    "published": "2025-07-29T20:34:37Z",
    "source": "Business Insider",
    "sources": [
      "Business Insider",
      "TechCrunch"
    ],
    "domains": [
      "technology",
      "business"
    ],
    "snippets": [
      "Two class-action lawsuits were filed on Monday against Tea, the app where women can leave anonymous dating advice.",
      "Dating safety app Tea experienced a second data breach in as many weeks, exposing over a million sensitive messages between users."
    ],
    "image_url": "https://i.insider.com/6889208c85e81483682ee0d2?format=jpeg",
    "titles": [
      "Tea app hit with 2 class-action lawsuits after a data breach exposed private messages and 72K images",
      "Tea app disables DMs after second data breach exposed over a million private messages"
    ],
    "score_components": {
      "magnitude": 0.67,
      "recency": 0.785,
      "consensus": 0.682,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.672,
    "summary": "Two class-action lawsuits have been filed against the dating safety app Tea, following a second data breach within weeks, which exposed over a million sensitive user messages. The lawsuits were initiated on Monday in response to the compromised privacy of users on the platform where women share anonymous dating advice.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the risks associated with using digital platforms, specifically dating apps. However, it does not provide solutions or improvements to the issue, nor does it delve into the causes or impacts of data breaches in a meaningful way.",
    "image": {
      "src": "https://live.staticflickr.com/90/231410069_accdc9ad42_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/6da74389-99ed-4c09-9787-b4bf9f3e910b/thumb/",
      "alt": "Tea cup",
      "credit": "Bird Eye / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Cameron Brink Returns from Injury, Sparks Lose to Aces",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 30 Jul 2025 05:18:49 +0000",
    "source": "CBS Sports",
    "sources": [
      "Yahoo Sports",
      "CBS Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Brink was quick to show why she was considered one of the WNBA's top rookies last season",
      "Cameron Brink played her first contest since tearing an ACL last season, but the Sparks lost to the Aces Tuesday at Crypto.com Arena."
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/07/30/57b6cae0-2dd4-4fb8-aefa-d5d8f604e07e/brink-getty.png",
    "titles": [
      "Cameron Brink returns to Sparks: Takeaways from star forward's first action after 13-month absence",
      "Cameron Brink returns but Aces end Sparks' winning streak"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.942,
      "consensus": 0.632,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.666,
    "summary": "Cameron Brink, a standout WNBA rookie, returned to play after recovering from an ACL tear last season. Despite her comeback, the Sparks suffered a loss against the Aces at Crypto.com Arena. Brink's performance highlighted her talent, showcasing why she is regarded as one of the league's top rookies.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story is constructive as it provides useful information about Cameron Brink's return from injury, giving readers a deeper understanding of her performance and the game's outcome. However, it lacks insights into solutions, improvements or innovations in the game.",
    "image": {
      "src": "https://live.staticflickr.com/3803/9474547998_ca71c7f392_m.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/1999b8c2-977f-478a-84aa-426d33abd6fd/thumb/",
      "alt": "Lawyers For Injury San Luis Obispo California",
      "credit": "Injury Lawyers San Luis Obispo / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Starbucks Shares Up 1% in 2023; Price Hikes Considered Amid Sales Drop",
    "domain": "business",
    "location": "national",
    "published": "Tue, 29 Jul 2025 21:46:28 GMT",
    "source": "CNBC",
    "sources": [
      "Business Insider",
      "CNBC"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Shares of Starbucks have risen roughly 1% this year. The company has a market cap of more than $106 billion.",
      "CEO Brian Niccol said price changes are his last resort for improving Starbucks' slumping sales &mdash;&nbsp;but they're \"absolutely\" on the horizon."
    ],
    "image_url": "",
    "titles": [
      "Starbucks same-store sales fall again, but CEO Niccol says turnaround is ahead of schedule",
      "Starbucks CEO Brian Niccol says price changes are a last resort in coffee chain turnaround"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.805,
      "consensus": 0.632,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.659,
    "summary": "Starbucks shares have increased by approximately 1% this year, with the company valued at over $106 billion. CEO Brian Niccol stated that while price changes are a last resort to address declining sales, they are definitely being considered as an option for the future.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful information about Starbucks' financial performance and potential future strategy. It offers insights into the company's decision-making process regarding price changes, which could be useful for investors or individuals interested in business strategies. However, it does not report on any innovative solutions or improvements to address the sales drop.",
    "image": {
      "src": "https://upload.wikimedia.org/wikipedia/commons/6/64/Black_Coffee_and_Tea_in_White_Cup_is_Hot.png",
      "thumbnail": "https://api.openverse.org/v1/images/47af6dc3-22d3-4732-9d3d-36351fe0835d/thumb/",
      "alt": "Black Coffee and Tea in White Cup is Hot",
      "credit": "epSos.de / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "wikimedia",
      "source": "Openverse"
    }
  },
  {
    "title": "Acuña Jr. Exits Game After Injury, Played Despite Monday Incident",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 30 Jul 2025 05:26:35 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sportsnet"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Acuña said he first felt the injury during Monday's game but lobbied to play Tuesday",
      "<p>Atlanta Braves outfielder Ronald Acuña Jr. was removed from the game against the Kansas City Royals on Tuesday night after chasing down a ball in right field in the sixth inning.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/07/30/d6a41611-6223-4697-a559-37f5ea88eb70/acuna-imagn.png",
    "titles": [
      "Ronald Acuña Jr. injury: Braves star headed to IL with Achilles tightness as Atlanta's ugly season continues",
      "Braves’ Acuna Jr. leaves vs. Royals with Achilles tendon tightness, will go to IL"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.945,
      "consensus": 0.632,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.657,
    "summary": "Atlanta Braves outfielder Ronald Acuña Jr. experienced an injury during Monday's game but chose to play on Tuesday. However, he was removed from Tuesday night's game against the Kansas City Royals after attempting to catch a ball in right field during the sixth inning.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story offers basic awareness about the injury of Ronald Acuña Jr. and his decision to play despite the incident. However, it does not provide enough depth or insight into the implications of his injury or the overall impact on the team's performance.",
    "image": {
      "src": "https://live.staticflickr.com/2578/3759627732_b614936fd6_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/0c865bd1-1fb4-46cd-8112-412fbe2ecfd9/thumb/",
      "alt": "Flame Resistant Army Combat Uniform (FR ACU)",
      "credit": "Program Executive Office Soldier / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Liverpool to Play in Yokohama; Arsenal vs. Spurs in Historic Hong Kong Derby",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 30 Jul 2025 06:00:51 +0000",
    "source": "CBS Sports",
    "sources": [
      "Yahoo Sports",
      "CBS Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "The Reds will play against the Japanese club on Wednesday",
      "Everything you need to know ahead of Liverpool’s latest preseason friendly in Yokohama",
      "Arsenal and Tottenham Hotspur are set to continue preseason preparations on Thursday, when the north London rivals meet outside the UK for the first time in derby history — in a so-called friendly — in Hong Kong."
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/07/29/4a823ba7-907e-4a4b-8a75-1a938d27ca7f/salah-5.jpg",
    "titles": [
      "Where to watch Liverpool vs. Yokohama F. Marinos: Live stream, how to watch, start time, prediction, pick",
      "Is Yokohama v Liverpool on TV? Kick-off time, channel and how to watch pre-season friendly today",
      "How to watch Arsenal vs Tottenham Hotspur live: Stream link, TV channel, team news, prediction"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.956,
      "consensus": 0.632,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.639,
    "summary": "Liverpool is scheduled to play a preseason friendly against a Japanese club in Yokohama on Wednesday. Meanwhile, Arsenal and Tottenham Hotspur will face off in a historic preseason derby in Hong Kong on Thursday, marking the first time the North London rivals compete outside the UK.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "While this story provides basic awareness about upcoming soccer matches, it lacks depth or insight beyond that. It doesn't offer actionable insights, report on progress or solutions, or increase clarity around systems, causes, trends, or impacts. Therefore, it has a low constructiveness score.",
    "image": {
      "src": "https://live.staticflickr.com/5585/14776998738_2d442e5313_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/7d774ad6-cde4-4ded-b15b-982f8e629af9/thumb/",
      "alt": "Lovely Sefton Park, Liverpool.",
      "credit": "Radarsmum67 / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Whitecaps Close to Signing Thomas Müller",
    "domain": "sports",
    "location": "national",
    "published": "Tue, 29 Jul 2025 14:50:00 GMT",
    "source": "Sports Illustrated",
    "sources": [
      "Sports Illustrated",
      "Sportsnet"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMihwFBVV95cUxPR2l4R3VCZ2k3RHVoQXVSTEdnV3R1SDNpWkpMd01GZGhKdFFMWWtpZjRxQTNBQklKdFdqSlRLVEJaT1dUQU50d2Vra2FjTVFCRGd3eGNwdDJucFdZb0NzWGNrNWJiRlNmMnV0ZFJZblctQ3A2SjJvRFdFWDJtRVJEcWZlQmpYUm8?oc=5\" target=\"_blank\">Vancouver Whitecaps ‘Finalizing’ Deal for Th",
      "<p>The Vancouver Whitecaps are close to adding a big-name talent.</p>\n<p>Thomas Müller is nearing an agreement with the Canadian squad, according to multiple reports.</p>"
    ],
    "image_url": "",
    "titles": [
      "Vancouver Whitecaps ‘Finalizing’ Deal for Thomas Muller in Summer Swoop - Sports Illustrated",
      "Reports: Thomas Muller agrees to two-year deal with Whitecaps"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.697,
      "consensus": 0.632,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.637,
    "summary": "The Vancouver Whitecaps are reportedly nearing a deal to sign Thomas Müller, marking a significant addition to the Canadian soccer team. This update indicates that the team is finalizing negotiations with the renowned player, as confirmed by multiple sources.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is informative and provides useful context about the potential signing of Thomas Müller by the Vancouver Whitecaps. It indicates a potential improvement for the team, but it doesn't provide enough details about the implications of this signing for the team's future performance or the league.",
    "image": {
      "src": "https://live.staticflickr.com/5350/17580951856_eb69cb2c27_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/eda75a13-f4bd-4e13-8646-701719a323a2/thumb/",
      "alt": "Rogue River",
      "credit": "BLM Oregon & Washington / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Trump Officials Firm on Aug. 1 Trade Deadline Amid Negotiations",
    "domain": "business",
    "location": "national",
    "published": "Tue, 29 Jul 2025 21:08:32 GMT",
    "source": "CNBC",
    "sources": [
      "Business Insider",
      "CNBC"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Top Trump administration officials insist that the Aug. 1 deadline is not changing, even as dozens of countries' trade negotiations are unresolved.",
      "Time is running out for countries to reach an agreement to avoid Donald Trump's delayed tariffs."
    ],
    "image_url": "",
    "titles": [
      "Bessent to American businesses: 'Not the end of the world' if April 2 tariffs kick in",
      "Treasury Secretary Bessent says it's 'not the end of the world' if Trump's snapback tariffs go into effect on Friday"
    ],
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.795,
      "consensus": 0.632,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.634,
    "summary": "Despite ongoing trade negotiations with multiple countries, top Trump administration officials are maintaining that the Aug. 1 deadline remains unchanged.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness about the ongoing trade negotiations and the firm stance of Trump administration officials. However, it lacks depth and insight into the implications of the trade deadline or the potential impacts of the negotiations.",
    "image": {
      "src": "https://live.staticflickr.com/65535/53680538005_48dd53bdf4_m.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/a017082b-0675-493d-abfe-b4d2954fa306/thumb/",
      "alt": "Heather Cox Richardson",
      "credit": "nordique / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "England Celebrates Euro 2025 Win with Fans and Burna Boy at Buckingham Palace",
    "domain": "sports",
    "location": "national",
    "published": "Tue, 29 Jul 2025 12:20:43 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "The Guardian"
    ],
    "domains": [
      "sports",
      "general"
    ],
    "snippets": [
      "England partied with 65,000 fans (and Burna Boy) outside Buckingham Palace after winning Euro 2025. But they already have one eye on the World Cup.",
      "<p>Victorious players greeted by chants, cheers and tears as they ride open-top bus and then lift the trophy on stage</p><p>They came in their tens of thousands, a sea of red and white pouring through Green Park to the Mall. Teenage boys with England flags painted on their faces, little girls in the"
    ],
    "image_url": "",
    "titles": [
      "'The story's not done yet': England celebrate Euro 2025 win with London parade",
      "‘Lionesses hear the roar’: 65,000 England fans celebrate Euros win in London"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.719,
      "consensus": 0.682,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.629,
    "summary": "England celebrated their Euro 2025 victory with 65,000 fans and Burna Boy outside Buckingham Palace, marking a significant moment of national pride. The celebration included an open-top bus parade and the trophy presentation on stage, drawing fans of all ages. Amidst the festivities, the team and its supporters are already looking ahead to the World Cup, indicating their ambition for continued success on the international stage.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers basic awareness about England's Euro 2025 victory and the subsequent celebrations. However, it lacks depth or insight into the significance of the victory, the team's strategy, or how this might influence future games or the sport as a whole.",
    "image": {
      "src": "https://live.staticflickr.com/24/105483997_b33a11f76b_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/42875c2a-28dd-4e56-87ec-63d61026563a/thumb/",
      "alt": "Celebration",
      "credit": "wjarrettc / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "U.S. Launches AI Alignment Project to Boost Innovation",
    "domain": "business",
    "location": "national",
    "published": "Wed, 30 Jul 2025 07:00:34 +0000",
    "source": "Financial Post",
    "sources": [
      "Financial Post"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "The AI Alignment Project comes as the U.S. promotes its AI vision that will remove guardrails on development and deployment"
    ],
    "image_url": "",
    "titles": [
      "Canada commits funding to joint AI safety effort with the U.K."
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.976,
      "consensus": 0.393,
      "constructiveness": 1.0,
      "proximity": 0.5
    },
    "score": 0.464,
    "summary": "The U.S. has launched the AI Alignment Project, aiming to advance its vision for artificial intelligence by reducing restrictions on AI development and deployment. This initiative seeks to foster innovation in the AI sector by easing regulatory constraints.",
    "constructiveness_score": 1.0,
    "constructiveness_reason": "This story is constructive as it informs readers about a new initiative aimed at fostering innovation in the AI sector. It also provides actionable insights for those in the industry who may benefit from reduced regulatory constraints.",
    "image": {
      "src": "https://live.staticflickr.com/6052/6283307472_a9d6197c36_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/53a12973-69f9-402b-a1aa-9ecb2717f90f/thumb/",
      "alt": "Announcing legislation to boost innovative manufacturing",
      "credit": "Senator Stabenow / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Australia Q1 Inflation at 1.1%, Below Economists' 2.2% Forecast",
    "domain": "business",
    "location": "national",
    "published": "Wed, 30 Jul 2025 07:34:04 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "This was lower than the 2.2% expected by economists polled by Reuters, and is almost touching the lower band of the 2%-3% target set by the RBA"
    ],
    "image_url": "",
    "titles": [
      "Australia's second-quarter inflation drops to lowest since March 2021, supporting case for rate cut"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.987,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.446,
    "summary": "Australia's inflation rate for the first quarter of 2021 was 1.1%, below the 2.2% expected by economists. This figure is close to the lower end of the Reserve Bank of Australia's (RBA) target range of 2%-3%.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful information about Australia's economic situation, helping readers understand the current inflation rate and how it compares to predictions. However, it doesn't offer much insight into the reasons for this discrepancy or potential implications.",
    "image": {
      "src": "https://live.staticflickr.com/3658/3462260137_2cd7c42444.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/e45b7919-5d33-49ee-818e-45ddcb8a0699/thumb/",
      "alt": "Formal recognition of human rights?! In Australia?!",
      "credit": "moggs oceanlane / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Kobe University Studies Liverworts for Crop Yield Boost and Space Farming",
    "domain": "science",
    "location": "global",
    "published": "Wed, 30 Jul 2025 01:00:01 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Studying plant vegetative reproduction is key to increasing crop yield and for bioengineering. Kobe University research is making progress in studying the genetic regulation of the process in liverworts, which are ideal model plants and even a candidate for space crops."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/through-the-shot-glass.jpg",
    "titles": [
      "Through the shot glass, and what can be found in liverworts"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.936,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.439,
    "summary": "Kobe University researchers are advancing the study of genetic regulation in plant vegetative reproduction, focusing on liverworts as ideal model plants due to their potential in increasing crop yield and suitability for bioengineering. This research could also make liverworts viable as space crops, highlighting their importance in agricultural science and space exploration.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it reports on innovative research that could potentially increase crop yield and contribute to space farming. It provides useful insights into the study of liverworts and their potential benefits, thus increasing reader's awareness about the potential of plant bioengineering in agriculture and space exploration.",
    "image": {
      "src": "https://live.staticflickr.com/4151/5395404352_39d7a6ab5e_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/adbee445-dc9a-4ab7-a466-d0e626a50b46/thumb/",
      "alt": "110123-A-8041W-057",
      "credit": "ResoluteSupportMedia / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Chinese Scientists Develop Efficient Catalyst for Cleaner Propylene Production",
    "domain": "science",
    "location": "global",
    "published": "Wed, 30 Jul 2025 03:58:35 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/chinese-scientists-develop-breakthrough-catalyst-for-clean-propane-conversion/\" rel=\"nofollow\" title=\"Chinese Scientists Develop Breakthrough Catalyst for Clean Propane Conversion\"><img alt=\"Propane Into Propylene Using Copper Single Atom Catalyst\" class=\"webfeedsFe"
    ],
    "image_url": "",
    "titles": [
      "Chinese Scientists Develop Breakthrough Catalyst for Clean Propane Conversion"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.916,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.435,
    "summary": "Chinese scientists have developed a breakthrough catalyst that enables the clean conversion of propane into propylene. This new catalyst, based on single-atom copper, significantly enhances the efficiency and environmental friendliness of the conversion process. This advancement holds potential for improving the production process of propylene, a key raw material in the plastics industry, by reducing waste and energy consumption.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive. It provides actionable insights about a new catalyst that enhances the efficiency and environmental friendliness of propylene production. It also reports on a solution that could potentially reduce waste and energy consumption in the plastics industry, thus contributing to progress in cleaner production methods."
  },
  {
    "title": "New Plastic Substitute Developed to Combat Ocean Pollution",
    "domain": "science",
    "location": "global",
    "published": "Wed, 30 Jul 2025 03:08:15 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/scientists-develop-plastic-substitute-that-could-fight-ocean-pollution/\" rel=\"nofollow\" title=\"Scientists Develop Plastic Substitute That Could Fight Ocean Pollution\"><img alt=\"Microplastic Nanoplastic Pollution Fingertip\" class=\"webfeedsFeaturedVisual wp-post-image"
    ],
    "image_url": "",
    "titles": [
      "Scientists Develop Plastic Substitute That Could Fight Ocean Pollution"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.9,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.432,
    "summary": "Scientists have developed a new plastic substitute aimed at combating ocean pollution. This innovative material is designed to reduce the environmental impact of traditional plastics, which are a major source of ocean pollution. The substitute is intended to offer a more sustainable option for various uses, potentially lessening the accumulation of harmful plastics in the ocean.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it reports on a solution to a significant global issue - ocean pollution. It provides actionable insights about a new plastic substitute, which increases the reader's understanding of potential solutions to the problem. The story also raises awareness about the environmental impact of traditional plastics.",
    "image": {
      "src": "https://ids.si.edu/ids/deliveryService?id=NMAH-AHB2017q060142",
      "thumbnail": "https://api.openverse.org/v1/images/4e144f42-40e2-4ed6-8108-8c77491de354/thumb/",
      "alt": "Celluloid Billiard Ball",
      "credit": "",
      "license": "cc0",
      "license_version": "1.0",
      "license_url": "https://creativecommons.org/publicdomain/zero/1.0/",
      "provider": "smithsonian",
      "source": "Openverse"
    }
  },
  {
    "title": "Ukraine Releases Footage of Drones Attacking Drilling Platform",
    "domain": "business",
    "location": "global",
    "published": "2025-07-30T06:54:51Z",
    "source": "Business Insider",
    "sources": [
      "Business Insider"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Ukraine's intelligence division showed clips of at least three drones taking off from a small combat craft and crashing into a drilling platform."
    ],
    "image_url": "https://i.insider.com/688993d785e81483682ee8a9?format=jpeg",
    "titles": [
      "Ukraine gave us a new look at how first-person-view drones can attack from boats on the open sea"
    ],
    "score_components": {
      "magnitude": 0.079,
      "recency": 0.974,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.431,
    "summary": "Ukraine's intelligence division released footage showing at least three drones launching from a small combat vessel and subsequently crashing into a drilling platform. This incident highlights the ongoing tensions and military activities in the region.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "While the story does provide awareness about the ongoing tensions and military activities in the region, it lacks depth or insights into the causes, impacts, or potential solutions to these issues."
  },
  {
    "title": "New Iron-Salt Battery Boosts Safety in California Wildfire Zones",
    "domain": "science",
    "location": "global",
    "published": "Tue, 29 Jul 2025 23:06:52 +0100",
    "source": "New Scientist",
    "sources": [
      "New Scientist"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "A battery made from cheap and non-flammable iron and salt could provide emergency power in one of California’s high wildfire risk zones"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/07/29204055/SEI_260537912.jpg",
    "titles": [
      "California bets on iron-salt battery power to protect against wildfire"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.811,
      "consensus": 0.393,
      "constructiveness": 1.0,
      "proximity": 0.5
    },
    "score": 0.424,
    "summary": "A new battery, utilizing affordable and non-flammable materials like iron and salt, has been developed to offer emergency power in high wildfire risk areas of California. This innovation aims to enhance safety and reliability in regions prone to wildfires.",
    "constructiveness_score": 1.0,
    "constructiveness_reason": "This story clearly highlights an innovative solution to a significant problem - wildfires in California. It provides actionable insights about a new technology that can enhance safety and reliability in high-risk areas. It also contributes to the reader's understanding of how technology can be used to tackle environmental challenges.",
    "image": {
      "src": "https://live.staticflickr.com/3250/2991506963_57cd35b4f4_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/27dbcf27-6be0-4890-b2c2-cc597b07f1c2/thumb/",
      "alt": "Oldreive's New Iron Horse tricycle, ca. 1882",
      "credit": "trialsanderrors / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "\"Chemical Clue Discovered for RNA's Origin, Shedding Light on Life's Emergence\"",
    "domain": "science",
    "location": "global",
    "published": "Wed, 30 Jul 2025 03:33:34 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/where-did-rna-come-from-scientists-find-a-chemical-clue/\" rel=\"nofollow\" title=\"Where Did RNA Come From? Scientists Find a Chemical Clue\"><img alt=\"RNA Biotechnology\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"777\" src=\"https://scitechdaily.com/images/RNA-"
    ],
    "image_url": "",
    "titles": [
      "Where Did RNA Come From? Scientists Find a Chemical Clue"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.908,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.423,
    "summary": "Scientists have discovered a chemical clue that could explain the origin of RNA, a crucial molecule for life. This finding, reported by SciTechDaily, suggests that a simple chemical reaction may have been the starting point for RNA formation on early Earth. The research offers significant insights into the biochemical pathways that could have led to the emergence of life.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it offers a deeper understanding of the potential origin of RNA and the emergence of life. While it does not directly provide actionable insights or report on a solution, it increases clarity around the biochemical pathways that could have led to the formation of life, which is a significant scientific question.",
    "image": {
      "src": "https://live.staticflickr.com/8885/28152436400_03b5e625de_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/8ceac2d1-1b8a-46b2-9ce5-fe97a43c6f99/thumb/",
      "alt": "NASA’s Hubble Telescope Makes First Atmospheric Study of Earth-Sized Exoplanets",
      "credit": "NASA Hubble / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Nvidia AI chip challenger Groq said to be nearing new fundraising at $6B valuation",
    "domain": "technology",
    "location": "global",
    "published": "Tue, 29 Jul 2025 22:02:51 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "AI chip startup Groq is in talks to raise a fresh $600 million at a near $6 billion valuation, sources tell Bloomberg, although the deal isn’t yet final and terms could change."
    ],
    "image_url": "",
    "titles": [
      "Nvidia AI chip challenger Groq said to be nearing new fundraising at $6B valuation"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.81,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.411,
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it provides useful information about the progress of Groq, a potential challenger to Nvidia in the AI chip market. It informs about the company's valuation and fundraising efforts, which can be valuable for those interested in the tech industry or potential investors.",
    "image": {
      "src": "https://live.staticflickr.com/5767/30796823531_85932ecaa0_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/183e9fc4-7118-4ee4-bd8c-4589c43f5008/thumb/",
      "alt": "Jen-Hsun Huang, CEO of NVIDIA, carrying the torch for Moore’s Law",
      "credit": "jurvetson / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Space Force bets on commercial entrants in $4B satcom contest",
    "domain": "technology",
    "location": "global",
    "published": "Tue, 29 Jul 2025 23:55:38 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "The Space Force is leveraging commercial competition for the next phase of its PTS program."
    ],
    "image_url": "",
    "titles": [
      "Space Force bets on commercial entrants in $4B satcom contest"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.842,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.41,
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it reports on the progress and innovation in the field of satellite communication. It provides useful insights into the role of commercial entities in this sector, contributing to the readers' understanding of the current trends in space technology.",
    "image": {
      "src": "https://live.staticflickr.com/1792/43185889795_b90f1bb9f3.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/2eac359a-272d-458a-84ca-2e948faf61e0/thumb/",
      "alt": "Pentagon unveils the new Space Force uniforms. “To infinity and beyond”.",
      "credit": "Ronald Douglas Frazier / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Trump claims Europe won’t make Big Tech pay ISPs; EU says it still might",
    "domain": "technology",
    "location": "global",
    "published": "Tue, 29 Jul 2025 19:52:40 +0000",
    "source": "Ars Technica",
    "sources": [
      "Ars Technica"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "EC spokesperson denies network-fee issue is settled, says it must be legislated."
    ],
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/07/trump-with-ec-president-1152x648-1753814456.jpg",
    "titles": [
      "Trump claims Europe won’t make Big Tech pay ISPs; EU says it still might"
    ],
    "score_components": {
      "magnitude": 0.079,
      "recency": 0.774,
      "consensus": 0.393,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.401,
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful context about the ongoing debate on whether Big Tech should pay Internet Service Providers (ISPs). It highlights the differing views of key stakeholders, which can help readers understand the complexities of this issue. However, it does not offer clear solutions or progress towards a resolution.",
    "image": {
      "src": "https://live.staticflickr.com/815/40567174204_f340b664a7_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/193cb26a-47b0-4ceb-90ff-c10ce8c0ee1c/thumb/",
      "alt": "trump",
      "credit": "Book Catalog / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Study: Women Politicians in Europe Face More Uncivil Tweets",
    "domain": "science",
    "location": "global",
    "published": "Tue, 29 Jul 2025 20:00:01 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Women politicians in Europe receive uncivil tweets regardless of how known they are—and women also receive more identity-based attacks than other politicians, reveals a new study in Politics & Gender."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/hate-speech-twitter.jpg",
    "titles": [
      "Women politicians receive more identity-based attacks on social media than men, study finds"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.843,
      "consensus": 0.393,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.4,
    "summary": "A study published in Politics & Gender found that women politicians in Europe are subjected to uncivil tweets irrespective of their prominence. Furthermore, the research highlights that female politicians face more identity-based attacks compared to their male counterparts. This study sheds light on the gendered nature of online harassment faced by women in political positions across Europe.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story is constructive as it provides useful insights into the gendered nature of online harassment faced by women politicians in Europe. It raises awareness about the issue, but does not offer solutions or ways to address the problem.",
    "image": {
      "src": "https://live.staticflickr.com/8144/7653312938_e77f116d69_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/c3f2ab41-2760-4250-8193-636c43f9018b/thumb/",
      "alt": "Medical Study",
      "credit": "born1945 / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Crisis Linked to Accelerated Brain Aging, Study Finds",
    "domain": "science",
    "location": "global",
    "published": "Tue, 29 Jul 2025 16:52:21 +0000",
    "source": "Wired",
    "sources": [
      "Wired"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Stress, isolation, and uncertainty appear to have caused the brain to age quicker for those who lived through the crisis."
    ],
    "image_url": "https://media.wired.com/photos/6887ce3d22a06306cf7c8aca/master/pass/covid-brain-aging-sci-1225022629.jpg",
    "titles": [
      "The Pandemic Appears to Have Accelerated Brain Aging, Even in People Who Never Got Covid"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.727,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.394,
    "summary": "The stress, isolation, and uncertainty during the crisis seem to have accelerated brain aging in individuals. Research suggests that these factors may have had a negative impact on brain health. The outcome is a potential link between the crisis and faster brain aging, highlighting the importance of mental health support during challenging times.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The story raises awareness about the potential impact of stress and isolation on brain health. It provides useful insights from recent research, contributing to a better understanding of the issue. However, it does not report on any solutions or measures to address the problem.",
    "image": {
      "src": "https://live.staticflickr.com/1089/5129607997_660a65a1fc_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/ba8d2d87-372b-4ff6-b233-96389e71d70c/thumb/",
      "alt": "'Citation needed'",
      "credit": "futureatlas.com / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "AI in Wyoming may soon use more electricity than state’s human residents",
    "domain": "technology",
    "location": "global",
    "published": "Tue, 29 Jul 2025 21:24:16 +0000",
    "source": "Ars Technica",
    "sources": [
      "Ars Technica"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Proposed datacenter would demand 5x Wyoming's current power use at full deployment."
    ],
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/07/delivs_tower_1-1152x648.jpg",
    "titles": [
      "AI in Wyoming may soon use more electricity than state’s human residents"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.799,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.389,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story raises awareness about the energy consumption of AI, which is a significant issue. However, without more information on the potential solutions or the broader context, it does not provide actionable insights or empower readers with knowledge.",
    "image": {
      "src": "https://live.staticflickr.com/7594/28799579322_f9e3ce8511_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/b52e7dfb-5b36-417b-8387-f8d7fd8c07e3/thumb/",
      "alt": "Intelligence Inside: the future of AI and computation",
      "credit": "jurvetson / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "YouTube tells creators they can drop more F-bombs",
    "domain": "technology",
    "location": "global",
    "published": "2025-07-29T19:15:13-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "YouTube videos with strong profanity in the first seven seconds (words like “fuck”) are now eligible for full monetization, according to a video from Conor Kavanagh, YouTube’s head of monetization policy experience. Previously, these kinds of videos were only eligible for “limited ad revenue.”   Cha"
    ],
    "image_url": "",
    "titles": [
      "YouTube tells creators they can drop more F-bombs"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.83,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.378,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness about a policy change at YouTube, which can be relevant for content creators. However, it lacks depth or insight into the implications of this change, and does not report on any solutions, improvements, or innovations.",
    "image": {
      "src": "https://live.staticflickr.com/6080/6081951459_1dabfed8d2.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/cf720128-702c-4e65-bfe9-dd297b9d092a/thumb/",
      "alt": "youtube partner",
      "credit": "Sean MacEntee / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "York University Team Confirms Vehicle Stability After Weekend Drive",
    "domain": "science",
    "location": "global",
    "published": "Wed, 30 Jul 2025 02:00:54 +0000",
    "source": "NASA",
    "sources": [
      "NASA"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Written by Conor Hayes, Graduate Student at York University Earth planning date: Monday, July 28, 2025 Today was a pretty straightforward day of planning. Our drive over the weekend completed successfully, and we quickly confirmed that we are parked in a stable position. Thus, we were able to unstow"
    ],
    "image_url": "",
    "titles": [
      "Curiosity Blog, Sols 4614-4615: Driving Along the Boxwork"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.88,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.368,
    "summary": "On July 28, 2025, a team led by Conor Hayes, a graduate student at York University, successfully completed a weekend drive and confirmed their vehicle is in a stable position. The day was dedicated to planning, following the successful completion of their recent maneuver.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers basic awareness about a vehicle's stability after a weekend drive, but it lacks depth or insight. It doesn't provide actionable insights or a deeper understanding for the reader. It also doesn't report on solutions, improvements, or attempts to solve problems, nor does it increase clarity around systems, causes, trends, or impacts that matter.",
    "image": {
      "src": "https://live.staticflickr.com/6020/5925242933_acee0ddd56_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/a2f36775-e702-4f4d-ad40-2dc964c55f19/thumb/",
      "alt": "Conor Hayes abd Markus Strohmaier at Webscience, Galway, Ireland",
      "credit": "Marc_Smith / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Lovense was told its sex toy app leaked users’ emails and didn&#8217;t fix it",
    "domain": "technology",
    "location": "global",
    "published": "2025-07-29T18:07:51-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Lovense, the maker of internet-connected sex toys, left user emails exposed for months — even after it became aware of the vulnerability. In a blog post spotted by TechCrunch and Bleeping Computer, security researcher BobDaHacker found that they could “turn any username into their email address,” wh"
    ],
    "image_url": "",
    "titles": [
      "Lovense was told its sex toy app leaked users’ emails and didn&#8217;t fix it"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.811,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.331,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "image": {
      "src": "https://live.staticflickr.com/4423/36642843045_79db61317f.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/9872123f-7945-42d7-b30e-acc6fa12a320/thumb/",
      "alt": "lovense-level",
      "credit": "mixyclifton / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Opera is filing a complaint over Microsoft&#8217;s tricks that push you to use Edge",
    "domain": "technology",
    "location": "global",
    "published": "2025-07-29T16:08:52-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Microsoft has used a variety of tricks to convince people to keep using the defaults of Bing and Microsoft Edge in Windows over the years, including modifying Chrome download sites and using malware-like popups. Now, Opera is fed up of what it calls Microsoft’s “manipulative design tactics” and file"
    ],
    "image_url": "",
    "titles": [
      "Opera is filing a complaint over Microsoft&#8217;s tricks that push you to use Edge"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.778,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.325,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "image": {
      "src": "https://live.staticflickr.com/2922/14423876669_0c9fac0442_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/74cad31b-a901-4d1a-a26a-18aa07eb6376/thumb/",
      "alt": "Italian Opera Buffet at the Pan Pacific Vancouver",
      "credit": "ppacificvancouver / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  }
]