[
  {
    "title": "California City Faces Second Day of Unrest, Tear Gas Used",
    "domain": "general",
    "location": "global",
    "published": "Sun, 08 Jun 2025 07:34:23 GMT",
    "source": "BBC",
    "sources": [
      "BBC"
    ],
    "snippets": [
      "The Californian city saw a second day of unrest on Saturday, with tear gas fired in the Paramount district."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/6468/live/ef900370-443a-11f0-835b-310c7b938e84.jpg",
    "titles": [
      "Watch: Defiance and anger on the streets of LA"
    ],
    "summary": "On Saturday, the city in California experienced a second consecutive day of unrest, leading to the deployment of tear gas in the Paramount district.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "The story provides basic awareness about the unrest in a city in California, but it lacks depth or insight. It doesn't provide any actionable insights, nor does it report on solutions or attempts to solve the problem.",
    "score_components": {
      "magnitude": 0.089,
      "recency": 0.989,
      "consensus": 0.33,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.391
  },
  {
    "title": "Poroshenko Claims He Can Improve Ukraine-US Ties Despite Sanctions",
    "domain": "general",
    "location": "global",
    "published": "Sun, 08 Jun 2025 07:26:46 +0000",
    "source": "Washington Post",
    "sources": [
      "Washington Post"
    ],
    "snippets": [
      "Former Ukrainian president Petro Poroshenko is a rival to Zelensky and under sanctions, but says he knows how to get the American relationship back on track."
    ],
    "image_url": "",
    "titles": [
      "Ukraine’s previous president says he knows how to win over Trump"
    ],
    "summary": "Former Ukrainian President Petro Poroshenko, despite being a rival to current President Zelensky and facing sanctions, claims he possesses the knowledge to restore and enhance Ukraine's relationship with the United States.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful context on the political dynamics between Ukraine and the United States, and the role of a key player, Poroshenko, in that relationship. However, it does not provide a clear insight into how Poroshenko plans to improve the relationship, nor does it highlight solutions or progress.",
    "score_components": {
      "magnitude": 0.129,
      "recency": 0.987,
      "consensus": 0.33,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.435
  },
  {
    "title": "Man in 80s Rescued from Urea Silo in Queensland",
    "domain": "general",
    "location": "global",
    "published": "Sun, 08 Jun 2025 07:26:26 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "snippets": [
      "<p>Family reported man fell into silo of urea on Sunday afternoon</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p>Specialist fire crews were working on Sunday to rescue a man in his 80s trapped in a silo filled with urea in regional Queensland.</p><p>A Queensland fire department spokesperson said a family member of the man reported just after 1.30pm..."
    ],
    "image_url": "https://i.guim.co.uk/img/media/98e41fabf83a064ddc663400adbf4e13553edcce/0_0_2500_2000/master/2500.jpg?width=140&quality=85&auto=format&fit=max&s=b39c39c21f0a64637a7bc69db4960671",
    "titles": [
      "Queensland fire crews work to rescue man in his 80s stuck up to his neck in silo of fertiliser"
    ],
    "summary": "A man in his 80s became trapped in a urea silo in regional Queensland after a family member reported the incident Sunday afternoon. Specialist fire crews were deployed to rescue him.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "While the story provides awareness about a specific incident, it does not offer deeper understanding or actionable insights for the reader. It does not report on solutions, improvements, or attempts to prevent such incidents in the future.",
    "score_components": {
      "magnitude": 0.089,
      "recency": 0.986,
      "consensus": 0.33,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.411
  },
  {
    "title": "Italian PM Meloni Firmly Opposes Controversial Proposal",
    "domain": "general",
    "location": "global",
    "published": "Sun, 08 Jun 2025 07:22:43 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera"
    ],
    "snippets": [
      "Prime Minister Giorgia Meloni is strongly against the proposal and has urged people to abstain."
    ],
    "image_url": "",
    "titles": [
      "Italy holds referendum on easing citizenship rules"
    ],
    "summary": "Prime Minister Giorgia Meloni of Italy has expressed strong opposition to a proposal, urging the public to abstain from supporting it. Her stance is clear, indicating a decisive rejection of the proposal in question.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "The story provides basic awareness about the stance of the Italian Prime Minister on a certain proposal. However, it lacks depth as it does not provide any details about the proposal, why it's controversial, or why the PM is opposing it. It does not provide actionable insights or deeper understanding.",
    "score_components": {
      "magnitude": 0.089,
      "recency": 0.985,
      "consensus": 0.33,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.391
  },
  {
    "title": "City Clashes Enter Second Day Amid Immigration Raids",
    "domain": "general",
    "location": "global",
    "published": "Sun, 08 Jun 2025 07:17:10 GMT",
    "source": "BBC",
    "sources": [
      "BBC"
    ],
    "snippets": [
      "The city sees a second day of clashes over raids by federal agents on undocumented migrants."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/2383/live/1e143a20-4406-11f0-b6e6-4ddb91039da1.jpg",
    "titles": [
      "Trump orders National Guard to LA after clashes"
    ],
    "summary": "Clashes in the city continued for a second day, triggered by federal agents conducting raids on undocumented migrants. The situation reflects ongoing tensions regarding immigration enforcement.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides awareness about the ongoing clashes in a city and the cause, which is immigration raids. However, it lacks depth and does not provide any solutions or attempts to solve the problem. It does not give the reader actionable insights or deeper understanding of the situation.",
    "score_components": {
      "magnitude": 0.109,
      "recency": 0.983,
      "consensus": 0.33,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.417
  },
  {
    "title": "Bruno Fernandes Rejects Saudi Offer, Aims for Top-Level Success",
    "domain": "general",
    "location": "global",
    "published": "Sun, 08 Jun 2025 07:02:32 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "snippets": [
      "<p>Signing Matheus Cunha and Bryan Mbeumo are leaps of faith, as is hoping Ruben Amorim can solve all the problems</p><p>In publicly rejecting the overtures of the Saudi Pro League, Bruno Fernandes has made it clear he <a href=\"https://www.theguardian.com/football/2025/jun/04/bruno-fernandes-reveals-rejected-saudi-arabia-move-manchester-united\">wants to continue playing football at the highest level</a>. That he wants to challenge for trophies. That he has no interest in wasting what remains of his peak years jogging around aimlessly in the service of a vast public relations project,..."
    ],
    "image_url": "https://i.guim.co.uk/img/media/4468b1f65264b9a69f4acd6a3fe012cc1b9e4e38/1052_0_6880_5504/master/6880.jpg?width=140&quality=85&auto=format&fit=max&s=727ed7ccd18d5ea32ee527e34fb7d9ee",
    "titles": [
      "Bruno Fernandes staying means Manchester United face all kinds of trade-offs | Jonathan Liew"
    ],
    "summary": "Bruno Fernandes publicly declined an offer from the Saudi Pro League, expressing his desire to continue competing at the highest level and pursue trophies, indicating his commitment to not wasting his prime years in a less competitive environment. Meanwhile, the signings of Matheus Cunha and Bryan Mbeumo, along with the hiring of Ruben Amorim, are seen as significant gambles aimed at addressing team issues.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about Bruno Fernandes' career decision and his reasons for it. It also informs about the signings of other players and hiring of a new person, which indicates attempts to address team issues. However, it does not provide deeper insights into why these particular signings and hiring are significant.",
    "score_components": {
      "magnitude": 0.109,
      "recency": 0.978,
      "consensus": 0.33,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.426
  },
  {
    "title": "Syria's Palmyra Faces Surge in Ancient Grave Looting Amid Poverty",
    "domain": "general",
    "location": "global",
    "published": "Sun, 08 Jun 2025 07:00:28 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "snippets": [
      "<p>Collapse of once-feared security apparatus, coupled with widespread poverty, has triggered a gold rush</p><p>They come by night. Armed with pickaxes, shovels and jackhammers, looters disturb the dead. Under the cover of darkness, men exhume graves buried more than 2,000 years ago in Syria’s ancient city of Palmyra, searching for treasure.</p><p>By day, the destruction caused by grave robbers is apparent. Three-metre-deep holes mar the landscape of Palmyra, where ancient burial crypts lure people with the promise of funerary gold and ancient artefacts that fetch thousands of dollars.</p> <a..."
    ],
    "image_url": "https://i.guim.co.uk/img/media/8b65b0876ba427867f3cf2b6af0a0f7d8b2bc203/1120_0_5600_4480/master/5600.jpg?width=140&quality=85&auto=format&fit=max&s=28b1ddc4c4452af3009a1dd260eb9ccd",
    "titles": [
      "Looted from Syria, sold on Facebook: antiquities smuggling surges after fall of Assad"
    ],
    "summary": "The collapse of Syria's security apparatus and widespread poverty have led to a surge in grave looting in the ancient city of Palmyra. Looters, armed with tools like pickaxes and jackhammers, target graves over 2,000 years old under the cover of night, searching for gold and valuable artefacts. The resulting destruction is visible by day, with deep holes damaging the landscape. This activity is driven by the lure of selling these ancient items for significant sums.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful awareness about the current situation in Syria, particularly in Palmyra. It highlights the impacts of poverty and a lack of security on cultural heritage. However, it does not provide solutions or progress towards addressing the issue.",
    "score_components": {
      "magnitude": 0.089,
      "recency": 0.978,
      "consensus": 0.33,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.419
  },
  {
    "title": "UK Gov Negotiates £5.5m Cut to BBC World Service Amid Closure Concerns",
    "domain": "general",
    "location": "global",
    "published": "Sun, 08 Jun 2025 07:00:28 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "snippets": [
      "<p>Reducing budget would involve closing parts of institution promoting UK soft power abroad, leaving gap for Russia to push propaganda</p><p>Hours before Rachel Reeves stood up to deliver her budget last year, government officials were still in tense negotiations with bosses at the BBC over how much the World Service would be given.</p><p>The amount they were haggling over was relatively small – just £5.5m out of a total budget of £400m. But BBC chiefs warned the government that if the cuts were imposed on them, they would have to close several language stations in parts of the world where..."
    ],
    "image_url": "https://i.guim.co.uk/img/media/75104b54d8d134e25ea82a35daea36bd57cfc8c4/0_0_5000_4000/master/5000.jpg?width=140&quality=85&auto=format&fit=max&s=e6f6c09c5b17626d3a8d8080ed2e06d8",
    "titles": [
      "Cuts to BBC World Service funding would ‘make us less safe’, MPs tell ministers"
    ],
    "summary": "The UK government engaged in last-minute negotiations with BBC officials over a £5.5m reduction from the World Service's £400m budget. The BBC warned that such cuts would force the closure of several language stations, potentially leaving a void for Russian propaganda and undermining UK's global soft power.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story offers useful insights into the potential impacts of budget cuts on the BBC World Service, including the potential for increased Russian propaganda and a decrease in UK's global influence. However, it does not report on any solutions or progress towards resolving the issue.",
    "score_components": {
      "magnitude": 0.089,
      "recency": 0.978,
      "consensus": 0.33,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.439
  },
  {
    "title": "Dvalishvili Defends Bantamweight Title at UFC 316, Submits O'Malley",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 8 Jun 2025 03:05:58 EST",
    "source": "ESPN",
    "sources": [
      "ESPN"
    ],
    "snippets": [
      "Merab Dvalishvili kept coming at Sean O'Malley, ultimately submitting him in Round 3 to remain bantamweight champ Saturday night at UFC 316."
    ],
    "image_url": "",
    "titles": [
      "Relentless Dvalishvili taps O'Malley to retain title"
    ],
    "summary": "Merab Dvalishvili successfully defended his bantamweight title at UFC 316 by submitting Sean O'Malley in the third round. The fight took place on Saturday night, where Dvalishvili maintained his championship status with a decisive victory.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about a specific event in the UFC, but it doesn't offer any deeper understanding, actionable insights, or information about progress, solutions, or empowering knowledge.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.979,
      "consensus": 0.33,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.397
  },
  {
    "title": "Jay Wright Declines Knicks Coaching Offer, Stays Retired",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 8 Jun 2025 03:05:58 EST",
    "source": "ESPN",
    "sources": [
      "ESPN"
    ],
    "snippets": [
      "Former Villanova coach Jay Wright confirmed that he is not interested in the Knicks' head coaching vacancy and wishes to remain retired, according to Seth Davis."
    ],
    "image_url": "",
    "titles": [
      "Wright reportedly won't be in mix for Knicks job"
    ],
    "summary": "Former Villanova coach Jay Wright has officially declined interest in the New York Knicks' head coaching position, opting to stay retired. This confirmation was reported by Seth Davis.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "The story provides basic awareness about Jay Wright's decision to decline the Knicks' coaching offer, but it doesn't provide any deeper insight or context about why he made this decision or how it might impact the Knicks or the NBA more broadly.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.979,
      "consensus": 0.33,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.397
  },
  {
    "title": "Sovereignty Wins 157th Belmont Stakes at Saratoga, Defeats Journalism",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 8 Jun 2025 03:05:58 EST",
    "source": "ESPN",
    "sources": [
      "ESPN"
    ],
    "snippets": [
      "Sovereignty bested Journalism on Saturday in a Kentucky Derby rematch to win the 157th Belmont Stakes, and the second hosted at Saratoga."
    ],
    "image_url": "",
    "titles": [
      "Derby victor Sovereignty returns to win Belmont"
    ],
    "summary": "Sovereignty won the 157th Belmont Stakes, outperforming Journalism in a rematch from the Kentucky Derby. This victory took place at Saratoga, marking the second time the event was hosted there.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "The story provides basic awareness about the outcome of the 157th Belmont Stakes, but it doesn't offer any deeper understanding or context about the race, the horses, or the implications of the result.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.979,
      "consensus": 0.33,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.397
  },
  {
    "title": "Aaron Rodgers Signs One-Year, $13.65M Deal with Steelers",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 8 Jun 2025 03:05:58 EST",
    "source": "ESPN",
    "sources": [
      "ESPN"
    ],
    "snippets": [
      "Aaron Rodgers has signed a one-year, $13.65 million deal with the Steelers, sources told ESPN's Adam Schefter, a deal that includes $10 million guaranteed."
    ],
    "image_url": "",
    "titles": [
      "Sources: Rodgers with Steelers, inks $13M+ deal"
    ],
    "summary": "Aaron Rodgers has agreed to a one-year contract with the Pittsburgh Steelers, according to ESPN's Adam Schefter. The deal is valued at $13.65 million, with $10 million of that amount guaranteed.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story provides basic awareness about Aaron Rodgers' new contract with the Steelers, and it gives a bit more depth by providing the specific terms of the deal. However, it doesn't offer any analysis or context about how this might impact the Steelers' performance or the broader NFL landscape.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.979,
      "consensus": 0.33,
      "constructiveness": 0.5,
      "proximity": 0.75
    },
    "score": 0.417
  },
  {
    "title": "Roman Anthony Hits Record 497-Foot Grand Slam for Boston's Triple-A Team",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 8 Jun 2025 03:05:58 EST",
    "source": "ESPN",
    "sources": [
      "ESPN"
    ],
    "snippets": [
      "Roman Anthony, ESPN's No. 1-rated prospect, smashed a 497-foot grand slam for Boston's Triple-A team Saturday night, the longest home run in affiliated baseball this season."
    ],
    "image_url": "",
    "titles": [
      "Red Sox prospect Anthony hits longest HR of '25"
    ],
    "summary": "Roman Anthony, ESPN's top-rated prospect, hit a 497-foot grand slam for Boston's Triple-A team, marking the longest home run in affiliated baseball for the current season. This event took place on a Saturday night.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness of a sports event but does not provide any deeper insights or understanding. It does not report on solutions, improvements, or innovations and does not increase clarity around systems, causes, trends, or impacts.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.979,
      "consensus": 0.33,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.397
  },
  {
    "title": "Sky's Vandersloot Suffers Knee Injury, Exits Game Against Fever",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 8 Jun 2025 03:05:58 EST",
    "source": "ESPN",
    "sources": [
      "ESPN"
    ],
    "snippets": [
      "Sky guard Courtney Vandersloot was carried off the court after going down with a right knee injury midway through the first quarter of Saturday's loss to the Fever."
    ],
    "image_url": "",
    "titles": [
      "Sky deflated by 'heartbreaking' Vandersloot injury"
    ],
    "summary": "Courtney Vandersloot, a player for the Sky, was carried off the court due to a right knee injury during the first quarter of a game against the Fever on Saturday, which resulted in a loss for her team.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness of an injury in a sports game but does not offer any actionable insights or deeper understanding. It does not report on solutions, improvements, or innovations and does not increase clarity around systems, causes, trends, or impacts.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.979,
      "consensus": 0.33,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.404
  },
  {
    "title": "Keyshawn Davis and Brother in Backstage Fight After Loss",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 8 Jun 2025 03:05:58 EST",
    "source": "ESPN",
    "sources": [
      "ESPN"
    ],
    "snippets": [
      "Keyshawn Davis' nightmarish week ended in disaster Saturday night when he and his younger brother were involved in a backstage altercation following older brother Kelvin's loss to Nahir Albright."
    ],
    "image_url": "",
    "titles": [
      "Keyshawn Davis in altercation after brother's loss"
    ],
    "summary": "Keyshawn Davis and his younger brother were involved in a backstage altercation after their older brother, Kelvin, lost to Nahir Albright on Saturday night. This incident capped off a difficult week for Keyshawn Davis, marking a significant low point for the athlete and his family.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "This story is purely reactive and sensational, focusing on a backstage altercation. It does not provide any actionable insights, report on solutions, improvements, or innovations, or increase clarity around systems, causes, trends, or impacts.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.979,
      "consensus": 0.33,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.367
  },
  {
    "title": "Ex-MMA Champion Ben Askren Hospitalized With Severe Pneumonia",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 8 Jun 2025 03:05:58 EST",
    "source": "ESPN",
    "sources": [
      "ESPN"
    ],
    "snippets": [
      "Former MMA champion Ben Askren was hospitalized after developing severe pneumonia, his wife posted on social media on Saturday."
    ],
    "image_url": "",
    "titles": [
      "Ex-MMA star Askren in hospital with severe illness"
    ],
    "summary": "Former MMA champion Ben Askren was hospitalized with severe pneumonia, according to a social media post by his wife on Saturday.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about Ben Askren's health condition but lacks depth or insight. It doesn't offer any actionable insights, solutions, or a deeper understanding of the situation.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.979,
      "consensus": 0.33,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.397
  },
  {
    "title": "Tech Start-Ups Secure Lucrative Contracts, Eye Industry Impact",
    "domain": "business",
    "location": "global",
    "published": "Sun, 08 Jun 2025 04:00:01 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times"
    ],
    "snippets": [
      "Lucrative contracts offer tech start-ups chance to shake up the industry — if they can deliver"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F0ae309ac-e58e-4048-bfa8-1874446f91ce.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Trump’s Golden Dome pits Silicon Valley against defence giants"
    ],
    "summary": "Tech start-ups are being given the opportunity to significantly impact the industry through lucrative contracts. These contracts represent a chance for innovation and growth, but success hinges on the start-ups' ability to fulfill their commitments and deliver on the promises made in these agreements.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story clearly highlights progress in the tech industry, with start-ups securing lucrative contracts. It provides useful insights about the potential for innovation and growth in the sector, and the challenges that start-ups may face in fulfilling their commitments.",
    "score_components": {
      "magnitude": 0.089,
      "recency": 0.918,
      "consensus": 0.33,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.437
  },
  {
    "title": "Repeated Narratives Shape Perceptions of Truth, Study Finds",
    "domain": "business",
    "location": "global",
    "published": "Sun, 08 Jun 2025 04:00:01 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times"
    ],
    "snippets": [
      "Once we have approximated a story enough times — individually and collectively — that becomes our ‘truth’"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F3a5d92ea-5a2a-4143-88cf-7f8c1455c299.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Mr Darcy and the Mandela effect"
    ],
    "summary": "The news content discusses the concept that repeated approximations of a story, both on an individual and collective level, eventually become accepted as 'truth'. This implies that our perceptions of truth are shaped by the frequency and consensus of narratives.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful insights into how repeated narratives can shape perceptions of truth. It increases clarity around the impact of media and communication on public perception. However, it doesn't clearly highlight solutions or empowering knowledge to counter this phenomenon.",
    "score_components": {
      "magnitude": 0.089,
      "recency": 0.918,
      "consensus": 0.33,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.427
  },
  {
    "title": "Government Delays Strategy to Cut High Energy Costs Amid Rising Pressure",
    "domain": "business",
    "location": "global",
    "published": "Sun, 08 Jun 2025 04:00:01 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times"
    ],
    "snippets": [
      "Delay comes as pressure mounts on ministers to draw up plan to cut punishing energy costs"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Ff4dbc6a2-bb37-484e-b0ad-7a3fef5fb01a.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "UK industrial strategy launch pushed back to end of June"
    ],
    "summary": "As pressure increases on government ministers to devise a strategy to reduce high energy costs, there has been a delay in formulating and announcing this plan. The current situation reflects an ongoing concern over the financial burden of energy expenses on consumers, with the government facing calls to act swiftly to alleviate these costs.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information about the government's delay in strategizing to reduce high energy costs. However, it lacks depth on what the strategy might entail or how it could impact consumers, and it doesn't highlight any solutions or progress.",
    "score_components": {
      "magnitude": 0.089,
      "recency": 0.918,
      "consensus": 0.33,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.407
  },
  {
    "title": "Apple Faces Delays in 'Apple Intelligence' Feature Rollout",
    "domain": "business",
    "location": "global",
    "published": "Sun, 08 Jun 2025 04:00:01 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times"
    ],
    "snippets": [
      "iPhone-maker hit by technological challenges that have led to delays to the full rollout of its ‘Apple Intelligence’ features"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F1fd38e60-2de3-476f-918f-666481d1f552.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Apple’s struggles to update Siri lead to investor concerns over AI strategy"
    ],
    "summary": "Apple, the company known for manufacturing iPhones, has encountered technical difficulties that have resulted in delays in the comprehensive launch of its 'Apple Intelligence' features. These challenges have hindered the company's ability to fully implement and offer these new capabilities as initially planned.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness about Apple's delay in rolling out a new feature due to technical difficulties. However, it doesn't provide any actionable insights or deeper understanding about what the 'Apple Intelligence' feature is, why it's important, or how the delay might impact consumers or the company.",
    "score_components": {
      "magnitude": 0.089,
      "recency": 0.918,
      "consensus": 0.33,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.397
  },
  {
    "title": "Startup Expands Infrastructure, Secures Major Contracts for Growth",
    "domain": "business",
    "location": "global",
    "published": "Sun, 08 Jun 2025 04:00:01 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times"
    ],
    "snippets": [
      "Start-up has embarked on expansion of its own infrastructure and secured significant contracts"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Fafd01c09-b3f2-4711-ae96-1b7fd0655405.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Europe’s Mistral benefits from search for AI alternatives"
    ],
    "summary": "A start-up has successfully expanded its infrastructure and secured significant contracts, indicating growth and increased market presence. This development represents a notable advancement in the company's operations and its ability to attract substantial business agreements.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story clearly highlights progress, as it reports on a startup's successful expansion of infrastructure and securing of major contracts. It provides empowering knowledge about the company's growth and increased market presence, which could be useful for potential investors, competitors, or customers.",
    "score_components": {
      "magnitude": 0.089,
      "recency": 0.918,
      "consensus": 0.33,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.437
  },
  {
    "title": "Attack on Political Figure Miguel Uribe Turbay Shocks Nation",
    "domain": "business",
    "location": "global",
    "published": "Sun, 08 Jun 2025 03:41:17 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times"
    ],
    "snippets": [
      "Attack on Miguel Uribe Turbay shocks a country with a long history of political violence"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F4233a9cb-5896-4556-891d-bce2201990e7.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Colombian opposition senator shot in Bogotá"
    ],
    "summary": "An attack targeting Miguel Uribe Turbay, a prominent political figure, has occurred, shocking a nation already burdened by a lengthy history of political violence. The incident underscores ongoing security challenges in the country. The current status of Uribe Turbay following the attack has not been specified in the provided content.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about a violent incident involving a political figure, but it lacks depth or insight. It does not provide actionable insights, solutions, or a deeper understanding of the causes or impacts of the incident.",
    "score_components": {
      "magnitude": 0.089,
      "recency": 0.912,
      "consensus": 0.33,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.376
  },
  {
    "title": "Ter Stegen Set to Discuss Potential Exit with FC Barcelona",
    "domain": "business",
    "location": "global",
    "published": "Sun, 08 Jun 2025 03:03:45 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes"
    ],
    "snippets": [
      "FC Barcelona goalkeeper Marc-Andre ter Stegen is reportedly ready to ‘go to war’ with the club over his potential exit."
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/68452fef5e64d12376405e97/0x0.jpg?width=960",
    "titles": [
      "FC Barcelona Star Ter Stegen Ready To ‘Go To War’ With Club Over Exit, Reports SPORT"
    ],
    "summary": "FC Barcelona's goalkeeper, Marc-Andre ter Stegen, is reportedly prepared to confront the club regarding his potential departure. This situation indicates a significant conflict between the player and the club over his future with the team.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story offers basic awareness about a potential conflict between a player and a football club, but it doesn't provide any actionable insights or deeper understanding of the issue. It also doesn't report on any solutions, improvements, or attempts to solve the problem.",
    "score_components": {
      "magnitude": 0.089,
      "recency": 0.979,
      "consensus": 0.33,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.409
  },
  {
    "title": "Federal Agents Confront Protesters Against Immigration Raids",
    "domain": "business",
    "location": "global",
    "published": "Sun, 08 Jun 2025 03:00:45 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times"
    ],
    "snippets": [
      "Federal agents clash with demonstrators protesting against raids on suspected undocumented workers"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F913a05c0-eac3-4d86-9256-980226bd44e6.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Trump to send national guard to quell immigration protests in LA"
    ],
    "summary": "Federal agents confronted demonstrators who were protesting against raids targeting suspected undocumented workers. The protests were a response to the government's actions aimed at identifying and detaining individuals believed to be working in the country without legal permission. The current status of the confrontation or the outcome of the protests was not specified in the provided information.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about a confrontation between federal agents and protesters. However, it lacks depth or insight into the causes, systems, or impacts of the immigration raids or the protests. It doesn't provide actionable insights or report on any solutions or improvements.",
    "score_components": {
      "magnitude": 0.109,
      "recency": 0.9,
      "consensus": 0.33,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.401
  },
  {
    "title": "New Termite Treatment Kills 95% of Drywood Termites, Safe for Humans",
    "domain": "science",
    "location": "global",
    "published": "Sun, 08 Jun 2025 03:39:58 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/new-chemical-kills-95-of-termites-and-cant-harm-humans/\" rel=\"nofollow\" title=\"New Chemical Kills 95% of Termites and Can’t Harm Humans\"><img alt=\"Western Drywood Colony\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"583\" src=\"https://scitechdaily.com/images/Western-Drywood-Colony-777x583.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>A new termite treatment blocks molting, spreads through colonies, and kills up to 95% when combined with a chemical lure. Drywood termites, which live hidden inside wooden structures,..."
    ],
    "image_url": "",
    "titles": [
      "New Chemical Kills 95% of Termites and Can’t Harm Humans"
    ],
    "summary": "A new termite treatment has been developed that effectively blocks molting, enabling it to spread throughout colonies and kill up to 95% of drywood termites. This method, which is combined with a chemical lure, specifically targets termites living inside wooden structures and is reported to be harmless to humans.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it reports on an innovative solution to a common problem, providing useful information for homeowners or anyone dealing with termite infestations. It also highlights the progress made in developing a method that is safe for humans.",
    "score_components": {
      "magnitude": 0.089,
      "recency": 0.912,
      "consensus": 0.33,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.436
  },
  {
    "title": "Scientists Find Protein That Works in \"Mirror World,\" Challenging Biology Norms",
    "domain": "science",
    "location": "global",
    "published": "Sun, 08 Jun 2025 03:06:01 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/ancient-protein-breaks-biological-rules-by-working-in-a-mirror-world/\" rel=\"nofollow\" title=\"Ancient Protein Breaks Biological Rules by Working in a Mirror World\"><img alt=\"Cellular Life Origin Evolution\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Cellular-Life-Origin-Evolution-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>A molecular reinterpretation of Alice in Wonderland reveals an ancient protein with a surprising function. In a groundbreaking discovery,..."
    ],
    "image_url": "",
    "titles": [
      "Ancient Protein Breaks Biological Rules by Working in a Mirror World"
    ],
    "summary": "Scientists have discovered an ancient protein that defies conventional biological rules by functioning in a \"mirror world\" scenario, akin to the reverse reality described in \"Alice in Wonderland.\" This protein's unique ability challenges our understanding of molecular biology and could have significant implications for the study of life's origins and evolution.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides a deeper understanding of a complex scientific discovery, which could potentially revolutionize our understanding of molecular biology. However, it doesn't provide actionable insights or specific solutions, hence the slightly lower score.",
    "score_components": {
      "magnitude": 0.089,
      "recency": 0.901,
      "consensus": 0.33,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.424
  },
  {
    "title": "Whales Use Bubble Rings as Communication, Aiding Alien Life Research",
    "domain": "science",
    "location": "global",
    "published": "Sat, 07 Jun 2025 23:18:51 EDT",
    "source": "ScienceDaily",
    "sources": [
      "ScienceDaily"
    ],
    "snippets": [
      "Humpback whales have been observed blowing bubble rings during friendly interactions with humans a behavior never before documented. This surprising display may be more than play; it could represent a sophisticated form of non-verbal communication. Scientists from the SETI Institute and UC Davis believe these interactions offer valuable insights into non-human intelligence, potentially helping refine our methods for detecting extraterrestrial life. Their findings underscore the intelligence, curiosity, and social complexity of whales, making them ideal analogues for developing communication..."
    ],
    "image_url": "",
    "titles": [
      "Whales blow bubble rings—And they might be talking to us"
    ],
    "summary": "Scientists from the SETI Institute and UC Davis observed humpback whales blowing bubble rings around humans, a behavior not previously documented. This action is thought to be a form of sophisticated non-verbal communication, highlighting the whales' intelligence and social complexity. The researchers believe studying these interactions could improve our techniques for identifying extraterrestrial life, as it offers insights into non-human intelligence. The findings emphasize the potential of whales as models for developing communication methods with extraterrestrial beings.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive as it increases awareness about the intelligence and social complexity of whales, and how their behavior could aid in the search for extraterrestrial life. It provides useful insights and highlights progress in the field of non-human intelligence research.",
    "score_components": {
      "magnitude": 0.109,
      "recency": 0.905,
      "consensus": 0.33,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.442
  },
  {
    "title": "\"10th-Century Native American Farming System Unearthed in Michigan\"",
    "domain": "science",
    "location": "global",
    "published": "Sat, 07 Jun 2025 23:18:44 EDT",
    "source": "ScienceDaily",
    "sources": [
      "ScienceDaily"
    ],
    "snippets": [
      "In the dense forests of Michigan s Upper Peninsula, archaeologists have uncovered a massive ancient agricultural system that rewrites what we thought we knew about Native American farming. Dating back as far as the 10th century, the raised ridged fields built by the ancestors of the Menominee Indian Tribe covered a vast area and were used for cultivating staple crops like corn and squash. Using drone-mounted lidar and excavations, researchers found evidence of a complex and labor-intensive system, defying the stereotype that small, egalitarian societies lacked such agricultural..."
    ],
    "image_url": "",
    "titles": [
      "Drone tech uncovers 1,000-year-old native american farms in michigan"
    ],
    "summary": "In Michigan's Upper Peninsula, archaeologists discovered an extensive ancient agricultural system dating back to the 10th century, attributed to the ancestors of the Menominee Indian Tribe. Utilizing drone-mounted lidar and excavation techniques, researchers uncovered raised ridged fields used for growing staple crops like corn and squash. This finding challenges previous assumptions about the agricultural practices of small, egalitarian societies, revealing a complex and labor-intensive farming system that significantly contributes to our understanding of Native American history in the region",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive as it provides a deeper understanding of the history of Native American agricultural practices, challenging previous assumptions. It also informs about the techniques used in archaeological research, thus contributing to the reader's knowledge.",
    "score_components": {
      "magnitude": 0.089,
      "recency": 0.905,
      "consensus": 0.33,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.435
  },
  {
    "title": "MegaMove Maps 12,000 Marine Animals, Exposes Gaps in Ocean Protection",
    "domain": "science",
    "location": "global",
    "published": "Sat, 07 Jun 2025 23:18:39 EDT",
    "source": "ScienceDaily",
    "sources": [
      "ScienceDaily"
    ],
    "snippets": [
      "A massive global collaboration has tracked over 12,000 marine animals from whales to turtles to create one of the most detailed movement maps of ocean giants ever assembled. The project, MegaMove, highlights how animal migrations intersect with fishing, shipping, and pollution, revealing alarming gaps in current ocean protections. Even if 30% of the oceans were protected, most critical habitats would still be exposed to threats."
    ],
    "image_url": "",
    "titles": [
      "Satellite tracking of 12,000 marine animals reveals ocean giants are in trouble"
    ],
    "summary": "The MegaMove project, a vast global collaboration, has mapped the movements of over 12,000 marine animals, from whales to turtles, producing a detailed map of their migrations. This initiative reveals the overlap of animal migrations with human activities like fishing, shipping, and pollution, underscoring significant inadequacies in current ocean protection efforts. It highlights that even with 30% of ocean areas protected, many critical habitats remain vulnerable to threats.",
    "constructiveness_score": 1.0,
    "constructiveness_reason": "The story is very constructive, providing actionable insights about the inadequacies in current ocean protection efforts. It increases awareness about the impact of human activities on marine life and highlights the need for improvements in ocean conservation.",
    "score_components": {
      "magnitude": 0.089,
      "recency": 0.905,
      "consensus": 0.33,
      "constructiveness": 1.0,
      "proximity": 0.5
    },
    "score": 0.445
  },
  {
    "title": "New Lab Model Visualizes Fault Contact Points to Understand Earthquakes",
    "domain": "science",
    "location": "global",
    "published": "Sat, 07 Jun 2025 23:18:33 EDT",
    "source": "ScienceDaily",
    "sources": [
      "ScienceDaily"
    ],
    "snippets": [
      "Scientists have built a lab model that visually tracks how microscopic contact points between fault surfaces evolve during earthquake cycles, revealing the hidden mechanics behind both the slow buildup of tectonic stress and the rapid ruptures that cause earthquakes. This breakthrough uncovers a key physical variable long used in models but never fully understood: the real contact area. With LED lighting and transparent materials, researchers watched ruptures unfold in milliseconds and verified their findings with simulations, potentially opening the door to future real-time earthquake..."
    ],
    "image_url": "",
    "titles": [
      "Lighting up earthquakes: How scientists watched ruptures evolve in milliseconds"
    ],
    "summary": "Scientists have developed a laboratory model that allows for the visual tracking of the microscopic contact points between fault surfaces throughout earthquake cycles. This model sheds light on the processes behind the slow accumulation of tectonic stress and the swift ruptures that result in earthquakes. By employing LED lighting and transparent materials, the team was able to observe these ruptures in milliseconds and validate their observations with simulations. This innovation enhances understanding of a critical physical variable—the real contact area—previously used in theoretical models",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it reports on an innovation that enhances understanding of earthquakes, a critical area of study. The story provides useful information about the processes behind earthquakes, and how this new model can help in studying these processes.",
    "score_components": {
      "magnitude": 0.089,
      "recency": 0.905,
      "consensus": 0.33,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.435
  },
  {
    "title": "Binghamton University Develops Dissolvable, Eco-Friendly Batteries",
    "domain": "science",
    "location": "global",
    "published": "Sat, 07 Jun 2025 23:18:28 EDT",
    "source": "ScienceDaily",
    "sources": [
      "ScienceDaily"
    ],
    "snippets": [
      "Scientists at Binghamton University are bringing a sci-fi fantasy to life by developing tiny batteries that vanish after use inspired by Mission: Impossible. Led by Professor Seokheun Choi, the team is tackling one of the trickiest parts of biodegradable electronics: the power source. Instead of using toxic materials, they re exploring probiotics friendly bacteria often found in yogurt to generate electricity. With engineered paper-based batteries that dissolve in acidic environments, this breakthrough could revolutionize safe, disposable tech for medical and environmental use."
    ],
    "image_url": "",
    "titles": [
      "This battery self-destructs: Biodegradable power inspired by \"Mission: Impossible\""
    ],
    "summary": "Scientists at Binghamton University, led by Professor Seokheun Choi, are developing biodegradable batteries that dissolve after use, inspired by concepts from \"Mission: Impossible.\" These innovative batteries are made from engineered paper and utilize probiotics, the beneficial bacteria commonly found in yogurt, to generate electricity. This research aims to address the challenge of creating non-toxic, environmentally friendly power sources for disposable technology, with potential applications in medical devices and environmental monitoring tools. The batteries are designed to dissolve in aci",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive as it reports on a significant innovation in the field of technology and environmental sustainability. It provides actionable insights into how the problem of electronic waste can be addressed, and it enhances the reader's understanding of the potential applications of this technology. It also highlights progress in the development of eco-friendly power sources.",
    "score_components": {
      "magnitude": 0.089,
      "recency": 0.905,
      "consensus": 0.33,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.435
  },
  {
    "title": "Cannabis Use Rises Among Seniors, Now at 7%: Study Shows",
    "domain": "science",
    "location": "global",
    "published": "Sat, 07 Jun 2025 23:16:04 EDT",
    "source": "ScienceDaily",
    "sources": [
      "ScienceDaily"
    ],
    "snippets": [
      "Cannabis use among older Americans has climbed dramatically, with 7% of adults 65 and older now reporting recent use. This rise isn't just in numbers but also in diversity older users today are more likely to be women, college-educated, and higher-income. Researchers suggest legalization and growing social acceptance are contributing factors, especially in states with medical marijuana laws. The trend is especially notable among those with chronic illnesses, raising both opportunities and concerns for medical professionals trying to balance symptom relief with the complexities of aging."
    ],
    "image_url": "",
    "titles": [
      "Cannabis use among seniors surges 46% in two years—Study reveals"
    ],
    "summary": "Cannabis use among Americans aged 65 and older has significantly increased, with 7% now reporting recent use. This demographic shift includes more women, college-educated, and higher-income individuals. The rise is attributed to legalization and social acceptance, particularly in states with medical marijuana laws. This trend is prominent among older adults with chronic illnesses, presenting both potential benefits and challenges for healthcare providers in managing symptom relief alongside the complexities of aging.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the trend of increasing cannabis use among seniors, and the potential implications for healthcare providers. It increases awareness about the demographic shift and the factors contributing to this trend. However, it does not offer solutions or improvements to the challenges presented, such as managing symptom relief alongside the complexities of aging.",
    "score_components": {
      "magnitude": 0.089,
      "recency": 0.904,
      "consensus": 0.33,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.404
  }
]