[
  {
    "title": "U.S. Government Acquires 10% Stake in Intel Amid CEO Resignation Demand",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Fri, 22 Aug 2025 16:17:14 -0400",
    "source": "NPR",
    "sources": [
      "MarketWatch",
      "Business Insider",
      "Fortune",
      "NPR",
      "Axios",
      "Forbes",
      "CNBC",
      "TechCrunch",
      "BBC",
      "The Verge",
      "Ars Technica",
      "Al Jazeera",
      "The Guardian"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.forbes.com",
      "www.bbc.com",
      "news.google.com",
      "techcrunch.com",
      "www.marketwatch.com",
      "www.theverge.com",
      "arstechnica.com",
      "www.cnbc.com",
      "fortune.com",
      "www.theguardian.com",
      "www.npr.org",
      "www.businessinsider.com"
    ],
    "snippets": [
      "The president's highly unusual announcement underscores the Trump administration's desire to take control over U.S. businesses.",
      "President Trump earlier said the company's CEO agreed to the deal in a recent meeting at the White House.",
      "The extraordinary development follows a meeting between CEO Lip-Bu Tan and Trump after he called for Tan&#039;s removal.",
      "<a href=\"https://news.google.com/rss/articles/CBMibkFVX3lxTE81Snd4SUZzUnZJdG1yMGpOb2hueS0zeGJsV0NjRmZNQlg1eGVUOWFPRkJUQk5jemJ3U25BakxBYWxibXZXUWpkMjJpTzJ2RjZPVVVjTUhNc3ZJZnVTdjFUeTE2MG9hZVVZZ0lYNkp3?oc=5\" target=\"_blank\">Trump: Intel agreed to sell 10% stake to U.S. government</a>&nbsp;&nbsp;<font c",
      "Commerce Secretary Howard Lutnick said that the U.S. government has taken a 10% stake in chipmaker Intel.",
      "<p>Unprecedented deal comes after president demanded CEO Lip-Bu Tan to resign over his ties to Chinese firms</p><p>The US government has taken an unprecedented 10% stake in Intel under a deal with the struggling chipmaker and is planning more such moves, according to Donald Trump and the commerce se",
      "The beleaguered chipmaker has been “left behind” its competitors, Trump said.",
      "The US investment in Intel is a rare example of the government taking a stake in a private company. INTC closed up on Friday but dipped after hours.",
      "The US is investing $8.9 billion into Intel, but most of the funds come from money that the government was supposed to pay the embattled chipmaker anyway. In an announcement on Friday, Intel said the federal government will fund its investment using the remaining $5.7 billion in grants it hasn’t yet",
      "Such federal government ownership of a major corporation would mark a dramatic departure from long-standing U.S. policy.",
      "Intel deal could pave the way for the US to profit off CHIPS Act funding.",
      "Commerce Secretary Howard Lutnick previously said the U.S. government should receive equity in return for the CHIPS Act cash grants Intel has received.",
      "Intel has agreed to the U.S. government taking a stake in it, President Donald Trump and the company announced Friday, capping an extraordinary chapter between the White House and the computer-chip maker."
    ],
    "image_url": "",
    "titles": [
      "Intel will give the U.S. government a 10% stake, Trump says",
      "White House announces chipmaker Intel to give US government 10% stake",
      "Trump says US to take 10 percent stake in Intel",
      "Trump: Intel agreed to sell 10% stake to U.S. government - Axios",
      "U.S. government takes 10% stake in Intel, as Trump expands control over private sector",
      "Trump says Intel has agreed to give US government a 10% stake",
      "Trump Says Intel Will Give 10% Stake To U.S., Becoming Third-Largest Shareholder",
      "It's official: The US government is taking a nearly 10% stake in Intel",
      "US government takes 10 percent stake in Intel in exchange for money it was already on the hook for",
      "US government plans to take a 10% stake in Intel",
      "Trump says US will take 10% stake in Intel because CEO wants to “keep his job”",
      "Trump says Intel agreed to give the government 10% of the chipmaker. ‘We do a lot of deals like that. I’ll do more of them’",
      "Intel agrees to 10% U.S. government stake. It may not be the last chip company to do so."
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.922,
      "consensus": 1.0,
      "constructiveness": 0.2,
      "proximity": 0.75
    },
    "score": 0.879,
    "summary": "The U.S. government has taken an unprecedented 10% stake in chipmaker Intel, a move announced by President Trump and confirmed by both parties. This decision follows Trump's demand for Intel CEO Lip-Bu Tan to resign due to his connections with Chinese firms. The investment, totaling $8.9 billion, is part of a broader strategy to support the struggling chipmaker and is financed largely through previously allocated government grants. This development marks a significant shift in U.S. policy, as it is rare for the government to take ownership in private corporations. The deal was finalized after ",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: development, support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Man Wrongly Deported to El Salvador Returns to U.S. for Trial",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Fri, 22 Aug 2025 16:08:11 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "Forbes",
      "ABC News",
      "Al Jazeera",
      "The Guardian"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.npr.org",
      "abcnews.go.com",
      "www.theguardian.com",
      "www.forbes.com"
    ],
    "snippets": [
      "The case of Abrego Garcia, a Maryland man originally from El Salvador, raised basic questions of due process in Trump's crackdown on undocumented immigrants after he was arrested and sent to a maximum security prison in El Salvador, violating a U.S. immigration judge's 2019 order prohibiting his dep",
      "Abrego Garcia will return to family as he awaits trial over alleged human smuggling brought by Trump administration.",
      "Kilmar Abrego Garcia, who was wrongly deported in March before being brought back to the U.S., was released from criminal custody in Tennessee on Friday.",
      "The Salvadoran native has been in criminal custody since the federal government brought him back to the U.S. in June to face human smuggling charges.",
      "<p>Ábrego will return home to Maryland from Tennessee for first time after wrongful deportation to El Salvador</p><p><a href=\"https://www.theguardian.com/us-news/kilmar-abrego-garcia\">Kilmar Ábrego García</a> has been freed on Friday from criminal custody in Tennessee so he can rejoin his family in ",
      "Abrego Garcia was mistakenly deported in March to El Salvador, triggering a months-long legal battle between his lawyers and the federal government."
    ],
    "image_url": "",
    "titles": [
      "Kilmar Abrego Garcia released from federal custody pending criminal trial",
      "Wrongfully deported Kilmar Abrego Garcia released from Tennessee jail",
      "Kilmar Abrego Garcia released from criminal custody",
      "WATCH:  Kilmar Abrego Garcia released from criminal custody in Tennessee",
      "Kilmar Ábrego García released from criminal custody after court order",
      "Kilmar Abrego Garcia Released From Criminal Custody As DHS Reportedly Threatens Deportation"
    ],
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.919,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.838,
    "summary": "Kilmar Abrego Garcia, originally from El Salvador and living in Maryland, was mistakenly deported to El Salvador in March, despite a U.S. immigration judge's 2019 order against his deportation. After a legal battle, he was brought back to the U.S. in June to face charges of human smuggling, a case brought by the Trump administration. Garcia was released from criminal custody in Tennessee on Friday and will return to his family in Maryland as he awaits trial.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Canada Exempts Most U.S. Goods from Tariffs, Keeps 25% on Key Metals, Autos",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Fri, 22 Aug 2025 18:14:29 +0000",
    "source": "Al Jazeera",
    "sources": [
      "New York Times",
      "Washington Post",
      "CityNews",
      "CNBC",
      "Financial Times",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.washingtonpost.com",
      "ottawa.citynews.ca",
      "www.nytimes.com",
      "www.cnbc.com",
      "www.ft.com"
    ],
    "snippets": [
      "Prime Minister Mark Carney says most Canadian goods will be exempted from US tariffs while some sectoral duties remain.",
      "Canada announced Friday it was dropping many of its retaliatory tariffs on U.S. goods, though the 25% counter-tariff on autos, steel and aluminum remains.",
      "Prime Minister Mark Carney announces removal of 25% levy on many goods from neighbour",
      "Prime Minister Mark Carney said Canada will lift its tariffs on U.S. goods that comply with a free trade pact but keep tariffs on U.S. steel, aluminum and autos.",
      "Canada’s leader said he would follow the United States in dropping tariffs against American goods covered by the existing free trade agreement.",
      "OTTAWA — Canada will drop some retaliatory tariffs on American products to match U.S. tariff exemptions for goods covered under the Canada-United States-Mexico Agreement, Prime Minister Mark Carney announced Friday. After meeting with his cabinet, Carney said at a news conference the change will tak"
    ],
    "image_url": "",
    "titles": [
      "Canada to ease most retaliatory tariffs against United States",
      "Canada drops many of its retaliatory tariffs on the U.S.",
      "Canada to drop retaliatory tariffs on billions of dollars’ worth of US products",
      "Canada drops some retaliatory tariffs in bid to restart trade talks",
      "Canada To Drop Some Retaliatory Tariffs on U.S. Products, Carney Says",
      "Carney announces that Canada is dropping many retaliatory tariffs on U.S. goods"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.884,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.827,
    "summary": "Canada, under Prime Minister Mark Carney, will exempt most U.S. goods from tariffs, aligning with the Canada-United States-Mexico Agreement. However, Canada will maintain a 25% tariff on U.S. steel, aluminum, and autos. This decision follows Canada's move to drop many retaliatory tariffs on U.S. products, while the U.S. grants tariff exemptions for Canadian goods covered by the trade pact.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "I'm sorry, but I didn't receive a summary from you. Could you please provide one",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 22 Aug 2025 19:27:21 GMT",
    "source": "BBC",
    "sources": [
      "Deutsche Welle",
      "ABC News",
      "CNBC",
      "BBC",
      "Financial Times",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.bbc.com",
      "www.dw.com",
      "abcnews.go.com",
      "www.cnbc.com",
      "www.ft.com"
    ],
    "snippets": [
      "Bolton served in Trump's first administration but has since become a fierce critic of the president.",
      "FBI agents are searching the home and office of former US National Security Adviser John Bolton.",
      "John Bolton, a former security adviser to Donald Trump, has become a vocal critic of the US president. Reports indicate that the search is linked to Bolton's handling of classified documents.",
      "ABC News’ Katherine Faulders says the search stems from federal prosecutors’ belief that Bolton could have classified information in his possession..",
      "FBI Director Kash Patel tweeted “NO ONE is above the law… @FBI agents on mission\" as agents searched the home of ex-Trump advisor John Bolton in Maryland.",
      "Foreign policy hawk has emerged as a staunch critic of the US president"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/479c/live/a2a12e30-7f87-11f0-9ae6-2781a6562cc1.jpg",
    "titles": [
      "FBI searches home of Trump adviser-turned-critic John Bolton",
      "FBI raids home and office of ex-Trump official John Bolton",
      "US: FBI searches home of John Bolton — reports",
      "WATCH:  FBI searches home of former Trump admin. national security adviser John Bolton",
      "FBI raids home, office of John Bolton, former Trump national security advisor",
      "FBI raids home of former Trump national security adviser John Bolton"
    ],
    "score_components": {
      "magnitude": 0.986,
      "recency": 0.888,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.823,
    "summary": "",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Chelsea Crushes West Ham 5-1, Deepening Relegation Worries",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Fri, 22 Aug 2025 21:41:40 +0000",
    "source": "CBS Sports",
    "sources": [
      "Sky Sports",
      "Sportsnet",
      "CBS Sports",
      "The Guardian"
    ],
    "domains": [
      "www.skysports.com",
      "www.theguardian.com",
      "www.cbssports.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Chelsea ruthlessly exploited their London rivals, crushing West Ham so thoroughly that relegation worries already are front of mind",
      "<p>This was Graham Potter finding out what a broken club really looks like. It is the London Stadium emptying out long before full time, patience worn thin by the latest in a long line of humiliations. It is one young fan mounting a solo pitch invasion after being driven to despair by his side’s ina",
      "Chelsea steamrolled past a woeful West Ham 5-1 as the heat intensified on Hammers boss Graham Potter.",
      "<p>Chelsea piled on the early season misery for West Ham and its under-fire manager Graham Potter by handing out a 5-1 thrashing in the Premier League on Friday, all without injured star Cole Palmer.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/08/22/fc24f644-d1f0-4fab-b10e-2a2459ae2dd6/untitled-design-2025-08-22t233859-550.png",
    "titles": [
      "Chelsea crush West Ham 5-1 and usher in the Premier League's first crisis of the season for Graham Potter",
      "Estêvão inspires Chelsea to thrash West Ham and put pressure on Graham Potter",
      "Chelsea steamroll hapless West Ham as heat on Potter intensifies",
      "Chelsea outclasses West Ham in Premier League without injured Palmer"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.95,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.779,
    "summary": "Chelsea delivered a devastating 5-1 victory over West Ham, exacerbating relegation fears for the latter. The match highlighted significant issues within West Ham, leading to an early exit of fans and a pitch invasion by a distraught young supporter. This defeat puts additional pressure on West Ham's manager, Graham Potter, as Chelsea dominated the game even without their injured star, Cole Palmer.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Commanders Trade Brian Robinson Jr. to 49ers for 2026 Sixth-Round Pick",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Fri, 22 Aug 2025 18:56:28 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "The Commanders are trading running back Brian Robinson Jr. to the 49ers for a 2026 sixth-round pick, sources told ESPN's Adam Schefter.",
      "Christian McCaffrey has a new handcuff to draft and stash",
      "<p>The Washington Commanders have traded Brian Robinson Jr., a 2022 third-round pick, to the 49ers in exchange for a 2026 sixth-round pick, ESPN&#8217;s Adam Schefter reported Friday. </p>"
    ],
    "image_url": "",
    "titles": [
      "Sources: Commanders trading Robinson to 49ers",
      "Fantasy Football fallout: Commanders trade Brian Robinson Jr. to the 49ers; here's what to know before drafts",
      "Report: Commanders trade RB Brian Robinson to 49ers"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.975,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.757,
    "summary": "The Washington Commanders have traded running back Brian Robinson Jr. to the San Francisco 49ers. In return, the Commanders will receive a sixth-round pick in the 2026 NFL Draft. This move was reported by ESPN's Adam Schefter. Robinson, who was selected in the third round of the 2022 Draft, will now serve as a backup option for the 49ers, complementing their current running back lineup.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Hall of Fame Jockey Ron Turcotte Dies at 84",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Fri, 22 Aug 2025 18:56:27 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Hall of Fame jockey Ron Turcotte, who rode Secretariat to the Triple Crown in 1973, has died. He was 84.",
      "Turcotte won more than 3,000 races in his career, most notably as the jockey for the legendary Secretariat",
      "<p>Hall of Fame jockey Ron Turcotte, who rode Secretariat to the Triple Crown in 1973, has died. He was 84.</p>"
    ],
    "image_url": "",
    "titles": [
      "Secretariat Triple Crown jockey Turcotte, 84, dies",
      "Ron Turcotte, Secretariat's jockey and horse racing legend, dies at 84",
      "Canada’s Ron Turcotte,  jockey who rode Secretariat to Triple Crown, dead at 84"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.975,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.757,
    "summary": "Ron Turcotte, the Hall of Fame jockey famous for riding Secretariat to a Triple Crown victory in 1973, has passed away at the age of 84. Over his career, Turcotte achieved more than 3,000 race wins, with his most notable achievement being his partnership with the legendary racehorse Secretariat.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Announces Tariff Probe on Imported Furniture, Stocks Dip",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Fri, 22 Aug 2025 21:17:46 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "Financial Post",
      "CNBC"
    ],
    "domains": [
      "financialpost.com",
      "www.cnbc.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMidkFVX3lxTFAxUDJGRE9TSzhNM25tSXhEck5wTWNySEhhOHp3dVNjbUFTOVM4UnIyTGVjQ2RYcHdhUDZpVklhNlBmRlUwZU5xaE5mTzBhb0E2RHRoY29pelUzSlZEYk93aGZJUVNDTmFmY2ozOGVocklFUmtURHc?oc=5\" target=\"_blank\">Trump threatens heavy furniture tariffs in coming months</a>&nbsp;&n",
      "Stocks for some furniture and home goods companies, including Wayfair, RH and Williams-Sonoma, tumbled after the market close, following Trump's post.",
      "President Donald Trump said the US is conducting a “major Tariff Investigation  on Furniture coming into the United States,” setting the stage for industry-specific levies."
    ],
    "image_url": "",
    "titles": [
      "Trump threatens heavy furniture tariffs in coming months - Axios",
      "Trump says furniture tariffs are coming later this year",
      "Trump Announces Furniture Imports Probe, Setting Up Tariffs"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.922,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.735,
    "summary": "President Donald Trump announced a \"major Tariff Investigation on Furniture coming into the United States,\" indicating potential future tariffs on imported furniture. Following his announcement, stocks for furniture and home goods companies such as Wayfair, RH, and Williams-Sonoma experienced a decline after the market closed. This move by Trump suggests upcoming industry-specific levies that could impact the furniture sector.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Study: Oil and Gas Pollution Causes 91,000 US Deaths Annually, Minorities Most A",
    "domain": "business",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Fri, 22 Aug 2025 18:00:38 GMT",
    "source": "The Guardian",
    "sources": [
      "Phys.org",
      "Forbes",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.forbes.com",
      "phys.org"
    ],
    "snippets": [
      "<p>Study analyzed health impacts of fossil fuels from exploration to end use, and found communities of color bear brunt of harm</p><p><a href=\"https://www.theguardian.com/environment/air-pollution\">Air pollution</a> from oil and gas causes more than 90,000 premature deaths and sickens hundreds of th",
      "Residents of California, Texas, New York, Pennsylvania and New Jersey are hit the hardest.",
      "Air pollution from oil and gas is causing 91,000 premature deaths and hundreds of thousands of health issues across the United States annually, with Black, Asian, Native American and Hispanic groups consistently the most affected, finds a major new study led by researchers at UCL and the Stockholm E"
    ],
    "image_url": "https://i.guim.co.uk/img/media/a507531a55ca882affdb1c4315f9729cb9bf85d6/562_0_5624_4504/master/5624.jpg?width=140&quality=85&auto=format&fit=max&s=7afc990aef0af104c1140ea6c1c62130",
    "titles": [
      "Air pollution from oil and gas causes 90,000 premature US deaths each year, says new study",
      "Study Links Oil And Gas Pollution With 90,000 Premature Deaths, 10,000 Preterm Births Annually",
      "Oil and gas air pollution linked to 91,000 early deaths in the US each year"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.861,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.719,
    "summary": "A study by UCL and the Stockholm Environment Institute found that air pollution from oil and gas results in 91,000 premature deaths annually in the US, disproportionately affecting communities of color. States like California, Texas, New York, Pennsylvania, and New Jersey are the most impacted. The research highlights the significant health burdens borne by Black, Asian, Native American, and Hispanic populations due to fossil fuel pollution.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: research",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Seeks Removal of Fed's Cook Over Dual Residence Allegations",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Fri, 22 Aug 2025 17:24:00 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Axios",
      "CNBC",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.cnbc.com",
      "news.google.com"
    ],
    "snippets": [
      "Cook, who has been accused of mortgage fraud, says she will not be &#039;bullied&#039; into resigning by the president.",
      "<a href=\"https://news.google.com/rss/articles/CBMib0FVX3lxTE1ESFZRV3lsaU83RWJZZ1gyQnZUTmJBR0Z0YkZUWmZsVXV0WjZ4VzhDcmlwN0RGQ0tCOTM2S0VEQTRiNXJPUjVzNTRXejIwb3JnckhWNER0SnVNSVlFMnZHYzNNWUNiSVd1S3pUZGRNUQ?oc=5\" target=\"_blank\">Trump says he'll fire Fed governor Cook if she doesn't resign</a>&nbsp;&nbsp;",
      "President Donald Trump said Friday he will fire Federal Reserve Governor Lisa Cook if she does not resign from her position."
    ],
    "image_url": "",
    "titles": [
      "Trump threatens to fire US Fed Governor Lisa Cook",
      "Trump says he'll fire Fed governor Cook if she doesn't resign - Axios",
      "Trump says he'll fire Fed Governor Lisa Cook 'if she doesn't resign'"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.868,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.717,
    "summary": "President Donald Trump announced he will attempt to remove Federal Reserve Governor Lisa Cook from her position if she does not resign. This statement follows accusations by Federal Housing Finance Agency Director Bill Pulte, who alleged Cook committed mortgage fraud by claiming two properties as her primary residence. Trump's demand intensifies his administration's pressure on Cook.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UN Declares Famine in Northern Gaza Amid Ongoing Conflict",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 22 Aug 2025 16:56:49 GMT",
    "source": "BBC",
    "sources": [
      "Washington Post",
      "BBC",
      "New York Times"
    ],
    "domains": [
      "www.nytimes.com",
      "www.bbc.com",
      "www.washingtonpost.com"
    ],
    "snippets": [
      "A UN-backed body confirms famine in Gaza City and surrounding areas, and says half a million are facing \"catastrophic\" conditions.",
      "More than half a million people in and around Gaza City are facing catastrophic conditions “characterized by starvation, destitution and death,” the IPC said.",
      "At least half a million people in the enclave were facing the most severe conditions measured by U.N.-backed international experts: starvation, acute malnutrition and death."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/4735/live/b138f6a0-7f35-11f0-b7ed-0b17109072b5.jpg",
    "titles": [
      "Famine in Gaza City is 'failure of humanity', UN chief says",
      "Famine confirmed in Gaza City region, global hunger monitor says",
      "Gaza City and Surrounding Areas Officially Hit by Famine, Global Group Says"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.843,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.705,
    "summary": "The U.N.-backed Integrated Food Security Phase Classification (IPC) has officially declared a famine in northern Gaza, marking the first confirmation of famine in the Middle East. This crisis comes after 22 months of conflict between Israel and the Palestinian territory. UN Secretary-General Antonio Guterres described the situation as a 'man-made disaster' and called for immediate action. The IPC reports that over half a million people in and around Gaza City are experiencing catastrophic conditions, including starvation, destitution, and death.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Powell's Remarks Spark Rally in US Stocks and Bonds",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Fri, 22 Aug 2025 15:46:27 +0000",
    "source": "Al Jazeera",
    "sources": [
      "ABC News",
      "Al Jazeera",
      "Financial Times"
    ],
    "domains": [
      "www.aljazeera.com",
      "abcnews.go.com",
      "www.ft.com"
    ],
    "snippets": [
      "Powell&#039;s remarks offered little guidance about how soon or how quickly rates might continue to move lower.",
      "ABC News' Alexis Christoforous discusses how Federal Reserve Chair Jerome Powell's statements affected the market.",
      "US stocks and bonds rally as central bank chair says economic risks are ‘shifting’"
    ],
    "image_url": "",
    "titles": [
      "US Fed Reserve Chair Powell opens door to September rate cut",
      "WATCH:  Stocks rally as Fed Chair Jerome Powell signals rate cut",
      "Powell paves the way for Fed rate cut in September"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.84,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.705,
    "summary": "Federal Reserve Chair Jerome Powell's recent statements led to a rally in US stocks and bonds. He indicated that economic risks are \"shifting,\" but provided limited guidance on the future pace or extent of interest rate reductions. This lack of detailed direction has influenced market movements, as noted by ABC News' Alexis Christoforous.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Stocks Surge as Fed Chair Powell Signals Rate Cuts Amid Economic Risks",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Fri, 22 Aug 2025 14:21:16 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "CNBC",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.cnbc.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMic0FVX3lxTFAxVFhycW9tekgwRjRFTEtwbjlYbE1RTTluTk16TjNzRWFySVFCNHd3R0tlT29ndkZDVnZQa3NjRTVwUWgxeml4YjJjdUdaU2ZQRDV6elZWNjRZR1dFYVlrS1ZESHpEMTBld2gycnZHSDNOaUE?oc=5\" target=\"_blank\">Stocks surge after Powell signals rate cuts ahead</a>&nbsp;&nbsp;<font c",
      "Home Depot is soaring more than 4%. Caterpillar is surging too.",
      "<p>Powell – whom Trump has urged to resign – addressed ‘challenging’ dichotomy of economic risks, including tariffs</p><p>The <a href=\"https://www.theguardian.com/business/federal-reserve\">Federal Reserve</a> is gearing up to resume cuts to interest rates, its chair, <a href=\"https://www.theguardian"
    ],
    "image_url": "",
    "titles": [
      "Stocks surge after Powell signals rate cuts ahead - Axios",
      "Fed's Powell signals rate cuts are coming, and the stocks that need them the most are flying",
      "Fed chair Jerome Powell signals interest rate cuts amid Trump attacks"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.798,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.703,
    "summary": "Stocks surged following Federal Reserve Chair Powell's signal of impending interest rate cuts. Powell, despite being urged by Trump to resign, discussed the economic risks posed by tariffs and other challenges. The Federal Reserve is preparing to lower interest rates to address these issues.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "India's Supreme Court Revises Stray Dog Removal Plan Amid Public Outcry",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-08-22T06:51:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Washington Post",
      "Deutsche Welle",
      "The Guardian"
    ],
    "domains": [
      "www.dw.com",
      "www.theguardian.com",
      "www.washingtonpost.com"
    ],
    "snippets": [
      "India's Supreme Court previously ordered the removal of stray dogs from the streets of the capital, citing an increase in dog bite incidents. This decision sparked widespread outcry.",
      "<p>Country suspends ‘catch-and-keep’ plan for strays in favour of a more ‘holistic’ approach</p><p>India’s top court has scaled back an order to <a href=\"https://www.theguardian.com/world/2025/aug/11/indian-court-orders-removal-of-thousands-of-stray-dogs-from-new-delhi-region\">clear Delhi’s streets ",
      "The countless stray dogs that wander India’s capital and environs have been granted a reprieve, after outcry over a court order to round them up."
    ],
    "image_url": "",
    "titles": [
      "India's top court halts stray dog removals in New Delhi",
      "India scales back plan to remove stray dogs from streets of Delhi",
      "Order to purge Delhi streets of stray dogs reversed by India’s top court"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.697,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.676,
    "summary": "India's Supreme Court revised its decision to remove stray dogs from New Delhi's streets after public outcry, opting instead for a more holistic approach. The initial order, aimed at reducing dog bite incidents, has been scaled back, allowing the strays a reprieve.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Meta Partners with Midjourney for AI Image Tech Licensing",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-08-22T17:07:04-04:00",
    "source": "The Verge",
    "sources": [
      "TechCrunch",
      "The Verge"
    ],
    "domains": [
      "www.theverge.com",
      "techcrunch.com"
    ],
    "snippets": [
      "Meta is partnering with Midjourney to “license their aesthetic technology” for use in its own models and products, Meta’s new chief AI officer, Alexandr Wang, announced on Friday. The partnership involves a “technical collaboration between our research teams,” Wang said, suggesting the deal involves",
      "Meta's chief AI officer said that the company is partnering with Midjourney to license its AI image and video model technology."
    ],
    "image_url": "",
    "titles": [
      "Meta is going to stuff Midjourney AI images into your feed",
      "Meta partners with Midjourney on AI image and video models"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.938,
      "consensus": 0.591,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.67,
    "summary": "Meta has entered into a partnership with Midjourney to license the latter's AI image and video model technology. Announced by Meta's new Chief AI Officer, Alexandr Wang, the collaboration will include a technical exchange between the companies' research teams, aiming to integrate Midjourney's aesthetic technology into Meta's products and models.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: collaboration, research",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "NFL Preseason Deals: 49ers, Commanders, Saints Trade Evaluations",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Fri, 22 Aug 2025 15:22:51 EST",
    "source": "ESPN",
    "sources": [
      "Sports Illustrated",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "news.google.com"
    ],
    "snippets": [
      "Who won the 49ers-Commanders trade? Why did the Saints give up so much for a 27-year-old wide receiver? We sized up preseason NFL deals.",
      "<a href=\"https://news.google.com/rss/articles/CBMimgFBVV95cUxQU09uQXR0WUI2dEV2NjVEdzBpeDhNemx6My1JM1ViQzNyWlR4QjBfb092NTIwZzBsV2dsTTBiM0dBRnJVRU1pcjlhR0ZndFJuYUpDWlNzN1I1R05aaG1fUjRkM2tkR3ZXV3AzV21FV1UyX0ZwNm0wUGNyTTY0bWs3T25rYVd1b1RyRXlqUi0zSlVtRk1FVU5tZTd3?oc=5\" target=\"_blank\">One Part of the 49e"
    ],
    "image_url": "",
    "titles": [
      "Brian Robinson Jr. to the 49ers, Devaughn Vele to the Saints",
      "One Part of the 49ers Acquiring Brian Robinson Jr. No one is Talking About (yet) - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.905,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.668,
    "summary": "The summary of the preseason NFL deals includes evaluations of trades involving the 49ers and Commanders, and the Saints' acquisition of a 27-year-old wide receiver. The analysis aims to determine which teams benefited most from their transactions. However, the specific outcomes or consensus on who \"won\" these trades were not provided in the content snippet. The focus is on assessing the value and impact of these deals on the teams involved.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Warriors Express Interest in Trading for LeBron James to Pair with Curry",
    "domain": "sports",
    "source_domain": "lebronwire.usatoday.com",
    "location": "national",
    "published": "Fri, 22 Aug 2025 23:36:39 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Sports Illustrated",
      "Yahoo Sports"
    ],
    "domains": [
      "lebronwire.usatoday.com",
      "news.google.com"
    ],
    "snippets": [
      "According to a report, the Warriors continue to dream of pairing Stephen Curry with LeBron James.",
      "<a href=\"https://news.google.com/rss/articles/CBMiYEFVX3lxTE9idjRqanR0S25sYW8tdHYyRkRCUldiVnlrbW9fUlRIWHZySm5CVmtMSnpjMk9oQXpTY09xNEpNbjlhcld1ZDNQVXR2eml4RkFmcDVPa0lMUmpTUWFHXzBJWA?oc=5\" target=\"_blank\">Warriors Have Made Interest in Potential LeBron James Trade Clear to Lakers</a>&nbsp;&nbsp;<font "
    ],
    "image_url": "",
    "titles": [
      "Warriors have made multiple attempts to trade for LeBron James",
      "Warriors Have Made Interest in Potential LeBron James Trade Clear to Lakers - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.988,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.66,
    "summary": "The Golden State Warriors have expressed a clear interest in trading for LeBron James, aiming to create a dynamic duo with Stephen Curry. This intention has been communicated to the Los Angeles Lakers, as reported. The current status of any negotiations or the likelihood of such a trade happening remains undisclosed.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Apple in Talks for AI Deal Amid Siri Overhaul Efforts",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Fri, 22 Aug 2025 21:56:52 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "The reported talks have been for a potential AI deal between the two giants.",
      "Apple promised a major revamp to Siri, but the company's AI capabilities have lagged behind competitors."
    ],
    "image_url": "",
    "titles": [
      "Google shares rise on report of Apple using Gemini for Siri",
      "Apple is in talks to use Google’s Gemini for Siri revamp, report says"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.935,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.649,
    "summary": "Apple is reportedly in talks for a potential AI deal with another major company. Despite promising a significant overhaul to Siri, Apple's AI technology has fallen behind its rivals. The outcome of the talks and any potential agreement remain uncertain.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "2026 World Cup Draw Set for Dec 5 at Kennedy Center, Shifts from Vegas",
    "domain": "business",
    "source_domain": "www.forbes.com",
    "location": "global",
    "published": "Fri, 22 Aug 2025 18:21:29 -0400",
    "source": "Forbes",
    "sources": [
      "Sportsnet",
      "Forbes"
    ],
    "domains": [
      "www.forbes.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "The 2026 World Cup draw will be held at the Kennedy Center, and not in Las Vegas. It opened up questions about more political football between Trump and Infantino.",
      "<p>President Donald Trump said Friday that the draw for the 2026 World Cup will take place on Dec. 5 at the Kennedy Center in Washington.</p>"
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/68a8e6110db5aa380ad88596/0x0.jpg?width=960",
    "titles": [
      "Some More Political Football: World Cup Draw Is Set For Kennedy Center",
      "2026 World Cup draw will be held at Washington’s Kennedy Center"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.963,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.648,
    "summary": "The 2026 World Cup draw is scheduled for December 5 at the Kennedy Center in Washington, D.C., as announced by President Donald Trump. This decision marks a location change from the previously speculated venue in Las Vegas, sparking discussions on potential political implications involving Trump and FIFA President Gianni Infantino.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Experts Share Predictions for UFC Fight Night: Walker vs. Zhang",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Fri, 22 Aug 2025 11:24:31 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Who has the edge at UFC Fight Night? An MMA coach and a betting insider make their picks.",
      "SportsLine's Daniel Vithlani reveals his picks for the UFC Fight Night: Walker vs. Zhang fight card from the Shanghai Indoor Stadium in Xuhui District, China, on Saturday"
    ],
    "image_url": "",
    "titles": [
      "UFC Fight Night: Expert picks, best bets for Johnny Walker vs. Zhang Mingyang",
      "UFC Fight Night odds, props, predictions, fight card: Walker vs. Zhang picks, best bets by proven MMA insider"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.833,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.647,
    "summary": "At UFC Fight Night in Shanghai, China, SportsLine's Daniel Vithlani and an MMA coach shared their predictions for the Walker vs. Zhang fight card. Their insights were provided ahead of the event, offering perspectives on who might have the competitive edge in the matchups.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Bluesky Blocks Mississippi Access Over New Age Verification Law",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-08-22T17:09:14-04:00",
    "source": "The Verge",
    "sources": [
      "TechCrunch",
      "The Verge"
    ],
    "domains": [
      "www.theverge.com",
      "techcrunch.com"
    ],
    "snippets": [
      "Bluesky will block access from Mississippi IP addresses in response to a new state law requiring age verification and parental consent for underage users. The decision, outlined in a blog post, will stand until courts decide the fate of the law. “Mississippi&#8217;s approach would fundamentally chan",
      "In a blog post published on Friday, the company explains that, as a small team, it doesn't have the resources to make the substantial technical changes this type of law would require, and it raised concerns about the law's broad scope and privacy implications."
    ],
    "image_url": "",
    "titles": [
      "Bluesky blocks Mississippi under new age verification law",
      "Bluesky blocks service in Mississippi over age assurance law"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.939,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.643,
    "summary": "Bluesky announced it will block access from Mississippi due to a new law requiring age verification and parental consent for underage users. The company, citing limited resources and concerns over privacy and the law's broad scope, stated the block will remain until the law's fate is decided by courts. This decision was shared in a blog post, highlighting the challenges small teams face in adapting to such legal requirements.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Joao Pedro Stars in Chelsea's 5-1 Win Over West Ham",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 22 Aug 2025 21:31:39 GMT",
    "source": "BBC",
    "sources": [
      "Sky Sports",
      "BBC"
    ],
    "domains": [
      "www.skysports.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Joao Pedro gets a goal and an assist as Chelsea come from behind to comfortably beat West Ham 5-1 in the Premier League at London Stadium.",
      "Highlights from Premier League match between West Ham and Chelsea."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/618d/live/6222a9f0-7f9c-11f0-ab3e-bd52082cd0ae.jpg",
    "titles": [
      "West Ham booed as Chelsea score five in convincing win",
      "Chelsea hit FIVE past West Ham"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.927,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.64,
    "summary": "Joao Pedro played a key role in Chelsea's 5-1 victory over West Ham in the Premier League, contributing a goal and an assist. The match took place at London Stadium, where Chelsea managed to come from behind to secure a comfortable win against their opponents.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Orioles Sign Basallo to Record 8-Year Catcher Contract",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Fri, 22 Aug 2025 20:32:33 +0000",
    "source": "CBS Sports",
    "sources": [
      "Sportsnet",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Basallo's contract is the largest ever given to a catcher with similar service time",
      "<p>The Baltimore Orioles are looking to lock up one of their core pieces for the long term. </p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/08/22/416628e2-efca-40ee-816e-d7f87da5c367/samuel-basallo-orioles-g.jpg",
    "titles": [
      "Samuel Basallo extension: Orioles catcher signs historic eight-year, $67 million pact days after MLB debut",
      "Orioles, catcher Samuel Basallo finalizing long-term extension"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.927,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.64,
    "summary": "The Baltimore Orioles have signed catcher Samuel Basallo to an eight-year contract extension, the largest ever for a catcher with his level of service time in MLB. Despite not having hit a home run in the league yet, the Orioles have committed to Basallo as a key part of their team's future.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Elon Musk's Brother Defends $56B Pay in Court, Calls Tesla an AI Firm",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Fri, 22 Aug 2025 17:38:26 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Business Insider"
    ],
    "domains": [
      "www.cnbc.com",
      "www.businessinsider.com"
    ],
    "snippets": [
      "The electric carmaker has been locked in a legal battle over Elon Musk's $56 billion pay package from 2018.",
      "The younger Musk brother said the Tesla CEO \"deserves to be paid\" and calls Tesla an AI company."
    ],
    "image_url": "",
    "titles": [
      "Kimbal Musk on Elon's Tesla pay package: 'My brother deserves to be paid'",
      "Tesla board member Kimbal Musk weighs in on his brother's pay package and the idea of Tesla investing in xAI"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.855,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.633,
    "summary": "Tesla has been embroiled in a lawsuit regarding Elon Musk's $56 billion compensation package from 2018. During the legal proceedings, Musk's younger brother testified, asserting that the Tesla CEO merits the payment and described Tesla as an AI company.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Developer Convicted for Planting \"Kill Switch\" in Servers",
    "domain": "technology",
    "source_domain": "techcrunch.com",
    "location": "global",
    "published": "Fri, 22 Aug 2025 14:26:34 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch",
      "Ars Technica"
    ],
    "domains": [
      "arstechnica.com",
      "techcrunch.com"
    ],
    "snippets": [
      "The ex-developer was convicted of planting malicious code designed to crash its servers in the event that he was fired.",
      "Disgruntled developer was caught after naming the \"kill switch\" after himself."
    ],
    "image_url": "",
    "titles": [
      "Developer gets prison time for sabotaging former employer’s network with a ‘kill switch’",
      "Developer gets 4 years for activating network “kill switch” to avenge his firing"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.817,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.618,
    "summary": "A former developer was found guilty of inserting harmful code into servers to crash them if he was terminated. The disgruntled employee was identified when the \"kill switch\" was traced back to him. The outcome is that the developer has been convicted for the malicious act.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]