[
  {
    "title": "US Strikes Drug Cartel Vessel, 3 Dead; Trump Signals More Actions Ahead",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 15 Sep 2025 22:21:43 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC",
      "Deutsche Welle",
      "Washington Post",
      "Al Jazeera"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com",
      "www.washingtonpost.com",
      "www.aljazeera.com",
      "www.dw.com"
    ],
    "snippets": [
      "The attack came after the Venezuelan president said Caracas would defend itself against US \"aggression\".",
      "Attack targeted US-bound &#039;extraordinarily violent drug trafficking cartels&#039; in international waters, Trump says.",
      "The strike comes two weeks after the US targeted what the Trump administration said was a drug vessel from Venezuela. The Venezuelan president has vowed to defend against Washington's \"aggression.\"",
      "<p>President says three people killed in strike against vessel he said was transporting drugs ‘headed to the US’</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/live/2025/sep/15/donald-trump-politics-washington-dc-national-emergency-ice-charlie-kirk-live-news-updates\">US politics live – l",
      "The president also signaled that his administration was preparing to take military action against Latin American cartels that move narcotics over land."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/3f40/live/3bfcd330-9271-11f0-b8e5-3be75a11e2ba.png",
    "titles": [
      "US destroys alleged Venezuelan drug boat, killing three",
      "Trump says US struck second Venezuelan drug vessel, killing three",
      "Trump says US hit another drug boat from Venezuela",
      "Trump announces deadly US strike on another alleged Venezuelan drug boat",
      "U.S. kills 3 in strike on alleged drug boat from Venezuela, Trump says"
    ],
    "score_components": {
      "magnitude": 0.984,
      "recency": 0.942,
      "consensus": 0.995,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.842,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The US conducted a strike against a vessel in international waters, which President Trump described as targeting \"extraordinarily violent drug trafficking cartels\" bound for the US. This action follows a recent operation against a drug vessel from Venezuela and comes amidst tensions with Venezuelan President Maduro, who has promised to defend against US \"aggression.\" The strike resulted in the deaths of three individuals. Additionally, President Trump has indicated plans for further military actions against Latin American cartels involved in narcotics trafficking.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "US, China Near TikTok Deal, Trump and Xi to Finalize Soon",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-09-15T14:38:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "New York Times",
      "The Guardian",
      "Axios",
      "TechCrunch",
      "Deutsche Welle",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "www.theguardian.com",
      "techcrunch.com",
      "news.google.com",
      "www.dw.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "US President Donald Trump and his Chinese counterpart Xi Jinping could finalize the deal on the Chinese-owned video platform TikTok in the coming days.",
      "<a href=\"https://news.google.com/rss/articles/CBMicEFVX3lxTE1POG81aXZRMHhPSlpOdlBvMXZpVC1JUkN1OVUtaVk2aEdOVTVNVEpKaDNVSm9oRGVRTDJmaWQxZUNXazdINHc1YzIyV0I4bmpYX3lTQ2xXTjhabk1VVWJfTzFxVENQUWUzWlAtV2NzaGQ?oc=5\" target=\"_blank\">Trump suggests TikTok deal, will talk to China's Xi on Friday</a>&nbsp;&nbsp",
      "The U.S. and China have a 'framework' deal for social media platform TikTok in place, Treasury Secretary Scott Bessent said Monday.",
      "Top economic officials met in Madrid for a second day, with deadlines looming on tariffs and a ban on TikTok in the United States if it is not sold by its Chinese owner, ByteDance.",
      "<p>Framework deal is breakthrough in long-running dispute over app’s ownership amid security concerns in Washington</p><p>Jamieson Greer, a US trade representative, said on Monday that Washington and Beijing have struck a framework agreement on transferring <a href=\"https://www.theguardian.com/techn",
      "The \"framework\" deal with China is\n\"between two private parties, but the commercial terms have been agreed upon,\" CNBC quoted Bessent as saying on the sidelines of a meeting between the two countries in Madrid on Monday."
    ],
    "image_url": "",
    "titles": [
      "US reaches 'framework' TikTok deal with China, Trump and Xi to speak",
      "Trump suggests TikTok deal, will talk to China's Xi on Friday - Axios",
      "Bessent: TikTok deal 'framework' reached with China, Trump and Xi will finalize it Friday",
      "U.S. and China Reach ‘Framework’ for a TikTok Sale",
      "US and China reach deal to transfer TikTok ownership, trade officials say",
      "US, China reach ‘framework’ deal for TikTok"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.819,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.814,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "US President Donald Trump and Chinese President Xi Jinping are nearing a deal on TikTok, as announced by Treasury Secretary Scott Bessent. They have established a 'framework' agreement aimed at resolving the long-standing dispute over the video platform's ownership due to security concerns. Bessent, speaking from Madrid, noted the progress during trade talks with China. Trump also mentioned that discussions have been successful and anticipates a call with Xi Jinping within the week to finalize the agreement.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Duplantis Sets Pole Vault World Record at 6.30m in Tokyo",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 15 Sep 2025 14:03:30 GMT",
    "source": "BBC",
    "sources": [
      "Sky Sports",
      "The Guardian",
      "BBC",
      "Al Jazeera",
      "Sportsnet"
    ],
    "domains": [
      "www.skysports.com",
      "www.theguardian.com",
      "www.bbc.com",
      "www.aljazeera.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Armand Duplantis clinches his 14th world record as the Swedish superstar continues his pole vault domination by winning a third consecutive world title.",
      "Sweden&#039;s Armand &#039;Mondo&#039; Duplantis sails over the bar to set 14th pole vault record at the World Athletic Championships.",
      "<ul><li><p>Swede clears 6.30m to claim gold in Tokyo</p></li><li><p>Shoes with metal spike enable faster run-up</p></li></ul><p>The pole vault competition was two hours and 20 minutes old when Mondo Duplantis finally got serious at these World Athletics Championships. The bar had just been raised to",
      "Sweden's Armand Duplantis broke the men's pole vault world record for a 14th time on his way to gold at the World Athletics Championships in Tokyo.",
      "<p>Armand “Mondo” Duplantis broke the pole-vault world record for the 14th time Monday night, clearing 6.30 metres to capture his third world championship.</p>"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/2d7c/live/22d11c90-923f-11f0-a1c9-9feb11d883c1.jpg",
    "titles": [
      "'From another planet' - Duplantis seals 14th world record & third world title",
      "Duplantis breaks pole vault world record to win gold in Tokyo",
      "Mondo Duplantis hits new heights with ‘Claw’ after 14th pole vault world record",
      "Duplantis breaks pole vault world record for 14th time",
      "Sweden’s Mondo Duplantis crushes own pole-vault world record to capture gold"
    ],
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.793,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.788,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Armand Duplantis of Sweden set a new men's pole vault world record, clearing 6.30 meters at the World Athletics Championships in Tokyo. This marks his 14th world record and secured him a gold medal. His achievement was facilitated by shoes with metal spikes, enhancing his run-up.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Tom Brady to Play in Flag Football Event in Riyadh with NFL Stars",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 15 Sep 2025 19:53:45 EST",
    "source": "ESPN",
    "sources": [
      "Yahoo Sports",
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.sportsnet.ca",
      "sports.yahoo.com"
    ],
    "snippets": [
      "Tom Brady announced Monday that he has teamed up with Fanatics, Fox Sports and OBB Media for the \"The Fanatics Flag Football Classic.\"",
      "Tom Brady plans to play alongside current and former NFL stars in a three-team flag football tournament in Saudi Arabia next year, the seven-time Super Bowl-winning quarterback and Fox Sports analyst said Monday.  The Fanatics Flag Football Classic on March 21 at Kingdom Arena in Riyadh also will in",
      "The seven-time Super Bowl winner touted playing in the Fanatics Flag Football Classic as &quot;coming out of retirement.&quot;",
      "Tom Brady will join fellow retired Patriots star Rob Gronkowski and a host of current NFL standouts in a three-team flag football tournament in Saudi Arabia in March.",
      "<p>Tom Brady plans to play alongside current and former NFL stars in a three-team flag football tournament in Saudi Arabia next year, the seven-time Super Bowl-winning quarterback and Fox Sports analyst said Monday.</p>"
    ],
    "image_url": "",
    "titles": [
      "Brady to play with NFL stars in Saudi flag tourney",
      "Tom Brady to play in Saudi flag football tournament alongside current and former NFL stars",
      "Tom Brady, NFL players and coaches to take part in flag football event in Saudi Arabia",
      "Tom Brady is not coming out of retirement, but he will play flag football in Saudi Arabia",
      "Tom Brady to play in Saudi flag football tournament with current and former NFL stars"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.993,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.77,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Tom Brady announced his participation in \"The Fanatics Flag Football Classic,\" a three-team flag football tournament in Riyadh, Saudi Arabia, scheduled for March 21. The event, in collaboration with Fanatics, Fox Sports, and OBB Media, will feature Brady playing alongside current and former NFL stars, including retired Patriots player Rob Gronkowski. Brady referred to his involvement as \"coming out of retirement\" for this occasion.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: collaboration",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Week 3 College Football: Updated Rankings for Top 20 Teams and All FBS",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 15 Sep 2025 19:53:45 EST",
    "source": "ESPN",
    "sources": [
      "Yahoo Sports",
      "Bleacher Report",
      "ESPN"
    ],
    "domains": [
      "ftw.usatoday.com",
      "news.google.com",
      "www.espn.com"
    ],
    "snippets": [
      "Now that Week 3 has come to an end, who are the early breakout players for the teams in our Top 25?",
      "Week 3 looked to be a full slate of thrillers, and that proved to be case. Here were the winners and losers from an action-packed Saturday.",
      "<a href=\"https://news.google.com/rss/articles/CBMiiAFBVV95cUxPUEtzaGwtblpoMWhzb3lIYTFHbUUtc0pfa2tVS19ROUprUFRuaHlVMEpkQ1BxX2xXRUNSb1dqYUwwQ01SYWw3YjNKZDVNclFkdFZRa2w2TWViMlZZa3VJZjlaV2dlQVlfdGpFSTUwa1RvMDlFYUF0aE9Ka3FtOUI1eE5QQWN4YVU3?oc=5\" target=\"_blank\">B/R Experts' Week 3 NFL Power Rankings</a>&"
    ],
    "image_url": "",
    "titles": [
      "🏈 College Football Power Rankings after Week 3",
      "College football winners and losers, Week 3: Hello, Texas A&M; goodbye, Clemson",
      "B/R Experts' Week 3 NFL Power Rankings - Bleacher Report"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.993,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.76,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Week 3 of college football has concluded, leading to updates in player and team rankings. SportsLine expert Thomas Casale provided insights on the top 20 teams, while a comprehensive ranking of all 136 FBS teams was also released. These updates reflect the early breakout players and shifts in team standings ahead of Week 4.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "JD Vance to Host \"The Charlie Kirk Show\" in Tribute to Friend on Monday",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Mon, 15 Sep 2025 15:51:28 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "Axios",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "news.google.com",
      "www.npr.org"
    ],
    "snippets": [
      "The broadcast was a striking reminder of Kirk's influence, both as a leader in the young conservative space and a behind-the-scenes political player who helped shape President Trump's agenda.",
      "<a href=\"https://news.google.com/rss/articles/CBMieEFVX3lxTE5ONGk0RFRJWVFaM09FYnpKOW93Q0NjWGJFbElOU1dGbnFXWXdaVjN2bVBnUDEwU2J1OXFnNGI4RVV6R2ljN1ptVkJCcEprc3lFcXdjMDZ2dTZOZEU3WGFlRGQxRHRMdGNiQk05LTNuM2NKbFd0V3o4dQ?oc=5\" target=\"_blank\">JD Vance takes the mic to host \"The Charlie Kirk Show\" Monday</a>",
      "<p>Vice-president says White House will pursue those who praise Kirk’s death and groups that ‘promote terrorism’</p><p><a href=\"https://www.theguardian.com/us-news/jd-vance\">JD Vance</a> assailed what he called the “far left” and its increased tolerance for violence while guest-hosting Charlie Kirk’"
    ],
    "image_url": "",
    "titles": [
      "JD Vance hosts 'The Charlie Kirk Show,' paying tribute with top White House officials",
      "JD Vance takes the mic to host \"The Charlie Kirk Show\" Monday - Axios",
      "JD Vance threatens crackdown on ‘far-left’ groups after Charlie Kirk shooting"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.913,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.744,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "JD Vance announced he will host \"The Charlie Kirk Show\" on Monday, inviting people to join him in paying tribute to his friend. This news was shared by Vance on the social media platform X.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "China Finds Nvidia's Mellanox Buyout Violates Anti-Monopoly Laws",
    "domain": "technology",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Mon, 15 Sep 2025 21:06:58 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Ars Technica",
      "TechCrunch"
    ],
    "domains": [
      "www.aljazeera.com",
      "techcrunch.com",
      "arstechnica.com"
    ],
    "snippets": [
      "The claim came as the US and China held trade talks in Madrid that concluded on Monday.",
      "China is investigating Nvidia's 2020 acquisition of Mellanox Technologies as trade tensions between the U.S. and China heat up.",
      "Regulator’s statement comes as US and Chinese officials meet in Madrid for trade talks."
    ],
    "image_url": "",
    "titles": [
      "China accuses Nvidia of violating anti-monopoly laws",
      "China says Nvidia violated antitrust regulations",
      "China rules that Nvidia violated its antitrust laws"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.938,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.741,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "China's market regulator declared on Monday that Nvidia breached the nation's anti-monopoly laws through its 2020 acquisition of Mellanox. This development occurs amidst escalating tensions between the US and China, with both countries' officials currently engaged in trade discussions in Madrid.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Montreal Canadiens Player Reaffirms Commitment to USA Hockey",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Mon, 15 Sep 2025 21:26:38 +0000",
    "source": "Global News",
    "sources": [
      "Sportsnet",
      "Global News"
    ],
    "domains": [
      "globalnews.ca",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "The Montreal Canadiens defenceman made it clear Monday he’s committed to USA Hockey, brushing off the chatter his father stirred about a possible future with Canada.",
      "<p>The Montreal Canadiens defenceman made it clear Monday he’s committed to USA Hockey, brushing off the chatter his father stirred about a possible future with Canada.</p>"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/e0d9dfd08af646c8cc640c72462f8fdc448971c06650fa328f87d3c1f55fc863.jpg?quality=65&strip=all",
    "titles": [
      "Canadiens’ Hutson says he’s a ‘USA Hockey player’ after dad’s comments spark stir",
      "Canadiens’ Hutson says he’s a ‘USA Hockey player’ after dad’s comments spark stir"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.944,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.694,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Montreal Canadiens defenseman reaffirmed his commitment to USA Hockey, dismissing talk sparked by his father about potentially playing for Canada. He clarified his allegiance on Monday, emphasizing his dedication to the USA team.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Vikings QB McCarthy Out 2-4 Weeks, Wentz Steps In",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 15 Sep 2025 19:53:45 EST",
    "source": "ESPN",
    "sources": [
      "Yahoo Sports",
      "ESPN"
    ],
    "domains": [
      "www.dailynorseman.com",
      "www.espn.com"
    ],
    "snippets": [
      "Vikings QB J.J. McCarthy is expected to miss two to four weeks with a high ankle sprain, sources told ESPN, and Carson Wentz is expected to start in his place.",
      "In the wake of their Sunday Night Football loss to the Atlanta Falcons, the Minnesota Vikings’ injury report is awfully crowded, but it’s the name at the top of the list that’s given fans of the purple something to talk about. And, perhaps, an opportunity to strap on their tinfoil hats. At his press"
    ],
    "image_url": "",
    "titles": [
      "Sources: Vikes' McCarthy (ankle) out 2-4 weeks",
      "J.J. McCarthy Out 2-4 Weeks with High Ankle Sprain"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.993,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.689,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Vikings QB J.J. McCarthy is sidelined for 2-4 weeks due to a high ankle sprain, as reported by ESPN. In his absence, Carson Wentz will take over as the starting quarterback. This development follows the team's recent loss to the Atlanta Falcons, adding to the Vikings' growing injury concerns.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "41M Watch Crawford Beat Alvarez for Title on Netflix",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 15 Sep 2025 19:53:45 EST",
    "source": "ESPN",
    "sources": [
      "Yahoo Sports",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "mmajunkie.usatoday.com"
    ],
    "snippets": [
      "Over 41 million viewers tuned in to Netflix for the undisputed super middleweight title fight Saturday night that saw Terence Crawford dethrone Canelo Alvarez, the streaming service announced Monday.",
      "When Terence Crawford defeated Canelo Alvarez, he did so in front of a massive audience."
    ],
    "image_url": "",
    "titles": [
      "Netflix: Crawford win vs. Canelo watched by 41M",
      "Netflix announces 41.4 million viewers watched Canelo vs. Crawford"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.993,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.679,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Over 41 million viewers watched on Netflix as Terence Crawford defeated Canelo Alvarez to become the undisputed super middleweight champion on Saturday night, as announced by the streaming service.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Elena Delle Donne to Lead USA Women's 3-on-3 Basketball for 2028 Olympics",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Mon, 15 Sep 2025 20:38:30 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sportsnet"
    ],
    "domains": [
      "www.cbssports.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "The Olympic gold medalist takes the helm of USA Basketball's women's 3-on-3 program ahead of the 2028 Olympics",
      "<p>Elena Delle Donne has always been intrigued by 3-on-3 basketball since the sport entered Olympic play in 2021.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/15/019a0c60-4a70-4541-b0f6-ababaa0b0453/elena-delle-donne.jpg",
    "titles": [
      "Elena Delle Donne, two-time WNBA MVP, named first managing director of USA women's 3-on-3 basketball",
      "Elena Delle Donne takes on role with USA Basketball’s 3-on-3 women’s hoops"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.928,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.676,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Elena Delle Donne, an Olympic gold medalist, has been appointed to lead the USA Basketball women's 3-on-3 program for the 2028 Olympics. Delle Donne, who has shown a keen interest in 3-on-3 basketball since its Olympic debut in 2021, will now oversee the development and strategy of the team.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "RFK Jr. Appoints New CDC Vaccine Advisers Ahead of Key Meeting",
    "domain": "technology",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Mon, 15 Sep 2025 17:04:32 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "Ars Technica"
    ],
    "domains": [
      "www.npr.org",
      "arstechnica.com"
    ],
    "snippets": [
      "Health Secretary Robert F. Kennedy Jr. picks more new vaccine advisers to the Centers for Disease Control and Prevention, days before a two-day meeting to consider COVID and hepatitis B shots.",
      "The panel will meet this week and could limit access to measles, Hep B, COVID vaccines."
    ],
    "image_url": "",
    "titles": [
      "5 new members added to CDC vaccine advisory panel ahead of key meeting",
      "RFK Jr. adds more anti-vaccine members to CDC vaccine advisory panel"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.937,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.667,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Health Secretary Robert F. Kennedy Jr. appointed new vaccine advisers to the CDC ahead of a meeting to discuss COVID and hepatitis B vaccines. The panel, meeting this week, may consider changes to the availability of measles, Hepatitis B, and COVID vaccines.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Spain's PM Calls for Israel Ban from Sports Events After Vuelta Disruption",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Mon, 15 Sep 2025 21:42:32 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Spanish Prime Minister Pedro Sanchez says Israel must face the same sporting sanctions as Russia did after Ukraine war.",
      "<p>Pedro Sánchez speaks after Gaza protesters forced cycle race’s early end, while €700m deal with Israeli defence firm said to be off</p><p>Spain’s prime minister, Pedro Sánchez, has called for Israel to be barred from international sports competitions for as long as its “barbarism” in Gaza continu"
    ],
    "image_url": "",
    "titles": [
      "Spanish PM calls for Israel’s ban from sporting events over Gaza genocide",
      "Spain’s PM calls for Israel to be banned from sports events after Gaza protests force end to Vuelta race"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.949,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.659,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Spain's Prime Minister, Pedro Sánchez, advocated for banning Israel from international sporting events, following the disruption of the Spanish Vuelta cycling race by pro-Palestinian activists. Sánchez criticized Israel's actions in Gaza and accused the country of using sports to 'whitewash' its conduct. This statement was made in the context of protests that led to an early conclusion of the cycling event.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Arab, Muslim Leaders Meet in Doha Over Israel's Gaza Strike",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Mon, 15 Sep 2025 20:42:39 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "New York Times"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "Israel&#039;s attack on Hamas negotiators in Doha brought together dozens of Arab and Muslim leaders for a show of unity.",
      "Arab and Muslim leaders are meeting in Doha for an emergency summit after Israel’s unprecedented attack on the city.",
      "Arab foreign ministers gathered on Sunday in the Qatari capital, Doha, to lay the groundwork for a summit there the next day."
    ],
    "image_url": "",
    "titles": [
      "Arab, Muslim leaders unite at Doha summit following Israeli attack",
      "Arab and Muslim leaders gather in Doha after Israeli attack",
      "Arab Ministers Meet on Response to Israeli Attack in Qatar"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.93,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.655,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Arab and Muslim leaders convened in Doha for an emergency summit to discuss responses to Israel's recent attack on Gaza. The meeting aimed to decide on concrete actions following the strike. Arab foreign ministers met in Doha prior to the summit to prepare for the discussions.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Twins vs. Yankees Tonight: Rodón to Pitch, Game at 6:40 PM CDT",
    "domain": "sports",
    "source_domain": "www.twinkietown.com",
    "location": "national",
    "published": "Mon, 15 Sep 2025 23:28:13 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Sportsnet",
      "Yahoo Sports"
    ],
    "domains": [
      "www.twinkietown.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "First Pitch: 6:40 PM CDT TV: Twins.TV Radio: TIBN, WCCO 830, The Wolf 102.9 FM, Audacy I regret to inform you that the Minnesota Twins do, in fact, play another game this evening. However, the good news is that they get to face the Yankees with a chance to play spoiler for a team still […]",
      "<p>Carlos Rodón and the Yankees look to gain on the Blue Jays when they take on the Twins on Monday. Check out all the action on Sportsnet, Sportsnet+ and our MLB live tracker.</p>"
    ],
    "image_url": "",
    "titles": [
      "Game 150: Yankees at Twins",
      "MLB on Sportsnet: Yankees vs. Twins"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.985,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.652,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Minnesota Twins are scheduled to play against the New York Yankees at 6:40 PM CDT. The game will be available on Twins.TV, TIBN, WCCO 830, The Wolf 102.9 FM, and Audacy. This match offers the Twins an opportunity to impact the Yankees' standing as they compete with the Blue Jays. Carlos Rodón will be pitching for the Yankees. The game can also be followed on Sportsnet, Sportsnet+, and through an MLB live tracker.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Deputy PM Backs Bill for Mandatory Public Body Cooperation in Disaster Probes",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 15 Sep 2025 21:30:22 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The proposed law would force public bodies to co-operate with investigations into major disasters.",
      "<p>Deputy PM says legislation will ensure public officials have duty to act with ‘honesty and integrity at all times’</p><ul><li><p><a href=\"https://www.theguardian.com/commentisfree/2025/sep/15/david-lammy-hillsborough-law-disaster-families-grenfell-windrush-the-post-office-scandal-justice\">The gui"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/826c/live/09eda190-7a52-11ef-b282-4535eb84fe4b.jpg",
    "titles": [
      "Hillsborough Law will include duty of candour",
      "Hillsborough law will mean serious wrongdoing is punished, says Lammy"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.926,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.65,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The proposed legislation aims to mandate public bodies to participate in investigations of major disasters, ensuring officials act with honesty and integrity. The Deputy Prime Minister supports the law, emphasizing its role in promoting accountability and transparency in public service.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "CoreWeave Expands Nvidia Partnership, Easing Investor Concerns",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Mon, 15 Sep 2025 21:15:19 GMT",
    "source": "CNBC",
    "sources": [
      "MarketWatch",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "www.marketwatch.com"
    ],
    "snippets": [
      "CoreWeave has secured more business from Nvidia, which is an investor in the company and its main source of chips for running AI models.",
      "The deal offers some reassurance to CoreWeave investors in light of the company’s heavy customer concentration and rampant competition for cloud offerings."
    ],
    "image_url": "",
    "titles": [
      "CoreWeave's stock rallies on disclosure of $6.3 billion order from Nvidia",
      "What CoreWeave’s new $6.3 billion contract with Nvidia says about the AI trade"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.921,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.649,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "CoreWeave, benefiting from an investment by Nvidia, its primary chip provider, has expanded its business dealings with Nvidia. This development provides reassurance to CoreWeave's investors, addressing concerns related to the company's reliance on a limited customer base and the competitive cloud services market.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "VP Vance Criticizes Celebration of Kirk's Death, Suggests Reporting Offenders",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 15 Sep 2025 21:51:52 GMT",
    "source": "BBC",
    "sources": [
      "Business Insider",
      "BBC"
    ],
    "domains": [
      "www.businessinsider.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The vice-president's remarks come amid a wave of firings over posts deemed inappropriate about Kirk's death.",
      "\"When you see someone celebrating Charlie's murder, call them out,\" Vance said on Monday. \"And hell, call their employer.\""
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/cf16/live/039922e0-9272-11f0-84c8-99de564f0440.jpg",
    "titles": [
      "Report those who celebrate Charlie Kirk death to employers, Vance says",
      "JD Vance says if you see someone celebrating Charlie Kirk's death, tell their employer"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.933,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.642,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Vice-President Vance condemned the celebration of Charlie Kirk's death, urging the public to confront those who do so and even suggest contacting their employers. This statement follows a series of firings related to inappropriate comments about Kirk's death.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Renowned Architect Nicholas Grimshaw Passes Away at 85",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 15 Sep 2025 20:33:03 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The architect is remembered as having \"endless curiosity about how things are made\".",
      "<p>Groundbreaking designs included the original Eurostar terminal in London and the Financial Times’s Printworks</p><p>The architect Sir Nicholas Grimshaw, who designed the Eden Project in Cornwall and the original Eurostar terminal at Waterloo in London, has died aged 85.</p><p>His company, Grimsha"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/0ca4/live/3c62da40-926c-11f0-b8e5-3be75a11e2ba.jpg",
    "titles": [
      "Eden Project architect Sir Nicholas Grimshaw dies",
      "Eden Project architect Nicholas Grimshaw dies aged 85"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.908,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.637,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Sir Nicholas Grimshaw, renowned for designing the Eden Project in Cornwall and the original Eurostar terminal in London, has passed away at the age of 85. His work, celebrated for groundbreaking designs including the Financial Times’s Printworks, leaves a legacy of innovative architecture.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Alphabet's Market Value Soars After Court Decision",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Mon, 15 Sep 2025 20:19:54 GMT",
    "source": "CNBC",
    "sources": [
      "TechCrunch",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "techcrunch.com"
    ],
    "snippets": [
      "Google's parent company added hundreds of billions of dollars in value in September following a favorable ruling.",
      "Investors continue to reward Alphabet's stock after a judge declined to break up Google earlier this month."
    ],
    "image_url": "",
    "titles": [
      "Alphabet becomes fourth company to reach $3 trillion market cap",
      "With no DOJ breakup, Alphabet becomes a $3 trillion company"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.903,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.636,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In September, Alphabet, Google's parent company, saw a significant increase in its market value, adding hundreds of billions of dollars after a judge ruled against breaking up the company. This favorable decision led to a surge in investor confidence, resulting in a continued rise in Alphabet's stock price.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Couple Sentenced to 14 Years for Newborn's Death in Tent",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 15 Sep 2025 16:31:04 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The couple were found guilty in July after a lengthy retrial at the Old Bailey.",
      "<p>Couple took newborn to live in a tent in wintry conditions in Brighton after going on the run to evade social services</p><p>Two parents who caused the death of their newborn baby after taking her to live in a tent in wintry conditions to evade social services have each been sentenced to 14 years"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/8782/live/8a8d07b0-9251-11f0-b391-6936825093bd.jpg",
    "titles": [
      "Constance Marten and Mark Gordon jailed for 14 years over baby's death",
      "Constance Marten and Mark Gordon both jailed for 14 years over death of baby in tent"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.834,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.622,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In July, after a retrial at the Old Bailey, a couple was found guilty of causing their newborn's death by taking her to live in a tent under wintry conditions in Brighton to avoid social services. They have each been sentenced to 14 years in prison.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Proposes Biannual Financial Reporting for U.S. Companies",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Mon, 15 Sep 2025 12:17:05 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "Financial Times"
    ],
    "domains": [
      "www.ft.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMiiAFBVV95cUxNRDhWMkwxbldLODNkVzFKdTJrUmFSdkxkbDlral94X0EyWXpLelYyQXJEYmtRMURiMy1TUmIyYkpKQ0hWUmlqSXVJR2VySmE2SFkwbWdCbVZOODFrXzNyYnRGaTBNc0ZfaTM1TmtfNWU2Q3otRG5SRlo5dEwzZVh0dHJQY0ZrWm05?oc=5\" target=\"_blank\">Trump says public companies shouldn't have ",
      "US president says forcing groups to disclose their finances every three months is ‘not good’"
    ],
    "image_url": "",
    "titles": [
      "Trump says public companies shouldn't have to report quarterly anymore - Axios",
      "Trump calls for US companies to ditch quarterly reporting"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.764,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.615,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "President Trump has stated that he believes U.S. public companies should not be required to disclose their financials every quarter, suggesting a shift to a biannual reporting system similar to that of European companies.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump: Foreign Workers \"Welcome\" in US Amid South Korea Outrage",
    "domain": "technology",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Mon, 15 Sep 2025 10:06:08 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "The Verge"
    ],
    "domains": [
      "www.theverge.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMiekFVX3lxTFBCVEZRblZWTWNZTlNUa3RCTlp5Rmt5YjlFSzJnaEZKWlVDVTgtbm9ZMWR2X2VHR3pDdkRtcmxDYTZGaGxLajdOT29qMUhudnEzNkViSkljV0dLeUxiYUJOWm9ndWIwR29TUU1FbjFKcHRtNVlhU0ljU0NR?oc=5\" target=\"_blank\">Trump says foreign experts welcome after South Korean outrage o",
      "President Donald Trump is trying to smooth things over with South Korea after his administration arrested hundreds of workers at a Hyundai plant in Georgia earlier this month. Just hours after reports indicated that South Korea would open a human rights investigation into the detention of Korean emp"
    ],
    "image_url": "",
    "titles": [
      "Trump says foreign experts welcome after South Korean outrage over raid - Axios",
      "Trump says foreign workers are &#8216;welcome&#8217; after ICE raid in Georgia targets hundreds of South Koreans"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.73,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.608,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "President Donald Trump stated that foreign workers are \"welcome\" in the United States, addressing concerns after images of South Korean workers chained and handcuffed sparked outrage. He emphasized not wanting to \"disincentivize investment\" following the incident, which had caused widespread alarm in South Korea.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Company Expands Free Users' Access to Any Song Worldwide",
    "domain": "technology",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 15 Sep 2025 04:51:12 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "TechCrunch"
    ],
    "domains": [
      "www.bbc.com",
      "techcrunch.com"
    ],
    "snippets": [
      "Think you can work out where's hotter and colder than you today? Find out by playing our game",
      "On Monday, the company announced that free users globally will now be able to search and play any song they want or play a song shared by a friend or an artist they follow on social media."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/9457/live/a4b0d300-8366-11f0-ab3e-bd52082cd0ae.png",
    "titles": [
      "Play now",
      "Spotify will now let free users pick and play tracks"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.654,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.586,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "On Monday, a company announced that its free users worldwide can now search for and play any song of their choice, as well as play songs shared by friends or artists they follow on social media.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "NY Governor Hochul Endorses Socialist Mamdani Amid Trump Critique",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Mon, 15 Sep 2025 01:46:04 GMT",
    "source": "Axios",
    "sources": [
      "Fortune",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "fortune.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMihAFBVV95cUxPWlJOS0xGbml1LUp5c0VVdElralJNaGVVNzJBb1luUXpVM2g2cUVKY2dFR2hQTjg2WXJNeWVZcnBRaUh1dDVYbUJDRnZwTC1hdFpxMlJxVjc2RVpRY3RWRVRZdlRHdWFYMDhoV2JJaktGd2tadWlxYnh2Rkhobk1rY0NXNzE?oc=5\" target=\"_blank\">N.Y. Gov. Kathy Hochul endorses Zohran Mamdani f",
      "President Trump thinks Mamdani is likely to win, and criticized Republican Curtis Sliwa as \"not exactly prime time.\""
    ],
    "image_url": "",
    "titles": [
      "N.Y. Gov. Kathy Hochul endorses Zohran Mamdani for NYC mayor - Axios",
      "Days after calling herself a ‘staunch capitalist’ before a sitdown with socialist Zohran Mamdani, Kathy Hochul endorses him"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.614,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.585,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "New York Governor Kathy Hochul has endorsed Zohran Mamdani, a democratic socialist advocating for rent increases for the wealthiest New Yorkers. This endorsement comes despite Donald Trump's comment on Mamdani's 22-point lead in polls, referring to it as a 'rebellion against bad candidates'.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "\"Game Controllers Advance; Smartphone Market Seeks Reliability Over Innovation\"",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-09-15T18:00:00-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "www.theverge.com"
    ],
    "snippets": [
      "We live in a golden age of controllers. The gamepads on the market now are of higher quality, more versatile, and more customizable than anything from even one console generation ago. If you play games on an Xbox Series X or Series S (or a Windows PC), you have the unenviable task of choosing betwee",
      "Haven’t you heard? Phones are boring now. And that’s just fine! Most people buying a new phone just want something familiar that works better than the device they’re replacing. If that’s your MO, then you’re sure to find something reliable in my recommendations below. But even if you’re looking for "
    ],
    "image_url": "",
    "titles": [
      "The best Xbox controller to buy right now",
      "The best phone to buy right now"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.955,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.459,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The current market offers high-quality, versatile, and customizable game controllers, surpassing those from previous generations. This variety presents a challenge for Xbox Series X or S and Windows PC gamers in choosing the best option. Meanwhile, the smartphone market has reached a point where new models are considered boring by some, focusing instead on reliability and performance improvements over previous devices. Both segments highlight a consumer preference for familiarity and enhanced functionality in their tech choices.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "TechCrunch Disrupt 2025 Set for Oct 27-29, Adds Tables Amid High Demand",
    "domain": "technology",
    "source_domain": "techcrunch.com",
    "location": "global",
    "published": "Mon, 15 Sep 2025 16:05:17 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com"
    ],
    "snippets": [
      "TechCrunch Disrupt 2025 takes place October 27–29 at Moscone West in San Francisco, and we’re looking for motivated, curious, and energetic volunteers to help make it all happen.",
      "Back by overwhelming demand, we’ve added 10 more exhibit tables to TechCrunch Disrupt 2025 — and this will be the final release before they sell out.",
      "Zoom CEO Eric Yuan and Emergence Capital general partner Santi Subotovsky will join the Going Public Stage at Disrupt 2025 in a session called \"What Comes After Breakout Success?\" Join 10,000+ tech and VC leaders from October 27-29 in San Francisco."
    ],
    "image_url": "",
    "titles": [
      "Time’s running out to volunteer at TechCrunch Disrupt 2025",
      "By popular demand: 10 extra exhibit tables open at TechCrunch Disrupt 2025",
      "Zoom’s Eric Yuan and Emergence’s Santi Subotovsky on navigating the second act, at TechCrunch Disrupt 2025"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.844,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.437,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "TechCrunch Disrupt 2025 is scheduled for October 27-29 at Moscone West in San Francisco, seeking volunteers for the event. Due to high demand, an additional 10 exhibit tables have been added, marking the last chance before selling out. The conference will feature Zoom CEO Eric Yuan and Emergence Capital's Santi Subotovsky, discussing \"What Comes After Breakout Success?\" on the Going Public Stage. Over 10,000 tech and VC leaders are expected to attend.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]