[
  {
    "title": "Utah Man Arrested for Murder, Trump Calls for Death Penalty",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Fri, 12 Sep 2025 13:49:05 -0400",
    "source": "NPR",
    "sources": [
      "The Guardian",
      "Deutsche Welle",
      "The Verge",
      "NPR",
      "LA Times",
      "Business Insider",
      "BBC"
    ],
    "domains": [
      "www.npr.org",
      "www.latimes.com",
      "www.theguardian.com",
      "www.businessinsider.com",
      "www.dw.com",
      "www.bbc.com",
      "www.theverge.com"
    ],
    "snippets": [
      "Authorities said the suspect in Kirk's killing, Tyler Robinson, was detained on Thursday night — less than 36 hours after the shooting. Here's what happened in between.",
      "Sitting outside was a grey car, similar to the model detectives said the suspect used to drive to the scene of the attack.",
      "According to authorities in Utah, someone close to the suspect in the killing of Charlie Kirk turned him in, and he is currently in police custody. President Trump said he hopes the suspect receives the death penalty.",
      "<p>In Washington, a small city some 260 miles from where Kirk was killed, neighbors expressed shock and surprise at arrest of local college student</p><p><em>Editor’s note: This article was updated on 12 September 2025 to remove summarized quotes after the verified source who attended high school wi",
      "<p>The suspected shooter was taken into custody shortly before midnight in St. George, Utah, after a family member contacted authorities.</p>",
      "Discord denies that the suspect accused of killing Charlie Kirk used the messaging platform to discuss his crime, following the service getting mentioned by law enforcement in a press conference —&#160;and after accusations that it helped radicalize the alleged shooter, Tyler Robinson. In a statemen",
      "Officials said that 22-year-old Tyler Robinson of Utah has been arrested in connection with Charlie Kirk's death."
    ],
    "image_url": "",
    "titles": [
      "33 hours: A timeline of Charlie Kirk's shooting and the search for a suspect",
      "BBC reports from house linked to Charlie Kirk shooting suspect",
      "Charlie Kirk shooting: Suspect in custody, to be charged",
      "Suspect in Charlie Kirk shooting lived in quiet Utah town: ‘No different than my family’",
      "'Hey fascist, catch': Authorities nab suspect in Charlie Kirk shooting, but motive still unclear",
      "Discord is distancing itself from the Charlie Kirk shooting suspect",
      "'We got him': 22-year-old suspect in Charlie Kirk's shooting arrested"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.74,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.823,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Tyler Robinson, 22, was arrested in St. George, Utah, for the killing of Charlie Kirk, less than 36 hours after the crime. His arrest followed a tip from a family member. Discord refuted claims that Robinson discussed the crime on their platform. President Trump has called for the death penalty for Robinson. The arrest shocked his college town in Washington, 260 miles from the crime scene.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Crawford vs. Alvarez: Anticipated Boxing Match Set for Saturday",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Fri, 12 Sep 2025 15:22:54 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "Forbes",
      "ESPN",
      "Yahoo Sports"
    ],
    "domains": [
      "www.sportingnews.com",
      "www.forbes.com",
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "Terence Crawford wanted the fight he wasn't supposed to win. He gets that opportunity Saturday after a yearslong chase.",
      "SportsLine combat expert Josh Nagel has released his top boxing picks for Saturday's Canelo Alvarez vs. Terence Crawford fight on Netflix",
      "Everything you need to watch Canelo vs Crawford: fight date, start time, streaming on Netflix, and full fight night lineup from Allegiant Stadium.",
      "Here's what to know about the broadcasters calling Alvarez vs. Crawford.",
      "Canelo Alvarez and Terence Crawford are set for staggering paydays in Las Vegas. Here’s how much each star is reportedly earning for the fight.",
      "Canelo Alvarez vs. Terence Crawford is set for Sept. 13 in Las Vegas. Here’s the start time, how to watch, the full fight card, and weigh-in details."
    ],
    "image_url": "",
    "titles": [
      "How Terence Crawford landed Canelo Alvarez",
      "Canelo Alvarez vs. Terence Crawford odds, prediction, betting line, time: Sept. 13 picks by boxing expert",
      "Canelo Alvarez vs. Terence Crawford: How to watch, start time and full fight card",
      "Canelo Alvarez vs. Terence Crawford announcers: Meet Netflix's broadcast team for the 2025 boxing fight",
      "The Estimated Purses For Canelo Alvarez Vs. Terence Crawford Fight Are Staggering",
      "Canelo Alvarez Vs. Terence Crawford: What Time Does The Fight Start?"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.765,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.767,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Terence Crawford will face Canelo Alvarez in a highly anticipated boxing match on Saturday, following years of pursuit for this challenging fight. The event includes a full card, with details on the main event's ring walk time available for those interested.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Suspect in Shooting of Influencer at Utah University Arrested",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 12 Sep 2025 23:39:56 GMT",
    "source": "BBC",
    "sources": [
      "New York Times",
      "Al Jazeera",
      "BBC",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "www.bbc.com",
      "www.aljazeera.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "Tyler Robinson is accused of shooting the right-wing activist while he was speaking at a university in Utah on Wednesday.",
      "These were the updates on the killing of Charlie Kirk for Saturday, September 13.",
      "Kirk, an ally of President Donald Trump, was shot during an event at Utah Valley University, kicking off a multi-day manhunt.",
      "The F.B.I. released two grainy images of a person of interest, but the gunman remained at large more than a day after the shooting."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/e073/live/a67247f0-9031-11f0-b391-6936825093bd.jpg",
    "titles": [
      "Charlie Kirk's suspected killer brought into custody after confessing to father",
      "Updates: Suspected Charlie Kirk killer, Tyler Robinson, 22, held in custody",
      "Charlie Kirk shooter: Officials identify Tyler Robinson as suspect after arrest",
      "The Manhunt for Charlie Kirk’s Killer"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.819,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.753,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The suspect in the shooting of conservative influencer Kirk at Utah Valley University was arrested on Friday, as confirmed by Utah Governor Spencer J. Cox. The arrest followed a multi-day manhunt after the incident. Donald Trump revealed on Fox News that the suspect was identified by someone close to the situation.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Tigers' Skubal Exits Game With Side Tightness Amid Postseason Concerns",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Fri, 12 Sep 2025 22:52:51 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "Tigers star left-hander Tarik Skubal left the club's 8-2 loss to the Marlins in the fourth inning Friday night after experiencing tightness in his left side, according to the team.",
      "Losing Skubal for any portion of the postseason would be devastating for Detroit",
      "<p>The Detroit Tigers will be holding their breath after ace Tarik Skubal left Friday&#8217;s game in the fourth inning with a trainer.</p>"
    ],
    "image_url": "",
    "titles": [
      "Tigers ace Skubal exits start, to undergo imaging",
      "Tarik Skubal injury update: Tigers ace exits start vs. Marlins with tightness in left side",
      "Tigers’ Tarik Skubal leaves vs. Marlins with left side tightness in 4th inning"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.894,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.74,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Tarik Skubal, the Detroit Tigers' star left-hander, exited the game against the Marlins in the fourth inning due to tightness in his left side. This occurred during an 8-2 loss for the Tigers. The team and fans are concerned about his availability for the postseason, considering his key role.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Prince Harry Makes Surprise Visit to Ukraine to Support Wounded Soldiers",
    "domain": "general",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Fri, 12 Sep 2025 19:41:54 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "Washington Post",
      "New York Times"
    ],
    "domains": [
      "www.theguardian.com",
      "www.washingtonpost.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "<p>Duke says serving others has saved him as he announces support for  veterans through his Invictus foundation</p><p>Prince Harry laid a wreath at a flower and flag memorial to Ukraine’s war dead in Kyiv’s Maidan Square during a surprise visit to support the country in its fight against Russia, as ",
      "“We cannot stop the war but what we can do is do everything we can to help the recovery process,” Harry told the Guardian newspaper of his second visit to Ukraine.",
      "The prince arrived in Kyiv on his second trip to the country this year. The visit comes after his charity supporting wounded soldiers said it would expand post-conflict rehabilitation."
    ],
    "image_url": "https://i.guim.co.uk/img/media/ca6e69062b2a30bdaf2ee21325beb5b1c3f4ec60/620_0_4221_3377/master/4221.jpg?width=140&quality=85&auto=format&fit=max&s=75926a4d36d8e80eed5e427da359ff76",
    "titles": [
      "Prince Harry lays wreath to Ukrainian war dead on surprise visit to Kyiv",
      "Prince Harry makes surprise visit to Kyiv to see wounded veterans",
      "Prince Harry Meets War Veterans in Surprise Visit to Ukraine"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.754,
      "consensus": 0.789,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.732,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Prince Harry has made a surprise second visit to Ukraine, aiming to support the recovery of wounded service members. During his trip, he emphasized the importance of aiding the rehabilitation process for military personnel injured in the conflict with Russia. His charity, which focuses on assisting wounded soldiers, announced plans to expand post-conflict rehabilitation efforts.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "keywords: effort, plan, support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Stellantis Halts Ram 1500 REV, Unveils Ramcharger Extended-Range Truck",
    "domain": "technology",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Fri, 12 Sep 2025 20:56:26 GMT",
    "source": "CNBC",
    "sources": [
      "The Verge",
      "TechCrunch",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "techcrunch.com",
      "www.theverge.com"
    ],
    "snippets": [
      "Ram said it would still plan to launch an extended-range electric truck, which is equipped with an electric generator and a gas engine.",
      "Stellantis announced that it was discontinuing its Ram 1500 REV electric truck, citing slowing sales of heavy-duty electric trucks. The name plate, however, will live on. Stellantis said that it was renaming its Range-Extended Electric Vehicle (REEV) Ramcharger pickup to Ram 1500 REV. “This vehicle ",
      "Stellantis, the parent company of Ram, said Friday that it will no longer develop a battery-electric full-size pickup. The company cited low demand for full-size battery-electric trucks as the primary reason."
    ],
    "image_url": "",
    "titles": [
      "Ram cancels plans for all-electric pickup truck",
      "Stellantis cancels Ram 1500 REV as electric truck demand dims",
      "Ram ends EV pickup truck plans"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.774,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.702,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Stellantis announced the discontinuation of the Ram 1500 REV electric truck due to low demand for full-size battery-electric trucks. However, they plan to launch an extended-range electric truck, now named Ramcharger, featuring an electric generator and a gas engine. This move reflects a shift in their electric vehicle strategy while maintaining the Ram nameplate.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump to Send National Guard to Memphis, Prefers Chicago Deployment",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 12 Sep 2025 17:26:38 GMT",
    "source": "BBC",
    "sources": [
      "CNBC",
      "BBC",
      "Axios"
    ],
    "domains": [
      "www.cnbc.com",
      "www.bbc.com",
      "news.google.com"
    ],
    "snippets": [
      "The deployment of the National Guard to Memphis comes roughly a month after he sent troops to Washington DC.",
      "<a href=\"https://news.google.com/rss/articles/CBMihgFBVV95cUxNd3FWM1owM1pDd0ZVUTMzS3ZXSFM3b1lsdS1CUGZrUkNnS2lXSmZhQ0FRZm1ESnFkTmpacGVneHFYNkVOazdEcWZER1ZjT0xRb0ZaMzR5SVpaSGU0SG1PZ29BTnE1QUs5ZFZ2MC1XcUwyd25mcERWbGQ1OWo2cm5aT0xtcG53Zw?oc=5\" target=\"_blank\">Trump to deploy National Guard to Memphis ove",
      "<a href=\"https://news.google.com/rss/articles/CBMijAFBVV95cUxOTkxqS3lhSTRmMW10REdRVWRQRUtMYm1jeThOMTZRbEZxLVBqaFZMenFLVWtVeTJYbFhEdERpSzJaTkNHWm0ybE5OWEhCTmFHS3ZVeldOY3Q1XzFBYlluYWNQenctNkxTU3JYMnB1VVRXYmVWcXYtU3lpR09kQUR2Tl9jdXVvZFU5eEZfWg?oc=5\" target=\"_blank\">Trump backs off Chicago National Guar",
      "The president called Memphis \"deeply troubled.\""
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/8e9c/live/341ec480-8ff0-11f0-a795-b308c7069dd1.jpg",
    "titles": [
      "Memphis next US city to see National Guard troops, Trump says",
      "Trump to deploy National Guard to Memphis over crime rate - Axios",
      "Trump backs off Chicago National Guard threats - Axios",
      "Trump says National Guard will deploy to Memphis next, sidestepping Chicago for now"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.719,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.698,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "President Donald Trump announced plans to send National Guard troops to Memphis, citing the city's \"deeply troubled\" state. This decision is part of his administration's broader strategy to address urban crime in Democratic-led cities. However, Trump also mentioned a preference for deploying the National Guard to Chicago instead. The announcement came after the Memphis mayor requested financial assistance, not military intervention.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "England Hits Record T20 Total in 146-Run Victory Over South Africa",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 12 Sep 2025 21:21:51 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC",
      "Sky Sports"
    ],
    "domains": [
      "www.bbc.com",
      "www.theguardian.com",
      "www.skysports.com"
    ],
    "snippets": [
      "Phil Salt hits 141 while Jos Buttler adds 83 as England score 304-2 - their highest ever total in a T20 international - before bowling South Africa out for 158, to ease to an historic win at Old Trafford in the second T20 and level the series at 1-1.",
      "<ul><li><p><a href=\"https://www.theguardian.com/sport/cricket/match/2025-09-12/england-cricket-team\">2nd T20: England, 304-2, bt South Africa, 158, by 146 runs</a></p></li><li><p>Hosts hit their highest T20 total to go level in the series</p></li></ul><p>England made history, and for the first time ",
      "Phil Salt smashed a new England-record T20I score of 141 on an extraordinary night in Manchester, the hosts scoring 300 for the first time as they beat South Africa by 146 runs to level the series."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/2b97/live/aacfe240-901c-11f0-84c8-99de564f0440.jpg",
    "titles": [
      "Record-breaking Salt helps England to historic win against South Africa",
      "Records tumble as Phil Salt’s stunning ton leads England to T20 rout of South Africa",
      "Salt inspires record-breaking England win over South Africa to level T20I series"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.781,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.693,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Phil Salt scored a record 141 and Jos Buttler 83, leading England to their highest T20 international total of 304-2 against South Africa. England then bowled South Africa out for 158, securing a 146-run victory at Old Trafford. This win levels the series at 1-1.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "China Delays iPhone Air Release Over eSIM Regulatory Approval",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Fri, 12 Sep 2025 16:10:26 GMT",
    "source": "CNBC",
    "sources": [
      "Business Insider",
      "TechCrunch",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "techcrunch.com",
      "www.businessinsider.com"
    ],
    "snippets": [
      "Wireless carriers in China must obtain regulatory approval before they can sell devices with an eSIM, the company said.",
      "Apple's iPhone Air launch in China could face delays due to its eSIM-only design, which some carriers lack support for.",
      "The eSIM-only iPhone Air's release is being delayed in China, likely due to regulatory issues around the approval of the embedded SIM."
    ],
    "image_url": "",
    "titles": [
      "Apple iPhone Air's China release delayed",
      "Apple's iPhone Air launch hits a snag in China",
      "Apple delays release of iPhone Air in China due to pending approval of eSIM"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.701,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.691,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The release of the eSIM-only iPhone Air in China is delayed as wireless carriers need regulatory approval to sell devices with an eSIM. This delay is likely due to issues related to obtaining approval for the embedded SIM.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Straw's RBI Double Leads Blue Jays to 6-1 Victory Over Orioles",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sat, 13 Sep 2025 01:59:19 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "globalnews.ca"
    ],
    "snippets": [
      "Myles Straw doubled in the go-ahead run in the sixth inning as the Toronto Blue Jays topped the Baltimore Orioles 6-1 on Friday.",
      "<p>The Blue Jays&#8217; infield experiment began Friday night with Andres Gimenez&#8217;s first start at shortstop since July 12, 2022 and he played clean on a quiet night during a 6-1 victory over the Orioles. </p>",
      "<p>Myles Straw hit the go-ahead RBI double and Chris Bassitt pitched five innings of one-run ball as the Toronto Blue Jays defeated the Baltimore Orioles 6-1.</p>"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/b41d65de5fb351dd1c536421d2b3b5fd7dfa3f36008dcb406a187836de46f007.jpg?quality=65&strip=all",
    "titles": [
      "Straw lifts Blue Jays over Orioles 6-1",
      "Gimenez, Blue Jays test infield changes in victory over Orioles",
      "MLB Highlights: Blue Jays 6, Orioles 1"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.878,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.681,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Myles Straw hit a go-ahead RBI double in the sixth inning, helping the Toronto Blue Jays defeat the Baltimore Orioles 6-1 on Friday. Andres Gimenez made his first start at shortstop since July 12, 2022, contributing to the win with a clean performance. Chris Bassitt pitched five innings, allowing only one run.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Chargers' Tart Fined for Slapping Chiefs' Kelce in Week 1 Game",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Fri, 12 Sep 2025 22:52:51 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "Chargers defensive tackle Teair Tart has been fined by the NFL for slapping Chiefs tight end Travis Kelce in their Week 1 game, a source told ESPN.",
      "Tart received an unnecessary roughness penalty for the contact to Kelce's helmet"
    ],
    "image_url": "",
    "titles": [
      "Source: Chargers' Tart fined for slapping Kelce",
      "Chargers DT Teair Tart fined for slapping Travis Kelce in Week 1 win over Chiefs, per report"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.894,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.659,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Teair Tart, Chargers defensive tackle, was fined by the NFL for slapping Chiefs tight end Travis Kelce during their Week 1 game, resulting in an unnecessary roughness penalty for hitting Kelce's helmet.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "NATO's \"Eastern Sentry\": Denmark, France, Germany Send Jets to Poland",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 13 Sep 2025 07:10:14 GMT",
    "source": "BBC",
    "sources": [
      "Deutsche Welle",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.dw.com"
    ],
    "snippets": [
      "Denmark, France and Germany will send jets to strengthen Poland's air defences after Russian drones flew into Polish territory.",
      "In response to the incursion of Russian drones into Polish airspace, NATO is launching a new operation called \"Eastern Sentry\" to protect its members who are vulnerable to Russia."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/e759/live/2d898a10-904f-11f0-9cf6-cbf3e73ce2b9.jpg",
    "titles": [
      "New Nato mission to bolster eastern flank after Russia drone incursion",
      "NATO launches new mission to protect eastern flank"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.957,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.653,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Denmark, France, and Germany are deploying jets to bolster Poland's air defenses following the entry of Russian drones into Polish territory. This move is part of NATO's \"Eastern Sentry\" operation, aimed at safeguarding members threatened by Russia.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Experts Predict Outcome of Canelo vs. Crawford Fight in Vegas",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "national",
    "published": "Sat, 13 Sep 2025 07:32:51 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Sky Sports",
      "Yahoo Sports"
    ],
    "domains": [
      "www.bbc.com",
      "www.skysports.com"
    ],
    "snippets": [
      "The world of boxing gives their predictions for Saul 'Canelo' Alvarez v Terence Crawford in Las Vegas.",
      "Experts have their say ahead of the Canelo Alvarez versus Terence Crawford undisputed super-middleweight championship clash in Las Vegas."
    ],
    "image_url": "",
    "titles": [
      "'It may be a chess match' - Canelo v Crawford predictions",
      "Canelo vs Crawford big-fight predictions: Who wins?"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.985,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.652,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Experts and the boxing community have shared their predictions for the highly anticipated undisputed super-middleweight championship fight between Saul 'Canelo' Alvarez and Terence Crawford in Las Vegas.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Utah Man Arrested for Murder of Activist Charlie Kirk",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sat, 13 Sep 2025 07:22:53 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "ABC News"
    ],
    "domains": [
      "abcnews.go.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "A 22-year-old Utah man has been arrested and booked for killing the prominent right-wing activist.",
      "ABC News' Aaron Katersky reports on the casings that Utah Gov. Spencer Cox says were found on the scene.",
      "A person is in custody in the fatal shooting of conservative activist Charlie Kirk, President Trump said."
    ],
    "image_url": "",
    "titles": [
      "Suspect in Charlie Kirk killing caught in US, widow vows to carry on legacy",
      "WATCH:  Suspect in killing of Charlie Kirk in custody, officials say",
      "WATCH:  Person in custody in shooting of Charlie Kirk, Trump says"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.982,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.651,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A 22-year-old man from Utah has been arrested for the murder of conservative activist Charlie Kirk. Casings were found at the scene, as reported by Utah Governor Spencer Cox. President Trump confirmed that a suspect is now in custody regarding the fatal shooting.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Argentina Edges Australia 28-26 in Rugby Championship, Carreras Scores 23",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "national",
    "published": "Sat, 13 Sep 2025 07:21:38 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Sky Sports",
      "Yahoo Sports"
    ],
    "domains": [
      "www.bbc.com",
      "www.skysports.com"
    ],
    "snippets": [
      "Argentina hold on to claim a tense 28-26 win against Australia in the Rugby Championship, with Santiago Carreras kicking 23 points for the Pumas.",
      "Santiago Carreras scored 23 points off the tee as Argentina punished Australia's poor discipline in a 28-26 win in the Rugby Championship on Saturday."
    ],
    "image_url": "",
    "titles": [
      "Argentina hold on to claim win against Australia",
      "Argentina punish Australia in narrow Rugby Championship win"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.981,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.651,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Argentina defeated Australia 28-26 in a Rugby Championship match, largely due to Santiago Carreras's 23 points from kicks. The victory was attributed to Australia's poor discipline during the game.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "22-Year-Old Arrested for Murder of Activist Charlie Kirk, Trump Announces",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Fri, 12 Sep 2025 18:39:37 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "Financial Times"
    ],
    "domains": [
      "www.ft.com",
      "www.npr.org"
    ],
    "snippets": [
      "President Trump announced that the man who authorities say shot and killed conservative activist Charlie Kirk has been arrested. Investigators identified him as 22-year-old Tyler Robinson.",
      "22-year-old in police custody after manhunt that began on Wednesday following killing of conservative activist"
    ],
    "image_url": "",
    "titles": [
      "Authorities have identified and arrested the man they say killed Charlie Kirk",
      "US authorities arrest suspect in Charlie Kirk assassination"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.819,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.651,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Authorities arrested 22-year-old Tyler Robinson in connection with the shooting death of conservative activist Charlie Kirk. President Trump announced the arrest, which followed a manhunt starting Wednesday.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "7.4 Magnitude Earthquake Strikes Kamchatka, Tsunami Alerts Issued",
    "domain": "general",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Sat, 13 Sep 2025 00:47:06 -0400",
    "source": "ABC News",
    "sources": [
      "ABC News",
      "New York Times"
    ],
    "domains": [
      "abcnews.go.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "A powerful 7.4 magnitude earthquake has struck near the east coast of Russia&rsquo;s Kamchatka region",
      "The quake briefly triggered tsunami alerts at nearby coastlines, less than two months after a larger earthquake sent tsunami waves across the Pacific."
    ],
    "image_url": "https://s.abcnews.com/images/US/abc_news_default_2000x2000_update_4x3t_384.jpg",
    "titles": [
      "Powerful earthquake strikes near the east coast of Russia’s Kamchatka region",
      "7.4-Magnitude Earthquake Strikes Russia’s Far East"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.93,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.648,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A 7.4 magnitude earthquake hit near the east coast of Russia's Kamchatka region, briefly causing tsunami alerts for nearby coastlines. This event comes less than two months after a larger quake triggered tsunamis across the Pacific. The current status of the tsunami alerts has not been specified.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Manchester Derby Set for Etihad; Gvardiol Out with Knee Injury",
    "domain": "sports",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sat, 13 Sep 2025 06:00:23 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Yahoo Sports"
    ],
    "domains": [
      "www.aljazeera.com",
      "onefootball.com"
    ],
    "snippets": [
      "City and United are hoping to put painful seasons last year behind them in Sunday&#039;s early season Manchester derby.",
      "Probable lineups for the Manchester City vs Manchester United derbyManchester City vs Manchester United/@CNNThe Etihad Stadium will host a major showdown in English football as Manchester City take on...",
      "Josko Gvardiol is yet to play for Manchester City this season. The Croatian defender has missed all of Manchester City’s first three matches due to a knee injury. But as tomorrow’s clash with Manc..."
    ],
    "image_url": "",
    "titles": [
      "Man City vs Man United: Premier League – team news, start time and lineups",
      "Premier League - Manchester City vs Manchester United: probable lineups for the derby",
      "A vital player for Manchester City may return against Manchester United"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.954,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.646,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Manchester City and Manchester United are set to face off in an early season Manchester derby at the Etihad Stadium, both aiming to overcome their previous disappointing seasons. Croatian defender Josko Gvardiol will miss the game due to a knee injury, having not played for Manchester City in their first three matches of the season.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Chagas Disease, Spread by Kissing Bug, Now Endemic in the US",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-09-13T05:26:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "www.dw.com"
    ],
    "snippets": [
      "Chagas disease, previously prevalent mainly in Latin America, is now increasingly occurring in the US. The \"kissing bug\" passes on a parasite that can cause life-threatening damage to the heart and nerves.",
      "<a href=\"https://news.google.com/rss/articles/CBMie0FVX3lxTE53Y2RoQ1pFTTVsUkpvY3I3ampuSHZIYkdoQ0hocnczZURfMDJnQ1AxbjlhN2FsdUJyRWM3MWlzOWJNdGRweE10ZUxycl9vTDZfSzBfdVR4ZUl6aC1MYk92MzBOVGc0SDJGMElfd3lKMzRVNVlEYVU4aGRBQQ?oc=5\" target=\"_blank\">\"Kissing bug\" disease now seen as \"endemic\" in the U.S.</a>&n"
    ],
    "image_url": "",
    "titles": [
      "Chagas disease: 'Kissing bug' spreads in the US",
      "\"Kissing bug\" disease now seen as \"endemic\" in the U.S. - Axios"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.943,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.644,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Chagas disease, primarily found in Latin America, is now increasingly diagnosed in the US. It is transmitted by the \"kissing bug,\" leading to serious heart and nerve damage. This condition is now considered endemic in the United States.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Keith Rabois Named Opendoor Chairman, Kaz Nejatian CEO; Workforce Cuts Planned",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Fri, 12 Sep 2025 20:26:14 GMT",
    "source": "CNBC",
    "sources": [
      "Business Insider",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "www.businessinsider.com"
    ],
    "snippets": [
      "Keith Rabois was named chairman of Opendoor this week and the company, which he co-founded, hired former Shopify executive Kaz Nejatian as its new CEO.",
      "Keith Rabois, cofounder and new chairman at Opendoor, said the company's headcount should be slashed and that remote work doesn't work."
    ],
    "image_url": "",
    "titles": [
      "Opendoor board chair Rabois says company is 'bloated,' needs to cut 85% of workforce",
      "Opendoor chair says the company currently has 1,400 employees but only needs 200 of them"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.766,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.615,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Keith Rabois was appointed chairman of Opendoor, a company he co-founded, and Kaz Nejatian, a former Shopify executive, was named the new CEO. Rabois also stated that Opendoor needs to reduce its workforce and expressed his belief that remote work is ineffective.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Officials to Present COVID Vaccine-Child Death Link Claim, Shares Drop",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Fri, 12 Sep 2025 16:47:10 GMT",
    "source": "CNBC",
    "sources": [
      "MarketWatch",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "www.marketwatch.com"
    ],
    "snippets": [
      "The report says officials plan to include the claim in a presentation next week to a key vaccine panel that advises the CDC on shot access and coverage.",
      "Shares of companies that make COVID-19 vaccines sank Friday, after a report raised fears that Trump administration health officials will blame the vaccines for some child deaths."
    ],
    "image_url": "",
    "titles": [
      "Pfizer, Moderna shares fall on report that Trump officials will link child deaths to Covid shots",
      "Moderna, Pfizer stocks fall as Trump officials reportedly link COVID shots to child deaths"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.71,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.604,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Officials are set to present a claim to a CDC advisory panel next week that may link COVID-19 vaccines to child deaths. Following this report, shares of vaccine manufacturers dropped on Friday.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Experimental Tsunami Detection System Passes Test After Kamchatka Quake",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Fri, 12 Sep 2025 12:24:04 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org",
      "NASA"
    ],
    "domains": [
      "phys.org",
      "www.nasa.gov"
    ],
    "snippets": [
      "A massive earthquake and subsequent tsunami off Russia in late July tested an experimental detection system that had deployed a critical component just the day before.",
      "A massive earthquake and subsequent tsunami off Russia in late July tested an experimental detection system that had deployed a critical component just the day before. A recent tsunami triggered by a magnitude 8.8 earthquake off Russia’s Kamchatka Peninsula sent pressure waves to the upper layer of "
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/nasas-guardian-tsunami.jpg",
    "titles": [
      "NASA's GUARDIAN tsunami detection tech catches a wave in real time",
      "NASA’s GUARDIAN Tsunami Detection Tech Catches Wave in Real Time"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.719,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.599,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In late July, a magnitude 8.8 earthquake off Russia's Kamchatka Peninsula triggered a tsunami that tested an experimental detection system, which had a critical component deployed just a day earlier. This system successfully detected pressure waves from the tsunami in the upper layer of the ocean.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Tether Launches USAT Stablecoin, Names Bo Hines CEO of U.S. Division",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Fri, 12 Sep 2025 15:49:36 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Fortune"
    ],
    "domains": [
      "www.cnbc.com",
      "fortune.com"
    ],
    "snippets": [
      "Tether has revealed its domestic stablecoin, USAT, and named former White House advisor Bo Hines CEO of its U.S. business.",
      "Tether tapped crypto bank Anchorage Digital and its longtime partner Cantor Fitzgerald to issue the token."
    ],
    "image_url": "",
    "titles": [
      "Tether reveals USAT stablecoin, appoints Bo Hines, former White House advisor, to lead U.S. business",
      "Tether to launch U.S. stablecoin, appoints former Trump crypto guru Bo Hines as CEO of American expansion"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.695,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.594,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Tether introduced a new domestic stablecoin, USAT, and appointed ex-White House advisor Bo Hines as CEO of its U.S. operations. The company is partnering with crypto bank Anchorage Digital and its longstanding ally Cantor Fitzgerald to issue the token.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Mount Logan Capital Completes Merger, Now Trades as MLCI on NASDAQ",
    "domain": "business",
    "source_domain": "financialpost.com",
    "location": "national",
    "published": "Sat, 13 Sep 2025 03:51:57 +0000",
    "source": "Financial Post",
    "sources": [
      "Financial Post"
    ],
    "domains": [
      "financialpost.com"
    ],
    "snippets": [
      "NEW YORK, Sept. 12, 2025 (GLOBE NEWSWIRE) &#8212; Mount Logan Capital Inc. (formerly Yukon New Parent, Inc., “New Mount Logan”) filed an early warning report today in connection with the closing of the all-stock strategic business combination (the “Business Combination”) of Mount Logan Capital Inter",
      "Establishes U.S.-based alternative asset management and insurance solutions platform Merged Company, Mount Logan Capital Inc., expected to begin trading on NASDAQ under the symbol “MLCI” on Monday, September 15, 2025 Closing Merger Value of approximately US$122.7 million equates to a price per share"
    ],
    "image_url": "",
    "titles": [
      "Early Warning Report of Mount Logan Capital Inc. (formerly Yukon New Parent, Inc.) in connection with the Closing of the Strategic Business Combination",
      "Mount Logan Capital Inc. and 180 Degree Capital Corp. Close Strategic Business Combination"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.913,
      "consensus": 0.35,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.461,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Mount Logan Capital Inc. completed a strategic all-stock merger, forming a U.S.-based alternative asset management and insurance solutions platform. The merged entity, now trading on NASDAQ under \"MLCI\" from September 15, 2025, has a closing merger value of approximately US$122.7 million.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: solution",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "TechCrunch Disrupt 2025 Announces Key Speakers, Side Event Deadline Tonight",
    "domain": "technology",
    "source_domain": "techcrunch.com",
    "location": "global",
    "published": "Fri, 12 Sep 2025 15:30:00 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com"
    ],
    "snippets": [
      "Planning your Series C and beyond? Hear from IVP’s Zeya Yang, Generation’s Lila Preston, and Diligent Robotics’ Andrea Thomaz on the Builders Stage at TechCrunch Disrupt 2025, October 27–29 in San Francisco.",
      "The application to host a Side Event at TechCrunch Disrupt 2025 closes tonight at 11:59 p.m. PT. Boost your brand during Disrupt Week in October. Apply now."
    ],
    "image_url": "",
    "titles": [
      "Preparing for your later-stage raise: Insider strategies from top investors at TechCrunch Disrupt 2025",
      "Last day to amplify your brand: Host your Side Event at TechCrunch Disrupt 2025"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.705,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.409,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "TechCrunch Disrupt 2025, happening in San Francisco from October 27-29, will feature speakers like IVP's Zeya Yang, Generation's Lila Preston, and Diligent Robotics' Andrea Thomaz on the Builders Stage, focusing on Series C planning and beyond. Additionally, the deadline to apply for hosting a Side Event during Disrupt Week is tonight at 11:59 p.m. PT, offering an opportunity to enhance brand visibility.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]