[
  {
    "title": "San Francisco Giants pick up contract of Winnipeg Goldeyes infielder Dayson Croes",
    "domain": "general",
    "location": "national",
    "published": "Wed, 30 Apr 2025 23:56:06 +0000",
    "source": "Global News",
    "sources": [
      "Global News"
    ],
    "snippets": [
      "Goldeyes all-star infielder Dayson Croes is headed to a big league organization after his contract was transferred to the San Francisco Giants."
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/04/Dayson_Croes.jpg?quality=85&strip=all",
    "titles": [
      "San Francisco Giants pick up contract of Winnipeg Goldeyes infielder Dayson Croes"
    ],
    "summary": "Dayson Croes, an all-star infielder for the Goldeyes, has moved to a major league team as his contract was transferred to the San Francisco Giants. This transition marks a significant step in Croes' professional baseball career.",
    "constructiveness_score": 0.4,
    "constructiveness_reason": "This story provides basic awareness about the transfer of a player's contract from one team to another. However, it lacks depth or insight into the implications of this move for the teams involved or the player's career.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.998,
      "consensus": 0.2,
      "constructiveness": 0.4
    },
    "score": 0.535,
    "normalized_score": 3.41
  },
  {
    "title": "Saskatchewan Roughriders add 7 prospects, 2 locals in 2025 CFL Draft",
    "domain": "general",
    "location": "national",
    "published": "Wed, 30 Apr 2025 23:46:27 +0000",
    "source": "Global News",
    "sources": [
      "Global News"
    ],
    "snippets": [
      "Bowling Green defensive lineman Ali Saad was the fourth player taken off the board by the Saskatchewan Roughriders, shoring up their defence at the 2025 CFL Draft."
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/04/Bowling-Green-Ali-Saad-e1745988324769.jpg?quality=85&strip=all",
    "titles": [
      "Saskatchewan Roughriders add 7 prospects, 2 locals in 2025 CFL Draft"
    ],
    "summary": "The Saskatchewan Roughriders selected Bowling Green defensive lineman Ali Saad as the fourth overall pick in the 2025 CFL Draft, aiming to strengthen their defensive lineup.",
    "constructiveness_score": 0.4,
    "constructiveness_reason": "The story informs about the new players added to the Saskatchewan Roughriders' team. However, it doesn't provide deeper understanding or actionable insights regarding the team's strategy or the potential impact of these new additions.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.996,
      "consensus": 0.2,
      "constructiveness": 0.4
    },
    "score": 0.534,
    "normalized_score": 3.3
  },
  {
    "title": "Trump campaign chief claims he visited Australia to advise Liberals at start of election campaign",
    "domain": "general",
    "location": "global",
    "published": "Wed, 30 Apr 2025 23:43:24 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "snippets": [
      "<p><strong>Exclusive: </strong>Chris LaCivita, Trump’s presidential campaign co-manager, tells undercover reporters he advised on ‘structural issues’ related to Peter Dutton; the Coalition denies LaCivita was involved in campaign in any way</p><ul><li><a href=\"https://www.theguardian.com/australia-news/australian-election-2025\">See all our Australia 2025 election coverage</a></li></ul><p>One of the architects of Donald Trump’s 2024 victory claims he made an unpublicised visit to Australia to advise the Liberal party about “structural issues” related to Peter Dutton ahead of the federal election.</p><p>The veteran Republican strategist Chris LaCivita told undercover reporters posing as prospective clients for political consulting work he was working as a private consultant on the visit to Australia, not in an official capacity or as an adviser to the US president.</p> <a href=\"https://www.theguardian.com/australia-news/2025/may/01/trump-campaign-chief-lacivita-liberal-party-australia-ntwnfb-election-claims\">Continue reading...</a>",
      "<p><strong>Exclusive: </strong>Chris LaCivita, Trump’s presidential campaign co-manager, tells undercover reporters he advised on ‘structural issues’ related to Peter Dutton; the Coalition denies LaCivita was involved in campaign in any way</p><ul><li><a href=\"https://www.theguardian.com/australia-news/australian-election-2025\">See all our Australia 2025 election coverage</a></li></ul><p>One of the architects of Donald Trump’s 2024 victory claims he made an unpublicised visit to Australia to advise the Liberal party about “structural issues” related to Peter Dutton ahead of the federal election.</p><p>The veteran Republican strategist Chris LaCivita told undercover reporters posing as prospective clients for political consulting work he was working as a private consultant on the visit to Australia, not in an official capacity or as an adviser to the US president.</p> <a href=\"https://www.theguardian.com/australia-news/2025/may/01/trump-campaign-chief-lacivita-liberal-party-australia-ntwnfb-election-claims\">Continue reading...</a>"
    ],
    "image_url": "https://i.guim.co.uk/img/media/d5303e51158d3f13d76720677d5e443814fe6313/609_27_2874_1724/master/2874.jpg?width=140&quality=85&auto=format&fit=max&s=667935e14059f3d038b9188cf37c863e",
    "titles": [
      "Trump campaign chief claims he visited Australia to advise Liberals at start of election campaign",
      "Trump campaign chief claims he visited Australia to advise Liberals at start of election campaign"
    ],
    "summary": "Chris LaCivita, a key figure in Donald Trump's 2024 campaign victory, claimed he visited Australia to advise the Liberal Party on \"structural issues\" related to Peter Dutton before the federal election. LaCivita, speaking to undercover reporters, stated he was in Australia as a private consultant, not in any official capacity linked to the US president. The Coalition, however, has denied any involvement of LaCivita in their campaign efforts.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful information and context about the involvement of a key figure from Donald Trump's campaign in Australian politics. It helps readers understand the international influences in local politics, although it doesn't report on any solutions or improvements.",
    "score_components": {
      "magnitude": 0.429,
      "recency": 0.995,
      "consensus": 0.2,
      "constructiveness": 0.7
    },
    "score": 0.58,
    "normalized_score": 8.52
  },
  {
    "title": "US and Ukraine sign minerals deal after months of strained negotiations – Europe live",
    "domain": "general",
    "location": "global",
    "published": "Wed, 30 Apr 2025 23:39:17 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "snippets": [
      "<p>US treasury department announces agreement after reports of last-minute obstacles apparently overcome</p><ul><li><a href=\"https://www.theguardian.com/us-news/2025/apr/30/us-ukraine-minerals-deal-russia\">Full report: US and Ukraine sign minerals deal that solidifies investment in Kyiv’s defense against Russia</a></li></ul><p>In Spain, <strong>harrowing stories have continued to emerge</strong> after much of the Iberian Peninsula was plunged into an hours-long blackout earlier this week.</p><p><strong>Jonathan Bernal</strong>, a window washer in Madrid, has detailed how he and a co-worker were cleaning the outside windows of a skyscraper when the power went out. For four hours they <strong>ended up stranded on hanging scaffolding, some 240 metres above the city.</strong></p> <a href=\"https://www.theguardian.com/world/live/2025/apr/30/germany-spd-coalition-friedrich-merz-ukraine-volodymyr-zelenskyy-russia-vladimir-putin-europe-live-news\">Continue reading...</a>"
    ],
    "image_url": "https://i.guim.co.uk/img/media/ed64cbc034e6518680b7fd61bc7dea481f03c7c5/0_267_7008_4205/master/7008.jpg?width=140&quality=85&auto=format&fit=max&s=86b08b7d72da8de29a66715e66263cfa",
    "titles": [
      "US and Ukraine sign minerals deal after months of strained negotiations – Europe live"
    ],
    "summary": "The US Treasury Department has announced an agreement with Ukraine, finalizing a minerals deal to bolster Kyiv's defense capabilities against Russia, overcoming last-minute challenges. Meanwhile, Spain experienced a significant blackout, leaving areas of the Iberian Peninsula without power for hours. Among the affected, a window washer in Madrid and his co-worker were trapped on scaffolding 240 meters high during the outage, highlighting the personal dangers faced during the blackout.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This news story provides useful information about the geopolitical situation between the US and Ukraine, offering insights into the strategic decisions made by these countries. However, it doesn't report on solutions or improvements, nor does it provide a deep understanding of the systems or trends involved.",
    "score_components": {
      "magnitude": 0.429,
      "recency": 0.994,
      "consensus": 0.2,
      "constructiveness": 0.7
    },
    "score": 0.58,
    "normalized_score": 8.52
  },
  {
    "title": "Calgary’s mayor accused of ‘electioneering’ as council approves maintenance funding boost",
    "domain": "general",
    "location": "national",
    "published": "Wed, 30 Apr 2025 23:38:30 +0000",
    "source": "Global News",
    "sources": [
      "Global News"
    ],
    "snippets": [
      "Council approved a motion from Calgary's mayor that uses $20 million in surplus funds from Enmax's dividend to support facility maintenance and upgrades."
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/04/STILL-FOR-ADAM.jpg?quality=85&strip=all",
    "titles": [
      "Calgary’s mayor accused of ‘electioneering’ as council approves maintenance funding boost"
    ],
    "summary": "The Calgary City Council has approved a motion proposed by the mayor to allocate $20 million from Enmax's dividend surplus for the maintenance and upgrades of facilities. This decision aims to enhance and sustain the city's infrastructure.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story provides actionable insights into the city council's decision to boost maintenance funding. It also reports on the solution to improve the city's infrastructure, providing a deeper understanding of the local political dynamics. However, it could have provided more information on the impacts and implications of this decision.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.994,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.592,
    "normalized_score": 9.89
  },
  {
    "title": "Report: Evan Neal will move from tackle to compete for right guard job",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 30 Apr 2025 23:54:49 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "snippets": [
      "Evan Neal is moving to guard."
    ],
    "image_url": "",
    "titles": [
      "Report: Evan Neal will move from tackle to compete for right guard job"
    ],
    "summary": "Evan Neal, originally a tackle, is transitioning to the guard position. This change aims to utilize his skills more effectively on the offensive line. The decision reflects a strategic adjustment to enhance team performance.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story offers useful information about a strategic change in a sports team, which could affect its performance. It provides a deeper understanding of the decision-making process in sports teams. However, it doesn't report on a broader trend or system, limiting its score.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.998,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.555,
    "normalized_score": 5.68
  },
  {
    "title": "Surging Mariners beat Angels 9-3; Trout leaves game early with sore knee",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 30 Apr 2025 23:53:27 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "snippets": [
      "J.P. Crawford hit a tie-breaking two-run single in a six-run seventh inning and the Seattle Mariners won their seventh straight series with a 9-3 victory on Wednesday over the Los Angeles Angels and Mike Trout, who left the game with a sore left knee.  The outfielder was lifted for Jo Adell in the fourth after running out a groundout in his previous at-bat.  Trout has started all 29 games this season and is batting .179 with nine home runs."
    ],
    "image_url": "",
    "titles": [
      "Surging Mariners beat Angels 9-3; Trout leaves game early with sore knee"
    ],
    "summary": "J.P. Crawford led the Seattle Mariners to a 9-3 win over the Los Angeles Angels with a tie-breaking two-run single during a six-run seventh inning, marking the Mariners' seventh consecutive series win. Mike Trout of the Angels left the game early due to a sore left knee, after running out a groundout. Before exiting, Trout, who has played in all 29 games this season, had a batting average of .179 with nine home runs.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about the game's outcome and a key player's condition, but it does not offer deeper insights or context about the teams' strategies, player performance trends, or the implications of the game's result on the season.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.997,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.505,
    "normalized_score": 0.0
  },
  {
    "title": "Red Sox lineup: $38.5M starter makes Boston debut after signing 17 months ago",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 30 Apr 2025 23:51:10 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "snippets": [
      "Lucas Giolito, who signed a two-year, $38.5 million contract with Boston in December 2023, will finally make his Red Sox debut."
    ],
    "image_url": "",
    "titles": [
      "Red Sox lineup: $38.5M starter makes Boston debut after signing 17 months ago"
    ],
    "summary": "Lucas Giolito, after signing a two-year contract worth $38.5 million with the Boston Red Sox in December 2023, is set to make his debut with the team. This marks a significant addition to the Red Sox's pitching roster.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "While it informs readers about a new player joining the Red Sox, the story lacks details about what the player's addition means for the team's performance, tactics, or future prospects. It provides basic awareness but not much depth or insight.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.997,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.525,
    "normalized_score": 2.27
  },
  {
    "title": "NESN hires former MLB Network, Dodgers reporter to join Red Sox coverage, alt casts",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 30 Apr 2025 23:51:10 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "snippets": [
      "NESN has added a familiar face to its Red Sox coverage, hiring former MLB Network and Dodgers reporter Alanna Rizzo to a new role with the network."
    ],
    "image_url": "",
    "titles": [
      "NESN hires former MLB Network, Dodgers reporter to join Red Sox coverage, alt casts"
    ],
    "summary": "NESN has expanded its Red Sox coverage team by hiring Alanna Rizzo, a seasoned journalist previously with MLB Network and the Dodgers. Rizzo will be taking on a new role at the network, enhancing the broadcast experience for viewers with her expertise and insights from her extensive career in sports journalism.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story offers useful information about a new addition to the NESN team and implies that this could enhance the quality of Red Sox coverage. However, it does not delve into how this hire might impact the network's approach to sports journalism or the potential benefits for viewers.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.997,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.535,
    "normalized_score": 3.41
  },
  {
    "title": "Alex Cora gives ‘refreshing’ Red Sox player ‘A+’ for first month",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 30 Apr 2025 23:51:10 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "snippets": [
      "Alex Cora has really enjoyed watching one of his players hit in his first month."
    ],
    "image_url": "",
    "titles": [
      "Alex Cora gives ‘refreshing’ Red Sox player ‘A+’ for first month"
    ],
    "summary": "Boston Red Sox manager Alex Cora has expressed enjoyment in observing the performance of a player during his first month with the team. Cora's positive feedback highlights the player's impressive start to his tenure with the Red Sox.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about a positive performance by a new player in the Red Sox team. However, it doesn't provide deeper insights or context about the player's performance, or how it contributes to the team's overall performance.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.997,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.525,
    "normalized_score": 2.27
  },
  {
    "title": "Microsoft shares jump 9% on earnings and revenue beat, uplifting forecast",
    "domain": "business",
    "location": "national",
    "published": "Wed, 30 Apr 2025 23:53:10 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "snippets": [
      "The company's Azure cloud growth exceeded Wall Street consensus."
    ],
    "image_url": "",
    "titles": [
      "Microsoft shares jump 9% on earnings and revenue beat, uplifting forecast"
    ],
    "summary": "The company reported that its Azure cloud service's growth surpassed Wall Street's expectations. This indicates a positive performance trend for the company's cloud computing sector, reflecting stronger than anticipated demand or market expansion.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The story informs about Microsoft's financial performance, specifically in the context of its Azure cloud service. It provides useful information about the company's growth and market trends, which can be valuable for investors and others interested in the tech industry.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.997,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.575,
    "normalized_score": 7.95
  },
  {
    "title": "Microsoft shares jump after strong AI demand lifts cloud unit",
    "domain": "business",
    "location": "global",
    "published": "Wed, 30 Apr 2025 23:51:10 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times"
    ],
    "snippets": [
      "Profits rise nearly a fifth in March quarter sending stock up as much as 9% in after-hours trading"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F56883291-2898-4ed1-8401-04023af59501.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Microsoft shares jump after strong AI demand lifts cloud unit"
    ],
    "summary": "In the March quarter, a company experienced a nearly 20% increase in profits, which led to its stock surging by up to 9% during after-hours trading.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful context about the impact of AI demand on Microsoft's cloud unit. It offers insights into the company's profits and stock performance, contributing to the reader's understanding of market trends and the role of AI in the tech industry.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.997,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.583,
    "normalized_score": 8.86
  },
  {
    "title": "Robinhood CEO says firm is diversifying away from volatile crypto revenue even as Q1 earnings beat expectations",
    "domain": "business",
    "location": "global",
    "published": "Wed, 30 Apr 2025 23:50:45 +0000",
    "source": "Fortune",
    "sources": [
      "Fortune"
    ],
    "snippets": [
      "Robinhood reported $927 million in revenue in Q1, up 50% from the same period last year."
    ],
    "image_url": "https://fortune.com/img-assets/wp-content/uploads/2025/04/GettyImages-1812182818-e1746049689617.jpg?w=2048",
    "titles": [
      "Robinhood CEO says firm is diversifying away from volatile crypto revenue even as Q1 earnings beat expectations"
    ],
    "summary": "Robinhood, a financial services company, reported a revenue of $927 million in the first quarter, marking a 50% increase from the same period the previous year.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful insights into Robinhood's financial performance and its strategic shift away from volatile crypto revenue. However, it does not provide a deep understanding of the reasons behind this decision or its potential impacts.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.997,
      "consensus": 0.2,
      "constructiveness": 0.7
    },
    "score": 0.565,
    "normalized_score": 6.82
  },
  {
    "title": "Court finds Apple, executive lied under oath in Epic Games trial",
    "domain": "business",
    "location": "national",
    "published": "Wed, 30 Apr 2025 23:47:01 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "snippets": [
      "Apple willfully violated and ignored a 2021 decision that came out of the Epic Games case, Judge Yvonne Gonzalez Rogers said in a decision on Wednesday."
    ],
    "image_url": "",
    "titles": [
      "Court finds Apple, executive lied under oath in Epic Games trial"
    ],
    "summary": "On Wednesday, Judge Yvonne Gonzalez Rogers ruled that Apple intentionally breached a 2021 verdict from the Epic Games lawsuit.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story informs about a significant legal development involving Apple and Epic Games, contributing to the reader's understanding of the ongoing legal disputes in the tech industry. However, it lacks depth and does not offer insights into the broader implications of this ruling.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.996,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.554,
    "normalized_score": 5.57
  },
  {
    "title": "Microsoft CEO Satya Nadella says software is the ‘most malleable resource’ to combat ‘any type of inflationary pressure’",
    "domain": "business",
    "location": "global",
    "published": "Wed, 30 Apr 2025 23:43:50 +0000",
    "source": "Fortune",
    "sources": [
      "Fortune"
    ],
    "snippets": [
      "All three of Microsoft’s businesses beat the company’s internal guidance amid an uncertain economic climate."
    ],
    "image_url": "https://fortune.com/img-assets/wp-content/uploads/2025/04/GettyImages-2207879673-e1746056317178.jpg?w=2048",
    "titles": [
      "Microsoft CEO Satya Nadella says software is the ‘most malleable resource’ to combat ‘any type of inflationary pressure’"
    ],
    "summary": "Microsoft exceeded its own financial forecasts in all three of its business sectors despite facing an uncertain economic environment. This performance indicates the company's strong financial health and resilience in challenging market conditions.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides valuable insights into Microsoft's financial performance and the CEO's views on the role of software in combating inflation. It increases clarity around the company's strategy and resilience in uncertain economic conditions, contributing to the reader's understanding and decision-making.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.995,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.582,
    "normalized_score": 8.75
  },
  {
    "title": "Cracking the Code for Tastier Apples: New Genome Study Reveals Secrets",
    "domain": "science",
    "location": "global",
    "published": "Wed, 30 Apr 2025 23:52:52 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/cracking-the-code-for-tastier-apples-new-genome-study-reveals-secrets/\" rel=\"nofollow\" title=\"Cracking the Code for Tastier Apples: New Genome Study Reveals Secrets\"><img alt=\"Apple DNA\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Apple-DNA-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>New genomic analysis findings could help inform breeding efforts for apples that are tastier and more resilient. A comprehensive new study comparing the genomes of species within the Malus genus, including the domesticated apple and its wild relatives, has uncovered how these species are related and how their genomes have evolved over nearly 60 million [...]"
    ],
    "image_url": "",
    "titles": [
      "Cracking the Code for Tastier Apples: New Genome Study Reveals Secrets"
    ],
    "summary": "A new study analyzing the genomes of species within the Malus genus, which includes domesticated apples and their wild relatives, has identified key genetic information that could aid in breeding efforts for tastier and more resilient apples. By comparing the genomes, researchers have uncovered evolutionary insights spanning nearly 60 million years, potentially informing future apple breeding strategies.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it provides useful information about a new study that could aid in apple breeding for better taste and resilience. It also increases awareness about the genetic information and evolutionary insights of apples, which is relevant to those interested in agriculture and botany.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.997,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.585,
    "normalized_score": 9.09
  },
  {
    "title": "Keto Diet Reveals a New Way To Starve Deadly Cancer Cells",
    "domain": "science",
    "location": "global",
    "published": "Wed, 30 Apr 2025 23:29:27 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/keto-diet-reveals-a-new-way-to-starve-deadly-cancer-cells/\" rel=\"nofollow\" title=\"Keto Diet Reveals a New Way To Starve Deadly Cancer Cells\"><img alt=\"Natural Killer Cell Destorying Cancer Cell Illustration\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"437\" src=\"https://scitechdaily.com/images/Natural-Killer-Cell-Destorying-Cancer-Cell-Illustration-777x437.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>A study on fasting and the ketogenic diet uncovers a newfound weakness in pancreatic tumors, making them more susceptible to an existing cancer drug. Scientists at UC San Francisco have found a way to eliminate pancreatic cancer in mice by combining a high-fat ketogenic diet with a targeted cancer therapy. The therapy works by blocking [...]"
    ],
    "image_url": "",
    "titles": [
      "Keto Diet Reveals a New Way To Starve Deadly Cancer Cells"
    ],
    "summary": "A study by scientists at UC San Francisco has discovered that a ketogenic diet, when combined with a specific cancer therapy, can effectively eliminate pancreatic cancer in mice. The research found that fasting and the high-fat diet made pancreatic tumors more vulnerable to the cancer drug by revealing a new weakness. This combination treatment successfully eradicated the cancer in the tested mice.",
    "constructiveness_score": 1.0,
    "constructiveness_reason": "This story is highly constructive. It not only provides actionable insights about the potential benefits of a ketogenic diet in combination with a specific cancer therapy, but also reports on an innovative solution to treat pancreatic cancer. It increases awareness about the mechanisms of the diet and therapy in combating cancer cells.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.992,
      "consensus": 0.2,
      "constructiveness": 1.0
    },
    "score": 0.593,
    "normalized_score": 10.0
  },
  {
    "title": "New Weight Loss & Heart Drug Shows Significant Benefits in Major Trial of Obese Patients",
    "domain": "science",
    "location": "global",
    "published": "Wed, 30 Apr 2025 23:06:25 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/new-weight-loss-heart-drug-shows-significant-benefits-in-major-trial-of-obese-patients/\" rel=\"nofollow\" title=\"New Weight Loss &#038; Heart Drug Shows Significant Benefits in Major Trial of Obese Patients\"><img alt=\"Man Preparing Semaglutide Ozempic\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"486\" src=\"https://scitechdaily.com/images/Man-Preparing-Semaglutide-Ozempic-777x486.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>The drug enhances outcomes in a high-risk patient population with a significant unmet need. Tirzepatide significantly improved kidney function and cardiovascular outcomes in patients with obesity and heart failure with preserved ejection fraction (HFpEF), compared with placebo after one year. These findings were presented at the American College of Cardiology’s Annual Scientific Session (ACC.25) and [...]"
    ],
    "image_url": "",
    "titles": [
      "New Weight Loss & Heart Drug Shows Significant Benefits in Major Trial of Obese Patients"
    ],
    "summary": "A new weight loss and heart drug, Tirzepatide, demonstrated significant benefits in a major trial involving obese patients with heart failure with preserved ejection fraction (HFpEF). The study, presented at the American College of Cardiology's Annual Scientific Session (ACC.25), found that after one year, Tirzepatide significantly improved kidney function and cardiovascular outcomes compared to a placebo.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This news story is constructive as it provides useful information about a new drug that has shown significant benefits in a major trial. It reports on progress in the medical field, specifically in the treatment of obesity and heart failure. It also increases awareness about the drug's effects on kidney function and cardiovascular outcomes.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.986,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.581,
    "normalized_score": 8.64
  },
  {
    "title": "Can Potatoes Help With Weight Loss? Scientists Reveal Surprising Benefits",
    "domain": "science",
    "location": "global",
    "published": "Wed, 30 Apr 2025 22:43:46 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/can-potatoes-help-with-weight-loss-scientists-reveal-surprising-benefits/\" rel=\"nofollow\" title=\"Can Potatoes Help With Weight Loss? Scientists Reveal Surprising Benefits\"><img alt=\"Person Holding Potatoes\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Person-Holding-Potatoes-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>Potatoes can aid weight loss and blood sugar control when prepared properly, offering a satisfying, nutrient-rich addition to a healthy diet. Potatoes are one of the world’s most popular and most misunderstood foods. Although they often get a bad rap, new research shows they can actually support weight loss and improve insulin resistance, especially for [...]"
    ],
    "image_url": "",
    "titles": [
      "Can Potatoes Help With Weight Loss? Scientists Reveal Surprising Benefits"
    ],
    "summary": "Recent research highlights that potatoes, when prepared properly, can support weight loss and enhance blood sugar control, countering their negative reputation. This finding positions potatoes as a beneficial and nutrient-rich option within a healthy diet, particularly for those aiming to lose weight and improve insulin resistance.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it provides actionable insights for readers interested in weight loss and diet. It also reports on new research and findings, contributing to progress in understanding of diet and health. The story increases awareness about the potential benefits of potatoes, countering their negative reputation.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.981,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.58,
    "normalized_score": 8.52
  },
  {
    "title": "RFK Jr.’s HHS Orders Lab Studying Deadly Infectious Diseases to Stop Research",
    "domain": "science",
    "location": "global",
    "published": "Wed, 30 Apr 2025 21:53:51 +0000",
    "source": "Wired",
    "sources": [
      "Wired"
    ],
    "snippets": [
      "NIAID’s Integrated Research Facility is one of the few federal facilities charged with studying Ebola. Tuesday afternoon, all of its work was put on indefinite pause by Robert F. Kennedy Jr.’s department."
    ],
    "image_url": "https://media.wired.com/photos/68116f610bcc8f905add4c0f/master/pass/GettyImages-1206592386.jpg",
    "titles": [
      "RFK Jr.’s HHS Orders Lab Studying Deadly Infectious Diseases to Stop Research"
    ],
    "summary": "The National Institute of Allergy and Infectious Diseases’ Integrated Research Facility, tasked with studying Ebola, had its operations indefinitely halted on Tuesday afternoon by the department led by Robert F. Kennedy Jr. This decision affects one of the few federal facilities dedicated to Ebola research.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about a significant decision affecting Ebola research. However, it doesn't offer solutions, improvements, or innovations, and it doesn't provide enough context or depth to fully understand the implications of this decision. It does raise awareness about the importance of such research facilities.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.97,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.547,
    "normalized_score": 4.77
  }
]