[
  {
    "title": "Trump Signs Deal Allowing TikTok U.S. Operations with Majority American Ownershi",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Thu, 25 Sep 2025 17:47:53 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "CNBC",
      "Business Insider",
      "Axios",
      "TechCrunch",
      "The Guardian"
    ],
    "domains": [
      "www.cnbc.com",
      "techcrunch.com",
      "www.theguardian.com",
      "www.npr.org",
      "www.businessinsider.com",
      "news.google.com"
    ],
    "snippets": [
      "The new order says that the deal to turn over a majority stake in TikTok to a group of U.S. investors meets the terms ordered by Congress, and will allow it to stay online in the U.S.",
      "<a href=\"https://news.google.com/rss/articles/CBMiX0FVX3lxTE5lOEY1LVpzU2RvdUFaRW1tbkxPdmpsTDE0cmRpVnJoOFhSb0Eyd3oyS1pnc2stT1VfSEZSYkt5UHhDeWExU1cta20zWU1fS3VVdGJiVnoxT1pPbmRjbjBj?oc=5\" target=\"_blank\">Trump signs order allowing TikTok deal to proceed</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Axios</font>",
      "President Donald Trump on Thursday approved a proposed deal that would keep TikTok alive in the U.S.",
      "<p>Agreement separates app from Chinese owner ByteDance and allows US investors to take 80% stake</p><p>Donald Trump signed an executive order on Thursday <strong> </strong>outlining<strong> </strong>the terms of a deal to transfer TikTok to a US owner.</p><p>Trump said he and China’s president Xi J",
      "President Donald Trump signed an executive order approving a sale of TikTok's US business. Oracle will audit its algorithm and secure its data.",
      "Trump's executive order essentially bars the attorney general or Department of Justice from enforcing that law for 120 days while the divestiture plan presented to the president is executed."
    ],
    "image_url": "",
    "titles": [
      "Trump advances TikTok deal with new executive order",
      "Trump signs order allowing TikTok deal to proceed - Axios",
      "Trump approves TikTok deal through executive order, Vance says business valued at $14 billion",
      "Trump signs executive order to transfer TikTok to US owners",
      "Trump approved a $14 billion TikTok deal in an executive order, and employees have big questions",
      "Trump signs executive order to facilitate TikTok deal"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.951,
      "consensus": 1.0,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.875,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "President Donald Trump signed an executive order approving a deal for TikTok to transfer a majority stake to U.S. investors, allowing the app to continue operating in the U.S. The agreement involves separating TikTok from its Chinese owner ByteDance, with U.S. investors taking an 80% stake. Oracle will audit TikTok's algorithm and ensure data security. This move meets Congressional requirements and prevents the Department of Justice from enforcing any law that could shut down TikTok in the U.S. for 120 days while the plan is implemented.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Ex-FBI Director Comey Indicted for False Statements, Obstruction",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Thu, 25 Sep 2025 19:09:26 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "CNBC",
      "Financial Times",
      "Axios",
      "Deutsche Welle",
      "The Guardian"
    ],
    "domains": [
      "www.cnbc.com",
      "www.theguardian.com",
      "www.ft.com",
      "www.npr.org",
      "www.dw.com",
      "news.google.com"
    ],
    "snippets": [
      "Comey faces one count of making false statements and one count of obstruction of justice in connection.<br />",
      "Comey is accused of making false statements and obstructing justice. Trump fired Comey in 2017, as he investigated the Trump 2016 presidential campaign's possible collusion with Russia.",
      "<a href=\"https://news.google.com/rss/articles/CBMif0FVX3lxTE5xbUxMdkxzOUNVRkF5UEtQU0hxb1p6UnJBTnVFLVZINGRRQjlHLVlBTkRlWEdOT2JucW1yZzdGcWFYUWp3REIyVUF5dEtVQV9vUi1RV2szNUxFT3lGenhhaHY3cVpVQVJXQmZ4bGZCMWFDYnZrVXAzWGh6dGZ2NlU?oc=5\" target=\"_blank\">Former FBI Director James Comey indicted</a>&nbsp;&nbsp;",
      "President Donald Trump gloated about the filing of criminal charges against James Comey, whom he fired as FBI director in 2017, in his first White House term.",
      "Trump’s political opponent accused of obstructing a Congressional investigation and making a false statement",
      "<p>Comey, one of Trump’s frequent targets, indicted on counts of making false statements and obstruction of justice</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/live/2025/sep/25/donald-trump-james-comey-fbi-ice-texas-latest-us-politics-news-updates-live\">US politics – latest updates</a",
      "<p>President attacks ‘one of the worst human beings’ after Comey indicted by federal grand jury on two counts</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/2025/sep/25/james-comey-fbi-director-indictment\"><strong>Full story: James Comey indicted by federal grand jury</strong></a></p></l"
    ],
    "image_url": "",
    "titles": [
      "FBI Director James Comey indicted on criminal charges stemming from 2020 testimony",
      "Former FBI Director James Comey indicted on two counts",
      "Former FBI Director James Comey indicted - Axios",
      "Former FBI Director James Comey indicted on obstruction, false statement charges",
      "US justice department hits former FBI chief James Comey with criminal charges",
      "Ex-FBI director James Comey indicted on two charges as Trump pushes to prosecute political enemies",
      "Trump celebrates indictment of former FBI director James Comey: ‘Justice in America’ – live"
    ],
    "score_components": {
      "magnitude": 0.986,
      "recency": 0.978,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.866,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Former FBI Director James Comey has been indicted by a federal grand jury on charges of making false statements and obstruction of justice. These charges are connected to his actions while investigating the Trump 2016 presidential campaign's potential collusion with Russia. President Donald Trump, who fired Comey in 2017, publicly expressed satisfaction over the indictment. The current status is that Comey faces legal proceedings for the accusations against him.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Amazon Settles for $2.5B Over Prime Subscription Deception Claims",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Thu, 25 Sep 2025 18:50:24 GMT",
    "source": "Axios",
    "sources": [
      "CNBC",
      "Fortune",
      "Business Insider",
      "Axios",
      "TechCrunch"
    ],
    "domains": [
      "www.cnbc.com",
      "techcrunch.com",
      "fortune.com",
      "www.businessinsider.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMibEFVX3lxTFA1WXVkbk5XT0tOa2t6cUJkMHlUR1ZfVENEZmpkNWtVQ21QU19JRnRoYmFQdHRLNzFOaUxVdWRwaHNXUGZBcTZUZjUtODNCZzlMTzBrejZTdEVzRWxnSjZWWmV4b0I5RFVUNm5WRw?oc=5\" target=\"_blank\">Amazon reaches $2.5 billion settlement over FTC's Prime lawsuit</a>&nbsp;&nbsp;<f",
      "Opening arguments for the trial in Seattle took place on Tuesday and the proceedings were expected to last a month.",
      "The FTC's lawsuit stemmed from previous Business Insider reporting that found Amazon was aware users found the Prime cancellation process confusing.",
      "Business Insider investigated Amazon Prime's practices in 2022, reigniting an FTC case",
      "The surprise settlement between the online retail giant and the Trump administration happened just a few days into the trial over one of Amazon’s most important businesses. Amazon is paying a steep price—and taking a big win.",
      "The company will be required to pay a $1 billion civil penalty and provide $1.5 billion in refunds back to an estimated 35 million consumers harmed by the company's \"deceptive Prime enrollment practices,\" the FTC says."
    ],
    "image_url": "",
    "titles": [
      "Amazon reaches $2.5 billion settlement over FTC's Prime lawsuit - Axios",
      "Amazon reaches $2.5 billion settlement with FTC over 'deceptive' Prime program",
      "Amazon to pay $2.5 billion settlement over allegations it deceived Prime subscribers",
      "How Business Insider's investigation into Amazon Prime led to a record $2.5 billion settlement with the US government",
      "Why Amazon actually got off easy despite ‘historic’ $2.5 billion Prime deceptive practices settlement",
      "Amazon to pay $2.5B in FTC settlement over ‘deceptive’ Prime tactics"
    ],
    "score_components": {
      "magnitude": 0.964,
      "recency": 0.875,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.811,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Amazon has agreed to a $2.5 billion settlement with federal regulators over allegations of deceptive web designs that tricked millions into unwanted Prime subscriptions and made cancellation difficult. The settlement includes a $1 billion civil penalty and $1.5 billion in consumer refunds for the estimated 35 million affected. The FTC accused Amazon of using \"dark patterns\" for auto-renewals and a complex cancellation process. This resolution follows a lawsuit and a Business Insider investigation into Amazon Prime's practices.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Ex-Arsenal Youth Player Billy Vigar Dies After Game Injury at 21",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 25 Sep 2025 18:13:13 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "CBS Sports",
      "The Guardian",
      "Sky Sports"
    ],
    "domains": [
      "www.skysports.com",
      "www.bbc.com",
      "www.theguardian.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Chichester City FC confirmed that Billy Vigar, 21, died on Thursday morning.",
      "The former Gunner had just joined Chichester City FC last month",
      "<ul><li><p>Vigar, 21, sustained injury in league game on Saturday</p></li><li><p>Arsenal pay tribute to ‘fiercely determined’ forward</p></li></ul><p>The Chichester City forward Billy Vigar has died at the age of 21 after sustaining a “significant brain injury” in a game last Saturday. The former Ar",
      "Former Arsenal striker Billy Vigar has died aged 21 after suffering a 'significant brain injury' while playing for Chichester City."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/a276/live/49a63c90-9a39-11f0-8766-3f88e8be4733.jpg",
    "titles": [
      "Former Arsenal striker dies after sustaining 'significant injury' during game",
      "Former Arsenal academy player Billy Vigar dies at 21 after suffering 'significant brain injury'",
      "Billy Vigar, Chichester and former Arsenal player, dies after sustaining brain injury",
      "Ex-Arsenal striker Vigar dies aged 21 after suffering 'significant brain injury'"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.864,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.762,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Billy Vigar, a 21-year-old former Arsenal youth player and Chichester City FC forward, passed away after suffering a significant brain injury during a league game last Saturday. His death was confirmed on Thursday morning. Arsenal paid tribute to him, highlighting his determination.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "England vs. Canada: Top Teams Unchanged for Rugby World Cup Final",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 25 Sep 2025 15:05:50 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian",
      "Sky Sports",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.skysports.com",
      "www.bbc.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "What key battles do England need to win in order to beat Canada and lift the Women's Rugby World Cup at Twickenham on Saturday?",
      "<ul><li><p>No changes in Red Roses 23 to face Canada on Saturday</p></li><li><p>Mitchell accepts men’s team failed to handle 2019 final</p></li></ul><p><br /><br />\n John Mitchell has learned from his experience of the men’s 2019 Rugby World Cup final and insists he has not made the same mistakes as",
      "England captain Nat Sciver-Brunt hit 122 as the visitors secured a morale-boosting 152-run over tournament co-hosts India in their first of two warm-up matches for the Women's World Cup.",
      "<p>No. 2 Canada and No. 1 England have named unchanged lineups for Saturday&#8217;s heavyweight clash in the final of the Women&#8217;s Rugby World Cup.</p>"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/305d/live/e5754ac0-9a17-11f0-928c-71dbb8619e94.png",
    "titles": [
      "The battles England need to win in World Cup final",
      "Mitchell insists his previous final defeat can help England to Rugby World Cup glory",
      "Sciver-Brunt hits 122 in big England win over India in World Cup warm-up",
      "Canada, England name unchanged lineups for heavyweight clash in Rugby World Cup final"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.81,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.751,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "For the Women's Rugby World Cup final at Twickenham on Saturday, both England (ranked No. 1) and Canada (ranked No. 2) have announced unchanged teams. This decision sets the stage for a highly anticipated match between the top-ranked teams.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Opposes West Bank Annexation by Israel",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-09-25T23:47:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "New York Times",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "www.dw.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "US President Donald Trump said an Israeli annexation of the West Bank is \"not going to happen.\" It comes as several Israeli ministers have pushed for the idea. DW has more.",
      "<a href=\"https://news.google.com/rss/articles/CBMie0FVX3lxTE5xZkgzaURWUUR4SzA0dVpWenFadHFkTWdFQ21UZ2xubmJ3eUFIY3Brc2VlcjlVeTVTRTFMTFJZYU03VDUyM1VLRElGU2VvYXpXS2RObHFsUmFDMWctVVp5YUZtWWpGRWlxZmFhSUo5aENoOTN4WWlsMjRiZw?oc=5\" target=\"_blank\">Trump says he won't let Netanyahu annex the West Bank</a>&nbs",
      "After more countries recognized a Palestinian state this week, President Trump said on Thursday that he would not permit Israel to take over the territory."
    ],
    "image_url": "",
    "titles": [
      "Middle East: Trump says Israel will not annex West Bank",
      "Trump says he won't let Netanyahu annex the West Bank - Axios",
      "Trump Says He Won’t Allow Israel to Annex the West Bank"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.991,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.749,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "US President Donald Trump announced he will not allow the annexation of the West Bank by Israel, despite several Israeli ministers advocating for it. This statement follows the recognition of a Palestinian state by more countries.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Canada Post Cuts Mail Delivery Frequency, Sparks Nationwide Strike",
    "domain": "general",
    "source_domain": "www.nytimes.com",
    "location": "global",
    "published": "Thu, 25 Sep 2025 22:59:09 +0000",
    "source": "New York Times",
    "sources": [
      "Ottawa Citizen",
      "CityNews",
      "New York Times"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "ottawacitizen.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "The government’s previous attempts at postal service cuts were politically unpopular, but Canada Post’s dire financial situation has expedited them.",
      "The Canadian Union of Postal Workers declared a nationwide strike in response to the announcement, calling the move an \"attack on our postal service and workers.\"",
      "Public Works and Procurement Minister Joël Lightbound says&#160;Canada&#160;Post&#160;will reduce the frequency of door-to-door letter mail delivery in an effort to shore up its finances. The minister announced today the federal government will accept all of the recommendations in the Industrial Inq"
    ],
    "image_url": "https://static01.nyt.com/images/2025/09/25/multimedia/25int-canada-mail-wkhl/25int-canada-mail-wkhl-mediumSquareAt3X.jpg",
    "titles": [
      "Canada Orders Postal Service To Ends Door-To-Door Mail Delivery",
      "Federal government to end door-to-door delivery in Canada Post shakeup",
      "Canada Post set to reduce frequency of letter mail delivery: minister"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.975,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.746,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Canada Post, facing financial difficulties, will decrease door-to-door letter mail delivery frequency. This decision follows previous unpopular postal service cuts. The Canadian Union of Postal Workers has initiated a nationwide strike, labeling the move as an attack on postal services and workers. Public Works and Procurement Minister Joël Lightbound announced the government's acceptance of all recommendations from the Industrial Inquiry to address the situation.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Starbucks Unveils $1B Restructuring, to Close 1% of Stores, Lay Off 900",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Thu, 25 Sep 2025 19:45:04 +0000",
    "source": "Al Jazeera",
    "sources": [
      "CNBC",
      "Al Jazeera",
      "Axios"
    ],
    "domains": [
      "www.cnbc.com",
      "news.google.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "The cuts are expected to lead to hundreds of layoffs.",
      "<a href=\"https://news.google.com/rss/articles/CBMifkFVX3lxTE1WeUNnZ0xCQ3d2cGI5Zk5HbTI3VlhfWlFfMndWVmpDUWp5dTBfT25sNDI1TlVpSnlNclh0ZkdkZEdqU09teC1ad3NGVjBSVHI0TWdIbDhEVlozVnA2a3hYQU00c1F1RGlUbWpLVWFmeXJSZU9fdnhBYzM3XzBwdw?oc=5\" target=\"_blank\">Starbucks to close stores, cut 900 jobs in $1B restructur",
      "Starbucks announced a $1 billion restructuring plan Thursday that involves closing some of its North American coffeehouses and laying off about 900 workers."
    ],
    "image_url": "",
    "titles": [
      "Starbucks to close underperforming stores in restructuring efforts",
      "Starbucks to close stores, cut 900 jobs in $1B restructuring - Axios",
      "Starbucks to close stores, lay off workers in $1 billion restructuring plan"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.911,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.729,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Starbucks announced a $1 billion restructuring plan, which includes closing 1% of its North American corporately owned stores and laying off 900 non-retail staff. This move is part of a turnaround strategy led by new CEO Brian Niccol.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Admin Partners with Musk's AI for Gov Operations",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Thu, 25 Sep 2025 16:06:40 GMT",
    "source": "Axios",
    "sources": [
      "TechCrunch",
      "Forbes",
      "Axios"
    ],
    "domains": [
      "www.forbes.com",
      "techcrunch.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMickFVX3lxTE9fMFp4Vm1RYVdnMjBJcU90X3pWQWhRS005UzIwZF93T0E4Y2l4dW50NmlXejk2bXBucTVpcFZXdlpkWlQyQUsyUG5XekZBUWUwSng2WW9KWWFZVTc3RW1vdzVwZGlxWFdnR3M4NHhLaFk2dw?oc=5\" target=\"_blank\">Trump admin to use Elon Musk's Grok chatbot for government business</a>&n",
      "The AI company will charge government agencies just $0.42 for 18 months of “Grok for Government.”",
      "xAI has reached a deal with the U.S. GSA to sell Grok to federal agencies for 42 cents over 18 months, undercutting OpenAI and Anthropic."
    ],
    "image_url": "",
    "titles": [
      "Trump admin to use Elon Musk's Grok chatbot for government business - Axios",
      "xAI’s Grok Chatbot Scores Government Deal Days After Trump And Musk Meeting",
      "Elon Musk’s xAI offers Grok to federal government for 42 cents"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.827,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.726,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Trump administration plans to utilize Elon Musk's AI company's Grok chatbot for government operations, securing a deal through the U.S. General Services Administration (GSA). This agreement allows federal agencies to access \"Grok for Government\" at a cost of $0.42 for an 18-month period, offering a competitive price point against rivals like OpenAI and Anthropic.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Disney Investors Seek Documents Over \"Kimmel\" Suspension Impact",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Thu, 25 Sep 2025 19:41:25 GMT",
    "source": "Axios",
    "sources": [
      "CNBC",
      "The Guardian",
      "Axios"
    ],
    "domains": [
      "www.cnbc.com",
      "news.google.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMifkFVX3lxTE9PRTdJLUFfbzFCYUxQZUJaU1kwb29ZazB2QU80Znp0cUNyT3lMV05MZmxILXJvemNMWW1VN3B1ejQwM3RFekcwaElwZlJvQmR2eVR4VUxtbkVEWWpHeDZyMWZRN0VjYlBtVjhfZE82ejFBajFQNGk3azBpd1lOUQ?oc=5\" target=\"_blank\">Disney investors argue Kimmel's suspension hurt profits, ",
      "A group of Disney investors are seeking board materials, communications and policies related to the suspension of \"Jimmy Kimmel Live!\"",
      "<p>Shareholders want ABC owner to turn over documents related to decision to temporarily suspend late-night show</p><p>A group of <a href=\"https://www.theguardian.com/film/walt-disney-company\">Disney</a> investors is asking the company to turn over documents related to the company’s decision to temp"
    ],
    "image_url": "",
    "titles": [
      "Disney investors argue Kimmel's suspension hurt profits, demand investigation - Axios",
      "Disney investors say handling of Jimmy Kimmel suspension put politics over shareholders, demand records",
      "Disney investors demand details into company’s Jimmy Kimmel suspension"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.891,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.715,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Disney investors have requested documents from the company regarding the decision to temporarily suspend \"Jimmy Kimmel Live!\" They argue that the suspension had a negative impact on profits and are seeking board materials, communications, and policies related to the suspension.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "White House Warns of Mass Firings if Government Shuts Down",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Thu, 25 Sep 2025 16:48:23 GMT",
    "source": "Axios",
    "sources": [
      "CNBC",
      "The Guardian",
      "Axios"
    ],
    "domains": [
      "www.cnbc.com",
      "news.google.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMigwFBVV95cUxOOHRLQVNEeFVseWFQR1ZBT2pqN21IZ0laeFd4bmE3aXBUQkdUaXZjWGVxRWNtd2FPUk5XLVEyTXNpbG45cXdZZEdodTN6M2R4a1RQVlFkR19DMXZXNkJvMlprbXo3b1ZSbENqSDJLdmNqeDBEVzdfTmYxb1c3SUFMb0FEWQ?oc=5\" target=\"_blank\">Why Democrats aren't sweating Republican threats ",
      "<a href=\"https://news.google.com/rss/articles/CBMiiwFBVV95cUxQYU10ZHRhYVBMbWtpOW53UzJPc1dwY2dIMUZWT0RJZlNUSV9VSnRUVlM2NG5jZWdIYlNmUlNyTFVHRzhSTDdiRk80OWx6ZGthOG5nMkJyMVJKX3ItR1BXTU52OU9qaVdpcHVlenA4d1dvWmFCX2VheWpER1RSTWxrRWZRMjN6N0pfaHNr?oc=5\" target=\"_blank\">White House threatens mass firings if g",
      "The warning could ratchet up pressure on Congress to strike a deal to avert a government shutdown.",
      "<p>Democrats accuse Trump of intimidation tactics after memo outlines much more aggressive step than previous shutdowns</p><p>The White House is telling federal agencies to prepare large-scale firings of workers if the <a href=\"https://www.theguardian.com/us-news/2025/sep/23/trump-democrats-meeting-"
    ],
    "image_url": "",
    "titles": [
      "Why Democrats aren't sweating Republican threats of mass firings in a shutdown - Axios",
      "White House threatens mass firings if government shuts down - Axios",
      "Trump OMB orders preparation for mass firings of federal workers if government shuts down",
      "White House tells agencies to prepare for firings if government shuts down"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.839,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.705,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The White House has warned of mass firings in the event of a government shutdown, pressuring Congress to reach a deal. This move, criticized by Democrats as an intimidation tactic, marks a more aggressive approach than previous shutdowns.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Sarkozy Convicted of Taking Gaddafi Funds, Sentenced to 5 Years",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 25 Sep 2025 13:09:54 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Deutsche Welle",
      "Washington Post"
    ],
    "domains": [
      "www.washingtonpost.com",
      "www.bbc.com",
      "www.dw.com"
    ],
    "snippets": [
      "Nicolas Sarkozy, president from 2007-12, was found guilty of criminal conspiracy but cleared of other charges.",
      "Former President Nicolas Sarkozy was convicted and sentenced to five years in prison on some charges in a case tied to the late Libyan dictator Moammar Gadhafi.",
      "Nicolas Sarkozy, convicted of conspiracy for seeking 2007 campaign funds from then-Libyan dictator Moammar Gaddafi, would be the first modern French president to serve time."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/03c1/live/c9d39070-99f8-11f0-88dc-4bebfe637e18.jpg",
    "titles": [
      "Former French president Sarkozy given five-year sentence after Libya case",
      "Paris court convicts former French President Sarkozy of criminal conspiracy in Libya trial",
      "Former French president handed 5-year prison term over Gaddafi money"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.778,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.692,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Nicolas Sarkozy, the former French president, was convicted by a Paris criminal court of criminal conspiracy for accepting millions of euros in campaign funds from the late Libyan dictator Muammar Gaddafi. He was sentenced to five years in prison and will remain in custody even if he appeals. Sarkozy has consistently denied the charges.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Announces US-Led Deal With Oracle to Take Over Video App",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Thu, 25 Sep 2025 16:50:40 -0400",
    "source": "NPR",
    "sources": [
      "Deutsche Welle",
      "NPR"
    ],
    "domains": [
      "www.npr.org",
      "www.dw.com"
    ],
    "snippets": [
      "President Trump on Thursday advanced a deal for a consortium of mostly U.S. investors to take over the hit video app. Trump says software company Oracle will take a major role in the new venture.",
      "Washington has been pushing to wrest control of the popular platform from Chinese ownership amid security concerns. Trump claims that Chinese leader Xi Jinping has approved the plan, which Beijing has not yet confirmed."
    ],
    "image_url": "",
    "titles": [
      "Trump signs order clearing way for takeover of U.S. version of app",
      "Trump signs order to facilitate TikTok sale to US buyers"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.932,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.683,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "President Trump announced a deal for a U.S.-led consortium, with Oracle playing a significant role, to take over the video app, addressing security concerns over its Chinese ownership. Trump stated that Chinese leader Xi Jinping has approved the plan, though Beijing has yet to confirm this.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Kyle Hamilton Backs Ravens DC Orr Amid Worst NFL Defense Ranking",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Thu, 25 Sep 2025 17:45:28 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Kyle Hamilton defended Ravens defensive coordinator Zach Orr on Thursday, saying \"the sky's not falling\" three games into the season.",
      "The Ravens have, statistically, the worst defense in the NFL entering Week 4"
    ],
    "image_url": "",
    "titles": [
      "Hamilton: Unfair to blame DC for Ravens' woes",
      "Ravens' Kyle Hamilton calls out 'spoiled' fans, denounces 'unfair' criticism of DC Zach Orr"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.95,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.68,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Kyle Hamilton supported Ravens defensive coordinator Zach Orr, stating \"the sky's not falling\" despite the team having the statistically worst defense in the NFL by Week 4 of the season.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Declares Ukraine Can Reclaim Territory with EU Support",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-09-25T19:15:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "New York Times"
    ],
    "domains": [
      "www.dw.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "US President Trump has declared that, with the EU's support, Ukraine is in a position to win back its territory currently occupied by Russia. What do Ukrainian politicians and experts make of this about-face?",
      "President Trump has shown dwindling interest in mediating a peace accord, joining European “security guarantees” for Ukraine or providing aid and intelligence to the Ukrainians."
    ],
    "image_url": "",
    "titles": [
      "What does Ukraine make of Trump saying it can win the war?",
      "With His Pivot on Ukraine, Trump May Be Washing His Hands of the War"
    ],
    "score_components": {
      "magnitude": 0.795,
      "recency": 0.902,
      "consensus": 0.591,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.676,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "US President Trump has declared that Ukraine can reclaim its territory occupied by Russia with EU support, marking a significant policy shift. Despite this, Trump has shown less interest in mediating a peace deal, joining European security efforts, or offering aid and intelligence to Ukraine. The reaction from Ukrainian politicians and experts to this change has not been specified.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: effort, support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Dodgers Win 12th NL West Title in 13 Years; Ohtani Hits 54th Home Run",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Thu, 25 Sep 2025 19:21:43 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "The Dodgers clinched their 12th NL West title in 13 years by beating the Diamondbacks 8-0 on Thursday.",
      "<p>Shohei Ohtani tied his career high with his 54th home run, hitting a ball into the Chase Field swimming pool for the Los Angeles Dodgers on Thursday.</p>"
    ],
    "image_url": "",
    "titles": [
      "Ohtani blasts 54th HR as Dodgers clinch NL West",
      "Ohtani hits 54th homer as Dodgers beat Diamondbacks for 12th NL West title in 13 years"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.982,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.676,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Los Angeles Dodgers secured their 12th NL West title in 13 years with an 8-0 victory over the Diamondbacks. During the game, Shohei Ohtani hit his 54th home run of the season, matching his career high, with the ball landing in the Chase Field swimming pool.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Florida Panthers' Barkov Injured in Training, Awaits Condition Update",
    "domain": "sports",
    "source_domain": "thehockeynews.com",
    "location": "national",
    "published": "Thu, 25 Sep 2025 23:16:41 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "thehockeynews.com"
    ],
    "snippets": [
      "According to Cam Robinson of Elite Prospects, there is internal concern within the Florida Panthers organization that Aleksander Barkov's injury could involve his ACL.",
      "<p>The Florida Panthers are awaiting word on the status of captain Aleksander Barkov</p>"
    ],
    "image_url": "",
    "titles": [
      "REPORT: Panthers Fear Captain Aleksander Barkov Could Have ACL Injury",
      "Panthers captain Barkov helped off ice with leg injury"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.981,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.668,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "During the first full training camp practice of the season, Florida Panthers captain Aleksander Barkov sustained an apparent injury to his right leg and required assistance to leave the ice. The team is currently awaiting further updates on his condition.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: sustain",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Announces 100% Tariffs on Pharmaceuticals, Other Goods",
    "domain": "business",
    "source_domain": "www.ft.com",
    "location": "global",
    "published": "Thu, 25 Sep 2025 23:38:24 GMT",
    "source": "Financial Times",
    "sources": [
      "MarketWatch",
      "Financial Times"
    ],
    "domains": [
      "www.ft.com",
      "www.marketwatch.com"
    ],
    "snippets": [
      "The US president also unveiled levies on heavy trucks, kitchen cabinets and bathroom vanities",
      "President Donald Trump announced a raft of new tariffs late Thursday, including a 100% levy on imported pharmaceuticals unless their manufacturers are actively building factories in the U.S."
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Fe7b1e8dd-74e6-40f5-b667-3a8638d09e10.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Trump announces 100% tariff on pharmaceutical products",
      "Trump announces 100% tariffs on pharmaceuticals unless drug makers are building U.S. factories"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.968,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.663,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "President Donald Trump announced new tariffs, including a 100% levy on imported pharmaceuticals unless their manufacturers build factories in the U.S. The announcement, made late Thursday, also includes tariffs on heavy trucks, kitchen cabinets, and bathroom vanities.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Spain, Italy Send Navy Ships to Aid Gaza Flotilla Amid Israeli Drone Reports",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Thu, 25 Sep 2025 17:59:34 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Deutsche Welle",
      "Al Jazeera"
    ],
    "domains": [
      "www.dw.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Spanish, Italian decisions to send ships to assist Gaza flotilla sign of increased pro-Palestinian sentiment in Europe.",
      "Spain is joining Italy in sending a navy ship to help an aid flotilla bound for Gaza, after activists said they were targeted by Israeli drones. Israel accuses them of being complicit with Hamas. DW has more."
    ],
    "image_url": "",
    "titles": [
      "Why have Spain and Italy sent ships to assist the Gaza Sumud flotilla?",
      "Middle East updates: Spain sends navy ship to Gaza flotilla"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.878,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.655,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Spain and Italy are dispatching navy ships to support an aid flotilla heading to Gaza, following reports of the flotilla being targeted by Israeli drones. This move indicates a growing pro-Palestinian sentiment in Europe. Israel has accused the activists involved with the flotilla of complicity with Hamas, as reported by DW.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "SportsLine Experts Pick NFL Week 4 and College Football Week 5 Games",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Thu, 25 Sep 2025 23:30:25 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Yahoo Sports"
    ],
    "domains": [
      "www.battleredblog.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "The SportsLine projection model has revealed its Arizona vs. Seattle picks for the 2025 NFL Week 4 'Thursday Night Football' game",
      "Jimmie Kaylor shares his top NFL DFS picks, daily fantasy optimal lineups, and NFL DFS stacks for Cardinals vs. Seahawks on 'Thursday Night Football'",
      "SportsLine expert Mike Tierney has revealed his Army vs. ECU picks in the Week 5 Thursday matchup",
      "The SportsLine Projection Model has revealed its Army vs. East Carolina picks on Thursday in an American Conference matchup",
      "SportsLine expert Josh Nagel has revealed his Arizona vs. Seattle picks for 'Thursday Night Football'",
      "They say if it’s on, it’s on, but is it really on?"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/08/13/07950282-4b51-4f71-84b2-6877e46c2081/marvin-harrison-jr.jpg",
    "titles": [
      "Cardinals vs. Seahawks prediction, odds, time: 2025 NFL Week 4 Thursday Night Football picks by top model",
      "NFL DFS picks, Thursday Night Football: Seahawks vs. Cardinals daily fantasy strategy for DraftKings, FanDuel",
      "East Carolina vs. Army prediction, odds: 2025 Week 5 college football Thursday picks by expert on 5-0 roll",
      "Army vs. East Carolina prediction, odds, line, start time: 2025 college football Week 5 picks by proven model",
      "Thursday Night Football prediction, odds, line: Seahawks vs. Cardinals picks from NFL expert on a 25-10 run",
      "Thursday Night Football Open Thread – Seattle Seahawks at Arizona Cardinals"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.985,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.652,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "SportsLine's projection model and experts have made their picks for the NFL Week 4 'Thursday Night Football' game between Arizona and Seattle, as well as the Week 5 college football matchup between Army and East Carolina. Jimmie Kaylor provided DFS advice for the Cardinals vs. Seahawks game. Mike Tierney and Josh Nagel have shared their selections for both NFL and college games, indicating a comprehensive analysis has been conducted for these matchups.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Former NFL MVP Shaun Alexander Expecting 12th Child",
    "domain": "sports",
    "source_domain": "sports.yahoo.com",
    "location": "national",
    "published": "Thu, 25 Sep 2025 23:26:58 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports",
      "Sports Illustrated"
    ],
    "domains": [
      "sports.yahoo.com",
      "news.google.com"
    ],
    "snippets": [
      "Shaun Alexander is still posting big numbers after his Seahawks career.",
      "<a href=\"https://news.google.com/rss/articles/CBMifkFVX3lxTE9ucndyZERsMUJNSFJmUG9sdGV2M0xfY1dkaWM2eG1KNTd3OGVEdnBSY1JKYTZ3RGJFcG1KeUZwUUM1UGxEdGl5WWl0X3J4c2w2eEp4M2trUzdWdFhfd1dRT3YxclNTQlp1V0t3T3YwcXVvZE1hLVVpUlB5YkJBUQ?oc=5\" target=\"_blank\">Former NFL MVP Announces He and His Wife Are Having Their",
      "<a href=\"https://news.google.com/rss/articles/CBMimgFBVV95cUxNOVV5Ul9xMjR3amtXd0VnUF9hRWlDNnJVelZYbXBYT3ZfOTFDM0FkTWxLWTZDUzVqMmdzUk5xTjhtc2FHZmxFMnV0QkwwX0JKOVJXejFHQzYyNnBKdE1HRWxpMjZsM3ZVNFBDRFc5YWpaUDdySzRxYjl0S1lheEoybWVxbEdqVG9Ya3VPN2lVckFVbEFKNlQxcm93?oc=5\" target=\"_blank\">Former Braves Coach"
    ],
    "image_url": "",
    "titles": [
      "Former MVP Shaun Alexander reveals his wife is expecting their 14th child",
      "Former NFL MVP Announces He and His Wife Are Having Their 14th Child - Sports Illustrated",
      "Former Braves Coach Creating MVP Caliber Bats in Seattle - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.984,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.652,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Shaun Alexander, former NFL MVP and Seahawks player, has announced that he and his wife are expecting their 12th child. The news highlights Alexander's life after his professional football career, focusing on his growing family.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "SportsLine's Eric Cohen Releases NFL Week 4 Score Predictions",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Thu, 25 Sep 2025 22:34:24 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Bleacher Report"
    ],
    "domains": [
      "news.google.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "SportsLine expert Eric Cohen reveals his score predictions for every game on the Week 4 of the NFL schedule",
      "<a href=\"https://news.google.com/rss/articles/CBMifkFVX3lxTFB0VU1IV0diMVpReGM5QmZtMGEyb0ZFQkhtTm9nbU5HS19ZRVRHUmEzS3M5MDVJOWl0RUdXM1U0TTZ3d2hhU2JsMXcta1ZRaGJDQTBHWk8wWkpHRENuR1FpdDRaZF9PNVhDRkdoYjJyQURBcGFRT3A3THZnVWlHdw?oc=5\" target=\"_blank\">2025 NFL Week 4 Expert Picks</a>&nbsp;&nbsp;<font color=\""
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/04/7076f29a-1478-47bf-af95-2a6bc8ce3130/devonta-smith-vs-cowboys-cbs-imagn.jpg",
    "titles": [
      "2025 Week 4 NFL score predictions, bets, odds, top picks today: Expert unveils exact scores for all 16 games",
      "2025 NFL Week 4 Expert Picks - Bleacher Report"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.966,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.648,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "SportsLine expert Eric Cohen has released his score predictions for every game of Week 4 in the NFL schedule. The predictions are available for viewers interested in Cohen's insights on the upcoming matchups.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Suggests Lifting Sanctions, F-35 Sale to Turkey for Halting Russian Oil Bu",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 25 Sep 2025 18:59:49 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Deutsche Welle"
    ],
    "domains": [
      "www.bbc.com",
      "www.dw.com"
    ],
    "snippets": [
      "The US president suggests the US could lift sanctions on Turkey and allow it to buy F-35 jets.",
      "Donald Trump told President Erdogan he might let Turkey buy US fighter jets if Ankara halts Russian oil purchases over the war in Ukraine."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/9401/live/cda7cb50-9a37-11f0-928c-71dbb8619e94.jpg",
    "titles": [
      "Trump urges Turkey to stop buying Russian oil as Erdogan chases deal on F-35s",
      "Trump urges Turkey's Erdogan to stop buying Russian oil"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.878,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.638,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "US President Donald Trump indicated the possibility of lifting sanctions on Turkey and permitting the purchase of F-35 jets if Ankara ceases buying Russian oil, amid the conflict in Ukraine.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Tesla Appeals to EPA Amidst Musk's Controversial $300M Actions",
    "domain": "technology",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Thu, 25 Sep 2025 17:43:19 GMT",
    "source": "Axios",
    "sources": [
      "TechCrunch",
      "Axios"
    ],
    "domains": [
      "techcrunch.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMiZ0FVX3lxTFBKSVU5MmZrS1BEZGRNSVRpaENOZGZkN2RZaldLQ2NrVnFhZmdGdnRtNWc2RXAzeHRuNXlUSnoydzRZWHNwNWtsZTNqaXZpNWtPZnFYNXZmOHA4R192OVdmSnp1dEFJY28?oc=5\" target=\"_blank\">Tesla urges EPA not to smash foundation for climate rules</a>&nbsp;&nbsp;<font color=\"#6",
      "The company's regulatory policy team is trying to clean up a mess that CEO Elon Musk spent $300 million to help create."
    ],
    "image_url": "",
    "titles": [
      "Tesla urges EPA not to smash foundation for climate rules - Axios",
      "Tesla asks EPA not to roll back emissions rules as Trump calls climate change a ‘con job’"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.855,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.626,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Tesla has urged the EPA not to dismantle the foundation for climate regulations, addressing a situation complicated by CEO Elon Musk's actions, which involved a $300 million expenditure. The company's regulatory policy team is actively working to mitigate the fallout from Musk's decisions.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Cybercriminals Hack Kido Nursery, Demand Ransom for Data on 8,000 Children",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 25 Sep 2025 17:00:38 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "www.bbc.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Experts have condemned the hack as an \"absolute new low\" for cyber-crime.",
      "<p>Firm, which has 18 sites around London and more in US, India and China, has received ransom demand, say reports</p><p>The names, pictures and addresses of about 8,000 children have reportedly been stolen from the Kido nursery chain by a gang of cybercriminals.</p><p>The criminals have demanded a "
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/95a8/live/472be100-9a29-11f0-97f5-bd38218a3641.jpg",
    "titles": [
      "Names, pictures and addresses of 8,000 children stolen in nursery chain hack",
      "Hackers reportedly steal pictures of 8,000 children from Kido nursery chain"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.843,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.624,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Cybercriminals targeted the Kido nursery chain, stealing names, pictures, and addresses of approximately 8,000 children from its databases across 18 London sites and additional locations in the US, India, and China. Experts have labeled this incident as an \"absolute new low\" in cyber-crime. The hackers have issued a ransom demand to the firm, according to reports.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]