[
  {
    "title": "Usyk Knocks Out Dubois to Become Undisputed Heavyweight Champion Again",
    "domain": "sports",
    "location": "global",
    "published": "Sat, 19 Jul 2025 21:45:18 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Sportsnet",
      "ESPN",
      "The Guardian",
      "Yahoo Sports"
    ],
    "domains": [
      "general",
      "sports"
    ],
    "snippets": [
      "Oleksandr Usyk further cements his place as a boxing great by stopping Daniel Dubois in round five to become a two-time undisputed heavyweight champion.",
      "Oleksandr Usyk ruthlessly knocked out Daniel Dubois in Round 5 to become undisputed world heavyweight champion once again on Saturday.",
      "Oleksandr Usyk cemented his status as the outstanding heavyweight of his generation with an emphatic fifth-round knockout of Daniel Dubois in their undisputed world title bout at London's Wembley Stadium on Saturday.Usyk, now a two-time undisputed champion, dominated the opening four rounds.",
      "<ul><li><p>Ukrainian adds IBF belt to WBA, WBC and WBO titles</p></li><li><p>Dubois suffers second defeat to Usyk in two years</p></li></ul><p>The mighty Oleksandr Usyk is, yet again, the undisputed heavyweight champion of the world as he decisively defeated Daniel Dubois in the fifth round after a ",
      "<p>Oleksandr Usyk knocked out Daniel Dubois in the fifth round and became the undisputed world heavyweight champion for a second time on Saturday.</p>"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/668e/live/bc889d40-64ea-11f0-a989-55a21fab730d.jpg",
    "titles": [
      "Usyk destroys Dubois to reclaim undisputed crown",
      "Usyk KO's Dubois to become undisputed champion",
      "Usyk knocks out Dubois to become undisputed world heavyweight champion",
      "Usyk defeats Dubois to become undisputed heavyweight champion once more",
      "Usyk KOs Dubois to become undisputed world heavyweight champion for a second time"
    ],
    "score_components": {
      "magnitude": 0.82,
      "recency": 0.951,
      "consensus": 1.0,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.827,
    "summary": "Oleksandr Usyk defeated Daniel Dubois with a fifth-round knockout at London's Wembley Stadium, becoming the undisputed heavyweight champion for the second time. Usyk, who dominated the fight from the start, now holds the IBF, WBA, WBC, and WBO titles, reinforcing his status as a leading figure in heavyweight boxing. This victory marks Dubois' second defeat to Usyk in two years.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides some insight into the world of heavyweight boxing, reporting on the outcome of a significant match. However, it doesn't offer actionable insights or a deeper understanding of the sport or the athletes involved. It doesn't report on solutions, improvements, or innovations, and doesn't increase clarity around systems, causes, trends, or impacts that matter."
  },
  {
    "title": "Astronomer Inc. CEO Resigns After Viral Video Incident",
    "domain": "general",
    "location": "global",
    "published": "Sat, 19 Jul 2025 20:06:05 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "CityNews",
      "TechCrunch",
      "Business Insider",
      "Financial Post"
    ],
    "domains": [
      "general",
      "technology",
      "business"
    ],
    "snippets": [
      "The company said its leader had not met the expected standard of conduct and accountability.",
      "Astronomer CEO Andy Byron has resigned after a viral video appeared to show him embracing a colleague at a Coldplay show.",
      "The IT company CEO captured in a widely circulated video showing him embracing an employee at a Coldplay concert has resigned. Andy Byron resigned from his job as CEO of Cincinnati-based Astronomer Inc., according to a statement posted on LinkedIn by the company Saturday. &#8220;Astronomer is commit",
      "Andy Byron, the startup executive at the center of an extraordinary social media furor, has resigned as CEO of data operations startup Astronomer.",
      "The IT company CEO captured in a widely circulated video showing him embracing an employee at a Coldplay concert has resigned. Andy Byron resigned from his job as CEO of Cincinnati-based Astronomer Inc., according to a statement posted on LinkedIn by the company Saturday. “Astronomer is committed to"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/54eb/live/d578c260-64d8-11f0-89ea-4d6f9851f623.jpg",
    "titles": [
      "US tech CEO resigns after Coldplay concert embrace goes viral",
      "Astronomer CEO resigns after viral 'kiss cam' incident at Coldplay concert",
      "Tech company CEO resigns after controversy over video captured at Coldplay concert",
      "Astronomer CEO resigns following Coldplay concert scandal",
      "Tech company CEO resigns after controversy over video captured at Coldplay concert"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.919,
      "consensus": 1.0,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.824,
    "summary": "Andy Byron resigned as CEO of Cincinnati-based Astronomer Inc. following a viral video showing him embracing an employee at a Coldplay concert. The company stated his actions did not meet their expected standard of conduct and accountability, emphasizing their commitment to maintaining a professional environment.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story informs readers about the resignation of a CEO due to inappropriate behavior, emphasizing the company's commitment to professionalism. However, it does not provide solutions or improvements, nor does it offer a deeper understanding of the issue."
  },
  {
    "title": "34 Dead as Tourist Boat Capsizes in Vietnam's Ha Long Bay",
    "domain": "general",
    "location": "national",
    "published": "Sat, 19 Jul 2025 13:58:42 -0400",
    "source": "NPR",
    "sources": [
      "BBC",
      "CityNews",
      "Global News",
      "New York Times",
      "The Guardian",
      "Deutsche Welle",
      "Al Jazeera",
      "NPR"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "A boat carrying tourists capsized during a sudden thunderstorm in Vietnam on Saturday afternoon during a sightseeing excursion, killing 34 people.",
      "The incident happened in Vietnam's busy Ha Long Bay during bad weather, and at least 14 people are missing, local reports say.",
      "The boat carrying 53 people tipped over as Storm Wipha approached the country across the South China Sea.",
      "A sudden storm in northern Vietnam’s famous Ha Long Bay tipped the vessel. Children were among the victims.",
      "<p>Rescue workers save 12 people with seven still missing after vessel overturns during sudden thunderstorm</p><p>A tourist boat capsized during a sudden thunderstorm in Vietnam on Saturday afternoon, killing 34 people and leaving seven others missing.</p><p>The Wonder Sea boat was carrying 48 passe",
      "The boat, carrying 48 passengers and five crew members, was on a sightseeing tour of Ha Long Bay when a sudden storm caused it to overturn, state media said. At least 10 people were rescued.",
      "The Wonder Sea boat was carrying 48 passengers and five crew members during the tour of Ha Long Bay, a popular destination for visitors, according to the reports.",
      "HA LONG BAY, Vietnam (AP) — A boat carrying tourists capsized during a sudden thunderstorm in Vietnam on Saturday afternoon during a sightseeing excursion, killing 34 people, state media reported. Eight others remain missing. The Wonder Sea boat was carrying 48 passengers and five crew members — all"
    ],
    "image_url": "",
    "titles": [
      "Tourist boat capsizes during a thunderstorm in Vietnam, leaving 34 dead",
      "At least 34 dead after tourist boat capsizes in Vietnam",
      "Dozens dead after tourist boat capsizes in Vietnam’s Halong Bay",
      "Vietnam: Tourist boat capsizes, killing dozens",
      "At least 34 dead after tourist boat capsizes in Ha Long Bay in Vietnam",
      "At Least 28 Dead After Tourist Boat Capsizes in Vietnam’s Ha Long Bay",
      "18 dead, 23 missing as tourist boat capsizes during Vietnam thunderstorm",
      "Tourist boat capsizes during a thunderstorm in Vietnam, leaving 34 dead. 8 people remain missing"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.879,
      "consensus": 1.0,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.811,
    "summary": "A tourist boat, the Wonder Sea, capsized during a sudden thunderstorm in Ha Long Bay, Vietnam, on Saturday, resulting in the deaths of 34 people. The boat was carrying 53 individuals—48 passengers and five crew members—on a sightseeing tour. Rescue operations saved 12 people, but seven remain missing. The incident occurred as Storm Wipha approached, causing severe weather in the area. Children were among the victims of this tragedy.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "The story provides basic awareness about a tragic event, but it lacks depth, insight, or actionable insights for the reader. It does not report on any solutions or improvements, nor does it increase clarity around systems, causes, trends, or impacts."
  },
  {
    "title": "SportsLine Analysts Share Picks for UFC 318 in New Orleans",
    "domain": "sports",
    "location": "national",
    "published": "Sat, 19 Jul 2025 23:48:22 +0000",
    "source": "CBS Sports",
    "sources": [
      "Forbes",
      "Sportsnet",
      "CBS Sports"
    ],
    "domains": [
      "business",
      "sports"
    ],
    "snippets": [
      "SportsLine's Kyle Marley reveals his picks for the UFC 318: Holloway vs. Poirier 3 fight card from the Smoothie King Center in New Orleans on Saturday",
      "SportsLine's Daniel Vithlani reveals his picks for the UFC 318 fight card from Smoothie King Center in New Orleans on Saturday",
      "UFC 318 Results: Everything to know about tonight's Max Holloway vs. Dustin Poirier 3 fight card - full fight card results, winners, losers, bonuses, scorecards, and more",
      "<p>Fight Card: Kyler Phillips vs Vinicius Oliveira | Marvin Vettori vs Brendan Allen | Francisco Prado vs Nikolay Veretennikov | Ateba Gautier vs Robert Valentin</p>",
      "<p>Max Holloway defends the lightweight belt against Dustin Poirier. Keep it here for the official results from UFC 318.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/07/19/4d47f9fa-b176-49cd-8b24-31f0869838ba/dustin-poirier-max-holloway-ufc-getty-images.jpg",
    "titles": [
      "UFC 318 odds, lines, New Orleans predictions, time: Holloway vs. Poirier 3 picks from expert who's up $21,000",
      "UFC 318 odds, props, predictions, fight card: Holloway vs. Poirier 3 picks from proven MMA expert",
      "UFC 318 Results: Winners And Losers Holloway Vs. Poirier 3 Fight Card",
      "UFC 318 on Sportsnet: Holloway vs. Poirier 3 Prelims",
      "UFC 318: Holloway vs. Poirier 3 official results"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.993,
      "consensus": 0.897,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.778,
    "summary": "SportsLine analysts Kyle Marley and Daniel Vithlani shared their picks for UFC 318, held at the Smoothie King Center in New Orleans. The event featured key fights, including Max Holloway defending the lightweight belt against Dustin Poirier. The fight card also included matches between Kyler Phillips and Vinicius Oliveira, Marvin Vettori and Brendan Allen, Francisco Prado and Nikolay Veretennikov, and Ateba Gautier and Robert Valentin. The summary provided outcomes, including winners, losers, bonuses, and scorecards from the event.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information for readers interested in UFC, including expert predictions and a detailed summary of outcomes. However, it doesn't necessarily provide deeper insights into the sport or its systems, nor does it highlight any progress or solutions."
  },
  {
    "title": "Zelenskyy Seeks Swift Peace Talks with Putin After Recent Attacks",
    "domain": "general",
    "location": "global",
    "published": "Sat, 19 Jul 2025 19:41:14 +0000",
    "source": "Al Jazeera",
    "sources": [
      "The Guardian",
      "Al Jazeera",
      "Deutsche Welle"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "Ukrainian leader also reiterates readiness for face-to-face meeting with Russia’s Vladimir Putin.",
      "The Ukrainian president said that \"the momentum of the negotiations must be stepped up.\" Earlier, Russia launched 300 drones and 30 missiles overnight, killing one. DW has the latest.",
      "<p>Volodymyr Zelenskyy reiterates willingness to meet the Russian president Vladimir Putin face to face</p><p>Kyiv has proposed to Moscow a new round of peace talks next week, Ukraine’s president Volodymyr Zelenskyy said on Saturday, after negotiations stalled in early June.</p><p>Two rounds of talk"
    ],
    "image_url": "",
    "titles": [
      "Zelenskyy says Ukraine sent Russia offer of new peace talks",
      "Ukraine sent talks proposal to Russia, Zelenskyy says",
      "Ukraine proposes new round of peace talks with Russia next week"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.911,
      "consensus": 0.847,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.769,
    "summary": "Ukrainian President Volodymyr Zelenskyy has expressed a willingness to accelerate negotiations with Russia and reiterated his readiness for a face-to-face meeting with Russian President Vladimir Putin. Following a recent attack where Russia launched 300 drones and 30 missiles, resulting in one casualty, Zelenskyy proposed a new round of peace talks with Moscow next week. This comes after previous negotiations stalled in early June.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it provides useful information about the current geopolitical situation between Ukraine and Russia. It increases awareness about the ongoing conflict and the attempts to resolve it, which is important for understanding international relations and decision-making at the global level."
  },
  {
    "title": "Ottawa Man, 20, Charged with First-Degree Murder in Year's First Homicide",
    "domain": "general",
    "location": "local",
    "published": "Sat, 19 Jul 2025 14:23:10 EDT",
    "source": "CBC",
    "sources": [
      "CityNews",
      "CBC",
      "Ottawa Citizen"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "<img alt=\"A suburban house at night with a white car halfway pulled out of the driveway with police tape surrounding it.\" height=\"349\" src=\"https://i.cbc.ca/1.7429037.1736603714!/fileImage/httpImage/image.jpeg_gen/derivatives/16x9_620/pondhollow-way-homicide-barrhaven-ottawa-police-service.jpeg\" tit",
      "Michael Journal Prest, 20, of Ottawa, is the third person charged in the shooting death of Wilson Sabarros, 58.",
      "A third person has been charged with first degree murder in Ottawa&#8217;s first homicide of the year. Michael Journal Prest, 20, has been charged following a shooting that left one man dead. Wilson Sabarros, 58, was found dead by police on Pondhollow Way in Nepean on the evening of Jan. 10. Mia Tej"
    ],
    "image_url": "",
    "titles": [
      "3rd person charged with murder in Barrhaven killing",
      "Third person charged with murder in Barrhaven shooting death",
      "Third person charged in first degree murder case"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.887,
      "consensus": 0.847,
      "constructiveness": 0.3,
      "proximity": 1.0
    },
    "score": 0.764,
    "summary": "Michael Journal Prest, 20, from Ottawa, has been charged with first-degree murder in connection with the city's first homicide of the year. The incident, which resulted in the death of 58-year-old Wilson Sabarros, occurred on Pondhollow Way in Nepean on January 10. Prest is the third individual to be charged in this case.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness of a criminal case. However, it lacks depth, insight, or actionable insights for the reader. It does not report on any solutions or improvements, nor does it increase clarity around systems, causes, trends, or impacts."
  },
  {
    "title": "Astronomer CEO Resigns After Incident at Coldplay Concert",
    "domain": "general",
    "location": "national",
    "published": "Sat, 19 Jul 2025 19:37:01 GMT",
    "source": "Axios",
    "sources": [
      "Global News",
      "Axios",
      "CNBC"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMiiwFBVV95cUxONmgyQ2h2bnBUVWt3SWNpcVpRU3E1WW4yNDlKaDVxSzZqNjNJcWVaRmFvTnRLdXNJbUs4R0t5czZ2MDlaTVd0YWMyTW85emZROGthV09PUXU3YU1ZOGxwSk5GMVZXNkYyTi00N2JLcWlQM3RvMEhfOW1hck1GdmxPTEJGRjkxWWY0V1FV?oc=5\" target=\"_blank\">Astronomer CEO Andy Byron resigns follo",
      "Byron's resignation comes a day after the company said it had placed the CEO on leave.",
      "Astronomer said CEO Andy Byron has been placed on leave after he was caught on video with the company's HR chief at a Coldplay concert.",
      "The company posted a statement on its social media channels on Saturday, saying its chief executive, Andy Byron, had tendered his resignation."
    ],
    "image_url": "",
    "titles": [
      "Astronomer CEO Andy Byron resigns following Coldplay concert scandal - Axios",
      "Astronomer CEO Andy Byron resigns after viral Coldplay 'kiss cam' controversy",
      "Astronomer CEO Andy Byron placed on leave after viral Coldplay kiss cam video",
      "Astronomer CEO Andy Byron resigns after Coldplay ‘kiss cam’ video"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.91,
      "consensus": 0.897,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.731,
    "summary": "Astronomer CEO Andy Byron resigned following an incident where he was caught on video at a Coldplay concert with the company's HR chief, leading to his placement on leave. The company announced his resignation the day after stating he had been put on leave, confirming the departure through a statement on social media.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "While this story provides basic awareness of a recent event, it lacks depth and insight. It does not provide actionable insights or deeper understanding, nor does it report on solutions, improvements, or innovations. It also does not increase clarity around systems, causes, trends, or impacts that matter."
  },
  {
    "title": "Colton Herta Wins Pole Position for Indy Toronto Race",
    "domain": "general",
    "location": "national",
    "published": "Sat, 19 Jul 2025 22:36:04 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "Sportsnet"
    ],
    "domains": [
      "general",
      "sports"
    ],
    "snippets": [
      "There will be a couple of familiar faces in the grid's front row when the green flag drops at the Ontario Honda Dealers Indy Toronto on Sunday.",
      "<p>Defending champion Colton Herta has earned pole position at the Ontario Honda Dealers Indy Toronto.</p>"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/07/CP215084696.jpg?quality=65&strip=all",
    "titles": [
      "Reigning champion Colton Herta takes pole at Ontario Honda Dealers Indy Toronto",
      "Defending champion Colton Herta grabs pole position at Indy Toronto"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.968,
      "consensus": 0.682,
      "constructiveness": 0.5,
      "proximity": 1.0
    },
    "score": 0.724,
    "summary": "Defending champion Colton Herta has secured pole position for the Ontario Honda Dealers Indy Toronto race. The grid's front row will feature familiar faces when the event kicks off on Sunday.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness about a sporting event, but it does not provide much depth or insight beyond the fact that a particular racer has secured pole position. It does not offer actionable insights, report on solutions or improvements, or increase clarity around systems, trends, or impacts."
  },
  {
    "title": "Heineman's Homer Lifts Blue Jays to 6-3 Victory Over Giants",
    "domain": "general",
    "location": "national",
    "published": "Sat, 19 Jul 2025 21:39:37 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "Sportsnet"
    ],
    "domains": [
      "general",
      "sports"
    ],
    "snippets": [
      "Tyler Heineman hit a two-run home run in the eighth inning and starter Eric Lauer gave up two runs over six to lead the Toronto Blue Jays to a 6-3 victory over the San Francisco Giants on Saturday.",
      "<p>Watch as Toronto Blue Jays catcher Tyler Heineman launches a two-run home run to extend his team&#8217;s lead in the eighth inning against the San Francisco Giants.</p>"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/07/f4d545093e204344f2204474e84ef83ecf7c5669920db080bb548fcd8d3eec5a.jpg?quality=65&strip=all",
    "titles": [
      "Heineman two-run homer spurs Blue Jays to win",
      "Blue Jays’ Heineman blasts two-run shot for third homer of the season"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.95,
      "consensus": 0.682,
      "constructiveness": 0.3,
      "proximity": 1.0
    },
    "score": 0.701,
    "summary": "Tyler Heineman hit a two-run homer in the eighth inning, boosting the Toronto Blue Jays to a 6-3 win over the San Francisco Giants. Starter Eric Lauer helped secure the victory by allowing only two runs over six innings. This performance was pivotal in extending the Blue Jays' lead late in the game.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about a recent baseball game, but doesn't offer deeper insight or understanding about the sport, the teams, or the players. It doesn't report on solutions, improvements, or innovations, and doesn't increase clarity around systems, causes, trends, or impacts that matter."
  },
  {
    "title": "Marcus Smart Set to Join Lakers on $11M Deal After Wizards Buyout",
    "domain": "sports",
    "location": "national",
    "published": "Sat, 19 Jul 2025 18:17:50 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Marcus Smart has agreed to a contract buyout with the Wizards and plans to sign a two-year, $11 million deal with the Lakers after clearing waivers, sources told ESPN.",
      "Smart aims to bolster the Lakerrs' backcourt and playoff hopes"
    ],
    "image_url": "",
    "titles": [
      "Sources: Smart agrees to buyout; to join Lakers",
      "Marcus Smart agrees to contract buyout with Wizards, join Lakers on two-year deal, per report"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.962,
      "consensus": 0.632,
      "constructiveness": 0.6,
      "proximity": 0.75
    },
    "score": 0.695,
    "summary": "Marcus Smart has reached a contract buyout agreement with the Washington Wizards and is set to join the Los Angeles Lakers on a two-year, $11 million contract after clearing waivers, according to ESPN sources. Smart's move is aimed at strengthening the Lakers' backcourt and enhancing their chances in the playoffs.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs readers about a significant development in the NBA, providing useful information about player movements and team strategies. However, it doesn't provide deeper insights into the workings of the sport or its systems, nor does it highlight any progress or solutions."
  },
  {
    "title": "Vehicle Hits Crowd in East Hollywood, 5 Critically Injured",
    "domain": "general",
    "location": "global",
    "published": "Sat, 19 Jul 2025 10:54:41 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Global News",
      "The Guardian",
      "Al Jazeera"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "The car was driven into a crowd of people in East Hollywood in the early hours of Saturday.",
      "<p>City’s fire department says car hit line of people waiting outside a nightclub, with at least five in critical condition</p><p>A vehicle drove into a busy crowd of people waiting to get into a nightclub in <a href=\"https://www.theguardian.com/us-news/los-angeles\">Los Angeles</a> early Saturday, i",
      "At least three were in critical condition after being injured along Santa Monica Boulevard in East Hollywood, the Fire Department said in a statement."
    ],
    "image_url": "",
    "titles": [
      "Vehicle driven into crowd in Los Angeles, injuring at least 30",
      "Vehicle drives into Los Angeles crowd injuring 30 people",
      "Car rams into Los Angeles nightclub crowd, injuring 30"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.759,
      "consensus": 0.847,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.689,
    "summary": "A vehicle struck a crowd outside a nightclub in East Hollywood, Los Angeles, early Saturday, injuring several people. The city's fire department reported that at least five individuals were in critical condition after the incident along Santa Monica Boulevard.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "The story provides basic awareness about an unfortunate incident but lacks depth and insight. It doesn't provide any actionable insights or deeper understanding for the reader. It doesn't report on any solutions or attempts to prevent such incidents in the future."
  },
  {
    "title": "Trump Administration Limits Flights to Mexico, Affecting 40M Passengers",
    "domain": "business",
    "location": "global",
    "published": "Sat, 19 Jul 2025 22:30:44 +0000",
    "source": "Fortune",
    "sources": [
      "Financial Post",
      "Fortune"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Mexico is the top foreign destination for Americans with more than 40 million passengers flying there last year.",
      "The Trump administration imposed new restrictions Saturday on flights from Mexico and threatened to end a longstanding partnership between Delta Air Lines and Aeromexico in response to limits the Mexican government placed on passenger and cargo flights into Mexico City several years ago. Transportat"
    ],
    "image_url": "https://fortune.com/img-assets/wp-content/uploads/2025/07/AP25197584536489-e1752963717262.jpg?w=2048",
    "titles": [
      "Delta-Aeromexico alliance in jeopardy as Trump administration imposes limits on Mexican flights",
      "Trump administration imposes limits on Mexican flights and threatens Delta alliance in trade dispute"
    ],
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.967,
      "consensus": 0.632,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.688,
    "summary": "The Trump administration has imposed new restrictions on flights from Mexico, affecting over 40 million passengers who flew there last year. These measures come in response to Mexico's previous limitations on flights into Mexico City. Additionally, the administration threatened to terminate the partnership between Delta Air Lines and Aeromexico. This development follows Mexico being the top foreign destination for American travelers.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story informs readers about a significant policy change and its potential impacts on travelers. It provides useful context about the relationship between the US and Mexico, and the implications of these flight restrictions. However, it does not highlight any solutions or progress."
  },
  {
    "title": "Spain and Germany Advance to Women's Euro Semifinals",
    "domain": "sports",
    "location": "national",
    "published": "Sat, 19 Jul 2025 16:50:50 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Spain overcame missing two penalties to beat hosts Switzerland 2-0 on Friday to reach the Women's Euro semifinals for just the second time.",
      "<p>Germany overcame France on penalties and reached the semifinals of the Women’s European Championship despite playing almost the entire match — and extra time — with 10 players.</p>"
    ],
    "image_url": "",
    "titles": [
      "Spain reach semifinals despite missing 2 penalties",
      "Germany beats France on penalties to reach Euro 2025 semifinals despite early red card"
    ],
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.934,
      "consensus": 0.632,
      "constructiveness": 0.5,
      "proximity": 0.75
    },
    "score": 0.687,
    "summary": "Spain defeated Switzerland 2-0, advancing to the Women's Euro semifinals despite missing two penalties. This marks Spain's second time reaching the semifinals. Meanwhile, Germany beat France in a penalty shootout to also reach the semifinals, despite playing with 10 players for nearly the entire game, including extra time.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story offers basic awareness of the Women's Euro tournament results, but it doesn't provide any deeper understanding or actionable insights. It does not report on any solutions, improvements, or innovations, nor does it increase clarity around systems, causes, trends, or impacts."
  },
  {
    "title": "Mets Induct David Wright into Hall of Fame, Retire No. 5 Jersey",
    "domain": "sports",
    "location": "national",
    "published": "Sat, 19 Jul 2025 18:17:50 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "The New York Mets inducted David Wright into their hall of fame and retired his No. 5 on Saturday, nearly 21 years after his big league debut.",
      "Wright is the 35th member of the Mets’ Hall of Fame and the 11th individual to have his number retired."
    ],
    "image_url": "",
    "titles": [
      "Mets induct Wright into team HOF, retire No. 5",
      "Mets induct David Wright into team Hall of Fame, retire No. 5"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.962,
      "consensus": 0.632,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.665,
    "summary": "The New York Mets celebrated David Wright by inducting him into their Hall of Fame and retiring his No. 5 jersey on Saturday, almost 21 years following his major league debut. Wright becomes the 35th member of the Mets' Hall of Fame and the 11th person to have his number retired by the team.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers basic awareness about a significant event in the baseball world, specifically for New York Mets fans. However, it doesn't provide deeper insights or understanding, nor does it report on solutions or improvements."
  },
  {
    "title": "Phillies' Alec Bohm on 10-Day IL with Fractured Rib",
    "domain": "sports",
    "location": "national",
    "published": "Sat, 19 Jul 2025 23:30:50 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Sportsnet",
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Bohm is hitting .278 with eight home runs and 42 RBIs in 92 games this season.",
      "<p>Philadelphia Phillies third baseman Alec Bohm has a fractured left rib and was placed on the 10-day injured list Saturday.</p>"
    ],
    "image_url": "",
    "titles": [
      "Phillies third baseman Alec Bohm has fractured left rib, placed on 10-day injured list",
      "Phillies place third baseman Alec Bohm on 10-day IL with fractured rib"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.987,
      "consensus": 0.632,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.645,
    "summary": "Philadelphia Phillies third baseman Alec Bohm, hitting .278 with 8 home runs and 42 RBIs in 92 games, has a fractured left rib. As a result, he has been put on the 10-day injured list.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This news story provides basic awareness about a player's injury and the immediate action taken, but it doesn't provide any deeper insights or understanding about the situation. It doesn't report on potential solutions or improvements, nor does it increase clarity around systems, causes, or impacts."
  },
  {
    "title": "OpenAI's AI Excels in 2025 International Math Olympiad Challenges",
    "domain": "business",
    "location": "global",
    "published": "2025-07-19T22:25:29Z",
    "source": "Business Insider",
    "sources": [
      "Business Insider"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "An experimental LLM from OpenAI solved some of the world's hardest math problems at the 2025 International Math Olympiad, the company said."
    ],
    "image_url": "https://i.insider.com/687c02f7f748d8c055f5ed5f?format=jpeg",
    "titles": [
      "OpenAI just won gold at the world's most prestigious math competition. Here's why that's a big deal."
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.965,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.452,
    "summary": "OpenAI's experimental LLM successfully tackled challenging math problems at the 2025 International Math Olympiad. The company reported that the AI made significant progress in solving complex mathematical tasks during the competition.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "The story clearly highlights progress in AI technology, with OpenAI's AI successfully tackling challenging math problems. This provides empowering knowledge about the capabilities of AI and its potential applications."
  },
  {
    "title": "New Activities Linked to Increased Joy and Well-Being, Experts Say",
    "domain": "science",
    "location": "global",
    "published": "Sat, 19 Jul 2025 23:13:46 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/experts-reveal-a-simple-way-to-boost-joy-excitement-and-well-being/\" rel=\"nofollow\" title=\"Experts Reveal a Simple Way To Boost Joy, Excitement, and Well-Being\"><img alt=\"Happy Smiley Face Paper\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"583\" src=\"https:/"
    ],
    "image_url": "",
    "titles": [
      "Experts Reveal a Simple Way To Boost Joy, Excitement, and Well-Being"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.981,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.448,
    "summary": "Experts suggest that engaging in new and diverse experiences can significantly enhance feelings of joy, excitement, and overall well-being. This approach is backed by research indicating that novel activities contribute to happiness and can improve mental health.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it provides actionable insights for the reader on how to improve their mental health and overall well-being. It also increases awareness about the positive impacts of engaging in new and diverse experiences."
  },
  {
    "title": "Breakthrough Supplement Found to Reverse Heart Damage, Study Shows",
    "domain": "science",
    "location": "global",
    "published": "Sat, 19 Jul 2025 22:23:56 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/remarkable-results-scientists-say-this-supplement-reversed-heart-damage/\" rel=\"nofollow\" title=\"“Remarkable” Results – Scientists Say This Supplement Reversed Heart Damage\"><img alt=\"Glowing Human Heart Concept\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"8"
    ],
    "image_url": "",
    "titles": [
      "“Remarkable” Results – Scientists Say This Supplement Reversed Heart Damage"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.964,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.445,
    "summary": "Scientists have reported significant findings indicating that a specific supplement can reverse heart damage. This discovery has been described as \"remarkable\" due to its potential implications for treating heart conditions. The study's results suggest a breakthrough in heart health management, offering hope for new therapeutic strategies.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story reports on a significant scientific breakthrough, which is a solution to a major health problem. It offers actionable insights for those suffering from heart conditions and contributes to the reader's understanding of heart health management. It clearly highlights progress in the field of heart health."
  },
  {
    "title": "Chicago Sky Boosts Security Measures, Includes Cybersecurity Focus",
    "domain": "business",
    "location": "national",
    "published": "Sat, 19 Jul 2025 18:06:56 +0000",
    "source": "Financial Post",
    "sources": [
      "Financial Post"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "INDIANAPOLIS (AP) &#8212; Chicago Sky co-owner Nadia Rawlinson knew security concerns were serious. The Sky have physical security nearly 24 hours a day _ around hotels, outside gyms, by buses and planes &#8212; but one of the final frontiers of player safety was the internet. Earlier this month, th",
      "INDIANAPOLIS (AP) &#8212; Chicago Sky co-owner Nadia Rawlinson knew security concerns were serious. The Sky have physical security nearly 24 hours a day _ around hotels, outside gyms, by buses and planes &#8212; but one of the final frontiers of player safety was the internet. Earlier this month, th"
    ],
    "image_url": "",
    "titles": [
      "WNBA’s Chicago Sky tries to protect their players on social media. Here’s what that means",
      "The Chicago Sky are trying to protect their players on social media. Here’s what that means"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.882,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.75
    },
    "score": 0.443,
    "summary": "Chicago Sky co-owner Nadia Rawlinson has addressed significant security concerns for the team, ensuring physical security around hotels, gyms, buses, and planes nearly 24/7. Recognizing the importance of cybersecurity, the Sky have now taken steps to enhance player safety on the internet as well, addressing what Rawlinson sees as one of the final frontiers of player security.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it provides useful information about the steps a sports team is taking to ensure both physical and cybersecurity. It increases awareness about the importance of cybersecurity in sports, a topic that may not be commonly understood."
  },
  {
    "title": "25% of Employees Have Mental Health Conditions, 65% Say It Affects Work",
    "domain": "science",
    "location": "global",
    "published": "Sat, 19 Jul 2025 17:50:01 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "About one in four employees has a diagnosable mental health condition, and up to 65% say mental health concerns interfere with their ability to work."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/headache-at-work-1.jpg",
    "titles": [
      "Why employees hesitate to disclose mental health concerns—and what employers can do about it"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.953,
      "consensus": 0.393,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.422,
    "summary": "Approximately 25% of employees have a diagnosable mental health condition, with up to 65% reporting that mental health issues affect their work. This highlights a significant impact on the workforce's mental well-being and productivity.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story increases awareness about the prevalence of mental health conditions in the workplace and their impact on productivity. It provides useful insights for employers and employees alike. However, it does not provide solutions or strategies to address the issue, limiting its score."
  },
  {
    "title": "The perfect pitch: This NEA partner says every founder should answer these 5 questions",
    "domain": "technology",
    "location": "global",
    "published": "Sat, 19 Jul 2025 16:00:00 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Tiffany Luck, a partner at NEA, outlined what she looks for in a pitch, during a presentation at TechCrunch’s All Stage event in Boston."
    ],
    "image_url": "",
    "titles": [
      "The perfect pitch: This NEA partner says every founder should answer these 5 questions"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.844,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.421,
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This title suggests a high degree of usefulness for readers, particularly for entrepreneurs or those interested in start-ups. It promises actionable insights (the five questions) that could aid in decision-making or understanding of the pitching process. Without a summary, it's hard to know if it delivers on this promise, but the title alone suggests a high potential for constructive value."
  },
  {
    "title": "The tech that the US Post Office gave us",
    "domain": "technology",
    "location": "global",
    "published": "2025-07-19T11:00:00-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "When you crack open your mailbox, it's almost as if your letters just appear. Long before the days of speedy, overnight mail deliveries, postal service workers meticulously sorted through letters by hand and transported mail on horseback. For more than 250 years, the US Postal Service has worked beh"
    ],
    "image_url": "",
    "titles": [
      "The tech that the US Post Office gave us"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.826,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.417,
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it provides a deeper understanding of how the US Post Office contributed to technological advancements. It highlights progress and innovations, and gives the reader actionable insights into the history of technology."
  },
  {
    "title": "Pollution Threatens Water Bodies, Wildlife, and Human Health",
    "domain": "science",
    "location": "global",
    "published": "Sat, 19 Jul 2025 18:50:01 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Have you felt disgust when taking a walk along the riverside or plunging into the sea to escape the summer heat, only to spy a used wet wipe floating along the surface? Or shock at finding out that animals have died choking on plastic products or that the seafood we eat may be contaminated with micr"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/wet-wipes.jpg",
    "titles": [
      "Why some 'biodegradable' wet wipes can be terrible for the environment"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.973,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.416,
    "summary": "Pollution in water bodies, including rivers and seas, has become a significant concern due to the presence of items like used wet wipes and plastic products. This pollution not only affects the aesthetic and recreational value of these environments but also poses a threat to wildlife, which can choke on these materials. Additionally, there is a risk of contamination to seafood consumed by humans, raising health concerns.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs the reader about the impacts of pollution on wildlife and human health, providing useful context. However, it does not report on any solutions, improvements, or attempts to solve the problem, which would have increased its score."
  },
  {
    "title": "Germany Advances, France Out of Euro 2025 After Dramatic Penalty Shootout",
    "domain": "sports",
    "location": "national",
    "published": "Sat, 19 Jul 2025 19:46:14 EST",
    "source": "ESPN",
    "sources": [
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Germany advance in Euro 2025 and France crash out again after a wild game with a red card, multiple big VAR calls, extra time and PK shootout."
    ],
    "image_url": "",
    "titles": [
      "Germany overcome early red card for shocking Euros semifinal berth; France collapse yet again"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.992,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.415,
    "summary": "Germany progressed in Euro 2025 while France faced elimination after a dramatic match featuring a red card, significant VAR decisions, extra time, and a penalty shootout. France's exit marks another disappointment for them in the tournament.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers basic awareness of the outcome of a significant soccer match. However, it lacks depth and insight into the implications of the match, the performance of the teams, or any potential solutions or improvements in the teams' strategies."
  },
  {
    "title": "Corporate Leaders, Billionaires Struggle with Psychological Money Issues",
    "domain": "science",
    "location": "global",
    "published": "Sat, 19 Jul 2025 16:50:01 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Corporate leaders and billionaires are often viewed as visionaries and wealth creators. But beneath the surface, many are trapped in an invisible financial \"crisis\"—one rooted not in market volatility or poor investments but in their psychological relationship with money."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/ceo.jpg",
    "titles": [
      "Why male corporate leaders and billionaires may need financial therapy more than anyone"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.933,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.415,
    "summary": "Corporate leaders and billionaires, often seen as visionaries, face a lesser-known financial crisis tied to their psychological relationship with money, rather than market issues or bad investments. This underlines a complex issue beyond their public image of success.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story offers a deeper understanding of a less-known issue affecting corporate leaders and billionaires. It provides awareness about the psychological relationship with money, which is useful to readers interested in psychology and finance. However, it lacks actionable insights or potential solutions to the problem."
  },
  {
    "title": "Powell Commits to Full Term, Dismisses Early Departure Speculation",
    "domain": "business",
    "location": "global",
    "published": "Sat, 19 Jul 2025 22:11:41 +0000",
    "source": "Fortune",
    "sources": [
      "Fortune"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "\"It doesn't occur to me in the slightest that there would be any situation in which I would not complete my term other than dying,\" Powell said in 2019."
    ],
    "image_url": "https://fortune.com/img-assets/wp-content/uploads/2025/07/GettyImages-2221354914-e1752954187123.jpg?w=2048",
    "titles": [
      "Powell once said he couldn’t imagine leaving the Fed early—other than dying. ‘You will not see me getting in the lifeboat’"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.96,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.414,
    "summary": "In 2019, Powell firmly stated his intention to serve his full term, only considering departure in the case of his death. This declaration highlights his commitment to his position and dismisses any speculation about resigning or being removed before his term concludes.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information about Powell's commitment to his term, which can help readers understand his stance and decision-making process. However, it does not offer insights into how this decision might affect broader economic or political systems, nor does it report on any new solutions or improvements."
  },
  {
    "title": "Study: Erythritol May Harm Brain Blood Vessels",
    "domain": "science",
    "location": "global",
    "published": "Sat, 19 Jul 2025 10:49:54 EDT",
    "source": "ScienceDaily",
    "sources": [
      "ScienceDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Erythritol, a widely used sugar substitute found in many low-carb and sugar-free products, may not be as harmless as once believed. New research from the University of Colorado Boulder reveals that even small amounts of erythritol can harm brain blood vessel cells, promoting constriction, clotting, "
    ],
    "image_url": "",
    "titles": [
      "Popular sugar substitute linked to brain cell damage and stroke risk"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.824,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.414,
    "summary": "Recent research from the University of Colorado Boulder indicates that erythritol, a common sugar substitute in low-carb and sugar-free products, could be harmful. The study found that small amounts of erythritol may damage brain blood vessel cells, leading to constriction and clotting.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The story provides useful information about a potential health risk associated with a common sugar substitute, which could influence readers' decision-making regarding their diet. However, it lacks information on solutions or alternatives to erythritol."
  },
  {
    "title": "A mushroom casket marks a first for ‘green burials’ in the US",
    "domain": "technology",
    "location": "global",
    "published": "2025-07-19T10:05:00-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "\"I'm probably the only architect who created a final home,\" Bob Hendrikx tells The Verge. Tombs and catacombs aside, Hendrikx might be the only one to make a final home using mushrooms. Hendrikx is the founder and CEO of Loop Biotech, a company that makes caskets out of mycelium, the fibrous root st"
    ],
    "image_url": "",
    "titles": [
      "A mushroom casket marks a first for ‘green burials’ in the US"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.811,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.414,
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it highlights an innovative solution to environmental concerns related to traditional burial methods. It provides readers with actionable insights into an alternative, more sustainable option for burials. It also increases awareness around the environmental impacts of traditional burial methods and the emerging trend of 'green burials'."
  },
  {
    "title": "President Faces New Challenges, Revealing Vulnerabilities",
    "domain": "business",
    "location": "global",
    "published": "Sat, 19 Jul 2025 23:09:29 +0000",
    "source": "Fortune",
    "sources": [
      "Fortune"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "There were suddenly a few punctures in the armor of a president who at times in his second term has seemed irrepressible as he bent rival institutions, countries, and political opponents to his will."
    ],
    "image_url": "https://fortune.com/img-assets/wp-content/uploads/2025/07/GettyImages-2224643281_ec305f-e1752966173219.jpg?w=2048",
    "titles": [
      "Trump’s ambitions collide with Epstein, Fed and health concerns"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.98,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.408,
    "summary": "A president, previously dominant in his second term, facing challenges that have exposed vulnerabilities. Despite previously overcoming opposition from various sectors, including institutions and countries, recent events have shown limitations to his influence.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness of the challenges faced by a president, but it lacks depth and specifics. It does not provide actionable insights, report on solutions or improvements, or increase clarity around systems, causes, trends, or impacts that matter."
  },
  {
    "title": "Christine Hunsicker Indicted on Fraud, Identity Theft Charges",
    "domain": "business",
    "location": "global",
    "published": "Sat, 19 Jul 2025 22:50:52 +0000",
    "source": "Fortune",
    "sources": [
      "Fortune"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Christine Hunsicker was charged with six counts, including fraud, aggravated identity theft and false statement charges in the indictment in federal court."
    ],
    "image_url": "https://fortune.com/img-assets/wp-content/uploads/2025/07/AP25199749850400-e1752964807311.jpg?w=2048",
    "titles": [
      "A one-time ’40 under 40′ rising star in fashion pleads not guilty to charges she allegedly cheated investors out of $300 million"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.973,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.406,
    "summary": "Christine Hunsicker faces legal issues as she has been indicted in federal court on six counts. The charges against her include fraud, aggravated identity theft, and making false statements. This development marks a significant point in the case, highlighting the serious nature of the allegations against her.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "While the story raises awareness about a specific case of alleged fraud and identity theft, it does not provide deeper understanding or actionable insights for the reader. It does not contextualize the case within larger trends or systems of white-collar crime, nor does it report on any attempts to solve or prevent such crimes."
  },
  {
    "title": "Obesity-Linked Cancer Deaths Triple, Study Finds",
    "domain": "science",
    "location": "global",
    "published": "Sat, 19 Jul 2025 22:48:07 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/obesity-linked-cancer-deaths-have-tripled-heres-whos-most-at-risk/\" rel=\"nofollow\" title=\"Obesity-Linked Cancer Deaths Have Tripled – Here’s Who’s Most at Risk\"><img alt=\"Plus Size Woman Breast Cancer Self Check\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\""
    ],
    "image_url": "",
    "titles": [
      "Obesity-Linked Cancer Deaths Have Tripled – Here’s Who’s Most at Risk"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.972,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.406,
    "summary": "A study has found that deaths from cancers linked to obesity have tripled. The research identifies those most at risk, emphasizing the significant health impact of obesity on cancer mortality rates. The specific demographics at higher risk were not detailed in the provided content.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "While the story raises awareness about the link between obesity and cancer, it lacks depth and insight. It does not provide actionable insights for the reader or detail the specific demographics at higher risk, which would have been useful for understanding and decision-making."
  },
  {
    "title": "In-N-Out Owner Moves to Tennessee, Cites California Business Challenges",
    "domain": "business",
    "location": "global",
    "published": "2025-07-19T22:26:27Z",
    "source": "Business Insider",
    "sources": [
      "Business Insider"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "In-N-Out's billionaire owner, Lynsi Snyder, said challenges running a business in California prompted her to relocate to Tennessee."
    ],
    "image_url": "https://i.insider.com/62c5ebdb99259b00181e3031?format=jpeg",
    "titles": [
      "In-N-Out billionaire Lynsi Snyder says she is leaving California: 'Doing business is not easy here'"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.965,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.405,
    "summary": "In-N-Out's owner, Lynsi Snyder, cited challenges in California as the reason for moving to Tennessee. The billionaire faced difficulties running her business in California, leading to the decision to relocate.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story offers basic awareness about the challenges of running a business in California, leading to the decision of the In-N-Out owner to relocate. However, it lacks depth and insight into what the specific challenges are and how they could be addressed."
  },
  {
    "title": "New Zealand's Ancient Settlement at Risk from Rising Sea Levels",
    "domain": "science",
    "location": "global",
    "published": "Sat, 19 Jul 2025 15:50:02 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "One of Aotearoa New Zealand's oldest settlement sites is at risk of being washed away by rising seas, according to new research."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/rising-seas-threaten-t.jpg",
    "titles": [
      "Rising seas threaten to swallow one of NZ's oldest settlement sites"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.914,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.405,
    "summary": "New research indicates that one of Aotearoa New Zealand's oldest settlement sites is facing the threat of erosion due to rising sea levels. The site is at risk of being washed away. The current status of the situation is that efforts may be needed to protect and preserve the historic settlement site from the impact of climate change.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the impact of climate change on historical sites, specifically in New Zealand. However, it does not offer any solutions or progress to solve the problem, nor does it provide in-depth insights or actionable insights for the reader."
  },
  {
    "title": "For privacy and security, think twice before granting AI access to your personal data",
    "domain": "technology",
    "location": "global",
    "published": "Sat, 19 Jul 2025 12:00:13 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "AI chatbots, assistants and agents are increasingly asking for gross levels of access to your personal data under the guise of needing your information to make them work."
    ],
    "image_url": "",
    "titles": [
      "For privacy and security, think twice before granting AI access to your personal data"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.776,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.404,
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is quite constructive. It increases awareness about the potential risks of granting AI access to personal data, which is a relevant and important issue. It also provides actionable insights for the reader to consider about their own data privacy and security practices."
  },
  {
    "title": "David Sacks and the blurred lines of government service",
    "domain": "technology",
    "location": "global",
    "published": "Sat, 19 Jul 2025 17:56:28 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "When Vultron announced its $22 million funding round earlier this week, the AI startup made sure to highlight a key investor: Craft Ventures, the firm &#8220;co-founded by White House AI adviser David Sacks.&#8221; The announcement has raised questions about conflicts of interest in the Trump admini"
    ],
    "image_url": "",
    "titles": [
      "David Sacks and the blurred lines of government service"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.879,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.398,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "While the title suggests the story might explore the intersection of business and government, without a summary it's hard to assess its depth or usefulness. It could potentially offer insights into government-business relationships, but without more information, it's not clear how actionable or comprehensive these insights might be."
  },
  {
    "title": "Usyk Defeats Dubois in Round 5, Regains Undisputed Heavyweight Title",
    "domain": "business",
    "location": "global",
    "published": "Sat, 19 Jul 2025 18:36:10 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Oleksandr Usyk knocks out Daniel Dubois in Round 5 to reclaim undisputed heavyweight status. Full fight results and reactions from the boxing world."
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/687c178d2474f066351e9d94/0x0.jpg?width=960",
    "titles": [
      "Former Champions Ring In After Oleksandr Usyk Destroys Daniel Dubois"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.968,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.393,
    "summary": "Oleksandr Usyk defeated Daniel Dubois in Round 5, regaining undisputed heavyweight status. The boxing match outcome has garnered reactions from the boxing community.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story reports on a specific event in the boxing world, but does not provide any actionable insights or deeper understanding for the reader. It does not contextualize the match within larger trends in the sport, nor does it report on any innovations or improvements in boxing techniques or strategies."
  },
  {
    "title": "Kings Advance to Summer League Championship After Defeating Raptors",
    "domain": "sports",
    "location": "national",
    "published": "Sat, 19 Jul 2025 23:14:41 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "The Sacramento Kings will advance to the Summer League Championship game on Sunday after their win against the Toronto Raptors."
    ],
    "image_url": "",
    "titles": [
      "Sacramento Kings defeat Toronto Raptors in Summer League semifinal, 98-88"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.981,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.388,
    "summary": "The Sacramento Kings secured a spot in the Summer League Championship game by defeating the Toronto Raptors. The Kings will play in the championship game on Sunday, marking their advancement in the tournament.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness of a sports event but does not offer much depth or insight. It does not provide actionable insights, report on solutions or improvements, or increase clarity around systems, causes, trends, or impacts that matter."
  },
  {
    "title": "These are our favorite cyber books on hacking, espionage, crypto, surveillance, and more",
    "domain": "technology",
    "location": "global",
    "published": "Sat, 19 Jul 2025 15:00:00 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "These are our favorite cybersecurity books, both by fiction authors, as well as journalists and researchers."
    ],
    "image_url": "",
    "titles": [
      "These are our favorite cyber books on hacking, espionage, crypto, surveillance, and more"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.826,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.387,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story is moderately constructive. It provides useful information about books that can increase readers' understanding of various cyber topics. However, without more information on the content of the books, it's hard to say if it provides actionable insights or increases awareness of systems, causes, trends, or impacts."
  },
  {
    "title": "Windsurf CEO opens up about ‘very bleak’ mood before Cognition deal",
    "domain": "technology",
    "location": "global",
    "published": "Sat, 19 Jul 2025 17:20:00 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Days after AI coding startup Windsurf announced that it’s being acquired by Cognition, Windsurf exec Jeff Wang took to X to offer more details about the drama and uncertainty around the deal."
    ],
    "image_url": "",
    "titles": [
      "Windsurf CEO opens up about ‘very bleak’ mood before Cognition deal"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.868,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.385,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The title indicates a potential for awareness around the challenges faced by a CEO and their company prior to a significant business deal. However, without further context or a summary, it's difficult to determine the depth of insight or usefulness of the story."
  },
  {
    "title": "Microsoft says it will no longer use engineers in China for Department of Defense work",
    "domain": "technology",
    "location": "global",
    "published": "Sat, 19 Jul 2025 21:20:53 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Following a Pro Publica report that Microsoft was using engineers in China to help maintain cloud computing systems for the U.S. Department of Defense, the company said it’s made changes to ensure this will no longer happen."
    ],
    "image_url": "",
    "titles": [
      "Microsoft says it will no longer use engineers in China for Department of Defense work"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.943,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.357,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "Without a summary or additional information, it's impossible to evaluate the constructiveness of this story. It could potentially offer insights into international business practices or cybersecurity concerns, but without more context, its value cannot be assessed."
  }
]