[
  {
    "title": "Unsafe Castledowns Pointe condo owners say they’re out thousands of dollars",
    "domain": "general",
    "location": "national",
    "published": "Wed, 14 May 2025 23:58:43 +0000",
    "source": "Global News",
    "sources": [
      "Global News"
    ],
    "snippets": [
      "The building has been fenced off and partially covered by a tarp for almost two years now. Now, condo owners say there's hope they could get some money back soon."
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2023/09/IMG_0578.jpeg?quality=85&strip=all",
    "titles": [
      "Unsafe Castledowns Pointe condo owners say they’re out thousands of dollars"
    ],
    "summary": "A building that has been inaccessible and partially concealed with a tarp for nearly two years may soon provide financial relief to its condo owners. The owners have expressed optimism about receiving some compensation in the near future, indicating a potential resolution to the ongoing issue surrounding the property's condition and accessibility.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful information for the condo owners and others who might be in similar situations. It also highlights the progress towards a potential resolution for the property's condition and accessibility issues. However, it doesn't offer a clear solution or empowering knowledge for the readers.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.999,
      "consensus": 0.2,
      "constructiveness": 0.7
    },
    "score": 0.565,
    "normalized_score": 7.61
  },
  {
    "title": "Will Putin Be in Turkey for Peace Talks? Kremlin’s List Indicates Not.",
    "domain": "general",
    "location": "global",
    "published": "Wed, 14 May 2025 23:55:38 +0000",
    "source": "New York Times",
    "sources": [
      "New York Times"
    ],
    "snippets": [
      "A hard-line aide to the Russian president will instead lead the delegation, according to a Kremlin statement."
    ],
    "image_url": "https://static01.nyt.com/images/2025/05/14/multimedia/14int-russia-ukraine-putin-gkvz/14int-russia-ukraine-putin-gkvz-mediumSquareAt3X.jpg",
    "titles": [
      "Will Putin Be in Turkey for Peace Talks? Kremlin’s List Indicates Not."
    ],
    "summary": "A Kremlin statement announced that a hard-line aide to the Russian president will lead the delegation instead of the previously expected official. This change in leadership for the delegation has been officially confirmed by the Kremlin.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides information about a change in the delegation leadership for the peace talks, which could influence the outcome. This gives the reader a deeper understanding of the situation. However, it doesn't report on solutions, improvements, or attempts to solve problems, nor does it increase clarity around systems, causes, trends, or impacts that matter.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.998,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.555,
    "normalized_score": 6.52
  },
  {
    "title": "Watch: Abuse and blackmail - Cassie describes Diddy relationship at trial",
    "domain": "general",
    "location": "global",
    "published": "Wed, 14 May 2025 23:52:55 GMT",
    "source": "BBC",
    "sources": [
      "BBC"
    ],
    "snippets": [
      "The prosecution wrapped up its questioning of Ventura, who will return the stand on Thursday for cross-examination by Combs' lawyers."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/9b74/live/abafab60-311b-11f0-96c3-cf669419a2b0.jpg",
    "titles": [
      "Watch: Abuse and blackmail - Cassie describes Diddy relationship at trial"
    ],
    "summary": "The prosecution completed its questioning of Ventura in court, with plans for Ventura to undergo cross-examination by Combs' legal team on Thursday.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "The story offers basic awareness about the ongoing trial, but it doesn't provide much depth or insight. It doesn't report on solutions or improvements, nor does it increase clarity around systems, causes, trends, or impacts that matter. The story is more reactive and sensational, with minimal takeaway or value.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.997,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.533,
    "normalized_score": 4.13
  },
  {
    "title": "Australia news live: Albanese greeted by Prabowo in Jakarta; Longman and Flinders go to Liberals",
    "domain": "general",
    "location": "global",
    "published": "Wed, 14 May 2025 23:52:14 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "snippets": [
      "<p>Prime minister will aim to smooth over Russian base alarm. Follow today’s news live</p><ul><li>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></li></ul><p>The Reserve Bank is watching closely as the last data domino falls before a pivotal rates meeting.</p><p>The RBA’s preferred measure of inflation – the trimmed mean – fell back into target at 2.9% in April, but tightness in the labour market remains a concern for the central bank.</p> <a href=\"https://www.theguardian.com/australia-news/live/2025/may/15/australia-news-live-anthony-albanese-indonesia-visit-russian-airbase-greens-leaders-sarah-hanson-young-mehreen-faruqi-ntwnfb\">Continue reading...</a>",
      "<p>Prime minister will aim to smooth over Russian base alarm. Follow today’s news live</p><ul><li>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></li></ul><p>The Reserve Bank is watching closely as the last data domino falls before a pivotal rates meeting.</p><p>The RBA’s preferred measure of inflation – the trimmed mean – fell back into target at 2.9% in April, but tightness in the labour market remains a concern for the central bank.</p> <a href=\"https://www.theguardian.com/australia-news/live/2025/may/15/australia-news-live-anthony-albanese-indonesia-visit-russian-airbase-greens-leaders-sarah-hanson-young-mehreen-faruqi-ntwnfb\">Continue reading...</a>"
    ],
    "image_url": "https://i.guim.co.uk/img/media/df45e99d2089639c0f4fea0f70b396223482a776/887_0_4417_3535/master/4417.jpg?width=140&quality=85&auto=format&fit=max&s=b678462a655ec677e5f5ee0512408b0c",
    "titles": [
      "Australia news live: Albanese greeted by Prabowo in Jakarta; Longman and Flinders go to Liberals",
      "Australia news live: Albanese greeted by Prabowo in Jakarta; Longman and Flinders go to Liberals"
    ],
    "summary": "The Prime Minister is working to address concerns about a Russian base, as reported in live news updates. The Reserve Bank of Australia (RBA) is closely monitoring economic indicators ahead of a crucial interest rate meeting. The RBA's preferred inflation measure, the trimmed mean, has returned to the target range at 2.9% in April. However, the central bank remains worried about the tight labor market.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful information about the current economic situation in Australia, including the Reserve Bank's actions and concerns. It does not, however, offer any solutions or progress towards addressing these issues.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.997,
      "consensus": 0.2,
      "constructiveness": 0.7
    },
    "score": 0.565,
    "normalized_score": 7.61
  },
  {
    "title": "Elon Musk’s Grok chatbot repeatedly mentions ‘white genocide’ in unrelated chats",
    "domain": "general",
    "location": "global",
    "published": "Wed, 14 May 2025 23:51:41 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "snippets": [
      "<p>AI bot goes on hours-long fritz, bringing up ‘white genocide in South Africa’, which it is ‘instructed to accept as real’</p><p>Elon Musk’s artificial intelligence chatbot Grok went on the fritz on Wednesday, repeatedly mentioning “white genocide” in South Africa in its responses on completely unrelated topics.</p><p>Faced with users’ queries on issues such as baseball, enterprise software and building scaffolding,<strong> </strong>the chatbot offered false and misleading answers.</p> <a href=\"https://www.theguardian.com/technology/2025/may/14/elon-musk-grok-white-genocide\">Continue reading...</a>"
    ],
    "image_url": "https://i.guim.co.uk/img/media/36c0459a372ee26dcb7453538be100e71dd36e96/462_0_4583_3668/master/4583.jpg?width=140&quality=85&auto=format&fit=max&s=cf1e8d5325fc2f4c66231f37a9e156e2",
    "titles": [
      "Elon Musk’s Grok chatbot repeatedly mentions ‘white genocide’ in unrelated chats"
    ],
    "summary": "Elon Musk's AI chatbot Grok malfunctioned on Wednesday, erroneously mentioning \"white genocide\" in South Africa in responses to unrelated queries about baseball, enterprise software, and building scaffolding. The bot provided false and misleading information during its hours-long glitch.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "While the story raises awareness about the malfunctioning of a notable AI chatbot, it doesn't provide any insights into why this happened, what the implications might be, or how it might be fixed. It also doesn't give readers any actionable insights.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.997,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.545,
    "normalized_score": 5.43
  },
  {
    "title": "The Twins turned their season around. The Orioles are showing few signs of doing that",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 14 May 2025 23:52:42 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "snippets": [
      "The Minnesota Twins lost a couple mainstays in their lineup — and even their manager, too.  The Baltimore Orioles still couldn't beat them.  Minnesota rallied from a three-run deficit in the opener and a two-run deficit in game two, sweeping its twin bill against the Orioles on Wednesday, 6-3 and 8-6."
    ],
    "image_url": "",
    "titles": [
      "The Twins turned their season around. The Orioles are showing few signs of doing that"
    ],
    "summary": "The Minnesota Twins overcame significant lineup changes and the loss of their manager to secure a double victory against the Baltimore Orioles on Wednesday. Despite trailing by three runs in the first game and two in the second, the Twins rallied to win 6-3 and 8-6, sweeping the twin bill.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides a deeper understanding of the current situation in the baseball league, highlighting the contrasting performances of two teams. However, it doesn't provide any solutions or progress towards improving the Orioles' performance, nor does it offer any actionable insights for the reader.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.997,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.535,
    "normalized_score": 4.35
  },
  {
    "title": "Knicks G Josh Hart has face split open by Celtics elbow, wipes off blood to shoot 2 FTs",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 14 May 2025 23:51:59 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "snippets": [
      "No one is ever going to question Josh Hart's toughness."
    ],
    "image_url": "",
    "titles": [
      "Knicks G Josh Hart has face split open by Celtics elbow, wipes off blood to shoot 2 FTs"
    ],
    "summary": "Josh Hart is universally recognized for his toughness, with no doubts or questions regarding this aspect of his character or performance.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "This story is largely sensational, focusing on a dramatic moment in a basketball game. It doesn't provide actionable insights or deeper understanding, nor does it report on solutions, improvements, or innovations. It also doesn't increase clarity around systems, causes, trends, or impacts that matter.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.997,
      "consensus": 0.2,
      "constructiveness": 0.2
    },
    "score": 0.495,
    "normalized_score": 0.0
  },
  {
    "title": "Midweek Update May 14 with Dr. Robert McWhirter and Luke Hagen",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 14 May 2025 23:50:00 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "snippets": [
      "May 14—MITCHELL — Dr. Robert McWhirter visited Mitchell for the first time 40 years ago in May 1985. He decided in August that year to move to Mitchell and has called the community home since. McWhirter operated the Mitchell Orthopedic Clinic from 1985 until his retirement in 2013 and was heavily involved in athletics in the community during that time. He served as Dakota Wesleyan University's ..."
    ],
    "image_url": "",
    "titles": [
      "Midweek Update May 14 with Dr. Robert McWhirter and Luke Hagen"
    ],
    "summary": "In May 1985, Dr. Robert McWhirter first visited Mitchell and by August, decided to make it his home. He ran the Mitchell Orthopedic Clinic from 1985 until his retirement in 2013. Throughout his career, McWhirter was deeply involved with local athletics, including serving as a team doctor for Dakota Wesleyan University.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about Dr. Robert McWhirter's career and his contributions to local athletics. However, it lacks depth or insight into how his work has impacted the community or the field of orthopedics, and it doesn't report on any solutions, improvements, or innovations.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.997,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.525,
    "normalized_score": 3.26
  },
  {
    "title": "Otzelberger, Iowa State coming to Sanford Pentagon on Nov. 10 to face Mississippi State",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 14 May 2025 23:50:00 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "snippets": [
      "May 14—SIOUX FALLS, S.D. — The Iowa State Cyclones will return to the Sanford Pentagon in the 2025-26 season when they play the Mississippi State Bulldogs in a nonconference men's basketball matchup on Monday, Nov. 10. This marks the second trip to the Pentagon for Iowa State and the debut appearance for Mississippi State. The on-sale date for tickets will be announced later. The Cyclones, who ..."
    ],
    "image_url": "",
    "titles": [
      "Otzelberger, Iowa State coming to Sanford Pentagon on Nov. 10 to face Mississippi State"
    ],
    "summary": "The Iowa State Cyclones are set to face the Mississippi State Bulldogs in a nonconference men's basketball game on November 10, 2025, at the Sanford Pentagon in Sioux Falls, S.D. This event marks Iowa State's second appearance and Mississippi State's first at the venue. Details regarding ticket sales for the matchup will be released at a later date.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers basic awareness about an upcoming basketball game but doesn't provide actionable insights or deeper understanding. It doesn't report on solutions, improvements, or innovations, and it doesn't increase clarity around systems, causes, trends, or impacts that matter.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.997,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.505,
    "normalized_score": 1.09
  },
  {
    "title": "Broncos 2025 schedule leak reveals matchups with Raiders and a couple very lucky breaks",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 14 May 2025 23:48:06 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "snippets": [
      "The Broncos schedule features two major breaks for Denver along with primetime matchups vs the Raiders and Christmas game vs the Chiefs."
    ],
    "image_url": "",
    "titles": [
      "Broncos 2025 schedule leak reveals matchups with Raiders and a couple very lucky breaks"
    ],
    "summary": "The Denver Broncos' schedule includes significant advantages with two major breaks, alongside notable games such as primetime matchups against the Raiders and a Christmas game versus the Chiefs.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers basic awareness about the Denver Broncos' future schedule, but it doesn't provide any deeper insights, solutions, or empowering knowledge. The information might be useful for fans or those involved in sports betting, but it doesn't contribute significantly to a broader understanding or decision-making.",
    "score_components": {
      "magnitude": 0.359,
      "recency": 0.996,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.512,
    "normalized_score": 1.85
  },
  {
    "title": "CoreWeave beats on revenue, reports more than 400% growth in first earnings after IPO",
    "domain": "business",
    "location": "national",
    "published": "Wed, 14 May 2025 23:17:17 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "snippets": [
      "CoreWeave's revenue growth slowed down from the feverish pace in 2024, but is still benefiting from the artificial intelligence boom."
    ],
    "image_url": "",
    "titles": [
      "CoreWeave beats on revenue, reports more than 400% growth in first earnings after IPO"
    ],
    "summary": "CoreWeave's revenue growth has decelerated from its rapid increase in 2024, yet the company continues to profit from the ongoing artificial intelligence boom.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful information about CoreWeave's financial performance, which can be helpful for investors, analysts, or anyone interested in the tech industry. It also indicates a trend in the artificial intelligence sector, contributing to a deeper understanding of the market. However, it doesn't highlight any specific solutions or improvements.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.989,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.572,
    "normalized_score": 8.37
  },
  {
    "title": "Mike Lynch’s sunken yacht had ‘vulnerabilities’, UK probe finds",
    "domain": "business",
    "location": "global",
    "published": "Wed, 14 May 2025 23:03:42 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times"
    ],
    "snippets": [
      "Bayesian capsized last year when strong winds knocked it over, killing British tycoon and six others"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F8a747c74-cb00-4cc4-94a4-4a9c5c84b9a9.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Mike Lynch’s sunken yacht had ‘vulnerabilities’, UK probe finds"
    ],
    "summary": "A yacht named Bayesian capsized last year due to strong winds, resulting in the death of a British tycoon and six other individuals.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story raises awareness about a tragic event and the potential vulnerabilities of the yacht. However, it lacks depth as it doesn't provide information on what these vulnerabilities were, how they could be addressed, or the broader implications for yacht safety standards. It offers minimal insight beyond the basic facts of the incident.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.986,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.541,
    "normalized_score": 5.0
  },
  {
    "title": "Vladimir Putin to skip Russia-Ukraine peace talks in Turkey",
    "domain": "business",
    "location": "global",
    "published": "Wed, 14 May 2025 22:56:04 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times"
    ],
    "snippets": [
      "Ceasefire negotiations in doubt after Russian president shuns trip"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F9eaf2651-0f24-4d8f-a5e7-602d162cbbb4.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Vladimir Putin to skip Russia-Ukraine peace talks in Turkey"
    ],
    "summary": "Ceasefire negotiations are facing uncertainty as the Russian president has decided not to attend the planned trip, which was aimed at discussing a possible ceasefire. This decision puts the future of the talks in doubt, impacting the prospects for an agreement to halt hostilities.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information about the current state of the peace talks between Russia and Ukraine, which can help the reader understand the geopolitical situation. However, it does not offer any solutions or progress, nor does it delve deeply into the causes or impacts of the situation.",
    "score_components": {
      "magnitude": 0.429,
      "recency": 0.984,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.567,
    "normalized_score": 7.83
  },
  {
    "title": "Amazon lays off about 100 employees in devices and services unit",
    "domain": "business",
    "location": "national",
    "published": "Wed, 14 May 2025 22:28:13 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "snippets": [
      "Amazon is cutting jobs in its devices and services unit, which was previously hit with layoffs in 2022 and 2023."
    ],
    "image_url": "",
    "titles": [
      "Amazon lays off about 100 employees in devices and services unit"
    ],
    "summary": "Amazon is reducing its workforce in the devices and services unit, continuing a trend of layoffs that began in 2022 and persisted into 2023. This action reflects ongoing adjustments within the company's employment structure.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness about the layoffs at Amazon and gives some context about the ongoing adjustments within the company. However, it does not provide actionable insights for the reader, nor does it report on any solutions, improvements, or innovations.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.978,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.539,
    "normalized_score": 4.78
  },
  {
    "title": "Cisco says CFO Scott Herren is leaving, company reports earnings beat",
    "domain": "business",
    "location": "national",
    "published": "Wed, 14 May 2025 22:27:06 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "snippets": [
      "Cisco exceeded estimates for the latest quarter and offered guidance that was also ahead of analysts' predictions."
    ],
    "image_url": "",
    "titles": [
      "Cisco says CFO Scott Herren is leaving, company reports earnings beat"
    ],
    "summary": "Cisco reported higher-than-expected earnings for the latest quarter and provided future earnings guidance that surpassed analyst predictions. This indicates a positive financial performance and outlook for the company.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information about Cisco's financial performance and changes in its executive team. This could help readers, especially investors, make decisions. However, it does not highlight any progress or solutions, nor does it increase clarity around systems, causes, or trends.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.977,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.549,
    "normalized_score": 5.87
  },
  {
    "title": "SpaceX Tests Starship Fixes After Back-to-Back Failures",
    "domain": "science",
    "location": "global",
    "published": "Wed, 14 May 2025 23:31:28 +0000",
    "source": "Wired",
    "sources": [
      "Wired"
    ],
    "snippets": [
      "The next Starship launch may come as soon as next week. A test of its Raptor engines suggests SpaceX has resolved the issues that plagued its recent flights."
    ],
    "image_url": "https://media.wired.com/photos/68250ef9479272f2a734efc0/master/pass/GettyImages-2205158475.jpg",
    "titles": [
      "SpaceX Tests Starship Fixes After Back-to-Back Failures"
    ],
    "summary": "SpaceX's next Starship launch could occur as early as next week, following a successful test of its Raptor engines. This suggests that the company has addressed the technical problems affecting its recent flights, potentially clearing the way for the upcoming launch.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it provides a deeper understanding of SpaceX's efforts to overcome technical problems with its Starship. However, it does not highlight any specific solutions or improvements, nor does it provide actionable insights for the reader.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.992,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.581,
    "normalized_score": 9.35
  },
  {
    "title": "Men Are Dying More Than Women From These 3 Common Diseases",
    "domain": "science",
    "location": "global",
    "published": "Wed, 14 May 2025 22:18:44 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/men-are-dying-more-than-women-from-these-3-common-diseases/\" rel=\"nofollow\" title=\"Men Are Dying More Than Women From These 3 Common Diseases\"><img alt=\"Old Man Doctor Appointment\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Old-Man-Doctor-Appointment-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>A global analysis reveals that there are sex-based health disparities in the prevalence and outcomes of hypertension, diabetes, and HIV/AIDS. In a groundbreaking global study, researchers have uncovered a troubling trend: men are more likely than women to suffer from, and die due to, three major health conditions, yet they’re also less likely to seek [...]"
    ],
    "image_url": "",
    "titles": [
      "Men Are Dying More Than Women From These 3 Common Diseases"
    ],
    "summary": "A global study highlights significant sex-based health disparities, revealing that men are more likely than women to suffer from and die due to hypertension, diabetes, and HIV/AIDS. Additionally, the research found that men are less likely to seek medical treatment for these conditions.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story increases awareness about sex-based health disparities and the need for men to seek medical treatment. However, it does not provide actionable insights or report on solutions to this issue.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.975,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.548,
    "normalized_score": 5.76
  },
  {
    "title": "Reversing Liver Disease? Scientists Discover New Health Benefit of Semaglutide",
    "domain": "science",
    "location": "global",
    "published": "Wed, 14 May 2025 21:53:28 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/reversing-liver-disease-scientists-discover-new-health-benefit-of-semaglutide/\" rel=\"nofollow\" title=\"Reversing Liver Disease? Scientists Discover New Health Benefit of Semaglutide\"><img alt=\"Liver Disease Concept Illustration\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Liver-Disease-Concept-Illustration-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>New research reveals that semaglutide significantly improves liver health in MASH patients. A new study published in the New England Journal of Medicine reveals that semaglutide significantly improves outcomes for patients with a serious form of liver disease, benefiting approximately two-thirds of those treated. The findings come from the ESSENCE phase 3 clinical trial, a [...]"
    ],
    "image_url": "",
    "titles": [
      "Reversing Liver Disease? Scientists Discover New Health Benefit of Semaglutide"
    ],
    "summary": "A new study published in the New England Journal of Medicine found that semaglutide significantly improves liver health in patients with a serious form of liver disease, benefiting about two-thirds of those treated. This discovery comes from the ESSENCE phase 3 clinical trial.",
    "constructiveness_score": 1.0,
    "constructiveness_reason": "This story is highly constructive as it reports on a significant medical innovation that could potentially improve the health of patients with serious liver disease. It provides actionable insights for patients and increases awareness about the potential benefits of semaglutide.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.97,
      "consensus": 0.2,
      "constructiveness": 1.0
    },
    "score": 0.587,
    "normalized_score": 10.0
  },
  {
    "title": "The EPA Is Giving Some Forever Chemicals a Pass",
    "domain": "science",
    "location": "global",
    "published": "Wed, 14 May 2025 21:38:57 +0000",
    "source": "Wired",
    "sources": [
      "Wired"
    ],
    "snippets": [
      "Last year, the Biden administration set limits on PFAS in drinking water systems. Donald Trump’s EPA is planning to dramatically soften that rule."
    ],
    "image_url": "https://media.wired.com/photos/68250bd920883fc22cd8650f/master/pass/GettyImages-2199525638.jpg",
    "titles": [
      "The EPA Is Giving Some Forever Chemicals a Pass"
    ],
    "summary": "The Biden administration implemented restrictions on PFAS (per- and polyfluoroalkyl substances) in drinking water systems last year. However, the Environmental Protection Agency (EPA) under Donald Trump's administration intends to significantly relax these limits.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs readers about the changing regulations around PFAS in drinking water systems. However, it doesn't provide actionable insights or suggest any solutions to the issue, limiting its usefulness and progressiveness.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.966,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.545,
    "normalized_score": 5.43
  },
  {
    "title": "$20 Pill vs $20,000 Surgery? Popular Diabetes Drug Metformin Found To Relieve Osteoarthritis Knee Pain",
    "domain": "science",
    "location": "global",
    "published": "Wed, 14 May 2025 21:28:35 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/20-pill-vs-20000-surgery-popular-diabetes-drug-metformin-found-to-relieve-osteoarthritis-knee-pain/\" rel=\"nofollow\" title=\"$20 Pill vs $20,000 Surgery? Popular Diabetes Drug Metformin Found To Relieve Osteoarthritis Knee Pain\"><img alt=\"Knee Pain Osteoarthritis\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"457\" src=\"https://scitechdaily.com/images/Knee-Pain-Osteoarthritis-777x457.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>Metformin may reduce knee pain in overweight patients with osteoarthritis, offering a low-cost alternative to early knee replacement surgery, according to a Monash University trial. A widely used diabetes medication may help relieve knee osteoarthritis (OA) pain in people who are overweight or obese, potentially delaying the need for knee replacement surgery, according to new [...]"
    ],
    "image_url": "",
    "titles": [
      "$20 Pill vs $20,000 Surgery? Popular Diabetes Drug Metformin Found To Relieve Osteoarthritis Knee Pain"
    ],
    "summary": "A trial by Monash University found that Metformin, a common diabetes drug, may reduce knee pain in overweight individuals with osteoarthritis, presenting a cost-effective alternative to knee replacement surgery. This discovery could delay the need for such operations, offering significant financial and medical benefits.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive as it reports on a potential solution to a common medical problem, providing readers with actionable insights. It highlights progress in medical research and could empower patients with osteoarthritis to discuss this alternative treatment with their doctors.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.964,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.583,
    "normalized_score": 9.57
  }
]