[
  {
    "title": "Sanae Takaichi Elected LDP Leader, Set to Be Japan's First Female PM",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 04 Oct 2025 06:23:16 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Deutsche Welle",
      "ABC News",
      "The Guardian",
      "New York Times",
      "Financial Times",
      "Washington Post",
      "Al Jazeera"
    ],
    "domains": [
      "www.washingtonpost.com",
      "www.dw.com",
      "www.bbc.com",
      "www.aljazeera.com",
      "abcnews.go.com",
      "www.nytimes.com",
      "www.theguardian.com",
      "www.ft.com"
    ],
    "snippets": [
      "Takaichi is a long-time admirer of Margaret Thatcher, but many female voters do not see her as an advocate for progress.",
      "If elected, Takaichi will face a host of issues, including an ageing population and growing unease about immigration.",
      "Japan&#039;s governing Liberal Democratic Party is choosing its next leader on Saturday.",
      "Conservative hard-liner Takaichi is the former internal affairs minister of Japan. She holds hawkish views on China, and has also visited the controversial Yasukuni Shrine, which memorializes Japan's war dead.",
      "Japan&rsquo;s governing party has elected former Economic Security Minister Sanae Takaichi as its new leader, making her likely to become the country&rsquo;s first female prime minister",
      "Arch-conservative who models herself on Margaret Thatcher beats Shinjiro Koizumi in second-round party vote",
      "<p>Admirer of Margaret Thatcher beat her more moderate rival, Shinjiro Koizumi, to become leader of Liberal Democratic party</p><p>Japan is about to get its first female prime minister, after Sanae Takaichi was elected as leader of the governing Liberal Democratic party (LDP) – a victory that should",
      "The new leader will take the helm of the world’s fourth-largest economy at a time of unusual political instability, rising prices and increasing regional tensions.",
      "Sanae Takaichi, a hard-line conservative, was elected as leader by Japan’s governing party, paving the way for her to become prime minister of the coalition government."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/2978/live/3fbb1f10-a0e8-11f0-b741-177e3e2c2fc7.jpg",
    "titles": [
      "Sanae Takaichi set to become Japan's first female prime minister",
      "Japan’s LDP elects Takaichi as new leader, likely to be first female PM",
      "Who are the candidates running to be Japan’s next prime minister?",
      "Sanae Takaichi expected to be Japan's first female PM",
      "Japan's ruling party elects Sanae Takaichi as new leader, likely to be 1st female PM",
      "Japan set for first female PM after Sanae Takaichi wins leadership race",
      "Sanae Takaichi expected to become Japan’s first female PM after winning ruling party leadership",
      "Sanae Takaichi is set to become Japan’s first female prime minister",
      "Japan Set for First Female Prime Minister"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.943,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.839,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Sanae Takaichi, a conservative hard-liner and former Economic Security Minister, has been elected as the new leader of Japan's governing Liberal Democratic Party (LDP), positioning her to become the country's first female prime minister. Takaichi, known for her admiration of Margaret Thatcher and hawkish views on China, won against her more moderate rival, Shinjiro Koizumi, in a second-round party vote. Her leadership arrives amidst challenges such as political instability, an ageing population, rising prices, and regional tensions.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Sean \"Diddy\" Combs Sentenced to Over 4 Years for Prostitution Charges",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Fri, 03 Oct 2025 17:17:13 -0400",
    "source": "NPR",
    "sources": [
      "BBC",
      "Deutsche Welle",
      "Business Insider",
      "CityNews",
      "The Guardian",
      "NPR",
      "Al Jazeera"
    ],
    "domains": [
      "www.dw.com",
      "www.npr.org",
      "www.bbc.com",
      "www.aljazeera.com",
      "www.theguardian.com",
      "www.businessinsider.com",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "Combs had been convicted in July on two counts of transportation for prostitution. During his sentencing hearing he spoke at length for the first time in the trial, addressing the judge at length.",
      "Combs apologised to his mother, children, and victims, specifically naming his two ex-girlfriends, Casandra Ventura and \"Jane\".",
      "The famed hip-hop mogul told the court that his actions were &#039;disgusting&#039; and &#039;shameful&#039; in a plea for leniency.",
      "The US rapper and record producer was convicted over sexual encounters, capping a sordid federal case that featured harrowing testimony. The judge said \"these were serious offenses that irreparably harmed two women.\"",
      "<p>Combs, who was convicted of ‘transportation to engage in prostitution’, sentenced in New York. This blog is now closed.</p><p><strong>The prosecution <a href=\"https://viewer.gutools.co.uk/us-news/2025/sep/30/sean-diddy-combs-sentence-recommendation\">submitted several victim impact </a>statements ",
      "Sean \"Diddy\" Combs was sentenced to four years in prison Friday after he was convicted in July of two prostitution-related counts.",
      "NEW YORK (AP) —&#160;Sean “Diddy” Combs&#160;was sentenced Friday to four years and two months in prison for transporting people across state lines for sexual encounters, capping a sordid federal case that featured harrowing testimony and ended in a forceful reckoning for&#160;one of the most influe"
    ],
    "image_url": "",
    "titles": [
      "Sean Combs sentenced to over four years in prison for prostitution-related charges",
      "Sean 'Diddy' Combs sentenced to more than four years in prison",
      "Musician Sean ‘Diddy’ Combs sentenced to four years in prison after apology",
      "US: Sean 'Diddy' Combs sentenced to over 4 years in prison",
      "Sean ‘Diddy’ Combs sentenced to more than four years in prison and given $500,000 fine – as it happened",
      "Diddy sentenced to over 4 years in prison for transporting sex workers to 'freak offs'",
      "Sean ‘Diddy’ Combs is sentenced to over 4 years in prison"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.796,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.834,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Sean \"Diddy\" Combs was sentenced to 4 years and 2 months in prison after being convicted on two counts of transportation for prostitution. In his trial, he admitted his actions were \"disgusting\" and \"shameful.\" Despite his plea for leniency and the prosecution's push for a longer sentence of 11 years and three months, the judge determined the crimes caused irreparable harm to two women and emphasized the need for a lengthy sentence to serve as a deterrent.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Hamas Agrees to Release Hostages, Engages in Peace Talks with Trump's Plan",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Fri, 03 Oct 2025 12:26:36 -0400",
    "source": "NPR",
    "sources": [
      "Fortune",
      "The Guardian",
      "New York Times",
      "Financial Times",
      "NPR",
      "Al Jazeera"
    ],
    "domains": [
      "www.npr.org",
      "fortune.com",
      "www.aljazeera.com",
      "www.nytimes.com",
      "www.theguardian.com",
      "www.ft.com"
    ],
    "snippets": [
      "Hamas said it would agree to release the remaining Israeli hostages in exchange for Palestinian prisoners. Despite not agreeing to the full U.S. peace proposal, President Trump said the group seemed ready for peace.",
      "US President Donald Trump has ordered Israel to halt its bombing of Gaza, saying Hamas is ready to make peace.",
      "US leader tells Israel it &#039;must immediately stop&#039; bombing Gaza, says he believes Hamas is &#039;ready for a lasting peace&#039;.",
      "US president says he ‘believes’ Palestinian militant group is ‘ready for a lasting peace’",
      "<p>Palestinian militant group accepts part of US president’s plan but seeks further negotiations on many terms</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/oct/04/israel-gaza-hamas-trump-plan-hostages-netanyahu-latest-news-updates\">Israel-Gaza live: latest new updates</a></p></",
      "President Trump said he believed Hamas was “ready for a lasting peace” after the militant group offered to release hostages and discuss the U.S.-led peace proposal.",
      "Hamas said it was willing to release the hostages and hand over power to other Palestinians, but that other aspects of the plan require further consultations among Palestinians."
    ],
    "image_url": "",
    "titles": [
      "Trump tells Israel to stop bombing Gaza after Hamas agrees to release Israeli hostages",
      "Trump orders Israel to stop bombing Gaza, says Hamas ready for peace",
      "LIVE: Israel kills 7 people after Trump tells it to ‘stop bombing’ Gaza",
      "Trump tells Israel to stop bombing Gaza after Hamas agrees to release hostages",
      "Donald Trump orders Israel to ‘immediately’ stop bombing Gaza as Hamas agrees to free hostages",
      "Trump Calls on Israel to Stop Bombing Gaza After Hamas Agrees to Parts of Cease-Fire Plan",
      "Trump orders Israel to stop bombing Gaza after Hamas partially accepts his peace plan"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.72,
      "consensus": 1.0,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.829,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Hamas has agreed to release Israeli hostages and accepted parts of President Trump's peace plan to end the nearly two-year war, but seeks further negotiations on many terms. Trump has ordered Israel to immediately stop bombing Gaza, signaling a potential move towards peace. Despite not fully agreeing to the U.S. proposal, Hamas's willingness to discuss the plan and release hostages has been acknowledged by Trump as a step towards achieving lasting peace in the Middle East.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "U.S. Strike Kills 4 on Suspected Drug Boat in Caribbean",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 20:07:02 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Deutsche Welle",
      "The Guardian",
      "New York Times",
      "Washington Post",
      "Al Jazeera"
    ],
    "domains": [
      "www.washingtonpost.com",
      "www.dw.com",
      "www.aljazeera.com",
      "www.nytimes.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "The US has released video it says shows its military striking a boat near the coast of Venezuela, killing four.",
      "The US said it carried out another strike on a small boat in the Caribbean Sea, killing four people on board. Pentagon chief Pete Hegseth said \"narco-terrorists\" were the target.",
      "<p>Pentagon chief says strike – fourth by US military in recent weeks – targeted boat with ‘substantial amounts’ of drugs</p><p>The United States carried out a strike against an alleged drug-trafficking boat on Friday that killed four people, US defense secretary <a href=\"https://www.theguardian.com",
      "The U.S. strike near Venezuela is the latest in the Trump administration’s legally nebulous campaign targeting Latin American drug cartels.",
      "It was the fourth strike in the Trump administration’s legally disputed campaign targeting suspected drug runners in the Caribbean Sea."
    ],
    "image_url": "",
    "titles": [
      "US releases video of another strike on a boat near Venezuela",
      "US strikes drug alleged boat near Venezuelan waters",
      "Hegseth says four killed in US strike on alleged drug boat off Venezuelan coast",
      "U.S. kills 4 alleged drug smugglers near Venezuela, Hegseth says",
      "U.S. Military Attacked Boat Off Venezuela, Killing Four Men, Hegseth Says"
    ],
    "score_components": {
      "magnitude": 0.964,
      "recency": 0.777,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.792,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The U.S. conducted a strike in the Caribbean Sea, killing four individuals on a boat suspected of drug trafficking. This action, confirmed by Pentagon Chief Pete Hegseth, marks the fourth similar strike by the U.S. military under the Trump administration's campaign against Latin American drug cartels. The operation is part of a series targeting vessels believed to be carrying substantial amounts of drugs.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Supreme Court Backs Trump Policy, Ends Protections for 300K Immigrants",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 21:48:49 +0000",
    "source": "Al Jazeera",
    "sources": [
      "LA Times",
      "Washington Post",
      "Al Jazeera",
      "Forbes"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.washingtonpost.com",
      "www.forbes.com",
      "www.latimes.com"
    ],
    "snippets": [
      "The US court&#039;s conservative supermajority once again backed Trump&#039;s efforts to limit temporary immigration pathways.",
      "A federal judge had ruled on Sept. 5 that Homeland Security Secretary Kristi L. Noem broke the law by revoking the temporary protected status of Venezuelan and Haitian immigrants.",
      "<p>Trump's lawyers said the new administration had the right to cancel Biden's temporary protections for immigrants.</p>",
      "The Supreme Court, in a 6-3 split, granted another emergency request to revoke Temporary Protected Status to about 300,000 Venezuelans."
    ],
    "image_url": "",
    "titles": [
      "Supreme Court allows Trump to nix temporary status for Venezuelan migrants",
      "Supreme Court will let Trump end protected status for Venezuelans for now",
      "Supreme Court says again Trump may cancel temporary protections for Venezuelans granted under Biden",
      "Supreme Court Lets Trump Administration End Protections For Venezuelan Immigrants"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.805,
      "consensus": 0.908,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.767,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The US Supreme Court, with a conservative supermajority, supported the Trump administration's move to revoke Temporary Protected Status for Venezuelan and Haitian immigrants, affecting about 300,000 individuals. This decision came after a lower court had ruled that Homeland Security Secretary Kristi L. Noem's cancellation of the protections was unlawful. The court's 6-3 split decision temporarily halts the lower court's ruling.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Deputy PM Heckled at Vigil for Manchester Synagogue Attack Victims",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 21:24:36 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Washington Post",
      "Deutsche Welle",
      "Financial Times",
      "Al Jazeera"
    ],
    "domains": [
      "www.ft.com",
      "www.aljazeera.com",
      "www.washingtonpost.com",
      "www.dw.com"
    ],
    "snippets": [
      "Deputy Prime Minister David Lammy heckled by members of the public at vigil for victims of attack.",
      "Two people were killed and three seriously injured in an attack on a synagogue in Manchester on Thursday. Police said one victim may have been accidentally shot by officers, as the attacker had no firearm.",
      "More details emerge about the attacker, who had recently been arrested on suspicion of rape and bailed",
      "The police identified two people killed in an attack at a synagogue in Manchester, England, and said they were still trying to learn more about the assailant’s motives."
    ],
    "image_url": "",
    "titles": [
      "Police say one victim possibly shot by officer during Manchester attack",
      "UK synagogue attack: Police likely shot one victim",
      "Victim killed in Manchester synagogue attack was shot by police",
      "One victim in Yom Kippur synagogue attack in England was shot dead by police"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.799,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.749,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "At a vigil for victims of a Manchester synagogue attack, Deputy Prime Minister David Lammy was heckled. The attack resulted in two deaths and three serious injuries. Police stated one victim might have been accidentally shot by officers, as the attacker was unarmed. The assailant, previously arrested on suspicion of rape, had been bailed before the attack. Authorities are investigating the motive behind the incident.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Munich Airport Halts Flights Amid Drone Sightings, Affects Oktoberfest",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-10-04T06:58:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "New York Times",
      "Deutsche Welle",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.nytimes.com",
      "www.dw.com"
    ],
    "snippets": [
      "Both runways at Munich Airport had been closed for the second time in 24 hours after further \"unconfirmed drone sightings.\" A drone was earlier sighted over a nearby military facility. DW has more.",
      "The disruption comes as Munich hosts its world-famous Oktoberfest beer festival, which runs until Sunday. Last week, Denmark and Norway closed airports due to drones.",
      "<p>About 6,500 passengers stranded as interior minister says earlier drone incident a ‘wake-up call’</p><p>Munich airport was forced to halt operations for the second day in a row on Friday over drone sightings, with dozens of flights and more than 6,000 passengers affected.</p><p>Airports in Denmar",
      "The airport in Germany was the latest in Europe to shut because of drone sightings. Officials have blamed Russia, which has denied being behind the drone incursions."
    ],
    "image_url": "",
    "titles": [
      "Germany news: Munich Airport resumes flights after drone sightings",
      "Germany: Drone sightings disrupt Munich Airport",
      "Munich airport forced to suspend flights for second day in a row over drone sightings",
      "Flights Are Briefly Halted at Munich Airport After Drone Sightings"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.974,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.739,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Munich airport suspended operations due to drone sightings on Thursday evening, affecting the Oktoberfest beer festival. This led to 17 flight cancellations and disrupted nearly 3,000 travelers. This incident is part of a series of drone disruptions in European aviation, with officials blaming Russia, which has denied the accusations.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Sarah Mullally Appointed First Female Archbishop of Canterbury",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-10-03T11:22:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "New York Times",
      "Deutsche Welle",
      "Washington Post",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.nytimes.com",
      "www.washingtonpost.com",
      "www.dw.com"
    ],
    "snippets": [
      "Sarah Mullally will become the first female leader when she officially takes charge of the church in March 2026. A group of conservative Anglican churches across Africa and Asia criticized the appointment.",
      "Sarah Mullally, previously the bishop of London, is the first woman to serve as spiritual leader of the Church of England in its nearly 500-year history.",
      "Sarah Mullally, the bishop of London, has been appointed archbishop of Canterbury. She has been a vocal supporter of the rights of women in the church.",
      "<p>Former chief nursing officer for England will legally assume role at Canterbury Cathedral ceremony in January</p><p>Dame Sarah Mullally has been named as the first female leader in the history of the Church of England as Downing Street announced the 106th archbishop of Canterbury nearly a year on"
    ],
    "image_url": "",
    "titles": [
      "First female Archbishop appointed to lead Church of England",
      "First woman is named archbishop of Canterbury, leader of Church of England",
      "Sarah Mullally Is Named as First Female Archbishop of Canterbury",
      "Sarah Mullally is named as first female archbishop of Canterbury"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.648,
      "consensus": 0.908,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.729,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Sarah Mullally has been appointed as the new Archbishop of Canterbury, marking the first time a woman will lead the Church of England and its 85 million Anglicans globally. Previously the Bishop of London and a former chief nursing officer, Mullally's historic appointment follows Justin Welby's resignation last year. She is recognized for her support of women's rights within the church. Mullally will officially assume her role in a ceremony at Canterbury Cathedral in January, becoming the 106th archbishop in the Church's history.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "WNBA's Engelbert Responds to Criticism, Seeks to Mend Player Relations",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sat, 04 Oct 2025 01:16:46 +0000",
    "source": "CBS Sports",
    "sources": [
      "CityNews",
      "CBS Sports",
      "Sportsnet"
    ],
    "domains": [
      "www.cbssports.com",
      "www.sportsnet.ca",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "'Obviously, I did not make those comments,' Engelbert said",
      "Engelbert has come under significant fire this week, particularly from the players",
      "Engelbert faces blazing criticism from WNBA players, but the NBA's ownership and influence remain the central challenge to the league's future",
      "<p>WNBA commissioner Cathy Engelbert said Friday there&#8217;s work to be done to repair relationships with players in the league, while adding that there were “inaccuracies” in some of the comments attributed to her by Napheesa Collier in a blistering assessment earlier this week.</p>",
      "LAS VEGAS (AP) — WNBA Commissioner Cathy Engelbert said Friday there&#8217;s work to be done to repair relationships with players in the league, while adding that there were “inaccuracies” in some of the comments attributed to her by Napheesa Collier in a blistering assessment earlier this week. “I "
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/10/04/68ec3d3e-1822-4d6d-b484-c8c24681dbea/untitled-design-30.png",
    "titles": [
      "WNBA commissioner Cathy Engelbert denies saying Caitlin Clark needs to be 'grateful' for WNBA platform",
      "WNBA commissioner Cathy Engelbert says she won't resign: 'I've never been a quitter'",
      "WNBA commissioner Cathy Engelbert is under fire, but the NBA is the real power worth challenging",
      "WNBA commissioner Cathy Engelbert vows to repair trust after facing criticism",
      "WNBA Commissioner Cathy Engelbert vows to repair player relationships"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.866,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.71,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "WNBA Commissioner Cathy Engelbert addressed criticism from players, stating there are inaccuracies in comments attributed to her by Napheesa Collier. Engelbert acknowledged the need to repair relationships with players amid the controversy. She refuted making certain remarks and highlighted ongoing challenges, including the NBA's influence on the WNBA's future.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "US President Urges Israel to Stop Gaza Bombings Amid Peace Efforts",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 20:11:14 +0000",
    "source": "Al Jazeera",
    "sources": [
      "LA Times",
      "Washington Post",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.washingtonpost.com",
      "www.latimes.com"
    ],
    "snippets": [
      "US president tells Israel to &#039;immediately stop bombing Gaza&#039;, says Hamas ready for &#039;lasting peace&#039;.",
      "The plan aims to secure the release of Israeli hostages held in the Gaza Strip and end a two-year conflict that has reduced much of the enclave to rubble.",
      "<p>Hamas said it would agree to some parts of President Trump's peace plan, but held back on endorsing the entire initiative, which calls for it to lay down its weapons.</p>"
    ],
    "image_url": "",
    "titles": [
      "Hamas agrees to parts of Trump’s Gaza plan, seeks more talks, bombing eases",
      "Hamas accepts Trump’s plan to end the war in Gaza, but with conditions",
      "Hamas agrees to return hostages but resists other parts of Trump's peace plan"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.778,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.709,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The US President has called on Israel to halt bombings in Gaza, indicating Hamas's willingness for a 'lasting peace.' This move is part of a peace plan aimed at ending a two-year conflict and securing the release of Israeli hostages in Gaza. While Hamas agrees to aspects of the plan, it hesitates to fully endorse the proposal, particularly the demand to disarm.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Coalition Sues Over $100K H-1B Visa Fee, Claiming Excess Authority",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 22:09:43 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Financial Post",
      "Business Insider",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.businessinsider.com",
      "financialpost.com"
    ],
    "snippets": [
      "The lawsuit claims Trump does not have the authority to override the law that created the H-1B visa programme.",
      "A coalition of unions and other groups called President Donald Trump's new H-1B visa fee \"extortionate\" and \"draconian\" in a lawsuit filed Friday.",
      "SEATTLE (AP) &#8212; In what appears to be the first major challenge to the new $100,000 fee required for H-1B visa applications, a coalition of health care providers, religious groups, university professors and others filed a federal lawsuit Friday to stop the plan, saying it has &#8220;thrown empl"
    ],
    "image_url": "",
    "titles": [
      "First lawsuit filed challenging Trump’s $100,000 H-1B visa fee",
      "Trump administration's $100,000 H-1B visa fee challenged in new lawsuit",
      "Lawsuit seeks to stop Trump’s $100,000 fee for H-1B visas"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.811,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.706,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A coalition, including health care providers and university professors, filed a lawsuit to challenge a new $100,000 fee for H-1B visa applications, claiming it exceeds Trump's authority and disrupts employment. This marks a significant legal opposition to the fee imposed on the visa program designed for specialized foreign workers.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Yom Kippur Attack at Synagogue Kills 2; Israel Detains Activists, Starbucks Cuts",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 20:49:28 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Financial Times",
      "New York Times"
    ],
    "domains": [
      "www.bbc.com",
      "www.ft.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "Two Jewish people were killed in a car and stabbing attack at Heaton Park Hebrew Congregation Synagogue in Manchester on the holiest day in the Jewish religious calendar.",
      "Shocked family condemns atrocity as ‘heinous act’",
      "Japan’s beleaguered governing party will convene for a crucial election that could pave the way for the first female prime minister or the youngest leader in 140 years.",
      "Two people were killed on Yom Kippur after a driver rammed a vehicle into people in Manchester and stabbed others. One man who died was accidentally shot by the police, who also killed the attacker."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/4d22/live/aa332190-a079-11f0-b741-177e3e2c2fc7.jpg",
    "titles": [
      "What we know about the attack",
      "What we know about Manchester synagogue attacker Jihad Al-Shamie",
      "What to Know About Japan’s Leadership Election",
      "Synagogue Attack on Yom Kippur in Manchester, UK: What We Know"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.773,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.705,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Two individuals were killed in a car and stabbing attack at Heaton Park Hebrew Congregation Synagogue during Yom Kippur, with the assailant also deceased. Meanwhile, Israeli forces detained activists from several aid boats in international waters, amidst criticism of international inaction on the situation in Gaza. Additionally, Starbucks announced the closure of 1% of its North American stores, though specific locations were not disclosed.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Senators Trade for MacDermid from Devils, Seek Roster Toughness",
    "domain": "sports",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Fri, 03 Oct 2025 21:54:29 GMT",
    "source": "NHL",
    "sources": [
      "NHL",
      "Sportsnet",
      "Ottawa Citizen"
    ],
    "domains": [
      "ottawacitizen.com",
      "www.sportsnet.ca",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMikgFBVV95cUxPMFN3d3kxMmdzNk16MjJCS1lucWYxdWsxRWRaUGk3dENvd3FBQ3BlVGtaV05jdWxhcHlpSEIwUk5JdjA5XzVVR3V2WXd2T2wtX3ZXamdNWEd1a0ZVOWdOVHFESGZsLXAzT1JBaURLWjhwcUF6d1RnbnB4YTZqSnVPTTVTRGtoWWU2bmlZZjNyMkVzUQ?oc=5\" target=\"_blank\">Senators acquire Kurtis MacDe",
      "<a href=\"https://news.google.com/rss/articles/CBMilAFBVV95cUxNWEdNck9VVExkWWtIUU5oOTlYWUlTVGo4bDRNak55Y0ZSOWZJMU9JVzZZTHV6WFhTY19WSGhZUXpzczZoS1B3Wk12RzFIeGNYV3hGTV9xZU1KMC1fQ2dhbHVxam01NjdFWUczTUVKX251OWs2WDNtQ1pwX056SnBZbWVzV0cwZDJIMTJ0LTRpNGJQUnBX?oc=5\" target=\"_blank\">Senators acquire winger Kur",
      "<a href=\"https://news.google.com/rss/articles/CBMiigFBVV95cUxQX2F0Nk83YWQtRUJzQTJkMFV5ekpDd3lzNDI5eWktZ2QxVGg4a2tIMFBmMnlZeHpTVEpSbjJ4WjlPcVh1TURIWmg0LXJYanNNZkNxak5ibjJQeXVuM0dybDBhbmFkcFNwNDdGWW9sVW44WU10Z2d5QjVNaEVJMVhiOWdWZFlGb3pTTkE?oc=5\" target=\"_blank\">Devils Acquire MacEwen from Ottawa | REL",
      "<p>The Ottawa Senators added some depth on Friday, acquiring veteran enforcer Kurtis MacDermid from the New Jersey Devils in exchange for Zack MacEwen.</p>",
      "The Ottawa Senators have served notice to the Atlantic Division that they won&#8217;t be pushed around. After taking it on the chin from the Montreal Canadiens in a 5-0 loss on Tuesday in Quebec City, the Senators served notice on Friday night that they won&#8217;t stand still by acquiring Kurtis Ma"
    ],
    "image_url": "",
    "titles": [
      "Senators acquire Kurtis MacDermid in trade with Devils - NHL.com",
      "Senators acquire winger Kurtis MacDermid from New Jersey - NHL.com",
      "Devils Acquire MacEwen from Ottawa | RELEASE | New Jersey Devils - NHL.com",
      "Senators acquire Kurtis MacDermid from Devils in exchange for Zack MacEwen",
      "Ottawa Senators add muscle by acquiring Kurtis MacDermid from Devils"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.79,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.702,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Ottawa Senators acquired winger Kurtis MacDermid from the New Jersey Devils in exchange for Zack MacEwen, aiming to add depth and toughness to their roster. This move comes after a significant 5-0 loss to the Montreal Canadiens, signaling the Senators' intent to enhance their competitiveness in the Atlantic Division.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Wigan Warriors Beat Leigh Leopards 18-6, Eye Third Straight Super League Title",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 21:09:19 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Sky Sports",
      "The Guardian"
    ],
    "domains": [
      "www.bbc.com",
      "www.skysports.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Bevan French keeps Wigan on course for a hat-trick of Super League titles as the Warriors see off Leigh Leopards to reach the Grand Final.",
      "<ul><li><p>Super League playoff semi-final: Wigan 18-6 Leigh</p></li><li><p>Wigan grateful to Jai Field’s amazing second-half tackle</p></li></ul><p>It was a week which began with unexpected controversy and the prospect of this game not even taking place. But, in the end, there was an all too famili",
      "Wigan Warriors booked a spot in the Super League Grand Final with an 18-6 victory over neighbours Leigh Leopards at The Brick Community Stadium."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/6c84/live/89979f10-a092-11f0-b1b3-b903aa8071ae.jpg",
    "titles": [
      "French double books Grand Final return for Wigan",
      "French sees off Leigh to put Wigan in Grand Final after week of acrimony",
      "Wigan book spot in Grand Final with victory over Leigh"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.778,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.699,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Wigan Warriors advanced to the Super League Grand Final after defeating Leigh Leopards 18-6, keeping their hopes for a third consecutive title alive. Key contributions included Bevan French's performance and Jai Field's crucial second-half tackle. The match, held at The Brick Community Stadium, followed a week of controversy but ultimately proceeded as planned.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Justice Dept. Urges Apple to Remove ICE Tracking Apps, Citing Risks",
    "domain": "technology",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Fri, 03 Oct 2025 21:57:46 GMT",
    "source": "CNBC",
    "sources": [
      "Ars Technica",
      "TechCrunch",
      "CNBC"
    ],
    "domains": [
      "arstechnica.com",
      "www.cnbc.com",
      "techcrunch.com"
    ],
    "snippets": [
      "Joshua Aaron has said he created ICEBlock after seeing the Trump administration's deportation efforts, which he said evoked events in Nazi Germany.",
      "The app, which went viral earlier this year, allowed users to lawfully share information about where they've seen ICE agents within a 5-mile radius of their location, and also share details of the clothing agents are wearing.",
      "Apple nixes tracking apps after Trump admin claimed they put ICE agents at risk."
    ],
    "image_url": "",
    "titles": [
      "Creator of ICE agent tracking app asks Apple to rescind ban from online store",
      "Apple removes ICEBlock and similar tracking apps from the App Store",
      "Apple removes ICEBlock, won’t allow apps that report locations of ICE agents"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.791,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.695,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Justice Department requested Apple to remove ICEBlock and similar apps, arguing they pose security risks to ICE agents by allowing users to share their locations and clothing details. Following these concerns, Apple has removed these tracking apps, which had gained popularity for enabling users to lawfully report sightings of ICE agents.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "MacIntyre Tied for Lead at Alfred Dunhill Amid Storm Amy Disruption",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sat, 04 Oct 2025 03:53:40 +0000",
    "source": "CBS Sports",
    "sources": [
      "Sky Sports",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "www.skysports.com"
    ],
    "snippets": [
      "MacIntyre has continued his hot play from the Ryder Cup back in Europe",
      "Robert MacIntyre holds the joint lead of the Alfred Dunhill Links Championship as play was suspended after Storm Amy wrought havoc on Friday."
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/10/04/0e87bacf-93eb-4139-a6af-58b96be2909d/robert-macintyre-dunhill.jpg",
    "titles": [
      "Robert MacIntyre leads 2025 Alfred Dunhill Links Championship with Matt Fitzpatrick, Tommy Fleetwood in mix",
      "MacIntyre in share of lead at Alfred Dunhill Links as play suspended"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.914,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.638,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Robert MacIntyre, following his impressive performance at the Ryder Cup, is currently tied for the lead at the Alfred Dunhill Links Championship. The tournament's play was halted due to the disruption caused by Storm Amy.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Aces Rally to Beat Mercury 89-86 in WNBA Finals Game 1",
    "domain": "business",
    "source_domain": "www.forbes.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 23:10:51 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.forbes.com"
    ],
    "snippets": [
      "The Las Vegas Aces take game one of the WNBA Finals over the Phoenix Mercury. Historically, teams that win the first game of the series overwhelmingly win the WNBA title.",
      "<p>The Aces series-opening win against the Mercury was an appetizer into how these teams, and in particular, how A&#8217;ja Wilson and Alyssa Thomas could match up for the rest of the series.</p>\n<p>Kai Gammage covers that and more in his takeaways from Game 1 of the WNBA Finals.</p>"
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/68e08548bcce3a7678d08a7b/0x0.jpg?width=960",
    "titles": [
      "Las Vegas Aces Take WNBA Finals Game One Over The Phoenix Mercury",
      "WNBA Finals Game 1 Takeaways: Wilson, Aces get upper hand vs. Thomas, Mercury"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.901,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.635,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Las Vegas Aces rallied in the fourth quarter to defeat the Phoenix Mercury 89-86 in Game 1 of the WNBA Finals in Las Vegas. After trailing for most of the game, the Aces' late surge secured them the opening victory. Historically, winning the first game significantly increases a team's chances of claiming the WNBA title.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Super Bowl XLVII Winner Arthur Jones Passes Away",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sat, 04 Oct 2025 02:53:30 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sports Illustrated"
    ],
    "domains": [
      "www.cbssports.com",
      "news.google.com"
    ],
    "snippets": [
      "Jones was a key member of the Ravens' Super Bowl XLVII-winning team and the older brother of Jon and Chandler Jones",
      "<a href=\"https://news.google.com/rss/articles/CBMijAFBVV95cUxNWG82U1NneXZOWVpyQ0d6akk1ckVWeWxheEtraWFDa1BXeFpOZ3dud2o2b0V2WmRLNVdHZjBvdl94VWRUUTlKaXVGcF9qM0xkSTRLNmt3cTN0RUpWMjJXNzBsSElZODJPY3NQV0duRGtZVnZlcU9LTFIwU1JSempibWkyaGFSSVdwckcyYw?oc=5\" target=\"_blank\">Arthur Jones, Super Bowl Champion Def"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/10/03/ffc61181-6954-4f35-842e-9f97dd419481/arthur-jones-ravens.jpg",
    "titles": [
      "Arthur Jones dies at 39: Former Super Bowl winning defensive tackle for Baltimore Ravens passes away",
      "Arthur Jones, Super Bowl Champion Defensive Tackle With Ravens, Dies at 39 - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.895,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.634,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Arthur Jones, a key member of the Ravens' Super Bowl XLVII-winning team and the older brother of Jon and Chandler Jones, has been reported as deceased. Jones had a successful career in the NFL and was well-regarded by his teammates and fans.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Drone Kills Journalist in Ukraine, a First: European Federation",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-10-03T19:38:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "New York Times",
      "Deutsche Welle"
    ],
    "domains": [
      "www.nytimes.com",
      "www.dw.com"
    ],
    "snippets": [
      "The European Federation of Journalists said Antoni Lallican's death marks the first time a journalist had been killed by a drone in the Ukraine conflict.",
      "Antoni Lallican, a Paris-based photographer, is the first working journalist to be killed by a remotely piloted drone during the war, according to press associations."
    ],
    "image_url": "",
    "titles": [
      "Ukraine: French photojournalist killed by Russian drone",
      "French Photojournalist Killed in Drone Attack in Ukraine"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.769,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.623,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Antoni Lallican, a Paris-based photographer, became the first journalist to be killed by a drone in the Ukraine conflict, as confirmed by the European Federation of Journalists. This incident marks a tragic milestone in the war, highlighting the dangers journalists face while reporting.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UK EV Sales Hit Record in September, Over Half of New Cars Electric or Hybrid",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 04 Oct 2025 00:41:12 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "www.bbc.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Sales of fully electric or hybrid vehicles made up more than half of all new car registrations in the UK last month.",
      "<p>EVs rise nearly a third in September compared with a year earlier, as plug-in hybrids jump by 56%</p><p>British electric car sales hit a record high in September as new taxpayer subsidies helped to attract buyers in the most important month for the market.</p><p>Battery EV sales rose by nearly a "
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/e058/live/ac7c44b0-a06d-11f0-8687-4726d7177866.jpg",
    "titles": [
      "Sales of electric cars hit record high in September",
      "UK electric car sales hit record high as taxpayer subsidies help attract buyers"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.837,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.622,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "In September, the UK saw a record high in electric vehicle (EV) sales, with fully electric and hybrid vehicles comprising over half of all new car registrations. This surge, nearly a third higher for EVs and a 56% increase for plug-in hybrids compared to the previous year, was significantly boosted by new taxpayer subsidies, marking September as a pivotal month for the market.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Jihad Al-Shamie Attacks Synagogue, Was on Bail for Prior Alleged Crime",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 22:02:32 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "www.bbc.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Counter terror police also say Al-Shamie may have been influenced by \"extreme Islamist ideology\".",
      "<p>Exclusive: Jihad al-Shamie had been under investigation over alleged sexual attack earlier this year, sources say</p><p>The Manchester synagogue terrorist was on police bail for an alleged rape when he carried out the attack, the Guardian can reveal.</p><p>Jihad al-Shamie, 35, was being investiga"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/7014/live/b50aaa10-a09d-11f0-85af-1377c963b9be.jpg",
    "titles": [
      "Synagogue attacker was on bail after rape arrest, police say",
      "Manchester synagogue terrorist was on bail for alleged rape"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.792,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.62,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Jihad Al-Shamie, who attacked individuals at the Heaton Park Congregation synagogue in northwestern England, had previously been under investigation for an alleged sexual attack. He was known as a weightlifting enthusiast who kept to himself. Despite the ongoing investigation, he was released on bail prior to the synagogue attack.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Bournemouth Beats Fulham 3-1, Climbs to Second in Premier League",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 21:29:54 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Sky Sports"
    ],
    "domains": [
      "www.bbc.com",
      "www.skysports.com"
    ],
    "snippets": [
      "Antoine Semenyo nets twice and Justin Kluivert scores a screamer as Bournemouth come from behind to beat Fulham in stormy conditions and move up to second in the Premier League table.",
      "Pieces of individual brilliance from Antoine Semenyo and Justin Kluivert helped Bournemouth come from behind against Fulham to climb up to second in the Premier League."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/8cf8/live/da102220-a09f-11f0-b741-177e3e2c2fc7.jpg",
    "titles": [
      "Semenyo scores twice as Bournemouth beat Fulham",
      "Semenyo and Kluivert stunners send Bournemouth second after Fulham comeback"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.783,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.612,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Antoine Semenyo scored twice and Justin Kluivert netted a spectacular goal as Bournemouth overcame a 1-0 deficit to defeat Fulham 3-1 in challenging weather conditions. This victory propelled Bournemouth to second place in the Premier League standings.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Met Police Sergeant Arrested for Allegedly Perverting Justice After Footage Leak",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 20:01:51 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "www.bbc.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "The officer has been bailed and suspended from duty, the Met police says.",
      "<p>Sergeant arrested on suspicion of perverting course of justice after colleagues filmed making racist and sexist remarks </p><p>A serving Metropolitan police officer has been arrested on suspicion of perverting the course of justice, after undercover footage showed colleagues at Charing Cross poli"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/9a45/live/91b67a90-a092-11f0-b1b3-b903aa8071ae.jpg",
    "titles": [
      "Serving Met police officer arrested after BBC Panorama investigation",
      "Metropolitan police officer arrested after undercover BBC investigation"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.76,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.607,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A Metropolitan police sergeant was arrested and suspended from duty on suspicion of perverting the course of justice, following the release of undercover footage showing colleagues at Charing Cross police station making racist and sexist remarks. The officer has been bailed.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Mets Overhaul Staff, Bench Coach Gibbons Exits Amid Changes",
    "domain": "sports",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Fri, 03 Oct 2025 17:27:16 GMT",
    "source": "Sports Illustrated",
    "sources": [
      "Sportsnet",
      "Sports Illustrated"
    ],
    "domains": [
      "www.sportsnet.ca",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMiigFBVV95cUxNM1RiQ2t3ZFJvT093OTVLbkZsT3FERmFfWDlTeUEwdGo0MmphM1NiNzhkQ0tIQUY5NXQwMUJMNVZwVENsZ1pXZGp5ajFxV1JWaEtKRHR2Y3hmSE5IYUh5YnhldWpUbU1xbGVrSTdSb2NZUjFFMWQ0SlZvbWJtM051d3dCYmtFUlFZU1E?oc=5\" target=\"_blank\">Mets to Overhaul Coaching Staff After Se",
      "<p>A popular Toronto baseball man will be looking for a new job. John Gibbons told the New York Mets he is leaving his role as bench coach as part of a large overhaul of the team&#8217;s coaching staff, the team announced Friday.</p>"
    ],
    "image_url": "",
    "titles": [
      "Mets to Overhaul Coaching Staff After Season Collapse - Sports Illustrated",
      "John Gibbons out as bench coach as Mets overhaul coaching staff"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.72,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.599,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The New York Mets, after not making the playoffs despite having the MLB's highest payroll, are overhauling their staff. John Gibbons, the bench coach, announced his departure from the team as part of this major shake-up.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Jets Rally to Beat Flames 5-4 in Shootout, Pearson Scores Winner",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sat, 04 Oct 2025 04:32:18 +0000",
    "source": "Global News",
    "sources": [
      "Global News"
    ],
    "domains": [
      "globalnews.ca"
    ],
    "snippets": [
      "The Jets rallied from an early three-goal deficit to win their final exhibition game over the Calgary Flames 5-4 in a shootout.",
      "Tanner Pearson scored the winner in the seventh round of a shootout as the visiting Winnipeg Jets erased a 4-2 third-period deficit to beat the Calgary Flames 5-4 in NHL pre-season action on Friday at Scotiabank Saddledome."
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/JETS-CAMP.jpg?quality=65&strip=all",
    "titles": [
      "Winnipeg Jets end pre-season with 5-4 shootout win in Calgary",
      "Jets rally to beat Flames 5-4 in shootout"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.926,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.503,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Winnipeg Jets overcame a 4-2 third-period deficit to defeat the Calgary Flames 5-4 in a shootout during their final pre-season game. Tanner Pearson scored the winning goal in the seventh round of the shootout at Scotiabank Saddledome.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]