[
  {
    "title": "Breakthrough Deal Aims to End Gaza Conflict; Troops Withdrawal Planned",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Thu, 09 Oct 2025 13:12:52 +0000",
    "source": "Al Jazeera",
    "sources": [
      "The Guardian",
      "CNBC",
      "Washington Post",
      "New York Times",
      "LA Times",
      "Al Jazeera",
      "Deutsche Welle"
    ],
    "domains": [
      "www.theguardian.com",
      "www.dw.com",
      "www.aljazeera.com",
      "www.nytimes.com",
      "www.washingtonpost.com",
      "www.cnbc.com",
      "www.latimes.com"
    ],
    "snippets": [
      "Ceasefire to go into effect within 24 hours of Israel&#039;s cabinet ratifying the deal tonight, says Israeli government.",
      "Negotiators for Israel and Hamas have agreed to pause fighting in Gaza to release the remaining hostages in exchange for Palestinian prisoners, adopting parts of a plan backed by US President Trump. Follow DW for more.",
      "Trump announced that Israel and Hamas had agreed on the first phase of a peace plan which could put an end to the two-year war and free hostages.",
      "<p>Donald Trump announces all hostages will be released ‘very soon’ and Israel will withdraw troops to an agreed timeline</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/oct/09/gaza-ceasefire-live-trump-says-hostages-probably-released-monday-idf-says-gaza-city-still-extremely-dang",
      "The ceasefire deal’s initial phase, if implemented, would halt fighting in Gaza to release hostages in exchange for Israel’s release of Palestinian prisoners.",
      "Israel said a truce would take effect on Friday and start a 72-hour window to exchange hostages and prisoners. President Trump said he might travel to the region this weekend.",
      "<p>Israel and Hamas agreed to the first phase of a deal involving an exchange of Israeli hostages and Palestinian detainees.</p>"
    ],
    "image_url": "",
    "titles": [
      "Israel confirms signing phase one of Gaza ceasefire deal with Hamas",
      "Israel, Hamas sign off on phase 1 of Gaza plan",
      "Israel, Hamas agree to first phase of Gaza peace plan, allowing release of hostages and prisoners",
      "First phase of ceasefire deal to end war in Gaza agreed by Israel and Hamas",
      "Live updates: Israel and Hamas sign first phase of Gaza ceasefire deal that would release hostages",
      "Live Updates: Israel-Hamas Deal Paves Way for Gaza Cease-Fire",
      "Celebrations erupt over Israel-Hamas ceasefire in Gaza"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.939,
      "consensus": 1.0,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.848,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A breakthrough deal has been announced, potentially ending the war in Gaza, marking the cessation of the bloodiest fighting between Israelis and Palestinians. Qatar, acting as mediator, confirmed details will follow. U.S. President Donald Trump stated all hostages will be released imminently, and Israel will withdraw troops to a specified line. Trump also hinted at a possible visit to the Middle East soon. This agreement represents the \"first phase\" of a peace plan, with a senior Hamas official indicating an end to the conflict is \"imminent.\"",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Proposes Gaza Ceasefire Plan, Plans Trip to Support Talks",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 09 Oct 2025 14:47:19 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "Al Jazeera",
      "BBC",
      "ABC News"
    ],
    "domains": [
      "www.aljazeera.com",
      "abcnews.go.com",
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Israel's security cabinet are expected to meet at 17:00 Israel time (15:00 BST) to formally vote on the first phase of the plan.",
      "There are celebrations in the occupied Palestinian territories and in Israel after a ceasefire deal.",
      "Last month, President Donald Trump proposed a 20-point plan for a ceasefire in the Gaza Strip ahead of this week's negotiations in Egypt.",
      "<p>Donald Trump says Israel and Hamas have reached a deal to pause fighting and release some hostages and prisoners</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/oct/09/first-phase-of-ceasefire-deal-to-end-war-in-gaza-agreed-by-israel-and-hamas\">Full story: First phase of ceasefire d"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/2a19/live/c6434b00-a4ff-11f0-928c-71dbb8619e94.jpg",
    "titles": [
      "What has been agreed - and what happens next",
      "There’s a Gaza ceasefire deal – but what happens next?",
      "What to know about the proposed Israel-Hamas Gaza ceasefire and next steps",
      "Gaza ceasefire deal: what has been agreed for first phase and why now?"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.95,
      "consensus": 0.908,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.806,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "U.S. President Donald Trump proposed a 20-point ceasefire plan for the Gaza Strip before negotiations in Egypt. This plan includes an expected exchange of hostages and prisoners. Israeli Prime Minister Benjamin Netanyahu plans to convene his cabinet to approve the agreement, and President Trump is considering a trip to the region to support the process.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: plan, support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "László Krasznahorkai Wins 2025 Nobel Prize in Literature",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 09 Oct 2025 12:29:09 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC",
      "Deutsche Welle",
      "Le Monde"
    ],
    "domains": [
      "www.theguardian.com",
      "www.lemonde.fr",
      "www.dw.com",
      "www.bbc.com"
    ],
    "snippets": [
      "He was recognised “for his compelling and visionary oeuvre that, in the midst of apocalyptic terror, reaffirms the power of art”.",
      "Krasznahorkai became the 122nd recipient of the prize, which has been given out with few exceptions since 1901. Celebrated both at home and abroad, he is famous for his dystopian novels depicting life in rural Hungary.",
      "Tenu pour un « maître de l’apocalypse », le romancier, né en 1954, se voit distingué vingt-trois ans après son compatriote Imre Kertesz.",
      "<p>The Hungarian novelist whose books ‘reaffirm the power of art’ was announced as winner at a ceremony in Stockholm<br />• <a href=\"https://www.theguardian.com/books/live/2025/oct/09/nobel-prize-in-literature-2025-live\">Nobel prize in literature 2025 live: László Krasznahorkai wins ‘for his compell"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/194a/live/f91c69d0-a4ff-11f0-9156-136a18fa2a3c.jpg",
    "titles": [
      "Hungarian author László Krasznahorkai wins Nobel Literature Prize",
      "Nobel Prize in literature goes to Laszlo Krasznahorkai of Hungary",
      "Le prix Nobel de littérature 2025 a été attribué à l’écrivain hongrois Laszlo Krasznahorkai",
      "László Krasznahorkai wins the Nobel prize in literature 2025"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.906,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.777,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Hungarian novelist László Krasznahorkai, aged 71, was awarded the Nobel Prize in Literature 2025 for his \"compelling and visionary oeuvre\" that explores apocalyptic themes while affirming the power of art. Known for his dystopian novels set in rural Hungary, Krasznahorkai became the 122nd recipient of the prestigious award, announced in Stockholm.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Colombian Boat Bombed by US in Anti-Drug Effort, President Claims",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 09 Oct 2025 15:20:59 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "New York Times",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "www.nytimes.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The White House calls the allegation \"baseless\" as the US Senate rejected a measure to bar Trump from using force against the boats.",
      "<a href=\"https://news.google.com/rss/articles/CBMie0FVX3lxTE50MFpHMVllcnJfTjVpZXF1endKV1JPeU10MkdWU2xwYlRZc2pWdHhOeTBrS1EzbzZKMWltYXFNS2JsdkphZVBVUl9Mc1pRSDNVYThkb2ZjcURRTzVwVXVRUFMwa05McFVRX3d6YUd2bDRYb3kwbWRYc21oSQ?oc=5\" target=\"_blank\">Colombia president claims U.S. bombed Colombian boat in strik",
      "The Trump administration has said that it is attacking boats and killing their occupants because they are smuggling drugs from Venezuela to the United States."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/4f8e/live/a6b717d0-a527-11f0-92db-77261a15b9d2.jpg",
    "titles": [
      "Colombia's president says boat struck by US was carrying Colombians",
      "Colombia president claims U.S. bombed Colombian boat in strike off Venezuela - Axios",
      "Colombia’s President Says Boat Bombed by U.S. Was Carrying Colombians"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.961,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.746,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Colombian president claimed that a boat from Colombia was bombed by the U.S. as part of the Trump administration's efforts to combat drug smuggling from Venezuela to the United States. This action is part of a broader strategy to target vessels believed to be transporting drugs.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Yankees Miss World Series for 16th Year After Loss to Toronto",
    "domain": "sports",
    "source_domain": "www.nbcsports.com",
    "location": "national",
    "published": "Thu, 09 Oct 2025 15:45:25 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Sportsnet",
      "Yahoo Sports"
    ],
    "domains": [
      "www.nbcsports.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "New York’s 16th consecutive season without a World Series championship ended with a 5-2 loss to Toronto, which won the AL Division Series 3-1 and advanced to a matchup against Seattle or Detroit for the American League pennant.",
      "<p>Aaron Judge&#8217;s historic season and huge October weren&#8217;t enough for the New York Yankees, whose last World Series title has become a distant memory.</p>"
    ],
    "image_url": "",
    "titles": [
      "Aaron Judge remains without World Series ring as Yankees’ title drought reaches 16 years",
      "Judge remains ringless as Yankees’ title drought reaches 16 years"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.99,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.703,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The New York Yankees' season concluded without a World Series championship for the 16th straight year, following a 5-2 defeat to Toronto in the AL Division Series. Toronto advances to face either Seattle or Detroit for the American League pennant. Despite Aaron Judge's historic season, the Yankees were unable to secure a victory.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Aces Take 2-0 Series Lead as Wilson Shines, Sabally Injured",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Thu, 9 Oct 2025 09:42:47 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "Everything that happened in Game 3, including A'ja Wilson's historic night and Satou Sabally's injury.",
      "<p>Though the Phoenix Mercury fought admirably, A&#8217;ja Wilson&#8217;s inevitability prevailed in the final seconds. Now the WNBA great and her Las Vegas Aces are one win away from history. </p>"
    ],
    "image_url": "",
    "titles": [
      "WNBA Finals Game 3 takeaways: How Aces beat Mercury to go up 3-0",
      "WNBA Finals Game 3 Takeaways: Aces on brink of dynasty after last-second win"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.949,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.67,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "In Game 3 of the series, A'ja Wilson had a historic night, contributing significantly to the team's performance. However, the game was also marked by Satou Sabally's injury. Despite these events, the Aces secured a 2-0 lead in the series. The next game is set to take place in Phoenix.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Breakthrough Deal Aims to End Gaza Conflict; Troops Withdrawal Planned",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Thu, 09 Oct 2025 14:03:02 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Washington Post",
      "Al Jazeera"
    ],
    "domains": [
      "www.washingtonpost.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "In the first phase of the ceasefire plan, Israel will remain in control of nearly 60 percent of the Gaza Strip.",
      "Video from inside a negotiating room in Egypt shows Qatari, Turkish and Egyptian officials along with Hamas officials.",
      "A senior Hamas official said late Wednesday that an agreement to end the war in Gaza was “imminent.”"
    ],
    "image_url": "",
    "titles": [
      "Map of Gaza shows how Israeli forces will withdraw under ceasefire deal",
      "Video shows negotiators ahead of Gaza ceasefire deal",
      "Trump, Hamas officials say Gaza ceasefire deal ‘very close’"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.955,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.663,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A breakthrough deal has been announced, potentially ending the war in Gaza, marking the cessation of the bloodiest fighting between Israelis and Palestinians. Qatar, acting as mediator, confirmed details will follow. U.S. President Donald Trump stated all hostages will be released imminently, and Israel will withdraw troops to a specified line. Trump also hinted at a possible visit to the Middle East soon. This agreement represents the \"first phase\" of a peace plan, with a senior Hamas official indicating an end to the conflict is \"imminent.\"",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Putin Admits Russia Downed Azerbaijani Jet, Pledges Compensation",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Thu, 09 Oct 2025 14:18:13 +0000",
    "source": "Al Jazeera",
    "sources": [
      "CityNews",
      "Al Jazeera"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Putin told Azerbaijan&#039;s Aliyev that Russia will provide &#039;compensation&#039; for the deadly crash caused by its air defences.",
      "MOSCOW (AP) — President Vladimir Putin said Thursday that Russia’s air defense were to blame for downing an Azerbaijani jetliner in December that killed 38 people, his first admission of responsibility for the crash in an effort to ease tensions between the neighbors. Putin said the missiles fired b"
    ],
    "image_url": "",
    "titles": [
      "Putin admits Russian role in 2024 Azerbaijani jet crash, offers redress",
      "Putin says Russian air defenses were to blame for Azerbaijani jet’s crash last year, killing 38"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.96,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.654,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "President Vladimir Putin admitted Russia's air defenses were responsible for downing an Azerbaijani jetliner in December, resulting in 38 deaths. He pledged compensation to Azerbaijan, aiming to soothe tensions between the two countries. This marks Putin's first acknowledgment of Russia's role in the incident.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Blue Jays Beat Yankees 5-2, Reach ALCS First Time Since 2016",
    "domain": "sports",
    "source_domain": "www.nbcsports.com",
    "location": "national",
    "published": "Thu, 09 Oct 2025 15:52:43 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Sportsnet",
      "Yahoo Sports"
    ],
    "domains": [
      "www.nbcsports.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Forget the preseason prognostications. Vladimir Guerrero Jr. and the worst-to-first Toronto Blue Jays believe they’re as good as anybody. Hard to argue after the way they dispatched Aaron Judge and the powerful New York Yankees in their AL Division Series.",
      "<p>Nathan Lukes knocked a two-run single and the Toronto Blue Jays bullpen allowed just six New York Yankees hits as they took a 5-2 win to advance to the American League Championship Series for the first time since 2016.</p>",
      "<p>Riley Greene and Javier Baez each homered as part of a four-run sixth inning to lead the Detroit Tigers to a 9-3 victory over the Seattle Mariners.</p>",
      "<p>Kyle Schwarber was dominant at the plate with two home runs, JT Realmuto hit a solo shot of his own, and Trea Turner finished with three hits and two RBIs to lead the Philadelphia Phillies to an 8-2 win over the Los Angeles Dodgers.</p>",
      "<p>The Chicago Cubs put up a 4-spot in the first inning vs. Quinn Priester and the Brewers, then hang on for the 4-3 victory to keep their season alive and force a Game 4.</p>"
    ],
    "image_url": "",
    "titles": [
      "Vladimir Guerrero Jr. and Blue Jays set up nicely for ALCS after putting away Yankees in Game 4",
      "MLB Game 4 Highlights: Blue Jays 5, Yankees 2",
      "MLB Game 4 Highlights: Tigers 9, Mariners 3",
      "MLB Game 3 Highlights: Phillies 8, Dodgers 2",
      "MLB Game 3 Highlights: Cubs 4, Brewers 3"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.992,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.653,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Toronto Blue Jays defeated the New York Yankees 5-2, advancing to the American League Championship Series for the first time since 2016, thanks to Nathan Lukes' two-run single and their bullpen's strong performance. Meanwhile, the baseball postseason continues with seven teams remaining, as the Cubs and Phillies force Game 4s in the NLDS, tightening the competition.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Experts Release NFL Week 6 Predictions and $44K Parlay Tips",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Thu, 09 Oct 2025 15:34:04 +0000",
    "source": "CBS Sports",
    "sources": [
      "Bleacher Report",
      "CBS Sports"
    ],
    "domains": [
      "news.google.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "SportsLine's top NFL experts reveal their NFL picks, NFL predictions, NFL betting tips and NFL best bets for Week 6",
      "SportsLine's computer simulation model has locked in a $10 5-leg NFL Week 6 parlay that pays well over $44,000",
      "SportsLine expert Eric Cohen reveals his score predictions for all 15 games in Week 6 of the NFL schedule",
      "<a href=\"https://news.google.com/rss/articles/CBMifkFVX3lxTE5VVVdmXy16MmM5TlJENXZXQnd0T01wQXg1Nm5ZejhzVW5DOTV3VkF6U2oyVmM0X3daLVFLZ3RpY2FOcjJTbHFvRUNtWS1nMERjVFpJTW9faHFvS2lCc2ZIYXloV05RRUpTS0pFSWc5bnNWMFBGYkpnLUUwUnJydw?oc=5\" target=\"_blank\">2025 NFL Week 6 Expert Picks</a>&nbsp;&nbsp;<font color=\"",
      "After 10,000 simulations, SportsLine's model reveals its top Week 6 NFL 25-1 football parlay",
      "SportsLine's advanced model has locked in its Week 6 NFL betting picks from 10,000 simulations"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/26/bbf9251a-71fa-4e7a-83d4-b15fb46de5a7/cam-ward-tennessee-titans-imagn-images.jpg",
    "titles": [
      "NFL picks this week, odds, lines, bets: Week 6, 2025 expert predictions against the spread, parlay, prop bets",
      "NFL longshot picks, 2025 Week 6 odds, player props: This parlay would return well over $44,000 on a $10 bet",
      "2025 Week 6 NFL score predictions, bets, odds, picks today: Expert reveals exact scores for all 15 games",
      "2025 NFL Week 6 Expert Picks - Bleacher Report",
      "2025 Week 6 NFL picks, odds, best bets from advanced model: This 5-leg football parlay pays 25-1",
      "Week 6 NFL odds, lines, betting picks, spreads: 2025 predictions: Proven model backs Cowboys, Buccaneers"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.986,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.652,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "SportsLine's top NFL experts and an advanced computer simulation model have released their predictions, betting tips, and a $10 5-leg NFL Week 6 parlay with a payout of over $44,000. Expert Eric Cohen has also shared his score predictions for all 15 games of Week 6. The model, after running 10,000 simulations, has identified its top Week 6 NFL 25-1 football parlay.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Government Implements Compensation, Accepts Most Post Office Inquiry Recommendat",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 09 Oct 2025 16:00:32 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Responding to the first stage of the inquiry into the scandal, the government said it had accepted all but one of the recommendations.",
      "<p>Government response to two-year inquiry’s initial findings describes steps such as funding claimants’ legal advice as ‘crucial’ to bring justice</p><p></p><p>Compensation schemes for victims of the <a href=\"https://www.theguardian.com/uk-news/post-office-horizon-scandal\">Post Office Horizon IT sc"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/a196/live/d4a0ecd0-a4fe-11f0-9779-cd87a9626924.jpg",
    "titles": [
      "All Post Office Horizon victims entitled to free legal advice for first time",
      "Post Office Horizon IT scandal victims get new appeals process and funded advice"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.975,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.65,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The government has accepted all but one recommendation from the first stage of a two-year inquiry into the Post Office Horizon IT scandal. It described funding legal advice for claimants as crucial for justice and is implementing compensation schemes for victims.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "SportsLine Releases Predictions for College Football, MLB, and NFL Games",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Thu, 09 Oct 2025 15:09:21 +0000",
    "source": "CBS Sports",
    "sources": [
      "Yahoo Sports",
      "CBS Sports"
    ],
    "domains": [
      "www.covers.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "The SportsLine Projection Model has revealed its Southern Miss vs. Georgia Southern picks for Thursday",
      "The SportsLine Projection Model has revealed its Jacksonville State vs. Sam Houston picks for Thursday night on CBS Sports Network",
      "The SportsLine Projection Model has revealed its East Carolina Pirates vs. Tulane Green Wave picks for Thursday",
      "The SportsLine Projection Model has revealed its Louisiana Tech vs. Kennesaw State picks for Thursday night",
      "SportsLine's model simulated Philadelphia vs. Los Angeles 10,000 times and revealed its MLB picks for Thursday's National League Division Series Game 4 matchup at Dodger Stadium in Los Angeles",
      "The SportsLine projection model has revealed its Philadelphia vs. New York picks for the 2025 NFL Week 6 'Thursday Night Football' game",
      "Take Houston's spread for Saturday's pick, odds & prediction against struggling Oklahoma State on Saturday, October 11."
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2024/12/16/580e30c7-fd2e-4219-bc0f-50c4852c4a31/jc-french-cbs.jpg",
    "titles": [
      "Southern Miss vs. Georgia Southern prediction, odds, line: 2025 college football Week 7 picks by proven model",
      "Jacksonville State vs. Sam Houston prediction, odds, line, time: 2025 college football Week 7 picks by model",
      "East Carolina vs. Tulane prediction, odds, line, time: 2025 college football Week 7 picks from proven model",
      "Louisiana Tech vs. Kennesaw State prediction, odds, line, time: 2025 college football Week 7 picks from model",
      "Phillies vs. Dodgers prediction, odds, time: 2025 MLB playoff betting picks for NLDS Game 4 by proven model",
      "Eagles vs. Giants prediction, odds, start time: 2025 NFL Week 6 Thursday Night Football picks by proven model",
      "Houston vs Oklahoma State Prediction, Picks & Odds for October 11 — College Football Week 7"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.977,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.65,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The SportsLine Projection Model has released its predictions for several sporting events, including college football matchups between Southern Miss vs. Georgia Southern, Jacksonville State vs. Sam Houston, East Carolina Pirates vs. Tulane Green Wave, and Louisiana Tech vs. Kennesaw State, all scheduled for Thursday. Additionally, it provided picks for the MLB National League Division Series Game 4 between Philadelphia and Los Angeles, and for the 2025 NFL Week 6 Thursday Night Football game between Philadelphia and New York. Furthermore, it recommended taking Houston's spread against Oklahoma ",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "US Announces First Phase of Gaza Peace Plan; Hostages to be Released",
    "domain": "business",
    "source_domain": "www.ft.com",
    "location": "global",
    "published": "Thu, 09 Oct 2025 10:47:19 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times",
      "New York Times"
    ],
    "domains": [
      "www.ft.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "Deal would be foreign-policy success but ending war requires president to keep pushing for tough negotiations between Israel and Hamas",
      "Israel and Hamas have reached an agreement to release hostages and prisoners. Our colleague Jodi Rudoren explains this critical moment."
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F1ee38164-455b-4519-a6f7-e874fec81cca.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Trump’s Gaza breakthrough is just the start",
      "A Gaza Breakthrough"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.874,
      "consensus": 0.591,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.65,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The US, under President Donald Trump, announced the first phase of a peace plan for Gaza, marking a significant development. Israel and Hamas have agreed to release hostages and prisoners, as explained by Jodi Rudoren. This agreement is a critical step towards peace in the region.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: development, plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "French Court Extends Husamettin Dogan's Sentence to 10 Years for Rape",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 09 Oct 2025 15:52:51 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "A French court increases by a year the jail term of the only man who challenged his conviction for raping Gisèle Pelicot.",
      "<p>Husamettin Dogan has sentence increased to 10 years after being found guilty of raping Pelicot while she was sedated</p><p>A man has been found guilty on appeal of raping <a href=\"https://www.theguardian.com/world/gisele-pelicot-rape-trial\">Gisèle Pelicot</a> after she was drugged unconscious by "
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/caa8/live/2d0a49a0-a524-11f0-adbe-83a1eb509ffb.jpg",
    "titles": [
      "Man who appealed Pelicot rape conviction handed longer jail term",
      "Man loses appeal against Gisèle Pelicot rape conviction"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.972,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.649,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A French court has increased Husamettin Dogan's prison sentence to 10 years after he was found guilty on appeal of raping Gisèle Pelicot while she was sedated. Dogan, the only person to challenge his conviction, initially received a shorter sentence.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "May ATV Crash Results in Death of 23-Year-Old Alyssa Boyd",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Thu, 09 Oct 2025 14:40:49 +0000",
    "source": "CBS Sports",
    "sources": [
      "Sports Illustrated",
      "CBS Sports"
    ],
    "domains": [
      "news.google.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "The May ATV crash killed Fleming's girlfriend, 23-year-old Alyssa Boyd",
      "<a href=\"https://news.google.com/rss/articles/CBMinAFBVV95cUxOb0VRa1FsbVlJNnVRS3d6YVNhSGprOWJERV9VYXdPV1g5anBOTUVLcnRYaEI0M1VXbmk4LU9yT2FsdGg4dEw2ZEFvaVVpYlNreERpSDV2YjJCMVZRNkNfdGV3V1R1NGNwODZ2Z3ZVdEdvZVZlS2ktWjl6Vjd3cVRQZVNndXNDMUw5MGRHdDNpeU1SU18xWVhmOEQxcm4?oc=5\" target=\"_blank\">Ex-Ohio State, P"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/10/09/b5f5fc4b-2f71-42ac-902e-cbba26ec7887/julian-fleming-penn-state-g.jpg",
    "titles": [
      "Former Penn State, Ohio State WR Julian Fleming charged with multiple felonies in fatal ATV crash",
      "Ex-Ohio State, Penn State WR Julian Fleming Charged in Fatal ATV Crash - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.968,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.649,
    "summary_source": "snippet",
    "summary_reason": "retry_exhausted",
    "summary": "The May ATV crash killed Fleming's girlfriend, 23-year-old Alyssa Boyd",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Former BBC DJ Tim Westwood Charged With Multiple Sexual Offences",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 09 Oct 2025 15:06:34 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "He is also charged with nine counts of indecent assaults and two counts of sexual assault.",
      "<p>Metropolitan police say Westwood, 68, has been charged with sexual offences against seven women</p><p>The former BBC Radio 1 DJ Tim Westwood has been charged with sexual offences against seven women, including four counts of rape.</p><p>The Metropolitan police said the 68-year-old had been charge"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/7057/live/7e44fb50-a51d-11f0-9cda-fff576c5be6d.jpg",
    "titles": [
      "Former Radio 1 DJ Tim Westwood charged with four counts of rape",
      "Former Radio 1 DJ Tim Westwood charged with four counts of rape"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.956,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.646,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Tim Westwood, a 68-year-old former BBC Radio 1 DJ, has been charged by the Metropolitan Police with sexual offences against seven women. These charges include four counts of rape, nine counts of indecent assault, and two counts of sexual assault.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Sora App Surpasses 1M Downloads Faster Than ChatGPT",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Thu, 09 Oct 2025 14:57:09 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "Sora reached 1 million downloads even faster than ChatGPT, OpenAI's popular AI chatbot that supports 800 million weekly active users.",
      "This level of consumer adoption is worth noting because Sora remains an invite-only app, while ChatGPT was more publicly available at launch. That makes Sora's performance more impressive."
    ],
    "image_url": "",
    "titles": [
      "OpenAI's Sora hit 1 million downloads in less than five days",
      "Sora hit 1M downloads faster than ChatGPT"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.953,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.646,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Sora, an invite-only app, achieved 1 million downloads faster than OpenAI's ChatGPT, despite ChatGPT having 800 million weekly active users and being more publicly accessible at its launch. This highlights Sora's significant consumer adoption rate.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "IRS Adjusts Tax Brackets and Deductions for 2026 Under New Bill",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Thu, 09 Oct 2025 15:06:39 GMT",
    "source": "CNBC",
    "sources": [
      "MarketWatch",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "www.marketwatch.com"
    ],
    "snippets": [
      "The IRS has announced higher federal income tax brackets and standard deductions for 2026. Here's what taxpayers need to know.",
      "The IRS has announced higher long-term capital gains brackets for 2026. Here's what investors need to know.",
      "The standard deduction is rising in the wake of the One Big Beautiful Bill Act. Here’s the amount."
    ],
    "image_url": "",
    "titles": [
      "IRS announces new federal income tax brackets for 2026",
      "IRS unveils higher capital gains tax brackets for 2026",
      "The new IRS tax brackets for 2026 are here. See where you fit in."
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.956,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.646,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The IRS announced increases in federal income tax brackets, standard deductions, and long-term capital gains brackets for 2026 due to the One Big Beautiful Bill Act. This adjustment aims to accommodate changes in the economy, affecting taxpayers and investors by potentially altering their tax liabilities.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Luxury Car Maker's 2030 Targets Disappoint, Stock Prices Fall",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Thu, 09 Oct 2025 13:57:30 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Financial Times"
    ],
    "domains": [
      "www.cnbc.com",
      "www.ft.com"
    ],
    "snippets": [
      "Analysts said the targets, which were announced as part of the firm’s Capital Markets Day event, fell short of expectations.",
      "Shares in luxury-car maker slide as financial targets for 2030 underwhelm investors"
    ],
    "image_url": "",
    "titles": [
      "Ferrari on track for worst trading day ever as guidance disappoints",
      "Ferrari halves EV targets as profit guidance disappoints"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.934,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.642,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "At the firm's Capital Markets Day event, luxury car manufacturer announced financial targets for 2030 that analysts deemed below expectations, leading to a decline in the company's stock prices.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Chiefs to Host Lions in Week 6 Amid NFL Dynamics Shift",
    "domain": "sports",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Thu, 09 Oct 2025 10:00:00 GMT",
    "source": "Sports Illustrated",
    "sources": [
      "Sportsnet",
      "Sports Illustrated"
    ],
    "domains": [
      "news.google.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMiaEFVX3lxTFBJSlJLR19WZ0FhNWYtTkZsaGRyRW95dVRJNWFqemxHc3NNbGlTcXltWTFZTHBiZXJudWM4NGVCUnBuY1A1bGh1ZmlYVF9KNVdZYmtZM1pUSGJGUHVCcUl1WnRqd3FHWjVx?oc=5\" target=\"_blank\">NFL Week 6 Picks From the MMQB Staff: Scuffling Chiefs Host Lions</a>&nbsp;&nbsp;<font ",
      "<p>With the Bills losing in Week 5, the picture across the NFL has shifted. What remains steady, though, is the Lions&#8217; high-power offence. </p>\n<p>Richard Janvrin shares his best bets and predictions ahead of Week 6 action.</p>"
    ],
    "image_url": "",
    "titles": [
      "NFL Week 6 Picks From the MMQB Staff: Scuffling Chiefs Host Lions - Sports Illustrated",
      "NFL Week 6 Pick ‘Em: Can Lions outmuscle Chiefs on the road?"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.86,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.627,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In Week 6 of the NFL, the Kansas City Chiefs, following a challenging start, are set to host the Detroit Lions, a team noted for its strong offense. This matchup comes after the Buffalo Bills faced a loss in Week 5, altering the dynamics of the league. Richard Janvrin offers predictions and best bets for the upcoming games, highlighting key points of interest for fans and bettors alike.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Rielly Shines in Leafs' 5-2 Win Over Canadiens, Nylander Leads Offense",
    "domain": "sports",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Thu, 09 Oct 2025 04:18:45 GMT",
    "source": "NHL",
    "sources": [
      "Sportsnet",
      "NHL"
    ],
    "domains": [
      "news.google.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMikwFBVV95cUxNelZBSGs0V1hzZGFIM3RXLVpUZFZxN2llbTRZdFQ2YWRpWldGa2NKV3o0WjdYUndjR3BreG5STGJhbkJqeTc5XzJoamJuX2NpWmlGOEVycjFRcTVVR2tBWU5ITEtNZGhONXpHM3RvLUlVa1A4Y1FaLUVxcjRnaTdtWW0zUEZ1TmhFaVJGdXdZWlhBSXM?oc=5\" target=\"_blank\">Rielly sparks Maple Leafs pa",
      "<p>William Nylander led the offensive charge for the Toronto Maple Leafs, tallying a goal and two assists in his team&#8217;s 5-2 victory over the Montreal Canadiens. Morgan Rielly added a goal and an assist of his own in the win.</p>",
      "<p>Blake Coleman scored the game-tying goal in the third period, Nazem Kadri had an assist, and sealed the 4-3 win for the Calgary Flames with a shootout goal against the Edmonton Oilers.</p>",
      "<p>Pavel Dorofeyev compiled a hat trick and Jack Eichel tallied four points, but the Vegas Golden Knights couldn&#8217;t overcome the Los Angeles Kings, falling 6-5 in a shootout. Quinton Byfield and Andrei Kuzmenko each posted two points in the win.</p>",
      "<p>David Pastrnak scored a goal and dished out two assists, Elias Lindholm and Morgan Geekie each finished with two points, and Jeremy Swayman stopped 35 shots to lead the Boston Bruins to a 3-1 win over the Washington Capitals.</p>",
      "<p>Before the home side found life late and managed to pull a season-opening victory out of the muck, netminder Anthony Stolarz did his best to keep his club in it.</p>"
    ],
    "image_url": "",
    "titles": [
      "Rielly sparks Maple Leafs past Canadiens in season opener - NHL.com",
      "NHL Highlights: Maple Leafs 5, Canadiens 2",
      "NHL Highlights: Flames 4, Oilers 3 (SO)",
      "NHL Highlights: Kings 6, Golden Knights 5 (SO)",
      "NHL Highlights: Bruins 3, Capitals 1",
      "Stolarz bails out messy Maple Leafs in uneven season opener"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.764,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.618,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Morgan Rielly, after an off-season of reflection, contributed to the Toronto Maple Leafs' 5-2 victory over the Montreal Canadiens by scoring a goal and assisting another. William Nylander spearheaded the team's offensive efforts with a goal and two assists.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "New Peptide Blocks Alpha-Synuclein Misfolding, Aids Parkinson’s Research",
    "domain": "science",
    "source_domain": "www.sciencedaily.com",
    "location": "global",
    "published": "Wed, 08 Oct 2025 23:24:48 EDT",
    "source": "ScienceDaily",
    "sources": [
      "ScienceDaily",
      "SciTechDaily"
    ],
    "domains": [
      "www.sciencedaily.com",
      "scitechdaily.com"
    ],
    "snippets": [
      "Researchers have designed a peptide that prevents the deadly misfolding of alpha-synuclein, the protein behind Parkinson’s and some dementias. In lab and animal tests, it stabilized the protein and improved motor function. The work demonstrates the power of rational drug design in tackling brain dis",
      "<a href=\"https://scitechdaily.com/scientists-discover-food-molecules-that-trick-cells-into-staying-young/\" rel=\"nofollow\" title=\"Scientists Discover Food Molecules That Trick Cells Into Staying Young\"><img alt=\"Energy Vitality Human Health Lifespan\" class=\"webfeedsFeaturedVisual wp-post-image\" heigh"
    ],
    "image_url": "",
    "titles": [
      "Scientists just found a molecule that could stop Parkinson’s in its tracks",
      "Scientists Discover Food Molecules That Trick Cells Into Staying Young"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.765,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.615,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Researchers have developed a peptide that inhibits the harmful misfolding of alpha-synuclein, a protein associated with Parkinson’s disease and some forms of dementia. In laboratory and animal studies, this peptide stabilized the protein and enhanced motor functions, showcasing the potential of rational drug design in addressing neurodegenerative disorders.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]