[
  {
    "title": "Man Charged in Killing of Activist Charlie Kirk, Death Penalty Sought",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Tue, 16 Sep 2025 22:34:17 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Deutsche Welle",
      "Forbes",
      "The Guardian",
      "ABC News",
      "LA Times",
      "Al Jazeera",
      "Axios"
    ],
    "domains": [
      "www.forbes.com",
      "www.latimes.com",
      "www.theguardian.com",
      "www.aljazeera.com",
      "www.dw.com",
      "abcnews.go.com",
      "news.google.com"
    ],
    "snippets": [
      "Authorities charge Tyler Robinson with aggravated murder and felony discharge of a firearm.",
      "Utah prosecutors have charged Tyler Robinson, the suspect in the fatal shooting of conservative activist Charlie Kirk.",
      "The charge of aggravated murder means the suspected shooter could face the death penalty if convicted of killing right-wing activist Charlie Kirk at an event last week.",
      "<a href=\"https://news.google.com/rss/articles/CBMif0FVX3lxTE5PdmdWVDBvSzVIRDNxeE1EZ1ZIbWd2MW5EU3VNNTJaa2paZlVvQ3hOdFY1Ujl6NjNuZmJvamxNSVdISmZMd2dxUE11Skl3RW1xdWtjM3BSVGNfX3BQU3huM2ZJd2NUSWZIOVJXRm5rbFQ1dGhqQmNIWW5zSU9FWm8?oc=5\" target=\"_blank\">Prosecutors to seek death penalty for suspect in Charlie",
      "Tyler Robinson, the suspect accused of assassinating Charlie Kirk, has been formally charged with a slew of offenses as prosecutors announced their intent to seek the death penalty.",
      "<p>Prosecutors will seek the death penalty for Tyler Robinson, the 22-year-old man accused of killing conservative activist Charlie Kirk, officials announced Tuesday.</p>",
      "President Donald Trump has called for the suspect to face the death penalty.",
      "Tyler Robinson, the suspect accused of assassinating conservative influencer Charlie Kirk, made his first court appearance before a Utah judge on Tuesday.",
      "<p>Tyler Robinson is quoted talking to his partner about having enough of the far-right activist’s ‘hatred’ in texts</p><p>Evidence put forth by Utah prosecutors Tuesday offered the clearest indication yet of what they suspect motivated Tyler Robinson to kill far-right provocateur <a href=\"https://w"
    ],
    "image_url": "",
    "titles": [
      "Prosecutors to seek death penalty for alleged Charlie Kirk shooter",
      "Prosecutor to seek death penalty for Kirk shooting suspect",
      "Charlie Kirk shooting suspect faces death penalty",
      "Prosecutors to seek death penalty for suspect in Charlie Kirk killing - Axios",
      "WATCH:  Utah prosecutors to seek death penalty against alleged Charlie Kirk shooter",
      "Prosecutors will seek death penalty for suspect in killing of Charlie Kirk",
      "Charlie Kirk Shooting Suspect Charged With Aggravated Murder—Prosecutors Seek Death Penalty",
      "WATCH:  Alleged Charlie Kirk shooter makes 1st court appearance",
      "Utah prosecutors’ evidence indicates suspected motives of Charlie Kirk’s alleged shooter"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.967,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.843,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Tyler Robinson has been charged with aggravated murder and felony discharge of a firearm in Utah for the fatal shooting of conservative activist Charlie Kirk. Prosecutors are seeking the death penalty, citing the severity of the crime. Robinson, accused of killing Kirk due to his far-right views, made his first court appearance this week. President Donald Trump has also called for Robinson to face the death penalty. Evidence suggests Robinson was motivated by a desire to stop Kirk's \"hatred.\"",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Robert Redford, Iconic Actor and Sundance Founder, Dies at 89",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Tue, 16 Sep 2025 09:14:36 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "The Guardian",
      "Deutsche Welle",
      "ABC News",
      "BBC",
      "CityNews"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "www.bbc.com",
      "www.theguardian.com",
      "www.dw.com",
      "abcnews.go.com",
      "www.npr.org"
    ],
    "snippets": [
      "A movie star to his core, Robert Redford has died after a visionary career in cinema, including founding the Sundance Institute that transformed the market for independent films.",
      "The acting star was famous for roles in The Sting and Butch Cassidy and the Sundance Kid.",
      "Robert Redford, the director, actor, and activist has died at his home in Utah. Redford rose to fame in films like \"Butch Cassidy and the Sundance Kid\" and \"All the President's Men.\"",
      "Robert Redford, the actor and Oscar-winning filmmaker, who at his peak was simultaneously one of Hollywood's most critically lauded directors and bankable leading men, has died at age 89.",
      "<p>Redford achieved huge critical and commercial success in the 60s and 70s with a string of hits including Butch Cassidy and the Sundance Kid, The Way We Were and The Sting, before becoming an Oscar-winning director</p><ul><li><p><a href=\"https://www.theguardian.com/film/filmblog/2025/sep/16/robert",
      "Robert Redford, the Hollywood golden boy who became an Oscar-winning director, liberal activist and godfather for independent cinema under the name of one of his best-loved characters, died Tuesday at 89. Redford died “at his home at Sundance in the mountains of Utah — the place he loved, surrounded"
    ],
    "image_url": "",
    "titles": [
      "Movie star and visionary Robert Redford has died at age 89",
      "Acting legend Robert Redford dies aged 89",
      "Film icon Robert Redford dies at 89",
      "WATCH:  Hollywood icon Robert Redford dead at 89",
      "Robert Redford, giant of American cinema, dies aged 89",
      "Robert Redford, Oscar-winning actor, director and indie patriarch, dies at 89"
    ],
    "score_components": {
      "magnitude": 0.986,
      "recency": 0.796,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.829,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Robert Redford, an esteemed actor, director, and founder of the Sundance Institute, has passed away at the age of 89. He died at his home in Utah, surrounded by loved ones. Redford was celebrated for his roles in \"Butch Cassidy and the Sundance Kid\" and \"All the President's Men,\" as well as his contributions to independent cinema and activism.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Begins Second UK State Visit, Hosted by King Charles and Queen Camilla",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 16 Sep 2025 22:20:08 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "Deutsche Welle",
      "BBC",
      "New York Times",
      "Al Jazeera"
    ],
    "domains": [
      "www.bbc.com",
      "www.theguardian.com",
      "www.nytimes.com",
      "www.aljazeera.com",
      "www.dw.com"
    ],
    "snippets": [
      "Donald Trump's second state visit will see a crowded mix of royal pageantry, trade talks and international politics.",
      "The visit comes as the UK and US prepare to sign a landmark technology agreement.",
      "The US president is due to meet both King Charles III and British Prime Minister Keir Starmer. Demonstrations are planned in Windsor and central London to protest against the two-day visit of Donald Trump.",
      "<p>US president arrives on Tuesday ahead of a lavish programme, as Sadiq Khan calls for UK leaders not to shy away from ‘being critical’</p><p>Donald Trump has landed in the UK ahead of an unprecedented second state visit.</p><p>The US president and the first lady, Melania Trump, touched down on Tue",
      "The president and the first lady will be hosted by King Charles III and Queen Camilla at Windsor Castle. Mr. Trump will also travel to the prime minister’s country residence, Chequers.",
      "President Trump’s trip to Britain will involve horse-drawn carriages and a stay in an ancient castle. For British officials, the visit may feel less like a fairy tale."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/0aed/live/9f05e7c0-934b-11f0-b391-6936825093bd.jpg",
    "titles": [
      "Trump hails 'very good' relationship as he arrives in UK for state visit",
      "US President Donald Trump arrives in UK for second state visit",
      "Trump lands in UK for second state visit",
      "Donald Trump lands in UK for second state visit as protesters gather in Windsor",
      "President Trump’s State Visit to the UK: What to Know",
      "Trump Leaves Tense America Behind for Royal Retreat on U.K. State Visit"
    ],
    "score_components": {
      "magnitude": 0.964,
      "recency": 0.942,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.825,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Donald Trump arrived in the UK for a historic second state visit, during a sensitive time for the UK government. He and the First Lady are hosted by King Charles III and Queen Camilla at Windsor Castle, and will also visit the Prime Minister's residence, Chequers. The visit features displays of royal and military pageantry.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UN Report Accuses Israel of Genocide in Gaza, Calls for Action",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Tue, 16 Sep 2025 10:26:15 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "The Guardian",
      "BBC",
      "Washington Post",
      "New York Times"
    ],
    "domains": [
      "www.washingtonpost.com",
      "www.bbc.co.uk",
      "www.theguardian.com",
      "www.nytimes.com",
      "www.npr.org"
    ],
    "snippets": [
      "The report issued Tuesday by experts commissioned by the United Nations' Human Rights Council calls on the international community to end the genocide and take steps to punish those responsible.",
      "Israel rejects UN Commission finding that it is committing genocide in Gaza.",
      "<p>Report cites scale of killings and aid blockages, and calls on member countries to punish those responsible</p><p>A UN commission has found that Israel is committing genocide in Gaza, citing tens of thousands of civilian deaths and massive destruction, and has called on member countries to punish",
      "Israel rejected the conclusions, which echo those of a growing group of governments and human rights organizations.",
      "In earlier reports, the commission found that Israel had committed war crimes and crimes against humanity in its conflict with Hamas, but stopped short of calling it genocide. Israel denounced the accusation as “fake.”"
    ],
    "image_url": "",
    "titles": [
      "A U.N. inquiry accuses Israel of genocide in Gaza, joining a rising chorus",
      "Israel Committing Genocide in Gaza Says UN Commission",
      "Israel has committed genocide in Gaza, says UN commission of inquiry",
      "U.N. commission finds that Israel committed genocide in Gaza",
      "Israel Is Committing Genocide in Gaza, U.N. Inquiry Says"
    ],
    "score_components": {
      "magnitude": 0.964,
      "recency": 0.816,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.824,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A UN Human Rights Council-commissioned report has accused Israel of committing genocide against Palestinians in Gaza, finding that four out of five genocidal acts defined under international law have occurred. The report, which Israel has denounced as \"false and fabricated,\" calls for international action to punish those responsible. This marks an escalation from previous findings that identified war crimes and crimes against humanity but did not label the actions as genocide.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Israel Launches Ground Offensive in Gaza, Evacuations Underway Amid Criticism",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Tue, 16 Sep 2025 16:06:34 +0000",
    "source": "Al Jazeera",
    "sources": [
      "The Guardian",
      "LA Times",
      "Washington Post",
      "Al Jazeera",
      "New York Times",
      "CityNews"
    ],
    "domains": [
      "www.washingtonpost.com",
      "ottawa.citynews.ca",
      "www.theguardian.com",
      "www.latimes.com",
      "www.nytimes.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "The UN chief calls Gaza situation &#039;horrendous&#039; as a UN inquiry concludes that Israel’s two-year war is genocide.",
      "<p>IDF says advance aims to ‘dismantle Hamas’s grip’ as UN report says Israel has committed genocide in territory</p><p>Israel unleashed its long-threatened ground offensive in Gaza City on Tuesday, sending tanks and remote-controlled armoured cars packed with explosives into its streets, in defianc",
      "Palestinians in Gaza City reported a night of heavy bombardment. A U.N. commission said Israel was committing genocide in Gaza; Israel rejected the claim as “falsehoods.”",
      "Palestinians in the city sought shelter in buildings as tanks and ground troops rolled in. Some said they were too terrified to leave.",
      "The long-planned take over of the city began early Tuesday, according to officials, despite hundreds of thousands of people still sheltering there.",
      "<p>Weeks of intense bombardment that all but leveled the Gaza Strip's largest urban center made way for what Israeli military officials said was the ground maneuver phase of the operation to occupy the city.</p>",
      "JERUSALEM (AP) — Israel launched its offensive in Gaza City on Tuesday, vowing to overwhelm a city already in ruins from nearly two years of war as thousands of Palestinians fled in vehicles strapped with mattresses and other belongings that clogged a coastal road. The operation into the largest Pal"
    ],
    "image_url": "",
    "titles": [
      "Gaza City under relentless bombardment as Israel launches ground invasion",
      "Israel launches ground offensive deep inside Gaza City",
      "Israeli military begins ground invasion of Gaza City",
      "Gaza City Panics as Israel Launches Ground Operation",
      "Israel Launches Gaza City Ground Offensive, Officials Say",
      "Israel begins ground offensive in Gaza City with thousands of troops",
      "Israeli military begins its ground offensive in Gaza City as thousands of Palestinians flee"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.845,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.819,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Israel has initiated a ground offensive to occupy Gaza City, declaring it a \"dangerous combat zone\" and prompting the evacuation of thousands. This action follows a UN commission's conclusion that Israel is committing genocide in Gaza, a claim Israel disputes. The offensive has led to international criticism and warnings of a worsening humanitarian crisis. Reports indicate heavy bombardment in Gaza City and at least 38 Palestinian casualties, including women and children. The operation, aimed at dismantling Hamas's control, has significantly escalated the conflict, with further troop advanceme",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Paige Bueckers Named WNBA Rookie of the Year",
    "domain": "sports",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Tue, 16 Sep 2025 17:35:40 +0000",
    "source": "Al Jazeera",
    "sources": [
      "ESPN",
      "Al Jazeera",
      "Sportsnet",
      "Yahoo Sports",
      "Sports Illustrated"
    ],
    "domains": [
      "www.swishappeal.com",
      "www.espn.com",
      "www.aljazeera.com",
      "news.google.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Bueckers averaged 19.2 points on 47.7 percent shooting along with 3.9 rebounds, 5.4 assists and 1.6 steals.",
      "The Dallas Wings star is the seventh former UConn player and 16th No. 1 overall draft pick to earn the honor.",
      "The Dallas Wings’ Paige Bueckers is the 2025 WNBA Rookie of the Year.",
      "<a href=\"https://news.google.com/rss/articles/CBMib0FVX3lxTE9aUEpPQm1Yb0J2QzVUd3BJTkJOcUFsWFZFQ255Z2J0S29ldS11WjE1aWNtTkJwYnRmVXlLamFqYWtsbk1GbHh3Z01jNlhFbGt4Mk1KZ0U1NTVUQm1ldDVaTU9KcUFSTVJCYnUySE1jZw?oc=5\" target=\"_blank\">Paige Bueckers Voted WNBA Rookie of the Year After Excellent Debut Season for",
      "<p>Paige Bueckers is leaving her first WNBA season with some hardware. The Dallas Wings star was named rookie of the year on Tuesday, just six months after she was the No. 1 pick in the draft.</p>"
    ],
    "image_url": "",
    "titles": [
      "Dallas Wings star Paige Bueckers named WNBA Rookie of the Year",
      "Paige Bueckers receives Rookie of the Year award on Jennifer Hudson's show",
      "Dallas Wings’ Paige Bueckers wins 2025 WNBA Rookie of the Year",
      "Paige Bueckers Voted WNBA Rookie of the Year After Excellent Debut Season for Wings - Sports Illustrated",
      "Wings star Paige Bueckers named WNBA’s rookie of the year"
    ],
    "score_components": {
      "magnitude": 0.964,
      "recency": 0.871,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.81,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Paige Bueckers, a former UConn star and the No. 1 pick in the WNBA draft, was named Rookie of the Year after her first season with the Dallas Wings. She becomes the seventh Husky to win the award.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Astros' Yordan Alvarez Sidelined Indefinitely with Ankle Sprain",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 16 Sep 2025 19:35:10 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "Astros slugger Yordan Alvarez has been diagnosed with a \"significant\" left ankle sprain and will be out of the lineup \"for a while,\" manager Joe Espada said.",
      "Alvarez hurt himself Monday night while crossing home plate",
      "<p>Houston slugger Yordan Alvarez has a “pretty significant” ankle sprain that is going to keep him out indefinitely, manager Joe Espada said Tuesday.</p>"
    ],
    "image_url": "",
    "titles": [
      "Astros' Alvarez has significant sprain, out 'a while'",
      "Yordan Alvarez injury update: Astros slugger suffers 'pretty significant' ankle sprain, will be out 'a while'",
      "Astros’ Yordan Alvarez could miss rest of regular season with ankle sprain"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.987,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.766,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Houston Astros' Yordan Alvarez suffered a significant left ankle sprain, as confirmed by manager Joe Espada. The injury occurred while Alvarez was crossing home plate on Monday night, leading to an indefinite absence from the lineup.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Extends Deadline for TikTok Sale, Averting Ban",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Tue, 16 Sep 2025 16:10:09 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "CNBC",
      "Axios"
    ],
    "domains": [
      "www.npr.org",
      "www.cnbc.com",
      "news.google.com"
    ],
    "snippets": [
      "While legally questionable, the extension comes just as it appears China and the U.S. may finally have a deal on TikTok's fate.",
      "<a href=\"https://news.google.com/rss/articles/CBMiY0FVX3lxTE52VmFSaG5TRlhXcW9wdUZfUXppRlRNbHpTTzRKcldQVFNSWVZOc2VZTGYwY2FINUhUeWRCbUtZWklYOE5PUXYyQjN2cUxXaEtfRzRFZGNGc3lZQjFpRU9Xbm9rdw?oc=5\" target=\"_blank\">Trump extends TikTok deadline again as deal promise looms</a>&nbsp;&nbsp;<font color=\"#6f6f6f",
      "President Donald Trump extended a deadline on Tuesday that would require China's ByteDance to divest TikTok's U.S. business or face an effective ban in America."
    ],
    "image_url": "",
    "titles": [
      "Trump extends TikTok reprieve as deal nears",
      "Trump extends TikTok deadline again as deal promise looms - Axios",
      "Oracle and Silver Lake part of TikTok investor group as Trump extends deal deadline"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.92,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.753,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "President Donald Trump has extended the deadline for China's ByteDance to sell its U.S. TikTok operations, amid indications of a potential deal regarding the app's future in the U.S. This extension delays the enforcement of a ban that would affect TikTok in America.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Real Madrid Wins with 10 Men; Arsenal, Tottenham Triumph; Mbappé Shines",
    "domain": "sports",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Tue, 16 Sep 2025 22:42:11 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Yahoo Sports",
      "Sports Illustrated"
    ],
    "domains": [
      "www.aljazeera.com",
      "onefootball.com",
      "www.independent.co.uk",
      "www.managingmadrid.com",
      "news.google.com"
    ],
    "snippets": [
      "Real Madrid come from a goal down with 10-men to beat Marseille, while Arsenal and Tottenham also open with victories.",
      "Kylian Mbappé carries LaLiga form into the Champions League.",
      "Two stoppage-time goals from Juventus salvaged a point against Dortmund, while Arsenal, Spurs and Real Madrid all start with wins",
      "It was a mixed night for Real Madrid against Olympique Marseille, in which they picked up all three points, but also raised some questions about their own performance.Real Madrid Player RatingsThibaut...",
      "<a href=\"https://news.google.com/rss/articles/CBMifkFVX3lxTFBrbTB4RDhJTmZFWE9ZdFk5ckF6SGFmcW1VTGF6Vk9Ib0o5UWVtTWcxNE42VjRENkswbkRScDNCX1Nlek1MYTF1U2JVLTlnSTBldXZrWVRLaGg0c1VNM3hJOEpQMHFyOXRELTVTNXZKd0FfRkpuajNuSDk1STNQdw?oc=5\" target=\"_blank\">Real Madrid Player Ratings vs. Marseille: Mbappe Plays He",
      "<a href=\"https://news.google.com/rss/articles/CBMijwFBVV95cUxNai0wSnpzU2QzUV9OYmgzVEFhd2Z6dm5ZSUNuTS1lSWxhbWFibWVpczF1MGFqb2R4N29Ra09fQ1NPanZJdVFsM3lEZm9NUTd2MEthZ3g5M09oc2xNUlh6MTFvVTJoOXZmdjZaaDNxazBSVU8tOHE4X2FyaWwwTURXTEpPLU5rMVJRSUtiVldhYw?oc=5\" target=\"_blank\">How to Watch Real Madrid vs. Mars"
    ],
    "image_url": "",
    "titles": [
      "Mbappe rescues 10-man Real Madrid against Marseille in Champions League",
      "Top 10 Players: Real Madrid 2-1 Marseille",
      "Champions League: Juventus and Dortmund in eight-goal thriller, Mbappe brace for 10-man Real Madrid",
      "Real Madrid Player Ratings against Olympique Marseille: Kylian Mbappe headlines again",
      "Real Madrid Player Ratings vs. Marseille: Mbappe Plays Hero in Dramatic 2–1 Victory - Sports Illustrated",
      "How to Watch Real Madrid vs. Marseille on TV, Live Stream - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.969,
      "consensus": 0.829,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.74,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Real Madrid overcame a one-goal deficit and played with 10 men to secure a victory against Marseille. Arsenal and Tottenham also won their respective matches. Kylian Mbappé continued his impressive LaLiga form into the Champions League. Juventus scored two stoppage-time goals to draw with Dortmund, highlighting a night of mixed performances for several teams, including Real Madrid, which despite winning, faced scrutiny over their performance.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Delays TikTok Ban, Aims for US Version in Bytedance Deal",
    "domain": "business",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-09-16T20:33:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Ars Technica",
      "CNBC",
      "Deutsche Welle"
    ],
    "domains": [
      "arstechnica.com",
      "www.cnbc.com",
      "www.dw.com"
    ],
    "snippets": [
      "US President Donald Trump has once again postponed a deadline to ban TikTok to US users, suggesting he has reached a deal with the video platform's Chinese parent company, Bytedance. DW explains what you need to know.",
      "President Donald Trump and Chinese President Xi Jinping are expected to speak Friday to finalize the TikTok deal.",
      "Trump’s TikTok deal requires US to make its own version of the app."
    ],
    "image_url": "",
    "titles": [
      "Trump's deal with China, Bytedance over TikTok: What to know",
      "Trump's willingness to let TikTok 'go dark' motivated China to make deal, Bessent says",
      "“China keeps the algorithm”: Critics attack Trump’s TikTok deal"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.927,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.736,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "US President Donald Trump has delayed the TikTok ban for US users, indicating a deal with its Chinese parent company, Bytedance. Trump and Chinese President Xi Jinping are set to discuss finalizing this deal on Friday. The agreement necessitates the creation of a US version of the app.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Waymo Gets Permit for Robotaxi Tests at San Francisco Airport",
    "domain": "technology",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Tue, 16 Sep 2025 20:43:16 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "TechCrunch",
      "The Verge"
    ],
    "domains": [
      "www.theverge.com",
      "www.cnbc.com",
      "techcrunch.com"
    ],
    "snippets": [
      "Alphabet's Waymo has obtained a permit to test its robotaxis at San Francisco International Airport.",
      "Waymo is now permitted to test its robotaxi service at San Francisco International Airport (SFO), a big win for the company as it seeks to expand its service area and tackle more popular, revenue-generating destinations. After years of back-and-forth negotiations, Waymo signed “Testing and Operation",
      "Waymo has spent years locked in back-and-forth negotiations with SFO, the biggest airport serving its home base of Silicon Valley."
    ],
    "image_url": "",
    "titles": [
      "Waymo obtains permit to test robotaxis at San Francisco International Airport",
      "Waymo gets green light for airport service in San Francisco",
      "Waymo approved to start testing autonomous vehicles at San Francisco International Airport"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.911,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.736,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Alphabet's Waymo has secured a permit to test its robotaxi service at San Francisco International Airport (SFO), marking a significant expansion for the company. This development follows extensive negotiations between Waymo and SFO, reflecting Waymo's ambition to extend its service to high-traffic, revenue-generating locations.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Aaron Jones on Injured Reserve, Jordan Mason to Lead Carries",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Tue, 16 Sep 2025 22:57:19 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sportsnet",
      "Sports Illustrated"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.cbssports.com",
      "news.google.com"
    ],
    "snippets": [
      "Jordan Mason is expected to receive the bulk of the carries with Jones out",
      "<a href=\"https://news.google.com/rss/articles/CBMiiAFBVV95cUxOSDl2d1dxQVg0TE1PWlNDcExuLTdfMEo3M1U5T3ZpaEhOY2tRYVBpWkczSkxxNU5LSnJlUGtMVXpORnRtaDJvSGptVGQwLWExajdkcUFveHliQVBDdzBWRE9wNWdGVnowbkxpZlNfaVM1NUZ5ZklnMlJPdjBNQWNrWGpQZ19nbEo0?oc=5\" target=\"_blank\">Aaron Jones Injury Update: Vikings Make Dec",
      "<a href=\"https://news.google.com/rss/articles/CBMickFVX3lxTE02ZHF6SVZoaFpUb3l5TXl5THZ3eUhCVmxUNTEyM3FqYmxIYUVjSkRLT0tHeEtkVjZVVE5MT1NsTTdGMWdfOFFhZ2t2NHQxelA0ekJZWDRjbE1oWldRZHQ5blJiRFJRbGZKYk1DRmdBdmN5UQ?oc=5\" target=\"_blank\">Joe Burrow Injury: Bengals Officially Place Star QB on Injured Reserve</a",
      "<p>Top running back Aaron Jones is set to be placed on injured reserve because of a hamstring injury, according to multiple reports Tuesday.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/16/aecd0bf4-874f-497d-b6fc-3ee329836c73/a-jones-getty.png",
    "titles": [
      "Aaron Jones injury update: Vikings RB heading to injured reserve, out at least four weeks, per reports",
      "Aaron Jones Injury Update: Vikings Make Decision on Injured Reserve for Veteran RB - Sports Illustrated",
      "Joe Burrow Injury: Bengals Officially Place Star QB on Injured Reserve - Sports Illustrated",
      "Reports: Vikings to place RB Aaron Jones on injured reserve"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.974,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.732,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Aaron Jones, the top running back for his team, is being placed on injured reserve due to a hamstring injury. With Jones out, Jordan Mason is expected to take over the majority of carries.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "PGA Tour Cancels Opener at Kapalua Due to Drought Conditions",
    "domain": "sports",
    "source_domain": "www.forbes.com",
    "location": "global",
    "published": "Tue, 16 Sep 2025 18:25:46 -0400",
    "source": "Forbes",
    "sources": [
      "Sky Sports",
      "Sports Illustrated",
      "Forbes"
    ],
    "domains": [
      "www.forbes.com",
      "www.skysports.com",
      "news.google.com"
    ],
    "snippets": [
      "PGA Tour cancels its season opening Sentry Tournament of Champions at Kapalua Resort Plantation Course due to course conditions.",
      "<a href=\"https://news.google.com/rss/articles/CBMieEFVX3lxTE44UTBrbXBFQl93SVJtbnZNaURENEtoWnA2VTRSbEp1ZVg0TjVzUDBreDhHMWVsVzBfbnhGeVlKRjZiUmdOZ3BJOHdrck5lSE94MjNpdTlveUpVZ254R203ZVVfcFBMNW1lRVZZYVNZUndzaDcwNDhKUw?oc=5\" target=\"_blank\">PGA Tour Forced to Move 2026 Season Opener From Kapalua</a>&nbsp;",
      "The PGA Tour has revealed the 2026 season-opening Sentry tournament will not be contested at The Plantation Course due to an ongoing drought on the island of Maui."
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/68c9dd0a2aa670f90bb9c1ea/0x0.jpg?width=960",
    "titles": [
      "PGA Tour Cancels 2026 Season Opening Event At Kapalua.",
      "PGA Tour Forced to Move 2026 Season Opener From Kapalua - Sports Illustrated",
      "PGA Tour season opener forced to move due to Maui drought"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.964,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.73,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The PGA Tour announced the cancellation of its season-opening Sentry Tournament of Champions at Kapalua Resort's Plantation Course due to poor course conditions. This decision is linked to an ongoing drought on the island of Maui, which has also forced the relocation of the 2026 season opener from the same venue.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Campbell Hatton Mourns Late Father Ricky, Boxing World Pays Tribute",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 16 Sep 2025 23:23:42 GMT",
    "source": "BBC",
    "sources": [
      "Yahoo Sports",
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "www.bbc.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Ricky Hatton's son Campbell pays tribute to his father, saying \"heartbroken isn't the word\" after the former world boxing champion's death.",
      "Ricky Hatton's son Campbell pays tribute to his father, saying &quot;heartbroken isn't the word&quot; after the former world boxing champion's death.",
      "<ul><li><p>‘Can’t explain how much I’m going to miss the laughs’</p></li><li><p>Campbell Hatton also pursued a boxing career</p></li></ul><p>Ricky Hatton’s son Campbell has paid an emotional tribute in his first public comments since his father’s death.</p><p>Tributes have poured in across the world"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/aa99/live/49146f50-9353-11f0-9f51-4f02f7992fca.jpg",
    "titles": [
      "'Heartbroken isn't the word' - Hatton son's tribute",
      "'Heartbroken isn't the word' - Hatton son's tribute",
      "‘Heartbroken isn’t the word’: Ricky Hatton’s son Campbell pays emotional tribute to his father"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.963,
      "consensus": 0.769,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.724,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Campbell Hatton, son of the late former world boxing champion Ricky Hatton, expressed profound grief over his father's death, stating he is beyond heartbroken. Campbell, who is also pursuing a boxing career, reminisced about missing the laughs shared with his father. Tributes to Ricky Hatton have been received from around the globe, reflecting his impact on the boxing world and beyond.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "NHTSA Investigates Tesla Over Door Malfunctions Trapping Riders",
    "domain": "technology",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Tue, 16 Sep 2025 19:07:51 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "TechCrunch",
      "The Verge"
    ],
    "domains": [
      "www.theverge.com",
      "www.aljazeera.com",
      "techcrunch.com"
    ],
    "snippets": [
      "Some complaints allege that children were trapped in the back seats and could only be freed by breaking the windows.",
      "Tesla is under investigation for faulty electronic door handles that can trap people inside their vehicles. The National Highway Traffic Safety Administration (NHTSA) launched the probe, saying it was responding to numerous complaints filed by Tesla owners, with a particular focus on children who ha",
      "The National Highway Traffic Safety Administration has received nine reports from owners who couldn't access their cars, including from parents whose children were stuck inside."
    ],
    "image_url": "",
    "titles": [
      "Tesla faces safety investigation due to faulty door handles",
      "Tesla under investigation for door handles that trap people inside",
      "Tesla probed for potentially faulty door handles"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.9,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.717,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The National Highway Traffic Safety Administration (NHTSA) is investigating Tesla for electronic door handle malfunctions that reportedly trap people inside the vehicles. This probe was initiated after receiving nine complaints, including incidents where children were trapped and could only be freed by breaking the windows.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Suspect in Influencer's Murder Faces 7 Charges, Death Penalty Sought",
    "domain": "business",
    "source_domain": "www.lemonde.fr",
    "location": "global",
    "published": "Tue, 16 Sep 2025 20:38:41 +0200",
    "source": "Le Monde",
    "sources": [
      "CNBC",
      "Financial Times",
      "Le Monde"
    ],
    "domains": [
      "www.lemonde.fr",
      "www.cnbc.com",
      "www.ft.com"
    ],
    "snippets": [
      "Le meurtrier présumé de l’influenceur conservateur américain est visé par sept chefs d’accusation, dont celui d’assassinat, a fait savoir mardi Jeffrey Gray, le procureur.",
      "Robinson's roommate told police he left a note saying \"I had the opportunity to take out Charlie Kirk, and I'm going to take it,\" the Utah County attorney said.",
      "Prosecutor says he will seek the death penalty"
    ],
    "image_url": "https://img.lemde.fr/2025/09/16/250/0/3000/1500/644/322/60/0/8491a3e_ftp-import-images-1-r3npjw50nllw-2025-09-16t220336z-750315642-rc29tgaxawya-rtrmadp-3-usa-shooting-kirk-suspect-court.JPG",
    "titles": [
      "Charlie Kirk : le suspect Tyler Robinson comparaît pour la première fois, le procureur demandera la peine de mort",
      "Charlie Kirk shooting suspect Tyler Robinson charged with murder, faces possible death penalty",
      "Utah charges suspect in Charlie Kirk shooting with aggravated murder"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.891,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.715,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The suspect in the murder of a conservative American influencer faces seven charges, including murder, announced prosecutor Jeffrey Gray. According to the Utah County attorney, the suspect's roommate reported a note indicating an intention to target Charlie Kirk. The prosecutor intends to seek the death penalty.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Sues NY Times for $15B, Alleging Defamation in Epstein Note Coverage",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Tue, 16 Sep 2025 13:52:01 GMT",
    "source": "Axios",
    "sources": [
      "CNBC",
      "Axios",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.cnbc.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMiigFBVV95cUxPM2lFVERwWjdFa2JBZlAzcy0wclBzdzVLY3hvSjJreDBKRmJhMXhKdGZqYjk5d0JUQmRXQ05vU0pSVDBpWGw5MGxkTjlMNzk4djRjdElNUno4TWtmN2d5ekpjYXVfcW1HYVJncFBOa1dES2RodGhmQUM2U0hjcFpHdFNoMnNQSHJRNmc?oc=5\" target=\"_blank\">Trump files $15B lawsuit against the New",
      "Trump has initiated a flurry of defamation lawsuits against media companies, accusing them of false or misleading coverage.",
      "<p>Title says it will not be ‘deterred by intimidation tactics’ after US president announces latest legal action </p><p>Donald Trump has filed a $15bn defamation lawsuit against the New York Times in his latest use of legal action targeting a major media outlet.</p><p>The US president accused it of "
    ],
    "image_url": "",
    "titles": [
      "Trump files $15B lawsuit against the New York Times - Axios",
      "Trump sues The New York Times for $15 billion, alleging defamation and libel",
      "Donald Trump files $15bn lawsuit against the New York Times"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.79,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.702,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Donald Trump has filed a $15 billion defamation and libel lawsuit against The New York Times and four of its journalists in Florida, accusing the newspaper of being a \"mouthpiece\" for the Democratic party. This legal action follows a recent publication by the newspaper of a note Trump allegedly wrote to Jeffrey Epstein, which Trump claims is false. This lawsuit is part of Trump's broader campaign of litigation against media organizations over their coverage.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "NFL Clears Tom Brady in Headset Incident at Raiders Game",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 16 Sep 2025 19:35:10 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "Tom Brady did not violate any NFL rules by wearing a headset in the Raiders' coaching booth during Monday night's game, the NFL announced.",
      "<p>The NFL said Tuesday that Tom Brady did not violate any rules when he was spotted in the Las Vegas Raiders&#8217; coaching booth wearing a headset during the team&#8217;s Monday game against the Los Angeles Chargers.</p>"
    ],
    "image_url": "",
    "titles": [
      "NFL: Brady didn't violate rules in Raiders booth",
      "Tom Brady did not violate rules in Raiders’ coaching booth, NFL says"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.987,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.684,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The NFL confirmed that Tom Brady did not break any rules by wearing a headset in the Las Vegas Raiders' coaching booth during their game against the Los Angeles Chargers on Monday night.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Rams Coach Sean McVay Suffers Torn Plantar Fascia During Titans Game",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 16 Sep 2025 19:35:10 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "Head coach Sean McVay says he tore his plantar fascia on the sideline while coaching the Rams to victory over the Titans on Sunday.",
      "<p>Sean McVay says he tore his plantar fascia while coaching the Los Angeles Rams to victory over the Tennessee Titans last Sunday.</p>"
    ],
    "image_url": "",
    "titles": [
      "McVay tore plantar fascia on sideline during win",
      "Sean McVay says he tore his plantar fascia during the Rams’ win over Titans"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.987,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.677,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Los Angeles Rams head coach Sean McVay tore his plantar fascia while coaching the team to victory against the Tennessee Titans on Sunday. He confirmed the injury, but the current status of his condition or any potential impact on his coaching duties is not provided.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "WWE to Host First PPV Event on ESPN with Cena, Rollins",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 16 Sep 2025 17:58:20 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "Check out how to watch John Cena, Seth Rollins and other WWE stars.",
      "WWE is set for its first PPV event on ESPN later this month"
    ],
    "image_url": "",
    "titles": [
      "Wrestlepalooza 2025: Date, time, channel, card, how to watch",
      "WWE Wrestlepalooza 2025: Card, date, matches, start time, rumors, location as John Cena headlines debut event"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.955,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.671,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "WWE is scheduled to host its first Pay-Per-View (PPV) event on ESPN later this month, featuring stars like John Cena and Seth Rollins. Fans interested in watching can tune into ESPN for the live broadcast.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UK Steel Tariff Elimination Agreed; Starmer Backs Permanent 25% Rate",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 16 Sep 2025 17:14:14 GMT",
    "source": "BBC",
    "sources": [
      "Financial Times",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.ft.com"
    ],
    "snippets": [
      "An agreement to reduce tariffs on UK steel to zero in short order was welcomed with some fanfare in July.",
      "Keir Starmer favours making ‘permanent’ Britain’s preferential 25% rate, according to allies"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/c8ce/live/1d90ed90-931c-11f0-873c-3fec77a46911.jpg",
    "titles": [
      "UK hopes for 0% tariff on steel exports to US dashed",
      "UK pauses push for 0% tariff on steel exports to US"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.847,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.641,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In July, an agreement was reached to eliminate tariffs on UK steel, a move celebrated widely. Keir Starmer, through his allies, has expressed support for permanently maintaining Britain's preferential 25% tariff rate on steel.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "NASA Telescope to Probe Milky Way's Interstellar Medium",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Tue, 16 Sep 2025 15:41:04 EDT",
    "source": "Phys.org",
    "sources": [
      "NASA",
      "Phys.org"
    ],
    "domains": [
      "www.nasa.gov",
      "phys.org"
    ],
    "snippets": [
      "NASA's Nancy Grace Roman Space Telescope will help scientists better understand our Milky Way galaxy's less sparkly components—gas and dust strewn between stars, known as the interstellar medium.",
      "NASA’s Nancy Grace Roman Space Telescope will help scientists better understand our Milky Way galaxy’s less sparkly components — gas and dust strewn between stars, known as the interstellar medium. One of Roman’s major observing programs, called the Galactic Plane Survey, will peer through our galax"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/how-nasas-roman-missio.jpg",
    "titles": [
      "How NASA's Roman mission will unveil our home galaxy using cosmic dust",
      "How NASA’s Roman Mission Will Unveil Our Home Galaxy Using Cosmic Dust"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.91,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.637,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "NASA's Nancy Grace Roman Space Telescope is set to enhance understanding of the Milky Way's interstellar medium—gas and dust between stars. Its Galactic Plane Survey will specifically focus on examining these components, aiming to provide deeper insights into our galaxy's structure and composition.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "NASA Unveils Image of Largest Star Cluster Near Earth",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Tue, 16 Sep 2025 14:45:02 EDT",
    "source": "Phys.org",
    "sources": [
      "NASA",
      "Phys.org"
    ],
    "domains": [
      "www.nasa.gov",
      "phys.org"
    ],
    "snippets": [
      "Westerlund 1, the biggest and closest \"super\" star cluster to Earth, dazzles in this image released on July 23, 2025. This view combines X-ray data from NASA's Chandra X-ray Observatory (in pink, blue, purple, and orange), infrared data from NASA's James Webb Space Telescope (in yellow, gold, and bl",
      "Westerlund 1, the biggest and closest “super” star cluster to Earth, dazzles in this image released on July 23, 2025. This view combines x-ray data from NASA’s Chandra X-ray Observatory (in pink, blue, purple, and orange), infrared data from NASA’s James Webb Space Telescope (in yellow, gold, and bl"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/eye-catching-star-clus.jpg",
    "titles": [
      "Image: Westerlund 1, an eye-catching star cluster",
      "An Eye-catching Star Cluster"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.893,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.634,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "On July 23, 2025, NASA released an image of Westerlund 1, the largest and nearest \"super\" star cluster to Earth. The image features a combination of X-ray data from Chandra X-ray Observatory and infrared data from James Webb Space Telescope, showcasing the cluster in vibrant colors.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Meta to Unveil AI Smart Glasses and Wristband at Connect Event",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Tue, 16 Sep 2025 11:00:01 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "TechCrunch"
    ],
    "domains": [
      "www.cnbc.com",
      "techcrunch.com"
    ],
    "snippets": [
      "Analysts and investors will be watching how the public responds to Meta's big bet on smart glasses during its Connect event.",
      "Meta is expected to unveil new versions of its AI-powered smart glasses, as well as a gesture-indicating wristband."
    ],
    "image_url": "",
    "titles": [
      "Meta Connect 2025: AI-powered smart glasses take center stage",
      "Meta Connect 2025: What to expect and how to watch"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.744,
      "consensus": 0.591,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.631,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "At its Connect event, Meta plans to reveal new AI-powered smart glasses and a gesture-indicating wristband. Analysts and investors are keen to see the public's reaction to these innovations, marking a significant moment for the company's investment in wearable technology.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: innovation, plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Google Tests New Alt+Space Search App for Windows",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-09-16T12:32:10-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge",
      "TechCrunch"
    ],
    "domains": [
      "www.theverge.com",
      "techcrunch.com"
    ],
    "snippets": [
      "Google is testing a new search app for Windows. A&#160;blog post on Tuesday said the app, currently available on personal accounts via Google’s Search Labs, will allow you to use an Alt + Space shortcut to search for information from the files on your computer, in your Drive, and on the web. The app",
      "The app will allow people to use an Alt + Space shortcut to instantly search for information from their computer files, installed apps, Google Drive files, and the web."
    ],
    "image_url": "",
    "titles": [
      "Google&#8217;s new Windows desktop app brings a Spotlight-like search bar to PC",
      "Google rolls out new Windows desktop app with Spotlight-like search tool"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.852,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.625,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Google is testing a new search app for Windows that enables users to quickly search their computer files, installed apps, Google Drive, and the web using an Alt + Space shortcut. This feature is currently accessible to personal accounts through Google's Search Labs, as announced in a recent blog post.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Foreign Secretary Admits Mandelson Appointed Envoy Without Department Input",
    "domain": "business",
    "source_domain": "www.ft.com",
    "location": "global",
    "published": "Tue, 16 Sep 2025 17:12:52 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.ft.com"
    ],
    "snippets": [
      "Foreign secretary admits Labour peer was cleared as envoy without the involvement of her department",
      "<p>Letter to MPs says former US ambassador went through process only after his new role was announced to public</p><p>Peter Mandelson was not subject to in-depth security vetting prior to his <a href=\"https://www.theguardian.com/politics/2025/sep/12/peter-mandelson-ambassador-washington-big-hitter\">"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F5aedb294-0197-44b5-8c4e-5a6c90c887b2.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Mandelson not given security vetting before appointment as UK ambassador to US",
      "Mandelson not given in-depth vetting before appointment, says Foreign Office"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.847,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.624,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Foreign Secretary acknowledged that Labour peer Peter Mandelson was appointed as an envoy without the department's involvement, and his security vetting occurred only after his role was publicly announced. This admission was detailed in a letter to MPs, highlighting a departure from standard procedure in his appointment process.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Microsoft to Invest £22bn in UK AI Infrastructure, Including Supercomputer",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Tue, 16 Sep 2025 21:44:08 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "The Verge"
    ],
    "domains": [
      "www.theverge.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "Microsoft is ramping up its AI investments in the U.K. as President Donald Trump embarks on his state visit this week.",
      "Microsoft is announcing that it’s investing £22 billion (around $30 billion) in the UK to help support AI infrastructure and ongoing operations from 2025 through 2028. The investment includes $15 billion in capital expenditures to build a supercomputer to support AI demand and adoption. “This will a"
    ],
    "image_url": "",
    "titles": [
      "Microsoft, Nvidia other tech giants plan over $40 billion of new AI investments in UK",
      "Microsoft trumps Google with $30 billion investment in the UK"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.93,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.25
    },
    "score": 0.623,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Microsoft announced a £22 billion investment in the UK to enhance AI infrastructure and operations from 2025 to 2028. This includes $15 billion for a supercomputer to meet AI demand. The investment coincides with President Trump's state visit.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Scientists Map Plant Stem Cell Genes, Link to Crop Size",
    "domain": "science",
    "source_domain": "www.sciencedaily.com",
    "location": "global",
    "published": "Tue, 16 Sep 2025 02:28:36 EDT",
    "source": "ScienceDaily",
    "sources": [
      "SciTechDaily",
      "ScienceDaily"
    ],
    "domains": [
      "www.sciencedaily.com",
      "scitechdaily.com"
    ],
    "snippets": [
      "Scientists at Cold Spring Harbor Laboratory have cracked open the secrets of plant stem cells, mapping key genetic regulators in maize and Arabidopsis. By using single-cell RNA sequencing, they created a gene expression atlas that identifies rare stem cell regulators, links them to crop size and pro",
      "<a href=\"https://scitechdaily.com/scientists-just-found-a-way-to-simulate-the-universe-on-a-laptop/\" rel=\"nofollow\" title=\"Scientists Just Found a Way to Simulate the Universe on a Laptop\"><img alt=\"Large-Scale Structure of the Universe\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"583\" src="
    ],
    "image_url": "",
    "titles": [
      "Scientists just found the “master switch” for plant growth",
      "Scientists Just Found a Way to Simulate the Universe on a Laptop"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.691,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.603,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Scientists at Cold Spring Harbor Laboratory have successfully mapped the genetic regulators of plant stem cells in maize and Arabidopsis using single-cell RNA sequencing. This research has led to the creation of a gene expression atlas, which not only identifies rare stem cell regulators but also establishes a connection between these regulators and crop size. This breakthrough could have significant implications for crop improvement strategies.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: research",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "NASA Rover Finds \"Leopard Spots\" Rock on Mars, Hints at Ancient Life",
    "domain": "science",
    "source_domain": "www.sciencedaily.com",
    "location": "global",
    "published": "Tue, 16 Sep 2025 03:31:04 EDT",
    "source": "ScienceDaily",
    "sources": [
      "SciTechDaily",
      "ScienceDaily"
    ],
    "domains": [
      "www.sciencedaily.com",
      "scitechdaily.com"
    ],
    "snippets": [
      "NASA’s Perseverance rover has delivered its most compelling clue yet in the search for life on Mars. A rock sample called “Sapphire Canyon,” taken from the Bright Angel formation in Jezero Crater, shows unusual mineral patterns known as “leopard spots” that may have formed through microbial activity",
      "<a href=\"https://scitechdaily.com/strange-mars-mudstones-may-hold-the-strongest-clues-yet-of-ancient-life/\" rel=\"nofollow\" title=\"Strange Mars Mudstones May Hold the Strongest Clues Yet of Ancient Life\"><img alt=\"Cheyava Falls Rock Leopard Spots\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\""
    ],
    "image_url": "",
    "titles": [
      "Strange ‘leopard spots’ in a Mars rock could be the strongest hint of life yet",
      "Strange Mars Mudstones May Hold the Strongest Clues Yet of Ancient Life"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.706,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.596,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "NASA's Perseverance rover has collected a rock sample named \"Sapphire Canyon\" from the Bright Angel formation in Jezero Crater on Mars, revealing unusual \"leopard spots\" mineral patterns. These patterns might indicate microbial activity, marking a significant clue in the search for ancient life on Mars.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "\"Dancing With the Stars\" Season 34 Kicks Off with 14 Pairs Competing",
    "domain": "business",
    "source_domain": "www.forbes.com",
    "location": "global",
    "published": "Tue, 16 Sep 2025 18:00:57 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes"
    ],
    "domains": [
      "www.forbes.com"
    ],
    "snippets": [
      "\"Dancing With the Stars\" is back! Here's how to vote for your favorite Season 34 couples each week so they don’t get eliminated.",
      "“Dancing With the Stars\" Season 34 officially kicks off tonight. Meet the 14 celebrities and pros competing this fall for the coveted Len Goodman Mirrorball Trophy."
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/670467129689f533fae4d299/0x0.jpg?width=960&precrop=1862%2C1048%2Cx211%2Cy106",
    "titles": [
      "Here’s How To Vote For ‘Dancing With The Stars’ Season 34",
      "Who’s In The ‘Dancing With The Stars’ Season 34 Cast? Meet The Stars And Pros"
    ],
    "score_components": {
      "magnitude": 0.393,
      "recency": 0.956,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.466,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "\"Dancing With the Stars\" Season 34 has started, featuring 14 celebrity and professional pairs competing for the Len Goodman Mirrorball Trophy. Viewers can vote weekly to prevent their favorite couples from being eliminated.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Caltech AI Speeds Up Quantum Calculations for Better Catalysts",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Tue, 16 Sep 2025 16:30:01 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "phys.org"
    ],
    "snippets": [
      "Catalysts play an indispensable role in modern manufacturing. More than 80% of all manufactured products, from pharmaceuticals to plastics, rely on catalytic processes at some stage of production. Transition metals, in particular, stand out as highly effective catalysts because their partially fille",
      "Caltech scientists have developed an artificial intelligence (AI)–based method that dramatically speeds up calculations of the quantum interactions that take place in materials. In new work, the group focuses on interactions among atomic vibrations, or phonons—interactions that govern a wide range o"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/new-method-improves-th.jpg",
    "titles": [
      "Machine learning and quantum chemistry unite to simulate catalyst dynamics",
      "Machine learning unravels quantum atomic vibrations in materials"
    ],
    "score_components": {
      "magnitude": 0.393,
      "recency": 0.926,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.46,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Caltech scientists have developed an AI-based method to significantly accelerate calculations of quantum interactions in materials, focusing on atomic vibrations or phonons. This advancement could enhance the efficiency of catalysts, which are crucial in manufacturing over 80% of all products, including pharmaceuticals and plastics, by leveraging the properties of transition metals.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]