[
  {
    "title": "YouTube Settles Trump Lawsuit for $24.5M Over Account Suspension",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Mon, 29 Sep 2025 19:16:56 -0400",
    "source": "NPR",
    "sources": [
      "Axios",
      "Al Jazeera",
      "Ars Technica",
      "The Guardian",
      "Deutsche Welle",
      "Business Insider",
      "The Verge",
      "NPR",
      "CNBC"
    ],
    "domains": [
      "www.dw.com",
      "arstechnica.com",
      "www.theguardian.com",
      "www.npr.org",
      "news.google.com",
      "www.businessinsider.com",
      "www.theverge.com",
      "www.cnbc.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "YouTube is the latest social media company to pay Trump tens of millions of dollars to resolve lawsuits brought before he returned to power. The money will fund a new ballroom at the White House.",
      "Video platform settles lawsuit filed in response to Trump&#039;s suspension over the January 6, 2021, riot at US Capitol.",
      "After Meta and X, Google has also settled the lawsuit brought on by the US President. However, YouTube's settlement does not constitute an admission of liability.",
      "<a href=\"https://news.google.com/rss/articles/CBMif0FVX3lxTE91QkZKM0YyVnFuZWxIV3N4U1Ewb2s0ampyMnk4VG1UMzBieVlFWmlSdHJ1OVdJZmUyc3BpcFpXU29Ha0pfTmJmZlJsRm51SjBraTBBQ3hSZkRBT1piRUhxVF9VTjdxYUdMVXktX0NfRW9kMGRQb2VBTTgwWDZZTEk?oc=5\" target=\"_blank\">YouTube to pay Trump $22 million for suspending his acco",
      "YouTube has agreed to pay $24.5 million to settle a lawsuit involving the suspension of President Donald Trump's account in 2021.",
      "<p>Platform suspended the US president’s YouTube channel in 2021 after the January 6 Capitol riot</p><p>YouTube has agreed to pay $24.5m to settle a suit brought by Donald Trump in 2021 that alleged the platform wrongly suspended his channel after the January 6 attack on the US Capitol. The Google s",
      "In total, YouTube will pay $24.5 million to settle the suit brought by President Donald Trump.",
      "YouTube has settled a lawsuit President Donald Trump filed against the company in 2021, according to The Wall Street Journal. Trump filed sweeping lawsuits against Google-owned YouTube, Meta (then Facebook), and X (then Twitter) after he was suspended from the platforms, and now all three companies ",
      "Alphabet settles with Trump instead of fighting lawsuit over January 6 suspension."
    ],
    "image_url": "",
    "titles": [
      "YouTube agrees to pay Trump $24 million to settle lawsuit over Jan. 6 suspension",
      "YouTube to pay $24.5m to settle lawsuit over Trump’s account suspension",
      "YouTube to pay $24.5 million to settle Trump lawsuit",
      "YouTube to pay Trump $22 million for suspending his account after Jan. 6 riot - Axios",
      "YouTube agrees to pay Trump $24.5 Million to settle lawsuit over suspended account",
      "YouTube agrees to pay Trump $24.5m to settle lawsuit over account suspension",
      "YouTube to pay $22 million to Trump to settle post-January 6 ban case",
      "YouTube caves to Trump with $24.5 million settlement",
      "Trump obtains another settlement as YouTube agrees to pay $24.5 million"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.831,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.841,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "YouTube has agreed to pay $24.5 million to settle a lawsuit filed by President Donald Trump, stemming from the suspension of his account after the January 6, 2021 Capitol riot. This agreement resolves the legal dispute over the platform's decision to block Trump in the aftermath of the Capitol attack.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Labour Unveils Tax Strategy, Albanese Endorses Gaza Peace Plan Excluding Hamas",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 30 Sep 2025 06:42:55 GMT",
    "source": "BBC",
    "sources": [
      "Al Jazeera",
      "BBC",
      "Financial Times",
      "The Guardian",
      "Deutsche Welle"
    ],
    "domains": [
      "www.ft.com",
      "www.dw.com",
      "www.theguardian.com",
      "www.bbc.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Donald Trump says if Hamas rejects the plan, Israel will have US backing to \"finish the job of destroying the threat\" from the armed group.",
      "Labour's tax positions over the forthcoming Budget and a 20-point Gaza peace plan lead the papers.",
      "The Palestinian Authority joins regional leaders in welcoming the US president&#039;s 20-point peace plan to end war in Gaza.",
      "Proposal calls for an immediate end to the conflict and the release of all remaining hostages",
      "<p>Plan calls for immediate end to war between Israel and Hamas but lacks detail on how key points will be executed</p><p>The White House peace plan for Gaza proposes an immediate end to the devastating war between Israel and Hamas that has raged in the coastal territory for nearly two years, while ",
      "Leaders from Arab and Muslim nations and Europe have welcomed the peace plan unveiled by Trump and Netanyahu, who have warned Hamas to accept the deal or Israel will 'finish the job' in Gaza. DW has more.",
      "US President Donald Trump said that many Arab nations support his plan to end the nearly two-year-long war in Gaza. He and Israeli Prime Minister Benjamin Netanyahu called on Hamas to accept the plan. Follow DW for more.",
      "<p>Senior Hamas official says group will begin studying the proposals today, but it remains unclear when it will give a response</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/sep/29/trump-peace-plan-gaza-israel-hamas\">What’s in Trump’s 20-point peace plan for Gaza?</a></p></li></ul><"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/1bf8/live/0b64c870-9dae-11f0-b741-177e3e2c2fc7.jpg",
    "titles": [
      "Leaders in Middle East and Europe welcome Trump's Gaza peace plan",
      "The Papers: Labour 'opens door' to tax rise and Trump's Gaza peace plan",
      "How Arab nations, rest of the world reacted to Trump’s Gaza peace plan",
      "Netanyahu says Israel backs Trump’s peace plan for Gaza",
      "What’s in Trump’s 20-point peace plan for Gaza?",
      "Middle East: Gaza peace plan awaits Hamas response",
      "Middle East: Trump, Netanyahu call for Hamas to accept plan",
      "Hamas says it will study Trump Gaza plan, as Netanyahu warns Israel will ‘finish the job’ if deal rejected – Middle East crisis live"
    ],
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.95,
      "consensus": 0.995,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.829,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Labour's tax strategies for the upcoming Budget and a 20-point Gaza peace plan are highlighted in recent news. Anthony Albanese has endorsed the exclusion of Hamas from future governance in Gaza and calls for Hamas to accept the peace terms.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "FBI Probes Church Attack; Trump Proposes Gaza Peace Plan",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Mon, 29 Sep 2025 07:11:39 -0400",
    "source": "NPR",
    "sources": [
      "Axios",
      "Al Jazeera",
      "Financial Times",
      "Deutsche Welle",
      "NPR"
    ],
    "domains": [
      "www.ft.com",
      "www.dw.com",
      "www.npr.org",
      "news.google.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "The FBI is searching for answers as to why a man drove his truck into a church yesterday and opened fire. And, Trump has a new proposed plan to end the war in Gaza.",
      "The White House says its proposal would end the war on Gaza immediately if both sides accept.",
      "Israel&#039;s Benjamin Netanyahu has said he supports US President Trump’s 20-point plan to end the war on Gaza.",
      "US President Donald Trump has outlined a plan to end Israel’s war on Gaza.",
      "Donald Trump revealed a proposed plan to end the war in Gaza during Israeli Prime Minister Benjamin Netanyahu's visit to the White House. What exactly is in the 20-point plan?",
      "<a href=\"https://news.google.com/rss/articles/CBMifEFVX3lxTE9aSVhtd2RYb01zVU9QY256RGtvTmZ0blNiYVg0XzJPTEhCVEF0WkZxWnNPa0E2ZUhjR3FPQmdrX3UwbVNIeDEzNVhvbi1jeFV6MzhQVnJrMkxuRUZXWURDRk5XNk5MX0tCSExTRnB0YW4zSWxWRHhXTzRQQWk?oc=5\" target=\"_blank\">Netanyahu endorses Trump plan to end Gaza war</a>&nbsp;&nbsp",
      "The White House published its plan ahead of a press conference with Israeli Prime Minister Benjamin Netanyahu"
    ],
    "image_url": "",
    "titles": [
      "The latest on the Michigan church shooting. And, Trump's new plan to end war in Gaza",
      "Here’s the full text of Trump’s 20-point plan to end Israel’s war on Gaza",
      "Netanyahu says he supports Trump’s plan to end war on Gaza",
      "Trump outlines plan to end Israel’s war on Gaza",
      "What is Donald Trump's 20-point plan to end Gaza war?",
      "Netanyahu endorses Trump plan to end Gaza war - Axios",
      "Full text of Trump’s proposal to end the war in Gaza"
    ],
    "score_components": {
      "magnitude": 0.964,
      "recency": 0.646,
      "consensus": 0.995,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.8,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The FBI is investigating an incident where a man drove his truck into a church and began shooting. Meanwhile, Donald Trump has proposed a 21-point plan aimed at ending the war in Gaza, which he will discuss with Israeli Prime Minister Benjamin Netanyahu on Monday. The specifics of the plan are yet to be detailed.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Afghanistan Faces Nationwide Blackout as Taliban Cuts Fibre-Optics",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 30 Sep 2025 06:58:36 GMT",
    "source": "BBC",
    "sources": [
      "Deutsche Welle",
      "BBC",
      "Washington Post",
      "The Guardian"
    ],
    "domains": [
      "www.washingtonpost.com",
      "www.theguardian.com",
      "www.bbc.com",
      "www.dw.com"
    ],
    "snippets": [
      "Phone and internet links are down nationwide after the Taliban sever fibre-optic connections.",
      "On orders from the ruling Taliban, Afghanistan's telecommunications authorities have capped fiber optic internet access. It is unclear how long telephone and cellular networks will be affected, or to what degree.",
      "<p>Telecoms disrupted nationwide after authorities cut fibre-optic connections in several provinces to prevent ‘vice’</p><p>A huge communications blackout has hit Afghanistan after Taliban authorities began severing fibre-optic connections in several provinces to prevent “vice”.</p><p>“A nationwide ",
      "The internet, now in widespread blackout, has been a lifeline for Afghan women trying to access education — and for Taliban officials trying to run the country."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/0203/live/f08a4b00-9d68-11f0-a16f-ff7724a733bf.jpg",
    "titles": [
      "Afghanistan sees telecom shutdown as Taliban cut off internet",
      "Afghanistan: Taliban shuts down internet indefinitely",
      "Afghanistan hit by communications blackout after Taliban shuts internet",
      "Afghanistan’s internet goes down amid fears of a Taliban crackdown"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.955,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.78,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Afghanistan is experiencing a nationwide communications blackout after the Taliban ordered the cutting of fibre-optic connections to prevent \"immorality,\" affecting phone and internet services. The extent and duration of the disruption to telephone and cellular networks remain unclear. This follows an internet shutdown in several provinces two weeks prior, aimed at stopping \"immoral acts.\"",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Madagascar Protests: 22 Dead, President Dissolves Government",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Mon, 29 Sep 2025 22:42:06 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Deutsche Welle",
      "New York Times",
      "Al Jazeera",
      "The Guardian"
    ],
    "domains": [
      "www.nytimes.com",
      "www.theguardian.com",
      "www.aljazeera.com",
      "www.dw.com"
    ],
    "snippets": [
      "The demonstrations, which started over deteriorating living conditions, have left 22 people dead, according to the UN.",
      "At least 22 people were killed after protests broke out power cuts, water shortages and widespread poverty. The youth-led protesters named their movement Gen Z.",
      "<p>Demonstrations over water and power cuts inspired by ‘gen-Z’ protests elsewhere have left at least 22 dead, says UN</p><p><a href=\"https://www.theguardian.com/world/madagascar\">Madagascar</a>’s president, Andry Rajoelina, has dissolved the government after youth-led protests over water and power ",
      "Andry Rajoelina, the leader of the island nation in Africa, acknowledged grievances over power cuts and water shortages that have drawn thousands of young people to the streets."
    ],
    "image_url": "",
    "titles": [
      "Madagascar president dissolves government after youth-led deadly protests",
      "Madagascar president fires government after Gen Z protests",
      "Madagascar’s president dissolves government amid youth-led protests",
      "Madagascar’s President Dissolves Government Amid Deadly Protests"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.821,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.753,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "In Madagascar, protests led by the youth movement \"Gen Z\" over severe water and power shortages and escalating poverty resulted in at least 22 fatalities, as reported by the UN. The widespread demonstrations prompted President Andry Rajoelina to dissolve the government in response to the crisis.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Frank Founder Sentenced to 7 Years for Defrauding JPMorgan Chase",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Mon, 29 Sep 2025 22:59:48 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "CNBC",
      "TechCrunch",
      "Business Insider"
    ],
    "domains": [
      "techcrunch.com",
      "www.cnbc.com",
      "news.google.com",
      "www.businessinsider.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMijgFBVV95cUxQNXljdkdjNnJfS1hfRXdIWDVGX3RTdHMwelVPbFhTSmhid3hmb1ZwUmMyUC10UDFfQ2JDWUJ1aW5KNkNUOW1rWk1aSEdtc2lHNmd4TnBILUZHbm14UER0MVgxdFF6NzdpQW5QcXR6UXBKZndLQnVUSjhWdXpLUXJoM3NlLUctNVVjdnV1akxn?oc=5\" target=\"_blank\">Charlie Javice sentenced to 7 years",
      "Charlie Javice, founder of college financial aid platform Frank, was arrested in 2023 on charges she defrauded JPMorgan Chase in the sale of the fintech firm.",
      "Charlie Javice got a 7-year prison sentence for defrauding JPMorgan Chase in the $175M sale of her fintech startup Frank.",
      "The fintech startup had been acquired by JPMorgan Chase in 2021 for $175 million. The bank later accused Frank of lying about its customer base."
    ],
    "image_url": "",
    "titles": [
      "Charlie Javice sentenced to 7 years in prison for defrauding JP Morgan - Axios",
      "Startup founder Charlie Javice sentenced to 7 years in prison for defrauding JPMorgan Chase",
      "Charlie Javice sentenced to 7 years in prison for JPMorgan Chase fraud",
      "Frank founder Charlie Javice sentenced to 7 years in prison for defrauding JPMorgan Chase"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.809,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.751,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Charlie Javice, the founder of the fintech startup Frank, was sentenced to 7 years in prison for defrauding JPMorgan Chase during the company's sale for $175 million in 2021. Javice was arrested in 2023 after the bank accused her of falsely inflating Frank's customer base.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "School Collapse in East Java Kills One, Traps 65, Injures Dozens",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Tue, 30 Sep 2025 06:14:43 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Deutsche Welle",
      "Al Jazeera",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.aljazeera.com",
      "www.dw.com"
    ],
    "snippets": [
      "Indonesia&#039;s National Agency for Disaster Management says 77 victims were taken to hospitals for treatment.",
      "The Islamic school building collapsed while dozens of young students were attending afternoon prayers. Rescuers said they have seen several bodies buried in the rubble.",
      "<p>Death toll expected to rise as instability of building in East Java town hampers rescue efforts </p><p>At least one student has been killed, dozens injured and 65 presumed buried under rubble after a school building collapsed in Indonesia on Monday, with rescuers running oxygen and water to those"
    ],
    "image_url": "",
    "titles": [
      "School collapse in Indonesia leaves three dead, 38 missing",
      "Indonesia: Dozens trapped in school building collapse",
      "Indonesia school collapse: one dead, 65 buried under rubble as rescuers race to find survivors"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.96,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.746,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A school building collapse in East Java, Indonesia, has resulted in at least one student dead, dozens injured, and 65 presumed trapped under the rubble. The incident occurred while students were attending afternoon prayers. Rescue efforts are hindered by the building's instability, but rescuers are providing oxygen and water to those trapped. The National Agency for Disaster Management reported that 77 victims have been hospitalized.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Nuno Espirito Santo's West Ham Debut Ends in 1-1 Draw with Everton",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 29 Sep 2025 21:28:11 GMT",
    "source": "BBC",
    "sources": [
      "Sky Sports",
      "Yahoo Sports",
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.skysports.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Watch Premier League highlights as new West Ham United manager Nuno Espirito Santo earns a draw at Everton in his first match in charge.",
      "All the reaction to the Premier League 1-1 draw between Everton and West Ham.",
      "<p>Only 20 days after <a href=\"https://www.theguardian.com/football/2025/sep/09/nottingham-forest-part-company-with-head-coach-nuno-espirito-santo\">his sacking by Nottingham Forest</a>, Nuno Espírito Santo was <a href=\"https://www.theguardian.com/football/2025/sep/27/graham-potter-sacked-by-west-ham",
      "FREE TO WATCH: Highlights from Everton&#8217;s match against West Ham in the Premier League."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/9dd1/live/62fbb780-9d7a-11f0-928c-71dbb8619e94.jpg",
    "titles": [
      "Bowen earns new West Ham boss Nuno draw at Everton",
      "Premier League reaction: Nuno's West Ham era begins with draw at Everton",
      "Bowen hits back at Everton to secure point for West Ham in Nuno’s first game",
      "Bowen snatches first point for Nuno’s West Ham!"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.783,
      "consensus": 0.888,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.741,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Nuno Espirito Santo began his tenure as West Ham United manager with a 1-1 draw against Everton in his first Premier League match in charge. This comes only 20 days after his departure from Nottingham Forest. In the match at the Hill Dickinson Stadium, Jarrod Bowen scored, marking a promising start under Santo's leadership. Despite the draw, Santo acknowledged that his team has much to learn.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump, Congress Leaders to Meet in Bid to Avert Shutdown",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Tue, 30 Sep 2025 05:33:37 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Financial Times",
      "CNBC",
      "Al Jazeera"
    ],
    "domains": [
      "www.ft.com",
      "www.cnbc.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Congressional Democrats and Republicans failed to reach a spending deal after meeting with US President Donald Trump.",
      "President Donald Trump and congressional leaders from both parties are set to meet at 3 p.m. for 11th hour talks.",
      "Federal funding set to run out on Wednesday morning unless lawmakers reach agreement"
    ],
    "image_url": "",
    "titles": [
      "VP Vance blames Democrats for looming US government shutdown",
      "Democrats refuse to cave on health care before meeting with Trump on government shutdown",
      "Vance warns US government is ‘headed to a shutdown’"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.947,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.74,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Top Congressional leaders and President Donald Trump are meeting at the White House in a final attempt to prevent a government shutdown. Despite claims of \"nothing to negotiate,\" the bipartisan discussions are scheduled for 3 p.m., aiming to find a resolution.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Typhoon Bualoi Kills 13 in Vietnam, Leaves 2M Without Power",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Tue, 30 Sep 2025 07:26:59 +0000",
    "source": "Al Jazeera",
    "sources": [
      "New York Times",
      "Al Jazeera",
      "The Guardian"
    ],
    "domains": [
      "www.nytimes.com",
      "www.theguardian.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "The deadly storm forces tens of thousands to evacuate and destroys thousands of homes.",
      "<p>Vietnamese authorities say typhoon was the most devastating storm to hit the country this year</p><p>The death toll from Typhoon Bualoi in south-east Asia has risen to more than 30 as heavy rains continued to lash the region.</p><p>In Vietnam, authorities said 19 people had been killed and 21 wer",
      "At least 13 people were killed and dozens more injured in central Vietnam, where 2 million were without power. Bualoi’s deadly path had started with 10 deaths in the Philippines."
    ],
    "image_url": "",
    "titles": [
      "Typhoon Bualoi kills dozens in Vietnam and Philippines",
      "Typhoon Bualoi death toll rises to at least 30 across Vietnam, Thailand and Philippines",
      "Typhoon Bualoi Slams Into Central Vietnam, Adding to Death Toll"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.985,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.734,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Typhoon Bualoi hit Vietnam's coast earlier than predicted, causing significant destruction and at least 13 deaths in central Vietnam, with dozens injured. The storm, which previously resulted in 10 deaths in the Philippines, left 2 million people without power in Vietnam. Authorities are evacuating thousands and warning of flash floods and landslides.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Dolphins Receiver Suffers Season-Ending Knee Injury vs. Jets",
    "domain": "sports",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Tue, 30 Sep 2025 05:06:59 +0000",
    "source": "Al Jazeera",
    "sources": [
      "CBS Sports",
      "Al Jazeera",
      "ESPN"
    ],
    "domains": [
      "www.cbssports.com",
      "www.espn.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "The Miami Dolphins wide receiver suffered what is believed to be a season-ending injury against the New York Jets.",
      "What is the Dolphins WR's outlook for a dislocated knee, the on-field impact of his absence and his future in Miami.",
      "Hill is apparently making the best of a rough situation"
    ],
    "image_url": "",
    "titles": [
      "Dolphins’ Tyreek Hill suffers severe knee injury against Jets in NFL",
      "Tyreek Hill injury FAQ: Recovery timetable, his NFL future and how Dolphins will adapt",
      "Tyreek Hill injury: Dolphins wideout 'in good spirits' despite devastating knee injury vs. Jets"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.938,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.734,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A Miami Dolphins wide receiver sustained a dislocated knee in a game against the New York Jets, likely ending his season. Despite the setback, he remains positive about his situation. The injury impacts the team's on-field performance and raises questions about his future with the Dolphins.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: sustain",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump's Gaza Cease-Fire Plan Draws Mixed Reactions, Netanyahu Threatens Action",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Tue, 30 Sep 2025 02:35:21 +0000",
    "source": "Al Jazeera",
    "sources": [
      "New York Times",
      "Al Jazeera",
      "The Guardian"
    ],
    "domains": [
      "www.nytimes.com",
      "www.theguardian.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "They say they have, but on Gaza&#039;s security and long-term governance, Netanyahu appears to differ from the plan.",
      "President Trump said Israel would have a green light to “finish the job” if Hamas refused to agree to the cease-fire deal.",
      "<p>Pair say proposal represents new chapter but Israeli PM threatens to ‘finish the job’ if Hamas officials fail to agree</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/sep/30/trump-gaza-proposal-peace-reactions-welcomed-world-leaders-palestinian-residents-remain-sceptical\"><strong>Tr"
    ],
    "image_url": "",
    "titles": [
      "Have Trump and Netanyahu really agreed on a Gaza peace plan? Key takeaways",
      "Trump and Netanyahu Tell Hamas to Accept Gaza Cease-Fire Plan, Or Else",
      "Trump and Netanyahu to Hamas: accept Gaza peace plan or face consequences"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.89,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.732,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "President Trump's proposal for a cease-fire in Gaza received mixed reactions, with some leaders welcoming it as a new chapter. However, Israeli Prime Minister Netanyahu threatened military action against Hamas if they reject the deal, indicating a potential divergence on the plan's implications for Gaza's future security and governance.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump, Congress Leaders to Meet in Bid to Avert Shutdown",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 30 Sep 2025 01:28:36 GMT",
    "source": "BBC",
    "sources": [
      "Axios",
      "BBC",
      "ABC News"
    ],
    "domains": [
      "abcnews.go.com",
      "news.google.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Democrats say there are still \"very large differences\" between the two sides, while Republicans have accused them of  \"not doing the right thing\".",
      "<a href=\"https://news.google.com/rss/articles/CBMimgFBVV95cUxQNUxnUXRpSVRLdlZPY0gzS3NxeTBqZFBNS1ltY0JIUnJXZ1Btemp5MGZOUXlUVy0wRXAzNGZoUGVPQS15Qy1ZYkJUWHZoaXA5NFNtTmRGNEJfajZJRjRGb191Tlh3c1N5YXE1VDhDRDNPNzhwYVFydmVYRUQzMlhJZmpMX2JmZzVmSmw4S3d1TkYySVk2REZnUDlR?oc=5\" target=\"_blank\">Trump, Democrats le",
      "Top Congressional leaders are at the White House on Monday to meet with President Donald Trump in a last-ditch effort to avert a government shutdown."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/4382/live/47d00c30-9d8a-11f0-92db-77261a15b9d2.jpg",
    "titles": [
      "US shutdown looms after Trump and Democrats end meeting without a deal",
      "Trump, Democrats leave meeting without deal to avoid government shutdown - Axios",
      "WATCH:  Trump to meet with top Democrats as shutdown looms"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.852,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.721,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Top Congressional leaders and President Donald Trump are meeting at the White House in a final attempt to prevent a government shutdown. Despite claims of \"nothing to negotiate,\" the bipartisan discussions are scheduled for 3 p.m., aiming to find a resolution.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Bruce Bochy to Leave Rangers' Manager Role, Offered Front Office Position",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Tue, 30 Sep 2025 01:09:05 +0000",
    "source": "CBS Sports",
    "sources": [
      "Sportsnet",
      "CBS Sports",
      "Sports Illustrated"
    ],
    "domains": [
      "www.cbssports.com",
      "www.sportsnet.ca",
      "news.google.com"
    ],
    "snippets": [
      "Texas said Bochy has been offered a front office advisory role",
      "<a href=\"https://news.google.com/rss/articles/CBMikgFBVV95cUxOc3lVSktUWlY3WmRpQTNHaVRsZUZRTWRQN1c5ekhpeGZLSFNBY0hWSERVMVpUUW9MQkF4SEY5WjdpdFRwYkNwLVB2b05kak9BSkFweXBxODEwbFIxc0pQcFNtWTBJMm5NSGNxdEV5WEJmRHNUajZGV25idG4xaG1wa3E3MHdsdm91RmxweEI3M3hoQQ?oc=5\" target=\"_blank\">Rangers Moving on From Bruce ",
      "<a href=\"https://news.google.com/rss/articles/CBMigAFBVV95cUxQUnpUT0hEQ1oyZXM5UTZOS3J0ZEFzdDR5b3cyQzZjdV9BazdZUFBMNG8yc2tPVGNKUmhjTlZUcXVHTFlKOHJUb25VdlZINWxyRzZ5eWZVMmcxQThoYXZfenBwM2JrRDlONUNicjBMNFFtU244SVZFaFJxMzBEZjJFRw?oc=5\" target=\"_blank\">‘I’m Following’—Man Utd Manager Target Speaks Out on ",
      "<p>The Texas Rangers announced on Monday that manager Bruce Bochy, who led the team to a World Series in 2023, won&#8217;t return as the team&#8217;s manager in 2026.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/30/4ddc4248-e3fe-4bea-837b-c9b662a5a7f2/bochy-getty.png",
    "titles": [
      "Bruce Bochy out as Rangers manager after three seasons, 2023 World Series title",
      "Rangers Moving on From Bruce Bochy As Manager After Three Seasons - Sports Illustrated",
      "‘I’m Following’—Man Utd Manager Target Speaks Out on Red Devils Interest - Sports Illustrated",
      "Bruce Bochy won’t return as Rangers manager in 2026"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.864,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.71,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Texas Rangers announced that Bruce Bochy, who managed the team to a World Series win in 2023, will not return as manager in 2026. Instead, Bochy has been offered a front office advisory role with the Rangers.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Flames Beat Kraken 2-1 in Shootout at Pre-Season Game",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Tue, 30 Sep 2025 05:09:15 +0000",
    "source": "Global News",
    "sources": [
      "Sportsnet",
      "Global News"
    ],
    "domains": [
      "globalnews.ca",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Matvei Gridin and Morgan Frost scored in the shootout and netminder Dustin Wolf took care of the rest as the Calgary Flames edged the Seattle Kraken 2-1 in NHL pre-season action at Climate Pledge Arena on Monday.",
      "<p>Watch as 2024 first-round pick Matvei Gridin scores the shootout winner for the Calgary Flames.</p>"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/66acc8b2c205e7163f50bad7c41a7d6edd1eeb9147bbd8758049b9a1965f1b89.jpg?quality=65&strip=all",
    "titles": [
      "Wolf shines as Flames beat Kraken in shootout",
      "Flames’ Gridin snipes shootout winner vs. Kraken"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.939,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.693,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In an NHL pre-season game at Climate Pledge Arena, the Calgary Flames defeated the Seattle Kraken 2-1 in a shootout. Matvei Gridin and Morgan Frost scored for the Flames during the shootout, with Gridin netting the winning goal. Goalie Dustin Wolf secured the victory by stopping shots from the Kraken.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Canada Labels Bishnoi Gang as Terrorist, Seizes Assets",
    "domain": "general",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Mon, 29 Sep 2025 17:38:05 GMT",
    "source": "The Guardian",
    "sources": [
      "CityNews",
      "Global News",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "globalnews.ca",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "<p>Canadian government accuses the Lawrence Bishnoi gang of being involved in murder of prominent Sikh activist Hardeep Singh Nijjar near Vancouver</p><p>Canada’s federal government has announced that a powerful and ruthless Indian gang which uses “murder, shootings and arson” to extort and intimida",
      "Public Safety Minister Gary Anandasangaree announced the designation in a news release Monday, saying it will help Canadian security, intelligence and police agencies.",
      "Canada has listed the Bishnoi gang as a terrorist entity, following calls from Conservative and NDP politicians. The listing bars Canadians from financing or aiding the group led by Lawrence Bishnoi, the gang&#8217;s leader in India, who has reportedly coordinated criminal activities from a cellphon"
    ],
    "image_url": "https://i.guim.co.uk/img/media/3e6fe0d491a575c5d505001e91132d96e7268bf4/686_275_1130_904/master/1130.jpg?width=140&quality=85&auto=format&fit=max&s=5327c73a69e1f37027804a86d5765837",
    "titles": [
      "Canada designates Indian gang linked to high-profile killings as terrorist entity",
      "B.C. government welcomes Canada listing India-based Bishnoi gang as terrorist entity",
      "Canada lists the Bishnoi gang as a terrorist entity"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.723,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.691,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Canada has officially designated the India-based Bishnoi gang as a terrorist entity, led by Lawrence Bishnoi. This action enables Canadian authorities to seize property and freeze accounts associated with the gang. The decision follows advocacy from Conservative and NDP politicians, aiming to prevent Canadians from financially supporting or assisting the group's criminal activities.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Anthropic Unveils Claude Sonnet 4.5 AI, Masters Coding with Business Focus",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Mon, 29 Sep 2025 17:32:41 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "TechCrunch",
      "Fortune"
    ],
    "domains": [
      "techcrunch.com",
      "fortune.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMieEFVX3lxTE1SMkpRU0ZzVks1d2Vrd0xqeTFSYTZoakwxSWlkV0JkRzl6c1owZ2k0cTVnYzQyTUxLV3Z0dHNiLWNfQV9iYkswX1A1U0pqbm8ydmpyRnF0Y2RuRWhfSGhOQUZWaG43QlljTmx2eFdrRzdNQzRjQXVYcg?oc=5\" target=\"_blank\">Anthropic's Claude Sonnet 4.5 can work autonomously for 30 hours<",
      "Anthropic’s latest Claude model, Sonnet 4.5, shows gains in coding and autonomous task completion.",
      "Anthropic says its new AI model is robust enough to build production-ready applications, rather than just prototypes."
    ],
    "image_url": "",
    "titles": [
      "Anthropic's Claude Sonnet 4.5 can work autonomously for 30 hours - Axios",
      "Anthropic releases Claude Sonnet 4.5, a model it says can build software and accomplish business tasks autonomously",
      "Anthropic launches Claude Sonnet 4.5, its best AI model for coding"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.722,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.688,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Anthropic introduced Claude Sonnet 4.5, an AI model they claim is the best for coding tasks, emphasizing its practical business applications. It autonomously coded a chat app similar to Slack or Teams, producing 11,000 lines of code in 30 hours. The company highlights the model's capability to create production-ready applications, marking a significant advancement in applied artificial intelligence.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Sirianni Addresses A.J. Brown's Cryptic Tweet Amid Performance Queries",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 30 Sep 2025 01:54:47 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "Eagles coach Nick Sirianni, asked about A.J. Brown's cryptic tweet following Sunday's game, said he believes Brown wants to remain in Philadelphia.",
      "Brown posted a bible verse on social media after a puzzling four-game stretch"
    ],
    "image_url": "",
    "titles": [
      "Sirianni: Brown's desire is to remain with Eagles",
      "Eagles' Nick Sirianni responds to A.J. Brown's cryptic post: 'I question nothing about his desire to be here'"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.954,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.671,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Eagles coach Nick Sirianni addressed concerns about A.J. Brown's cryptic tweet, which followed a perplexing four-game performance. Despite speculation of unhappiness due to his role amid the team's victories, Sirianni believes Brown wants to stay in Philadelphia. The tweet in question featured a bible verse, sparking inquiries about Brown's contentment with the Eagles.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Dolphins' Tyreek Hill Hospitalized After Knee Injury in Win Over Jets",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 30 Sep 2025 01:54:47 EST",
    "source": "ESPN",
    "sources": [
      "Sky Sports",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.skysports.com"
    ],
    "snippets": [
      "Dolphins wide receiver Tyreek Hill dislocated his knee during Monday night's game and was to remain hospitalized overnight, according to coach Mike McDaniel.",
      "Miami Dolphins' Tyreek Hill was hospitalised overnight and had scans on a 'dislocated knee' during the 27-21 win over the New York Jets."
    ],
    "image_url": "",
    "titles": [
      "Hill carted off in Dolphins' win with dislocated knee",
      "Dolphins star Hill has scans on 'dislocated knee'"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.954,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.671,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Miami Dolphins wide receiver Tyreek Hill was hospitalized overnight for scans after dislocating his knee during the team's 27-21 victory over the New York Jets on Monday night, as confirmed by coach Mike McDaniel.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Opera Introduces AI-Powered Browser Neon at $19.90/Month",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-09-30T04:00:00-04:00",
    "source": "The Verge",
    "sources": [
      "TechCrunch",
      "The Verge"
    ],
    "domains": [
      "www.theverge.com",
      "techcrunch.com"
    ],
    "snippets": [
      "A limited number of people will get to try out Opera’s AI browser, Neon, starting today for $19.90 per month.&#160; The Norwegian software company first announced the “agentic browser” in May, but details were sparse. Now, we know that Opera Neon includes different AI agents that are tailored to spe",
      "Neon will write code snippets, includes an agent that will do tasks for you, and handles repeatable prompts."
    ],
    "image_url": "",
    "titles": [
      "Opera launches its AI browser, but you&#8217;ll have to pay to try it",
      "Opera launches its AI-centric Neon browser"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.996,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.661,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Opera has launched its AI-powered browser, Neon, available to a limited number of users for $19.90 per month. Announced in May, Neon features AI agents that can write code snippets, perform tasks, and manage repeatable prompts, aiming to enhance user productivity and browsing experience.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "US-Proposed Peace Plan for Gaza Gains Support, Uncertainty Remains",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 30 Sep 2025 02:18:29 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The proposal may shift the focus towards negotiation, but longstanding issues mean achieving peace will be difficult.",
      "<p>The US president has won regional backing, but Hamas’s response and Israel’s intentions leave the outcome in doubt</p><p>At first glance, the 20-point plan outlined by President Trump and agreed by Benjamin Netanyahu appears more likely to end the two-year conflict in Gaza than anything we have s"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/ed3e/live/8f22f550-9d9b-11f0-92db-77261a15b9d2.jpg",
    "titles": [
      "Trump's Gaza plan is a significant step - but faces fundamental obstacles",
      "Trump’s plan for Gaza is ambitious but peace is far from guaranteed"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.867,
      "consensus": 0.591,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.655,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Palestinian Authority and regional leaders have endorsed a 20-point peace plan proposed by US President Trump to end the two-year conflict in Gaza. The plan, supported by Benjamin Netanyahu, aims to bring peace, but the responses from Hamas and the intentions of Israel remain uncertain, casting doubt on the plan's effectiveness.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: plan, support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "LeBron James Suggests Career End Near in 23rd NBA Season",
    "domain": "sports",
    "source_domain": "www.skysports.com",
    "location": "global",
    "published": "Tue, 30 Sep 2025 08:45:00 BST",
    "source": "Sky Sports",
    "sources": [
      "Sky Sports",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.skysports.com"
    ],
    "snippets": [
      "Los Angeles Lakers' LeBron James says the end is coming 'a lot sooner than later' for his NBA career.",
      "<p>LeBron James reported to his 23rd training camp on Monday and gave no indication whether it will be his last.</p>"
    ],
    "image_url": "https://e2.365dm.com/25/05/1920x1080/skysports-lebron-james-basketball_6902378.jpg?20250501091728",
    "titles": [
      "LeBron: NBA retirement coming 'sooner than later'",
      "LeBron James not thinking about retirement or son Bryce’s NBA future"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.991,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.653,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "LeBron James, during his 23rd NBA training camp with the Los Angeles Lakers, hinted that the end of his basketball career is approaching \"a lot sooner than later,\" though he did not confirm if this season would be his last.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Flick Readies Team for Game; Barcelona Gets Injury Boost, Chiesa Out",
    "domain": "sports",
    "source_domain": "www.barcablaugranes.com",
    "location": "national",
    "published": "Tue, 30 Sep 2025 07:00:00 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports",
      "Sports Illustrated"
    ],
    "domains": [
      "www.barcablaugranes.com",
      "news.google.com"
    ],
    "snippets": [
      "Hansi Flick’s possible XI for Wednesday’s big game",
      "<a href=\"https://news.google.com/rss/articles/CBMiigFBVV95cUxQX0I5dWpFQ21LR3M5Z29HXzFpbXp6RG52X1p2dmhZSkJqYUdCTk9sYUpOb2RLMjBZQU1zenM0a3NwN3dhQmtKNVpjNnZfNkF3M25FZjZ6ZFJROHZXRFF6UkZ1X3J5S01xNl9sTkpCYms5UGJ3YU1RdzRnWl9WVVFrUEk2SEZhbVhFOVE?oc=5\" target=\"_blank\">Barcelona Given Double Injury Boost Befo",
      "<a href=\"https://news.google.com/rss/articles/CBMiigFBVV95cUxNZTNqY0VzNWFiOTB0LTcxRXhGbTdCWFRKUklhdVJ1WW9PQ2hMbDBLb2VtUEFTUHQ1WkVUbFRrelhtdmthM3ZGT2dCbmJKdVozMHIyYVR0R2lkWGFPS19CTXd1d3FiejZTcWJTU1ZEQVZQb2tzMndfT2R5NkhOemdfcXpoTWxmdTllM0E?oc=5\" target=\"_blank\">Report: Why Federico Chiesa Is Not in Li"
    ],
    "image_url": "",
    "titles": [
      "How will Barcelona line up against PSG in a monster Champions League match?",
      "Barcelona Given Double Injury Boost Before PSG Champions League Clash - Sports Illustrated",
      "Report: Why Federico Chiesa Is Not in Liverpool’s Champions League Squad - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.976,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.65,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Hansi Flick is preparing his team for Wednesday's big game, with Barcelona receiving a double injury boost ahead of the match. Meanwhile, Federico Chiesa is reported not to be in the lineup for undisclosed reasons. The current status focuses on team preparations and lineup adjustments for the upcoming game.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Zijin Gold Expands Globally, Among Fastest-Growing Producers",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Tue, 30 Sep 2025 07:20:28 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Fortune"
    ],
    "domains": [
      "fortune.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "Zijin Gold is the overseas gold-mining arm of China's Zijin Mining that operates all of the group's gold mines outside China.",
      "The company is one of the world's fastest-growing gold producers, with interests in 8 mines located in regions like Central Asia and Africa."
    ],
    "image_url": "",
    "titles": [
      "China's Zijin Gold surges over 60% in Hong Kong debut after world's second-largest IPO this year",
      "Zijin Gold shares surge over 60% in Hong Kong debut as prices for the precious metal hit record highs"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.962,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.647,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Zijin Gold, the international gold-mining division of China's Zijin Mining, operates the group's gold mines outside of China. It is among the world's fastest-growing gold producers, with interests in 8 mines across Central Asia and Africa.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "VP Vance Warns of Shutdown Amid Funding Deal Dispute, Coal Policy Looms",
    "domain": "business",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Mon, 29 Sep 2025 18:28:37 -0400",
    "source": "ABC News",
    "sources": [
      "CNBC",
      "ABC News"
    ],
    "domains": [
      "abcnews.go.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "After a meeting with congressional leaders at the White House on Monday, Vice President Vance says \"I think we're headed to a shutdown.\"",
      "Democrats have insisted that any short-term funding deal to avoid a shutdown of the U.S. government include an extension of enhanced Obamacare subsidies."
    ],
    "image_url": "https://s.abcnews.com/images/US/repub-1-ap-gmh-250929_1759179668490_hpMain_4x3t_384.jpg",
    "titles": [
      "Trump admin live updates: Vance says 'we're headed to a shutdown'",
      "'We're headed to a shutdown,' Vance says after Trump meeting with leaders ends"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.817,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.635,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "After a meeting with congressional leaders, Vice President Vance indicated a potential government shutdown due to disagreements over a short-term funding deal, particularly Democrats' demand for an extension of enhanced Obamacare subsidies. Federal funding is set to expire on Wednesday unless an agreement is reached. Concurrently, Trump officials plan to announce policies to increase coal output.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "California Enacts AI Transparency Law, Mandates Safety Disclosures",
    "domain": "technology",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Mon, 29 Sep 2025 21:04:07 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMiekFVX3lxTE1ETDZIR1NSbnh6aGFSclI0b0d0cENGOWFscDQ0RWRSR01yZ1c4Y0tGdkN6UVU2M0lhX3l4c0JBMlJmMFI2WTFsMElDcVQ3STQ2X0pfcG41bEh6TmhzZ0haVC1yTGpmUVBGQXJKcXhsdksxcjlRcWU2Ry1n?oc=5\" target=\"_blank\">Newsom signs major California AI bill</a>&nbsp;&nbsp;<font colo",
      "SB 53 requires large AI labs – including OpenAI, Anthropic, Meta, and Google DeepMind – to be transparent about safety protocols. It also ensures whistleblower protections for employees at those companies."
    ],
    "image_url": "",
    "titles": [
      "Newsom signs major California AI bill - Axios",
      "California Governor Newsom signs landmark AI safety bill SB 53"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.777,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.617,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "California Governor Gavin Newsom signed Senate Bill 53, the \"Transparency in Frontier Artificial Intelligence Act,\" into law. Authored by Sen. Scott Wiener, the legislation mandates large AI labs like OpenAI, Anthropic, Meta, and Google DeepMind to disclose their safety protocols and provides whistleblower protections for their employees. This landmark bill aims to increase transparency in the AI industry.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "OpenAI Adds Parental Controls to ChatGPT, Aiming to Curb Harmful Content",
    "domain": "technology",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Mon, 29 Sep 2025 19:47:55 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMic0FVX3lxTE1zaEFuNXVrdGFLd0RLY29oRm8zSkNqanl0UEcxb01sU2ZBbXhfei1XZFRmYmNwRUFqVVVaOXFDaWFDbjJLVWtGS1J1R0tobjdZRnFNVVRhQkVRaGRzRjVzdXlha19DTzBVcWVKVXFNaDhDbk0?oc=5\" target=\"_blank\">How OpenAI's new ChatGPT parental controls work</a>&nbsp;&nbsp;<font col",
      "The new safety features come after numerous incidents of ChatGPT validating users' delusional thinking instead of redirecting harmful conversations -- including the death of a teenage boy by suicide."
    ],
    "image_url": "",
    "titles": [
      "How OpenAI's new ChatGPT parental controls work - Axios",
      "OpenAI rolls out safety routing system, parental controls on ChatGPT"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.757,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.613,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "OpenAI introduced new parental controls for ChatGPT on the web, with mobile updates expected soon. These controls aim to limit or eliminate content such as sexual roleplay and image generation. This update follows incidents where ChatGPT was criticized for not adequately handling harmful conversations, including a case linked to a teenager's suicide.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "TechCrunch Disrupt 2025 Volunteer Apps Close Tonight; Baiju Bhatt to Speak",
    "domain": "technology",
    "source_domain": "techcrunch.com",
    "location": "global",
    "published": "Mon, 29 Sep 2025 15:00:00 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com"
    ],
    "snippets": [
      "If you’ve been thinking about applying to volunteer at TechCrunch Disrupt 2025, this is it — applications close tonight at 11:59 p.m. PT. Only accepting local Bay Area applicants.",
      "Baiju Bhatt, co-founder of Robinhood and founder of Aetherflux, shares insights on building transformative companies in fintech and aerospace at TechCrunch Disrupt 2025."
    ],
    "image_url": "",
    "titles": [
      "Final day to apply: Volunteer at TechCrunch Disrupt 2025",
      "From Robinhood to Aetherflux: Baiju Bhatt’s next frontier at TechCrunch Disrupt 2025"
    ],
    "score_components": {
      "magnitude": 0.393,
      "recency": 0.699,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.415,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Applications for volunteering at TechCrunch Disrupt 2025 close tonight at 11:59 p.m. PT, and only local Bay Area applicants are eligible. In related news, Baiju Bhatt, co-founder of Robinhood and founder of Aetherflux, will speak at the event, sharing insights on creating transformative companies in fintech and aerospace.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]