[
  {
    "title": "Macrons Sue Candace Owens for Defamation Over False Claims",
    "domain": "general",
    "location": "global",
    "published": "Thu, 24 Jul 2025 06:29:14 +0000",
    "source": "Al Jazeera",
    "sources": [
      "The Guardian",
      "Washington Post",
      "Al Jazeera",
      "Axios",
      "CNBC"
    ],
    "domains": [
      "business",
      "general"
    ],
    "snippets": [
      "According to the Macrons, Owens&#039;s podcast series spread &#039;verifiably false and devastating lies&#039;.",
      "<a href=\"https://news.google.com/rss/articles/CBMifkFVX3lxTE9pblBwNmFLTFVSVlRCWW5YZ0ZleUNDbjhnTDkyM3AzWGFPbHh2ZWtrd3A0OGI4UTNZZkxFUHROZHFXalNaTHFQRy1nX1Q1WHM4X2JtWDVhT2NhR2NxeTdHMzZBWXc5NmFJMFFoc1lFd0Z6QUEtRVRMVjNrTjU4dw?oc=5\" target=\"_blank\">Macrons sue Candace Owens for defamation</a>&nbsp;&nbsp;<",
      "The Macrons are represented by a law firm that helped Dominion Voting Systems obtain a huge settlement in a defamation case against Fox News' owner Fox Corp.",
      "<p>Owens has claimed that France’s first lady, Brigitte Macron, is a man, and that French president is controlled by CIA</p><p>The French president, <a href=\"https://www.theguardian.com/world/emmanuel-macron\">Emmanuel Macron</a>, and his wife, Brigitte Macron, are suing the rightwing commentator Can",
      "The lawsuit alleges that the podcaster promoted “outlandish” claims, including that Brigitte Macron was born a man. An Owens spokesperson said she “is not shutting up.”"
    ],
    "image_url": "",
    "titles": [
      "Macrons file defamation suit against right-wing US podcaster Candace Owens",
      "Macrons sue Candace Owens for defamation - Axios",
      "French President Macron, wife Brigitte sue Candace Owens for defamation from transgender claim",
      "French president and wife sue rightwing US commentator Candace Owens for defamation",
      "French President Macron sues right-wing podcaster Candace Owens"
    ],
    "score_components": {
      "magnitude": 0.82,
      "recency": 0.966,
      "consensus": 1.0,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.83,
    "summary": "French President Emmanuel Macron and his wife, Brigitte Macron, are suing right-wing commentator Candace Owens for defamation. The lawsuit is in response to Owens' claims that Brigitte Macron is a man and that Emmanuel Macron is controlled by the CIA. The Macrons' legal team previously secured a significant settlement for Dominion Voting Systems against Fox News' owner, Fox Corp. Owens' spokesperson stated she would not retract her statements.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about a defamation lawsuit involving the Macrons and Candace Owens. However, it does not provide actionable insights or a deeper understanding of the situation. It does not report on solutions or improvements, but it does highlight an attempt to address a problem, i.e., false claims.",
    "image": {
      "src": "https://live.staticflickr.com/4842/45197148355_a1a29160aa_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/1a760c3c-ac00-444a-85fc-3f4cda55792e/thumb/",
      "alt": "Encuentro entre la primera dama argentina, Juliana Awada y la primera dama francesa, Brigitte Macron",
      "credit": "G20 Argentina / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Court Blocks Trump's Citizenship Rule; Afghan Interpreter's Release Urged",
    "domain": "general",
    "location": "national",
    "published": "Thu, 24 Jul 2025 00:57:19 -0400",
    "source": "NPR",
    "sources": [
      "ABC News",
      "NPR",
      "The Guardian"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "The ruling keeps a block on the Trump administration from denying citizenship to children born to people who are in the United States illegally or temporarily.",
      "Trump's redefinition of citizenship will likely not take effect on July 27 as litigation over the merits of the order continues.",
      "<p>The 2-1 ruling from the ninth US circuit court of appeals brings issue one step closer to coming back before supreme court. This blog is now closed.</p><p>Lawmakers are calling for the release of an Afghan interpreter, who worked with the US military for years in his home country, who was seized "
    ],
    "image_url": "",
    "titles": [
      "Appeals court upholds block against Trump's effort to end birthright citizenship",
      "Trump admin live updates: Court rules against Trump's birthright citizenship EO",
      "Court blocks Trump’s ‘unconstitutional’ attempt to end birthright citizenship – as it happened"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.935,
      "consensus": 0.847,
      "constructiveness": 0.8,
      "proximity": 0.75
    },
    "score": 0.806,
    "summary": "A federal appeals court has maintained a block on the Trump administration's effort to deny citizenship to children born in the U.S. to individuals who are in the country illegally or temporarily. The 2-1 decision from the ninth U.S. circuit court of appeals indicates that Trump's redefinition of citizenship, scheduled for July 27, will be delayed due to ongoing litigation. This development suggests the matter may eventually reach the Supreme Court. Concurrently, there are calls from lawmakers for the release of an Afghan interpreter, previously allied with the U.S. military, who was detained.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story informs and contextualizes usefully. It provides the reader with actionable insights and deeper understanding about the ongoing litigation and its potential impacts. The story also highlights an attempt to solve a problem - the call for the release of the Afghan interpreter. However, it does not clearly highlight progress or solutions.",
    "image": {
      "src": "https://live.staticflickr.com/771/31916250044_4f321d6b90_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/db442196-9fb2-4a2a-8f9d-1687524e0d6a/thumb/",
      "alt": "mother of exiles",
      "credit": "Mitchell Haindfield / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Angara Airlines Plane Crashes Near Tynda, Russia; 49 Onboard, Rescue Underway",
    "domain": "general",
    "location": "global",
    "published": "Thu, 24 Jul 2025 07:35:23 GMT",
    "source": "BBC",
    "sources": [
      "Al Jazeera",
      "The Guardian",
      "ABC News",
      "BBC"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "The Angara airlines An-24 plane had disappeared from radar as it approached an airport in Amur region.",
      "Local emergencies ministry says the plane dropped off radar near the Amur region, bordering China.",
      "The Russian news agency Interfax reported the wreckage has been found.",
      "<p>Rescuers search for survivors after wreckage of Angara Airlines flight found on mountainside near Tynda airport</p><p>A passenger plane carrying 49 people has crashed in Russia’s far east and a search for survivors is under way, local officials have said.</p><p>The local emergencies ministry said"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/dc21/live/94f14d80-685b-11f0-92c5-5914466a17f2.jpg",
    "titles": [
      "Wreckage found after plane carrying 49 people goes down in Russian far east",
      "Debris of plane with 49 people aboard found in Russia’s far east: Interfax",
      "Wreckage found after Russian plane carrying dozens goes missing, officials say",
      "Passenger plane with 49 people onboard crashes in Russia’s far east"
    ],
    "score_components": {
      "magnitude": 0.82,
      "recency": 0.988,
      "consensus": 0.935,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.798,
    "summary": "An Angara Airlines An-24 plane, carrying 49 people, crashed in Russia's far east near Tynda airport in the Amur region, bordering China. The aircraft had disappeared from radar while approaching the airport. The wreckage was later found on a mountainside. A search for survivors is currently being conducted by rescue teams, as confirmed by local emergency services and reported by Interfax.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness of an event but lacks depth and insight. It doesn't offer actionable insights or deeper understanding for the reader. It does not report on solutions, improvements, or attempts to solve problems, nor does it increase clarity around systems, causes, trends, or impacts that matter.",
    "image": {
      "src": "https://live.staticflickr.com/5589/15147968852_3f9aa97d20_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/6d73b4de-e43e-44cd-afdc-e561e58e8ee0/thumb/",
      "alt": "Staraya Russa, Russia",
      "credit": "Lex Kravetski / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Spain Advances to First Women's Euro Final, Sets Up England Rematch",
    "domain": "general",
    "location": "global",
    "published": "Wed, 23 Jul 2025 23:31:25 GMT",
    "source": "BBC",
    "sources": [
      "Al Jazeera",
      "CBS Sports",
      "BBC",
      "Sportsnet"
    ],
    "domains": [
      "general",
      "sports"
    ],
    "snippets": [
      "Two years on from the World Cup final, England and Spain will meet again in what promises to be an \"amazing\" Euro 2025 final.",
      "Aitana Bonmati&#039;s strike in extra time downs Germany to send Spain into Women&#039;s Euro 2025 final against England.",
      "Spain will face England in Sunday's final of the Women's Euro, defeating Germany 1-0 after extra time to advance",
      "<p>Aitana Bonmatí scored in extra time to send Spain to its first-ever Women’s European Championship final with a 1-0 win over Germany on Wednesday, setting up a repeat of the 2023 World Cup final.</p>"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/5886/live/34159cd0-681c-11f0-af20-030418be2ca5.jpg",
    "titles": [
      "We meet again - England & Spain set for 'amazing' Euro 2025 final",
      "Spain beat Germany to set up Women’s Euro 2025 final with England",
      "Spain into Women's Euro final after edging Germany: Here's what England must do to stop World Cup champs",
      "Spain beats Germany to reach Euro 2025 final vs. England"
    ],
    "score_components": {
      "magnitude": 0.82,
      "recency": 0.835,
      "consensus": 0.985,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.78,
    "summary": "Spain will face England in the Women's Euro 2025 final after defeating Germany 1-0 in extra time, thanks to a goal from Aitana Bonmatí. This victory marks Spain's first-ever appearance in the Women’s European Championship final and sets up a rematch of the 2023 World Cup final between England and Spain.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about the Women's Euro 2025 final. However, it does not offer deeper understanding or actionable insights for the reader, nor does it report on solutions, improvements, or attempts to solve problems.",
    "image": {
      "src": "https://live.staticflickr.com/3855/14399618984_9213361a2b_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/3ad0638d-f6c4-4a43-bdf4-0278f83022dd/thumb/",
      "alt": "Spain",
      "credit": "NASA Goddard Photo and Video / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Supreme Court Limits Regulatory Agency Autonomy, Expands Presidential Power",
    "domain": "general",
    "location": "national",
    "published": "Wed, 23 Jul 2025 17:08:14 -0400",
    "source": "NPR",
    "sources": [
      "Al Jazeera",
      "NPR",
      "LA Times"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "The decision further limits a 90-year-old high-court precedent that was aimed at protecting the independence of certain regulatory agencies.",
      "The nation&#039;s highest court has frequently ruled in favour of Trump&#039;s expansive interpretation of presidential powers.",
      "<p>The court signaled again that it believes the president has the power to fire the leaders of agencies and commissions that Congress said were independent.</p>"
    ],
    "image_url": "",
    "titles": [
      "Supreme Court allows Trump to fire 3 Democrats on consumer safety panel",
      "US Supreme Court says Trump can remove Democrats from consumer safety panel",
      "Trump can fire the 3 Democrats on the Consumer Product Safety Commission, Supreme Court says"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.795,
      "consensus": 0.847,
      "constructiveness": 0.8,
      "proximity": 0.75
    },
    "score": 0.771,
    "summary": "The Supreme Court has further restricted a 90-year-old precedent designed to safeguard the autonomy of regulatory agencies. This decision aligns with the court's trend of supporting an expansive interpretation of presidential powers, indicating that the president can dismiss leaders of supposedly independent agencies and commissions, as per Congress's directives.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful information and context about a Supreme Court decision affecting the autonomy of regulatory agencies and the expansion of presidential powers. It increases clarity around the system and impacts that matter, even though it doesn't necessarily highlight progress or solutions.",
    "image": {
      "src": "https://ids.si.edu/ids/deliveryService?id=NPG-NPG_69_70Johnson-000002",
      "thumbnail": "https://api.openverse.org/v1/images/e972a2f6-8052-4c48-b111-e4523dea723c/thumb/",
      "alt": "Andrew Johnson",
      "credit": "",
      "license": "cc0",
      "license_version": "1.0",
      "license_url": "https://creativecommons.org/publicdomain/zero/1.0/",
      "provider": "smithsonian",
      "source": "Openverse"
    }
  },
  {
    "title": "Columbia University Pays $200M to Settle Antisemitism Probe, Restores Funding",
    "domain": "general",
    "location": "global",
    "published": "Thu, 24 Jul 2025 02:38:08 GMT",
    "source": "BBC",
    "sources": [
      "Al Jazeera",
      "BBC",
      "Deutsche Welle"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "The New York college becomes the first to agree to pay the Trump administration after it was investigated over campus antisemitism.",
      "Settlement marks victory in US President Donald Trump&#039;s efforts to exert greater control over third-level education.",
      "The Ivy League school said the settlement of Trump's investigations will restore a vast majority of its $400 million in annual federal funding."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/a68a/live/4db36840-6824-11f0-855b-5ba46c92af32.jpg",
    "titles": [
      "Columbia University to pay $200m in settlement with Trump administration",
      "Columbia University to pay $200m to settle anti-Semitism claims",
      "Columbia University to pay $221 million to settle Trump probes"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.891,
      "consensus": 0.847,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.745,
    "summary": "Columbia University has agreed to pay a $200 million fine to settle investigations by the Trump administration into allegations of campus antisemitism. This agreement will allow the Ivy League institution to restore the vast majority of its $400 million in annual federal funding.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information about the resolution of an antisemitism investigation at Columbia University. However, it does not delve into the details of the allegations, the investigation process, or how the university plans to address such issues in the future, which would have provided readers with a deeper understanding and awareness.",
    "image": {
      "src": "https://live.staticflickr.com/613/23764654226_be3e0e6080_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/476f005b-baf3-400f-a7b0-6625a2315fa8/thumb/",
      "alt": "Lucky seven (1962) - Joan Mitchell (1925 - 1992)",
      "credit": "pedrosimoes7 / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "9 Killed in Thailand from Cambodian Shelling Amid Border Dispute",
    "domain": "general",
    "location": "global",
    "published": "Thu, 24 Jul 2025 02:36:33 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Washington Post",
      "Deutsche Welle"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "Nine civilians reported killed in Cambodian shelling of Thailand as neighbours trade fire and accusations of blame.",
      "The neighbors both blame each other for triggering fresh violence over the disputed Emerald Triangle region. At least nine civilians have been killed and several injured.",
      "Tensions between the neighbors have escalated after a Cambodian soldier was killed in a skirmish last month."
    ],
    "image_url": "",
    "titles": [
      "Thailand launches air attacks on Cambodia as deadly border clashes escalate",
      "Thailand, Cambodia border clashes turn deadly",
      "Thailand launches airstrikes on Cambodia as border clash escalates"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.891,
      "consensus": 0.847,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.742,
    "summary": "Nine civilians were killed and several injured in Thailand due to Cambodian shelling amid escalating tensions over the disputed Emerald Triangle region. The violence follows a recent skirmish where a Cambodian soldier was killed, worsening relations between the two countries. Both nations blame each other for initiating the conflict.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness of the escalating tensions between Thailand and Cambodia but lacks depth or insight. It does not provide actionable insights or deeper understanding for the reader. The story does not report on solutions, improvements, or attempts to solve the problem, nor does it increase clarity around the causes or impacts of the dispute.",
    "image": {
      "src": "https://live.staticflickr.com/2447/3972229723_cd56ff49b6_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/0348f5aa-0bf3-47c4-81de-ee022bfb5800/thumb/",
      "alt": "Graphic Dead Dogs, killed by the hate and discrimination city of the world, Denver CO., This is Breed Specific Legislation, BSL",
      "credit": "Beverly & Pack / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Marcus Rashford Joins Barcelona on 12-Month Loan from Manchester United",
    "domain": "general",
    "location": "global",
    "published": "Wed, 23 Jul 2025 23:02:33 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "The Guardian",
      "ESPN"
    ],
    "domains": [
      "general",
      "sports"
    ],
    "snippets": [
      "The 27-year-old completed his loan move to Barca with an option for the switch to be made permanent next summer.",
      "Barcelona have completed the signing of Manchester United and England forward Marcus Rashford on a season-long loan, the Catalan club confirmed",
      "<ul><li><p>England forward says La Liga club ‘feels like home’</p></li><li><p>Rashford has fallen out of favour under Amorim</p></li></ul><p>Barcelona have signed Marcus Rashford on a season-long loan from Manchester United with an option to buy. The forward joins after falling out of favour under R"
    ],
    "image_url": "",
    "titles": [
      "Marcus Rashford joins Barcelona on loan from Manchester United",
      "Rashford joins Barcelona: 'Feels like I'm at home'",
      "Barcelona confirm Marcus Rashford loan from Manchester United with buy option"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.827,
      "consensus": 0.897,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.715,
    "summary": "Manchester United and England forward Marcus Rashford has moved to Barcelona on a 12-month loan deal, with an option for Barcelona to make the transfer permanent next summer. The 27-year-old's switch to the Catalan club has been officially confirmed by Barcelona.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "While this story provides basic awareness about a player's transfer between football clubs, it does not offer deeper insights or actionable information for the reader. It doesn't report on solutions, improvements, or innovations, nor does it increase clarity around systems, causes, trends, or impacts that matter.",
    "image": {
      "src": "https://live.staticflickr.com/6072/6126140302_0e6ddfd978.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/3f645594-a9d3-42c3-ac99-0efcf11ce1e0/thumb/",
      "alt": "Consumer Credit as of June 2011",
      "credit": "eric731 / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Less Than 10,000 Daily Steps Still Cut Cancer Mortality by 37%: Study",
    "domain": "science",
    "location": "global",
    "published": "Thu, 24 Jul 2025 00:30:27 +0100",
    "source": "New Scientist",
    "sources": [
      "The Guardian",
      "New Scientist"
    ],
    "domains": [
      "science",
      "general"
    ],
    "snippets": [
      "Many people like to check that they have walked 10,000 steps over the course of a day, but falling short of that target still seems to bring serious health benefits",
      "<p>Target easier to achieve than 10,000 steps and linked to 37% reduction in cancer deaths</p><p>Walking more could reduce your risk of dementia, depression and dying from cancer, as well as being good for your heart, according to <a href=\"https://www.thelancet.com/journals/lanpub/article/PIIS2468-2"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/07/23130605/SEI_259847078.jpg",
    "titles": [
      "Walking 7000 steps a day seems to be enough to keep us healthy",
      "7,000 steps a day could be enough to improve health, say researchers"
    ],
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.835,
      "consensus": 0.682,
      "constructiveness": 1.0,
      "proximity": 0.5
    },
    "score": 0.705,
    "summary": "Walking fewer than 10,000 steps daily still offers significant health benefits, including a 37% reduction in cancer mortality. Research suggests increased walking can lower risks of dementia, depression, and heart disease. This finding, published in The Lancet, highlights the importance of moderate physical activity for overall health, even if the widely advocated 10,000-step goal isn't met.",
    "constructiveness_score": 1.0,
    "constructiveness_reason": "This story is highly constructive as it provides empowering knowledge about the health benefits of walking, even if the commonly recommended goal of 10,000 steps is not met. It increases awareness about the impacts of moderate physical activity on health and offers actionable insights for readers to incorporate into their lives.",
    "image": {
      "src": "https://live.staticflickr.com/7155/6509240085_18934411b1_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/33858a85-7f56-4f8d-8862-9021268a6c88/thumb/",
      "alt": "Detail: 'To give anything less than your best is to sacrifice the gift.' Steve Prefontaine, Nike, reception, Beaverton, Oregon, USA",
      "credit": "Wonderlane / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "MLS All-Stars Beat Liga MX 3-1 in Austin, Lead Series 2-1-1",
    "domain": "sports",
    "location": "national",
    "published": "Thu, 24 Jul 2025 01:02:29 EST",
    "source": "ESPN",
    "sources": [
      "Forbes",
      "ESPN"
    ],
    "domains": [
      "business",
      "sports"
    ],
    "snippets": [
      "Without Lionel Messi, the MLS All-Stars defeated Liga MX 3-1 on Wednesday night in Austin, Texas.",
      "MLS now has a 2-1-1 record against Liga MX in the midsummer event."
    ],
    "image_url": "",
    "titles": [
      "MLS, minus Messi, beats Liga MX in All-Star Game",
      "MLS Beats Liga MX 3-1 In 2025 MLS All-Star Game"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.937,
      "consensus": 0.682,
      "constructiveness": 0.5,
      "proximity": 0.75
    },
    "score": 0.693,
    "summary": "The MLS All-Stars won 3-1 against Liga MX in Austin, Texas, without Lionel Messi. This victory gives MLS a 2-1-1 record against Liga MX in the midsummer event.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story provides basic awareness about the result of a specific sports event, but it does not offer any deeper insights or actionable knowledge for the reader. It does not discuss any improvements, innovations or solutions related to the event or the sport.",
    "image": {
      "src": "https://upload.wikimedia.org/wikipedia/commons/8/88/Ryan_Giggs_vs_MLS_All_Stars_2010.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/84961974-660c-4ba2-bc6f-6e4f4c2582be/thumb/",
      "alt": "Ryan Giggs vs MLS All Stars 2010",
      "credit": "Allison Pasciuto / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "wikimedia",
      "source": "Openverse"
    }
  },
  {
    "title": "Barcelona FC Cancels Japan Tour Leg Over Promoter Contract Breach",
    "domain": "sports",
    "location": "national",
    "published": "Thu, 24 Jul 2025 00:34:04 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Barcelona have suspended the Japan part of this month's Asia tour due to what the club said was a serious breach of contract by the promoter.",
      "Barcelona cancel Sunday's pre-season friendly against Vissel Kobe in Tokyo because of &quot;serious contractual breaches&quot; by the promoter."
    ],
    "image_url": "",
    "titles": [
      "Barça cancel Japan friendly citing contract breach",
      "Barca cancel friendly over 'contractual breaches'"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.928,
      "consensus": 0.632,
      "constructiveness": 0.6,
      "proximity": 0.75
    },
    "score": 0.689,
    "summary": "Barcelona FC has canceled the Japan segment of their Asia tour, including a pre-season friendly against Vissel Kobe in Tokyo, due to serious contractual breaches by the event promoter. The club has officially suspended activities citing these violations.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This article provides useful information about a significant development in Barcelona FC's Asia tour. However, it does not delve into the specifics of the contractual breach or what it means for the future of such tours, thus limiting its usefulness.",
    "image": {
      "src": "https://live.staticflickr.com/5006/5251791208_96dddb94ca_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/d4dc67a6-e6de-4b74-957b-b9efe13d8998/thumb/",
      "alt": "Osaka Japan",
      "credit": "kevin dooley / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "USC's Alijah Arenas to Miss 6-8 Months for Knee Surgery After Car Crash Recovery",
    "domain": "sports",
    "location": "national",
    "published": "Thu, 24 Jul 2025 01:02:29 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "USC freshman Alijah Arenas, who was the No. 13 recruit in the ESPN 100, will need surgery after injuring his knee and will sit out six to eight months, the school announced.",
      "Arenas had recently been cleared to practice after he was involved in a fiery car crash this spring"
    ],
    "image_url": "",
    "titles": [
      "USC freshman Arenas injures knee, out 6-8 months",
      "Alijah Arenas injury: USC 5-star freshman hurts knee, expected to be sidelined for 6-8 months"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.937,
      "consensus": 0.632,
      "constructiveness": 0.5,
      "proximity": 0.75
    },
    "score": 0.68,
    "summary": "USC freshman basketball player Alijah Arenas, ranked No. 13 in the ESPN 100, will undergo knee surgery, sidelining him for 6-8 months, as announced by the school. This development follows his recent clearance to return to practice after surviving a fiery car crash in the spring.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about the health status of a USC basketball player, but it does not offer any actionable insights or deeper understanding. It lacks details about the car crash, the player's recovery process, or the implications of his absence for the team.",
    "image": {
      "src": "https://live.staticflickr.com/5281/5261561124_4ded6f6d1f_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/9b2c8b2b-cffa-4cdc-abef-ba1a033ee170/thumb/",
      "alt": "Lloyd Dangle at USC Creativity & Collaboration",
      "credit": "Norman Lear Center / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Three Workers Trapped in BC Mine, Have Essential Supplies",
    "domain": "business",
    "location": "national",
    "published": "Thu, 24 Jul 2025 05:35:04 +0000",
    "source": "Financial Post",
    "sources": [
      "Financial Post",
      "CityNews"
    ],
    "domains": [
      "business",
      "general"
    ],
    "snippets": [
      "VANCOUVER &#8212; Three workers trapped underground in a refuge area at the Red Chris mine in northwestern British Columbia have enough air, water and food for an &#8220;extended stay,&#8221; the mine&#8217;s majority owner said Wednesday. The statement from Newmont Corp. said it was working to asse",
      "Three workers trapped underground in a refuge area at the Red Chris mine in northwestern British Columbia have enough air, water and food for an \"extended stay,\" the mine's majority owner said Wednesday."
    ],
    "image_url": "",
    "titles": [
      "Three workers trapped in B.C.’s Red Chris mine have air, food, water, operator says",
      "Three people trapped in B.C.’s Red Chris mine, Premier David Eby says"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.948,
      "consensus": 0.682,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.68,
    "summary": "Three workers are trapped underground at the Red Chris mine in northwestern British Columbia, but they have sufficient air, water, and food for an extended stay, according to a statement from Newmont Corp., the mine's majority owner. Efforts are underway to assess and ensure their safety.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about an ongoing crisis situation, but it doesn't offer any insights into the broader context or implications of the situation. It does, however, report on the efforts being made to ensure the trapped workers' safety.",
    "image": {
      "src": "https://live.staticflickr.com/65535/48075481352_12ee646830_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/14d94d86-e0bf-42cb-8ee2-4dae6b5d0923/thumb/",
      "alt": "[1290] Chilo phragmitella",
      "credit": "Bennyboymothman / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Trump to Visit Federal Reserve, First in 20 Years Amid Criticism",
    "domain": "business",
    "location": "national",
    "published": "Thu, 24 Jul 2025 04:20:55 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "MarketWatch"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "This is the first time in nearly two decades that an American president will be making an official trip to the central bank.",
      "President Donald Trump is going to visit the Federal Reserve on Thursday, as the White House increasingly makes the case that construction cost overruns at the central bank are a reason to remove Chair Jerome Powell."
    ],
    "image_url": "",
    "titles": [
      "Trump to visit Federal Reserve, escalating campaign against Chair Powell",
      "Trump is due to visit the Fed as White House steps up campaign against Powell"
    ],
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.924,
      "consensus": 0.632,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.68,
    "summary": "President Donald Trump is scheduled to visit the Federal Reserve on Thursday, marking the first official trip by a sitting U.S. president to the central bank in nearly 20 years. The visit comes amid the White House's growing criticism of construction cost overruns at the Federal Reserve, which they are using as a basis to argue for the removal of Chair Jerome Powell.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "The story provides useful information about the upcoming visit of the U.S. President to the Federal Reserve, highlighting the context of ongoing criticism about construction cost overruns. However, it doesn't report on any potential solutions or improvements, or give the reader actionable insights.",
    "image": {
      "src": "https://live.staticflickr.com/815/40567174204_f340b664a7_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/193cb26a-47b0-4ceb-90ff-c10ce8c0ee1c/thumb/",
      "alt": "trump",
      "credit": "Book Catalog / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Alphabet Increases 2025 Capital Spending by $10B Amid Cloud Demand Surge",
    "domain": "business",
    "location": "national",
    "published": "Wed, 23 Jul 2025 23:15:12 GMT",
    "source": "CNBC",
    "sources": [
      "Forbes",
      "CNBC"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "The company increased its capital expenditures for 2025 by $10 billion due to \"strong and growing demand for our Cloud products and services.\"",
      "Economists forecasted double-digit increases for Alphabet’s top and bottom lines."
    ],
    "image_url": "",
    "titles": [
      "Alphabet beats earnings expectations, raises spending forecast",
      "Google Parent Alphabet Beats Revenue And Earnings Expectations Ahead Of Antitrust Ruling"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.831,
      "consensus": 0.632,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.664,
    "summary": "The company raised its 2025 capital spending by $10 billion citing high demand for Cloud products. Economists predict double-digit growth for Alphabet's revenue and profits.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story informs readers about Alphabet's decision and the reasons behind it, providing useful context about the demand for Cloud products. It doesn't explicitly highlight solutions or progress, but it does suggest that Alphabet is responding to market trends.",
    "image": {
      "src": "https://live.staticflickr.com/2013/2101590202_7d5bf49028_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/8306b0f2-a5bc-4cdd-aaf1-734b3936acdc/thumb/",
      "alt": "Organic Pixels 2",
      "credit": "AMagill / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Electric Car Maker's Profits Fall 23% Amid Rising Competition, Dissatisfaction",
    "domain": "business",
    "location": "global",
    "published": "Wed, 23 Jul 2025 23:19:37 GMT",
    "source": "Financial Times",
    "sources": [
      "The Guardian",
      "Financial Times"
    ],
    "domains": [
      "business",
      "general"
    ],
    "snippets": [
      "Electric-car maker reports 23% drop in profits as sales suffer amid greater competition and consumer backlash",
      "<p>Live, rolling coverage of business, economics and financial markets as UK’s biggest high street bank says unemployment will peak higher</p><p>Output from Germany’s manufacturing industry is likely to shrink in July, according to an early reading of the purchasing managers’ index (PMI).</p><p>The "
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F70e0281d-e781-42d6-928c-01a3c1b05197.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Musk warns ‘rough quarters’ ahead for Tesla after Trump cancels EV incentives",
      "Lloyds flags UK economy ‘deterioration’; Elon Musk warns ‘rough quarters’ ahead for Tesla – business live"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.832,
      "consensus": 0.682,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.657,
    "summary": "An electric car manufacturer experienced a 23% decline in profits due to decreased sales attributed to increased competition and consumer dissatisfaction. The company's financial performance was impacted by these factors, leading to a drop in profits.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "While the news is negative, it still provides useful context about the challenges facing the electric car market. It doesn't offer solutions or progress, but it does increase awareness about the impact of competition and customer satisfaction on business performance.",
    "image": {
      "src": "https://live.staticflickr.com/4060/4503260722_cd038078d3_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/8463d6c4-5e7c-4b0a-808b-ef28efb20e45/thumb/",
      "alt": "The Chinese Electric Bike Surprise",
      "credit": "jurvetson / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Venus Williams Granted Wildcard for Cincinnati Open Return",
    "domain": "sports",
    "location": "global",
    "published": "Wed, 23 Jul 2025 23:07:00 BST",
    "source": "Sky Sports",
    "sources": [
      "Sky Sports",
      "Sportsnet"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Venus Williams has been granted a wildcard entry into the main draw of the Cincinnati Open, tournament organisers confirmed on Wednesday.",
      "<p>Venus Williams&#8217; return to professional tennis will not just be a one-tournament visit: She was awarded a wild-card entry on Wednesday for next month&#8217;s Cincinnati Open.</p>"
    ],
    "image_url": "https://e0.365dm.com/25/07/1920x1080/skysports-venus-williams-tennis_6972139.jpg?20250723232238",
    "titles": [
      "Venus Williams handed Cincinnati Open wildcard",
      "Venus Williams, 45, gets wild-card entry for Cincinnati Open after win in Washington"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.828,
      "consensus": 0.632,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.634,
    "summary": "Venus Williams has received a wildcard entry for the Cincinnati Open, marking her return to professional tennis beyond just one tournament. The tournament organizers confirmed this decision, allowing Williams to compete in the main draw next month.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "While the story informs readers about Venus Williams' return to professional tennis, it does not provide any deeper insights or context about what this means for her career, the sport, or the tournament. It does not highlight any progress, solutions, or empowering knowledge.",
    "image": {
      "src": "https://live.staticflickr.com/65535/48523771812_eb2287fdc6_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/f630ce0f-7fb1-4bea-b70c-8bde7ca1fd9c/thumb/",
      "alt": "Cincinnati Open",
      "credit": "trendingtopics / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Five Shine at New England Camp, Packers Begin 2025 Training",
    "domain": "sports",
    "location": "global",
    "published": "Wed, 23 Jul 2025 16:56:12 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes",
      "Sports Illustrated"
    ],
    "domains": [
      "business",
      "sports"
    ],
    "snippets": [
      "The Green Bay Packers held their first training camp practice of 2025 on Wednesday, a non-padded workout that lasted roughly 90 minutes.",
      "<a href=\"https://news.google.com/rss/articles/CBMijwFBVV95cUxORzFNM1hpNHNKcnBzVFNKZTY5UGdHdHJGWjRybjhvdG14d3VuZWF0VkNMcEpLRUJnR28xVVpkUXkxZ0NTUUY5SjB5VUdDaDR5VVd4R01PWDJyNzBVbkUtVTZPTm5FV2h6SjNEWnlNSG9YeTZhajUxeU42S2doVEZlajZ2SzJ6Zi1IMm9aSmlVUQ?oc=5\" target=\"_blank\">The good and not so good from Day",
      "<a href=\"https://news.google.com/rss/articles/CBMilwFBVV95cUxQZGFEUnN4REVMRTl4QjY2QzdkYXNjSHU5QlFoOWNIcDIxM2NDV0NFRG92M3JVSDJBUHZQbHdDbEVpTEU2Z3Y5RWF5WFF4bWNEeW5fZjJNcUh6anN5eG9vaUs5YmdudDIxOHNvSW5ZcUlKX2p5cFgzQ1NET1lzMDV4OWZreHFMZEFyaGZ5REJHdWJZcnR4enpr?oc=5\" target=\"_blank\">Dolphins OL Airlifted b"
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/68814be51c3396c1e9b597c8/0x0.jpg?width=960",
    "titles": [
      "The Good, Bad And Ugly From Day 1 Of Packers’ Training Camp",
      "The good and not so good from Day 1 of 49ers training camp - Sports Illustrated",
      "Dolphins OL Airlifted by Helicopter From Training Camp After Practice - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.792,
      "consensus": 0.682,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.626,
    "summary": "At the New England training camp practice on Wednesday, five players stood out with their performances. Meanwhile, the Green Bay Packers commenced their first training camp practice of 2025, which was a non-padded session lasting about 90 minutes. The specifics of the standout players or the qualitative aspects of the Packers' practice were not detailed.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about the New England training camp and the start of the Packers' 2025 training. However, it lacks depth and insight as it does not provide details about who the standout players were or what happened during the Packers' practice.",
    "image": {
      "src": "https://live.staticflickr.com/1246/1354274364_782228bcd8.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/c9aad3f1-ffb4-47da-b691-ed48eb0fe10e/thumb/",
      "alt": "#60 astrodeep200407a HUDF, Spitzer #2 4.88z old tiny galaxy 494X492",
      "credit": "rmforall@gmail.com / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "European authorities arrest alleged admin of notorious Russian crime forum XSS",
    "domain": "technology",
    "location": "global",
    "published": "Wed, 23 Jul 2025 15:45:38 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch",
      "Ars Technica"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "French authorities say they wiretapped a server used by the administrator to access their private messages, which revealed activities relating to cybercrime and ransomware attacks.",
      "Intercepted Jabber messages lead to arrest of suspected admin of cybercrime hub."
    ],
    "image_url": "",
    "titles": [
      "European authorities arrest alleged admin of notorious Russian crime forum XSS",
      "Ukrainians arrest alleged admin of major crime forum XSS"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.711,
      "consensus": 0.632,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.59,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers basic awareness about a crime-related event but provides minimal depth or insight. It does not provide actionable insights, solutions, or a deeper understanding of the situation.",
    "image": {
      "src": "https://live.staticflickr.com/3807/14099640950_242514ebe1_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/5e0ac0f3-c46a-4fba-ba9f-25b719153509/thumb/",
      "alt": "Kids at European Day, Cherkassy, Ukraine",
      "credit": "be creator / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Taiwan President Backs Recall of Over 25% of Lawmakers",
    "domain": "business",
    "location": "national",
    "published": "Thu, 24 Jul 2025 06:02:47 +0000",
    "source": "Financial Post",
    "sources": [
      "Financial Post"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Taiwan President Lai Ching-te has escalated his power struggle against opposition lawmakers by backing an unprecedented effort to unseat more than a quarter of the archipelago’s legislators in a “recall” vote."
    ],
    "image_url": "",
    "titles": [
      "Why Taiwan’s ‘Recall’ Election Risks Raising Tensions With China"
    ],
    "score_components": {
      "magnitude": 0.149,
      "recency": 0.957,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.452,
    "summary": "Taiwan President Lai Ching-te is intensifying a power struggle with opposition lawmakers by supporting a move to recall over a quarter of the legislators. This unprecedented effort aims to remove these lawmakers from their positions. The outcome of the recall vote remains pending.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs about a significant political event in Taiwan, which can help the reader understand the current political climate in the country. However, it doesn't provide enough context or analysis to fully understand the implications of this move, nor does it report on potential solutions or outcomes.",
    "image": {
      "src": "https://live.staticflickr.com/5065/5677341825_3fac0448b4_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/9cd63a92-3290-48d7-bd9c-7f69fe33b4f8/thumb/",
      "alt": "sun setting over the ottawa river",
      "credit": "iglooo101 / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "USC Scientists Develop AI for Advanced, Eco-Friendly Material Design",
    "domain": "science",
    "location": "global",
    "published": "Wed, 23 Jul 2025 23:22:15 EDT",
    "source": "ScienceDaily",
    "sources": [
      "ScienceDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Imagine concrete that not only survives wildfires and extreme weather, but heals itself and absorbs carbon from the air. Scientists at USC have created an AI model called Allegro-FM that simulates billions of atoms at once, helping design futuristic materials like carbon-neutral concrete. This tech "
    ],
    "image_url": "",
    "titles": [
      "Concrete that lasts centuries and captures carbon? AI just made it possible"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.905,
      "consensus": 0.393,
      "constructiveness": 1.0,
      "proximity": 0.5
    },
    "score": 0.45,
    "summary": "Scientists at the University of Southern California have developed an AI model named Allegro-FM that can simulate billions of atoms simultaneously. This innovation aids in designing advanced materials, including a type of concrete that is not only resistant to wildfires and extreme weather but also has self-healing properties and can absorb carbon from the atmosphere, contributing to carbon neutrality.",
    "constructiveness_score": 1.0,
    "constructiveness_reason": "This story is constructive as it reports on an innovative solution to a global problem, providing readers with a deeper understanding of how AI can be used in material design. It also increases awareness about the potential of advanced materials in addressing environmental issues.",
    "image": {
      "src": "https://live.staticflickr.com/3353/4621394806_80e6e26623_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/ee4a52f3-e4fe-401d-8f99-b439533a1e29/thumb/",
      "alt": "LIBYA TRIP - Tripoli talks advance U.S. Army relationship with Libya land forces - MAY 2010",
      "credit": "US Army Africa / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "HIV Antivirals Show Promise in Fighting Lethal HTLV-1 Virus",
    "domain": "science",
    "location": "global",
    "published": "Thu, 24 Jul 2025 00:51:03 EDT",
    "source": "ScienceDaily",
    "sources": [
      "ScienceDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "HIV antivirals may be the key to stopping HTLV-1, a deadly virus with no cure. In a decade-long study, researchers successfully suppressed the virus in mice and discovered a way to kill infected cells, offering hope for the first preventative and curative treatments."
    ],
    "image_url": "",
    "titles": [
      "A deadly virus no one talks about — and the HIV drugs that might stop it"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.933,
      "consensus": 0.393,
      "constructiveness": 1.0,
      "proximity": 0.5
    },
    "score": 0.448,
    "summary": "Researchers have found that HIV antivirals could be crucial in combating HTLV-1, a lethal virus currently without a cure. In a study spanning ten years, the team was able to suppress the virus in mice and identify a method to eliminate infected cells. This breakthrough presents potential for the development of the first preventative and curative treatments for HTLV-1.",
    "constructiveness_score": 1.0,
    "constructiveness_reason": "This story is highly constructive as it highlights progress in medical research, specifically in the fight against HTLV-1. It provides useful information about the potential application of HIV antivirals and increases awareness about the ongoing efforts to find a cure for HTLV-1.",
    "image": {
      "src": "https://live.staticflickr.com/7508/26751168841_95eecae559_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/1095d1d1-4b80-4acb-8e06-3c3124263392/thumb/",
      "alt": "Zika Virus Research",
      "credit": "NIAID / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Trump Announces 35% Tariff on Canadian Goods, Escalating Trade Tensions",
    "domain": "business",
    "location": "national",
    "published": "Wed, 23 Jul 2025 21:16:41 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Trump recently said he will impose a 35% tariff on Canada, the latest salvo in his on-again, off-again trade war with the U.S. ally and top trade partner."
    ],
    "image_url": "",
    "titles": [
      "Republican senators join Dems on bill to exempt small businesses from Trump's Canada tariffs"
    ],
    "score_components": {
      "magnitude": 0.079,
      "recency": 0.797,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 1.0
    },
    "score": 0.445,
    "summary": "President Trump announced plans to impose a 35% tariff on goods from Canada, escalating tensions in the fluctuating trade relationship between the U.S. and its close ally and leading trade partner. This move marks the latest development in the ongoing trade disputes between the two nations.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs readers about the latest development in the trade relationship between the US and Canada. However, it lacks depth as it does not provide any actionable insights or solutions to the escalating trade tensions.",
    "image": {
      "src": "https://live.staticflickr.com/7513/29741484642_69cd606b1a_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/100246b4-afeb-42cc-9f12-68885adf81d6/thumb/",
      "alt": "Donald J. Trump at Marriott Marquis NYC September 7th 2016",
      "credit": "Michael Vadon / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Trump Signs Orders to Counter \"Woke\" AI, Boost U.S. as AI Leader",
    "domain": "business",
    "location": "national",
    "published": "Thu, 24 Jul 2025 07:28:22 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Trump has vowed to push back against \"woke\" AI models and to turn the U.S. into an \"AI export powerhouse,\" signing three AI-focused executive orders Wednesday."
    ],
    "image_url": "",
    "titles": [
      "No ‘woke AI’ in Washington, Trump says as he launches American AI action plan"
    ],
    "score_components": {
      "magnitude": 0.079,
      "recency": 0.986,
      "consensus": 0.393,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.443,
    "summary": "Former President Trump signed three executive orders on Wednesday to counter \"woke\" AI models and boost the U.S. as an \"AI export powerhouse.\" The orders aim to address concerns about bias in AI systems and promote American leadership in artificial intelligence technology.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful information about the executive orders signed by the former President to address bias in AI systems and promote the U.S. as an AI leader. However, it lacks details on how these orders will be implemented or their potential impact, limiting its usefulness and insight.",
    "image": {
      "src": "https://live.staticflickr.com/268/31799281164_db05431a6c_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/b5876486-239f-4f74-b069-216c34d867ed/thumb/",
      "alt": "Marching against against Donald Trump",
      "credit": "Fibonacci Blue / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Study Receives $621K to Explore Alien Chemistry for Life Beyond Earth",
    "domain": "science",
    "location": "global",
    "published": "Thu, 24 Jul 2025 04:50:56 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/the-621000-hunt-for-alien-chemistry-on-earth/\" rel=\"nofollow\" title=\"The $621,000 Hunt for Alien Chemistry on Earth\"><img alt=\"New Model Evaluates Possibility of Life on Europa\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"574\" src=\"https://scitechdaily.com/"
    ],
    "image_url": "",
    "titles": [
      "The $621,000 Hunt for Alien Chemistry on Earth"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.933,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.439,
    "summary": "A research initiative has received $621,000 in funding to explore the potential of alien chemistry on Earth. This study aims to understand how life might exist under conditions different from those on our planet, using advanced models and experiments. The project, highlighted by its focus on the possibility of life on Europa, one of Jupiter's moons, seeks to expand our knowledge of life's diversity and the conditions under which it can emerge and thrive.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it provides valuable insights into the exploration of life beyond Earth, promoting awareness about the diversity of life and the conditions necessary for its existence. However, it slightly lacks in offering actionable insights or immediate solutions.",
    "image": {
      "src": "https://live.staticflickr.com/6040/5905443607_1ef1360caf_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/78fbe2d1-96a3-4c45-a23a-4e3ba3ce291a/thumb/",
      "alt": "Story Hour Swanton, Nebraska",
      "credit": "shannonpatrick17 / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Study Finds Noon Best for University Oral Exams",
    "domain": "science",
    "location": "global",
    "published": "Thu, 24 Jul 2025 06:00:16 +0100",
    "source": "New Scientist",
    "sources": [
      "New Scientist"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Midday seems to be the optimal time to take an oral exam at university, which could be due to students not generally being early risers"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/07/22173839/SEI_259751704.jpg",
    "titles": [
      "The time you take an oral exam could affect whether you pass or fail"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.936,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.429,
    "summary": "Research suggests that midday is the optimal time for university students to take oral exams, possibly because many students do not typically wake up early. This finding indicates a potential preference or performance advantage for exams scheduled around noon.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides actionable insights for university students and educators about the optimal timing for oral exams. It also increases awareness about the potential impact of exam scheduling on student performance. However, it does not report on any solutions or innovations to address the issue."
  },
  {
    "title": "Astronomers Discover Unique \"Infinity\" Shaped Galaxy",
    "domain": "science",
    "location": "global",
    "published": "Thu, 24 Jul 2025 04:00:09 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/never-been-seen-before-astronomers-discover-bizarre-infinity-galaxy/\" rel=\"nofollow\" title=\"“Never Been Seen Before” – Astronomers Discover Bizarre “Infinity” Galaxy\"><img alt=\"Astronomy Black Hole Astrophysics Concept Art\" class=\"webfeedsFeaturedVisual wp-post-imag"
    ],
    "image_url": "",
    "titles": [
      "“Never Been Seen Before” – Astronomers Discover Bizarre “Infinity” Galaxy"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.917,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.425,
    "summary": "Astronomers have discovered a unique \"Infinity\" galaxy, characterized by its unusual shape that resembles the infinity symbol. This discovery, unprecedented in the field of astronomy, offers new insights into galactic formations and dynamics. The current status of this discovery is that it has been confirmed and is under further study to understand its properties and the mechanisms behind its distinct shape.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it informs readers about a unique discovery in the field of astronomy, providing insights into galactic formations and dynamics. However, it does not highlight any specific solutions or progress, hence the score.",
    "image": {
      "src": "https://live.staticflickr.com/4531/38428058436_a2d0704a0a_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/ffd0bb4f-72b1-421b-acb8-0c5ceea346c8/thumb/",
      "alt": "Double Bubble",
      "credit": "NASA Hubble / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "China's Exports Rise 6% in First Half of 2025, Beating Slowdown Forecasts",
    "domain": "business",
    "location": "global",
    "published": "2025-07-24T06:38:44Z",
    "source": "Business Insider",
    "sources": [
      "Business Insider"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Over the first half of 2025, China's exports to the world grew nearly 6% from a year earlier, defying expectations of a broad slowdown."
    ],
    "image_url": "https://i.insider.com/68819c6ef748d8c055f62d33?format=jpeg",
    "titles": [
      "Why China's export machine keeps humming, despite the US's tariff squeeze"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.969,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.423,
    "summary": "China's exports to the world increased by almost 6% in the first half of 2025, surpassing predictions of a significant slowdown. This growth indicates resilience in China's export sector despite global economic challenges.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story offers data on China's export growth, which can be useful for readers interested in global economics. However, it does not provide much context or analysis to deepen understanding of the causes, trends, or implications of this growth.",
    "image": {
      "src": "https://live.staticflickr.com/3275/2930064710_9b521bc06d.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/1615bba0-f9a7-4ac0-a87e-36e8728052ac/thumb/",
      "alt": "China - Great Wall",
      "credit": "iNathan / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Trump’s ‘anti-woke AI’ order could reshape how US tech companies train their models",
    "domain": "technology",
    "location": "global",
    "published": "Wed, 23 Jul 2025 23:25:08 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "When DeepSeek, Alibaba, and other Chinese firms released their AI models, Western researchers quickly noticed they sidestepped questions critical of the Chinese Communist Party. U.S. officials later confirmed that these tools are engineered to reflect Beijing’s talking points, raising concerns about"
    ],
    "image_url": "",
    "titles": [
      "Trump’s ‘anti-woke AI’ order could reshape how US tech companies train their models"
    ],
    "score_components": {
      "magnitude": 0.079,
      "recency": 0.834,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.423,
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it provides useful insights on a new policy and its potential impacts on tech companies and AI development. However, it doesn't clearly highlight solutions or progress, hence the score is not higher.",
    "image": {
      "src": "https://live.staticflickr.com/815/40567174204_f340b664a7_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/193cb26a-47b0-4ceb-90ff-c10ce8c0ee1c/thumb/",
      "alt": "trump",
      "credit": "Book Catalog / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Ohtani Hits Home Run in 5th Straight Game, Seventh Dodger to Achieve Feat",
    "domain": "sports",
    "location": "national",
    "published": "Thu, 24 Jul 2025 01:02:29 EST",
    "source": "ESPN",
    "sources": [
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Shohei Ohtani homered for the fifth consecutive game, becoming the seventh player in Dodgers franchise history to accomplish that feat."
    ],
    "image_url": "",
    "titles": [
      "Ohtani ties Dodgers' mark with HR in 5th straight"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.937,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.411,
    "summary": "Shohei Ohtani hit a home run in his fifth straight game, making him the seventh player in Dodgers history to do so. This achievement highlights his impressive performance and consistency on the field.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "While this story offers basic awareness of Ohtani's achievement, it doesn't provide deeper insights or context that would be useful to the reader. It doesn't report on solutions, improvements, or attempts to solve problems.",
    "image": {
      "src": "https://live.staticflickr.com/3289/5857806294_1256f1d949_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/9417fbfa-222c-434e-9b6f-584f94fad20f/thumb/",
      "alt": "Poker",
      "credit": "Images_of_Money / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "OpenAI and partners are building a massive AI data center in Texas",
    "domain": "technology",
    "location": "global",
    "published": "Wed, 23 Jul 2025 21:34:26 +0000",
    "source": "Ars Technica",
    "sources": [
      "Ars Technica"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "\"Easy to throw around numbers, but this is a gigantic infrastructure project.\""
    ],
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/07/stargate-advances-with-partnership-with-oracle-1-1152x648.jpg",
    "titles": [
      "OpenAI and partners are building a massive AI data center in Texas"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.802,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.409,
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is informative and provides useful context about a major development in the AI industry. It could have scored higher if it included more information about the potential impacts of this data center, or how it contributes to solutions or progress in the field of AI.",
    "image": {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c0/Andrej_Karpathy%2C_OpenAI.png",
      "thumbnail": "https://api.openverse.org/v1/images/295e4310-a6a5-419d-b3c5-a830a6e6a434/thumb/",
      "alt": "Andrej Karpathy, OpenAI",
      "credit": "Gladwin Analytics / CC BY 3.0",
      "license": "by",
      "license_version": "3.0",
      "license_url": "https://creativecommons.org/licenses/by/3.0/",
      "provider": "wikimedia",
      "source": "Openverse"
    }
  },
  {
    "title": "NASA's TRACERS Mission Launches to Study Earth's Magnetic Shield",
    "domain": "science",
    "location": "global",
    "published": "Wed, 23 Jul 2025 23:23:49 +0000",
    "source": "NASA",
    "sources": [
      "NASA"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "NASA’s newest mission, TRACERS, soon will begin studying how Earth’s magnetic shield protects our planet from the effects of space weather. Short for Tandem Reconnection and Cusp Electrodynamics Reconnaissance Satellites, the twin TRACERS spacecraft lifted off at 11:13 a.m. PDT (2:13 p.m. EDT) Wedne"
    ],
    "image_url": "",
    "titles": [
      "NASA Launches Mission to Study Earth’s Magnetic Shield"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.833,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.408,
    "summary": "NASA launched the TRACERS mission, consisting of twin spacecraft, to study Earth's magnetic shield and its protection against space weather. The satellites lifted off at 11:13 a.m. PDT on Wednesday. TRACERS stands for Tandem Reconnection and Cusp Electrodynamics Reconnaissance Satellites, aiming to enhance understanding of Earth's defense mechanisms against solar radiation and particles.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it provides the reader with a deeper understanding of NASA's new mission and its purpose. It increases awareness about Earth's magnetic shield and our defense mechanisms against solar radiation and particles. However, it lacks specific insights on progress or solutions.",
    "image": {
      "src": "https://live.staticflickr.com/7396/9476093705_c8b1243b54_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/3c5a0c54-9781-4a2e-b649-1dcc5fa638d7/thumb/",
      "alt": "NASA UFO",
      "credit": "tonynetone / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Trump wanted to break up Nvidia — but then its CEO won him over",
    "domain": "technology",
    "location": "global",
    "published": "2025-07-23T19:25:46-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Not long ago, President Donald Trump hadn’t even heard of Nvidia, the most valuable tech company in the world. But once he found out about the AI chip giant, he says, he wanted to break it up. “Before I learned the facts of life, I said, ‘we&#8217;ll break him up,’” Trump recalled today, in a [&#823"
    ],
    "image_url": "",
    "titles": [
      "Trump wanted to break up Nvidia — but then its CEO won him over"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.834,
      "consensus": 0.393,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.406,
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story offers some useful context about the relationship between politics and tech companies. It could help readers understand how corporate decisions are influenced. However, it doesn't report on solutions or improvements, nor does it offer a deeper understanding of the systems at play.",
    "image": {
      "src": "https://live.staticflickr.com/815/40567174204_f340b664a7_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/193cb26a-47b0-4ceb-90ff-c10ce8c0ee1c/thumb/",
      "alt": "trump",
      "credit": "Book Catalog / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Sundar Pichai is ‘very excited’ about Google Cloud’s OpenAI partnership",
    "domain": "technology",
    "location": "global",
    "published": "Wed, 23 Jul 2025 22:23:21 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "The comment came shortly after analysts peppered Pichai and other Google executives with questions about how AI would affect its core search business and why Google is spending an extra $10 billion on capital expenditures this year to catch up in the AI race."
    ],
    "image_url": "",
    "titles": [
      "Sundar Pichai is ‘very excited’ about Google Cloud’s OpenAI partnership"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.816,
      "consensus": 0.393,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.402,
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful information about a significant partnership between Google Cloud and OpenAI, which could potentially impact the future of AI development. However, it doesn't provide specific insights into how this partnership will lead to progress or solutions in the field.",
    "image": {
      "src": "https://upload.wikimedia.org/wikipedia/commons/c/c3/Sundar_Pichai_-_2023_%28cropped%29.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/77018094-1dfd-4fc2-b94f-f5bdd605a2d2/thumb/",
      "alt": "Sundar Pichai - 2023 (cropped)",
      "credit": "Photographer: Lukasz Kobus (European Commission) / CC BY 4.0",
      "license": "by",
      "license_version": "4.0",
      "license_url": "https://creativecommons.org/licenses/by/4.0/",
      "provider": "wikimedia",
      "source": "Openverse"
    }
  },
  {
    "title": "Earth's Signals May Reveal Location to Aliens",
    "domain": "science",
    "location": "global",
    "published": "Thu, 24 Jul 2025 04:25:00 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/earth-is-broadcasting-its-location-to-aliens-and-we-didnt-mean-to/\" rel=\"nofollow\" title=\"Earth Is Broadcasting Its Location to Aliens – And We Didn’t Mean To\"><img alt=\"Extraterrestrial Intelligence Signal From Space\" class=\"webfeedsFeaturedVisual wp-post-image\" he"
    ],
    "image_url": "",
    "titles": [
      "Earth Is Broadcasting Its Location to Aliens – And We Didn’t Mean To"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.925,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.397,
    "summary": "Earth has been unintentionally sending signals into space that could potentially reveal its location to extraterrestrial intelligence. These emissions, which include radio and television broadcasts, radar signals, and satellite communications, have been traveling through space for years. This accidental broadcasting raises questions about our planet's detectability by alien civilizations.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about Earth's unintentional signals into space and its potential implications. However, it lacks depth or insight into what this could mean for humanity or how this information could be used.",
    "image": {
      "src": "https://live.staticflickr.com/8569/16531230438_423d8245e5_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/8715e879-b3ab-482d-878e-3aca83faa3ab/thumb/",
      "alt": "Earth",
      "credit": "Kevin M. Gill / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Javier Hernandez Fined for Promoting Sexual Stereotypes",
    "domain": "sports",
    "location": "national",
    "published": "Thu, 24 Jul 2025 06:58:24 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Mexico striker Javier Hernandez is fined for making comments that &quot;promoted sexual stereotypes&quot;."
    ],
    "image_url": "",
    "titles": [
      "Ex-Man Utd striker Hernandez fined for sexist comments"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.976,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.387,
    "summary": "Mexican striker Javier Hernandez was fined for remarks that were deemed to promote sexual stereotypes. The specific comments or the amount of the fine were not disclosed, but the action taken indicates a breach of conduct regarding the promotion of harmful stereotypes.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers basic awareness about the consequences of promoting harmful stereotypes, but it lacks depth and insight as it doesn't disclose the specific comments or the amount of the fine. It also doesn't provide any broader context about the issue of sexual stereotypes in sports or society.",
    "image": {
      "src": "https://live.staticflickr.com/5301/5678040292_1192655a61_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/291b7785-5cd8-4fb9-be27-f55212b1e381/thumb/",
      "alt": "Javier Hernandez",
      "credit": "wonker / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Trump’s AI Action Plan aims to block chip exports to China but lacks key details",
    "domain": "technology",
    "location": "global",
    "published": "Wed, 23 Jul 2025 18:39:36 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "The AI Action Plan offers a path, but not a concrete plan, for what the administration is thinking when it comes to chip export restrictions."
    ],
    "image_url": "",
    "titles": [
      "Trump’s AI Action Plan aims to block chip exports to China but lacks key details"
    ],
    "score_components": {
      "magnitude": 0.099,
      "recency": 0.755,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.384,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story raises awareness about a political decision that could have significant impacts on the global tech industry. However, it lacks depth and insight as it does not provide key details about the plan or discuss its potential implications in depth.",
    "image": {
      "src": "https://live.staticflickr.com/815/40567174204_f340b664a7_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/193cb26a-47b0-4ceb-90ff-c10ce8c0ee1c/thumb/",
      "alt": "trump",
      "credit": "Book Catalog / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Rybakina Defeats Mboko in Citi Open Second Round",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 23 Jul 2025 21:55:19 EDT",
    "source": "Sportsnet",
    "sources": [
      "Sportsnet"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "<p>Canada&#8217;s Victoria Mboko fell 6-3, 7-5 to Kazakhstan&#8217;s Elena Rybakina in second-round action at the Citi Open tennis tournament on Wednesday.</p>"
    ],
    "image_url": "https://www.sportsnet.ca/wp-content/uploads/2025/07/Mboko.jpg",
    "titles": [
      "Canada’s Mboko ousted in second round of Citi Open with loss to Rybakina"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.878,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.367,
    "summary": "Victoria Mboko of Canada was defeated by Elena Rybakina of Kazakhstan in the second round of the Citi Open tennis tournament with a score of 6-3, 7-5. This loss ended Mboko's run in the tournament.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about the outcome of a tennis match but doesn't offer in-depth analysis or insights about the game, the players' performance, or the implications of the result.",
    "image": {
      "src": "https://live.staticflickr.com/520/30765139183_62bb4e4667_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/dccf4c8d-0b91-43f7-8362-3fc6207ad07d/thumb/",
      "alt": "canada",
      "credit": "PokemonaDeChroma / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Here is Lego’s official Nintendo Game Boy — with lenticular display",
    "domain": "technology",
    "location": "global",
    "published": "2025-07-23T21:19:19-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "We asked for the perfect Lego Nintendo Game Boy… did Lego deliver? After revealing this January that it would take up the challenge, it has revealed a most impressive take on the 1989 classic that’ll cost a relatively reasonable $60 in the US. It’s already up for pre-order today for an October 1st s"
    ],
    "image_url": "",
    "titles": [
      "Here is Lego’s official Nintendo Game Boy — with lenticular display"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.867,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.365,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "The story provides basic awareness about a new product, but does not offer any depth or insight into its relevance, impact, or use. It lacks actionable insights or a deeper understanding for the reader.",
    "image": {
      "src": "https://live.staticflickr.com/2309/2061838738_c99994cb24_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/04dbd5d0-f866-4df2-b2b3-8501cbda8c56/thumb/",
      "alt": "Dhaka, Bangladesh, Don't sit here you could be beaten.",
      "credit": "",
      "license": "cc0",
      "license_version": "1.0",
      "license_url": "https://creativecommons.org/publicdomain/zero/1.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "A new AI coding challenge just published its first results — and they aren’t pretty",
    "domain": "technology",
    "location": "global",
    "published": "Thu, 24 Jul 2025 00:00:00 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "A new AI coding challenge has revealed its first winner — and set a new bar for AI-powered software engineers."
    ],
    "image_url": "",
    "titles": [
      "A new AI coding challenge just published its first results — and they aren’t pretty"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.844,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.338,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "Without a summary or more context, it's impossible to evaluate the constructiveness of this story. It could potentially offer insights into the state of AI coding, but without more information, no score can be given.",
    "image": {
      "src": "https://live.staticflickr.com/7594/28799579322_f9e3ce8511_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/b52e7dfb-5b36-417b-8387-f8d7fd8c07e3/thumb/",
      "alt": "Intelligence Inside: the future of AI and computation",
      "credit": "jurvetson / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  }
]