[
  {
    "title": "Ghislaine Maxwell's Supreme Court Appeal Declined, Transferred to Texas Camp",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 06 Oct 2025 19:11:11 GMT",
    "source": "BBC",
    "sources": [
      "Forbes",
      "CNBC",
      "ABC News",
      "Axios",
      "BBC",
      "Al Jazeera"
    ],
    "domains": [
      "www.bbc.com",
      "www.cnbc.com",
      "abcnews.go.com",
      "news.google.com",
      "www.aljazeera.com",
      "www.forbes.com"
    ],
    "snippets": [
      "The British socialite is serving a 20-year prison sentence on sex-trafficking charges related to former boyfriend Jeffrey Epstein.",
      "Former girlfriend of convicted sex abuser Jeffrey Epstein is serving a 20-year prison sentence for sex trafficking.",
      "<a href=\"https://news.google.com/rss/articles/CBMifEFVX3lxTE10cURkM1huYWlic0RVWWJVQ0F1ZUprbUYzdkE3Y0VhTUZSR04yV2s4Y0hoWHlvMU9aWkRabVdpTzNxc1h0N05SUGphQUxEUEh2azBRRUFhb2xrYmY5SHBUYkFoUzYxTmthQjhyTV9nejE5OUNBZ0JsZzhNSUQ?oc=5\" target=\"_blank\">Supreme Court rejects Epstein associate Ghislaine Maxwell's ",
      "The Supreme Court has declined to take up the appeal of Maxwell, who was contesting her prosecution and conviction on grounds that the government had violated an agreement made with Jeffrey Epstein before his death.",
      "Ghislaine Maxwell, the convicted procurer of Jeffrey Epstein, may now focus efforts to get a pardon or sentence commutation from President Donald Trump.",
      "Maxwell, a longtime associate of Jeffrey Epstein, is serving a 20-year prison sentence for sex trafficking."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/fd26/live/1f0875e0-a2d4-11f0-92db-77261a15b9d2.jpg",
    "titles": [
      "US Supreme Court rejects Ghislaine Maxwell appeal in Epstein case",
      "US Supreme Court declines to hear Ghislaine Maxwell appeal",
      "Supreme Court rejects Epstein associate Ghislaine Maxwell's appeal - Axios",
      "WATCH:  Supreme Court denies Ghislaine Maxwell appeal",
      "Supreme Court rejects appeal of Ghislaine Maxwell for Epstein abetting conviction",
      "Trump Says He’ll ‘Take A Look’ At Maxwell Case When Asked About Pardon After Supreme Court Rejects Her Appeal"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.882,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.826,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Ghislaine Maxwell, associated with Jeffrey Epstein, is serving a 20-year sentence for sex trafficking and related crimes as of 2022. Her appeal to the US Supreme Court was declined. Maxwell attempted to argue her indictment was invalid due to Epstein's 2007 non-prosecution agreement. Recently, she was transferred from a low-security prison in Florida to a minimum-security camp in Texas.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "ICC Convicts Janjaweed Leader of War Crimes in Darfur",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Mon, 06 Oct 2025 15:05:55 -0400",
    "source": "NPR",
    "sources": [
      "Deutsche Welle",
      "NPR",
      "Al Jazeera",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.aljazeera.com",
      "www.npr.org",
      "www.dw.com"
    ],
    "snippets": [
      "The International Criminal Court in The Hague handed down its first-ever Darfur war crimes conviction, finding Janjaweed leader Ali Kushayb, guilty of atrocities committed more than two decades ago.",
      "The International Criminal Court has found Sudanese militia chief Ali Muhammad Ali Abd-Al-Rahman guilty of war crimes.",
      "For the first time, the ICC has found a militia leader guilty of war crimes committed in Sudan's Darfur region more than 20 years ago.",
      "<p>Janjaweed commander Ali Muhammad Ali Abd-al-Rahman, known as Ali Kushayb, found guilty over atrocities</p><p>The international criminal court has convicted a leader of the Janjaweed militia of playing a leading role in a campaign of atrocities committed in the Sudanese region of Darfur more than "
    ],
    "image_url": "",
    "titles": [
      "ICC finds former Sudan militia leader guilty of war crimes in Darfur",
      "ICC convicts first militia leader for brutal attacks in Darfur",
      "Darfur militia leader convicted by ICC for war crimes",
      "ICC convicts former Sudan militia leader for war crimes in Darfur"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.898,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.794,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The International Criminal Court (ICC) has convicted Janjaweed militia leader Ali Muhammad Ali Abd-Al-Rahman, known as Ali Kushayb, of war crimes in Sudan's Darfur region, marking the court's first conviction for crimes in this area. Abd-Al-Rahman was found guilty on 27 counts of war crimes committed over 20 years ago.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Raises Tariff on Brazil to 40%; Discusses Cooperation with Lula",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Mon, 06 Oct 2025 17:41:00 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Deutsche Welle",
      "Fortune",
      "Al Jazeera",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.aljazeera.com",
      "www.dw.com",
      "fortune.com"
    ],
    "snippets": [
      "Trump had imposed a 40% tariff on Brazil in July on top of a 10% earlier even though US has a trade surplus with Brazil.",
      "Brazil's leader held a \"positive\" call with US President Donald Trump, and discussed punitive measures imposed by the US president who has claimed a criminal case against Brazil's ex-president Jair Bolsonaro was biased.",
      "<p>Presidents spoke on a video call as expert speculates that Haiti could be an area where the two leaders can cooperate</p><p>Brazil’s president, Luiz Inácio Lula da Silva, has urged Donald Trump to scrap tariffs on his country’s imports and sanctions against its officials, as the two men held what",
      "Later, Trump posted on Truth Social that he had had a good conversation with Lula. “We discussed many things, but it was mostly focused on the Economy.”"
    ],
    "image_url": "",
    "titles": [
      "Lula asks Trump to lift 40 percent tariff from Brazilian goods",
      "Brazil's Lula asks Trump to lift tariffs in video call",
      "Brazil’s president asks US to scrap tariffs in ‘friendly’ call with Trump",
      "Trump, Lula talk for 30 minutes, exchange numbers and Brazilian boss asks again for lifting of 40% tariff"
    ],
    "score_components": {
      "magnitude": 0.952,
      "recency": 0.872,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.785,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "In July, President Trump imposed a 40% tariff on Brazil, adding to a previous 10% tariff despite the US having a trade surplus with Brazil. Following a \"positive\" video call between Brazil's President Luiz Inácio Lula da Silva and Trump, discussions were held on the punitive measures, including tariffs and sanctions against Brazilian officials. The call also touched on cooperation opportunities, such as in Haiti. Lula urged Trump to reconsider the tariffs and sanctions.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Harry Kane Open to New Contract Talks with Bayern, Less Keen on Premier League R",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 06 Oct 2025 22:00:58 GMT",
    "source": "BBC",
    "sources": [
      "Sky Sports",
      "BBC",
      "Yahoo Sports",
      "The Guardian"
    ],
    "domains": [
      "www.bbc.com",
      "www.theguardian.com",
      "www.skysports.com"
    ],
    "snippets": [
      "Harry Kane says his interest in returning to the Premier League has cooled and he is willing to open talks with Bayern Munich over a new contract.",
      "Harry Kane says his interest in returning to the Premier League has cooled and he is willing to open talks with Bayern Munich over a new contract.",
      "<ul><li><p>Kane’s current deal at German club expires in 2027</p></li><li><p>‘In terms of staying longer I could definitely see that’</p></li></ul><p>Harry Kane says he is open to extending his stay at Bayern Munich and believes a return to the Premier League is no longer guaranteed.</p><p>The Engla",
      "Harry Kane has revealed that his desire to play in the Premier League again has cooled, as he suggested he is open to extending his Bayern Munich stay."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/8504/live/d1758290-a2f2-11f0-b741-177e3e2c2fc7.jpg",
    "titles": [
      "'I'm fully all in with Bayern' - Kane cools on Premier League return",
      "'I am fully all in' - Kane open to new Bayern deal",
      "Harry Kane open to Bayern Munich stay and unsure of Premier League return",
      "Kane open to new Bayern deal as he dampens Premier League return talk"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.935,
      "consensus": 0.888,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.771,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Harry Kane has expressed a diminished interest in returning to the Premier League, indicating openness to discussing a new contract with Bayern Munich. His current deal with the German club is set to expire in 2027, and he sees potential for an extended stay.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "U.S. Deports 10 More to Eswatini Amid Human Rights Concerns",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Mon, 06 Oct 2025 22:31:05 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "The Guardian",
      "Axios"
    ],
    "domains": [
      "www.theguardian.com",
      "www.aljazeera.com",
      "news.google.com"
    ],
    "snippets": [
      "Trump administration continues to send individuals to countries where they have no ties amid mass deportation push.",
      "<a href=\"https://news.google.com/rss/articles/CBMiZ0FVX3lxTE51Y3ozUTlFV25zWEtiNmlNbDMyS05wdk1QZHJ5ZUp2NTJyOGc3TWJ2ZE5IT1RGYWxPeW5CbklNU3dJaFhJT1JnYVZ1NHVueVVPbk9BZ1VtUzNfOWgwZ1ZadTh5RDBudVU?oc=5\" target=\"_blank\">10 more migrants sent to Eswatini as part of U.S.' third-country deportation agreement</",
      "<p>African kingdom receives second group of third-country nationals in what NGOs and lawyers say is violation of human rights</p><p>Ten people deported by the US have arrived in Eswatini, its government said, the second group of third-country deportees to be sent to the southern African kingdom by t"
    ],
    "image_url": "",
    "titles": [
      "US sends another ‘third-country’ deportation flight to Eswatini",
      "10 more migrants sent to Eswatini as part of U.S.' third-country deportation agreement - Axios",
      "Eswatini confirms arrival of 10 more people as part of US deportation deal"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.965,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.73,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The U.S. has deported ten more individuals to Eswatini as part of its third-country deportation policy, despite criticisms from NGOs and lawyers who argue this violates human rights. This marks the second instance of deportees with no ties to the African kingdom being sent there, following an agreement between the U.S. and Eswatini.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "France's PM Lecornu Resigns After Less Than 24 Hours Amid Political Crisis",
    "domain": "business",
    "source_domain": "www.ft.com",
    "location": "global",
    "published": "Mon, 06 Oct 2025 19:57:14 GMT",
    "source": "Financial Times",
    "sources": [
      "Washington Post",
      "New York Times",
      "Financial Times"
    ],
    "domains": [
      "www.washingtonpost.com",
      "www.ft.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "Sébastien Lecornu, who quit on Monday, is asked by Emmanuel Macron to quickly negotiate a stability plan",
      "Sébastien Lecornu, a former defense minister, was in the job less than a month. He was appointed after a no-confidence vote toppled his predecessor.",
      "Sébastien Lecornu’s departure ratcheted up pressure on President Emmanuel Macron to call snap parliamentary elections."
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Fa8203189-4539-47a3-b3ee-407e11ff91b2.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "France in fresh political and market turmoil after prime minister resigns",
      "Prime minister of France resigns hours after naming new government",
      "French Prime Minister Sébastien Lecornu Resigns"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.896,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.726,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Sébastien Lecornu, France's newly appointed Prime Minister, resigned less than 24 hours after forming his government and less than a month in office, citing deep political divisions and criticism from various factions, including threats from rightwing allies to withdraw support. His resignation, accepted by President Emmanuel Macron, follows criticism over the largely unchanged cabinet lineup and plunges the country into a political crisis. Lecornu, a former defense minister, had assumed the role after a no-confidence vote ousted his predecessor.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Netanyahu Optimistic on Hostage Release by Oct. 13 Amid Gaza Ceasefire Talks",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 06 Oct 2025 17:27:02 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian",
      "New York Times"
    ],
    "domains": [
      "www.bbc.com",
      "www.theguardian.com",
      "www.bbc.co.uk",
      "www.nytimes.com"
    ],
    "snippets": [
      "The talks are expected to be among the most consequential since the start of the war two years ago.",
      "Negotiators from Israel and Hamas are heading to Sharm El-Sheikh, Egypt, to start indirect talks about ending the Israel-Gaza war.",
      "Trump urges mediators to “move fast” as key Gaza talks begin.",
      "Though significant issues remain to be hashed out between Israel and Hamas, some are saying that after two years of death and destruction, a breakthrough may be near.",
      "Israel and Hamas said they will work with President Trump’s proposal to end the Gaza war. But persistent sticking points could derail a diplomatic breakthrough.",
      "<p>Hamas’s acceptance of key conditions of deal galvanises momentum but large gaps remain between camps</p><p>Israel and Hamas have begun indirect talks in Egypt on a US ceasefire proposal amid cautious optimism that the nearly two-year war in Gaza may be nearing its end, despite deep divisions betw"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/3501/live/d3778430-a2de-11f0-a01f-432b14e9b57f.jpg",
    "titles": [
      "Israel and Hamas begin indirect talks in Egypt on Trump's Gaza peace plan",
      "What are the key sticking points in Trump's Gaza peace plan?",
      "Will Trump’s Gaza Peace Plan Work?",
      "Israel and Hamas Meet in Egypt to Discuss Gaza Peace Plan",
      "Trump’s Gaza Peace Plan: What to Know",
      "Israel and Hamas begin indirect talks as hopes rise of ending Gaza war"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.85,
      "consensus": 0.809,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.722,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Israeli Prime Minister Netanyahu expressed hope for the release of all hostages by Hamas by Oct. 13, following partial agreement to President Trump's 20-point Gaza ceasefire plan. While Hamas has agreed to release hostages and discuss governing Gaza with Palestinian technocrats, negotiations on several aspects of the plan remain. Both Israel and Hamas have shown willingness to work towards ending the conflict, but unresolved issues could impede a diplomatic breakthrough. The US President has cautioned Hamas about the limited time available to finalize the deal.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Rescue Efforts Underway for Hikers Trapped on Everest's North Slope",
    "domain": "general",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Mon, 06 Oct 2025 12:38:23 -0400",
    "source": "ABC News",
    "sources": [
      "Washington Post",
      "New York Times",
      "ABC News"
    ],
    "domains": [
      "www.nytimes.com",
      "www.washingtonpost.com",
      "abcnews.go.com"
    ],
    "snippets": [
      "An effort is underway to rescue hundreds of hikers who became trapped on Mount Everest due to an unexpected blizzard.",
      "Some 350 hikers were rescued and 200 remained stranded, Chinese state media reported Monday, as rescue efforts continued in China’s Tibet Autonomous Region.",
      "The snowfall buried tents and reduced visibility. The local authorities said that they were in contact with the hikers and that rescue efforts were underway."
    ],
    "image_url": "https://s.abcnews.com/images/International/251006_abc_social_everest_hpMain_4x3_384.jpg",
    "titles": [
      "WATCH:  Hundreds of hikers trapped by blizzard on Mount Everest",
      "Snowstorm traps hundreds on Mount Everest",
      "Snowstorm Traps Hundreds of Everest Hikers"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.854,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.718,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Rescue workers in Tibet are assisting hundreds of hikers trapped by a snowstorm on Mount Everest's northern slope. Chinese state media reported that tents at tourist campsites were damaged, and there are casualties. The heavy snowfall has buried tents and blocked rescue roads, but local authorities are in contact with the hikers and rescue efforts are ongoing.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Supreme Court Term Begins, Presidential Power Limits in Focus",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 06 Oct 2025 20:08:48 GMT",
    "source": "BBC",
    "sources": [
      "New York Times",
      "BBC",
      "Axios"
    ],
    "domains": [
      "www.bbc.com",
      "news.google.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "Legal challenges have slowed Trump's attempts to expand presidential power. Now the highest US court is going to weigh in.",
      "<a href=\"https://news.google.com/rss/articles/CBMiiwFBVV95cUxPVEpBWDJPcGpPNEZCVVUtR3RlbDU5NXNGR2NYZDhPcWVPQ3F1TGgxYTVoWU9PYUEtNFVjNExJdzYzZVZoODgxN2p1SWdsRmRmVkxRNVVhVUlMQXNsSTR6Vm1XdTEzVmUxNEpycEhWUUV0eEViOU92aDcyRXBVYU1fekQ0MGQwTnkyREo4?oc=5\" target=\"_blank\">Trump, tariffs and trans rights: The Su",
      "Today, we look ahead at the potential consequences of the Supreme Court term that begins today."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/1c9a/live/721ac360-a2f1-11f0-b741-177e3e2c2fc7.jpg",
    "titles": [
      "New Supreme Court term will reshape Trump's powers",
      "Trump, tariffs and trans rights: The Supreme Court gears up for a new term - Axios",
      "President Trump and the Supreme Court"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.899,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.717,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Supreme Court's new term starts today, amid concerns over its failure to limit presidential power, which critics argue has had negative consequences. This term's outcomes could have significant implications, especially in the context of global authoritarian trends highlighted by leaders like Hungary's Viktor Orbán and Turkey's Recep Tayyip Erdoğan.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Orders Approval of Alaska Mining Road to Boost Tech Minerals Access",
    "domain": "business",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Mon, 06 Oct 2025 23:01:18 +0000",
    "source": "Global News",
    "sources": [
      "Financial Post",
      "Global News"
    ],
    "domains": [
      "financialpost.com",
      "globalnews.ca"
    ],
    "snippets": [
      "U.S. Interior Secretary Doug Burgum said approval of Ambler Road will unlock access to critical minerals 'that we need to win the AI arms race against China.'",
      "WASHINGTON (AP) &#8212; President Donald Trump on Monday ordered approval of a proposed 211-mile road through an Alaska wilderness to allow mining of copper, cobalt, gold and other minerals. The long-debated Ambler Road project was approved in Trump&#8217;s first term, but was later blocked by the B"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/10/CP175122263.jpg?quality=65&strip=all",
    "titles": [
      "Trump approves Alaska mining road, stake in Canadian firm behind project",
      "Trump approves Alaska mining road to boost copper, zinc production"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.975,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.707,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "President Donald Trump ordered the approval of the Ambler Road project, a 211-mile road through Alaska wilderness, to facilitate mining of copper, cobalt, gold, and other minerals. Initially approved during Trump's first term, the project aims to access critical minerals for technological advancements, as highlighted by U.S. Interior Secretary Doug Burgum, emphasizing its importance in the AI arms race against China.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Canada Coffee Prices Surge Amid Climate Impact on Beans",
    "domain": "general",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Mon, 06 Oct 2025 23:38:01 +0000",
    "source": "Global News",
    "sources": [
      "CityNews",
      "Global News"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "globalnews.ca"
    ],
    "snippets": [
      "A surge in price of coffee beans, up 28 per cent in August, compared to a year ago, means Canadians digging a lot deeper into their pocket to pay for that morning cup of joe.",
      "Your daily cup of java is getting a little more expensive as roasters and cafés grapple with rising coffee bean prices. Climate change has been the biggest contributor to the ongoing surge in bean prices, as coffee crops are very sensitive to temperature changes, said Michael von Massow, food econom"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/10/coffee-latte.jpg?quality=65&strip=all",
    "titles": [
      "Coffee roasters and cafés grapple with increasing cost of beans",
      "Roasters and cafés grapple with rising coffee bean prices"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.987,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.702,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Coffee prices in Canada have risen due to a 28% increase in coffee bean costs compared to last year. Climate change, affecting temperature-sensitive coffee crops, is a major factor behind this surge. This has led to higher prices for consumers at roasters and cafés.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "2025 Nobel Prize in Medicine Awarded for Autoimmunity Research",
    "domain": "science",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-10-06T09:51:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "New Scientist",
      "Ars Technica"
    ],
    "domains": [
      "www.newscientist.com",
      "arstechnica.com",
      "www.dw.com"
    ],
    "snippets": [
      "Mary E. Brunkow, Fred Ramsdell, and Shimon Sakaguchi will be awarded the Nobel Prize in physiology or medicine for their instrumental work in improving our understanding of how the immune system functions.",
      "The 2025 Nobel prize in physiology or medicine has gone to Mary Brunkow, Fred Ramsdell and Shimon Sakaguchi for their discoveries around how we keep our immune system under control",
      "Their work revealed a peripheral mechanism that keeps immune system from causing harm."
    ],
    "image_url": "",
    "titles": [
      "Trio wins Nobel Prize in medicine for immune system research",
      "Nobel prize for medicine goes to trio for work on immune tolerance",
      "Discovery of cells that keep immune responses in check wins medicine Nobel Prize"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.741,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.695,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Mary E. Brunkow, Fred Ramsdell, and Shimon Sakaguchi were awarded the 2025 Nobel Prize in Physiology or Medicine for their groundbreaking research on how the immune system is regulated to prevent it from attacking the body's own tissues. Their work, which involves the identification of mechanisms that help maintain immune system balance, has been pivotal in advancing our understanding of autoimmunity. This US-Japanese team's discoveries have significantly contributed to the field of immunology.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: research",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Optimistic on Israel-Hamas Talks Amid Gaza Violence",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-10-06T07:20:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "Washington Post",
      "The Guardian"
    ],
    "domains": [
      "www.washingtonpost.com",
      "www.theguardian.com",
      "www.dw.com"
    ],
    "snippets": [
      "Delegations from Israel and Hamas are holding indirect talks on US President Donald Trump's plan for Gaza. Germany's foreign minister is heading to Egypt for talks on the negotiations. DW has the latest.",
      "<p>Talks on Monday expected to focus on release of hostages and end to war, after Israel kills 63 people in Gaza in past day</p><p>Donald Trump has urged negotiators to “move fast” in talks focused on the release of hostages held by Hamas in Gaza and a broader end to the war, as representatives arri",
      "Israel and Hamas gathered in Egypt for indirect talks over a U.S.-backed plan to end the Gaza war after months of deadlock."
    ],
    "image_url": "",
    "titles": [
      "Middle East updates: Gaza ceasefire talks start in Egypt",
      "Trump urges negotiators to ‘move fast’ as Gaza ceasefire talks set to begin in Egypt",
      "Gaza ceasefire talks begin in Egypt, as Israel strikes enclave"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.703,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.691,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "US President Donald Trump expressed optimism about the speed of negotiations between Israel and Hamas, focusing on the release of hostages and ending the conflict. This comes as talks are set to begin, following a deadly day in Gaza where 63 people were killed by Israeli forces. Trump has urged for quick action in these discussions.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Chargers' Omarion Hampton on Injured Reserve, Haskins and Vidal to Step Up",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 6 Oct 2025 19:57:34 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "Chargers starting running back Omarion Hampton will be placed on injured reserve due to an ankle injury, coach Jim Harbaugh said Monday.",
      "Hassan Haskins and Kimani Vidal are next up in the Chargers' backfield"
    ],
    "image_url": "",
    "titles": [
      "Chargers placing top RB Hampton (ankle) on IR",
      "Omarion Hampton injury update: Chargers RB (ankle) joins Najee Harris on IR, will miss at least four games"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.994,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.679,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Los Angeles Chargers' starting running back, Omarion Hampton, has been placed on injured reserve due to an ankle injury, as announced by coach Jim Harbaugh. Hassan Haskins and Kimani Vidal are set to take over duties in the Chargers' backfield following Hampton's injury.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Cardinals Coach Apologizes to Demercado After Sideline Dispute",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 6 Oct 2025 19:57:34 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Yahoo Sports"
    ],
    "domains": [
      "www.espn.com",
      "www.nbcsports.com"
    ],
    "snippets": [
      "Arizona Cardinals coach Jonathan Gannon said he apologized to Emari Demercado after a heated sideline conversation following the RB's unforced fumble.",
      "After Cardinals running back Emari Demercado dropped the football inches short of capping a 72-yard run with a score, TV cameras captured images of coach Jonathan Gannon berating Demercado."
    ],
    "image_url": "",
    "titles": [
      "Gannon apologizes to Demercado for sideline spat",
      "Cardinals coach Jonathan Gannon apologized to RB Emari Demercado for sideline interaction"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.994,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.679,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Arizona Cardinals coach Jonathan Gannon apologized to running back Emari Demercado after a heated exchange on the sideline, which occurred when Demercado fumbled the ball just short of scoring following a 72-yard run. The incident and subsequent apology were captured and reported by TV cameras.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Mark Sanchez Charged With Felony Battery After Altercation in Indianapolis",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 6 Oct 2025 19:57:34 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "Mark Sanchez is facing a felony battery charge over the altercation between the former NFL quarterback and a 69-year-old truck driver early Saturday in Indianapolis.",
      "<p>Former NFL quarterback Mark Sanchez is now facing a felony charge of battery involving serious bodily injury in addition to the misdemeanor charges stemming from a weekend incident in Indianapolis that led to his arrest.</p>"
    ],
    "image_url": "",
    "titles": [
      "Sanchez now facing felony charge for altercation",
      "Former NFL QB Mark Sanchez facing felony charge in Indianapolis altercation"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.994,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.679,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Former NFL quarterback and Fox Sports commentator Mark Sanchez has been charged with felony battery following an altercation with a 69-year-old truck driver in Indianapolis early Saturday.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Bills' Keon Coleman Benched for Discipline, Coach Seeks Consistency",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 6 Oct 2025 19:57:34 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "Buffalo Bills wide receiver Keon Coleman was benched for the first offensive series of Sunday night's loss to the New England Patriots due to \"discipline,\" head coach Sean McDermott said Monday.",
      "McDermott wants to see 'more consistency' from the second-year wideout"
    ],
    "image_url": "",
    "titles": [
      "Bills benched WR Coleman for disciplinary reasons",
      "Bills benched Keon Coleman for first series vs. Patriots due to disciplinary reasons, Sean McDermott reveals"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.994,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.679,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Buffalo Bills wide receiver Keon Coleman was benched for the first offensive series during Sunday night's game against the New England Patriots as a disciplinary action, according to head coach Sean McDermott. McDermott emphasized the need for \"more consistency\" from the second-year player.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Florida Panthers Receive Rings for Second Stanley Cup Win",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 6 Oct 2025 19:57:34 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Yahoo Sports"
    ],
    "domains": [
      "www.usatoday.com",
      "www.espn.com"
    ],
    "snippets": [
      "The Florida Panthers handed out the rings from their second consecutive Stanley Cup title Monday, a day before the franchise will raise its back-to-back title banner on Opening Night, when they take on the Chicago Blackhawks at Amerant Bank Arena.",
      "The Panthers got their NHL championship rings that pay homage to the fans' tradition of throwing plastic rats on the ice rink after victories."
    ],
    "image_url": "",
    "titles": [
      "Panthers receive Cup rings, prep for banner night",
      "Florida Panthers receive NHL championship rings with engraved rat"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.994,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.679,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Florida Panthers received their NHL championship rings for their second consecutive Stanley Cup title on Monday. These rings honor the fans' tradition of throwing plastic rats on the ice after wins. The team will raise their back-to-back title banner during the season opener against the Chicago Blackhawks at Amerant Bank Arena.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Ja Morant Sidelined Indefinitely with Left Ankle Sprain",
    "domain": "sports",
    "source_domain": "www.nbcsports.com",
    "location": "national",
    "published": "Mon, 06 Oct 2025 23:44:33 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Sports Illustrated",
      "Yahoo Sports"
    ],
    "domains": [
      "news.google.com",
      "www.nbcsports.com"
    ],
    "snippets": [
      "Memphis already has its entire starting frontcourt out through training camp and into the season, now this.",
      "<a href=\"https://news.google.com/rss/articles/CBMib0FVX3lxTE1IeVZmRGpvX0NYOGhBMm43NU1UeVhJcjdqTE5jQU5iSEM5bi1nU3BBWF9GRWNHOTRndVpPMGtLTkRiNnlkM29PaWw3VHFoXzEtaTN2UnF0YVd0c045cHhuSlZ4Uk1SV2llaC1aMnhOaw?oc=5\" target=\"_blank\">Ja Morant Suffers Ankle Injury in Practice as Grizzlies’ Injury Woes Continue"
    ],
    "image_url": "",
    "titles": [
      "Another Grizzlies injury: Ja Morant week-to-week with a sprained ankle",
      "Ja Morant Suffers Ankle Injury in Practice as Grizzlies’ Injury Woes Continue - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.99,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.67,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Ja Morant, the Memphis Grizzlies all-star guard, is out on a week-to-week basis following a left ankle sprain sustained during practice. This injury puts his availability for the start of the regular season in doubt.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: sustain",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Connor McDavid Signs Extension with Oilers Through 2027-28",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 6 Oct 2025 15:44:48 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "No. 97 is sticking with the Oilers through 2027-28 -- with a wide range of downstream impacts around the NHL.",
      "<p>Mark Spector joins The FAN Hockey Show to discuss Connor McDavid&#8217;s contract extension with the Oilers, discussing what may have been behind the decision to hold out through the summer, and how the team should be positioned for success around him.</p>"
    ],
    "image_url": "",
    "titles": [
      "Winners and losers of Connor McDavid's contract extension",
      "What factored into McDavid’s decision to wait on an extension?"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.911,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.662,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Connor McDavid has extended his contract with the Edmonton Oilers through the 2027-28 season. The decision, discussed by Mark Spector on The FAN Hockey Show, reflects strategic planning for the Oilers' future success around McDavid. This extension is expected to have significant implications for the NHL.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "US Government Shutdown Enters Second Week; Negotiations Ongoing",
    "domain": "general",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Mon, 06 Oct 2025 19:46:59 -0400",
    "source": "ABC News",
    "sources": [
      "ABC News",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "abcnews.go.com"
    ],
    "snippets": [
      "The Senate on Monday again rejected Democratic and Republican proposals to fund the government and end the shutdown, now in its sixth day.",
      "<p>Competing bills fail to pass 60-vote threshold, while Trump hints at possible deal with Democrats over health subsidies </p><p>The US government shutdown entered its second week as the Senate again rejected rival bills to restart funding and Donald Trump suggested he might be open to negotiating "
    ],
    "image_url": "https://s.abcnews.com/images/US/shutdown-5-ap-gmh-251006_1759765397783_hpMain_4x3t_384.jpg",
    "titles": [
      "Government shutdown updates: Senate again fails to pass funding bills",
      "US shutdown enters second week as Senate again rejects rival funding bills"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.991,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.66,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The US government shutdown extended into its second week after the Senate failed to pass both Democratic and Republican funding bills. Negotiations continue as President Trump hints at a possible compromise involving health subsidies.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "OpenAI Enables App Creation Inside ChatGPT Conversations",
    "domain": "technology",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Mon, 06 Oct 2025 18:54:57 GMT",
    "source": "Axios",
    "sources": [
      "TechCrunch",
      "Axios"
    ],
    "domains": [
      "techcrunch.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMiakFVX3lxTE9BME9PcGhMV0FFcEdkTXlDclRQMlRQdTk1RWtKZEF5NWJEZExxM1VnQVRldWZUVTB1elZibk9xR3JodTVWWnhTa05vWUxrUkM0SnlQT1VzZkc1UUpUNDlaU3FUaUxrZS1XSnc?oc=5\" target=\"_blank\">OpenAI launches new feature to integrate third-party apps</a>&nbsp;&nbsp;<font color",
      "OpenAI is launching a new way for developers to build applications that appear directly inside of ChatGPT's conversations."
    ],
    "image_url": "",
    "titles": [
      "OpenAI launches new feature to integrate third-party apps - Axios",
      "OpenAI launches apps inside of ChatGPT"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.877,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.637,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "OpenAI has introduced a feature allowing developers to create apps within ChatGPT conversations. This new integration aims to enhance user experience and functionality within the platform.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Paramount Skydance Acquires The Free Press for $150M",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Mon, 06 Oct 2025 12:48:54 GMT",
    "source": "Axios",
    "sources": [
      "CNBC",
      "Axios"
    ],
    "domains": [
      "www.cnbc.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMigAFBVV95cUxOMFB6eHNlOTdvV1NnV2tueE9QOW9VRTlBcnctbnZfX1hNQURLQ0JJbFJ4RXFkTUJEUDJ0NlI5VXlIQWM3UW5Ic2FsM3RMUExuNVNoYk9UQTBQSkNpcW4yRVZsa1JFUUtmMWgxeG1kYWgzMk5HTGtJT21BN2FRTGdzYw?oc=5\" target=\"_blank\">Paramount Skydance acquires The Free Press for $150M<",
      "Paramount Skydance has agreed to acquire online publication The Free Press, founded by Bari Weiss."
    ],
    "image_url": "",
    "titles": [
      "Paramount Skydance acquires The Free Press for $150M - Axios",
      "Paramount Skydance to acquire Bari Weiss-founded Free Press"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.772,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.619,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Paramount Skydance has purchased The Free Press for $150 million. The online publication was founded by Bari Weiss. The acquisition marks a significant development in the media industry.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Meta Launches Contest Judged by Celebrities Amid Payout Cuts",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Mon, 06 Oct 2025 15:00:45 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "TechCrunch"
    ],
    "domains": [
      "www.cnbc.com",
      "techcrunch.com"
    ],
    "snippets": [
      "Winners will be chosen by a panel including Instagram chief Adam Mosseri, filmmaker Spike Lee, designer Marc Jacobs and YouTuber Marques Brownlee.",
      "The move comes as Meta has been scaling back its creator payout programs over the past few years."
    ],
    "image_url": "",
    "titles": [
      "Instagram will award top creators with a gold ring. But no cash",
      "Instagram introduces new ‘Ring’ award for top creators"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.808,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.617,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Meta has announced a competition with winners selected by a panel featuring Instagram's Adam Mosseri, filmmaker Spike Lee, designer Marc Jacobs, and YouTuber Marques Brownlee. This occurs as Meta reduces its creator payout programs.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Sharma: AI Vital for US Economic Stability, Warns of Risks Without It",
    "domain": "business",
    "source_domain": "www.ft.com",
    "location": "global",
    "published": "Mon, 06 Oct 2025 04:00:22 GMT",
    "source": "Financial Times",
    "sources": [
      "Fortune",
      "Financial Times"
    ],
    "domains": [
      "www.ft.com",
      "fortune.com"
    ],
    "snippets": [
      "It’s seen as the magic fix for every threat to the US economy",
      "“AI better deliver for the U.S., or its economy and markets will lose the one leg they are now standing on,” warns Ruchir Sharma of Rockefeller International."
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Fbe7daf2f-242b-4a43-812b-21e3de3be5eb.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "America is now one big bet on AI",
      "AI is becoming the ‘magic fix’ as America places ‘one big bet’ on it not being a bubble, market veteran warns"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.643,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.591,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Ruchir Sharma of Rockefeller International has highlighted the importance of artificial intelligence (AI) for the U.S. economy, indicating that it is crucial for maintaining economic and market stability. Sharma warns that without AI's success, the U.S. could face significant economic challenges.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Consulting Firm to Refund for Report Errors, Admits Using GPT-4o",
    "domain": "technology",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Mon, 06 Oct 2025 06:46:24 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "Ars Technica"
    ],
    "domains": [
      "arstechnica.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "<p>Partial refund to be issued after several errors were found in a report into a department’s compliance framework</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"ht",
      "Consulting firm quietly admitted to GPT-4o use after fake citations were found in August."
    ],
    "image_url": "https://i.guim.co.uk/img/media/515a0bf6dc96a2183fa9f4bc90a2fbeac2d91271/209_0_3292_2635/master/3292.jpg?width=140&quality=85&auto=format&fit=max&s=8962fcf918cd8a7bb9fd43f347b78c8c",
    "titles": [
      "Deloitte to pay money back to Albanese government after using AI in $440,000 report",
      "Deloitte will refund Australian government for AI hallucination-filled report"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.681,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.591,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A consulting firm will issue a partial refund due to multiple errors, including fake citations, found in a compliance framework report. The errors were acknowledged after the firm admitted to using GPT-4o in August.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "De Beers Unveils Major \"Desert Diamonds\" Campaign After a Decade",
    "domain": "business",
    "source_domain": "www.forbes.com",
    "location": "global",
    "published": "Mon, 06 Oct 2025 14:54:36 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes"
    ],
    "domains": [
      "www.forbes.com"
    ],
    "snippets": [
      "The London-based gemstone mining, distribution, and retail company is responding to consumer insights to promote its neutral range of colored diamonds.",
      "De Beers launched its largest diamond campaign in a decade to promote \"Desert Diamonds,\" natural colored stones, emphasizing rarity, uniqueness and connection to nature."
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/68e40723d9699abdac24e882/0x0.jpg?width=960",
    "titles": [
      "De Beers Launches Desert Diamonds Campaign With Splashy New York Event",
      "De Beers Unveils ‘Desert Diamonds’ In Major Campaign For Natural Over Lab-Grown Diamonds"
    ],
    "score_components": {
      "magnitude": 0.393,
      "recency": 0.895,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.454,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "De Beers, a London-based gemstone company, has launched its biggest diamond campaign in ten years, focusing on \"Desert Diamonds.\" These natural colored diamonds are marketed for their rarity, uniqueness, and natural origin, responding to consumer demand for neutral-colored gemstones.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]