[
  {
    "title": "Netanyahu Optimistic on Hostage Release by Oct. 13 Amid Gaza Ceasefire Talks",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sat, 04 Oct 2025 15:14:11 -0400",
    "source": "NPR",
    "sources": [
      "Al Jazeera",
      "Forbes",
      "Financial Times",
      "NPR",
      "New York Times",
      "BBC"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.ft.com",
      "www.bbc.com",
      "www.npr.org",
      "www.nytimes.com",
      "www.forbes.com"
    ],
    "snippets": [
      "Israeli Prime Minister Benjamin Netanyahu said on Saturday that he hopes Hamas will have returned all remaining hostages by Oct. 13.",
      "Hamas agreed to release the hostages and to the idea of handing over governing Gaza to Palestinian technocrats, but did not give a clear response to many other elements.",
      "Hamas accepted parts of US President Trump’s 20-point Gaza ceasefire plan but wants more talks on several key points.",
      "Israel and Hamas said they would work with President Trump’s plan to end the war, but a number of sticking points could derail efforts to reach a diplomatic breakthrough.",
      "Hamas said it would release all Israeli hostages but wants to negotiate elements of President Trump’s peace plan for Gaza. Adam Rasgon, a reporter for The New York Times in Jerusalem, explains where negotiations stand.",
      "US president warns militant group that it has limited time to seal a deal to end the conflict",
      "Israel and Hamas announced they’ve agreed to parts of Trump’s plan to end the war."
    ],
    "image_url": "",
    "titles": [
      "Trump urges Hamas to 'move quickly' on Gaza peace plan",
      "Shock in Gaza as Trump appears to welcome Hamas response to US peace plan",
      "What we know about Hamas’ response to Trump’s Gaza peace plan",
      "Trump’s Gaza Peace Plan: What to Know",
      "Hamas Partially Accepts Trump’s Peace Plan",
      "Trump tells Hamas to ‘move quickly’ on hostage deal",
      "Trump Warns Hamas ‘Must Move Quickly’ To Release Hostages As Part Of His Peace Plan"
    ],
    "score_components": {
      "magnitude": 0.986,
      "recency": 0.83,
      "consensus": 1.0,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.846,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Israeli Prime Minister Netanyahu expressed hope for the release of all hostages by Hamas by Oct. 13, following partial agreement to President Trump's 20-point Gaza ceasefire plan. While Hamas has agreed to release hostages and discuss governing Gaza with Palestinian technocrats, negotiations on several aspects of the plan remain. Both Israel and Hamas have shown willingness to work towards ending the conflict, but unresolved issues could impede a diplomatic breakthrough. The US President has cautioned Hamas about the limited time available to finalize the deal.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "ANO Party Wins Czech Elections; Babiš Eyes Policy Shift on Ukraine",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sat, 04 Oct 2025 13:42:19 -0400",
    "source": "NPR",
    "sources": [
      "Al Jazeera",
      "Financial Times",
      "Financial Post",
      "NPR",
      "The Guardian",
      "New York Times"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.ft.com",
      "financialpost.com",
      "www.theguardian.com",
      "www.npr.org",
      "www.nytimes.com"
    ],
    "snippets": [
      "His political comeback put the country on a course away from supporting Ukraine and toward Hungary and Slovakia, which have taken a pro-Russian path.",
      "With most votes tallied, Babis’s ANO party is ahead, but it appears set to fall short of a majority in parliament.",
      "Return of ANO government risks complicating western support for Ukraine",
      "<p>With Babiš’s victory the Czech Republic looks set to join Hungary and Slovakia in refusing support for Ukraine</p><p>The populist billionaire Andrej Babiš has won the Czech Republic parliamentary elections, preliminary results show, but fallen short of the overall majority.</p><p>This win marks a",
      "The party of Andrej Babis, a billionaire and a skeptic of military support to Ukraine, prevailed in parliamentary elections by focusing on the economy.",
      "Czech billionaire Andrej Babis was on track to return to power after securing a decisive victory in a parliamentary election, pledging to undo four years of austerity and curb military aid to Ukraine."
    ],
    "image_url": "",
    "titles": [
      "Populist billionaire Andrej Babiš wins Czech parliamentary election",
      "Populist billionaire Andrej Babis’s party set to win Czech election",
      "Eurosceptic Babiš on course to win power in Czech election",
      "Populist billionaire Andrej Babiš wins Czech parliamentary election",
      "Andrej Babis Likely to Return as Czech Prime Minister After Parliamentary Win",
      "Czech Billionaire Set to Return to Power After Election Win"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.804,
      "consensus": 1.0,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.846,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Andrej Babiš's ANO party won the Czech Republic parliamentary elections, according to preliminary results. Despite the victory, ANO did not achieve an overall majority. Babiš's win signals a shift in the Czech Republic's foreign policy, aligning closer with Hungary and Slovakia's stance of limiting support for Ukraine. This marks a significant political comeback for the billionaire, who aims to reverse austerity measures and reduce military aid to Ukraine.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Administration Deploys 300 National Guard to Illinois After Dispute",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 05 Oct 2025 02:14:30 GMT",
    "source": "BBC",
    "sources": [
      "Al Jazeera",
      "Fortune",
      "Deutsche Welle",
      "Axios",
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.aljazeera.com",
      "fortune.com",
      "www.bbc.com",
      "news.google.com",
      "www.theguardian.com",
      "www.dw.com"
    ],
    "snippets": [
      "The controversial move follows protests over ramped-up immigration enforcement and the shooting of a woman during unrest on Saturday.",
      "Trump deploys 300 National Guard troops to Chicago amid protests and criticism from local leaders.",
      "Trump is deploying 300 troops to Chicago as part of his immigration and crime crackdown. But a similar order for Portland has been temporarily blocked.",
      "<p>Illinois governor JB Pritzker says administration is escalating ‘aggression against Illinois citizens and residents’</p><p>Donald Trump has moved to deploy the national guard in another city by authorizing 300 troops to protect federal officers and assets in Chicago, where the government said bor",
      "<a href=\"https://news.google.com/rss/articles/CBMifkFVX3lxTE5vVXdjLTR4TDhmQlpXaWJXWk9JR3dGRElKLUloTDdFVTZmdGlfNDJuQzA1UktmdzA5LVFHVmxzYkwxSXRDN3lQVF8zWTliSFZVTlAwWnR4N0lYcEIyT1ZOWEZPSVFpQ0ZHMjQyMElFSGJOYlJlZEVOLURjVXFDQQ?oc=5\" target=\"_blank\">Trump calls up 300 National Guard members after feud with",
      "“This morning, the Trump Administration’s Department of War gave me an ultimatum: call up your troops, or we will,” Pritzker said in a statement."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/c0dd/live/4ac49720-a187-11f0-b1c5-b56e9bf8a857.jpg",
    "titles": [
      "Trump authorises deployment of 300 National Guard troops to Chicago",
      "Trump authorises National Guard deployment to Chicago despite objections",
      "US: Trump plans to deploy National Guard to Chicago",
      "Trump authorizes national guard deployment to Chicago, White House says, as border patrol there shoots woman",
      "Trump calls up 300 National Guard members after feud with Illinois governor - Axios",
      "Trump to federalize 300 members of the Illinois National Guard ahead of expected deployment to Democratic state"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.941,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.838,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "After a dispute, the Trump Administration authorized 300 National Guard members to be deployed. This decision followed an ultimatum to Illinois Governor Pritzker from the Department of War, stating he must call up troops or the federal government would intervene.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Kirk Powers Blue Jays to 10-1 Win Over Yankees in ALDS Opener",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sun, 05 Oct 2025 02:27:17 +0000",
    "source": "CBS Sports",
    "sources": [
      "Sports Illustrated",
      "CBS Sports",
      "Sportsnet",
      "Global News",
      "CityNews"
    ],
    "domains": [
      "globalnews.ca",
      "www.cbssports.com",
      "news.google.com",
      "www.sportsnet.ca",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "New York and Toronto will continue their best-of-five series on Sunday",
      "Seattle and Detroit will meet for the first time ever in the postseason",
      "<p>George Kirby takes the mound as he and Cal Raleigh host the Detroit Tigers in Game 1 of their ALDS series. Watch the action on Sportsnet and follow using the MLB Live Tracker. </p>",
      "Vladimir Guerrero Jr. said goodbye to a slump in his opening at-bat Saturday. Alejandro Kirk used his first swing to show that his bat remained as hot as ever.",
      "Alejandro Kirk had his second straight two-homer game to power the Toronto Blue Jays to a 10-1 rout of the New York Yankees in Game 1 of their American League Division Series on Saturday.",
      "<a href=\"https://news.google.com/rss/articles/CBMiigFBVV95cUxQYVpvT0FtNE03Z3lmNmwzdHNYWlVLN3RONndyc29jUjZQUGxlQUFPMzZ2aUlfcm95dWltRUFwMEVNaU9JTFdXUll0dWhHSnh1dEtaZHNSYVdzaFVmTVBNbnFta1B2b0pUSWN6TDhpS1hyNXYtcEhmZDlsQWl6a2JNNHZnLUZqeERJVWc?oc=5\" target=\"_blank\">Blue Jays Make Decision on Bo Bichette f",
      "<p>Between Vladimir Guerrero Jr. delivering a major moment, erasing a playoff losing streak and forcing the Yankees to burn through five relievers, the Blue Jays nearly checked every box in Saturday&#8217;s win.</p>",
      "<p>The Toronto Blue Jays will have to wait a little longer for Bo Bichette to make his return to the lineup. </p>",
      "The Blue Jays have won 10-1 in Game 1 of the American League Division Series against the New York Yankees. The two teams were playing at Rogers Centre on Saturday for the first game between Toronto and New York in the MLB playoffs. The Yankees and Jays go back to the Rogers Centre in Game [&#8230;]"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/10/05/cb355b41-5518-4b15-b63c-a3c74998baeb/vlad-getty-3.png",
    "titles": [
      "Yankees vs. Blue Jays ALDS schedule, prediction, odds, TV channel as AL East foes face off",
      "Mariners vs. Tigers ALDS schedule, prediction, odds, TV channel with Game 1 set for Saturday",
      "ALDS on Sportsnet: Tigers vs. Mariners, Game 1",
      "Blue Jays open ALDS with blowout win over Yankees",
      "Blue Jays dump Yankees 10-1 in series opener",
      "Blue Jays Make Decision on Bo Bichette for ALDS Matchup vs. Yankees - Sports Illustrated",
      "Blue Jays overpower Yankees to open ALDS with statement win",
      "Blue Jays’ Bo Bichette ruled out of ALDS against Yankees",
      "Blue Jays win 10-1 in Game 1 of ALDS vs. Yankees"
    ],
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.965,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.822,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Alejandro Kirk led the Toronto Blue Jays to a 10-1 victory over the New York Yankees in Game 1 of their American League Division Series with his second consecutive two-homer game. This win marks the Blue Jays' first post-season victory in nine years, highlighted by a strong performance from Vladimir Guerrero Jr. and effective strategy that exhausted the Yankees' bullpen, utilizing five relievers.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Sanae Takaichi Elected LDP Leader, Set to Be Japan's First Female PM",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 04 Oct 2025 22:09:29 GMT",
    "source": "BBC",
    "sources": [
      "Deutsche Welle",
      "BBC",
      "The Guardian",
      "New York Times"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com",
      "www.nytimes.com",
      "www.dw.com"
    ],
    "snippets": [
      "The conservative politician, who sees Margaret Thatcher as an inspiration, is set to be Japan's first female prime minister.",
      "Conservative hard-liner Takaichi is the former internal affairs minister of Japan. She holds hawkish views on China, and has also visited the controversial Yasukuni Shrine, which memorializes Japan's war dead.",
      "<p>Margaret Thatcher admirer beat her more moderate rival to become leader of Liberal Democratic party</p><p>Japan is poised to get its first female prime minister after Sanae Takaichi was elected as leader of the governing Liberal Democratic party (LDP) – a victory that should lead to her being ins",
      "Ms. Takaichi would be Japan’s first female prime minister in a country where women are drastically underrepresented at the highest levels of power."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/6ee2/live/3948ea70-a19e-11f0-92db-77261a15b9d2.jpg",
    "titles": [
      "Who is Japan's 'Iron Lady' Sanae Takaichi?",
      "Sanae Takaichi expected to be Japan's first female PM",
      "Japan poised to get first female PM after Sanae Takaichi wins ruling party leadership",
      "Sanae Takaichi Is Likely to Be Japan’s Next Leader. Who Is She?"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.864,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.769,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Sanae Takaichi, a conservative hard-liner and former Economic Security Minister, has been elected as the new leader of Japan's governing Liberal Democratic Party (LDP), positioning her to become the country's first female prime minister. Takaichi, known for her admiration of Margaret Thatcher and hawkish views on China, won against her more moderate rival, Shinjiro Koizumi, in a second-round party vote. Her leadership arrives amidst challenges such as political instability, an ageing population, rising prices, and regional tensions.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Collier Cancels Meeting with WNBA Commissioner Amid Dispute",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sat, 4 Oct 2025 23:29:42 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "www.cbssports.com",
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "Minnesota Lynx forward Napheesa Collier has canceled her meeting with WNBA commissioner Cathy Engelbert next week, sources told ESPN.",
      "Engelbert claimed there were inaccuracies in Collier's fiery tirade against WNBA leadership",
      "<p>Minnesota forward Napheesa Collier canceled a meeting with WNBA Commissioner Cathy Engelbert expected to take place next week, a person familiar with the situation told The Associated Press on Saturday night.</p>"
    ],
    "image_url": "",
    "titles": [
      "Sources: Collier cancels meeting with Engelbert",
      "Napheesa Collier cancels meeting with WNBA commissioner Cathy Engelbert amid public spat, per report",
      "AP Source: Napheesa Collier cancels meeting with WNBA Commissioner amid tensions"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.986,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.759,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Minnesota Lynx forward Napheesa Collier has canceled a planned meeting with WNBA Commissioner Cathy Engelbert, according to sources. This decision follows Engelbert's claims of inaccuracies in Collier's critical comments about WNBA leadership.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Russell Clinches Pole at Singapore GP, Edges Out Verstappen and Piastri",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sat, 4 Oct 2025 16:58:29 EST",
    "source": "ESPN",
    "sources": [
      "Sky Sports",
      "The Guardian",
      "ESPN"
    ],
    "domains": [
      "www.skysports.com",
      "www.theguardian.com",
      "www.espn.com"
    ],
    "snippets": [
      "George Russell took a surprise pole position for Mercedes at the Singapore Grand Prix ahead of Red Bull's Max Verstappen in second place and championship leader Oscar Piastri in third.",
      "<ul><li><p>Rejuvenated Mercedes driver takes top spot by 0.182sec</p></li><li><p>Norris accused of impeding Dutchman’s flying lap</p></li></ul><p>George Russell is in talks to extend his contract with Mercedes, but could surely do no more to make his case than a magnificent lap on Saturday to claim ",
      "George Russell delivered a virtuoso performance under the lights to claim a stunning pole for Mercedes for the Singapore Grand Prix as second-placed Max Verstappen also outqualified the title-leading McLaren drivers."
    ],
    "image_url": "",
    "titles": [
      "Russell takes surprise Singapore pole over Verstappen",
      "Verstappen points finger at Norris after Russell grabs brilliant pole in Singapore",
      "Russell storms to Singapore pole as Verstappen beats McLarens too"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.861,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.734,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "George Russell of Mercedes secured pole position for the Singapore Grand Prix, outperforming Max Verstappen and both McLaren drivers, including title leader Oscar Piastri who placed third. Russell's impressive lap at the Marina Bay street circuit placed him 0.182 seconds ahead of Verstappen, showcasing a significant performance boost for Mercedes.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UFC 320: Experts Pick Ankalaev vs. Pereira Winner, Betting Tips Highlighted",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sun, 05 Oct 2025 00:00:47 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Yahoo Sports",
      "Sportsnet"
    ],
    "domains": [
      "www.cbssports.com",
      "app",
      "www.sportingnews.com"
    ],
    "snippets": [
      "Check out who the experts at CBS Sports are taking in the light heavyweight title bout in Las Vegas on Saturday",
      "SportsLine's Daniel Vithlani reveals his picks for the UFC 320: Ankalaev vs. Pereira fight card from T-Mobile Arena in Las Vegas on Saturday",
      "All the information you need to watch UFC 320 live in Las Vegas",
      "Will we see new champions crowned at UFC 320? The Sporting News will provide results from the entire UFC 320 fight card.",
      "<p>Alex Pereira aims to regain the title he lost to Magomed Ankalaev at UFC 313. Watch the PPV live on Sportsnet+.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/10/03/39256ac3-63b8-4dd2-b9a0-3147fe4ea509/ankalaev-pereira-2-presser.jpg",
    "titles": [
      "UFC 320 fight predictions -- Magomed Ankalaev vs. Alex Pereira 2: Expert picks for each main card bout",
      "UFC 320 odds, props, predictions, fight card: Ankalaev vs. Pereira picks, best bets by proven MMA insider",
      "UFC 320 fight card, start time for Magomed Ankalaev vs. Alex Pereira 2: Where to watch, live stream online",
      "UFC 320 full card results, schedule for Magomed Ankalaev vs Alex Pereira 2, Merab Dvalishvili vs. Cory Sandhagen",
      "UFC 320 on Sportsnet: Ankalaev vs. Pereira 2"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.917,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.72,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Experts at CBS Sports and SportsLine's Daniel Vithlani have made their picks for the UFC 320: Ankalaev vs. Pereira light heavyweight title fight at T-Mobile Arena in Las Vegas. Additionally, the event presents various betting opportunities for viewers this weekend in Chicago.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Netanyahu Vows Quick Hostage Return, Sends Team to Egypt for Gaza Plan Talks",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 04 Oct 2025 21:38:01 GMT",
    "source": "BBC",
    "sources": [
      "Deutsche Welle",
      "BBC",
      "New York Times"
    ],
    "domains": [
      "www.bbc.com",
      "www.nytimes.com",
      "www.dw.com"
    ],
    "snippets": [
      "Hamas will disarm \"the easy way or the hard way\", Israel's PM says after the group gave its response to a peace plan.",
      "Israeli Prime Minister Netanyahu said he wants to see hostages returned in the coming days. He also said a team has been sent to Egypt \"to finalize technical details\" of Trump's plan for the future of Gaza. Follow DW.",
      "Both sides have reacted positively to a United States proposal for a cease-fire, but many details remain to be ironed out, including whether Hamas will disarm."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/1ec7/live/17f63870-a160-11f0-8480-e139cd7c3f3c.jpg",
    "titles": [
      "Netanyahu says he hopes to announce hostage release in the 'coming days'",
      "Netanyahu hopes Gaza hostages return home in coming days",
      "Netanyahu Says Israel and Hamas Are on the Brink of a Hostage Deal"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.855,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.718,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Israeli Prime Minister Netanyahu announced intentions to secure the return of hostages within days and has dispatched a team to Egypt to conclude technical aspects of Trump's Gaza plan. The hostages' families express cautious optimism, urging the government to seize this chance for resolution.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Fatal Attack at Manchester Synagogue; Japan Nears Historic Election",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 04 Oct 2025 21:21:06 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "NHL",
      "New York Times"
    ],
    "domains": [
      "www.bbc.com",
      "www.nytimes.com",
      "news.google.com"
    ],
    "snippets": [
      "Two Jewish people were killed in a car and stabbing attack at Heaton Park Hebrew Congregation Synagogue in Manchester on the holiest day in the Jewish religious calendar.",
      "Japan’s beleaguered governing party will convene for a crucial election that could pave the way for the first female prime minister or the youngest leader in 140 years.",
      "<a href=\"https://news.google.com/rss/articles/CBMigAFBVV95cUxOb2U1VVVzWWcyS0tYUktnRlhRRHNSQkNrTUhMSU1CMERCQXAwa3RHM0t4bzhOUzM4WTZVLWVaczR2bmczX1JaanhUS01WSlVLV1lQT0x3elBzTWFwRmlvZ0ZONnFGTUU2WjgzY19neDk4QzRoamxkbWc4azJGWkNnTg?oc=5\" target=\"_blank\">OTT@MTL: What you need to know</a>&nbsp;&nbsp;<font c"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/e75f/live/9e76f8a0-a109-11f0-b741-177e3e2c2fc7.jpg",
    "titles": [
      "What we know about the attack",
      "What to Know About Japan’s Leadership Election",
      "OTT@MTL: What you need to know - NHL.com"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.85,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.707,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Two individuals were killed in an attack involving a car and stabbing at Heaton Park Hebrew Congregation Synagogue in Manchester on the most sacred day of the Jewish calendar. Meanwhile, Japan's governing party faces a significant election that could result in either the first female prime minister or the youngest leader in over a century.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Police Use Force on Protesters at Georgian Presidential Palace",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sat, 04 Oct 2025 19:34:47 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Deutsche Welle",
      "Al Jazeera",
      "Financial Post"
    ],
    "domains": [
      "financialpost.com",
      "www.aljazeera.com",
      "www.dw.com"
    ],
    "snippets": [
      "Opposition protests turned violent as riot police used tear gas and water cannon after disputed local elections.",
      "Demonstrators were trying to enter the presidential palace in Tbilisi. A former president had called on Georgians to protest for what he called the \"last chance\" to save the country.",
      "TBILISI, Georgia (AP) &#8212; Police in Georgia used water cannons and pepper spray on Saturday to push back protesters who tried to storm the presidential palace, as the South Caucasus country held a municipal election boycotted by the main opposition blocs amid a sweeping crackdown on dissent. Ten"
    ],
    "image_url": "",
    "titles": [
      "Police fire water cannon at Georgia protesters near presidential palace",
      "Georgia: Police fire tear gas at anti-government protesters",
      "Georgia’s police use water cannons to push back protesters trying to storm presidential palace"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.836,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.704,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "In Tbilisi, Georgia, police deployed water cannons and pepper spray to repel protesters attempting to storm the presidential palace following a municipal election. The demonstrations, which turned violent, were part of opposition protests against the election results, viewed as the \"last chance\" to save the country according to a former president. The main opposition blocs had boycotted the election, citing a crackdown on dissent.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Eventful Saturday for B.C. Lions and Nathan Rourke",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sun, 05 Oct 2025 03:40:39 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "globalnews.ca"
    ],
    "snippets": [
      "Things got way more exciting for the B.C. Lions on Saturday than Nathan Rourke wanted them to be.",
      "<p>Things got way more exciting for the B.C. Lions on Saturday than Nathan Rourke wanted them to be.</p>"
    ],
    "image_url": "",
    "titles": [
      "Lions clinch playoff berth with win over Stamps",
      "Surging Lions clinch playoff berth with win over Stampeders"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.99,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.703,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "B.C. Lions experienced an eventful Saturday, with Nathan Rourke facing unexpected excitement. The team's situation intensified, but specific details or outcomes are not provided in the sources.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Arsenal's Ødegaard, West Ham's Rice Injured in 2-0 Game",
    "domain": "sports",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Sat, 04 Oct 2025 17:37:23 GMT",
    "source": "The Guardian",
    "sources": [
      "Sports Illustrated",
      "Sky Sports",
      "The Guardian"
    ],
    "domains": [
      "www.skysports.com",
      "www.theguardian.com",
      "news.google.com"
    ],
    "snippets": [
      "<ul><li><p>Declan Rice also taken off in 2-0 win with back problem</p></li><li><p>Mikel Arteta: ‘Let’s wait, hopefully it’s not that bad’</p></li></ul><p>Mikel Arteta is concerned about Martin Ødegaard’s knee injury after the captain limped out of Arsenal’s<a href=\"https://www.theguardian.com/footba",
      "<a href=\"https://news.google.com/rss/articles/CBMihAFBVV95cUxNMUdTQlVndFFCOWs4XzN4TjlNVlZkWjU2cDFPZHVzeXpyaFBNOFNOT0JzUk8yYmhHMk5tOEFxY0JKczlRWHQ4LVFieXh0XzRlcmNraXVrNTVYVUFVUk01M0pwQmI5VGYxY0dsTTFqRzA0YWpEMzdOMURuRzNMN1dpWjYtcUU?oc=5\" target=\"_blank\">Arsenal Rocked by Fresh Martin Odegaard Injury A",
      "FREE TO WATCH: Highlights from Arsenal&#8217;s match against West Ham in the Premier League."
    ],
    "image_url": "https://i.guim.co.uk/img/media/46c8b60b7257595746c0a395bdb4661905bdfaf6/256_0_2688_2150/master/2688.jpg?width=140&quality=85&auto=format&fit=max&s=db90c7517d7b4288e29795e30465b75e",
    "titles": [
      "Martin Ødegaard injury takes shine off Arsenal’s victory over West Ham",
      "Arsenal Rocked by Fresh Martin Odegaard Injury Against West Ham - Sports Illustrated",
      "Arsenal dominate West Ham to go top!"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.786,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.694,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Arsenal's captain, Martin Ødegaard, suffered a knee injury during their 2-0 victory over West Ham, prompting concern from manager Mikel Arteta about its severity. Declan Rice also exited the game with a back issue. Arteta expressed hope that the injuries would not be significant.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Mitchell Leads Tiger-Cats to Victory, Argonauts Out of Playoffs",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sat, 04 Oct 2025 23:41:27 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "globalnews.ca"
    ],
    "snippets": [
      "Bo Levi Mitchell and the Hamilton Tiger-Cats moved closer to cementing first in the East Division while ending the Toronto Argonauts' playoff hopes.",
      "<p>Bo Levi Mitchell threw four touchdown passes as the Hamilton Tiger-Cats defeated the Toronto Argonauts 47-29 on Saturday afternoon, eliminating the defending Grey Cup champions from playoff contention.</p>"
    ],
    "image_url": "",
    "titles": [
      "Ticats end Argos playoff hopes with 47-29 win",
      "Tiger-Cats strengthen East lead with win, end Argonauts’ playoff hopes"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.911,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.687,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Bo Levi Mitchell led the Hamilton Tiger-Cats to a 47-29 victory over the Toronto Argonauts, throwing four touchdown passes. This win moved the Tiger-Cats closer to securing first place in the East Division and eliminated the Argonauts, the defending Grey Cup champions, from playoff contention.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Judge Blocks Trump's Order to Deploy National Guard in Portland",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sat, 04 Oct 2025 20:15:30 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "ABC News"
    ],
    "domains": [
      "www.npr.org",
      "abcnews.go.com"
    ],
    "snippets": [
      "A federal judge has temporarily blocked the Trump administration from deploying the National Guard to Portland, Ore., which the president had ordered over the objections of local leaders.",
      "A federal judge has temporarily blocked President Donald Trump’s attempt to federalize and deploy the Oregon National Guard to Portland."
    ],
    "image_url": "",
    "titles": [
      "Federal judge temporarily blocks Trump's National Guard deployment to Portland",
      "Judge temporarily blocks Trump's attempt to deploy Oregon National Guard to Portland"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.922,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.671,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A federal judge has temporarily halted President Trump's order to deploy the National Guard to Portland, Oregon, against local leaders' wishes. This decision stops the federalization and deployment of the Oregon National Guard to address unrest in Portland.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Canada Post Workers' Union Slams Latest Contract Offers",
    "domain": "business",
    "source_domain": "financialpost.com",
    "location": "national",
    "published": "Sat, 04 Oct 2025 18:05:36 +0000",
    "source": "Financial Post",
    "sources": [
      "CityNews",
      "Financial Post"
    ],
    "domains": [
      "financialpost.com",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "The union representing Canada Post workers says the Crown corporation is &#8220;making a mockery of the collective bargaining process&#8221; with its latest contract offers. In a statement released Friday, the union said it is disappointed with the latest offer, which it calls a &#8220;major step ba",
      "The union representing Canada Post workers says the Crown corporation is &#8220;making a mockery of the collective bargaining process&#8221; with its latest contract offers. In a statement released Friday, the union said it is disappointed with the latest offer, which it calls a &#8220;major step ba"
    ],
    "image_url": "",
    "titles": [
      "Canada Post union says latest contract offer is a ‘major step backwards’",
      "Canada Post union says latest contract offer is a ‘major step backwards’"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.811,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.667,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The union for Canada Post workers criticized the corporation's latest contract offers as a \"mockery of the collective bargaining process\" and a \"major step back.\" They expressed disappointment in a statement released Friday.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "U.S. Treasury Considers New $1 Coin with Trump for 250th Anniversary",
    "domain": "general",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Sat, 04 Oct 2025 22:20:01 -0400",
    "source": "ABC News",
    "sources": [
      "ABC News",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "abcnews.go.com"
    ],
    "snippets": [
      "The U.S. treasurer said on Friday that Treasury is considering minting new one-dollar coins for the nation's 250th anniversary featuring President Trump's image.",
      "<p>US treasurer says officials looking at drafts for country’s 250th anniversary featuring president with raised fist</p><p>To commemorate the 250th anniversary of the US’s independence, the treasury department is mulling production of a $1 coin displaying <a href=\"https://www.theguardian.com/us-new"
    ],
    "image_url": "https://s.abcnews.com/images/US/donald-trump-33-rt-gmh-250930_1759256171129_hpMain_4x3t_384.jpg",
    "titles": [
      "Trump administration considers minting a $1 Trump coin",
      "US treasury considers special $1 Trump coin reading ‘fight, fight, fight’"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.963,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.655,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The U.S. Treasury is exploring the creation of a new one-dollar coin to celebrate the country's 250th anniversary, featuring an image of President Trump with a raised fist. This consideration was confirmed by the U.S. Treasurer on Friday.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Ohtani Makes History in Game 1 as Dodgers Secure NLDS Victory",
    "domain": "business",
    "source_domain": "www.sportingnews.com",
    "location": "national",
    "published": "Sun, 05 Oct 2025 03:35:07 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports",
      "Forbes"
    ],
    "domains": [
      "www.forbes.com",
      "www.sportingnews.com"
    ],
    "snippets": [
      "This is a slice of Japanese baseball history.",
      "Shohei Ohtani didn't have his best game in Game 1 of the NLDS. But he did something historic, and the Los Angeles Dodgers won. That was always the plan."
    ],
    "image_url": "",
    "titles": [
      "Dodgers' Shohei Ohtani, Roki Sasaki make MLB history for 1st time ever in playoff win",
      "Shohei Ohtani Makes History For Los Angeles Dodgers: ‘That’s Who I Am’"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.988,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.653,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Shohei Ohtani made history in Game 1 of the NLDS despite not performing at his best. The Los Angeles Dodgers, his team, secured a victory in the game, aligning with their strategy.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Israel Halts Gaza Strikes After Trump Request, Turkey to Repatriate Citizens",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sat, 04 Oct 2025 21:39:35 +0000",
    "source": "Al Jazeera",
    "sources": [
      "The Guardian",
      "Al Jazeera"
    ],
    "domains": [
      "www.theguardian.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Donald Trump urges Hamas to move quickly to release captives and finalise negotiations over his plan to end the war.",
      "<p>This blog is now closed, you can <a href=\"https://www.theguardian.com/world/2025/oct/04/israel-orders-military-to-halt-campaign-on-gaza-city-amid-ongoing-strikes\">read more on this story here</a></p><p></p><p><strong>Turkey</strong> said 36 of its citizens were expected to return home via a speci"
    ],
    "image_url": "",
    "titles": [
      "Israel pounds Gaza, killing 70, despite Trump’s call for it to halt bombing",
      "Airstrikes reported in Gaza despite Trump’s call for Israel to stop bombing ‘immediately’ – as it happened"
    ],
    "score_components": {
      "magnitude": 0.795,
      "recency": 0.873,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.651,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Israel ceased its military strikes in Gaza following a request from Trump, as reported. Additionally, Turkey is preparing for the return of 36 of its citizens through a special arrangement. The current status of the conflict and the specifics of the arrangement for the Turkish citizens' return were not detailed in the provided content.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Nearly 500 Arrested at London Protest Against Palestine Action Ban",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 04 Oct 2025 21:03:08 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Demonstrations went ahead despite calls from politicians and police leaders for the protests to be postponed in wake of the Manchester synagogue attack.",
      "<p>Officers arrest activists at silent vigil in support of banned organisation, as demos go ahead despite PM’s pleas</p><p>Police have arrested almost 500 people in London at what organisers hoped would be the biggest demonstration so far against a ban on the proscribed organisation Palestine Action"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/6b09/live/9d0674b0-a135-11f0-a9f1-8d9167fcc08f.png",
    "titles": [
      "Nearly 500 arrested at Palestine Action protest in London",
      "Police make almost 500 arrests at Palestine Action protest in London"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.844,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.641,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "In London, nearly 500 people were arrested during a large demonstration against the ban on Palestine Action, despite requests from politicians and police to postpone protests following the Manchester synagogue attack. The arrests occurred at a silent vigil supporting the banned organization, highlighting the tension between public expressions of dissent and law enforcement responses.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Babis Wins Czech Election, Proposes Ukraine Aid Cuts",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-10-04T15:30:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "New York Times"
    ],
    "domains": [
      "www.nytimes.com",
      "www.dw.com"
    ],
    "snippets": [
      "Billionaire Andrej Babis wants to cut aid to Ukraine, and now he is the projected winner of the Czech parliamentary elections. Though he didn't win a majority, Babis said he aims to form a one-party government.",
      "The party of Andrej Babis, former leader of the Czech government, is expected to prevail in parliamentary elections that begin Friday."
    ],
    "image_url": "",
    "titles": [
      "Czech Republic: 'Trumpist' ex-PM Babis wins elections",
      "‘Czech Trump’ Andrej Babis Is Poised to Return as Prime Minister in Elections"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.768,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.623,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Andrej Babis, a billionaire who has proposed cutting aid to Ukraine, is the projected winner of the Czech parliamentary elections, with his party securing 36% of the vote after 90% of districts reported.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Drone Kills Journalist in Ukraine, a First: European Federation",
    "domain": "general",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Sat, 04 Oct 2025 15:43:57 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "New York Times"
    ],
    "domains": [
      "www.theguardian.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "<p>Two trains were hit in Ukraine’s northern Sumy region, killing one and injuring about 30 others, officials say</p><p>Two Russian drones struck trains at a station in Ukraine’s northern Sumy region, killing one person and injuring about 30 others, officials said on Saturday, with Ukraine’s foreign",
      "Antoni Lallican, a Paris-based photographer, is the first working journalist to be killed by a remotely piloted drone during the war, according to press associations."
    ],
    "image_url": "https://i.guim.co.uk/img/media/fa4a46a22559e2126e9fbdd39b86a1bd14282cdd/10_0_867_694/master/867.jpg?width=140&quality=85&auto=format&fit=max&s=aff3c39ed9670e4982145e59c875f7be",
    "titles": [
      "Person killed in drone attack as Ukraine accuses Russia of targeting passenger trains",
      "French Photojournalist Killed in Drone Attack in Ukraine"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.756,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.62,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Antoni Lallican, a Paris-based photographer, became the first journalist to be killed by a drone in the Ukraine conflict, as confirmed by the European Federation of Journalists. This incident marks a tragic milestone in the war, highlighting the dangers journalists face while reporting.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "OpenAI's Sora App Features Copyrighted Characters, Signals IP Strategy Shift",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Sat, 04 Oct 2025 12:00:01 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "CNBC has seen videos of characters from shows like \"SpongeBob SquarePants\" on the platform and was able to independently generate other characters.",
      "OpenAI may be reversing course on how it approaches copyright and intellectual property in its new video app Sora."
    ],
    "image_url": "",
    "titles": [
      "AI Sam Altman and the Sora copyright gamble: 'I hope Nintendo doesn't sue us'",
      "Sam Altman says Sora will add ‘granular,’ opt-in copyright controls"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.699,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.612,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "OpenAI's new video app Sora, as observed by CNBC, features characters from copyrighted shows like \"SpongeBob SquarePants.\" This development suggests that OpenAI might be changing its approach to copyright and intellectual property rights in its applications.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Taylor Swift's \"The Life of a Showgirl\" Sets Records After Friday Release",
    "domain": "business",
    "source_domain": "www.businessinsider.com",
    "location": "global",
    "published": "2025-10-04T19:17:09Z",
    "source": "Business Insider",
    "sources": [
      "Business Insider"
    ],
    "domains": [
      "www.businessinsider.com"
    ],
    "snippets": [
      "Taylor Swift released her 12th studio album, \"The Life of a Showgirl,\" on Friday and its already breaking records.",
      "In this Saturday edition of Business Insider Today, we're talking about Taylor Swift's latest album, \"The Life of a Showgirl.\""
    ],
    "image_url": "https://i.insider.com/68e169401c1f80efbec4f179?format=jpeg",
    "titles": [
      "Taylor Swift is breaking her own records with 'The Life of a Showgirl'",
      "Taylor Swift's 12th album is out. BI breaks down what 'The Life of a Showgirl' is all about."
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.831,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.434,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Taylor Swift released her 12th studio album, \"The Life of a Showgirl,\" on Friday, which is already setting new records. The album's immediate impact was highlighted in the Saturday edition of Business Insider Today.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]