[
  {
    "title": "Former Cubs and Phillies Manager Lee Elia Dies at 87",
    "domain": "sports",
    "location": "national",
    "published": "Thu, 10 Jul 2025 19:21:33 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet",
      "Yahoo Sports",
      "CBS Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Lee Elia, who managed the Cubs and Phillies in a pro baseball career that lasted more than 50 years as a coach and player, died Wednesday at the age of 87.",
      "Elia spent several seasons playing for the White Sox and Cubs before transitioning to coaching and managing",
      "Lee Elia, known for managing the Cubs and Phillies during a decades-long career (and for an epic, expletive-filled postgame rant), has died.",
      "<p>Lee Elia, a former major league player and coach who was managing the Chicago Cubs in 1983 when he famously criticized the team&#8217;s fans in a memorable post-game rant, has died. He was 87.</p>"
    ],
    "image_url": "",
    "titles": [
      "Lee Elia, manager of Cubs and Phillies, dies at 87",
      "Lee Elia, former Cubs and Phillies manager known best for profane rant at fans, dies at 87",
      "Lee Elia, former Phillies and Cubs manager known for epic rant, dies at 87",
      "Lee Elia, former major league manager known for profane rant, dies at 87"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.985,
      "consensus": 0.935,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.816,
    "summary": "Lee Elia, a former player and manager for the Cubs and Phillies with over 50 years in professional baseball, passed away at 87. Known for his long career spanning playing, coaching, and managing, Elia notably played for the White Sox and Cubs before moving into management roles. He is also remembered for a famous profanity-filled rant against Cubs fans in 1983.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "While this story provides basic awareness about the death of a notable figure in professional baseball, it doesn't offer much depth or insight beyond that. There's no actionable insight or deeper understanding provided, nor does it report on solutions, improvements, or innovations."
  },
  {
    "title": "Judge Blocks Trump's Attempt to End Birthright Citizenship",
    "domain": "general",
    "location": "global",
    "published": "Thu, 10 Jul 2025 16:46:15 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Deutsche Welle",
      "Axios",
      "Al Jazeera"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "The injunction would bar Trump from denying citizenship to US-born babies based on their parents&#039; immigration status.",
      "A US federal judge has blocked Trump's move to end birthright citizenship for some babies. The New Hampshire ruling makes the case a class action, covering all families at risk nationwide.",
      "<a href=\"https://news.google.com/rss/articles/CBMikgFBVV95cUxQeEJNd1pQelVMaTZ6UFVqN3Nna1NZeEJ4LWlaZ2pZd0N3aWRuWjB2N05WUDZDSTF3YldXSm11blFOaHBQNGVoSWxnanI1d3lNUkIzNWtkTXpsZ2FUMkYyT2JoSnpzdGNoOXpOVHNON2NuRGRwUUJock0xRXpQZzVwbjdxRVBfRWR0NWVuelpJU0dUZw?oc=5\" target=\"_blank\">Trump's birthright citizenshi"
    ],
    "image_url": "",
    "titles": [
      "Judge blocks Trump’s birthright citizenship order in class-action lawsuit",
      "US judge pauses Trump order ending birthright citizenship",
      "Trump's birthright citizenship order blocked by judge despite SCOTUS ruling - Axios"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.859,
      "consensus": 0.847,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.766,
    "summary": "A US federal judge in New Hampshire has issued an injunction blocking former President Trump's attempt to end birthright citizenship for children born in the US to parents with uncertain immigration status. This decision classifies the issue as a class action lawsuit, providing protection to all affected families across the country. The ruling represents a significant development in the ongoing legal battle over birthright citizenship, which has previously reached the Supreme Court.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful information about a significant legal development, which could affect many families across the country. It also increases awareness about the ongoing legal battle over birthright citizenship. However, it doesn't report on solutions or improvements, so it doesn't score the highest."
  },
  {
    "title": "NASA Installs Solar Panels on Roman Space Telescope",
    "domain": "science",
    "location": "global",
    "published": "Thu, 10 Jul 2025 15:44:05 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org",
      "NASA"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "On June 14 and 16, technicians installed solar panels onto NASA's Nancy Grace Roman Space Telescope, one of the final steps in assembling the observatory. Collectively called the Solar Array Sun Shield, these panels will power and shade the observatory, enabling all the mission's observations and he",
      "On June 14 and 16, technicians installed solar panels onto NASA’s Nancy Grace Roman Space Telescope, one of the final steps in assembling the observatory. Collectively called the Solar Array Sun Shield, these panels will power and shade the observatory, enabling all the mission’s observations and he"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/nasas-roman-space-tele.jpg",
    "titles": [
      "Roman Space Telescope team installs observatory's solar panels",
      "NASA’s Roman Space Telescope Team Installs Observatory’s Solar Panels"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.913,
      "consensus": 0.632,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.691,
    "summary": "Technicians installed solar panels on NASA's Nancy Grace Roman Space Telescope on June 14 and 16, marking one of the final steps in the observatory's assembly. Named the Solar Array Sun Shield, these panels are designed to power the telescope and protect it from the sun, ensuring it can perform all planned observations.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it reports on progress and innovation in the field of space exploration. It provides useful information about the assembly process of the Roman Space Telescope and the role of the new solar panels. It also increases awareness about the systems and technologies used in space observatories."
  }
]