[
  {
    "title": "Rwanda responds warmly to Trump request to take noncitizen deportees",
    "domain": "general",
    "location": "global",
    "published": "Wed, 30 Apr 2025 23:58:49 +0000",
    "source": "Washington Post",
    "sources": [
      "Washington Post"
    ],
    "snippets": [
      "The talks coincide with a U.S.-led effort to broker a peace agreement between Rwanda and the neighboring Democratic Republic of Congo."
    ],
    "image_url": "",
    "titles": [
      "Rwanda responds warmly to Trump request to take noncitizen deportees"
    ],
    "summary": "The United States is leading negotiations aimed at brokering a peace agreement between Rwanda and the Democratic Republic of Congo. These talks are part of a concerted effort to resolve tensions and conflicts between the neighboring countries.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "The story provides a deeper understanding of the diplomatic relations between the United States, Rwanda, and the Democratic Republic of Congo. However, it does not offer actionable insights or report on solutions or improvements.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.776,
      "consensus": 0.2,
      "constructiveness": 0.7
    },
    "score": 0.506,
    "normalized_score": 7.67
  },
  {
    "title": "North Korea: First road bridge to Russia 'significant' development",
    "domain": "general",
    "location": "global",
    "published": "Wed, 30 Apr 2025 23:54:17 GMT",
    "source": "BBC",
    "sources": [
      "BBC"
    ],
    "snippets": [
      "The announcement comes after North Korea confirmed for the first time its soldiers are fighting alongside Russia."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/7c18/live/cb6d7260-261d-11f0-bbd1-053cd5f13483.jpg",
    "titles": [
      "North Korea: First road bridge to Russia 'significant' development"
    ],
    "summary": "North Korea has officially confirmed that its soldiers are actively participating in combat alongside Russian forces. This marks the first time North Korea has publicly acknowledged its military involvement with Russia.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story increases awareness about North Korea's military involvement with Russia, which is a significant geopolitical development. However, it does not provide a deep insight into the implications of this involvement or suggest any solutions.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.775,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.488,
    "normalized_score": 5.58
  },
  {
    "title": "Trump officials contacted El Salvador president about Kilmar Ábrego García, sources say",
    "domain": "general",
    "location": "global",
    "published": "Wed, 30 Apr 2025 23:52:49 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "snippets": [
      "<p>Administration in touch with Nayib Bukele over detention of wrongly deported man, according to two people</p><p>The <a href=\"https://www.theguardian.com/us-news/trump-administration\">Trump administration</a> has been in touch directly with the Salvadorian president Nayib Bukele in recent days about the detention of Kilmar Ábrego García, the man wrongly deported to a notorious prison in El Salvador, according to two people familiar with the matter.</p><p>The nature of the discussion and its purpose was not clear because multiple Trump officials have said the administration was <a href=\"https://www.theguardian.com/us-news/2025/apr/18/trump-immigration-court-orders\">not interested in his coming back</a> to the US despite the US supreme court ordering it to “facilitate” Ábrego García’s release.</p> <a href=\"https://www.theguardian.com/us-news/2025/apr/30/trump-kilmar-abrego-garcia-nayib-bukele\">Continue reading...</a>"
    ],
    "image_url": "https://i.guim.co.uk/img/media/0aed08a05f4e9525b9b5cd5a0a7e081287048f6b/0_183_5534_3322/master/5534.jpg?width=140&quality=85&auto=format&fit=max&s=88a416903f2c0bc808f6153c5991242a",
    "titles": [
      "Trump officials contacted El Salvador president about Kilmar Ábrego García, sources say"
    ],
    "summary": "The Trump administration has contacted Salvadorian President Nayib Bukele regarding Kilmar Ábrego García, who was wrongly deported and detained in El Salvador. Despite the US Supreme Court's order to facilitate García's release, the nature and purpose of these discussions remain unclear, as Trump officials have expressed disinterest in his return to the US. The situation involves direct communication between the administration and Bukele, as reported by two individuals familiar with the matter.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "While the story provides basic awareness about the Trump administration's contact with the Salvadorian President regarding Kilmar Ábrego García, it lacks depth and insight. The nature and purpose of the discussions remain unclear, and the story does not provide any solutions or improvements.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.775,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.486,
    "normalized_score": 5.35
  },
  {
    "title": "Julia Parsons, U.S. Navy Code Breaker During World War II, Dies at 104",
    "domain": "general",
    "location": "global",
    "published": "Wed, 30 Apr 2025 23:30:54 +0000",
    "source": "New York Times",
    "sources": [
      "New York Times"
    ],
    "snippets": [
      "Soon after her officer training in Washington, she was recruited to a classified code-breaking team. She kept her work secret for decades, even from her family."
    ],
    "image_url": "",
    "titles": [
      "Julia Parsons, U.S. Navy Code Breaker During World War II, Dies at 104"
    ],
    "summary": "After completing officer training in Washington, a woman was recruited into a classified code-breaking team. She maintained secrecy about her involvement with this team for decades, not disclosing details of her work even to her family members.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful historical context about a woman's contribution to World War II, which adds depth to the reader's understanding. However, it does not provide actionable insights or report on solutions or improvements.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.77,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.487,
    "normalized_score": 5.47
  },
  {
    "title": "Trump pick to lead CBP accused of 'cover-up' over death of man at California border",
    "domain": "general",
    "location": "national",
    "published": "Wed, 30 Apr 2025 23:00:05 GMT",
    "source": "LA Times",
    "sources": [
      "LA Times"
    ],
    "snippets": [
      "<p>Senators question Rodney Scott, who formerly led the U.S. Border Patrol and is now the nominee to lead its parent agency, about the brutal 2010 beating of a migrant by agents.</p>"
    ],
    "image_url": "",
    "titles": [
      "Trump pick to lead CBP accused of 'cover-up' over death of man at California border"
    ],
    "summary": "During a Senate hearing, former U.S. Border Patrol leader Rodney Scott, nominated to head its parent agency, faced inquiries about a 2010 incident where agents were involved in the brutal beating of a migrant. The questioning aimed to scrutinize Scott's leadership and his stance on agent conduct.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story informs the reader about a significant event and the conduct of a nominated leader, providing useful context. It increases awareness about accountability in leadership, but does not highlight progress or solutions.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.763,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.512,
    "normalized_score": 8.37
  },
  {
    "title": "Transfer rumors, news: Leverkusen want Wirtz to Man City, Real Madrid over Bayern",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 30 Apr 2025 21:36:01 EST",
    "source": "ESPN",
    "sources": [
      "ESPN"
    ],
    "snippets": [
      "Bayer Leverkusen are desperate for Florian Wirtz to move to Manchester City or Real Madrid over Bayern. Transfer Talk has the latest news, gossip and rumors."
    ],
    "image_url": "",
    "titles": [
      "Transfer rumors, news: Leverkusen want Wirtz to Man City, Real Madrid over Bayern"
    ],
    "summary": "Bayer Leverkusen prefers Florian Wirtz to transfer to either Manchester City or Real Madrid instead of Bayern Munich, according to Transfer Talk reports. This preference highlights Leverkusen's strategic considerations in the transfer market.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story offers basic awareness about the strategic considerations of a football club in the transfer market. However, it lacks depth and insight, and does not provide actionable insights or report on solutions or improvements.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.743,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.449,
    "normalized_score": 1.05
  },
  {
    "title": "Wilkin: Video referee 'sucks atmosphere out of the stadium'",
    "domain": "sports",
    "location": "global",
    "published": "Wed, 30 Apr 2025 17:01:00 BST",
    "source": "Sky Sports",
    "sources": [
      "Sky Sports"
    ],
    "snippets": [
      "With some Super League&#160;games surpassing the two-hour mark due to delays from the video referee, Jon Wilkin has demanded changes."
    ],
    "image_url": "https://e2.365dm.com/25/04/1920x1080/skysports-jon-wilkin-rugby-league_6901999.jpg?20250430180053",
    "titles": [
      "Wilkin: Video referee 'sucks atmosphere out of the stadium'"
    ],
    "summary": "Jon Wilkin has called for modifications to the Super League's use of the video referee system after observing that some games are extending beyond two hours because of delays caused by video review decisions.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides some insight into the impact of video refereeing on the game's duration and atmosphere. However, it doesn't offer any solutions or improvements to the issue, limiting its constructiveness.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.68,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.44,
    "normalized_score": 0.0
  },
  {
    "title": "Lakers' early playoff exit a blow to betting public",
    "domain": "sports",
    "location": "national",
    "published": "Thu, 1 May 2025 11:55:59 EST",
    "source": "ESPN",
    "sources": [
      "ESPN"
    ],
    "snippets": [
      "Entering the playoffs, more money had been wagered on the Lakers to win the Finals than on any other team at multiple sportsbooks. That money will be staying with the house."
    ],
    "image_url": "",
    "titles": [
      "Lakers' early playoff exit a blow to betting public"
    ],
    "summary": "The Los Angeles Lakers were the top team bet on to win the Finals across various sportsbooks. However, they did not win, resulting in the wagered money remaining with the sportsbooks instead of being paid out to bettors.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "The story offers basic awareness about the impact of the Lakers' early playoff exit on the betting public, but it doesn't provide deeper understanding or actionable insights. It also lacks a focus on solutions or progress.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.942,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.488,
    "normalized_score": 5.58
  },
  {
    "title": "Garcia, Haney, Lopez make weight for NYC card",
    "domain": "sports",
    "location": "national",
    "published": "Thu, 1 May 2025 11:55:59 EST",
    "source": "ESPN",
    "sources": [
      "ESPN"
    ],
    "snippets": [
      "All six fighters on Friday's highly anticipated boxing card in Times Square made weight on Thursday, including featured fighters Devin Haney, WBO junior welterweight champion Teofimo Lopez and Ryan Garcia."
    ],
    "image_url": "",
    "titles": [
      "Garcia, Haney, Lopez make weight for NYC card"
    ],
    "summary": "All six boxers scheduled for Friday's event in Times Square, including notable fighters Devin Haney, WBO junior welterweight champion Teofimo Lopez, and Ryan Garcia, successfully made weight on Thursday, ensuring their matches will proceed as planned.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides an update on a relevant event, but it doesn't contribute significantly to the reader's understanding beyond informing them that the boxers made weight. It lacks depth and doesn't highlight any progress, solutions, or empowering knowledge.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.942,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.508,
    "normalized_score": 7.91
  },
  {
    "title": "Dubs irked as Rockets take aim at Curry's thumb",
    "domain": "sports",
    "location": "national",
    "published": "Thu, 1 May 2025 11:55:59 EST",
    "source": "ESPN",
    "sources": [
      "ESPN"
    ],
    "snippets": [
      "Warriors coach Steve Kerr said Rockets defenders are trying to \"outsmart the rules\" by hitting Stephen Curry's hand after he releases his shot and said it's something he hopes the league addresses after the season."
    ],
    "image_url": "",
    "titles": [
      "Dubs irked as Rockets take aim at Curry's thumb"
    ],
    "summary": "Warriors coach Steve Kerr criticized Rockets defenders for hitting Stephen Curry's hand post-shot, a tactic he views as an attempt to circumvent basketball rules. Kerr has expressed a desire for the NBA to address this issue after the season, highlighting concerns over fair play and player safety.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information on the tactics used in basketball games and the potential risks to player safety. However, it does not report on any solutions or improvements, nor does it provide a deep understanding of the system or causes.",
    "score_components": {
      "magnitude": 0.359,
      "recency": 0.942,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.526,
    "normalized_score": 10.0
  },
  {
    "title": "Meta shares rise on stronger-than-expected revenue for first quarter",
    "domain": "business",
    "location": "national",
    "published": "Wed, 30 Apr 2025 22:16:13 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "snippets": [
      "Meta rose as much as 5% after the company reported stronger-than-expected revenue in the first quarter."
    ],
    "image_url": "",
    "titles": [
      "Meta shares rise on stronger-than-expected revenue for first quarter"
    ],
    "summary": "Meta's stock increased by up to 5% following the announcement of their first-quarter revenue, which exceeded analysts' expectations.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "The story offers basic awareness of Meta's financial performance but does not provide any actionable insights, deeper understanding, or context. It doesn't discuss the reasons behind the rise in shares or the implications for the company or the industry.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.752,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.451,
    "normalized_score": 1.28
  },
  {
    "title": "Trump calls China the 'chief-ripper-offer' on trade, with no sign of direct talks",
    "domain": "business",
    "location": "national",
    "published": "Wed, 30 Apr 2025 21:46:43 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "snippets": [
      "Trump also appeared to be unmoved by the idea that American consumers will face empty store shelves if his trade war drags on."
    ],
    "image_url": "",
    "titles": [
      "Trump calls China the 'chief-ripper-offer' on trade, with no sign of direct talks"
    ],
    "summary": "Former President Donald Trump showed indifference to concerns that the ongoing trade war could result in empty store shelves for American consumers. Despite warnings, he appeared to be unmoved by the potential impact on shopping and availability of goods in the U.S.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story provides some awareness of the ongoing trade war and its potential impact on American consumers. However, it lacks depth and insight into the causes, systems, and potential solutions to the problem.",
    "score_components": {
      "magnitude": 0.429,
      "recency": 0.746,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.485,
    "normalized_score": 5.23
  },
  {
    "title": "Amazon to spend $4 billion on small town delivery expansion",
    "domain": "business",
    "location": "national",
    "published": "Wed, 30 Apr 2025 21:17:57 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "snippets": [
      "Amazon announced it will spend $4 billion by the end of 2026 on expanding deliveries to small towns in rural America."
    ],
    "image_url": "",
    "titles": [
      "Amazon to spend $4 billion on small town delivery expansion"
    ],
    "summary": "Amazon has committed to investing $4 billion by the end of 2026 to enhance its delivery services in rural areas across America. This expansion aims to improve access to Amazon's delivery services for small towns throughout the country.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it reports on a significant investment by Amazon to improve its infrastructure and services, which could have a positive impact on small towns and rural areas. It provides useful information about Amazon's plans and the potential benefits for these communities.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.739,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.507,
    "normalized_score": 7.79
  },
  {
    "title": "Elon Musk bids farewell — sort of — to Trump Cabinet, claims DOGE saved $160 billion",
    "domain": "business",
    "location": "national",
    "published": "Wed, 30 Apr 2025 18:05:24 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "snippets": [
      "The Telsa CEO told Trump, \"Well, they like to burn my cars,\" when the president said Musk had \"sacrificed a lot\" to work on DOGE."
    ],
    "image_url": "",
    "titles": [
      "Elon Musk bids farewell — sort of — to Trump Cabinet, claims DOGE saved $160 billion"
    ],
    "summary": "The Tesla CEO, in a conversation with the president, responded to a statement about his sacrifices for working on DOGE by saying, \"Well, they like to burn my cars.\" This exchange highlights the CEO's acknowledgment of the challenges he faces, specifically referencing incidents where his cars have been targeted.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about Elon Musk's interaction with the president and his comments about challenges he faces. However, it lacks depth and does not provide actionable insights or a deeper understanding of the situation.",
    "score_components": {
      "magnitude": 0.429,
      "recency": 0.694,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.47,
    "normalized_score": 3.49
  },
  {
    "title": "RFK Jr. is gutting minority health offices across HHS that are key to reducing health disparities",
    "domain": "business",
    "location": "national",
    "published": "Wed, 30 Apr 2025 17:37:09 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "snippets": [
      "The cuts have hit most of the eight minority health offices across HHS, in many cases laying off the majority of workers, if not all of them, sources said."
    ],
    "image_url": "",
    "titles": [
      "RFK Jr. is gutting minority health offices across HHS that are key to reducing health disparities"
    ],
    "summary": "The majority of workers in most of the eight minority health offices within the Department of Health and Human Services (HHS) have been laid off, with some offices losing all employees, according to sources.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it raises awareness about the potential impact of layoffs in minority health offices within the HHS. It provides useful information about the current situation and its potential implications, even though the topic is negative.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.688,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.482,
    "normalized_score": 4.88
  },
  {
    "title": "Cracking the Code for Tastier Apples: New Genome Study Reveals Secrets",
    "domain": "science",
    "location": "global",
    "published": "Wed, 30 Apr 2025 23:52:52 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/cracking-the-code-for-tastier-apples-new-genome-study-reveals-secrets/\" rel=\"nofollow\" title=\"Cracking the Code for Tastier Apples: New Genome Study Reveals Secrets\"><img alt=\"Apple DNA\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Apple-DNA-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>New genomic analysis findings could help inform breeding efforts for apples that are tastier and more resilient. A comprehensive new study comparing the genomes of species within the Malus genus, including the domesticated apple and its wild relatives, has uncovered how these species are related and how their genomes have evolved over nearly 60 million [...]"
    ],
    "image_url": "",
    "titles": [
      "Cracking the Code for Tastier Apples: New Genome Study Reveals Secrets"
    ],
    "summary": "A new genomic study on the Malus genus, which includes domesticated apples and their wild relatives, has identified key evolutionary developments over nearly 60 million years. This research could aid in breeding apples that are both tastier and more resilient by understanding the genetic relationships and changes within these species.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive as it provides readers with a deeper understanding of the evolution of apples and their genetic relationships. It also reports on a solution to improve the taste and resilience of apples, which could be useful for apple growers and consumers alike.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.775,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.518,
    "normalized_score": 9.07
  },
  {
    "title": "Keto Diet Reveals a New Way To Starve Deadly Cancer Cells",
    "domain": "science",
    "location": "global",
    "published": "Wed, 30 Apr 2025 23:29:27 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/keto-diet-reveals-a-new-way-to-starve-deadly-cancer-cells/\" rel=\"nofollow\" title=\"Keto Diet Reveals a New Way To Starve Deadly Cancer Cells\"><img alt=\"Natural Killer Cell Destorying Cancer Cell Illustration\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"437\" src=\"https://scitechdaily.com/images/Natural-Killer-Cell-Destorying-Cancer-Cell-Illustration-777x437.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>A study on fasting and the ketogenic diet uncovers a newfound weakness in pancreatic tumors, making them more susceptible to an existing cancer drug. Scientists at UC San Francisco have found a way to eliminate pancreatic cancer in mice by combining a high-fat ketogenic diet with a targeted cancer therapy. The therapy works by blocking [...]"
    ],
    "image_url": "",
    "titles": [
      "Keto Diet Reveals a New Way To Starve Deadly Cancer Cells"
    ],
    "summary": "A study by UC San Francisco scientists discovered that combining a high-fat ketogenic diet with a specific cancer therapy can effectively eliminate pancreatic cancer in mice. This approach exploits a vulnerability in pancreatic tumors, making them more susceptible to the cancer drug by starving the cancer cells.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "The story is constructive as it reports on a potential solution for treating pancreatic cancer. It provides actionable insights for researchers and medical professionals, and it increases awareness about the relationship between diet and cancer.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.769,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.516,
    "normalized_score": 8.84
  },
  {
    "title": "New Weight Loss & Heart Drug Shows Significant Benefits in Major Trial of Obese Patients",
    "domain": "science",
    "location": "global",
    "published": "Wed, 30 Apr 2025 23:06:25 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/new-weight-loss-heart-drug-shows-significant-benefits-in-major-trial-of-obese-patients/\" rel=\"nofollow\" title=\"New Weight Loss &#038; Heart Drug Shows Significant Benefits in Major Trial of Obese Patients\"><img alt=\"Man Preparing Semaglutide Ozempic\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"486\" src=\"https://scitechdaily.com/images/Man-Preparing-Semaglutide-Ozempic-777x486.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>The drug enhances outcomes in a high-risk patient population with a significant unmet need. Tirzepatide significantly improved kidney function and cardiovascular outcomes in patients with obesity and heart failure with preserved ejection fraction (HFpEF), compared with placebo after one year. These findings were presented at the American College of Cardiology’s Annual Scientific Session (ACC.25) and [...]"
    ],
    "image_url": "",
    "titles": [
      "New Weight Loss & Heart Drug Shows Significant Benefits in Major Trial of Obese Patients"
    ],
    "summary": "A new drug, Tirzepatide, has shown significant benefits in improving kidney function and cardiovascular outcomes for obese patients with heart failure with preserved ejection fraction (HFpEF). Results from a major trial were presented at the American College of Cardiology's Annual Scientific Session, demonstrating its effectiveness over a placebo after one year.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story offers useful information about a new drug that could potentially improve the health of obese patients with heart failure. It reports on the progress made in a major trial, but it could offer more depth on the drug's mechanism of action or the implications of these findings for future treatment strategies.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.764,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.505,
    "normalized_score": 7.56
  },
  {
    "title": "Drugs like Wegovy can be effective at treating fatty liver disease",
    "domain": "science",
    "location": "global",
    "published": "Wed, 30 Apr 2025 23:00:34 +0100",
    "source": "New Scientist",
    "sources": [
      "New Scientist"
    ],
    "snippets": [
      "Semaglutide, a drug commonly taken for weight loss, showed marked benefits for most patients in a trial for metabolic dysfunction-associated steatohepatitis (MASH)"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/04/30154930/SEI_249448052.jpg",
    "titles": [
      "Drugs like Wegovy can be effective at treating fatty liver disease"
    ],
    "summary": "Semaglutide, a medication primarily used for weight loss, demonstrated significant benefits in a trial for patients with metabolic dysfunction-associated steatohepatitis (MASH), a liver condition. The majority of participants in the study experienced positive outcomes, indicating the drug's potential in treating MASH effectively.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it reports on a solution to a health problem (fatty liver disease), providing actionable insights for patients and healthcare providers. It also contributes to a deeper understanding of the potential uses of the drug Semaglutide.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.749,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.51,
    "normalized_score": 8.14
  },
  {
    "title": "Can Potatoes Help With Weight Loss? Scientists Reveal Surprising Benefits",
    "domain": "science",
    "location": "global",
    "published": "Wed, 30 Apr 2025 22:43:46 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/can-potatoes-help-with-weight-loss-scientists-reveal-surprising-benefits/\" rel=\"nofollow\" title=\"Can Potatoes Help With Weight Loss? Scientists Reveal Surprising Benefits\"><img alt=\"Person Holding Potatoes\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Person-Holding-Potatoes-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>Potatoes can aid weight loss and blood sugar control when prepared properly, offering a satisfying, nutrient-rich addition to a healthy diet. Potatoes are one of the world’s most popular and most misunderstood foods. Although they often get a bad rap, new research shows they can actually support weight loss and improve insulin resistance, especially for [...]"
    ],
    "image_url": "",
    "titles": [
      "Can Potatoes Help With Weight Loss? Scientists Reveal Surprising Benefits"
    ],
    "summary": "Recent research highlights that potatoes, when prepared healthily, can support weight loss and enhance blood sugar control. Contrary to common misconceptions, potatoes offer a nutrient-rich option that can be beneficial in a balanced diet, particularly in improving insulin resistance.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The story is useful as it provides actionable insights on how to use potatoes for weight loss and blood sugar control. It increases awareness about the health benefits of potatoes, debunking common misconceptions. However, it doesn't highlight any progress or innovation, hence the score is 0.8 instead of higher.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.759,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.503,
    "normalized_score": 7.33
  }
]