[
  {
    "title": "Court Rules Most Trump Tariffs Illegal, Exceeding Authority",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Fri, 29 Aug 2025 18:07:43 -0400",
    "source": "NPR",
    "sources": [
      "New York Times",
      "CityNews",
      "ABC News",
      "Financial Times",
      "NPR",
      "Deutsche Welle",
      "Global News",
      "The Guardian",
      "Business Insider"
    ],
    "domains": [
      "www.theguardian.com",
      "www.dw.com",
      "ottawa.citynews.ca",
      "abcnews.go.com",
      "www.npr.org",
      "www.businessinsider.com",
      "www.ft.com",
      "globalnews.ca",
      "www.nytimes.com"
    ],
    "snippets": [
      "The U.S. Court of Appeals for the Federal Circuit in Washington, D.C., delayed enforcing its decision, which is expected to be appealed to the Supreme Court.",
      "A US appeals court ruled that most tariffs imposed by President Donald Trump are illegal. The Trump administration is expected to appeal the ruling to the Supreme Court.",
      "A federal appeals court has ruled that most of President Donald Trump’s sweeping global tariffs are unlawful.",
      "Judges uphold ruling that the president exceeded his authority",
      "<p>Ruling upholds decision from trade court that president’s declaration of economic emergency violates 1977 law and US constitution</p><p><strong>A visit to <a href=\"https://www.theguardian.com/world/taiwan\">Taiwan</a> by two US senators has drawn criticism from China, which claims the island as it",
      "The decision is a big blow to President Trump’s trade policies, but the judges left the duties in place for now to allow time for a likely appeal to the Supreme Court.",
      "<p>Supreme court will now have to rule on issue of if president overstepped his authority in upending trade policy</p><p><a href=\"https://www.theguardian.com/us-news/donaldtrump\">Donald Trump</a> overstepped his presidential powers with most of his globe-rattling <a href=\"https://www.theguardian.com",
      "The U.S. Court of Appeals for the Federal Circuit in Washington, D.C., in a split decision, said Trump exceeded his authority as president by imposing the tariffs.",
      "A federal appeals court struck down President Donald Trump's sweeping tariff plan, ruling that he overstepped his executive power.",
      "WASHINGTON (AP) — A federal appeals court ruled Friday that President Donald Trump had no legal right to impose sweeping tariffs but left in place for now his effort to build a protectionist wall around the American economy. The U.S. Court of Appeals for the Federal Circuit ruled Trump wasn’t legall"
    ],
    "image_url": "",
    "titles": [
      "Most of President Trump's tariffs are illegal, U.S. court rules",
      "US President Trump's sweeping tariffs largely illegal, but can stay in place for now, appeals court rules",
      "Trump’s global tariffs are unlawful, appeals court says",
      "Trump’s tariffs ruled illegal by US appeals court but stay in place",
      "US appeals court rules most of Trump’s sweeping global tariffs illegal – live",
      "Appeals Court Rules Against Many Trump Tariffs",
      "Most of Trump’s tariffs are illegal, federal court rules",
      "Trump’s tariffs on Canada, other countries are illegal: U.S. appeals court",
      "Trump's global tariffs are illegal, federal court rules. Here's why they'll remain in place.",
      "U.S. federal appeal’s court rules Trump’s tariffs on Canada, other countries, illegal but leaves them in place for now"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.988,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.873,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A U.S. federal appeals court ruled that most of the tariffs imposed by President Donald Trump are illegal, stating he exceeded his authority. The decision, which upholds a trade court's ruling, is based on violations of a 1977 law and the U.S. Constitution. Although the tariffs remain in effect temporarily to allow time for an expected appeal, the outcome represents a significant challenge to Trump's trade policies. The Supreme Court is anticipated to review the case following the appeal.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Revokes Kamala Harris' Extended Secret Service Protection",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Fri, 29 Aug 2025 12:57:22 -0400",
    "source": "NPR",
    "sources": [
      "Al Jazeera",
      "The Guardian",
      "NPR",
      "Deutsche Welle",
      "Axios"
    ],
    "domains": [
      "www.theguardian.com",
      "www.dw.com",
      "www.aljazeera.com",
      "news.google.com",
      "www.npr.org"
    ],
    "snippets": [
      "It's typical that former vice presidents have Secret Service protection for 6 months after leaving office. In Harris' case, she had received an extension of her detail. Trump is ending the extension.",
      "Move comes as spectre of political violence has grown in the US, with Trump facing two campaign assassination attempts.",
      "Former president Joe Biden had signed an order to provide protection for Kamala Harris through July 2026. It comes as Harris will embark on public appearances to promote her memoir.",
      "<a href=\"https://news.google.com/rss/articles/CBMihAFBVV95cUxQaW9yU1cxUXZJVXpZN3BKa2FueFduTXljSFR6RlQxWU5qb0x5V0xPLW9sb1ZENEMzOHdtXzR3cGU1M3p0cVhQbzJPSnV2YWNTbHUwblZVRlBwajVQMkM3LXJyWnRtU21vTzhkTDdVUHdzS2p3MVlrTFlNRFhSa3h6V2RnQmE?oc=5\" target=\"_blank\">Trump ends Kamala Harris' Secret Service protect",
      "<p>President’s new security directive cancels one-year extension signed by Biden before leaving office</p><p><a href=\"https://www.theguardian.com/us-news/donaldtrump\">Donald Trump</a> has revoked <a href=\"https://www.theguardian.com/us-news/secret-service\">Secret Service</a> protection for the forme"
    ],
    "image_url": "",
    "titles": [
      "Trump ends Harris' Secret Service detail",
      "Trump revokes Secret Service detail for political opponent Kamala Harris",
      "Trump revokes Kamala Harris' Secret Service protection",
      "Trump ends Kamala Harris' Secret Service protections - Axios",
      "Trump revokes Kamala Harris’s Secret Service detail extended by Biden"
    ],
    "score_components": {
      "magnitude": 0.964,
      "recency": 0.887,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.839,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Former Vice President Kamala Harris' extended Secret Service protection, initially authorized by President Joe Biden until July 2026, has been revoked by Donald Trump. This decision comes despite the increasing political violence in the US, including two assassination attempts on Trump's campaign. Harris was set to have enhanced security as she planned public appearances to promote her memoir.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Spirit Airlines Files for Bankruptcy Again Amid Financial Struggles",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Fri, 29 Aug 2025 21:56:21 GMT",
    "source": "CNBC",
    "sources": [
      "MarketWatch",
      "Business Insider",
      "The Guardian",
      "Financial Post",
      "CNBC"
    ],
    "domains": [
      "www.theguardian.com",
      "www.cnbc.com",
      "www.marketwatch.com",
      "www.businessinsider.com",
      "financialpost.com"
    ],
    "snippets": [
      "Spirit Airlines filed for bankruptcy protection again, just months after the budget carrier came out of Chapter 11 protection earlier this year.",
      "<p>Low-cost carrier experiences dwindling cash and mounting losses as recovery further hit by Trump tariffs </p><p>US no-frills pioneer Spirit Airlines filed for fresh chapter 11 bankruptcy protection on Friday, as dwindling cash and mounting losses derailed its turnaround efforts since emerging fro",
      "Spirit Airlines on Friday filed for bankruptcy for the second time in a year. The discount airline warned in early August it may not survive the year.",
      "The move comes after the budget airline emerged from bankruptcy in March.",
      "Budget carrier Spirit Airlines said Friday that it has filed for fresh bankruptcy protection months after emerging from a Chapter 11 reorganization. The no-frills airline said it intends to conduct business as normal during the restructuring process, meaning passengers can continue to book trips and"
    ],
    "image_url": "",
    "titles": [
      "Spirit Airlines files for Chapter 11 bankruptcy protection for the second time in a year",
      "Spirit Airlines files for bankruptcy protection for second time in a year",
      "Spirit just filed for bankruptcy .... again",
      "Spirit Airlines files for bankruptcy again, has this to say about its Labor Day flights",
      "Spirit Airlines files for bankruptcy protection again"
    ],
    "score_components": {
      "magnitude": 0.964,
      "recency": 0.963,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.829,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Spirit Airlines has filed for Chapter 11 bankruptcy protection for the second time within a year, citing dwindling cash reserves and increasing losses exacerbated by Trump tariffs. Despite emerging from a previous bankruptcy in March, the low-cost carrier has struggled to recover, leading to this latest filing. Spirit intends to continue operating normally during the restructuring process, allowing passengers to book flights as usual.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Amorim's Future Uncertain After Emotional Comments Post-EFL Cup Loss",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 29 Aug 2025 21:32:06 GMT",
    "source": "BBC",
    "sources": [
      "Al Jazeera",
      "Sky Sports",
      "Sportsnet",
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.theguardian.com",
      "www.aljazeera.com",
      "www.skysports.com",
      "www.sportsnet.ca",
      "www.bbc.com"
    ],
    "snippets": [
      "Ruben Amorim blames his emotions for post-match comments after Manchester United's defeat by Grimsby, which provoked questions about his future.",
      "Manchester United were dumped out of the EFL Cup on Wednesday by fourth-tier Grimsby and are yet to win this season.",
      "<ul><li><p>‘Sometimes I love them … this is my way of doing things’</p></li><li><p>United accept bid for Antony and agree loan for Højlund</p></li></ul><p>Ruben Amorim admits his temperament means that on some days he “hates” his players and wants to quit and that on other occasions he loves his squ",
      "Ruben Amorim has admitted that \"sometimes I want to quit, sometimes I want to be here for 20 years\" and blamed his emotions for his post-match comments after Wednesday's defeat to Grimbsy.",
      "<p>Ruben Amorim insisted he was living “day by day” as Manchester United manager as pressure ramps up on his position following the team&#8217;s embarrassing midweek exit in the English League Cup at the hands of fourth-tier Grimsby Town.</p>"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/4121/live/72d2e880-84e4-11f0-9cf6-cbf3e73ce2b9.jpg",
    "titles": [
      "'Sometimes I hate my players, sometimes I want to quit', says Man Utd's Amorim",
      "Man Utd’s Amorim sometimes ‘hates his players and wants to quit’",
      "Amorim admits he sometimes ‘hates’ United players and some days ‘wants to quit’",
      "Amorim: Sometimes I want to stay for years... sometimes I want to quit",
      "‘Sometimes I want to quit’: Amorim living ‘day by day’ at Man United as pressure grows"
    ],
    "score_components": {
      "magnitude": 0.964,
      "recency": 0.955,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.827,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Ruben Amorim attributed his post-match comments to his emotions after Manchester United's EFL Cup defeat to fourth-tier Grimsby, raising questions about his future. He expressed fluctuating feelings towards his team, from wanting to quit to desiring a long tenure. Amidst this, Manchester United accepted a bid for Antony and agreed on a loan for Højlund. Despite the team's lack of wins this season and the pressure on his role, Amorim is taking it \"day by day.\"",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Emma Raducanu Exits US Open, Loses to Elena Rybakina in Third Round",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 29 Aug 2025 17:38:20 GMT",
    "source": "BBC",
    "sources": [
      "Sky Sports",
      "The Guardian",
      "Sportsnet",
      "BBC"
    ],
    "domains": [
      "www.skysports.com",
      "www.theguardian.com",
      "www.bbc.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Britain's Emma Raducanu is knocked out of the US Open as she suffered a brutal defeat by fellow Grand Slam champion Elena Rybakina in the third round.",
      "<ul><li><p>Ex-Wimbledon champion wins 6-1, 6-2 in third round</p></li><li><p>Raducanu admits: ‘I have a lot of work to do’</p></li></ul><p>Emma Raducanu has spent the past few months diligently working on improving her game in order to more consistently irritate the best players in the world, but an",
      "Emma Raducanu was knocked out in the third round of the US Open as she lost in straight sets to a rampant Elena Rybakina.&#160;",
      "<p>Emma Raducanu&#8217;s best U.S. Open since her surprising 2021 title ended in the third round with a 6-1, 6-2 loss to 2022 Wimbledon champion Elena Rybakina in just 62 minutes Friday.</p>"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/b88f/live/758ef2e0-84f2-11f0-b599-154efb9f3687.jpg",
    "titles": [
      "Raducanu outclassed by Rybakina in US Open exit",
      "Emma Raducanu overwhelmed by Rybakina at US Open in straight-sets loss",
      "Raducanu beaten by dominant Rybakina at US Open",
      "Emma Raducanu out at US Open after lopsided loss to Elena Rybakina"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.881,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.765,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Emma Raducanu was eliminated from the US Open in the third round after losing to Elena Rybakina, the 2022 Wimbledon champion, with a score of 6-1, 6-2. Raducanu acknowledged the need for improvement in her game following the defeat.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Fantasy Draft Tips: Karabell, Richard Share Insights, Chiefs Players Touted",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Fri, 29 Aug 2025 18:03:51 EST",
    "source": "ESPN",
    "sources": [
      "Yahoo Sports",
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com",
      "chiefswire.usatoday.com"
    ],
    "snippets": [
      "The annual hit is back, with players Eric Karabell feels are going earlier than they should in drafts this summer.",
      "Find out why Dave Richard holds Omarion Hampton and other rookies in high regard",
      "Here's how it played out picking from the ninth position",
      "Fans should consider targeting these four Kansas City Chiefs players in their fantasy football drafts."
    ],
    "image_url": "",
    "titles": [
      "🏈 Fantasy football: Do Not Draft list",
      "2025 Fantasy Football must-draft list: Rookies abound on Dave Richard's sleeper and breakout targets",
      "Fantasy Football Strategy: How to draft from No. 9 overall in PPR leagues; full squad plus favorite picks",
      "Top Kansas City Chiefs players to draft in fantasy football"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.986,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.759,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Eric Karabell suggests some players are being drafted too early in fantasy football leagues. Meanwhile, Dave Richard praises rookies like Omarion Hampton, highlighting their potential value. From the ninth draft position, specific strategies were discussed. Additionally, advice was given to target four Kansas City Chiefs players in fantasy drafts, indicating their expected strong performance.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "U.S. Denies Visas to PLO, PA Members Amid Palestinian ICC Appeals",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Fri, 29 Aug 2025 20:44:48 +0000",
    "source": "Al Jazeera",
    "sources": [
      "The Guardian",
      "Al Jazeera",
      "Washington Post"
    ],
    "domains": [
      "www.theguardian.com",
      "www.washingtonpost.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Palestine’s UN envoy Riyad Mansour said Washington’s visa ban on Palestinian officials threatens to bar Mahmoud Abbas.",
      "State Dept cites Palestinian appeals to ICC and ICJ over Israeli abuses in occupied territory in justifying move.",
      "The move comes as U.S. allies prepare to recognize Palestinian statehood next month.",
      "<p>Step comes when France is leading a push to recognise Palestinian state after Israel’s unyielding bombing of Gaza</p><p>The US has begun denying and revoking visas from members of the Palestine Liberation Organization (PLO) and the Palestinian Authority (PA) in advance of the UN general assembly "
    ],
    "image_url": "",
    "titles": [
      "Reaction to US visa ban on Palestinian officials ahead of UNGA",
      "US denies visas for Palestinian officials before UN assembly",
      "U.S. denies visas to Palestinian officials ahead of U.N. General Assembly",
      "US denies visas to Palestinian Authority leaders for UN general assembly"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.96,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.739,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The U.S. has started denying and revoking visas for members of the Palestine Liberation Organization (PLO) and the Palestinian Authority (PA), including potentially Mahmoud Abbas, in response to Palestinian appeals to the ICC and ICJ over Israeli actions in occupied territories. This move coincides with efforts by U.S. allies, led by France, to recognize Palestinian statehood following Israel's bombing of Gaza.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Administration Targets Wind Industry Funding, Calls Projects Wasteful",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Fri, 29 Aug 2025 16:24:22 GMT",
    "source": "CNBC",
    "sources": [
      "New York Times",
      "Fortune",
      "CNBC"
    ],
    "domains": [
      "fortune.com",
      "www.cnbc.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "The wind industry has been in President Donald Trump's crosshairs since his first day in office, but his administration has recently escalated its attacks.",
      "The Trump administration’s campaign against wind power continued as it targeted funding for marine terminals and ports to support development of the industry.",
      "“Wasteful wind projects are using resources that could otherwise go towards revitalizing America’s maritime industry,” Transportation Secretary Sean Duffy said."
    ],
    "image_url": "",
    "titles": [
      "Trump administration cancels $679 million for offshore wind projects",
      "Transportation Dept. Cancels $679 Million for Offshore Wind Projects",
      "Trump breaks wind funding again, canceling $679 million in federal funding for a dozen offshore projects"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.859,
      "consensus": 0.789,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.736,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Since taking office, President Trump's administration has criticized the wind industry, recently intensifying efforts by targeting funding for marine terminals and ports aimed at supporting the sector. Transportation Secretary Sean Duffy labeled these wind projects as wasteful, arguing the resources should be used to rejuvenate America’s maritime industry instead.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: effort, support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Paetongtarn Shinawatra Dismissed as Thailand PM Amid Scandal",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Fri, 29 Aug 2025 19:34:37 +0000",
    "source": "Al Jazeera",
    "sources": [
      "New York Times",
      "The Guardian",
      "Al Jazeera"
    ],
    "domains": [
      "www.theguardian.com",
      "www.nytimes.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Paetongtarn Shinawatra was dismissed after a leaked phone call scandal.",
      "<p>Daughter of former PM Thaksin accused of failing to protect country’s interests over leaked phone call with Cambodia’s leader</p><p>Thailand’s constitutional court has dismissed Paetongtarn Shinawatra from her position as prime minister, ruling that as the country’s leader she violated ethical ru",
      "Paetongtarn Shinawatra became the third member of her family to be removed from the job, as the nation plunged into fresh political instability."
    ],
    "image_url": "",
    "titles": [
      "What next for Thailand after court sacks suspended prime minister?",
      "Thai court dismisses prime minister Paetongtarn Shinawatra",
      "Thai Court Dismisses Prime Minister Paetongtarn Shinawatra From Office"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.936,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.731,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Paetongtarn Shinawatra was dismissed as Thailand's Prime Minister by the constitutional court for failing to protect the country's interests, following a scandal involving a leaked phone call with Cambodia's leader. This makes her the third member of her family to be removed from office, leading to renewed political instability in Thailand.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "US Blocks Palestinian President from UN General Assembly Attendance",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 29 Aug 2025 19:04:30 GMT",
    "source": "BBC",
    "sources": [
      "New York Times",
      "Axios",
      "BBC"
    ],
    "domains": [
      "news.google.com",
      "www.nytimes.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The decision comes as France leads international efforts to recognise a Palestinian state at the UN meeting next month.",
      "<a href=\"https://news.google.com/rss/articles/CBMihgFBVV95cUxOZGV4bUNVVGFaRWxOV3hYTVBrOFpPN0FMTjZEcV8yYmlyVlU0eEFFUUl5czBueGotR0ZHRnpTclpjRkVkcXJxWHVwUjhEX2VibWkwN3hZYkRjbFFiYUpoQlVGTnhyZFpmTTZSS1NrQWZGMDE1U204M3pJTUktVXpBbU1fdjh0Zw?oc=5\" target=\"_blank\">U.S. blocks Palestinian president from attend",
      "The United States generally allows foreign officials to attend the United Nations General Assembly. The administration’s move comes amid a new push for Palestinian statehood."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/fa76/live/913f1f60-8501-11f0-bf6f-0d0a8492a6fd.jpg",
    "titles": [
      "US to stop Palestinians attending UN meeting in New York",
      "U.S. blocks Palestinian president from attending UN General Assembly - Axios",
      "Trump Administration Bars Palestinian Officials From U.N. Meeting in New York"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.908,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.728,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The United States has blocked the Palestinian president from attending the UN General Assembly next month, amid efforts led by France to recognize a Palestinian state. This decision marks a significant move by the U.S. administration, contrasting with the general practice of allowing foreign officials to attend the assembly.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Court Blocks Trump's Bid to End TPS for 600,000 Venezuelans",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Fri, 29 Aug 2025 18:27:54 +0000",
    "source": "Al Jazeera",
    "sources": [
      "The Guardian",
      "Forbes",
      "Al Jazeera"
    ],
    "domains": [
      "www.forbes.com",
      "www.theguardian.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Court rules against Trump push to cancel TPS for Venezuelans, keeping protections intact amid ongoing legal battles.",
      "<p>Appellate panel upholds lower court’s ruling as homeland security spokesperson attacks ‘activist’ judges</p><p>A federal appeals court on Friday blocked <a href=\"https://www.theguardian.com/us-news/donaldtrump\">Donald Trump</a>’s plans to end protections for 600,000 people from Venezuela who have",
      "Around 350,000 Venezuelans’ legal protections ended in April, while protections for another 250,000 will expire in early September as the case continues to play out."
    ],
    "image_url": "",
    "titles": [
      "Court blocks Trump effort to end protected status for Venezuelans",
      "Court blocks Trump bid to end protections for 600,000 Venezuelans",
      "Appeals Court Blocks Trump From Ending Temporary Protections For 600,000 Venezuelan Immigrants—For Now"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.915,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.727,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A federal appeals court has blocked Donald Trump's attempt to end Temporary Protected Status (TPS) for 600,000 Venezuelans, maintaining their protections amid ongoing legal disputes. The court's decision upholds a lower court's ruling, despite criticism from a homeland security spokesperson towards the judges involved. This ruling comes as legal protections for 350,000 Venezuelans ended in April, with an additional 250,000 at risk of losing their status by early September.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Jakarta Protests Erupt After Motorcyclist Killed by Police Vehicle",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-08-29T08:05:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "New York Times",
      "The Guardian",
      "Deutsche Welle"
    ],
    "domains": [
      "www.theguardian.com",
      "www.dw.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "A 21-year-old motorcycle taxi driver was killed near a protest hotspot around the parliament building in Jakarta when he was run over by an armored police vehicle.",
      "<p>Government faces calls for police reform amid violent clashes across Jakarta and demonstrations in other cities</p><p>Hundreds of Indonesians have protested at sites across Jakarta over the death of a man hit by a police vehicle, in the first big test for Prabowo Subianto’s nearly year-old govern",
      "Rising unemployment and inflation have driven days of demonstrations. A 21-year-old man was killed when police responded with force to a protest on Thursday."
    ],
    "image_url": "",
    "titles": [
      "Indonesia: Protests escalate after death of demonstrator",
      "Protests erupt in Indonesia over death of man hit by police vehicle",
      "Protests Spread Across Indonesia After a Deadly Clash With Police"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.737,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.684,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A 21-year-old motorcycle taxi driver was killed in Jakarta by a police vehicle near a protest site, sparking widespread demonstrations against police brutality and calling for reform. The incident, highlighting issues of rising unemployment and inflation, marks a significant challenge for Prabowo Subianto's government. Protests have spread across Jakarta, with many Indonesians demanding accountability and change.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Patriots Release Safety Jabrill Peppers, Freeing Up $4.32M",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Fri, 29 Aug 2025 18:03:52 EST",
    "source": "ESPN",
    "sources": [
      "Sports Illustrated",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "news.google.com"
    ],
    "snippets": [
      "The Patriots have released safety Jabrill Peppers. A nine-year veteran, Peppers has $4.32 million left on his contract.",
      "<a href=\"https://news.google.com/rss/articles/CBMiZkFVX3lxTFBwaGJnSEVoX1JTN2pwMkQxU3FudlVQWGpjalNTRnZsWE9ianFnVmxQVGs5S3owUmdzQ2ZDMEpvQ0FqdmNEbDg0Sk9RTDNfQktZeUtMeTJJbWVNdFRHbk1pRkVwTE1CZw?oc=5\" target=\"_blank\">Patriots Make Roster Decision on Veteran Safety Jabrill Peppers</a>&nbsp;&nbsp;<font colo"
    ],
    "image_url": "",
    "titles": [
      "Patriots move on from veteran safety Peppers",
      "Patriots Make Roster Decision on Veteran Safety Jabrill Peppers - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.986,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.677,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The New England Patriots have cut safety Jabrill Peppers, who had $4.32 million remaining on his contract. Peppers, a nine-year veteran, is now a free agent after being released by the team.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Red Sox Release Buehler, Promote Prospect Tolle to Majors",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Fri, 29 Aug 2025 18:03:52 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.espn.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "The Red Sox released veteran right-hander Walker Buehler in a series of moves Friday that included calling up top pitching prospect Payton Tolle for his major league debut.",
      "<p>The Boston Red Sox released veteran right-hander Walker Buehler in a series of moves Friday that included calling up top pitching prospect Payton Tolle for his major league debut.</p>"
    ],
    "image_url": "",
    "titles": [
      "Red Sox release Buehler, call up prospect Tolle",
      "Red Sox release RHP Walker Buehler"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.986,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.677,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Boston Red Sox released veteran pitcher Walker Buehler and called up pitching prospect Payton Tolle for his major league debut as part of a series of team changes announced on Friday.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Ben Shelton Withdraws from US Open Due to Shoulder Injury",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Fri, 29 Aug 2025 18:03:51 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.espn.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Ben Shelton quit during his third-round match at the US Open on Friday because of a left shoulder injury.",
      "<p>Ben Shelton quit during his third-round match at the US Open on Friday because of a left shoulder injury.</p>"
    ],
    "image_url": "",
    "titles": [
      "Shelton (shoulder) retires hurt from Open match",
      "Ben Shelton out of US Open after injuring shoulder against Mannarino"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.986,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.677,
    "summary_source": "snippet",
    "summary_reason": "retry_exhausted",
    "summary": "Ben Shelton quit during his third-round match at the US Open on Friday because of a left shoulder injury.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Dallas Mavericks Waive Olivier Maxence-Prosper to Re-Sign Danté Exum",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Fri, 29 Aug 2025 22:00:29 +0000",
    "source": "CBS Sports",
    "sources": [
      "Forbes",
      "CBS Sports"
    ],
    "domains": [
      "www.forbes.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Mavs waiving O-Max opens up a roster spot to re-sign Danté Exum",
      "Dallas Mavericks Waive Former First-Round Draft Pick Olivier Maxence-Prosper after two seasons to get under the second apron. What's next for the 23-year-old?"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/08/29/0d7fad1f-11a7-4d42-89c1-67c944d61ed2/olivier-maxence-prosper-mavericks-g.jpg",
    "titles": [
      "Mavericks waive Olivier Maxence-Prosper: Why Dallas is reportedly parting ways with 2023 first-round pick",
      "Dallas Mavericks Waive Former First-Round Draft Pick"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.985,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.669,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Dallas Mavericks have waived Olivier Maxence-Prosper, a former first-round draft pick, after two seasons with the team. This move was made to get the team under the second salary cap apron and has opened up a roster spot, which they plan to use to re-sign Danté Exum. The future for 23-year-old Maxence-Prosper remains uncertain following his release.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Two Children Killed in Minneapolis School Shooting While Praying",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 29 Aug 2025 02:55:37 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "ABC News",
      "BBC"
    ],
    "domains": [
      "abcnews.go.com",
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Harper Moyski, 10, and Fletcher Merkel, 8, were praying when they were gunned down at school on Wednesday.",
      "One Minneapolis resident raced to Annunciation Catholic School to help the victims of the mass shooting on Wednesday. He said a little girl who was shot in the head asked him to hold her hand.",
      "<p>Fletcher Merkel, eight, and Harper Moyski, 10, died during the attack on the Annunciation Catholic school church</p><p>An eight-year-old boy and a 10-year-old girl who were killed in a <a href=\"https://www.theguardian.com/us-news/2025/aug/27/minneapolis-annunciation-catholic-school-shooting\">mass"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/afc8/live/ed8dc060-849c-11f0-b391-6936825093bd.jpg",
    "titles": [
      "A 'joyful' girl and a boy who loved sports - Victims in Minneapolis shooting identified",
      "WATCH:  Witness speaks out about helping Minneapolis shooting victims",
      "Parents identify victims of Minneapolis school shooting: ‘Our hearts are broken’"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.648,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.666,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Two children, Fletcher Merkel, 8, and Harper Moyski, 10, were killed in a mass shooting at Annunciation Catholic School in Minneapolis. The incident occurred while they were praying. A local resident assisted victims, including a girl who had been shot in the head and requested him to hold her hand. The community is mourning the loss of the young lives.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "California Reaches Deal with Uber, Lyft for Driver Unionization, Benefits",
    "domain": "business",
    "source_domain": "financialpost.com",
    "location": "national",
    "published": "Fri, 29 Aug 2025 21:42:45 +0000",
    "source": "Financial Post",
    "sources": [
      "TechCrunch",
      "Financial Post"
    ],
    "domains": [
      "techcrunch.com",
      "financialpost.com"
    ],
    "snippets": [
      "SACRAMENTO, Calif. (AP) &#8212; California Gov. Gavin Newsom and state lawmakers have struck a deal with rideshare companies Uber and Lyft to allow drivers to join a union and bargain collectively for better wages and benefits. The agreement includes a bill for collective bargaining backed by the Se",
      "The agreement creates a model for drivers to be able to organize for increased pay, job protections, and other benefits. In exchange, California regulators say they’ll support legislation to reduce expensive insurance coverage mandates that ride-hailing companies have to pay."
    ],
    "image_url": "",
    "titles": [
      "California lawmakers reach deal with Uber, Lyft that would allow drivers to unionize",
      "Uber and Lyft drivers in California win a path to unionization"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.979,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.661,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "California Governor Gavin Newsom and state lawmakers have reached an agreement with Uber and Lyft, allowing drivers to unionize and collectively bargain for improved wages and benefits. This deal includes support for legislation to lessen the costly insurance requirements for these ride-hailing companies.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Struff Eliminates Tiafoe in US Open Third Round",
    "domain": "sports",
    "source_domain": "sports.yahoo.com",
    "location": "national",
    "published": "Fri, 29 Aug 2025 22:05:15 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports",
      "Sports Illustrated"
    ],
    "domains": [
      "news.google.com",
      "www.usatoday.com",
      "sports.yahoo.com"
    ],
    "snippets": [
      "Frances Tiafoe, a US Open semi-finalist twice in the past three years, crashed out in straight sets to Germany's Jan-Lennard Struff in the third round on Friday.The 35-year-old Struff defeated Danish 11th seed Holger Rune in the previous round and could face 24-time Grand Slam champion Novak Djokovi",
      "Frances Tiafoe, a semifinalist in 2022 and 2024, was stunned in the third round of the US Open by qualifier Jan-Lennard Struff of Germany.",
      "<a href=\"https://news.google.com/rss/articles/CBMib0FVX3lxTE0xdnZ3dkFKczRVSkZ5SnpVbWEzYjRNRVJPSklHOXpwRnNVTnJwTU9NQWcybFA2cHVOTWgtOHhBWGsyN3VYd19MTk55M1otbVFuYlJkRThCaXZSdzdjcFZPNllPenJJYmMzZXNReTdvOA?oc=5\" target=\"_blank\">Carlos Alcaraz Eases Concerns After Injury Scare During Third Round U.S. Open"
    ],
    "image_url": "",
    "titles": [
      "Tiafoe bounced out in US Open third round",
      "Frances Tiafoe stunned in US Open third round by German qualifier",
      "Carlos Alcaraz Eases Concerns After Injury Scare During Third Round U.S. Open Win - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.987,
      "consensus": 0.611,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.657,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Frances Tiafoe, a two-time US Open semi-finalist, was eliminated in the third round by Jan-Lennard Struff of Germany in straight sets. Struff, who had previously defeated 11th seed Holger Rune, continues his surprising run in the tournament.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "TikTok Adds Voice Messages and Image Sharing to Direct Messaging",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-08-29T15:53:06-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge",
      "TechCrunch"
    ],
    "domains": [
      "www.theverge.com",
      "techcrunch.com"
    ],
    "snippets": [
      "Every platform wants to be the place you hang with friends — even Spotify as of this week — so it’s apparently time for TikTok to shore up its direct messaging feature! It told TechCrunch that over the next few weeks, all users should see voice messages and image sharing options arrive in their DMs.",
      "The new capabilities bring TikTok’s messaging experience more in line with that of other popular social apps and services."
    ],
    "image_url": "",
    "titles": [
      "TikTok is now letting everyone DM each other with voice memos and pictures",
      "TikTok now lets users send voice notes and images in DMs"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.943,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.644,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "TikTok is enhancing its direct messaging feature by introducing voice messages and image sharing options, as confirmed to TechCrunch. This update, rolling out over the next few weeks, aims to make TikTok's messaging capabilities comparable to other leading social apps.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Tesla Crash in Key Largo Kills One, Injures Another; Legal Battle Ensues",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Fri, 29 Aug 2025 17:34:32 GMT",
    "source": "CNBC",
    "sources": [
      "TechCrunch",
      "CNBC"
    ],
    "domains": [
      "techcrunch.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "The Tesla collision in Key Largo, Florida, killed 22-year-old Naibel Benavides and severely injured her boyfriend, Dillon Angulo.",
      "The company's lawyers blame the driver (who settled with the victims separately) for the crash, and the plaintiffs' lawyers for \"overwhelming\" the jury with \"irrelevant evidence.\""
    ],
    "image_url": "",
    "titles": [
      "Tesla asks for $243 million verdict to be tossed in fatal Autopilot crash suit",
      "Tesla challenges $243 million verdict in Autopilot death trial"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.88,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.631,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In Key Largo, Florida, a Tesla crash resulted in the death of 22-year-old Naibel Benavides and serious injuries to Dillon Angulo. Tesla's legal team attributes the accident to the driver, who has already settled with the victims. They accuse the plaintiffs' lawyers of biasing the jury with irrelevant evidence.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Minouche Shafik Appointed to Boost Business and Investor Relations",
    "domain": "business",
    "source_domain": "www.ft.com",
    "location": "global",
    "published": "Fri, 29 Aug 2025 17:25:53 GMT",
    "source": "Financial Times",
    "sources": [
      "The Guardian",
      "Financial Times"
    ],
    "domains": [
      "www.ft.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Former Bank of England deputy governor will be expected to improve relations with business and international investors",
      "<p>Minouche Shafik quit Columbia University after controversy over anti-Israel protests on New York campus</p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/aug/29/uk-business-confidence-rises-economy-fears-stock-market-bonds-inflation-business-live-news-updates\">Business live – "
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F08902d96-9728-4c7e-8d33-0eb1c5778a8a.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Keir Starmer names Minouche Shafik as top economic adviser",
      "Starmer names former Bank deputy governor as his chief economic adviser"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.877,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.63,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Minouche Shafik, former deputy governor of the Bank of England, has been appointed to a role where she is expected to enhance relations with business and international investors. This follows her resignation from Columbia University due to controversy surrounding anti-Israel protests on the campus.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "End of \"De Minimis\" Exemption Sparks Concern in Retail Over New Tariffs",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Fri, 29 Aug 2025 04:05:35 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "CNBC"
    ],
    "domains": [
      "news.google.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMieEFVX3lxTFBPQU9UTGIxbTBvdzV1VnBWS3JKX3U1OWtQYlUxXzZNaEE1Q1NJazI2R2M4NEdKdjNRQWRKRGVEWWgzbzJyczM1aVV4Ylc1WWthc29Icnl5Rlk0aUFHTlZ1WFY3akx6NWt3ZFMyMDlOR1pyTnp4a09kUg?oc=5\" target=\"_blank\">End of \"de minimis\" exemption means new tariffs on millions of pa",
      "The de minimis exemption, an obscure trade law provision, came to an end globally on Friday, setting off a panic across the retail industry."
    ],
    "image_url": "",
    "titles": [
      "End of \"de minimis\" exemption means new tariffs on millions of packages - Axios",
      "Retail panic: What the end of the 'de minimis' exemption means for brands across the globe"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.664,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.602,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The global termination of the \"de minimis\" trade law exemption on Friday has led to widespread concern in the retail industry, as it will result in new tariffs on millions of packages.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]