[
  {
    "title": "Trump Orders Airstrikes on Iranian Nuclear Sites; Ceasefire Questioned",
    "domain": "general",
    "location": "global",
    "published": "2025-06-25T21:04:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "ESPN",
      "New York Times",
      "Deutsche Welle",
      "Washington Post",
      "CBC News",
      "The Guardian"
    ],
    "domains": [
      "general",
      "sports"
    ],
    "snippets": [
      "Security forces fortified Kenya's government buildings with razor wire ahead of a march marking one year since anti-Ruto protesters stormed the parliament. Reports suggest at least eight have died during the protests.",
      "Demonstrators joined antigovernment marches across the country a year after huge rallies against a contentious tax plan left more than 60 people dead.",
      "<img alt=\"A man with toothpaste on his face and a kerchief around his neck holds both hands over his head and forms an X with his arms\" height=\"349\" src=\"https://i.cbc.ca/1.7570926.1750885508!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_620/kenya-security-protests-anniversary.JPG\" title=\"A pr",
      "<p>Police clashed with people marching in Nairobi and other areas to honour those killed in protests last year</p><p>At least 16 people have been killed and 400 injured in <a href=\"https://www.theguardian.com/world/kenya\">Kenya</a> as a nationwide demonstration to honour those <a href=\"https://www.t",
      "At least eight people were killed as protests against police brutality in Kenya spread across the country, according to rights and medical groups.",
      "Thousands demonstrated on Wednesday to express their anger over government corruption and police brutality.",
      "Formula 1 heads into round 11 in Spielberg as McLaren's Oscar Piastri remains championship leader - will the Austrian Grand Prix provide any upsets?"
    ],
    "image_url": "",
    "titles": [
      "Kenya: Several killed in rally on deadly protest anniversary",
      "At Least 8 Killed as Protesters Battle Police in Kenya",
      "Police crack down on Kenyan protesters with deadly force a year after anti-tax uprising",
      "At least 16 people killed and 400 injured in Kenyan protests",
      "At least 8 killed as anti-government protests rock Kenya",
      "What to Know About the Antigovernment Protests in Kenya",
      "What to know ahead of the Austrian Grand Prix"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.937,
      "consensus": 1.0,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.897,
    "summary": "US President Donald Trump ordered airstrikes on Iranian nuclear sites, aiming to support Israel and deter Iran's nuclear program. Despite Trump's claims of a \"devastating attack\" that greatly set back Iran's nuclear capabilities, preliminary American intelligence assessments suggest the impact was marginal, causing only a few months' delay. Amidst continued Israeli bombing, Trump announced a ceasefire agreement between Israel and Iran, which went into effect after mediation by Qatar. However, the ceasefire's effectiveness was questioned due to ongoing strikes and unclear communication. Trump i",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful context about the geopolitical dynamics between the US, Israel, and Iran. It informs readers about the recent airstrikes and their impact, and introduces the concept of a questionable ceasefire. However, it lacks a deeper analysis of the causes, implications, or potential solutions to the conflict."
  },
  {
    "title": "Federal Judge Resumes EV Charger Program; Trump Admin Embraces Crypto",
    "domain": "general",
    "location": "national",
    "published": "Wed, 25 Jun 2025 16:50:18 -0400",
    "source": "NPR",
    "sources": [
      "Al Jazeera",
      "CNBC",
      "NPR",
      "Investopedia"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "Congress designated money for building new EV chargers, but the Trump administration put a freeze on those funds. A federal judge issued a preliminary injunction ordering the program to resume.",
      "The Trump administration is ordering Fannie Mae and Freddie Mac to formally consider cryptocurrency as an asset in single-family mortgage loan risk assessments.",
      "<figure><img alt=\"Kayla Bartkowski / Getty Images FHFA Director William Pulte directed Fannie Mae and Freddie Mac to draw up suggestions on how lenders could include cryptocurrency holdings when considering a borrowers' assets.\" src=\"https://www.investopedia.com/thmb/fsvwz_6wct98oWq6K_zEJXQvo9s=/fil",
      "Bitcoin's price rose on Wednesday as markets stayed in rally mode, the Fed chair talked stablecoin, and a key housing regulator mortgages may consider crypto.",
      "The Trump government has criticised Maryland&#039;s federal judges for &#039;judicial overreach&#039; in their immigration orders."
    ],
    "image_url": "",
    "titles": [
      "Judge orders Trump administration to resume distributing money for EV chargers",
      "Trump administration moves to count crypto as a federal mortgage asset",
      "Federal Regulator Opens Doors to Considering Crypto in Mortgage Applications",
      "Bitcoin rises, NYSE battles for Trump ETF, and crypto may be coming to mortgage next",
      "Trump administration sues Maryland court system over deportation rulings"
    ],
    "score_components": {
      "magnitude": 0.82,
      "recency": 0.932,
      "consensus": 0.985,
      "constructiveness": 0.8,
      "proximity": 0.75
    },
    "score": 0.875,
    "summary": "A federal judge ordered the resumption of a program for building new EV chargers, previously frozen by the Trump administration. Additionally, the Trump administration directed Fannie Mae and Freddie Mac to consider cryptocurrency as an asset for mortgage loan assessments, a move reflected in Bitcoin's price increase amid market rallies and discussions on stablecoin by the Fed chair. Meanwhile, the Trump administration accused Maryland federal judges of 'judicial overreach' in immigration orders.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The story informs readers about important developments in the EV charger program and the U.S. government's stance on cryptocurrency. It provides useful context about the potential impacts of these decisions. However, it does not delve into the specifics of the EV charger program or the potential implications of recognizing cryptocurrency as an asset for mortgage loan assessments."
  },
  {
    "title": "Trump Orders Airstrikes on Iranian Nuclear Sites; Ceasefire Questioned",
    "domain": "general",
    "location": "global",
    "published": "Wed, 25 Jun 2025 11:57:59 GMT",
    "source": "BBC",
    "sources": [
      "Axios",
      "CBS Sports",
      "ESPN",
      "New York Times",
      "CNBC",
      "Washington Post",
      "CBC News",
      "Ars Technica",
      "Forbes",
      "ABC News",
      "Financial Times",
      "Sportsnet",
      "CBC",
      "Sky Sports",
      "Bloomberg",
      "Deutsche Welle",
      "Al Jazeera",
      "Sports Illustrated",
      "BBC",
      "LA Times",
      "The Verge",
      "NHL",
      "Yahoo Sports",
      "The Guardian"
    ],
    "domains": [
      "general",
      "business",
      "technology",
      "sports"
    ],
    "snippets": [
      "Fordo is probably the most spied-on place on the planet - and work to understand what is happening there is set to intensify further.",
      "<p>With questions mounting over the impact of the U.S. and Israeli onslaught on Iran's nuclear facilities and military infrastructure, a return to hostilities could be a matter of when, not if.</p>",
      "The assertion comes as questions swirl about how effective the U.S. and Israeli strikes were.",
      "An earlier U.S. intelligence assessment reportedly found the attacks only set the program back by a few months.",
      "Trump ordered U.S. strikes on Iranian nuclear sites as part of its support for Israel, then days later announced a ceasefire agreement between the countries.",
      "President Trump said discussions with Iran would take place next week as top administration officials forcefully pushed back on questions about the effectiveness of U.S. airstrikes.",
      "<a href=\"https://news.google.com/rss/articles/CBMiiAFBVV95cUxOMEtwa0NEa0FhMjRZR3gzaThZWHNpdlBqRTMxNGc1akVWNktab2lEdjl2ODNUOXd2TkhmbFBnY2NYZkM5NjZiMHNJSkpXcjBiOFVBOWlrdzZldmh2SWxlWGVtV0tDSGhCUDhQclVLc1l3TU81RU43UzMtbjF0eXpMeUUzR0FqOUtj?oc=5\" target=\"_blank\">Trump Says US to Meet Iran Next Week, Putin",
      "US President Donald Trump said attacking Iran caused \"great progress\" in negotiations regarding Gaza, and insisted Tehran \"won't be building nuclear weapons for a long time.\" DW has more.",
      "When the Trump Organization launched the Trump Mobile wireless carrier, it also launched a flagship phone called the T1 Phone 8002 (gold version). One of the phone’s main selling points was that it was to be made in America. We figured that was unlikely to be true. And we were right: sometime in the",
      "Trump T1 phone isn't \"made in the USA\" but is \"designed with American values.\"",
      "Plus, the importance of baby talk.",
      "An Iran-Israel truce takes hold.",
      "<p>President calls intelligence ‘inconclusive’, while defence secretary describes harm to facilities as ‘moderate to severe’ </p><p>Donald Trump and the US defence secretary, Pete Hegseth, have admitted to some doubt over the scale of the damage inflicted on Iran’s nuclear sites by <a href=\"https://",
      "The latest imagery shows further damage following Israel's follow-up strikes on key facilities.",
      "<a href=\"https://news.google.com/rss/articles/CBMie0FVX3lxTE9kZ3NhQXdJLVRvWGtLNmZzYkRqTElpY1MwbDZrdkxMeTNfV1pVUUZneXhXcHBNOGRTNFYtSjRLTEJmNEVjWWtSdDJCeWllYW1vNmtyZ3VhZkZpajJEYnhaWGF6b0o4dEw0dE1XUmtJQ1djUDEzVlRrU0N1Zw?oc=5\" target=\"_blank\">Trump claims U.S. and Iran will hold meeting next week</a>&nb",
      "<a href=\"https://news.google.com/rss/articles/CBMiaEFVX3lxTE5LbndtZ1FQeldwSnozVXBySEUzLV9RRUZsN2UwX1h1VDZkWkJXVWdkbk40REpodmpLb1ZfNWtGd05pc1hDOU5oTU1ILUdxYjVBcVgtdmhTeE1WSWZicGxocWVyaldfYWpp?oc=5\" target=\"_blank\">Trump's swings on Iran leave MAGA with whiplash</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Ax",
      "<a href=\"https://news.google.com/rss/articles/CBMifEFVX3lxTFBEZGV6ZnUydTQwNmpfN2kxbjJEVng0U3BISHRjNkg4MklfTk44SmllNVotTTNzSVB5VmhOVnZ0YmtMcHpsa1J5TjgwTjIyX2lYU1czcjUxcXExT2ZQQjA5bUw1X0RHeG1BMTgtVWw3bGQySDhGMGxkZElPUFA?oc=5\" target=\"_blank\">Trump assails Spain over NATO defense spending target</a>&nb",
      "President Trump has pressed allies to spend more on defense. Leaders agreed that “allies” — but not “all allies” — would meet the objective.",
      "President Trump has long pushed the European allies to be more self-sufficient on defense, relying less on American protection. NATO committed to a major increase over the next decade.",
      "Rutte piled praise on Trump when asked about his use of the term.",
      "Mark Rutte appears to approve of the US president's strong language when Trump spoke about the warring nations on Tuesday.",
      "<p>US president appears relaxed and reaffirms commitment to military alliance – though Spain criticised</p><p>A relaxed Donald Trump said Nato’s decision to increase defence spending to 5% of GDP was a “big win” for western civilisation in a digressive press conference at a summit in The Hague where",
      "<p>This blog is now closed, you can read more on this story <a href=\"https://www.theguardian.com/world/2025/jun/25/trump-praises-nato-states-as-summit-prepares-to-lift-defence-spending-target\">here</a></p><p>Asked about his commitment to Nato’s Article 5, Trump says:</p><p><em>We are with them all t",
      "US President Donald Trump hailed the agreed spending hike as a \"monumental\" victory. NATO member states also expressed \"enduring\" support for Ukraine. DW has the latest.",
      "<img alt=\"Prime Minister Mark Carney shown sitting at a long table with other NATO leaders. \" height=\"349\" src=\"https://i.cbc.ca/1.7570193.1750867529!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_620/carney-europe-20250625.JPG\" title=\"Prime Minister Mark Carney, middle, takes part in a meeting",
      "<p>Follow the latest updates live</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily new",
      "24/7 coverage of breaking news and live events",
      "The latest buzz ahead of the NBA offseason from our NBA insiders.",
      "<p>The 2025 class of impending restricted free agents offers a little bit of everything enticing. Luke Fox takes a look at the latest buzz surrounding the top names on the list.</p>",
      "<a href=\"https://news.google.com/rss/articles/CBMijwFBVV95cUxPYmE5Ni1yaC1yYjRIWE9LaWh4OWdOVUszYzFzX29Yd0pMZzZaaFAzSHM5VUFhR19ZZ3RwQi15N2M4YlZlbXA0bEdqUHVmX3A3a1ZENUd3Q1A5M0NUbHRLclFJSURlXzhnX3FsZS10bXFMazlYRHE4b3o4a1VsanZBZTVpeFRHcjhLMmdJR3F5OA?oc=5\" target=\"_blank\">NBA Trade Tracker: Latest Deals, ",
      "<p>The newest group of young basketball stars are ready to be ushered into the NBA. Follow every pick made with our NBA Draft tracker. </p>",
      "2025 NBA Draft tracker updated with every pick and player from the first round Wednesday night at Barclays Center in Brooklyn, New York.",
      "<p>With the NHL Draft closing in, prospect expert Sam Cosentino shares how he thinks the first round will play out on Friday night.</p>",
      "<a href=\"https://news.google.com/rss/articles/CBMiigFBVV95cUxPMlpsNGstMy1aQ25jWmxOMFUtbnU3T0FPaGJpcE9RRkhIYVZuU01hdEViZy15T1c5dFFqczFDNTF5V2ZkSjBUMml3dXlFZE50cXJGaThybWVJZnJYZHhKdWI2bk1qeFRQRDRNOUFEZ0dKaFV5VUNsc3FIaGdfZE8ycXVnT2ROWm80Vnc?oc=5\" target=\"_blank\">Final Mock 2025 NHL Draft: Intrigue foll",
      "Our NFL Nation reporters dish out intel on all 32 first-round picks from the 2025 draft.",
      "<p>A new generation of NBA talent is set to enter the league on Wednesday night, with the Dallas Mavericks holding the first-overall pick. You can watch coverage of Round 1 of the draft at 8 p.m. ET / 5 p.m. PT on Sportsnet and Sportsnet+.</p>",
      "All of Gator Nation is tuned into the first round of the NBA draft Wednesday with hopes of seeing Walter Clayton Jr. selected. Follow along here.",
      "South Carolina women's basketball starting forward Chloe Kitts was with her boyfriend Collin Murray-Boyles at 2025 NBA Draft on June 25 in Brooklyn.",
      "The first round of the 2025 NBA Draft is set for Wednesday at the Barclays Center in Brooklyn",
      "The newest class of rookies arrived at the 2025 NBA Draft in style. From extravagant jewelry to heartfelt tributes, here's the best dressed hopefuls:",
      "The Brooklyn Nets will have competition for Ace Bailey at the top of the draft.",
      "Flagg is an overwhelming favorite to be selected No. 1 overall on Wednesday night",
      "From Cooper Flagg's three-piece suit to Ace Bailey's statement and custom design, the 2025 NBA draft prospects brought style to Barclays Center.",
      "Explore the top under-the-radar guard prospects in the 2025 NBA Draft with skill, and potential to become draft day steals.",
      "From the no-brainer to the wild cards to those in between, here are eight prospects who caught Jay Bilas' eye.",
      "Only 59 picks will be made in this draft, as opposed to the typical 60",
      "Tune in to ABC and ESPN to watch how the first round of the NBA draft plays out.",
      "With the 2025 NBA Draft looming, the Los Angeles Lakers have expressed a great amount of interest in Utah Jazz center Walker Kessler.",
      "Welcome to the Cooper Flagg Show. Or, as most call it, the 2025 NBA draft. Here's every pick in the first round.",
      "The Pacers traded away their first-round pick in this year's draft, but they added a second-round pick in a trade with the Spurs.",
      "<a href=\"https://news.google.com/rss/articles/CBMiiAFBVV95cUxNVzhZbTFUdTUtUmk0aV9BUmtMVDNBTXhXeF9zeVA3NEFObURuSmR3TnhwTlg3V2dyMU5FWm1LUlhibEstLUJEOFpaajJkd2hQaXNPVmQtTGFPSmJtN2xZMEU0OGtXUHlGV0E0WnhadlNBNXZMMmR5RWVJSXZjTXVlLU1HMjByT2VM?oc=5\" target=\"_blank\">RELEASE: Oilers acquire pick from Canucks f",
      "<p>The FAN Hockey Show hosts Matt Marchese and Mike Futa discuss the Edmonton Oilers trading Evander Kane to the Vancouver Canucks for a 2025 fourth-round pick and what makes the deal so unique.</p>",
      "<p>Jason Bukala joins Kyper and Bourne to discuss the Philadelphia Flyers trading for Trevor Zegras, how he will need to evolve his game to thrive under new head coach Rick Tocchet and why the Flyers are positioned to make another splash or two.</p>",
      "The Kansas City Chiefs are going to do all they can to get Patrick Mahomes another Super Bowl victory.",
      "<p>Vancouver Canucks general manager Patrik Allvin discusses the organization&#8217;s decision to acquire veteran forward Evander Kane and what kind of impact he feels Kane will bring to the team on the ice.</p>",
      "<p>Vancouver Canucks general manager Patrik Allvin discusses Evander Kane&#8217;s potential character issues and remains hopeful that he can positively influence the team&#8217;s culture on and off the ice.</p>",
      "<p>Sportsnet’s Jason Bukala joins Kyper and Bourne to discuss the Vancouver Canucks acquiring Evander Kane from the Edmonton Oilers for a 2025 fourth-round pick, and whether he’ll fit in with his new team.</p>",
      "<a href=\"https://news.google.com/rss/articles/CBMiiwFBVV95cUxNdVZuODZVUGNCNVN6bi1lSEVQMzUyT29QZ1JhdzM0ODFGVDRUbkRPRFN4eENBajZBZWlqWjRxNzRVakZveFhSeU95LU9QSWROYXZSRDFvczBMWTB6VkFSZzhIWWpxd1luWTg0R1hORFFNTElaN2ptbkdYRk5RVEVWazdSMnMzYVhSNVZj?oc=5\" target=\"_blank\">CANUCKS ACQUIRE FORWARD EVANDER KANE FR",
      "<a href=\"https://news.google.com/rss/articles/CBMidkFVX3lxTE1iN3hnNlE5Q3gyc194M25tUFluWWEwUmxQMHozSVR6X09acEJGN0M3dzN3b0U4eEhpTVJ3bHFIR05nMWhjU1RQM1J5LXRnaTR2aFJYVEhqZFExUzgyRGcySzhfTjhpVmZfY3NUNWVMTGFSbm5mZ1E?oc=5\" target=\"_blank\">Kane traded to Canucks by Oilers for draft pick</a>&nbsp;&nbsp;<font",
      "The 2025 NBA Draft gets underway with its first round on Wednesday night. Here is the full draft order for this year:",
      "The 2025 NBA Draft kicks off Wednesday night in Brooklyn",
      "<a href=\"https://news.google.com/rss/articles/CBMikAFBVV95cUxOY0RqUG41dURscUc2Rl9EbXAtY3J4dWpIQnZ4WFhPaDNnSUJnZ0NqX0dmVC1vQjRGcnhob1JXVWR3TG5xR2pZSGdSN3NDRzJEZUxoSkYzT0hmazlqeXYxTnRBVW5DOEhCQnM0TFNmMUJJRGszenNIT3lZYnlIQmdaZlpPZUV4bEJ0Z2NHZzdkZmE?oc=5\" target=\"_blank\">Arsenal ‘Make Bid’ For Premier L",
      "<a href=\"https://news.google.com/rss/articles/CBMilwFBVV95cUxQTUZxQnhPTHhMTjJoQ1FfdjRSNmpacXhvUEYxOGtRQUxMQU9pZVprRmJnOElaT1JUaVFsZHpOaEVNb25JRWdxUVdXZHY0QU13Zk1Ra0o0MFhQY0pOUmpEUm9CY29STnFBbWVSeXNWbTI4YTFQN1M5VWF6Q1REWkMtbzNvY3BYb1o1RVczcC15Si05QkR3eEFJ?oc=5\" target=\"_blank\">Barcelona 2025–26 Pre-S",
      "<a href=\"https://news.google.com/rss/articles/CBMihwFBVV95cUxNcmk2SlVqa3djZnA1MGJ6ZFh1VFFseW5uV2ZuUzNCOW9iWmZUbkhjN2d4eGNUYV8tSkhYRy15WVN4S2FSa1NOWjlUMV8weGFVdmNXeVBPTENFeWlRRVFSTWlXRFNLQlNxVHJFd3UxMkNESER0dGdpZWY3eHlsN18yRzN4cGNOdzA?oc=5\" target=\"_blank\">What Bob Devaney Saw in Tom Osborne</a>&nbsp",
      "<a href=\"https://news.google.com/rss/articles/CBMie0FVX3lxTFBhb1hkdjBMZlNQQTllUGtGRXRVQjB2VFFpXzdoVjNDMXpiUWt5VkUwV2xjeTRSQ0ozSFp4Q05VQzBDNnJkc2xMb1ZrVkcybEo3WWlFcXlJMVpnTDJ2STZWT0R5cEFnTXRnSHgwMG9SS2c1MDFMdUJCZDdsTQ?oc=5\" target=\"_blank\">NFL Players Who Could Have Played in the NBA</a>&nbsp;&nbsp;<",
      "<a href=\"https://news.google.com/rss/articles/CBMimgFBVV95cUxPd3hLR1AyYk5CcEU5TFNWcjFKdTE4dzRHeUIxTlVTYnpKd2FUcjRXNFBycEp1bG15MVF0MTVuQUxKaWdXLXVtV1NRVzl5N2Q3QXBSdVFkUkFfc1oxRlI3WDdIYzhxaGd0bHNCdmtGdUt0bWpTRVkzU3NEbVVMVXotb19sbGJPTW54a1ZxOEJWcjViS2hXTUQ5dGNn?oc=5\" target=\"_blank\">Alex Caruso Had One",
      "<a href=\"https://news.google.com/rss/articles/CBMic0FVX3lxTE1qN2pBcVdaTDJfa2NpdUpObFhpdVVKYV9kZENYSlJtU1RLN3NVRHdSbTRZbVlBNzdFN2tXcHFqM1VvdnFTZ0Nxa2d6alVxTVE4eWhWX0pOVFFCMENlc1FTUUo2OVRLM0lCUlFpVnIwOXB6SjA?oc=5\" target=\"_blank\">Chelsea’s Route to 2025 Club World Cup Final: Major Conflict of Interest",
      "<a href=\"https://news.google.com/rss/articles/CBMijAFBVV95cUxPNnQ1Ym1sMHJ3bWhDZ05ITE1LS1NoRHBEa1BhTEw5dFg1WVNDS3NGRFl4ZEozMmVPVTk4YXpYbkFoaEQwVjB3UVpuWHhMeDFwVnpRZGRieFNFRVVtRjdiNERlN2RlYWsxcWZ3VXFQUEthakpRc09mbWF4cDFwbVRDV2xad0tnSXZHZXNtbQ?oc=5\" target=\"_blank\">‘Final Detail’—Cristiano Ronaldo on V",
      "<a href=\"https://news.google.com/rss/articles/CBMid0FVX3lxTE1VY3pvYUV2SHpxZ2FlbW11UmhoX0NaaWtoZUZRcXU3VFpMQk5paWtwd1JzZzF0QlBnbnNWNVVnMWxxeFV2bEE2WG5EaE1zVkw1akVJUXdxZWJaVTc5VWdHeG5uQlViamdNaTk0a3ZTTVlibVVuRldB?oc=5\" target=\"_blank\">Jadon Sancho: Two European Clubs ‘Enquire’ About Man Utd Misfit</a>",
      "Juventus are expected to hold further talks with Manchester United on Wednesday over a deal for Jadon Sancho, according to <em>Sky Italy</em>.",
      "<a href=\"https://news.google.com/rss/articles/CBMid0FVX3lxTE1yYnR3TXpKQXgxV2lseEFTcEtHQkN3OHNNbVQxS2lNanJsUVBrT3diSnFCR3U0WXlkcExGTUhtRURpRTh5SU8teXQ1bm1yamhRZlgxVHQ3eHlNb0NvQlM3Q1JiWmZkNFdQVDVnX2k2TTJMUS1iWi0w?oc=5\" target=\"_blank\">DeWanna Bonner Releases Statement After Rocky Fever Tenure Ends Wit",
      "<a href=\"https://news.google.com/rss/articles/CBMie0FVX3lxTE1BbXp3RGlxTmw1QTlJaWZwSmg5VUdTMXM1UlRSRjZ1SkFXSmF0ZzJSQ0Z2SG42WlJrU1VjRzhiWTdjOUhqaG9zTWpfdXd1ZERqUV9qZlh1ajRjOER6MEVoSlR0Z1NBeWFSOV9hSlhQVG8tUi1SeUJQRkdoQQ?oc=5\" target=\"_blank\">‘Lot of Desire’—Luka Modric’s Next Move Confirmed by Club Chi",
      "<a href=\"https://news.google.com/rss/articles/CBMie0FVX3lxTFBwYXNXVnE0aW1sbkFjOXVSR3hHamI4Q0hPZngtWFE5ZVZVNHBXZjd0anpETTNyc1ZMYmViVGdIQWVENnpsOGpSRVE5bUtoY3BuNnNSNWZkYXYzOUN0WVQ3d1VUOERaQmozZVZYY1RNZnNVbWFZYms4TUdrOA?oc=5\" target=\"_blank\">NFL Mailbag: Teams Most Likely to Go Worst-to-First in 2025</",
      "<a href=\"https://news.google.com/rss/articles/CBMihwFBVV95cUxQMHlINWFobURlUmtFT21CTlJMTk9oTnRxMGdWMUIxcUxhdzVEa1phTWxhd05JaV9ka3FMRWYxTXlJNUVYb3ZMNXBRcldadFZDM0ZuRU80Y3Z4SVpxQnk0enhVYzBYSGdybWdJRi1FWENwdkEyUlp4cjRDT1k4LUVaajh5dnlVcUE?oc=5\" target=\"_blank\">Detroit Lions Linebacking Corps Ranked Secon",
      "<a href=\"https://news.google.com/rss/articles/CBMijwFBVV95cUxPT3JOMVliaFVQbjZSRHJxdWVrNGc2NmhNM1pidk1kS051RnA3cHNWM05pSXF0QzJoRDM0RkpYczlSOTZlZFhlUU5tYjlYakFGTjdVeXNZNk5RbkRaMmtZS3JZS2tKLUo5YXZ6RGVVVEYxVXRTVnhwYTRLUk9rSGtFWDA3ekRLc3FjQ1E1Q0NfWQ?oc=5\" target=\"_blank\">Power Nine: Uncertainty for Jorda",
      "<a href=\"https://news.google.com/rss/articles/CBMikwFBVV95cUxQX1oxLVl4OXR3QnBmcmQtbVMybDgzdkNpOE56TmhoRlM3SmRsakZGMjI1dG5RcmNUMEk0ZHFwVzh4bzZUQ2RFejFYaHhhelNoc2NxaDhLa3pMOXNXaS1iRlViNUllbVM5NmJyejBMX2FjRGpRbUtDTHJNcUx1NXRQZXM3dzNudFdWN0Q3TTBMWXZUdDg?oc=5\" target=\"_blank\">Warriors' Jonathan Kuminga M",
      "<a href=\"https://news.google.com/rss/articles/CBMif0FVX3lxTE1YUUNIX2poRnpUbmVBRHFmbUZDLUdibDJEZ3RvR1ZucTZzQTZFd1R3V0FxR1pHQWd5VTZxWFZRczJaeE85dHdDOURWWWF2bll5a1Vic1BJYzVFZ2tQbmZIOXVQWjhVZUNPbDJjSk9ReWtvdmhMRlIwY195M1IxSFU?oc=5\" target=\"_blank\">NBA Analyst Says Thunder Could Be Looking to Trade Up in",
      "<a href=\"https://news.google.com/rss/articles/CBMifEFVX3lxTE90YlYybVI1SDlxZWFRVzVoOUxHc2ZZV0loUXZGRHVrcnB2TWZuUmVZTFlLNUozalRRRVRvdmpvcnI4cnQ3anVWbEliU3czdnd0SGc2bTQ5Rk92UTFZa0xDeFBNeVY2enluUnN6d1M4X19IWGlHbVkzUTVBNFQ?oc=5\" target=\"_blank\">Chelsea Learn Club World Cup Last 16 Opponents</a>&nbsp;&nbs",
      "<p>Fluminense held the Mamelodi Sundowns to a scoreless draw on Wednesday, denying the South African club the win they needed to advance to the knockout round at the Club World Cup.</p>",
      "Here's what you need to know from Wednesday's Club World Cup action.",
      "Liam Delap scored his first Chelsea goal as the Premier League side reached the last 16 of the Club World Cup with a 3-0 win over Esperance Tunis.",
      "Slow-paced matches, sweltering players and complaints about the heat have been the themes of the Club World Cup in the USA. Organizers FIFA say they take reasonable precautions but many see a major safety concern.",
      "Real Madrid meet Red Bull Salzburg in Philadelphia in the final Group H match at the FIFA Club World Cup.",
      "<p>FIFA has opened a disciplinary case at the Club World Cup after Real Madrid defender Antonio Rüdiger claimed he was racially abused by Pachuca captain Gustavo Cabral.</p>",
      "The Frenchman was hospitalized early on and has yet to play, and he won't be featuring on Thursday",
      "Weston McKennie and Juve look to win the group when they face Man City on Thursday",
      "We're heading into the knockout rounds of the 2025 Club World Cup as the field of 32 splits in half this week. With updated odds and projections, here's why every remaining team will or won't win this thing.",
      "The USWNT return to the pitch on Thursday night in Colorado",
      "Both sides are favorites to reach the round of 16 at the Club World Cup",
      "SportsLine's Brandt Sutton reveals his soccer picks for the 2025 FIFA Club World Cup group stage match between Inter Milan vs. River Plate",
      "The MLS side will receive a considerable sum of money for its progress at the FIFA Club World Cup, which has a $1 billion prize pot.",
      "<a href=\"https://news.google.com/rss/articles/CBMinAFBVV95cUxNejhlaHl5d0xqUGh3ajZnSUh2TUlDYVFtbW9IMXlhM25DVG9RbGMzc0RFSURuaGdGWVpxRjEyVEtRX0ZKVlNET3BBQ2lZbXhDVXNIbjZlOTZNZzhZSkViYkExdl9RUl9EcFE4bzdTSlprUjVDS2FfT0d3WVktekRXdXFfWVk2enhFSEk4SGE4RjNYMmJpeG9haUl1RFI?oc=5\" target=\"_blank\">Ranking the AFC ",
      "<a href=\"https://news.google.com/rss/articles/CBMiiwFBVV95cUxPUF9ZcjZ5QUVzcmppTFZBOE51UnZhREdYTVFfWk90aGFQNkVOU2NqZksxTUIxcGRUUTVQS1dWam9GbndmNVd3Y0E2ZmpOaWM2a09aeTVLb3VQZGxRYnNXMjh1aGJHQnU5bUZlcmhSMS1QVVVrZGwxSW5pbmEya3JsbkpvXzlCT0dMT19V?oc=5\" target=\"_blank\">32 Teams in 32 Days: Seahawks Can Win t",
      "<a href=\"https://news.google.com/rss/articles/CBMifEFVX3lxTFA0dDc0UzY1VG4yOS1rQmZNa1VOYUFUNXpMOVEyR2RxUmp3MHA5Ni11VFp0cndPWS1tcGRaQkJ3b19TUm5VUUZVMFRuSFBMc0J0dEF1ZEFoM0s5TklTeEsyNG1RaFlreXBUb1lDVmE4X2pvZ1RPaEFNWWtIMVI?oc=5\" target=\"_blank\">Why Arch Manning's Biggest Quarterback Influences Aren't Unc",
      "<a href=\"https://news.google.com/rss/articles/CBMilgFBVV95cUxNVWI4R0kySUFDUGNwVnc5eUJiT3QxTGE1SkszejVfTWtTR1doNWcyaXd5YmFPdWJfWHUwdU5mVVY1Vnl0MVNsWnloVi1LcnQ5RUwzOFU3c29ibURxSVhhQWxGQ0tzaEFqaXlWUktyaGhSSFBTS29TeWctck1naGRCS2JMQmhHQUw2cHR2aG5aQ1VqVjNlZnc?oc=5\" target=\"_blank\">Pittsburgh Steelers Read",
      "<a href=\"https://news.google.com/rss/articles/CBMigwFBVV95cUxQVFlNbmJGRmowSVF3ZlZ4NGowQWlPakkzQVRfeG0xRmJzdUlGVDBGZXBrc3JCeDk5UE1FX2ZaOW54X0ZxLW9VdnFOVHdXNFJhX1hrc0FvZU16S0EydDBpRFNsOUsxdXlGNzh4S1UxNlBPQmJnZHdzTmx3Q1o3R3lCTmxJdw?oc=5\" target=\"_blank\">Giants President Teases Long-Awaited Statue at Or",
      "<a href=\"https://news.google.com/rss/articles/CBMiakFVX3lxTFBOUDc3b1JYZWdSUnZZdFI2UWt4Z2NOLUs3ekw3NTBJQ2tnWTdJR19YX0lNLWJnZ3ZGdDNQS0k5cVBnYzlaLW5CaUx6cVZoUHlVZHF0QmJsTzV2bFg0SXJDQW1qODNlTDhaOXc?oc=5\" target=\"_blank\">DeWanna Bonner Shares Special Message During Fever’s Win Over Storm</a>&nbsp;&nbsp;<",
      "<a href=\"https://news.google.com/rss/articles/CBMiiwFBVV95cUxNRlptTDNlODBNZ3FuaERfZEVWQ1lTb0tlWDVhUTBBZVA4M3BHcFBHaWpTSldkMXNUQWo5dHVlN0NmRGtnTEhvTGhIak1acEwtSUxELTZ0SVEyUVl1NkpJajRFc2NUX3UwMEg4NFEyQ1ktaklEOXVMbkhfdzJxZFJmbEtYdmRDRG1GNlhZ?oc=5\" target=\"_blank\">Brentford ‘Set New Bryan Mbeumo Asking ",
      "<a href=\"https://news.google.com/rss/articles/CBMijwFBVV95cUxNb3FIaUlvZFNXNUhjeFBJM1NEZkYwQ2VYN2xPSHJrekZZQnRvSjFsVE5qM0d0aEdoNmNERTRheDBrem5wOWN5TmJIR1gwQlVMSF9Cazg1RWVkb0ExYnVjb1R4UmxNLWJ3UDA4ZGFMSWVTRWd2Z09XUmtDdzBjdXhjc1lZYlpQcGp2dms3cENLSQ?oc=5\" target=\"_blank\">Kristaps Porzingis Trade Grades: ",
      "<a href=\"https://news.google.com/rss/articles/CBMimgFBVV95cUxOTjd2OEJfUk1qLS1CVlRqYlB5R0FqUUlYNHNKbkd1MDFVSGpvdTFaQXdzdlVZU1ptdWlkc1c3V3N5U1dXcEs3blNpYlNNVGQ2aXhuOHloTmoyVzRhQjhCWTZDSXJNM3I0VGZjUXVWMGd5MDlxZGtlanowM21QLUFXWlNUQTFrSDl3b2F5d3IyaWpQTHdTa0p1NzlB?oc=5\" target=\"_blank\">Busts, Bad Trades a",
      "<a href=\"https://news.google.com/rss/articles/CBMic0FVX3lxTFBSVXhTUVFxYUZ6RWd5WEhiN0FJY1d5LUdSM3B1MlRhMEItb1ppbnFSNFFDZWgxdzctdDJOanFxMTFBWXFtdUFNeGVFQzBhZFRlZXBzQi1UemZ3WUpmcDE2VnN1aWhORmNtVGVmczVPYmRtODg?oc=5\" target=\"_blank\">SI:AM | What We’re Watching at the NBA Draft</a>&nbsp;&nbsp;<font color=",
      "<a href=\"https://news.google.com/rss/articles/CBMijgFBVV95cUxONjRaTHFDbzlaVEtEcmpNRFFaTWVOb1VlWkhtY1Qwc1Bad0NkOTVDREhOd3IwRlJSLUxCSHpMWWhyNGdzQkNoYVo4Q1VXeGJRZTFpUFkzU3BwM0VlOWlwR3VnTTNwMGJxNEVEaWtnaEJxbUZnQVEyMEhOLS1fMDFRR2RrQ0NUVjdscGg4d3ln?oc=5\" target=\"_blank\">Tennis Mailbag: U.S. Open Innovates",
      "<a href=\"https://news.google.com/rss/articles/CBMia0FVX3lxTE85UkRsbjNUM2Q5Y2I2WVJDLVhLWm5ld1o1aTFRUVdtc2N5ak1UenBoc3pWREtsRHo0SWdOZzZuZE5HR3o4bnFhWnF6UnhwWEZ2U1dvN25TLW80ZGZUWWI1d21nbmRXMzRWUzhN?oc=5\" target=\"_blank\">Indiana Fever Make Decision on DeWanna Bonner's Future With Team</a>&nbsp;&nbsp;<fo",
      "<p>The Indiana Fever are moving on from DeWanna Bonner.</p>",
      "The Indiana Fever have waived guard/forward DeWanna Bonner, one of their key free agent acquisitions in the offseason, after she had missed five games due to what was termed personal reasons.",
      "<a href=\"https://news.google.com/rss/articles/CBMimAFBVV95cUxNYW5DWFQwakNYX2JxbW8xa2M1UTNya0RDZVIyeEw2UHhGZ1N2eTY3d21Td1p6Z0JtSHpfSDM1aXA5NGNtdHYtak1WOTRTT1lOVmo5aEtoZHEwd25pcUZVYzBkcUFJUzFDNkJPa0FVV3A2Rm1peHJrME5IWDRLa0dMM29PdWpUdmZaZWFvNlNoU2dTeE8zX19lRw?oc=5\" target=\"_blank\">Celtics Salary Cap Si",
      "<a href=\"https://news.google.com/rss/articles/CBMiiAFBVV95cUxPY2VIMmpNeFJtdzRmTFp2Wnd5a2EyaXFBeUtmcHR5dm1HamFzckJfVUp0ZVRMQ1o3TGFEX05CV1RJR0sydjcwQkFYcXUwWkI1Skh2SXFuTkE0X2JILTRqU0NKT3VzSUpKM2dJSlZfM1hnTG01ZU9YOUNnQkdPY19BeGF0bHdFeEtu?oc=5\" target=\"_blank\">George Kittle Had Surprising Take on Travis",
      "Travis Kelce pumped up by the Chiefs",
      "The NBA trade market has heated up this week",
      "Many member countries would have to double defense spending by 2035 to meet new targets, charts show.",
      "The decision by NATO members on Wednesday to spend five percent of their GDP on defence could shift budget priorities.",
      "There were unexpected moments of levity among the momentous decisions on raising spending to levels not seen since the Cold War.",
      "U.S. President Donald Trump has been exercising pressure for NATO allies to increase their defense spending across both of his terms in office.",
      "\"We're negotiating with Spain on a trade deal and we're going to make them pay twice as much,\" Trump said after the country refused to meet the spending target.",
      "<a href=\"https://news.google.com/rss/articles/CBMiiwFBVV95cUxPa05mU0Mwek1KdlZJbl9DRkhZMnlreU1fcF8zaHdaWlNjUUN6SDlaajZ0bmFKaEJGaDRkNFRVNFVQNlpjbzg1dDZZMndLNlFBLVNYZFJZVFA0aHRBbHdFcVptRmt3bUhCNk5ndjhCUkh6cTM1d3MtVUE4cjZvZ05ib1FvVzZIYjZ4cHow?oc=5\" target=\"_blank\">Democrats rage as Trump limits classifi",
      "The Trump administration is planning to limit classified information shared with Congress, sources familiar with the matter told ABC News.",
      "<a href=\"https://news.google.com/rss/articles/CBMif0FVX3lxTE0ydFo4RV9zN2R0Mkc3MjFESnBuTGFNRkdidGtITTRwcERaQ3E2TE1BSVNPelV4dDVsSTVoWEtYdU5jUWpLeU1vSHFhUzBGUFVkUzBPdF9HZkFpTlpjbVU2d0swanVOLXBBNnc4Um9oQmdCa1JuRDNQSG1qNENra28?oc=5\" target=\"_blank\">Scoop: Trump admin cuts contracts with scientific publis",
      "<a href=\"https://news.google.com/rss/articles/CBMiggFBVV95cUxNTDRaZ0plemU5SXVDWHlRMWNjOG1hWndYR2ZFeWZ6b296c2RIZGlGNXdWY1RFcy04bFhlcE43eGhxZy1zMlNjSVpVdldNaXdlUnF6Y2xUME5BQnJ4REctMWIycFF4TDBjWTBzZW1BN3hIVEhsbzBBWUpNQmFzZklrV2Vn?oc=5\" target=\"_blank\">Scoop: Trump hosting \"everyday Americans\" to squeez",
      "<a href=\"https://news.google.com/rss/articles/CBMifkFVX3lxTFB1R0dOOXIwdUJPblFuZHotQVRsNTBaYllFZzB4YURhVVVmV29mSjlPTFB0Y0VGN0NFbG1TS0VrOWFzekh2UzNTNU5vUk93Qm0tMDFCWUlYa09tbkNsU1cwMzQwWWJqQ2piN0NGdWdpUEJrNzdVVVg5RWdpTEZmQQ?oc=5\" target=\"_blank\">Scoop: Trump to limit sharing classified info with Congre",
      "<a href=\"https://news.google.com/rss/articles/CBMid0FVX3lxTE9CODVHeDhYblhSS004OHFtYWhGTlp3d0c1VW5vOS1yeFFtRjMxcVBHaFdvWFlJcU9zV1NXR1lBWkpNQ1psOEc2ZDZzbUN1NzFabWlOTXkxeXYyVVdIVUw3VUNfMzlZQjdVSE9ZSktUdDdJSTdGM1Nz?oc=5\" target=\"_blank\">Trump slings insults at Mamdani, other Democrats after NYC primary<",
      "<img alt=\"A man with a beard wearing a suit stands behind a podium with right hand over his heart.\" height=\"349\" src=\"https://i.cbc.ca/1.7570154.1750827787!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/election-2025-nyc-mayor.jpg\" title=\"Democratic mayoral candidate Zohran Mamdani takes th",
      "His potential victory could bring what the Street despises the most — tax hikes and tighter regulation that threaten corporate and investment interests.",
      "Mamdani had received 43.5% of votes counted by the time former Gov. Andrew Cuomo, the second-place candidate in the Democratic primary, conceded the race Tuesday.",
      "Financiers plot to back a moderate after leftwing candidate clinches Democratic candidacy",
      "His NYC Democratic primary win reflects growing, immigrant-led politics rooted in global resistance.",
      "A rent freeze could lower the value of Flagstar's multi-family housing loans, though the extent of the potential impact is unclear.",
      "<a href=\"https://news.google.com/rss/articles/CBMimAFBVV95cUxOdWtpeW8zbURBRjZtWl96UTFtY1N3VHhXSUpOT1ZjMnhXQXFXNVl4UVJOXzF5ME9vV18zNkZoazhHSHo5NGtraVZjaFBkcEZPS3Blb3g4ampuTG9mNDIydXRIdGRyakFWT1hiSkl2OTVhWGNvWUNvQ3lJM3JIUDVtZXJ1cEdaSnJHaEc0RXpza1hZR05RRVpqLQ?oc=5\" target=\"_blank\">Andrew Cuomo concedes",
      "<a href=\"https://news.google.com/rss/articles/CBMifEFVX3lxTE14dS1RcjZYR1hfLXV5LXE2elhNSTh2SkNmeEdDdmRhYUdRRzUwVUVNbzJZQnBJUW81YTJ0dDJBZzNZOXBoOXQtNnlqT3E0bUVZSDVOanJmNXZ6QkhqZlhNcnVhWjlRLUl5WUVOYkxua0lGSC1nZHcwTE56M2o?oc=5\" target=\"_blank\">MAGA erupts with Islamophobic attacks on Zohran Mamdani</a>&",
      "<a href=\"https://news.google.com/rss/articles/CBMifkFVX3lxTFBucVAzNnRXRHdGbjJwVTdzOFdYd19tNDg5Nm1pdVlzaDJlUnZ2RndwbzlSLVF1M2txRnlNZGJoaUpwVjZRakJRMC1ZTG9sT0txUjhadkswNmxwNXgxOXJlVHgzRXJmOVROazJZV1dNcVRLcURHY2Z2b1pHaHEwZw?oc=5\" target=\"_blank\">Why the NYC mayoral election may be a five-way race in No",
      "<a href=\"https://news.google.com/rss/articles/CBMiigFBVV95cUxOOW1oVnk5MDlXM3MwRWhYN205U3BIWXFudVpNejJWMW5lUlZrRXpPaUE2ekRvLWk2X2ZOM3lJbUFyY0tnc0VwNUlMamFNR29RQmg1R2F5ZkNuaXlnWHRMeWF5WkZUQ0J1X0RPSmFldzV4Y3lILWw3TmRiU0N0OVM1dzU5aGJtbExUakE?oc=5\" target=\"_blank\">Zohran Mamdani's campaign was a perfect ",
      "<a href=\"https://news.google.com/rss/articles/CBMia0FVX3lxTE00dkhRS1pha3lRb1F4V3FaenpsbDlRN25DZ3JfQ3hCaUE5eTNNZzNtYUZLRWVCN1lEUW04ZUtzc3Z6ZGVDNU9YT3dUaGJpX04xOTJMVEFkR1JrcFNYVHdrUUZWUl95VndzT0w4?oc=5\" target=\"_blank\">Zohran Mamdani has NYC's business community \"terrified\"</a>&nbsp;&nbsp;<font color=",
      "<a href=\"https://news.google.com/rss/articles/CBMif0FVX3lxTE9wRWtFVTA1Mnc5cHFqdUU3c1V3RVJ2Zmw5XzlzNktaWmd3U2l5M3Bhc1VaX3hQWTFyZV8wU213N0gybGdZdTRFcVN3d1dJb0ZjVEFnZXZ5cWdvYzZqTnJfMUNKVDU4RUxWOGVIeHd5Qy1qVGcydWhSV1QtcjZ3SHM?oc=5\" target=\"_blank\">Who is Zohran Mamdani, NYC's Democratic mayoral nominee<",
      "Most NATO allies promised to ramp up defense spending and reaffirmed their \"ironclad\" commitment to mutual defense. But there are lingering concerns over the scale and scope of US engagement.",
      "The bloc agrees to boost spending to 5% of GDP, but Spain, Belgium and Slovakia say they will struggle to meet target.",
      "<a href=\"https://news.google.com/rss/articles/CBMiggFBVV95cUxQWUxZLUxSLVluaFpOWEdvX0lxak8zS2JPVlpsYkdBeDh6cVN6YURIT1hTRmdPNWxzRTVoMEgxT1FPRFdJR0tRbE16LW80d25WV0gxRFB6REhrbDFZV296d0Zibm0zWEhSZG1LcldVSVV2OXhOdVZ3RG44UlEtQTFkWmhB?oc=5\" target=\"_blank\">Trump wages all-out fight for control of Iran strik",
      "President Donald Trump attempted to dismiss U.S. intelligence reports on the attack on Iranian nuclear facilities claiming such rhetoric allegedly devalued the military.",
      "Donald Trump said the US and Iran will hold talks next week but he doesn’t care about signing an agreement.",
      "Secretary of State Marco Rubio said U.S. strikes had destroyed a facility that is key to turning highly enriched nuclear fuel into a working bomb. He railed against a less optimistic U.S. intelligence report.",
      "Indications from an early intelligence assessment on the impact of the strikes began to emerge.",
      "Iranian and Israeli officials said they would respect the terms of the ceasefire if the other side did too.",
      "In public, Qatar was insisting on the right to defend itself after Iran attacked a U.S. military site in the emirate. Behind the scenes, it was already mediating a truce between Israel and Iran.",
      "Oil prices sold off on Monday and Tuesday after Iran held back from targeting regional crude supplies, and Trump pushed Jerusalem and Tehran into a truce.",
      "The US president doubles down on the ‘fake news’ media",
      "<a href=\"https://news.google.com/rss/articles/CBMihwFBVV95cUxQUnA5Ty1ldk1xVmhUdFk3Nk9pcDNjUnU5TFp2aHBsWXNmY0FMUnR2Q1dYNGRNV241UHowandwckZWSHgtaVlGRGREQTY1UTVMMUZoRlN0TnVaUnZDUzEwZzB6OTBTMHE2YkR0cG1GSlNKM2JXZVRpbzNETGVhRXR6TWwyVjdtYmc?oc=5\" target=\"_blank\">Israeli officials see \"significant\" damage t",
      "<img alt=\"A balding man with a beard and mustache wearing glasses and a suit \" height=\"349\" src=\"https://i.cbc.ca/1.7570166.1750838517!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_620/iran-nuclear-parliament-iaea.JPG\" title=\"FILE PHOTO: Iranian Parliament Speaker Mohammad Baqer Qalibaf looks ",
      "Core components of Iran’s nuclear effort were damaged but not destroyed by U.S. airstrikes on three key facilities, say people familiar with a Defense Intelligence Agency initial assessment.",
      "A leaked intelligence report has cast doubt on Trump and Netanyahu’s claims about destroying Iran&#039;s nuclear programme."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/09bf/live/eeec9f90-51c4-11f0-a2ff-17a82c2e8bc4.jpg",
    "titles": [
      "Damaged or destroyed - how much does leaked US report on Iran's nuclear sites tell us?",
      "Will the ceasefire stick? And is Iran's nuclear program really destroyed?",
      "The Israeli atomic energy commission says the war set back Iran’s nuclear program by ‘many years.’",
      "CIA Says U.S. Strikes ‘Severely Damaged’ Iran Nuclear Sites—Setting Program Back ‘Years’ (Live Updates)",
      "Trump CIA chief says Iran nuclear program was 'severely damaged,' countering reports of U.S. intel assessment",
      "Trump Says U.S. and Iran to Meet; White House Disputes Damage Report",
      "Trump Says US to Meet Iran Next Week, Putin Talks Ahead - Bloomberg.com",
      "Trump says 'great progress' made on Gaza ceasefire talks",
      "The Trump Phone no longer promises it’s made in America",
      "After a week, Trump Mobile drops claim that Trump phone is “made in the USA”",
      "Thursday Briefing: Trump Says He’ll Meet With Iran",
      "Wednesday Briefing",
      "Trump and Hegseth admit doubts about level of damage to Iranian nuclear sites",
      "Satellite images reveal new signs of damage at Iranian nuclear sites",
      "Trump claims U.S. and Iran will hold meeting next week - Axios",
      "Trump's swings on Iran leave MAGA with whiplash - Axios",
      "Trump assails Spain over NATO defense spending target - Axios",
      "NATO Agrees to Boost Military Spending as Trump Praises Allies, but Criticizes Spain",
      "NATO Agrees to a Big Increase in Military Spending, Pleasing Trump",
      "NATO secretary-general calls Trump 'Daddy'",
      "Watch: Nato boss calls Trump 'daddy' in handling of Israel-Iran conflict",
      "Trump hails ‘big win’ as Nato states agree to raise defence spending to 5% of GDP",
      "Nato leaders confirm defence spending will rise to 5% of GDP and say support for members is ‘ironclad’ – as it happened",
      "NATO summit: Allies agree to spend 5% of GDP on defense",
      "Canada promises to spend 5% of GDP on defence by 2035 in pact with NATO leaders",
      "News live: Gallagher defends Australia’s ‘billions of dollars’ on defence spend after Nato decision to increase to 5% of GDP",
      "LIVE:  ABC News Live",
      "NBA free agency 2025: Latest signings, news, buzz, live reports",
      "NHL’s Top 12 RFAs of 2025: Latest rumours, reports",
      "NBA Trade Tracker: Latest Deals, Draft Moves and Free Agency News - Sports Illustrated",
      "NBA Draft Tracker: Every pick made",
      "NBA draft picks 2025: Every player selected in the first round",
      "Sam Cosentino’s 2025 NHL Mock Draft: How will the first round unfold?",
      "Final Mock 2025 NHL Draft: Intrigue following 1st 4 picks - NHL.com",
      "First-team reps? Big plays? A sneak peek at how the 2025 NFL draft first-rounders look",
      "2025 NBA Draft on Sportsnet: Round 1 from Barclays Center",
      "Gator Nation reacts to Day 1 of 2025 NBA draft",
      "South Carolina's Chloe Kitts with boyfriend Collin Murray-Boyles at 2025 NBA Draft",
      "2025 NBA Draft where to watch: Round 1 time, TV channel, stream, draft order, Cooper Flagg set to go No. 1",
      "2025 NBA Draft drip check: Cooper Flagg sticks to navy blue; Ace Bailey brings the bling",
      "One Team Predicted to Take Ace Bailey in NBA Draft",
      "Cooper Flagg set to be top pick in 2025 NBA Draft: What to know before Mavericks select Duke freshman at No. 1",
      "Fits before the picks: NBA draft night drip takes center stage",
      "Under-The-Radar 2025 NBA Draft Prospects: Guards",
      "Bilas: Eight prospects who stand out in this year's NBA draft class",
      "2025 NBA Draft: What Jalen Brunson and the Knicks have to do with this year's odd number of picks",
      "Follow live: Round 1 of the 2025 NBA draft",
      "Lakers Showing Significant Interest in Walker Kessler Ahead of 2025 NBA Draft",
      "NBA draft live updates: Every pick in the first round for 2025",
      "Pacers acquire No. 38 pick in NBA Draft from Spurs",
      "RELEASE: Oilers acquire pick from Canucks for Kane - NHL.com",
      "What to make of Kane’s trade from Oilers to Canucks",
      "What kind of chance are the Flyers taking with Zegras trade?",
      "Chiefs Could Make Blockbuster Trade for 49ers Receiver",
      "Allvin feels Kane acquisition makes Canucks ‘harder to play against’",
      "Allvin hopeful Kane will positively impact Canucks’ leadership group",
      "Will Kane be a good fit in the Canucks’ dressing room?",
      "CANUCKS ACQUIRE FORWARD EVANDER KANE FROM EDMONTON - NHL.com",
      "Kane traded to Canucks by Oilers for draft pick - NHL.com",
      "2025 NBA Draft order: Full list of which team owns each pick",
      "2025 NBA Draft order: Full list of every pick from 1-59 with Mavericks set to take Cooper Flagg at No. 1",
      "Arsenal ‘Make Bid’ For Premier League Captain, Thomas Partey Heading for Exit - Sports Illustrated",
      "Barcelona 2025–26 Pre-Season Fixtures: Dates, Opponents, How to Watch - Sports Illustrated",
      "What Bob Devaney Saw in Tom Osborne - Sports Illustrated",
      "NFL Players Who Could Have Played in the NBA - Sports Illustrated",
      "Alex Caruso Had One Major Request for NBA After Thunder Win Championship - Sports Illustrated",
      "Chelsea’s Route to 2025 Club World Cup Final: Major Conflict of Interest on Horizon - Sports Illustrated",
      "‘Final Detail’—Cristiano Ronaldo on Verge of Confirming Future With New Deal - Sports Illustrated",
      "Jadon Sancho: Two European Clubs ‘Enquire’ About Man Utd Misfit - Sports Illustrated",
      "Juventus to hold talks with Man Utd over Sancho",
      "DeWanna Bonner Releases Statement After Rocky Fever Tenure Ends With Release - Sports Illustrated",
      "‘Lot of Desire’—Luka Modric’s Next Move Confirmed by Club Chief - Sports Illustrated",
      "NFL Mailbag: Teams Most Likely to Go Worst-to-First in 2025 - Sports Illustrated",
      "Detroit Lions Linebacking Corps Ranked Second in NFL - Sports Illustrated",
      "Power Nine: Uncertainty for Jordan Spieth and Keegan Bradley's Major Move - Sports Illustrated",
      "Warriors' Jonathan Kuminga Makes Intriguing Comments Ahead of Free Agency - Sports Illustrated",
      "NBA Analyst Says Thunder Could Be Looking to Trade Up in Draft - Sports Illustrated",
      "Chelsea Learn Club World Cup Last 16 Opponents - Sports Illustrated",
      "Fluminense advances at Club World Cup after draw with Mamelodi Sundowns",
      "Club World Cup Daily: Dortmund, Fluminense advance, but Sundowns make mark",
      "Delap scores first Chelsea goal as Blues progress to last 16",
      "Club World Cup: Extreme heat poses questions for FIFA",
      "Real Madrid vs RB Salzburg: FIFA Club World Cup – team news, start, lineups",
      "FIFA investigates if Real Madrid’s Rüdiger was racially abused by opponent at Club World Cup",
      "Real Madrid vs. RB Salzburg odds, live stream: Will Kylian Mbappe play, how to watch Club World Cup, pick",
      "Juventus vs. Manchester City live stream, how to watch Club World Cup: Odds, pick, prediction",
      "From Man City to Flamengo, why every last-16 team will, won't win Club World Cup",
      "USWNT vs. Ireland prediction, where to watch, live stream: Predicted lineups, pick, odds, how to watch",
      "RB Salzburg vs. Real Madrid predicted starting lineups: No Kylian Mbappe as Los Blancos look to win group",
      "Inter Milan vs. River Plate prediction, odds, start time: Free 2025 FIFA Club World Cup picks for June 25",
      "Messi’s Inter Miami Receive Unprecedented Prize Money At Club World Cup",
      "Ranking the AFC East Offensive Line Situations - Sports Illustrated",
      "32 Teams in 32 Days: Seahawks Can Win the NFC West If Sam Darnold Delivers - Sports Illustrated",
      "Why Arch Manning's Biggest Quarterback Influences Aren't Uncles Peyton, Eli - Sports Illustrated",
      "Pittsburgh Steelers Ready For More: Another Move Ahead - Sports Illustrated",
      "Giants President Teases Long-Awaited Statue at Oracle Park for Franchise Legend - Sports Illustrated",
      "DeWanna Bonner Shares Special Message During Fever’s Win Over Storm - Sports Illustrated",
      "Brentford ‘Set New Bryan Mbeumo Asking Price’ After Fresh Man Utd Bid - Sports Illustrated",
      "Kristaps Porzingis Trade Grades: How Did Celtics, Hawks, Nets Fare? - Sports Illustrated",
      "Busts, Bad Trades and Regrets: Each NBA Team's Biggest Draft Mistake Since 2000 - Sports Illustrated",
      "SI:AM | What We’re Watching at the NBA Draft - Sports Illustrated",
      "Tennis Mailbag: U.S. Open Innovates With Mixed Doubles Format - Sports Illustrated",
      "Indiana Fever Make Decision on DeWanna Bonner's Future With Team - Sports Illustrated",
      "Indiana Fever waive six-time all-star DeWanna Bonner",
      "Fever waive Bonner, who says fit 'did not work'",
      "Celtics Salary Cap Situation After Trading Kristaps Porzingis to Hawks - Sports Illustrated",
      "George Kittle Had Surprising Take on Travis Kelce Getting Into Shape This Offseason - Sports Illustrated",
      "Chiefs React to Travis Kelce’s Offseason Appearance With George Kittle",
      "2025 NBA Draft trade tracker: Latest deals, news as Celtics, Nets, others swap picks and star players",
      "See how much NATO countries spend on defense and how that has changed",
      "NATO countries’ budgets compared: Defence vs healthcare and education",
      "Five takeaways from Nato's big summit on hiking defence spending",
      "NATO allies agree to higher 5% defense spending target",
      "Trump threatens tough trade deal for Spain after it refuses to meet NATO defense spending target",
      "Democrats rage as Trump limits classified intel sharing with Congress - Axios",
      "White House plans to limit classified info it shares with Congress on Iran attack",
      "Scoop: Trump admin cuts contracts with scientific publishing giant - Axios",
      "Scoop: Trump hosting \"everyday Americans\" to squeeze GOP holdouts - Axios",
      "Scoop: Trump to limit sharing classified info with Congress after leak on Iran bombing damage - Axios",
      "Trump slings insults at Mamdani, other Democrats after NYC primary - Axios",
      "Upstart Mamdani declares victory with stunning upset in NYC Democratic mayoral primary",
      "Zohran Mamdani’s victory in NYC mayoral primary leaves Wall Street 'alarmed' and 'depressed'",
      "Billionaires Ackman And Musk Blast Zohran Mamdani’s NYC Primary Win—Catsimatidis Predicts Adams Could Win",
      "Wall Street reels from Mamdani victory in New York mayoral primary",
      "Mamdani’s victory marks the rise of a new American Left",
      "Primary win by pro-rent freeze Mamdani knocks shares of Flagstar bank on NYC market exposure",
      "Andrew Cuomo concedes to Zohran Mamdani in NYC mayoral primary - Axios",
      "MAGA erupts with Islamophobic attacks on Zohran Mamdani - Axios",
      "Why the NYC mayoral election may be a five-way race in November - Axios",
      "Zohran Mamdani's campaign was a perfect storm - Axios",
      "Zohran Mamdani has NYC's business community \"terrified\" - Axios",
      "Who is Zohran Mamdani, NYC's Democratic mayoral nominee - Axios",
      "NATO members step up spending, but doubts about US remain",
      "NATO commits to major defence spending hike sought by Trump",
      "Trump wages all-out fight for control of Iran strike narrative - Axios",
      "Trump slams news coverage of US intel report on Iran attack, says B-2 pilots upset",
      "Trump says he doesn’t care if US, Iran sign a nuclear agreement",
      "Rubio Fleshes Out Trump’s Case That Iran Nuclear Capacity Was Eliminated",
      "Israel-Iran live updates: Trump again claims 'obliteration' of Iran nuclear sites",
      "Israel-Iran ceasefire appears to hold as Trump heads to NATO summit",
      "How Qatar Helped Broker the Israel-Iran Cease-Fire",
      "U.S. crude oil rises after steep selloff following Israel-Iran ceasefire",
      "Has a Pentagon leak shattered Trump’s claims on Iran?",
      "Israeli officials see \"significant\" damage to Iran's nuclear facilities - Axios",
      "Nuclear facilities 'badly damaged,' Iran's foreign ministry says",
      "U.S. initial damage report: Iran nuclear program set back by months, not obliterated",
      "Did the US and Israel really obliterate Iran’s nuclear facilities?"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.775,
      "consensus": 1.0,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.865,
    "summary": "US President Donald Trump ordered airstrikes on Iranian nuclear sites, aiming to support Israel and deter Iran's nuclear program. Despite Trump's claims of a \"devastating attack\" that greatly set back Iran's nuclear capabilities, preliminary American intelligence assessments suggest the impact was marginal, causing only a few months' delay. Amidst continued Israeli bombing, Trump announced a ceasefire agreement between Israel and Iran, which went into effect after mediation by Qatar. However, the ceasefire's effectiveness was questioned due to ongoing strikes and unclear communication. Trump i",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful context about the geopolitical dynamics between the US, Israel, and Iran. It informs readers about the recent airstrikes and their impact, and introduces the concept of a questionable ceasefire. However, it lacks a deeper analysis of the causes, implications, or potential solutions to the conflict."
  },
  {
    "title": "U.S. Cuts Gavi Funding, Urges Focus on Vaccine Safety Amid Measles Outbreak",
    "domain": "general",
    "location": "national",
    "published": "Wed, 25 Jun 2025 19:39:14 -0400",
    "source": "NPR",
    "sources": [
      "Axios",
      "NPR",
      "Ars Technica",
      "New York Times",
      "Al Jazeera",
      "Washington Post",
      "SciTechDaily",
      "The Guardian"
    ],
    "domains": [
      "general",
      "science",
      "technology"
    ],
    "snippets": [
      "The secretary of health and human services said that funding will be curtailed until Gavi, the Vaccine Alliance, takes into account the science of vaccine safety in its campaigns.",
      "Robert F. Kennedy Jr. claimed that the agency, Gavi, had “ignored the science” in immunizing children around the world.",
      "The announcement from Robert F Kennedy Jr comes as his controversial CDC vaccine panel meets for the first time.",
      "The study noted persisting outbreaks of vaccine-preventable diseases, including the U.S. measles outbreaks this year reaching over 1,000 cases.",
      "<a href=\"https://scitechdaily.com/vanishing-populations-millions-are-missing-from-global-census-counts/\" rel=\"nofollow\" title=\"Vanishing Populations: Millions Are Missing From Global Census Counts\"><img alt=\"Man Searching Magnifying Glass\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"469\" sr",
      "The advisory committee makes recommendations to the Centers for Disease Control and Prevention on the nation's vaccine schedule. Any changes could affect vaccinations for millions of children.",
      "<a href=\"https://news.google.com/rss/articles/CBMifEFVX3lxTE5qay01NE1aUGpfVlZTU2pocHpld2hGb2Y1UXFxUnBZMnJhUjNWbkVURGg1MW9XWkZfV2dmOFhlWGNpdTNaaUJJcDNraHFIRDl5QXRaaTljNWJ1bGlqbUI2amhOa3haUWVQdVZYWkdoeDZJQzBMZThXbzk0UTA?oc=5\" target=\"_blank\">RFK Jr.'s vaccine advisors to re-examine childhood vax sched",
      "Overall, the meeting was packed with anti-vaccine talking points and arguments.",
      "<p>Health secretary unilaterally appointed ACIP’s eight new members, several of whom are critical of immunizations</p><p>The first meeting of a critical federal vaccine panel was a high-profile display of how the US health secretary and vaccine skeptic Robert F Kennedy Jr has injected chaos into vac"
    ],
    "image_url": "",
    "titles": [
      "RFK Jr. says U.S. will stop funding global vaccine group over 'vaccine safety' issues",
      "RFK Jr. Accuses Gavi, Global Vaccine Agency, of Ignoring Science",
      "US to stop funding global vaccine alliance Gavi, health secretary says",
      "Millions of children at risk from stalling global vaccinations, study says",
      "Vanishing Populations: Millions Are Missing From Global Census Counts",
      "Panel picked by RFK Jr. will scrutinize the vaccine schedule for kids",
      "RFK Jr.'s vaccine advisors to re-examine childhood vax schedule - Axios",
      "All childhood vaccines in question after first meeting of RFK Jr.’s vaccine panel",
      "First meeting of new CDC vaccine panel reveals policy chaos sown by RFK Jr"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.989,
      "consensus": 1.0,
      "constructiveness": 0.6,
      "proximity": 0.75
    },
    "score": 0.863,
    "summary": "The U.S. Secretary of Health and Human Services announced a reduction in funding for Gavi, the Vaccine Alliance, urging it to better consider vaccine safety science. This follows claims by Robert F. Kennedy Jr. that Gavi has disregarded vaccine safety in global immunization efforts. Kennedy's controversial vaccine panel, which includes members skeptical of vaccinations, held its first meeting amidst criticism. This occurs as the U.S. faces significant measles outbreaks, with over 1,000 cases reported. The panel's recommendations could impact the vaccination schedule for millions of children.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information about the U.S. government's stance on global immunization efforts and the potential implications of this stance. However, it does not offer insights into the validity of the concerns raised about vaccine safety, nor does it report on potential solutions or improvements to the situation."
  },
  {
    "title": "Trump Orders Airstrikes on Iranian Nuclear Sites; Ceasefire Questioned",
    "domain": "general",
    "location": "national",
    "published": "Wed, 25 Jun 2025 10:21:37 -0400",
    "source": "NPR",
    "sources": [
      "New York Times",
      "Washington Post",
      "NPR"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "Israeli Prime Minister Benjamin Netanyahu wanted to attack Iran for decades, but the U.S. and his own security chiefs deterred him. Now he's basking in the moment.",
      "President Trump had been eager to celebrate the U.S. strikes on Iran, but a new report indicates the attack set back Iran’s nuclear program by only a few months.",
      "Trump has long questioned the value of U.S. membership in NATO, an alliance he’s cast as a drain on American resources."
    ],
    "image_url": "",
    "titles": [
      "Israel was once deterred from striking Iran. Now Netanyahu takes a victory lap",
      "Intel Report on Iran Upends Victory Lap Trump Was Hoping for at NATO",
      "Trump gets a NATO victory lap, but U.S. leadership is on shaky ground"
    ],
    "score_components": {
      "magnitude": 0.99,
      "recency": 0.815,
      "consensus": 0.847,
      "constructiveness": 0.6,
      "proximity": 0.75
    },
    "score": 0.856,
    "summary": "US President Donald Trump ordered airstrikes on Iranian nuclear sites, aiming to support Israel and deter Iran's nuclear program. Despite Trump's claims of a \"devastating attack\" that greatly set back Iran's nuclear capabilities, preliminary American intelligence assessments suggest the impact was marginal, causing only a few months' delay. Amidst continued Israeli bombing, Trump announced a ceasefire agreement between Israel and Iran, which went into effect after mediation by Qatar. However, the ceasefire's effectiveness was questioned due to ongoing strikes and unclear communication. Trump i",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful context about the geopolitical dynamics between the US, Israel, and Iran. It informs readers about the recent airstrikes and their impact, and introduces the concept of a questionable ceasefire. However, it lacks a deeper analysis of the causes, implications, or potential solutions to the conflict."
  },
  {
    "title": "Ronald Acuña Jr. to Compete in Home Run Derby at Truist Park",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 25 Jun 2025 18:55:23 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "Yahoo Sports",
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Braves slugger Ronald Acuna Jr. said Wednesday he'll be competing in the Home Run Derby at Atlanta's Truist Park.",
      "<p>Atlanta&#8217;s hometown hero will be taking part in this year&#8217;s Home Run Derby.</p>",
      "Acuña previously lost to division rival Pete Alonso twice",
      "Ronald Acuña Jr. of the host Braves was announced Wednesday as the first of the eight hitters to compete in the All-Star Home Run Derby at Atlanta's Truist Park on July 14.  Acuña, who homered on the first pitch of his May 23 return to the Braves following a torn left ACL, will be in the derby for t"
    ],
    "image_url": "",
    "titles": [
      "Braves' Acuna commits to HR Derby in Atlanta",
      "Braves’ Ronald Acuna Jr. to participate in Home Run Derby",
      "2025 MLB Home Run Derby: Braves' Ronald Acuña Jr. to represent host team in third career derby",
      "Ronald Acuña Jr. of host Braves to compete in Home Run Derby on July 14 at Atlanta's Truist Park"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.974,
      "consensus": 0.935,
      "constructiveness": 0.6,
      "proximity": 0.75
    },
    "score": 0.844,
    "summary": "Ronald Acuña Jr., a key player for the Atlanta Braves, will participate in the Home Run Derby at Truist Park on July 14. This marks his return to the event, having previously competed and lost to Pete Alonso twice. Acuña's participation was confirmed on Wednesday, making him the first of eight hitters announced for this year's competition. His entry comes after a strong comeback from a torn left ACL injury earlier in the season.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story offers useful information for sports fans, detailing Ronald Acuña Jr.'s return to the Home Run Derby after an injury. It provides context about his previous performances and the nature of his comeback, but doesn't delve into broader implications or trends in the sport."
  },
  {
    "title": "Nvidia Stock Hits Record High, Analysts Eye $6 Trillion Market Cap",
    "domain": "business",
    "location": "national",
    "published": "Wed, 25 Jun 2025 20:22:07 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Financial Times",
      "Investopedia",
      "Forbes"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Nvidia closed at an all-time high as investors gain confidence that the chipmaker will power through China restrictions.",
      "An analyst from Loop Capital raised the price target for the company, suggesting Nvidia’s market cap could reach $6 trillion.",
      "Chip designer claws back market losses from Donald Trump’s trade war and DeepSeek breakthrough",
      "<figure><img alt=\"Chesnot / Getty Images Nvidia CEO Jensen Huang speaks at the VivaTech trade show in Paris on June 11, 2025\" src=\"https://www.investopedia.com/thmb/eIa4Mj-D6okogjgY_-523bTfeDw=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2219673915-a2529b799cc1442ebda"
    ],
    "image_url": "",
    "titles": [
      "Nvidia shares hit record as AI chipmaker again becomes world's most valuable company",
      "Nvidia’s Jensen Huang Becomes $5 Billion Richer As Shares Hit Record High",
      "Nvidia shares hit record high on renewed AI optimism",
      "Nvidia Stock Climbs to All-Time High Wednesday"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.923,
      "consensus": 0.935,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.838,
    "summary": "Nvidia's stock reached an all-time high as investor confidence grew, buoyed by the company's resilience against China restrictions. Loop Capital analysts have increased Nvidia's price target, suggesting its market cap could hit $6 trillion. The company has recovered from market losses incurred during Donald Trump's trade war and has made significant advancements with its DeepSeek technology. This growth trajectory is underscored by CEO Jensen Huang's presentation at the VivaTech trade show in Paris.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story clearly highlights the progress Nvidia is making in the market, with a record high stock price and a potential $6 trillion market cap. It also provides useful information about the company's resilience against China restrictions and advancements in its DeepSeek technology. This information could help readers make informed investment decisions."
  },
  {
    "title": "Bumble Lays Off 30% of Workforce, Affecting 240 Employees",
    "domain": "business",
    "location": "national",
    "published": "Wed, 25 Jun 2025 20:00:45 GMT",
    "source": "CNBC",
    "sources": [
      "TechCrunch",
      "CNBC",
      "Fortune",
      "Investopedia"
    ],
    "domains": [
      "business",
      "technology"
    ],
    "snippets": [
      "Founder Whitney Wolfe Herd, who stepped down as CEO at the beginning of 2024, returned to the role earlier this year.",
      "Dating app Bumble announced on Wednesday that it's laying off 30% of its workforce, impacting around 240 positions.",
      "The dating app company announced Wednesday it would lay off 30% of its workforce.",
      "<figure><img alt=\"Silas Stein / picture alliance via Getty Images Bumble said in a regulatory filing Wednesday that it would be laying off 240 employees\" src=\"https://www.investopedia.com/thmb/5Q-bYppPW7P3bbem3UQ8SKDRSEM=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-21",
      "<figure><img alt=\"Avishek Das / SOPA Images / LightRocket via Getty Images BlackBerry shares surged nearly 20% soon after the opening bell Wednesday, June 25, 2025\" src=\"https://www.investopedia.com/thmb/VxKHZwCcNOrB7tOFMAX5MqgOY68=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/Get"
    ],
    "image_url": "",
    "titles": [
      "Bumble jumps 25% as dating company plans to axe 30% of workforce",
      "Bumble to lay off 30% of its workforce",
      "Bumble cut 30% of its workforce—the magnitude of which JPMorgan says ‘comes as a surprise’",
      "Bumble Stock Soars as Dating App Company Announces Layoffs, Lifts Q2 Outlook",
      "BlackBerry Stock Soars on Better-Than-Expected Results, Boosted Outlook"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.916,
      "consensus": 0.985,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.819,
    "summary": "Whitney Wolfe Herd, the founder of Bumble, resumed her position as CEO earlier this year after stepping down at the start of 2024. Recently, Bumble announced it is laying off 30% of its workforce, affecting approximately 240 employees. This decision marks a significant change in the company's staffing.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "While the story does provide useful information about a significant change in Bumble's workforce, it lacks depth and insight into the reasons behind the layoffs or potential solutions. It does not offer actionable insights or deeper understanding for the reader, nor does it report on improvements or attempts to solve the problem."
  },
  {
    "title": "Shell and BP Discuss Potential £60bn Merger, Stocks React",
    "domain": "business",
    "location": "national",
    "published": "Wed, 25 Jun 2025 22:04:25 GMT",
    "source": "CNBC",
    "sources": [
      "Fortune",
      "CNBC",
      "Financial Times",
      "Investopedia"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "It is unlikely Shell would purchase the entirety of BP, people familiar with the matter told CNBC's Brian Sullivan.",
      "Chief executive Wael Sawan has been focused on improving Shell’s financial performance and share buybacks",
      "A Shell-BP deal would represent the biggest energy deal of the century—if not ever.",
      "<figure><img alt=\"Artur Widak / NurPhoto via Getty Images A deal between Shell and BP would combine two massive UK oil companies.\" src=\"https://www.investopedia.com/thmb/qmayuFRfDT-C5St7CwhqlbL2Zf8=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2206612037-2657c710addd4b"
    ],
    "image_url": "",
    "titles": [
      "BP shares rise on takeover speculation; Shell denies",
      "Shell denies takeover talks with UK rival BP",
      "Shell denies reports of BP megamerger of Big Oil rivals",
      "BP Stock Rises After Report That It's in Merger Talks With Shell"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.957,
      "consensus": 0.935,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.815,
    "summary": "Shell is in preliminary discussions with BP regarding a potential £60bn merger, which would unite two of the UK's largest oil companies, creating a firm worth over £200bn. Despite the speculation, sources close to the situation believe it's unlikely Shell will buy BP in its entirety. Shell's CEO, Wael Sawan, is currently concentrating on enhancing the company's financial health and continuing share buybacks. Following the news, BP's stock price increased, while Shell's shares experienced a decline.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about potential changes in the oil industry and the stock market's reaction. However, it doesn't report on solutions, improvements, or innovations, and it doesn't significantly deepen understanding of the industry's systems or trends."
  },
  {
    "title": "Bezos Moves Venice Wedding Party Amid Protests and Local Backlash",
    "domain": "general",
    "location": "global",
    "published": "Wed, 25 Jun 2025 19:04:30 +0000",
    "source": "Al Jazeera",
    "sources": [
      "New York Times",
      "Forbes",
      "Al Jazeera",
      "Washington Post",
      "CBC News",
      "The Guardian",
      "Business Insider"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "Amazon tycoon set to marry Lauren Sanchez in lavish Venice wedding as activists protest &#039;growing disparity&#039;.",
      "The billionaire Amazon founder Jeff Bezos is marrying Lauren Sánchez in Venice. They arrived in the city on Wednesday amid protests of their nuptials.",
      "Ivanka Trump, Diane von Furstenberg, and Jared Kushner have arrived in Venice for the multiday wedding of Jeff Bezos and Lauren Sánchez.",
      "Wedding guests have already touched down in Venice, including billionaire Barry Diller and Ivanka Trump.",
      "<img alt=\"Woman with long dark hair and bald man with sunglasses, both smiling, as they walk out of curtained area\" height=\"349\" src=\"https://i.cbc.ca/1.7570860.1750882410!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_620/people-bezos-wedding.JPG\" title=\"Amazon founder Jeff Bezos and Lauren Sa",
      "<p>People power forced a change of venue, proving that a man worth £223bn can still fall foul of ordinary folk with pool floats</p><p>There are so many questions swirling around the forthcoming wedding of Jeff Bezos to Lauren Sánchez this weekend – for instance, who in their right mind books Venice ",
      "The celebration of Jeff Bezos and Lauren Sánchez has divided a city that centuries ago set the standard for opulence.",
      "In Venice, a romantic backdrop of weddings for centuries, the marriage of Jeff Bezos and Lauren Sánchez is providing an economic windfall and stirring protest.",
      "<p>Nuptials of Amazon founder and former TV journalist to kick off on Thursday as activists continue to protest against event</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/jun/24/tell-us-are-you-getting-married-in-venice-this-weekend-italy-jeff-bezos-lauren-sanchez\">Tell us: are you "
    ],
    "image_url": "",
    "titles": [
      "Jeff Bezos arrives in Venice for wedding amid protests over inequality",
      "Photos show Jeff Bezos and Lauren Sánchez kicking off their wedding festivities in Venice",
      "Jeff Bezos and Lauren Sánchez's wedding guest list: A-listers arrive in Italy to celebrate",
      "Jeff Bezos, Lauren Sánchez And Celebrity Guests Arrive In Venice Ahead Of Wedding (Photos)",
      "Celebrities join protesters in Venice ahead of Bezos-Sanchez wedding",
      "Congrats to Jeff Bezos and Lauren Sánchez on the wedding – and to Venice for running them out of town | Emma Brockes",
      "With Bezos Wedding, Venice Braces for Love in the Time of Tech Billionaires",
      "Venice, prime wedding spot, braces for a Bezos marital extravaganza",
      "Jeff Bezos and Lauren Sánchez arrive in Venice for divisive wedding"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.899,
      "consensus": 1.0,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.81,
    "summary": "Jeff Bezos and Lauren Sánchez moved their Venice wedding party venue from the city center due to protests. Critics argue the event exemplifies the exploitation of Venice. The wedding, attracting high-profile guests like Ivanka Trump and Diane von Furstenberg, has sparked debate between its economic benefits and the backlash from locals. Despite the controversy, preparations continue, highlighting the impact of public opinion on the plans of even the wealthiest individuals.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story provides basic awareness about the event and its impact on the local community, but it doesn't offer deep insights or actionable information. The story doesn't report on solutions, improvements, or attempts to solve the problem of exploitation of Venice."
  },
  {
    "title": "Maple Leafs Announce Six-Game Pre-Season; Senators to Play in Quebec City",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 25 Jun 2025 18:39:11 GMT",
    "source": "NHL",
    "sources": [
      "Sportsnet",
      "NHL",
      "Ottawa Citizen"
    ],
    "domains": [
      "general",
      "sports"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMijAFBVV95cUxNNDdCOWlGdFU0MU5rSFNNX1ZKTXVMUzN1dVl3dEo4WUhpbnNOWW9BcU1TblJYS0pMQTdwaEo3TUFNa1JlZlRkV0ZxLWxhYnY3a2x3RnJBUWw1OFNGMnRWYm1pVzhxVGhxbEJQbG16RDJxQXAzVnRPOVZPM1pjcFJqREdROTMtSnBIck1iVA?oc=5\" target=\"_blank\">Maple Leafs Announce 2025 NHL Preseas",
      "The Ottawa Senators will only play one preseason game at the Canadian Tire Centre. Two games will be in Quebec City.",
      "<p>For the Toronto Maple Leafs, the hunt for a Stanley Cup will begin with a six-game pre-season schedule, starting on Sept. 21 against the Ottawa Senators.</p>",
      "<p>If we learned anything from free agency in 2024, it&#8217;s that a lot of the players who signed bigger contracts fell flat, while value was found elsewhere. Using that knowledge, Justin Bourne explores four steps to how the Toronto Maple Leafs should proceed this summer.</p>",
      "<a href=\"https://news.google.com/rss/articles/CBMijwFBVV95cUxOMGZGU1Y0bGdibFBZeW5RakpvVW5fVFVtOXA0SHE0emV0dGlPeGhkZXJ1MDNwS2VZSnZLTExweU92czZLbGtmcmt4aGs0UV9seVp0Rl9lcmRjSWZHalZpcDlqOVhMbm9xRjNUN0VnMDI1cTdfRVBqaHV5TkZXc3pwTHI1ZzByZ1NXZ3Q5eF9Fcw?oc=5\" target=\"_blank\">Utica Announces 2025-26 Coaching "
    ],
    "image_url": "",
    "titles": [
      "Maple Leafs Announce 2025 NHL Preseason Schedule - NHL.com",
      "Ottawa Senators announce six-game exhibiton schedule",
      "Maple Leafs announce 2025 pre-season schedule",
      "Four steps to how the Maple Leafs should approach the off-season",
      "Utica Announces 2025-26 Coaching Staff | RELEASE - NHL.com"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.891,
      "consensus": 0.897,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.784,
    "summary": "The Toronto Maple Leafs have scheduled a six-game pre-season starting September 21 against the Ottawa Senators, as part of their preparation for the 2025 NHL season. Meanwhile, the Ottawa Senators will play only one preseason game at the Canadian Tire Centre, with two additional games in Quebec City. This announcement follows observations from the 2024 free agency, suggesting that teams found value in unexpected places. The Maple Leafs' approach to the upcoming season will be informed by these insights, aiming to optimize their strategy for a successful Stanley Cup run.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful information about upcoming games and strategies for the Toronto Maple Leafs and Ottawa Senators. It offers insights into the teams' preparations for the season and the potential impact of the 2024 free agency on their strategies. However, it does not highlight any significant progress, solutions, or innovations in the sport."
  },
  {
    "title": "Micron Earnings Beat Expectations, AI Chip Demand Fuels Stock Surge",
    "domain": "business",
    "location": "national",
    "published": "Wed, 25 Jun 2025 22:04:08 GMT",
    "source": "CNBC",
    "sources": [
      "MarketWatch",
      "CNBC",
      "Investopedia"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Micron reported earnings and revenue on Wednesday that exceeded analysts' estimates.",
      "Micron Technology Inc.’s earnings results for the May quarter came in above Wall Street’s expectations Wednesday, as demand for artificial-intelligence chips boosts sales for its high-bandwidth memory chips.",
      "<figure><img alt=\"Bloomberg / Getty Images Micron Technology stock has gained over 50% in 2025 through Wednesday’s close\" src=\"https://www.investopedia.com/thmb/79GyCaq0zwrgOAFh8n7pWhDXLi8=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2189904387-9426426a3d6c498c99836ba"
    ],
    "image_url": "",
    "titles": [
      "Micron reports earnings, revenue beat and issues strong forecast",
      "Micron delivers record quarterly revenue, supporting investors’ ‘super-bullish’ outlook",
      "Micron Reports Record Revenue as Data Center Sales Surge on AI Demand"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.956,
      "consensus": 0.847,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.775,
    "summary": "Micron Technology Inc. reported earnings and revenue for the May quarter that surpassed analysts' expectations, driven by a surge in demand for artificial-intelligence chips, which increased sales of its high-bandwidth memory chips. This performance contributed to Micron's stock gaining over 50% in 2025 up to Wednesday's close.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story is constructive as it provides useful information about Micron's performance and the factors contributing to it, such as the demand for AI chips. However, it does not report on solutions, improvements, or attempts to solve problems, nor does it significantly increase awareness around systems, causes, or trends."
  },
  {
    "title": "Child Injured in Suspected Animal Attack in Quadeville, Ontario",
    "domain": "general",
    "location": "local",
    "published": "Wed, 25 Jun 2025 11:36:53 EDT",
    "source": "CBC",
    "sources": [
      "CityNews",
      "CBC",
      "Ottawa Citizen"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "<img alt=\"Yellow police tape that says &quot;O.P.P Line. Do not cross&quot;\" height=\"349\" src=\"https://i.cbc.ca/1.7570062.1750809407!/fileImage/httpImage/image.jpeg_gen/derivatives/16x9_620/police-tape.jpeg\" title=\"OPP warned residents of Quadeville to keep their children indoors or under close supe",
      "A young child was seriously injured in what police are saying is a suspected animal attack in a small rural town in the Ottawa Valley. Ontario Provincial Police officers from the Upper Ottawa Valley detachment were called to Quadeville, Ont., north of Calabogie. They arrived around 12:30 a.m. on Jun",
      "A young child was left with \"potentially life-threatening injuries\" in what police suspect was an animal attack."
    ],
    "image_url": "",
    "titles": [
      "Police suspect animal attack after girl seriously injured in Quadeville, Ont.",
      "Young child seriously injured in suspected animal attack",
      "OPP looking for witnesses, video in suspected animal attack in Quadeville"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.836,
      "consensus": 0.847,
      "constructiveness": 0.5,
      "proximity": 1.0
    },
    "score": 0.774,
    "summary": "In Quadeville, Ontario, a young child sustained potentially life-threatening injuries from a suspected animal attack. Ontario Provincial Police from the Upper Ottawa Valley detachment responded to the incident around 12:30 a.m. Residents were advised to keep children indoors or closely supervised following the event.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about a local incident, advising residents to keep children indoors or supervised. However, it lacks depth or insight into the cause of the attack, the type of animal involved, or broader trends or impacts."
  },
  {
    "title": "Salvadoran Immigrant in Maryland Ordered Released, Faces Potential ICE Custody",
    "domain": "general",
    "location": "national",
    "published": "Wed, 25 Jun 2025 16:45:03 -0400",
    "source": "NPR",
    "sources": [
      "Axios",
      "NPR",
      "Al Jazeera"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "Despite the court order, if released from prison, Kilmar Abrego Garcia is likely to be immediately taken into custody by U.S. Immigration and Customs Enforcement.",
      "<a href=\"https://news.google.com/rss/articles/CBMifEFVX3lxTFBGRTVXMWVJQk4zVGdTQ0pLMW12WDBYU3NQcTlUUDNnUjNIMlFmQ0hLTU5NWXpWR2ZUdTdZLVZnMnhOVllUX2JHTF9qUlZnMW83MVpXREZlT3Nfejlqck1ySmlCUnozZmJPYTdVY1NaRk9GUE9kdHdQUHUzdVA?oc=5\" target=\"_blank\">Abrego Garcia ordered released from prison but still faces d",
      "Lawyers for the Maryland father, a Salvadoran immigrant, fear he could face a second deportation if released."
    ],
    "image_url": "",
    "titles": [
      "A judge ordered Abrego Garcia released. His future remains uncertain",
      "Abrego Garcia ordered released from prison but still faces deportation - Axios",
      "Mistakenly deported man Kilmar Abrego Garcia to remain in jail for now"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.931,
      "consensus": 0.847,
      "constructiveness": 0.5,
      "proximity": 0.75
    },
    "score": 0.768,
    "summary": "Kilmar Abrego Garcia, a Salvadoran immigrant and Maryland father, has been ordered released from prison. However, upon release, he is likely to be taken into custody by U.S. Immigration and Customs Enforcement (ICE). His lawyers express concerns that he could face deportation again.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story raises awareness about the challenges faced by immigrants in the U.S., particularly those who have been ordered released from prison. However, it does not provide deeper insight into the broader immigration system or potential solutions to the issues it highlights."
  },
  {
    "title": "Spain's High Court Upholds Verdict Against Rubiales for Assault on Hermoso",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 25 Jun 2025 17:46:16 EST",
    "source": "ESPN",
    "sources": [
      "The Guardian",
      "ESPN"
    ],
    "domains": [
      "general",
      "sports"
    ],
    "snippets": [
      "Spain's High Court on Wednesday upheld a verdict that found former soccer federation president Luis Rubiales guilty of sexual assault for an unsolicited kiss on the lips of national team player Jenni Hermoso at the 2023 World Cup in Sydney.",
      "<p>State MP’s alleged victim spurred to action after learning politician had been appointed as families minister, court hears</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <"
    ],
    "image_url": "",
    "titles": [
      "Court upholds Rubiales' sexual assault conviction",
      "NSW MP Gareth Ward likened to ‘vampire running a blood bank’ by alleged sexual assault victim, court hears"
    ],
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.95,
      "consensus": 0.682,
      "constructiveness": 0.6,
      "proximity": 0.75
    },
    "score": 0.712,
    "summary": "Spain's High Court has confirmed the guilty verdict against former soccer federation president Luis Rubiales for sexually assaulting Jenni Hermoso with an unsolicited kiss during the 2023 World Cup in Sydney. This decision upholds the initial finding of Rubiales' actions towards the national team player as unlawful.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about a legal decision, which could contribute to readers' understanding of the justice system and the consequences of sexual assault. However, it does not report on solutions or improvements, nor does it provide a deep understanding of the systemic issues involved."
  },
  {
    "title": "Senators' Staios Faces Key Decisions Ahead of NHL Draft, Free Agency",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 25 Jun 2025 16:20:20 EDT",
    "source": "Sportsnet",
    "sources": [
      "Sportsnet",
      "Ottawa Citizen"
    ],
    "domains": [
      "general",
      "sports"
    ],
    "snippets": [
      "<p>In Ottawa, where “Steady’ Steve Staios holds the reins for a Senators’ organization that seems poised to blossom if the team is managed well this summer, the question is how aggressive will he be? </p>",
      "Steve Staios is keeping his options open as one of the busiest weeks on the National Hockey League schedule kicks into high gear. The Ottawa Senators president of hockey operations and general manager plays his cards close to his vest, but with Round 1 of the NHL draft set for Friday and free agency"
    ],
    "image_url": "https://www.sportsnet.ca/wp-content/uploads/2025/05/staios.jpg",
    "titles": [
      "Senators Notebook: How aggressive will Staios be during draft, free agency?",
      "Ottawa Senators GM Steve Staios studying roster changes as draft week heats up"
    ],
    "score_components": {
      "magnitude": 0.64,
      "recency": 0.923,
      "consensus": 0.682,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.699,
    "summary": "Steve Staios, the Ottawa Senators' president of hockey operations and general manager, is navigating a critical period for the team with the NHL draft and free agency approaching. Known as \"Steady\" Steve for his management style, Staios's decisions in the coming week are highly anticipated, as they could significantly impact the Senators' future. The organization is at a potential turning point, with the possibility to advance if managed effectively during this busy time.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "The story provides awareness about the critical period the Ottawa Senators are facing, and the potential impact of the upcoming decisions on the team's future. However, it does not provide actionable insights for the reader or report on any specific strategies or solutions."
  },
  {
    "title": "Rubrik Buys Predibase to Boost AI Capabilities for Customers",
    "domain": "business",
    "location": "national",
    "published": "Wed, 25 Jun 2025 16:28:12 GMT",
    "source": "CNBC",
    "sources": [
      "TechCrunch",
      "CNBC"
    ],
    "domains": [
      "business",
      "technology"
    ],
    "snippets": [
      "Rubrik is seeking to bolster its artificial intelligence capabilities through acquisition.",
      "Predibase helps companies train and fine-tune open source AI models, which will help Rubrik customers deploy AI agents faster."
    ],
    "image_url": "",
    "titles": [
      "Rubrik agrees to buy AI startup Predibase for over $100 million",
      "Rubrik acquires Predibase to accelerate adoption of AI agents"
    ],
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.851,
      "consensus": 0.682,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.698,
    "summary": "Rubrik, aiming to enhance its artificial intelligence (AI) features, has acquired Predibase, a company specializing in helping businesses train and refine open source AI models. This acquisition is set to enable Rubrik customers to deploy AI agents more swiftly, improving efficiency and effectiveness in their operations.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story clearly highlights progress and solutions, reporting on an acquisition intended to improve AI capabilities for customers. It provides useful information for readers interested in AI and business, and it increases understanding of trends in the tech industry."
  },
  {
    "title": "Signify to Increase Philips Hue Prices from July 1 Amid US Tariffs",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 25 Jun 2025 23:45:17 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports",
      "The Verge"
    ],
    "domains": [
      "sports",
      "technology"
    ],
    "snippets": [
      "This year's pitching market lacks a true ace, and many of the arms that are available come with questions.",
      "Signify has announced price increases for its Philips Hue smart lighting and accessories starting on July 1st due to US tariffs. As for how much the products will go up in price, that hasn’t been confirmed, but the Hue Wall Washer that was recently launched is 10 percent more expensive than its pric"
    ],
    "image_url": "",
    "titles": [
      "MLB trade deadline: With a shortage of arms and a surplus of buyers, starting pitching will be very expensive this summer",
      "Philips Hue lighting will be more expensive starting July 1st, but you can save on them now"
    ],
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.991,
      "consensus": 0.682,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.696,
    "summary": "Signify will raise prices on Philips Hue smart lighting and accessories from July 1st due to US tariffs. The exact price increase is unconfirmed, but the Hue Wall Washer, a recently launched product, is now 10 percent more expensive, indicating a potential benchmark for the price hikes. This change comes in a year where the pitching market lacks a standout ace, with many available pitchers presenting uncertainties.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the upcoming price increase for Philips Hue products, which may affect consumers' purchasing decisions. However, it doesn't provide much depth or insight into the reasons behind the price hike, beyond mentioning US tariffs, or suggest any solutions or alternatives."
  },
  {
    "title": "NASA's Perseverance Rover Analyzes Martian Rock \"Kenmore\"",
    "domain": "science",
    "location": "global",
    "published": "Wed, 25 Jun 2025 16:08:38 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org",
      "NASA"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "On June 3, NASA's Perseverance Mars rover ground down a portion of a rock surface, blew away the resulting debris, and then went to work studying its pristine interior with a suite of instruments designed to determine its mineralogic makeup and geologic origin. \"Kenmore,\" as nicknamed by the rover s",
      "In addition to drilling rock core samples, the science team has been grinding its way into rocks to make sense of the scientific evidence hiding just below the surface. On June 3, NASA’s Perseverance Mars rover ground down a portion of a rock surface, blew away the resulting debris, and then went to"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/nasas-perseverance-rov.jpg",
    "titles": [
      "NASA's Perseverance rover scours Martian rock for details",
      "NASA’s Perseverance Rover Scours Mars for Science"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.919,
      "consensus": 0.632,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.692,
    "summary": "On June 3, NASA's Perseverance Mars rover performed a detailed examination of a Martian rock named \"Kenmore.\" The rover ground down part of the rock's surface, cleared the debris, and analyzed the rock's interior with its instruments to determine its mineral composition and geologic origin. This operation is part of the rover's broader mission to study the Martian surface by drilling and grinding into rocks to uncover scientific evidence hidden beneath.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive. It provides a deeper understanding of NASA's ongoing mission on Mars, specifically the Perseverance rover's analysis of Martian rocks. The story highlights progress in space exploration and gives insights into the methods used to study the Martian surface."
  },
  {
    "title": "Google unveils Gemini CLI, an open source AI tool for terminals",
    "domain": "technology",
    "location": "global",
    "published": "Wed, 25 Jun 2025 13:00:00 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch",
      "Ars Technica"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "The new tool connects Gemini AI models to local codebases, allowing developers to make natural language requests, such as asking Gemini CLI to explain confusing sections of code, write new features, debug code, or run commands.",
      "Now, devs who prefer the terminal can get AI assistance, too."
    ],
    "image_url": "",
    "titles": [
      "Google unveils Gemini CLI, an open source AI tool for terminals",
      "Gemini CLI is a free, open source coding agent that brings AI to your terminal"
    ],
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.792,
      "consensus": 0.632,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.673,
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is very constructive as it informs about a new innovation in the field of AI. It can provide actionable insights to developers and tech enthusiasts who might use this tool. It also highlights progress in the field of AI."
  },
  {
    "title": "PWHL Drafts 48 Players; Poulin Wins Top Honors at Awards",
    "domain": "business",
    "location": "global",
    "published": "Wed, 25 Jun 2025 17:31:33 -0400",
    "source": "Forbes",
    "sources": [
      "CBC",
      "Forbes"
    ],
    "domains": [
      "business",
      "general"
    ],
    "snippets": [
      "Tuesday night in Ottawa, 48 new players were drafted into the PWHL. On Wednesday, the league handed out its annual awards, with Marie-Philip Poulin taking top honors.",
      "<img alt=\"A woman poses with several trophies in front of a backdrop that says PWHL Awards.\" height=\"349\" src=\"https://i.cbc.ca/1.7570929.1750885640!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_620/hko-pwhl-awards-20250625.JPG\" title=\"Montreal Victoire forward Marie-Philip Poulin poses with t"
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/685c4b7492c7415f6d228e22/0x0.jpg?width=960",
    "titles": [
      "Marie-Philip Poulin Is 2025 MVP As PWHL Rosters Are Reshaped At Draft",
      "Marie-Philip Poulin named PWHL's MVP as Montreal Victoire clean up at league awards"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.946,
      "consensus": 0.682,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.67,
    "summary": "On Tuesday night in Ottawa, the PWHL drafted 48 new players. Following this, the league's annual awards were held on Wednesday, where Montreal Victoire forward Marie-Philip Poulin was distinguished with top honors. A photo from the event showcases Poulin posing with several trophies at the PWHL Awards.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness about the PWHL draft and awards but lacks depth or insight. It does not provide actionable insights or deeper understanding, nor does it report on solutions or improvements. It does not increase clarity around systems, causes, trends, or impacts that matter."
  },
  {
    "title": "Misiorowski Leads Brewers to 4-2 Win Over Pirates with Stellar Debut",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 25 Jun 2025 18:55:23 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Jacob Misiorowski struck out eight and allowed two hits and two walks in five shutout innings as his Brewers defeated Skenes' Pirates 4-2.",
      "<p>Milwaukee’s Jacob Misiorowski and Pittsburgh’s Paul Skenes didn’t need to throw as many as 80 pitches to set new standards for velocity on Wednesday in the first matchup between these 23-year-old flamethrowers.</p>\n<p>Misiorowski struck out eight and allowed two hits and two walks in five shutout"
    ],
    "image_url": "",
    "titles": [
      "Misiorowski shines vs. Skenes in fiery showdown",
      "Brewers’ Misiorowski and Pirates’ Skenes bring the heat in Milwaukee win"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.974,
      "consensus": 0.632,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.668,
    "summary": "Jacob Misiorowski led the Milwaukee Brewers to a 4-2 victory over the Pittsburgh Pirates by delivering a standout performance with eight strikeouts, two hits, and two walks in five shutout innings. This game marked the first matchup between 23-year-old flamethrowers Misiorowski and Pittsburgh's Paul Skenes, both setting new velocity standards while pitching less than 80 pitches each.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "While the story offers basic awareness about the result of a baseball game and individual performances, it doesn't provide deeper insights or actionable knowledge for the reader. It does not report on broader trends, innovations, or systemic issues in the sport."
  },
  {
    "title": "Fred VanVleet Re-Signs with Rockets on $50M Deal, Option for 2026-27",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 25 Jun 2025 18:55:23 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "A 22-year-old fan has been banned indefinitely from all MLB ballparks after yelling something about Arizona Diamondbacks second baseman Ketel Marte's late mother during Tuesday night's game against the Chicago White Sox, according to a source.",
      "<p>A fan who heckled Arizona Diamondbacks second baseman Ketel Marte during a game against the Chicago White Sox at Rate Field on Tuesday night has been banned indefinitely from all major league stadiums, a person with direct knowledge of the decision told The Associated Press.</p>",
      "Manchester United are closing in on a deal for Bryan Mbeumo after a breakthrough in talks with Brentford, sources have told ESPN.",
      "Leicester midfielder Wilfred Ndidi is the subject of interest from Manchester United and Everton. Transfer Talk has the latest news, gossip and rumors.",
      "Atlético Madrid have reached a verbal agreement with Betis to sign USMNT midfielder Johnny Cardoso, sources have told ESPN."
    ],
    "image_url": "",
    "titles": [
      "Source: Fan who taunted Marte banned by MLB",
      "Report: Fan banned by MLB for heckling D-backs’ Marte about late mother",
      "Sources: Man United close in on Mbeumo deal",
      "Transfer rumors, news: Man United, Everton battle for Ndidi",
      "Sources: Atlético reach deal for USMNT's Cardoso"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.974,
      "consensus": 0.632,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.668,
    "summary": "Fred VanVleet is set to re-sign with the Houston Rockets on a two-year, $50 million contract, with a player option for the 2026-27 season. This decision comes after the Rockets chose not to pick up the final year of his existing contract, aiming for a new agreement. VanVleet, a key player for the Rockets alongside veteran Kevin Durant, will continue to support the team's young roster. In other sports news, Chelsea is nearing a deal for Borussia Dortmund's Jamie Gittens, Atlético Madrid has a verbal agreement to sign Johnny Cardoso from Betis, and Alex Bregman of the Red Sox is open to discussi",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about Fred VanVleet's re-signing with the Houston Rockets. However, it lacks depth or insight into the implications of this decision for the team or the player."
  },
  {
    "title": "Canucks Acquire Evander Kane from Oilers in Strategic Trade",
    "domain": "business",
    "location": "global",
    "published": "Wed, 25 Jun 2025 18:17:04 GMT",
    "source": "Investopedia",
    "sources": [
      "Sportsnet",
      "Investopedia"
    ],
    "domains": [
      "business",
      "sports"
    ],
    "snippets": [
      "<figure><img alt=\"Antonio Perez / Chicago Tribune / Tribune News Service via Getty Images Rising grocery prices weigh heavily on American consumers.\" src=\"https://www.investopedia.com/thmb/bUZHJHk_dV8vKXhrY5OuCTxkhwM=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-221466",
      "<p>Sportsnet’s Dan Murphy and Elliotte Friedman discuss the Vancouver Canucks’ trade for Evander Kane, how the final year of his contract could motivate him, and what’s next for the Edmonton Oilers.</p>",
      "<p>NHL insider Elliotte Friedman joins FAN Hockey Show to weigh in on the Evander Kane deal from Edmonton to Vancouver, and why he thinks it&#8217;s a case of the Canucks betting on an incredibly motivated Kane looking to have a huge contract year.</p>"
    ],
    "image_url": "https://www.investopedia.com/thmb/bUZHJHk_dV8vKXhrY5OuCTxkhwM=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2214667180-6a2aef4b66ac4c48840fbc84d8f3aacd.jpg",
    "titles": [
      "What To Expect From Friday's Inflation Report",
      "What the Canucks can expect from Kane in his contract year",
      "Canucks betting on an incredibly motivated Kane looking to have a big year"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.884,
      "consensus": 0.682,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.667,
    "summary": "The Vancouver Canucks have traded for Evander Kane from the Edmonton Oilers, as discussed by Sportsnet's Dan Murphy, Elliotte Friedman, and the FAN Hockey Show. Kane's motivation, driven by the final year of his contract, is highlighted as a significant factor in the deal. Analysts view this move as the Canucks betting on Kane's desire for a standout contract year to benefit their team.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about a strategic trade in the hockey world and the motivations behind it. However, it does not report on solutions, improvements, or attempts to solve problems, nor does it significantly increase awareness around systems, causes, or trends."
  },
  {
    "title": "IRS Workforce Shrinks by 25%, May Affect 2026 Filing Season",
    "domain": "business",
    "location": "global",
    "published": "Wed, 25 Jun 2025 21:21:28 GMT",
    "source": "Investopedia",
    "sources": [
      "Fortune",
      "Investopedia"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "<figure><img alt=\"Photo by Annabelle Gordon for The Washington Post via Getty Images With significant IRS workforce reductions, the 2026 filing season could see challenges and delays.\" src=\"https://www.investopedia.com/thmb/B54SQWe3YzPc6zUqoAPRD5YxKfs=/filters:no_upscale():max_bytes(150000):strip_ic",
      "The IRS lost one-quarter of its employees through staffing cuts, an independent watchdog reported Wednesday."
    ],
    "image_url": "https://www.investopedia.com/thmb/B54SQWe3YzPc6zUqoAPRD5YxKfs=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2203317568-9693da277fdb4fdeaae685142adcedfa.jpg",
    "titles": [
      "The 2026 Tax Season Could See Significant Delays After DOGE Cuts, Warns IRS Watchdog",
      "Trump’s budget bill and DOGE’s IRS staffing cuts could lead to a nightmare 2026 tax season, watchdog warns"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.942,
      "consensus": 0.632,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.666,
    "summary": "An independent watchdog reported that the IRS has experienced a significant reduction in its workforce, losing one-quarter of its employees. This staffing cut could lead to challenges and delays during the 2026 filing season, as highlighted in a recent report.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about potential challenges and delays in the 2026 tax filing season due to a reduction in the IRS workforce. However, it doesn't offer solutions or progress towards addressing this issue, and the depth of understanding is limited."
  },
  {
    "title": "Taylor Swift Performs at TEU, Spotted with NFL's Travis Kelce",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 25 Jun 2025 18:55:23 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Taylor Swift performs \"Shake It Off\" and walks the red carpet with Travis Kelce at Tight End University.",
      "Are you ready for it*?! *TEU"
    ],
    "image_url": "",
    "titles": [
      "🎵 Taylor Swift surprises Tight End Univ. guests",
      "Tight End University: History, purpose of program and this year's surprise Taylor Swift performance"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.974,
      "consensus": 0.632,
      "constructiveness": 0.2,
      "proximity": 0.75
    },
    "score": 0.658,
    "summary": "Taylor Swift performed her hit song \"Shake It Off\" at Tight End University (TEU) and was seen walking the red carpet alongside NFL player Travis Kelce. This event marks a public appearance of the two together, highlighting Swift's involvement in the event and her connection with Kelce.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "This story primarily focuses on celebrity gossip, offering minimal depth or insight. It does not provide actionable knowledge, report on progress or solutions, or increase clarity around systems, causes, trends, or impacts that matter."
  },
  {
    "title": "WhatsApp rolls out AI-generated summaries for private messages",
    "domain": "technology",
    "location": "global",
    "published": "2025-06-25T18:02:07-04:00",
    "source": "The Verge",
    "sources": [
      "TechCrunch",
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "WhatsApp can now call on Meta AI to summarize your personal chats. As shown in a GIF, you can access it by tapping the button to unfurl all of your unread messages in a chat. But instead of showing your messages, WhatsApp uses Meta AI to generate a bulleted summary of what you missed. The [&#8230;]",
      "Meta announced on Wednesday that it&#8217;s adding an AI-powered summaries feature to WhatsApp. The optional new feature uses Meta AI to summarize unread messages in a chat. This summary would only be visible to you, not others in your chat, the company notes. The feature builds on the AI technology"
    ],
    "image_url": "",
    "titles": [
      "WhatsApp rolls out AI-generated summaries for private messages",
      "Meta is adding AI-powered summaries to WhatsApp"
    ],
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.956,
      "consensus": 0.632,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.646,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "Without a summary or more context, it's difficult to evaluate this story. Based on the title alone, it seems to offer basic awareness about a new feature on WhatsApp, but doesn't provide depth or insight into its implications or usefulness."
  },
  {
    "title": "Federal judge sides with Meta in lawsuit over training AI models on copyrighted books",
    "domain": "technology",
    "location": "global",
    "published": "Wed, 25 Jun 2025 23:40:32 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "A federal judge sided with Meta on Wednesday in a lawsuit brought against the company by 13 book authors, including Sarah Silverman, that alleged the company had illegally trained its AI models on their copyrighted works. Federal Judge Vince Chhabria issued a summary judgment — meaning the judge was"
    ],
    "image_url": "",
    "titles": [
      "Federal judge sides with Meta in lawsuit over training AI models on copyrighted books"
    ],
    "score_components": {
      "magnitude": 0.149,
      "recency": 0.989,
      "consensus": 0.393,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.468,
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story is constructive as it provides useful information about a legal decision related to AI and copyright. It increases awareness about the legal implications of AI training and the use of copyrighted material."
  },
  {
    "title": "Anthropic now lets you make apps right from its Claude AI chatbot",
    "domain": "technology",
    "location": "global",
    "published": "2025-06-25T18:33:29-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Anthropic is adding a new feature to its Claude AI chatbot that lets you build AI-powered apps right inside the app. The upgrade, launching in beta, builds upon Anthropic’s Artifacts feature introduced last year that lets you see and interact with what you ask Claude to make. “Start building in the "
    ],
    "image_url": "",
    "titles": [
      "Anthropic now lets you make apps right from its Claude AI chatbot"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.966,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.452,
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it reports on a new solution for app development. It provides useful information for app developers and increases awareness about the possibilities of AI in app development."
  },
  {
    "title": "Brad Feld on “Give First” and the art of mentorship (at any age)",
    "domain": "technology",
    "location": "global",
    "published": "Wed, 25 Jun 2025 23:31:20 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Brad Feld has spent decades operating by a simple principle: give without expecting anything in return. This philosophy goes beyond traditional pay-it-forward thinking, he says. It&#8217;s about helping others, knowing only that meaningful connections and opportunities will emerge organically over t"
    ],
    "image_url": "",
    "titles": [
      "Brad Feld on “Give First” and the art of mentorship (at any age)"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.986,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.449,
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it provides actionable insights on mentorship and the concept of 'Give First'. It empowers readers with knowledge that can be applied in their personal and professional lives."
  },
  {
    "title": "Texas A&M AgriLife Boosts Dairy Farms with Automation Tech",
    "domain": "science",
    "location": "global",
    "published": "Wed, 25 Jun 2025 16:56:05 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "As the dairy industry increasingly adopts automation with the use of sensors and robotics, researchers at Texas A&amp;M AgriLife are helping producers harness this evolving technology to help optimize production and improve the health and well-being of dairy cattle."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/research-advances-prec.jpg",
    "titles": [
      "Research advances precision dairy care with AI-powered tools"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.934,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.446,
    "summary": "Researchers at Texas A&M AgriLife are aiding dairy producers in integrating advanced automation technologies, such as sensors and robotics, into their operations. This initiative aims to enhance production efficiency and promote the health and well-being of dairy cattle. The adoption of these technologies represents a significant shift towards modernizing dairy farming practices.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it reports on improvements and innovations in the dairy farming industry. It provides actionable insights to dairy producers about the benefits of integrating advanced automation technologies into their operations. It also promotes a deeper understanding of how these technologies can enhance production efficiency and animal welfare."
  },
  {
    "title": "Looking at Framework’s progress on software support for its repairable laptops",
    "domain": "technology",
    "location": "global",
    "published": "Wed, 25 Jun 2025 20:12:30 +0000",
    "source": "Ars Technica",
    "sources": [
      "Ars Technica"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Framework's laptops used to go years without new drivers or security patches."
    ],
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/06/IMG_2928-1152x648.jpeg",
    "titles": [
      "Looking at Framework’s progress on software support for its repairable laptops"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.92,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.443,
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it reports on the progress of Framework's software support for its repairable laptops. It provides insights into how the company is innovating and attempting to solve problems, contributing to the reader's understanding of the tech industry."
  },
  {
    "title": "Research Suggests Sustainable Pub Crawls Can Boost Community and Business",
    "domain": "science",
    "location": "global",
    "published": "Wed, 25 Jun 2025 16:58:04 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Pubs could safeguard their future by creating more collaborative and sustainable pub crawls, according to research by the University of York."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/pub.jpg",
    "titles": [
      "A creative, collaborative and sustainable approach to pub crawls could safeguard the British tradition"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.935,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.436,
    "summary": "Research from the University of York suggests that pubs can secure their future by organizing more collaborative and sustainable pub crawls. This approach aims to foster community engagement and promote responsible drinking, offering a strategic method for pubs to attract customers while contributing positively to their local areas.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it offers actionable insights for pubs looking to attract customers and contribute positively to their communities. It increases awareness of a potentially beneficial strategy (sustainable pub crawls), but doesn't go into great detail about how to implement such a strategy or its potential impacts."
  },
  {
    "title": "75% of Global Glaciers Risk Disappearing, Study Warns",
    "domain": "science",
    "location": "global",
    "published": "Wed, 25 Jun 2025 22:30:09 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/glacier-countdown-begins-75-could-vanish-even-if-warming-stops/\" rel=\"nofollow\" title=\"Glacier Countdown Begins: 75% Could Vanish Even If Warming Stops\"><img alt=\"Shallap glacier in Peru\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"499\" src=\"https://scitech"
    ],
    "image_url": "",
    "titles": [
      "Glacier Countdown Begins: 75% Could Vanish Even If Warming Stops"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.965,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.435,
    "summary": "A study reported by SciTechDaily finds that 75% of the world's glaciers could disappear, even if global warming halts immediately. The research highlights the urgent need for climate action to preserve the remaining glaciers, which are crucial for the water supply of billions of people. This conclusion underscores the long-term impact of current warming trends on global ice masses.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful information about the potential loss of global glaciers due to climate change. It increases awareness about the urgent need for climate action and the long-term impacts of current warming trends on global ice masses. However, it doesn't provide specific solutions or progress towards mitigating these effects."
  },
  {
    "title": "Volcanoes May Release Gold from Earth's Core, Study Finds",
    "domain": "science",
    "location": "global",
    "published": "Wed, 25 Jun 2025 22:05:54 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/volcanoes-may-be-spewing-gold-from-earths-molten-heart/\" rel=\"nofollow\" title=\"Volcanoes May Be Spewing Gold From Earth’s Molten Heart\"><img alt=\"North Vent Lava Fountain\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images"
    ],
    "image_url": "",
    "titles": [
      "Volcanoes May Be Spewing Gold From Earth’s Molten Heart"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.957,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.433,
    "summary": "Recent research suggests that volcanoes could be releasing gold from the Earth's core. This process involves the melting and movement of the Earth's mantle, where gold and other precious metals are carried to the surface by volcanic activity. The findings offer insights into the distribution of gold and its accessibility on the planet's surface.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The story provides useful scientific information about how gold and other precious metals are distributed on Earth, enhancing our understanding of natural processes. However, it doesn't explicitly report on solutions, improvements, or attempts to solve problems."
  },
  {
    "title": "Getty drops key copyright claims against Stability AI, but UK lawsuit continues",
    "domain": "technology",
    "location": "global",
    "published": "Wed, 25 Jun 2025 16:34:35 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Getty Images dropped its primary claims of copyright infringement against Stability AI on Wednesday at London’s High Court, narrowing one of the most closely watched legal fights over how AI companies use copyrighted content to train their models."
    ],
    "image_url": "",
    "titles": [
      "Getty drops key copyright claims against Stability AI, but UK lawsuit continues"
    ],
    "score_components": {
      "magnitude": 0.149,
      "recency": 0.853,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.431,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful context about an ongoing legal issue involving copyright claims in the tech industry. However, it doesn't seem to offer solutions or progress, and its usefulness may be limited to those specifically interested in this case."
  },
  {
    "title": "Surge in Wildfires Sparks Urgent Climate Study Needs",
    "domain": "science",
    "location": "global",
    "published": "Wed, 25 Jun 2025 18:10:01 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Understanding how wildfires influence our planet's climate is a daunting challenge. Although fire occurs nearly everywhere on Earth and has always been present, it is still one of the least understood components of the Earth system. Recently, unprecedented fire activity has been observed in boreal ("
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2021/fire.jpg",
    "titles": [
      "How high-latitude peat and forest fires could shape the future of Earth's climate"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.958,
      "consensus": 0.393,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.423,
    "summary": "Recent studies highlight the significant, yet poorly understood, impact of wildfires on Earth's climate. Despite fire's ubiquitous presence on the planet, it remains one of the least studied aspects of the Earth system. Notably, there has been a surge in unprecedented fire activity in boreal regions, indicating a potentially changing pattern in wildfire behavior and its effects on the climate. The current status underscores the need for further research to comprehend the full implications of wildfires on global climate dynamics.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story is informative and increases awareness about the significant yet poorly understood impact of wildfires on Earth's climate. It highlights the need for further research, indicating an attempt to solve the problem. However, it does not provide direct solutions or specific progress in understanding or mitigating the effects of wildfires."
  },
  {
    "title": "Is DOGE doomed to fail? Some experts are ready to call it.",
    "domain": "technology",
    "location": "global",
    "published": "Wed, 25 Jun 2025 20:40:12 +0000",
    "source": "Ars Technica",
    "sources": [
      "Ars Technica"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Trump wants $45M to continue DOGE’s work. Critics warn costs already too high."
    ],
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/06/GettyImages-2200068751-1152x648-1750879720.jpg",
    "titles": [
      "Is DOGE doomed to fail? Some experts are ready to call it."
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.929,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.415,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the potential future of DOGE, contributing to readers' understanding and decision-making about cryptocurrency investments. However, it doesn't seem to offer solutions or progress, hence the score."
  },
  {
    "title": "ICE Detention Centers Face Overcrowding, Delayed Care: Records",
    "domain": "science",
    "location": "global",
    "published": "Wed, 25 Jun 2025 21:21:09 +0000",
    "source": "Wired",
    "sources": [
      "Wired"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Records of hundreds of emergency calls from ICE detention centers obtained by WIRED—including audio recordings—show a system inundated by life-threatening incidents, delayed treatment, and overcrowding."
    ],
    "image_url": "https://media.wired.com/photos/6849d15a048bdf1148d68d32/master/pass/061125-ice-detention-centre-911-calls.jpg",
    "titles": [
      "‘They're Not Breathing’: Inside the Chaos of ICE Detention Center 911 Calls"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.942,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.41,
    "summary": "Documents and audio recordings of emergency calls from ICE detention centers, reviewed by WIRED, reveal a system struggling with life-threatening situations, delayed medical treatment, and issues of overcrowding. These records highlight significant challenges within the detention centers' operations.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story raises awareness about significant issues within ICE detention centers, providing valuable information about the system's challenges. However, it doesn't provide actionable insights or report on attempts to solve these problems."
  },
  {
    "title": "New Bat Viruses Similar to Nipah Found, Pose Human Risk",
    "domain": "science",
    "location": "global",
    "published": "Wed, 25 Jun 2025 10:47:25 EDT",
    "source": "ScienceDaily",
    "sources": [
      "ScienceDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Two newly discovered viruses lurking in bats are dangerously similar to Nipah and Hendra, both of which have caused deadly outbreaks in humans. Found in fruit bats near villages, these viruses may spread through urine-contaminated fruit, raising serious concerns. And that’s just the start—scientists"
    ],
    "image_url": "",
    "titles": [
      "New viruses discovered in bats in China could be the next pandemic threat"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.822,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.386,
    "summary": "Scientists have identified two new viruses in fruit bats that closely resemble the deadly Nipah and Hendra viruses, which have previously caused fatal outbreaks in humans. These viruses, discovered near human villages, pose a risk of spreading to humans through fruit contaminated with bat urine. This finding raises significant health concerns regarding potential future outbreaks.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story increases awareness about potential health risks from newly discovered bat viruses. It provides useful information about the potential for future outbreaks. However, it does not offer actionable insights or discuss any solutions to the problem, making it less constructive."
  }
]