[
  {
    "title": "UN Reinstates Sanctions on Iran Over Nuclear Deal Failures",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sun, 28 Sep 2025 01:29:33 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "The Guardian",
      "ABC News"
    ],
    "domains": [
      "abcnews.go.com",
      "www.npr.org",
      "www.theguardian.com"
    ],
    "snippets": [
      "The United Nations reimposed sanctions on Iran early Sunday over its nuclear program, further squeezing the Islamic Republic as its people increasingly find themselves priced out of the food they need to survive and worried about their futures.",
      "The United Nations has reimposed sanctions on Iran over its nuclear program",
      "<p>Sanctions bar dealings related to Tehran’s nuclear and ballistic missiles program and are also expected to have wider effects on its troubled economy</p><p>Widespread UN sanctions against Iran have come back into force for the first time in a decade, after last-ditch nuclear talks with western po"
    ],
    "image_url": "",
    "titles": [
      "UN imposes 'snapback' sanctions on a hungrier, poorer and more anxious Iran",
      "UN imposes 'snapback' sanctions on Iran over its nuclear program",
      "Sweeping UN sanctions on Iran come into effect after nuclear talks fail"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.946,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.758,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The UN has reinstated sanctions on Iran for the first time in a decade after Tehran failed to meet the deadline set by European powers regarding the nuclear deal, JCPOA. These sanctions, targeting Iran's nuclear and ballistic missiles program, are anticipated to broadly impact its already struggling economy.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Portland Officials Oppose Trump's National Guard Deployment Order",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sat, 27 Sep 2025 20:32:44 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Deutsche Welle",
      "The Guardian",
      "Axios"
    ],
    "domains": [
      "www.dw.com",
      "news.google.com",
      "www.aljazeera.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "The city&#039;s Democratic mayor says there is no need for the US president to send federal forces.",
      "US President Donald Trump claimed that Antifa is waging \"war\" on the famously progressive city. Portland's mayor has rejected these claims.",
      "<a href=\"https://news.google.com/rss/articles/CBMic0FVX3lxTE5PWU9Wdzh0Vmo1QlBWYjhpaTdpU2dFeV9ZcFVUVFN0SXl2SnhVOHlDTUNjdGV6YnVqQ20xQWVzdmpIZlo2ZGkwdUFib3ZHMGNXSXoyaWJIdjZuVmZ0cXg1QWN3VGdNd0UzRlN3NUJFMElTVFk?oc=5\" target=\"_blank\">Trump directs troops to Portland with \"full force\" directive</a>&nbsp;&n",
      "<p>Apparently misled by hyperbolic reporting from conservative outlets on a single small protest, president described peaceful city as ‘war ravaged’</p><p>Donald Trump said on Saturday he is deploying troops to Portland, Oregon, “authorizing Full Force, if necessary”, ignoring pleas from local offic"
    ],
    "image_url": "",
    "titles": [
      "Trump orders deployment of troops to US city of Portland and ICE facilities",
      "Trump sends troops to Portland over 'domestic terrorists'",
      "Trump directs troops to Portland with \"full force\" directive - Axios",
      "Donald Trump says he is deploying troops to Portland, Oregon"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.785,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.753,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Portland officials, including the city's Democratic mayor, have opposed President Donald Trump's order to deploy the National Guard to Portland, Oregon. They argue that there is no need for military troops in the city. This response comes after Trump's authorization for the deployment, emphasizing the use of \"full force, if necessary.\"",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "England Wins Third Women's Rugby World Cup, Defeating Canada 33-13",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 27 Sep 2025 20:59:18 GMT",
    "source": "BBC",
    "sources": [
      "CityNews",
      "Sky Sports",
      "Sportsnet",
      "BBC"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "www.sportsnet.ca",
      "www.skysports.com",
      "www.bbc.com"
    ],
    "snippets": [
      "By beating Canada in front of a world record crowd at Twickenham, England put to bed the ghost of the 2022 Women's World Cup final.",
      "In 2017 and 2022 England's Red Roses suffered crushing Rugby World Cup final defeats. On Saturday, they banished those demons to clinch final success over Canada.",
      "<p>England finally has a Women&#8217;s Rugby World Cup title to confirm its world domination after outclassing Canada 33-13 in front of a record crowd at Twickenham on Saturday.</p>",
      "England finally has a Women&#8217;s&#160;Rugby&#160;World Cup title to confirm its world domination after outclassing Canada 33-13 in front of a record crowd at Twickenham on Saturday. Victory by five tries to three capped an astonishing World Cup cycle in which England won every match, 33 in a row,"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/19e9/live/0fb030b0-9be0-11f0-92db-77261a15b9d2.jpg",
    "titles": [
      "England's Red Roses have World Cup glory - and it will 'change their lives'",
      "How England's Red Roses banished Rugby World Cup final demons",
      "Canada drops Women’s Rugby World Cup final against England",
      "Canada loses Women’s Rugby World Cup final 33-13 to England"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.776,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.744,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "England won their third Women's Rugby World Cup title by defeating Canada 33-13 at Twickenham, in front of a record crowd of 81,885. Ellie Kildunne stood out in a game that marked England's dominance in women's rugby, completing a perfect World Cup cycle with 33 consecutive wins. This victory cements England's status as a powerhouse in the sport.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Cleveland Guardians Clinch Playoff Spot After Historic Comeback",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sat, 27 Sep 2025 23:07:25 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet",
      "CBS Sports"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "The Guardians clinched a playoff berth Saturday night after CJ Kayfus was hit by a pitch with the bases loaded in the ninth inning.",
      "For the seventh time in 10 seasons, Cleveland heads to the postseason",
      "<p>It took 161 games, but we finally know the six teams that will battle it out in the American League playoffs.</p>",
      "<p>Watch as Cleveland Guardians&#8217; C.J. Kayfus is hit by a pitch with the bases loaded, resulting in his team becoming the final American League squad to clinch a post-season spot. </p>"
    ],
    "image_url": "",
    "titles": [
      "Guardians clinch playoff berth on walk-off HBP",
      "Guardians clinch MLB playoff spot on walk-off hit-by-pitch in pursuit of AL Central, record-breaking comeback",
      "Guardians walk off Rangers on HBP to become final AL playoff team to clinch",
      "Guardians clinch post-season berth on walk-off hit-by-pitch"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.9,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.742,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Cleveland Guardians secured a playoff spot for the seventh time in ten seasons after a win clinched by CJ Kayfus getting hit by a pitch with bases loaded in the ninth inning. This achievement comes after a significant mid-season turnaround, overcoming a 10-game losing streak in July. The Guardians' entry into the postseason was confirmed in their 161st game, marking one of the biggest comebacks in baseball history.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Carlos Ulberg Wins First UFC Main Event in Perth, Eyes Title Shot",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sun, 28 Sep 2025 04:40:08 +0000",
    "source": "CBS Sports",
    "sources": [
      "Yahoo Sports",
      "Sportsnet",
      "CBS Sports"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.cbssports.com",
      "www.mmamania.com"
    ],
    "snippets": [
      "The native of New Zealand made it look easy on Saturday night in Australia",
      "Ulberg or Reyes can make a serious statement the week before UFC 320: Magomed Ankalaev vs. Alex Pereira 2",
      "Last night (Sat., Sept. 27, 2025), Ultimate Fighting Championship (UFC) ventured forth to RAC Arena in Perth, Australia for UFC Perth. Though the card suffered three late cancellations — including the removal of BOTH Tafa brothers! — 12 bouts still went down “Down Under.” The main event between Domi",
      "<p>Carlos Ulberg made a massive statement in his first UFC main event spotlight and moved one step closer to a title shot.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/28/f1128b6d-3dca-483a-92dc-a1ab66fa7b30/carlos-ulberg-reyes-ko.jpg",
    "titles": [
      "UFC Fight Night results, highlights: Carlos Ulberg blasts Dominick Reyes for first-round KO, wants title shot",
      "UFC Fight Night prediction -- Carlos Ulberg vs. Dominick Reyes: Fight card, start time, odds, live stream",
      "UFC Perth results: Sooo … About last night | Reyes vs. Ulberg",
      "Carlos Ulberg knocks out Dominick Reyes at UFC Perth to inch closer to title"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.93,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.73,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Carlos Ulberg, a fighter from New Zealand, secured a significant victory in his first UFC main event on September 27, 2025, at UFC Perth, Australia. Despite the event experiencing three late cancellations, including both Tafa brothers, Ulberg's performance stood out across the 12 bouts that took place. His win has positioned him closer to a title shot in the UFC.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UK Backs £1.5bn Loan for JLR to Recover from Cyber-Attack, Restart Production",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 28 Sep 2025 07:26:49 GMT",
    "source": "BBC",
    "sources": [
      "Financial Times",
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.ft.com",
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Ministers hope the loan, from a commercial bank and underwritten by the government, will give certainty to suppliers.",
      "Government says guarantee from UK Export Finance will protect the automotive supply chain",
      "<p>Britain’s largest automotive employer plans to restart engine manufacturing in early October, report says</p><p>The government has said it will underwrite a £1.5bn loan guarantee to Jaguar Land Rover (JLR) as the carmaker battles the consequences of a recent cyber-attack.</p><p>JLR had to suspend"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/1505/live/303c0ab0-9be6-11f0-bddd-5f1abb8b5445.jpg",
    "titles": [
      "Government to guarantee £1.5bn loan to Jaguar Land Rover after cyber shutdown",
      "Jaguar Land Rover wins £1.5bn UK loan support after cyber attack",
      "UK government will underwrite £1.5bn loan guarantee to Jaguar Land Rover after cyber-attack"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.965,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.73,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The UK government has underwritten a £1.5bn loan guarantee to Jaguar Land Rover (JLR), Britain's largest automotive employer, to help it recover from a cyber-attack and restart engine manufacturing in early October. This move, involving a loan from a commercial bank backed by UK Export Finance, aims to protect the automotive supply chain and provide certainty to suppliers.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Europe Nears Ryder Cup Victory with Record Lead Over US",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sat, 27 Sep 2025 18:53:55 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet",
      "The Guardian"
    ],
    "domains": [
      "www.espn.com",
      "www.theguardian.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Europe is on the verge of retaining the Ryder Cup after a dominant Saturday left it just 2.5 points from victory over the United States at Bethpage Black.",
      "<ul><li><p>Europe maintain dominance as insults fly from crowd</p></li><li><p>Rory McIlroy calls abuse ‘really, really challenging’</p></li></ul><p>Quite incredibly, this managed to be an even uglier day for the United States of America off the golf course than it was on it. Never in his wildest of ",
      "<p>On an &#8220;intense&#8217; Day 2 at the Ryder Cup, Rory McIlroy helped lead the European side to an 11.5-4.5 advantage. </p>\n<p>And if history tells us anything, that’s an insurmountable lead.</p>"
    ],
    "image_url": "",
    "titles": [
      "Europe holds historic lead, on brink of Ryder Cup",
      "Europe seize high ground and 11½-4½ lead over USA into Ryder Cup singles",
      "McIlroy helps Europe take commanding lead after ‘intense’ Day 2 at Ryder Cup"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.825,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.727,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Europe is on the verge of retaining the Ryder Cup after taking a record seven-point lead over the United States at Bethpage Black, despite facing a barrage of insults from the crowd. Rory McIlroy described the abuse as \"really, really challenging.\" Europe needs just 2.5 points to secure victory, following a dominant performance on Saturday. President Donald Trump did not attend the event.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "McIlroy, Lowry Endure Fan Abuse, Lead Europe to Ryder Cup Victory",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 28 Sep 2025 01:23:32 GMT",
    "source": "BBC",
    "sources": [
      "Yahoo Sports",
      "Sportsnet",
      "BBC"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.bbc.com"
    ],
    "snippets": [
      "After facing abuse from American fans which \"crossed the line\", Rory McIlroy and Shane Lowry lead Europe towards a rare Ryder Cup away win.",
      "After facing abuse from American fans which &quot;crossed the line&quot;, Rory McIlroy and Shane Lowry lead Europe towards a rare Ryder Cup away win.",
      "<p>Rory McIlroy backed away from the ball, turned around and told a group of heckling fans to sShut the (expletive) up!” Then, he stepped up to his shot and did the work himself.</p>"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/509b/live/d25f81e0-9bf6-11f0-be96-85c61452c8b2.jpg",
    "titles": [
      "Europeans silence jeering US crowd with famous Ryder Cup display",
      "McIlroy & Lowry silence New York crowd on famous European day",
      "Fiery Rory McIlroy colourfully tells New York crowd to shut up"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.851,
      "consensus": 0.769,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.702,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Rory McIlroy and Shane Lowry faced abuse from American fans during the Ryder Cup, with incidents crossing the line of sportsmanship. Despite the hostile environment, they led Europe towards a rare away victory. McIlroy notably confronted hecklers directly, demanding silence before taking his shot.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "36 Killed in Stampede at Vijay's Rally in Tamil Nadu, Toll May Rise",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sat, 27 Sep 2025 19:22:07 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Deutsche Welle",
      "Washington Post"
    ],
    "domains": [
      "www.dw.com",
      "www.washingtonpost.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Vijay, a well-known actor who goes by only one name, launched a political party last year.",
      "At least 36 people were killed in a stampede at a campaign rally for the popular Tamil actor-turned-politician, officials said.",
      "At least 36 people were killed and dozens injured in a stampede Saturday at a political rally in India for a popular actor-turned-politician, authorities said."
    ],
    "image_url": "",
    "titles": [
      "At least 39 killed in crowd crush at Indian actor-politician Vijay’s rally",
      "India: Dozens killed at rally for actor-politician Vijay",
      "At least 36 killed at Indian actor’s political rally"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.766,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.69,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "At least 36 people were killed in a stampede during a campaign rally for actor-turned-politician Vijay in Tamil Nadu, India. The event drew tens of thousands of supporters. Health officials warn the death toll may increase.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Canadiens Beat Maple Leafs 4-2 in NHL Pre-Season Game",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sun, 28 Sep 2025 01:51:13 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "Sportsnet"
    ],
    "domains": [
      "globalnews.ca",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Riley Kidney and Lane Hutson each scored power-play goals in the second period and the visiting Montreal Canadiens defeated the Toronto Maple Leafs 4-2 in NHL pre-season action on Saturday.",
      "<p>Designated for a new role this season, Alex Newhook looked the part Saturday in a win over the Maple Leafs. </p>\n<p>If he can replicate that type of effort in the regular season, it will go a long way for the Canadiens. </p>"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/aeec906f82173b3430671e411a85bb59a73cc9d1f9e595f4a22c0d3f9ab6e395.jpg?quality=65&strip=all",
    "titles": [
      "Canadiens use power play to beat Leafs",
      "Newhook shines in new role to help Canadiens beat Maple Leafs"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.877,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.68,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Riley Kidney and Lane Hutson scored power-play goals in the second period, leading the Montreal Canadiens to a 4-2 victory over the Toronto Maple Leafs in an NHL pre-season game. Alex Newhook, in a new role for the Canadiens, also impressed during the match. The outcome highlights potential strengths for Montreal as they prepare for the regular season.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "36 Dead, 50+ Injured in Stampede at Vijay's Tamil Nadu Rally",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sun, 28 Sep 2025 02:39:53 -0400",
    "source": "NPR",
    "sources": [
      "New York Times",
      "NPR"
    ],
    "domains": [
      "www.npr.org",
      "www.nytimes.com"
    ],
    "snippets": [
      "A stampede at a rally for a popular Indian actor and politician in the southern state of Tamil Nadu killed at least 36 people and injured 40 others.",
      "The stampede took place at an event for Joseph Vijay Chandrasekhar, the popular actor known professionally as Vijay. A health official said the toll was likely to rise."
    ],
    "image_url": "",
    "titles": [
      "Stampede at a political rally for popular actor Vijay in southern India kills 36, injures 40",
      "Stampede at Actor’s Political Rally Kills at Least 36 in India"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.969,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.674,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "At least 36 people were killed and over 50 injured in a stampede at a campaign rally in Tamil Nadu, India, for actor-turned-politician Joseph Vijay Chandrasekhar, known as Vijay. The tragic event occurred during a large gathering, which included children among the victims. Health officials have indicated that the death toll may rise.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "US to Revoke Colombian President's Visa Over Incitement Claims",
    "domain": "general",
    "source_domain": "www.washingtonpost.com",
    "location": "global",
    "published": "Sat, 27 Sep 2025 10:06:23 +0000",
    "source": "Washington Post",
    "sources": [
      "New York Times",
      "The Guardian",
      "Washington Post"
    ],
    "domains": [
      "www.washingtonpost.com",
      "www.nytimes.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "The State Department accused Petro of urging U.S. soldiers to disobey orders in remarks at a pro-Palestinian rally in New York.",
      "The State Department called President Gustavo Petro of Colombia reckless after he called for U.S. soldiers to disobey President Trump at a pro-Palestinian rally.",
      "<p>State department said it would revoke Petro’s visa after he joined a pro-Palestinian rally in New York, where he called for US soldiers to ‘disobey’ Trump</p><p>The Colombian president, <a href=\"https://www.theguardian.com/profile/gustavo-petro\">Gustavo Petro</a>, has dismissed the US decision to"
    ],
    "image_url": "",
    "titles": [
      "State Department revokes visa for Colombian President Gustavo Petro",
      "U.S. Says It Will Revoke Colombian President’s Visa",
      "‘I don’t care’: Colombia president Petro hits back after US revokes his visa"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.632,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.67,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The US State Department announced it will revoke the visa of Colombian President Gustavo Petro after he encouraged US soldiers to disobey orders during a pro-Palestinian protest in New York. Petro, who was in the city for the UN General Assembly, criticized Trump and opposed Israel's actions in Gaza. His comments were deemed by the US as incitement to violence.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Russia Escalates Attacks on Ukraine, Violates NATO Airspace",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 28 Sep 2025 07:12:34 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "As well as intensifying attacks against Ukraine, Russia is also accused of violating the airspace of several Nato countries.",
      "<p>Twelve-year-old girl among those killed in massive Russian drone and missile bombardment on Kyiv</p><p>Welcome back to our live coverage of Russia’s war on <a href=\"https://www.theguardian.com/world/ukraine\">Ukraine</a>.</p><p><strong>Kyiv</strong> came under heavy bombardment early on Sunday in "
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/4f2c/live/f7147c40-9c35-11f0-92db-77261a15b9d2.jpg",
    "titles": [
      "Kyiv hit by 'massive' Russian attack, mayor says",
      "At least four killed in Kyiv after massive Russian drone and missile attack – Ukraine war live"
    ],
    "score_components": {
      "magnitude": 0.795,
      "recency": 0.96,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.668,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Russia has intensified its attacks on Ukraine, including a heavy bombardment on Kyiv, resulting in casualties including a 12-year-old girl. Additionally, Russia is accused of violating the airspace of several NATO countries.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Blue Jays Beat Rays 5-1, Clement Scores Twice, Yesavage Pitches Shutout",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sat, 27 Sep 2025 21:43:05 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "Sportsnet"
    ],
    "domains": [
      "globalnews.ca",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Ernie Clement scored twice and drove in two runs while rookie starter Trey Yesavage threw five shutout innings as the Toronto Blue Jays defeated the Tampa Bay Rays 5-1 on Saturday afternoon.",
      "<p>Alejandro Kirk hit a solo shot, Trey Yesavage struck out five through five scoreless innings, and the Toronto Blue Jays took a 5-1 win over the Tampa Bay Rays.</p>",
      "<p>Aaron Judge, Giancarlo Stanton and Ryan McMahon all belted home runs as the New York Yankees sailed to a 6-1 victory over the Baltimore Orioles. Cam Schlittler earned the win on the mound, striking out nine over seven innings of work.</p>",
      "<p>Jahmai Jones drove in both of his team&#8217;s runs on two hits to lead the Detroit Tigers to a 2-1 win over the Boston Red Sox – clinching a playoff berth in the process. Despite the loss, rookie Connelly Early struck out seven over five innings of work.</p>",
      "<p>Pete Alonso picked up his 38th home run of the season and blasted an RBI double to lead the New York Mets to a 5-0 victory over the Miami Marlins. Clay Holmes tossed six innings of one-hit ball to earn his 12th win on the year. </p>"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/cb5558399663a5e2770ee6f5aa1407e6ce43cf1c990bc61c3c5b33a944f3b252.jpg?quality=65&strip=all",
    "titles": [
      "Clement leads the way as Blue Jays top Rays 5-1",
      "MLB Highlights: Blue Jays 5, Rays 1",
      "MLB Highlights: Yankees 6, Orioles 1",
      "MLB Highlights: Tigers 2, Red Sox 1",
      "MLB Highlights: Mets 5, Marlins 0"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.805,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.666,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Ernie Clement scored twice and had two RBIs, and Trey Yesavage pitched five shutout innings, leading the Toronto Blue Jays to a 5-1 victory over the Tampa Bay Rays on Saturday. Clement's performance included a two-run double, and Andres Gimenez added an RBI single in the second inning to secure the win for the Blue Jays.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Drones Spotted Over Danish Military Sites; Security Investigating",
    "domain": "business",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-09-27T10:04:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "Financial Post",
      "Fortune"
    ],
    "domains": [
      "www.dw.com",
      "fortune.com",
      "financialpost.com"
    ],
    "snippets": [
      "Danish security authorities said drones were seen over the country's biggest military base overnight.",
      "In neighboring Germany, several drones were reported in the northern German state of Schleswig-Holstein, which borders Denmark, from Thursday into Friday night.",
      "BERLIN (AP) &#8212; The Danish defense ministry said Saturday that &#8220;drones have been observed at several of Danish defense facilities.&#8221; The new drone sightings overnight Friday into Saturday come after there were several drone sightings in the Nordic country earlier this week, with some "
    ],
    "image_url": "",
    "titles": [
      "Denmark: New drone sightings over military infrastructure",
      "Denmark reports drone sightings at military facilities as NATO warns Russia about violating airspace",
      "Denmark reports new drone sightings at military facilities"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.631,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.663,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Unidentified drones were observed flying over several Danish military sites, including the country's largest base, Karup airbase, on Friday night. Danish security authorities are investigating the incidents, which they have described as part of a \"hybrid attack.\" The current status of the investigation remains ongoing.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Lavrov: Russia Won't Attack Europe but Will Respond to Aggression",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sun, 28 Sep 2025 07:27:47 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Global News"
    ],
    "domains": [
      "globalnews.ca",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Russia&#039;s FM warned NATO at the UNGA that any aggression against Russia would be met with a &#039;decisive response&#039;.",
      "The Russian foreign minister made the comment in an address to the United Nations General Assembly on Saturday.",
      "Russian Foreign Minister Sergey Lavrov spoke at the U.N. General Assembly after weeks in which unauthorized flights into NATO’s airspace have raised alarm around Europe."
    ],
    "image_url": "",
    "titles": [
      "Russian FM vows ‘decisive response’ if attacked by the West",
      "Russia will give ‘decisive response’ if provoked by West, says Lavrov",
      "Russia warns of ‘decisive response’ to any act of aggression against it"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.986,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.662,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "At the U.N. General Assembly, Russian Foreign Minister Sergey Lavrov stated Russia does not plan to attack Europe but will respond decisively to any aggression. This comes amid rising tensions and unauthorized flights into NATO airspace, raising concerns across Europe.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Moldova Votes in Key Election Amid Russian Interference Claims",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sun, 28 Sep 2025 06:42:55 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Financial Post"
    ],
    "domains": [
      "financialpost.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Most polls project the governing pro-EU Party of Action and Solidarity in the lead.",
      "CHISINAU, Moldova (AP) &#8212; Moldovans are heading to the polls to cast ballots in a tense parliamentary election plagued by claims of Russian interference, a vote seen as a choice between integration with the European Union or a drift back into Moscow&#8217;s fold. Sunday&#8217;s pivotal vote wil"
    ],
    "image_url": "",
    "titles": [
      "Moldova holds parliamentary elections hit by claims of Russian interference",
      "Moldovans cast ballots in a tense election plagued by Russian interference claims"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.97,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.656,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Moldovans voted in a crucial parliamentary election amid claims of Russian interference. The election is viewed as a pivotal moment, deciding between further integration with the European Union or closer ties to Moscow. Most polls place the pro-EU Party of Action and Solidarity in the lead.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "New Study Sheds Light on Beer and Wine's Complex Chemistry",
    "domain": "science",
    "source_domain": "www.sciencedaily.com",
    "location": "global",
    "published": "Sun, 28 Sep 2025 00:36:50 EDT",
    "source": "ScienceDaily",
    "sources": [
      "ScienceDaily",
      "SciTechDaily"
    ],
    "domains": [
      "www.sciencedaily.com",
      "scitechdaily.com"
    ],
    "snippets": [
      "Beer and wine, staples of human history for millennia, are still yielding new surprises. Recent research highlights how yeast extracts can cloud lagers, gluten can be quickly detected with a simple test strip, tannins give red wine its lip-puckering edge, and sulfites alter gut bacteria in unexpecte",
      "<a href=\"https://scitechdaily.com/mushrooms-evolved-psychedelics-twice-and-scientists-just-found-out/\" rel=\"nofollow\" title=\"Mushrooms Evolved Psychedelics Twice, and Scientists Just Found Out\"><img alt=\"Psilocybe cubensis\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"574\" src=\"https://scite"
    ],
    "image_url": "",
    "titles": [
      "Four strange secrets scientists just found in beer and wine",
      "Mushrooms Evolved Psychedelics Twice, and Scientists Just Found Out"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.929,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.651,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Recent research has unveiled new insights into beer and wine, revealing that yeast extracts can cause lagers to become cloudy, gluten presence can be quickly detected with a test strip, tannins are responsible for the lip-puckering quality of red wine, and sulfites may impact gut bacteria. These findings contribute to a deeper understanding of these ancient beverages.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: research",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Pittsburgh, Minnesota to Play Historic Game in Ireland; Arsenal Visits Newcastle",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sun, 28 Sep 2025 05:00:51 +0000",
    "source": "CBS Sports",
    "sources": [
      "Yahoo Sports",
      "CBS Sports"
    ],
    "domains": [
      "www.independent.co.uk",
      "www.cbssports.com"
    ],
    "snippets": [
      "Pittsburgh and Minnesota will make history in Ireland on Sunday",
      "The Gunners go to Newcastle upon Tyne on Sunday",
      "Everything you need to know ahead of the Premier League fixture"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/25/6f3ef920-cb63-45c9-972b-1bd84a4b4a18/rodgersweek3.jpg",
    "titles": [
      "Where to watch Steelers vs. Vikings: TV channel, live stream, prediction, pick, odds, spread",
      "Where to watch Newcastle vs. Arsenal, odds: Live stream, how to watch Premier League, TV channel",
      "Is Newcastle vs Arsenal on TV? Kick-off time, channel and how to watch Premier League match"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.937,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.642,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Pittsburgh and Minnesota are set to make history by playing a game in Ireland on Sunday, marking a notable event. Meanwhile, the Gunners (Arsenal FC) will be traveling to Newcastle upon Tyne for a Premier League fixture on the same day. Details and preparations for these upcoming matches are being closely followed.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Argentina Shocked by Live-Streamed Murder of Three Women; 5 Arrested",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sun, 28 Sep 2025 02:30:07 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Deutsche Welle"
    ],
    "domains": [
      "www.dw.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Drug gang suspected in torture and murder of two young women, and a 15-year-old girl, in crime that shocks Argentina.",
      "The murder of three young women who were tortured live on social media has shocked Argentina. Five suspects have been detained but the alleged mastermind behind the killings is still at large."
    ],
    "image_url": "",
    "titles": [
      "Thousands protest livestreamed murder of 2 women, young girl in Argentina",
      "Argentina: Thousands march for women murdered on livestream"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.889,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.633,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "In Argentina, three young women, including a 15-year-old girl, were tortured and murdered, an act broadcasted live on social media, shocking the nation. Five suspects are in custody, yet the alleged mastermind remains at large.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Golden Lion Tamarins, Sloths Share Habitat at Palm Beach Zoo",
    "domain": "science",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Sat, 27 Sep 2025 21:24:11 -0400",
    "source": "ABC News",
    "sources": [
      "ABC News",
      "Phys.org"
    ],
    "domains": [
      "abcnews.go.com",
      "phys.org"
    ],
    "snippets": [
      "Golden lion tamarins and Hoffman's two-toed sloths have become unlikely roommates in a brand new habitat at the Palm Beach Zoo and Conservation Society.",
      "Golden lion tamarins and Hoffman's two-toed sloths have become unlikely roommates in a brand new habitat at the Palm Beach Zoo and Conservation Society in Florida."
    ],
    "image_url": "https://s.abcnews.com/images/Entertainment/250927_abc_social_monkey_hpMain_4x3_384.jpg",
    "titles": [
      "WATCH:  Golden lion tamarins and sloths become unlikely roommates at Florida zoo",
      "Golden lion tamarins and sloths become unlikely roommates at Palm Beach Zoo"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.869,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.629,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Golden lion tamarins and Hoffman's two-toed sloths are now cohabiting in a new habitat at the Palm Beach Zoo and Conservation Society in Florida, showcasing an unusual pairing of species.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "U.S. Revokes Colombian President's Visa After Protest Remarks",
    "domain": "business",
    "source_domain": "fortune.com",
    "location": "global",
    "published": "Sat, 27 Sep 2025 23:26:05 +0000",
    "source": "Fortune",
    "sources": [
      "CityNews",
      "Fortune"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "fortune.com"
    ],
    "snippets": [
      "During a protest Friday over the war in Gaza, he said “I ask all the soldiers of the United States' army, don't point your rifles against humanity\" and “disobey the orders of Trump.”",
      "WASHINGTON (AP) — Tensions between the United States and Colombia have escalated with the State Department announcing it was revoking a visa for Gustavo Petro, president of the Latin American country, after he participated in a New York protest where he called on American soldiers to disobey Preside"
    ],
    "image_url": "https://fortune.com/img-assets/wp-content/uploads/2025/09/AP25266820328000-e1759015209306.jpg?w=2048",
    "titles": [
      "U.S. revokes visa for Colombia’s president after he went to a protest and urged American soldiers to disobey Trump",
      "US revokes visa for Colombia’s president after he urges American soldiers to disobey Trump"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.834,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.622,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The U.S. State Department revoked the visa of Colombian President Gustavo Petro after he urged American soldiers to disobey President Trump's orders during a protest in New York against the war in Gaza. This action has heightened tensions between the United States and Colombia.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]