[
  {
    "title": "Fifteen people killed in shooting at Hanukkah event in Australia",
    "domain": "politics",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Sun, 14 Dec 2025 18:48:33 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Reuters",
      "New York Times",
      "The Guardian"
    ],
    "domains": [
      "bbc.com",
      "news.google.com",
      "nytimes.com",
      "theguardian.com"
    ],
    "snippets": [
      "Eleven people were killed in the shooting at Australia's Bondi Beach, as crowds attended an event to celebrate Hanukkah.",
      "Eleven people have been killed in an attack targeting a Hanukkah event on the beach.",
      "Bondi Beach shooting: As it happened Reuters",
      "Two gunmen opened fire at dozens of people who were at a Jewish holiday event. At least 15 people were killed in the attack, and so was one of the shooters, the police said.",
      "At least 16 people are dead after a mass shooting at a Jewish celebration at Bondi beach on Sunday evening, including one shooter Bondi beach shooting live updates Full report on the Bondi beach terror attack: 12 people killed after gunshots fired at park in Australia Two or more gunmen attacked a H"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/cfe3/live/84e68690-d91b-11f0-9ed5-012fa69819f6.jpg",
    "titles": [
      "'Hero' who wrestled gun from Bondi shooter named as Ahmed al Ahmed",
      "What we know about Bondi Beach Hanukkah shooting",
      "Bondi Beach shooting: As it happened - Reuters",
      "What We Know About the Bondi Beach Shooting in Australia",
      "Bondi beach attack: what we know so far about the shooting in Australia"
    ],
    "url": "https://www.bbc.com/news/articles/ce3wkey5p33o?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://www.bbc.com/news/articles/cqjg22rey0lo?at_medium=RSS&at_campaign=rss",
      "https://news.google.com/rss/articles/CBMioAFBVV95cUxQQTV6UmJLS3lsTnF5ZGJnOXRMaTFvaVNPQnduazFvOUpBQlhtb0hjYjg4WjBoVk5YLUhpS2ZCc0N3R2RsNjFaZ08tNWhXUE1obk95dTFfZVU4OU1ua0JIVmFyVUlTbDI1MVZRVk1aSDRDajhSYjJlOG13d2M4enZkS3RQM213WE1hTFBXLTJnOUJia0M0SWJpOHJ5SE1tVlZH?oc=5",
      "https://www.nytimes.com/2025/12/14/world/australia/what-we-know-bondi-shooting.html",
      "https://www.theguardian.com/australia-news/2025/dec/14/bondi-beach-attack-mass-shooting-what-we-know-so-far-sydney-nsw-australia"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/news/articles/ce3wkey5p33o?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.959,
      "consensus": 0.908,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.837,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness about a heroic act during a crisis, but doesn't provide any deeper understanding or insight into broader issues or solutions.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "At least 15 people were killed, including one of the shooters, after two gunmen opened fire at a Hanukkah celebration at Bondi Beach, Australia. The attack occurred on Sunday evening as crowds gathered for the Jewish holiday event. Police are investigating the incident, and the status of the second gunman is unclear.",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "Twelve killed in Sydney beach attack during Hanukkah event",
    "domain": "business",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Sun, 14 Dec 2025 17:10:12 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Deutsche Welle",
      "NPR",
      "Financial Times",
      "Reuters",
      "The Guardian",
      "Bloomberg"
    ],
    "domains": [
      "aljazeera.com",
      "dw.com",
      "npr.org",
      "ft.com",
      "news.google.com",
      "theguardian.com"
    ],
    "snippets": [
      "Countries from New Zealand to Iran denounce mass shooting in Australia.",
      "The shooting at Bondi Beach declared as a 'terrorist incident' after at least 11 people killed and 29 injured.",
      "A mass shooting at Australia’s Bondi Beach has killed at least 12 people and injured dozens more.",
      "A bystander disarmed a gunman during a mass shooting at Sydney’s Bondi Beach that left multiple dead and injured.",
      "One gunman was also killed in a shooting targeting a Jewish Hanukkah event at Sydney's most popular beach. Police have declared the attack a terrorist incident. DW has more.",
      "Hundreds had gathered for an event at Bondi Beach called Chanukah by the Sea, which was celebrating the start of the Hanukkah Jewish festival.",
      "International condemnation of the shooting which targeted people celebrating Hanukkah",
      "QUOTE BOX World reacts to deadly shooting at Australia's Bondi Beach Reuters",
      "A surf camera on Bondi beach has captured people fleeing after a shooting Sunday evening. ► Subscribe to Guardian Australia on YouTube Bondi beach shooting live updates What we know so far about the Bondi beach attack Continue reading...",
      "One gunman was killed and another wounded; two police officers among the injured taken to hospital Amid the horror of the shooting, one video has emerged showing incredible bravery – a bystander rushing one of the gunmen from behind to wrestle the firearm off him. Praised a hero, he is being identif",
      "Want to get this in your inbox every weekday? Sign up for the Morning Mail here , and finish your day with our Afternoon Update newsletter Good morning. Australians are this morning gripped by profound shock and grief after a terror attack targeted a Jewish festival in the Sydney suburb of Bondi Bea",
      "NSW health minister Ryan Park confirmed the updated death toll on Monday morning, saying the incident showed ‘the worst of humanity’ Follow latest updates What we know so far about the attack At least 16 people have died, including a child, following a terrorist attack apparently targeted at a Hanuk",
      "Australian police have taken two people into custody after reports of multiple gunshots at Sydney's Bondi Beach. A Jewish event to mark the first day of Hanukkah on Sunday appeared to have been the target of the attack.",
      "Communities express shock and solidarity after at least 12 people killed in Sydney at event marking start of Hanukah Bondi beach shooting: live updates What we know so far about the attack Jewish communities across the world have reacted with shock, sadness and solidarity after what Australia’s prim",
      "Massacre of Jews at Sydney’s Iconic Bondi Beach Shocks Australia Bloomberg.com"
    ],
    "image_url": "",
    "titles": [
      "World reacts to Jewish festival shooting attack at Sydney’s Bondi Beach",
      "Deadly mass shooting at Sydney’s Bondi Beach stuns Australia",
      "Australia reels from mass shooting at Bondi Beach in Sydney",
      "Bystander disarms Bondi Beach gunman during mass shooting in Sydney",
      "Australia: 16 killed in shooting at Sydney's Bondi Beach",
      "At least 11 killed in mass shooting at Hanukkah event on Sydney's Bondi Beach",
      "At least 16 people killed in terror attack on Jewish festival at Sydney’s Bondi Beach",
      "QUOTE BOX World reacts to deadly shooting at Australia's Bondi Beach - Reuters",
      "Surf camera in Australia shows beachgoers fleeing Bondi beach during shooting – video",
      "Bondi beach shooting live updates: at least 16 people dead including child after terror attack on Jewish festival",
      "Bondi beach shooting live updates: at least 16 people dead including child after terror attack on Jewish festival; 40 injured with five in critical condition",
      "Death toll rises to 16 from terror attack at Bondi after shooters targeted Jewish festival, victims include a child",
      "Bondi beach terror attack: 16 people including one child died in ‘antisemitic’ shooting",
      "Australia: Police detain 2 after gunshots at Bondi Beach",
      "‘We stand with you’: Jewish leaders around world respond to Bondi beach attack",
      "Massacre of Jews at Sydney’s Iconic Bondi Beach Shocks Australia - Bloomberg.com"
    ],
    "url": "https://www.aljazeera.com/news/2025/12/14/world-condemns-mass-shooting-at-jewish-festival-in-sydneys-bondi-beach?traffic_source=rss",
    "alternate_urls": [
      "https://www.aljazeera.com/gallery/2025/12/14/deadly-mass-shooting-at-sydneys-bondi-beach-stuns-australia?traffic_source=rss",
      "https://www.aljazeera.com/video/newsfeed/2025/12/14/australia-reels-from-mass-shooting-at-bondi-beach-in-sydney?traffic_source=rss",
      "https://www.aljazeera.com/video/newsfeed/2025/12/14/bystander-disarms-bondi-beach-gunman-during-mass-shooting-in-sydney?traffic_source=rss",
      "https://www.dw.com/en/australia-16-killed-in-shooting-at-sydney-s-bondi-beach/live-75150353?maca=en-rss-en-top-1022-rdf",
      "https://www.npr.org/2025/12/14/g-s1-102220/sydney-bondi-beach-hanukkah-shooting",
      "https://www.ft.com/content/debf26f6-db4a-4913-a4d0-2080f372b17d",
      "https://news.google.com/rss/articles/CBMiwgFBVV95cUxQMXo5blhQbk9TUWU1ejN2TkRyTmhTOUFRTU1paGVCRldRR3h1Wm9TdmM1NDBNejBIdjZ6cjEyek5qZERtS3pFSC1TOVlqT1ZHZXcxNnZOMkRNNGVsdkhSenhzNEx3TGlVRE9XeFlWT3Y4R19YMEFDTllZd2lHSEVQVTQ2M21QajJKTDRLWHEzM1ZYMEVnTUtmd25YSVRGQ0ZaZlpHaW5rdm5UbUFJNXB1aUxCS0xnRWpJejVFenhWbUFxZw?oc=5",
      "https://www.theguardian.com/australia-news/video/2025/dec/14/surf-camera-in-australia-shows-beachgoers-fleeing-bondi-beach-during-shooting-video",
      "https://www.theguardian.com/australia-news/live/2025/dec/14/bondi-beach-shooting-live-updates-victims-terror-attack-jewish-festival-hanukah",
      "https://www.theguardian.com/australia-news/2025/dec/15/morning-mail-monday-ntwnfb",
      "https://www.theguardian.com/australia-news/2025/dec/15/bondi-beach-terror-attack-16-people-including-one-child-died-in-antisemitic-shooting",
      "https://www.dw.com/en/australia-police-detain-2-after-gunshots-at-bondi-beach/a-75150014?maca=en-rss-en-top-1022-rdf",
      "https://www.theguardian.com/australia-news/2025/dec/14/jewish-communities-bondi-beach-attack-sydney",
      "https://news.google.com/rss/articles/CBMitgFBVV95cUxOd21sajdSOHlHRXYtOE9JUTZtLUJTVnphSVlQeThnV2x0Z3pqTWRpcExIWXEtM2NSQm5zWGQxb28weTRVZFJ3UnFGM2pKSW9kbXBsUE8tZHhadDFCaVR0cTRXVVhWcXVSRmd6Q1UzNXBqS0dLV3ZMVWxmcEFOc3E1cHJINElQc00tSnRkaHlLcGZwaTZSRER4ZXNMRnNHVmRBUGp1Vkk5LXJ2VVBwMFI5UzE4dDZaQQ?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2025/12/14/world-condemns-mass-shooting-at-jewish-festival-in-sydneys-bondi-beach?traffic_source=rss",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.916,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.825,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "negative_penalty=0.08 (keywords: attack); semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "A mass shooting at Sydney’s Bondi Beach during a Hanukkah event on December 14, 2025, left at least 12 people dead and dozens injured. Police declared the attack a terrorist incident, stating it targeted the Jewish community. One gunman was killed and another wounded; two suspects are in custody. The attack drew international condemnation, and a bystander disarmed one of the attackers.",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "Zelenskyy says Ukraine may skip NATO if given security help",
    "domain": "politics",
    "source_domain": "cbc.ca",
    "location": "national",
    "published": "Sun, 14 Dec 2025 13:48:45 EST",
    "source": "CBC News",
    "sources": [
      "CBC News",
      "Associated Press"
    ],
    "domains": [
      "cbc.ca",
      "news.google.com"
    ],
    "snippets": [
      "Ukrainian President Volodymyr Zelenskyy on Sunday voiced readiness to drop his country's bid to join NATO in exchange for Western security guarantees, but rejected the U.S. push for ceding territory to Russia as he held talks with U.S. envoys on ending the war.",
      "Zelenskyy offers to drop NATO bid for security guarantees but rejects US push to cede territory AP News"
    ],
    "image_url": "",
    "titles": [
      "Zelenskyy offers to drop NATO aspirations, remains against ceding territory to Russia",
      "Zelenskyy offers to drop NATO bid for security guarantees but rejects US push to cede territory - AP News"
    ],
    "url": "https://www.cbc.ca/news/world/ukraine-nato-peace-deal-9.7015483?cmp=rss",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiowFBVV95cUxNN012N3JrbDBtUE1IbXpzS0oxUE9RNXBXZG9yei1QOUtPbDFOQnRCa2dJMTBHMzFnSnpJb0lfd2tUZmZrSklFQkhGMkRqblo4bk5YbFl6TUE3cWlFcGZlYm4yanFza3Iwbk9qNGFRSy1Hb0w0ZEk4YndqdmpoNXJ0NjRnTWo2MzNlWTMxX3k2dnV4bWRXRk55eS1wdjVkZ0w3eWpn?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.cbc.ca/news/world/ukraine-nato-peace-deal-9.7015483?cmp=rss",
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.959,
      "consensus": 0.591,
      "constructiveness": 0.8,
      "proximity": 1.0
    },
    "score": 0.818,
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful information about an ongoing geopolitical issue, offering insight into the positions and strategies of key players. It could be more constructive if it delved deeper into the implications and potential outcomes of these developments.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Ukrainian President Volodymyr Zelenskyy stated he is willing to drop Ukraine’s bid to join NATO if Western countries provide security guarantees. However, he rejected the U.S. proposal for Ukraine to cede territory to Russia during talks with U.S. envoys aimed at ending the war.",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Shooting at Brown University leaves two students dead nine hurt",
    "domain": "business",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Sun, 14 Dec 2025 15:00:21 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "BBC",
      "Deutsche Welle",
      "NPR",
      "Axios",
      "ABC News",
      "Reuters",
      "The Guardian",
      "Global News",
      "CBC News",
      "Bloomberg",
      "Associated Press",
      "Fortune"
    ],
    "domains": [
      "aljazeera.com",
      "bbc.com",
      "dw.com",
      "npr.org",
      "news.google.com",
      "abcnews.go.com",
      "theguardian.com",
      "globalnews.ca",
      "cbc.ca",
      "fortune.com"
    ],
    "snippets": [
      "Police not looking for anyone else over the shooting that wounded nine people at Ivy League school in northeastern US.",
      "Two people died and nine others were injured in the incident in Rhode Island on Saturday.",
      "The identities of those killed or injured have not yet been released, but the university said all the victims were students.",
      "At least 2 were killed and 9 wounded in the shooting at the Ivy League university, and all the victims are students. DW has the latest.",
      "Hundreds of police officers are hunting for a gunman who killed two people and wounded nine others at Brown University in the US state of Rhode Island. The Ivy League campus remains under lockdown.",
      "Authorities were searching for a suspect described as \"a male dressed in black\" who fled after the Saturday afternoon shooting, and now have a person of interest in custody.",
      "2 killed, 9 injured in Brown University shooting; 1 in custody Axios",
      "Brown University lifted its lockdown early on Sunday morning.",
      "Police hold person of interest after Brown University shooting leaves two dead Reuters",
      "Brown University shooting leaves 2 dead, 9 injured as police search for killer Reuters",
      "Officials refuse to share name of person or details of arrest; Donald Trump says ‘Things can happen’ in comments shared by White House Person of interest detained in Brown University shooting that left two dead What we know so far Brown University students were told that all remaining classes and ex",
      "Nine others injured in Saturday attack that occurred during finals in engineering building in Providence, Rhode Island Brown University shooting – latest updates A person of interest in the shooting that killed two people and wounded nine others at Brown University in Providence, Rhode Island, on Sa",
      "The shooting occurred as students were writing their final exams for the semester, with police reporting two people were killed",
      "Police in Rhode Island say they have a person of interest in custody as they investigate the shooting at Brown University that killed two people and wounded nine others on Saturday.",
      "A shooting in the engineering building at Brown University on Saturday has left at least two people dead and eight critically injured, officials in Providence, R.I., said, as authorities continued to search for a suspect.",
      "Person of Interest Detained Over Brown University Shooting Bloomberg.com",
      "Person of interest detained in Brown University shooting that killed 2 and wounded 9 AP News",
      "Separately, an FBI agent said that the arrest occurred at a Hampton Inn hotel in Coventry, about 20 miles from Providence.",
      "Police search Brown University after shooter kills 2 and wounds 9 on campus AP News",
      "2 people were killed and 9 others injured in shooting at Brown University AP News"
    ],
    "image_url": "",
    "titles": [
      "Person of interest held in hunt for gunman who killed 2 at Brown University",
      "'Person of interest' detained over Brown University shooting, police say",
      "What we know so far about the Brown University shooting",
      "Brown University shooting: Police arrest 'person of interest'",
      "Brown University shooting: Police say 'multiple' people shot",
      "2 killed and 9 injured in Brown University shooting, person of interest now in custody",
      "2 killed, 9 injured in Brown University shooting; 1 in custody - Axios",
      "Person of interest in custody after fatal Brown University shooting, official says",
      "Police hold person of interest after Brown University shooting leaves two dead - Reuters",
      "Brown University shooting leaves 2 dead, 9 injured as police search for killer - Reuters",
      "Brown University shooting: person of interest in custody is in his 20s, police chief confirms – latest updates",
      "Person of interest detained in Brown University shooting that left two dead",
      "Brown University fatal shooting suspect arrested, police confirm",
      "Person of interest in custody in deadly Brown University shooting, police say",
      "2 killed, 8 injured in Brown University shooting, Rhode Island officials say",
      "Person of Interest Detained Over Brown University Shooting - Bloomberg.com",
      "Person of interest detained in Brown University shooting that killed 2 and wounded 9 - AP News",
      "Police have person of interest in custody over Brown University shooting that killed 2, wounded 9",
      "Police search Brown University after shooter kills 2 and wounds 9 on campus - AP News",
      "2 people were killed and 9 others injured in shooting at Brown University - AP News"
    ],
    "url": "https://www.aljazeera.com/news/2025/12/14/person-of-interest-held-in-hunt-for-gunman-who-killed-2-at-brown-university?traffic_source=rss",
    "alternate_urls": [
      "https://www.bbc.com/news/articles/ckg9ll6jpl0o?at_medium=RSS&at_campaign=rss",
      "https://www.bbc.com/news/articles/ckg9l1j9wxno?at_medium=RSS&at_campaign=rss",
      "https://www.dw.com/en/brown-university-shooting-police-arrest-person-of-interest/live-75148567?maca=en-rss-en-top-1022-rdf",
      "https://www.dw.com/en/brown-university-shooting-police-say-multiple-people-shot/a-75148185?maca=en-rss-en-top-1022-rdf",
      "https://www.npr.org/2025/12/13/nx-s1-5643588/brown-university-shooting",
      "https://news.google.com/rss/articles/CBMiakFVX3lxTE5KQ1RySzZFVHRwQzg4RWZOYWFlSjBJblN0NnFWUGR0eUtYWWdmZjNqdDB3ZWM4Z0xtbWxnT2g5b1lJR2dVbmptUS1zdFR1LXJoZHczZHB6d05BODhNendBWlJzd1JGYjNzOEE?oc=5",
      "https://abcnews.go.com/US/person-interest-custody-after-brown-university-shooting-official/story?id=128388923",
      "https://news.google.com/rss/articles/CBMiwgFBVV95cUxPaE44cFhUZDVvbzM4dEgyajFYSlJQNTdEanBSZUJYX2lZNUpjcnNsRTVKZ1hjWm9iVndNX3BIVGM4QmY3d3VhOUtlcEFicmkwOUhLcDRMeFEtZ2FxOS1rVG0tZXlPTkk5X1A2SE03Sjg5ZUZTTXpnX1Bpb2RZWHZUS3NwWVl0MTlMZnRaYmVUX0VpWGNyTXNsd2Eyc3otQUdQc0dENXJjNC05NnZfSzI2R2xJS29nT0U4RXlFeURoRmRFdw?oc=5",
      "https://news.google.com/rss/articles/CBMinAFBVV95cUxOcV9MZTRuZnhHNnJjQWlteXVNWEV1aE1mX0NLRERWSU5vWlh6OXFOVFVKdlRpVTFwZ3hsb3RLZGZRZ0lxRkNiZVBPUk5fb2Via1lJMmlrc2JlNjAwcXJNMlFYa3BUd3hZbzlDUWZTMXhzdHQxdXJtU0FNZU9KckJFRFJUdDNzd0MxTDU5MFdKSjMwVTJaSHBwZktfN1A?oc=5",
      "https://www.theguardian.com/us-news/live/2025/dec/14/brown-university-shooting-suspect-latest-updates",
      "https://www.theguardian.com/us-news/2025/dec/14/brown-university-shooting-latest",
      "https://globalnews.ca/news/11577265/brown-university-shooting-suspect-arrested-police-confirm/",
      "https://www.cbc.ca/news/world/person-of-interest-in-custody-brown-university-shooting-9.7015222?cmp=rss",
      "https://www.cbc.ca/news/world/brown-university-active-shooter-rhode-island-9.7015097?cmp=rss",
      "https://news.google.com/rss/articles/CBMirgFBVV95cUxOdjVMdTNLZU9TLTBNYUNsdkFLWWRnMnk4VkNabzU2ekJ3QlNoZzhpWUYwaldXWEtFMG85cmlSMVJ4TTFUZnBGR3hhR3NpT1BMWkF5YXBybk1VVkxaU2VqVEY4Ukt6bWcwZ3NaekpCeU5wTk1WWEVlSnRyb0g1VGdkRVdxUmdQeDlKZjRLaTBzRnoyZHFCT1V2ek5ybUVTYWFKTm41SHlJRnN6N2VNZ2c?oc=5",
      "https://news.google.com/rss/articles/CBMiogFBVV95cUxPOUUxZF9Gb2JXc3ZKWkZRUlZScGVxbWJ2c0ZKek1qM0s3cFdiUWY5ejVvaEpWYlBPcU9sd1R1MHA3VmZHbExQNzJYUkFGd2hDdFoyaUFicVV4NGRGMEdBU2k1OGdESHEzWW5fMG1feE9RYUZoMmo3cHZJa08wdVAyYi0tRGRGcWVDbW5Qb2RkUlVYYlVabkRnc0xlWWJUSXg2Y2c?oc=5",
      "https://fortune.com/2025/12/14/brown-university-mass-shooting-person-of-interest-custody-suspect-fbi-arrest/",
      "https://news.google.com/rss/articles/CBMilgFBVV95cUxOS1VwRGtBSFpBNFE5Q1MzbGhuRHJlY0pMVWl3X3FGVUhSTUJRaGVSdVphRTdRRWpHb2JmZEdfQUtONVAzbzRUWFNnTWRCR285eFAwVExRZVNSdmY5MW82amdsdFdLVFJnaWFxUW1iRGpnc2F0Z0RpckhaS0J0eVpOcWl4QU02STdxaGozNThiNEFsWVhJNUE?oc=5",
      "https://news.google.com/rss/articles/CBMiaEFVX3lxTE1tT1lLYzRIRmljYTBadEs2MTE4TGJmX2pMMWxFVVctRHVWXzl0RDcxYzhNWmVKOUlRQTRQUnZaV0NyZlc2bGhXcU5DaVR2elBUblBaM0xxT2lXZU56NkFvS0h4djdVdWZ2?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2025/12/14/person-of-interest-held-in-hunt-for-gunman-who-killed-2-at-brown-university?traffic_source=rss",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.863,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.809,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "A shooting at Brown University in Providence, Rhode Island, on Saturday left two students dead and nine others injured during final exams in the engineering building. Police detained a person of interest at a hotel in Coventry, about 20 miles away. Authorities are not seeking additional suspects. The university lifted its lockdown early Sunday, and officials have not released the victims' identities. The investigation is ongoing.",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "Chile votes for new president between Kast and Jara",
    "domain": "politics",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Sun, 14 Dec 2025 12:18:24 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Deutsche Welle",
      "The Guardian",
      "New York Times"
    ],
    "domains": [
      "aljazeera.com",
      "dw.com",
      "theguardian.com",
      "nytimes.com"
    ],
    "snippets": [
      "Chileans cast their ballots in run-off election, with far-right candidate Jose Kast gaining ground in polls.",
      "Security fears and migration concerns are shaping a tense runoff election, with polls favoring a far-right candidate against a left-wing former minister tied to an unpopular government.",
      "Trump-inspired former congressman expected to succeed Gabriel Boric but compulsory voting could create volatility Chileans will head to the polls on Sunday for a presidential runoff in which the favourite is a Donald Trump-inspired candidate who has pledged to build a wall along the country’s border",
      "Jeannette Jara and José Antonio Kast are facing off on Sunday in a deeply polarized election marked by concerns over security and immigration."
    ],
    "image_url": "",
    "titles": [
      "Kast vs Jara: Chile votes in polarising presidential run-off",
      "Chile votes in polarizing presidential runoff election",
      "Far-right José Antonio Kast favored to win as Chile votes in presidential runoff",
      "Will Chile Turn to the Right? Voters Face Presidential Runoff."
    ],
    "url": "https://www.aljazeera.com/news/2025/12/14/kast-vs-jara-chile-votes-in-polarising-presidential-run-off?traffic_source=rss",
    "alternate_urls": [
      "https://www.dw.com/en/chile-votes-in-polarizing-presidential-runoff-election/a-75152920?maca=en-rss-en-top-1022-rdf",
      "https://www.theguardian.com/world/2025/dec/14/chile-presidential-election",
      "https://www.nytimes.com/2025/12/14/world/americas/chile-election-candidates.html"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2025/12/14/kast-vs-jara-chile-votes-in-polarising-presidential-run-off?traffic_source=rss",
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.801,
      "consensus": 0.908,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.8,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs readers about an important political event in Chile, potentially contributing to understanding of global politics. However, without further context or analysis, its usefulness may be limited.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Chile is holding a presidential runoff election between far-right candidate José Antonio Kast and left-wing former minister Jeannette Jara. Polls indicate Kast is favored amid widespread concerns about security and migration. The election is marked by deep polarization, and compulsory voting may affect the outcome. The result is pending as voting takes place.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Israeli strike in Gaza kills Hamas commander Raed Saad",
    "domain": "general",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Sun, 14 Dec 2025 11:02:08 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Deutsche Welle",
      "Reuters",
      "Washington Post"
    ],
    "domains": [
      "aljazeera.com",
      "dw.com",
      "news.google.com",
      "washingtonpost.com"
    ],
    "snippets": [
      "Hamas has confirmed that Israel killed its senior commander Raed Saad in a strike which killed at least four others.",
      "Israel has said it killed \"one of the architects\" of Hamas' October 7 attack in a targeted strike in Gaza City. Israel says the strike was in response to a bomb explosion that injured two soldiers earlier Saturday.",
      "Hamas says Israel's killing of senior commander threatens ceasefire Reuters",
      "The Israel Defense Forces said Raed Saad had worked to reestablish Hamas’s capabilities and weapons manufacturing. Hamas said the strike violated the ceasefire."
    ],
    "image_url": "",
    "titles": [
      "Israel kills senior Hamas commander Raed Saad as Gaza ceasefire strains",
      "Senior Hamas leader killed in Gaza strike, Israel says",
      "Hamas says Israel's killing of senior commander threatens ceasefire - Reuters",
      "Israel kills Hamas leader in Gaza, challenging fragile truce"
    ],
    "url": "https://www.aljazeera.com/video/newsfeed/2025/12/14/israel-kills-senior-hamas-commander-raed-saad-as-gaza-ceasefire-strains?traffic_source=rss",
    "alternate_urls": [
      "https://www.dw.com/en/senior-hamas-leader-killed-in-gaza-strike-israel-says/a-75147822?maca=en-rss-en-top-1022-rdf",
      "https://news.google.com/rss/articles/CBMizwFBVV95cUxQZ1RaWjFOTU1BZHRGMUhnOFRzR0p6emtISXk1N0t2RnFYcFVxeUJVamMzb3FjVkZlODBubGNUUmJTNmJ2UVBzeFpWQVdwcUhzZkQxeTVuYU04cEFKY09kWW1UdzNkdzdfcno5VWIxZGRMclBObGlVQlRkUmVGX19jZjBtWkVMZjljUmV3RERqRGVmWVMzS0xsSjlSR2pWOGMzUUE3TmJrcUFlejQtRDc5Vm4zcWp2Um9QOXk0OS1HY0xadGZxak14cFRyV1NLcUU?oc=5",
      "https://www.washingtonpost.com/world/2025/12/13/raed-saad-hamas-killed/"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/video/newsfeed/2025/12/14/israel-kills-senior-hamas-commander-raed-saad-as-gaza-ceasefire-strains?traffic_source=rss",
    "score_components": {
      "magnitude": 0.932,
      "recency": 0.773,
      "consensus": 0.908,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.793,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness of a geopolitical event, but without additional context or analysis, it doesn't offer much in terms of deeper understanding. It doesn't report on solutions or improvements, but it does increase clarity around a significant event that could have wider impacts.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Israel carried out a targeted strike in Gaza City, killing Hamas senior commander Raed Saad and at least four others. Israel described Saad as \"one of the architects\" of Hamas' October 7 attack and said the strike was in response to a bomb explosion that injured two Israeli soldiers. Hamas stated the killing threatened the ceasefire and accused Israel of violating it.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Calgary Flames win 2 to 1 over Los Angeles Kings in overtime",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sun, 14 Dec 2025 17:29:38 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "NHL",
      "Sportsnet"
    ],
    "domains": [
      "globalnews.ca",
      "news.google.com",
      "sportsnet.ca"
    ],
    "snippets": [
      "Morgan Frost scored in overtime and Blake Coleman had a short-handed goal in the Calgary Flames’ 2-1 victory over the Los Angeles Kings on Saturday night. Dustin Wolf made 20 saves for the surging Flames. They have won eight of their past 12 games, with Wolf winning his last four starts. Frost finis",
      "Frost's OT goal lifts Flames past Kings NHL.com",
      "Blake Coleman potted a shorthanded goal in the second, and Morgan Frost tallied the overtime winner as the Calgary Flames downed the Los Angeles Kings 2-1. Adrian Kempe picked up the lone goal for the Kings in the loss."
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/12/Flames-Dec-13.jpg?quality=65&strip=all",
    "titles": [
      "Morgan Frost scores in OT to lift Flames past the Kings 2-1",
      "Frost's OT goal lifts Flames past Kings - NHL.com",
      "NHL Highlights: Flames 2, Kings 1 (OT)"
    ],
    "url": "https://globalnews.ca/news/11577355/morgan-frost-scores-in-ot-to-lift-flames-past-the-kings-2-1/",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMijgFBVV95cUxOZlF6bmJfT3NXV1RJa2tXaklIRmZ5Rjk5b010U3NYRkIxWXFtRW1KUWZlbF9ORXlnNFdONWNReEc4dDh4anZKeGpSV3FxeGhDT0xNSnA5dFBxc3JzcVNDNHQwR3pZMjNnU3c5cTlXOUpReDV2b0FwaEJBUWttWWZZOHcwMTFCSWc3VExUcEdn?oc=5"
    ],
    "location_scope": "national",
    "link": "https://globalnews.ca/news/11577355/morgan-frost-scores-in-ot-to-lift-flames-past-the-kings-2-1/",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.925,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.783,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Morgan Frost scored the overtime winner and Blake Coleman added a shorthanded goal as the Calgary Flames defeated the Los Angeles Kings 2-1. Goaltender Dustin Wolf made 20 saves for Calgary, which has won eight of its last 12 games. Adrian Kempe scored the only goal for the Kings.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Three Americans killed in attack on patrol in Syria",
    "domain": "general",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Sun, 14 Dec 2025 13:40:30 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Washington Post",
      "New York Times"
    ],
    "domains": [
      "aljazeera.com",
      "washingtonpost.com",
      "nytimes.com"
    ],
    "snippets": [
      "Donald Trump has vowed retaliation against ISIL after an ambush near Palmyra in central Syria killed three US citizens.",
      "A joint U.S.-Syrian security patrol was attacked in the city of Palmyra, the Pentagon and Syria’s state news agency said.",
      "Two soldiers and a civilian interpreter were killed while supporting counterterror operations, the Pentagon said. They are the first U.S. casualties in Syria since the fall of the dictator Bashar al-Assad."
    ],
    "image_url": "",
    "titles": [
      "Trump vows to retaliate after US citizens killed in Syria",
      "Trump vows to retaliate after U.S. troops killed in Syria",
      "3 Americans Killed in ISIS Attack in Syria, Trump Says, Vowing to Retaliate"
    ],
    "url": "https://www.aljazeera.com/video/newsfeed/2025/12/14/trump-vows-to-retaliate-after-us-citizens-killed-in-syria?traffic_source=rss",
    "alternate_urls": [
      "https://www.washingtonpost.com/world/2025/12/13/syria-attack-soldiers-killed/",
      "https://www.nytimes.com/2025/12/13/world/middleeast/us-forces-attacked-syria.html"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/video/newsfeed/2025/12/14/trump-vows-to-retaliate-after-us-citizens-killed-in-syria?traffic_source=rss",
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.832,
      "consensus": 0.789,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.762,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "While this story does provide some insight into the potential actions of the US government, it doesn't provide much depth or context. The story doesn't report on solutions or attempts to solve problems, and it doesn't increase clarity around systems, causes, trends, or impacts.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Three U.S. citizens—two soldiers and a civilian interpreter—were killed in an ISIL ambush on a joint U.S.-Syrian patrol near Palmyra, central Syria, according to the Pentagon and Syria’s state news agency. Donald Trump has vowed retaliation. These are the first U.S. casualties in Syria since the fall of Bashar al-Assad.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Gunmen attack Hanukkah event on Sydney beach killing 11 people",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Sun, 14 Dec 2025 17:45:35 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "Al Arabiya",
      "New York Times"
    ],
    "domains": [
      "news.google.com",
      "nytimes.com"
    ],
    "snippets": [
      "Gunmen kill 11 at Australia's Bondi Beach Jewish holiday event Reuters",
      "Gunmen kill 11 at Jewish festival on Australia’s Bondi beach Al Arabiya English",
      "Gunshots ripped through a Hanukkah celebration in Sydney, Australia, killing at least 11 people."
    ],
    "image_url": "",
    "titles": [
      "Gunmen kill 11 at Australia's Bondi Beach Jewish holiday event - Reuters",
      "Gunmen kill 11 at Jewish festival on Australia’s Bondi beach - Al Arabiya English",
      "Witnesses Fled Bondi Beach as Gunmen Targeted Jewish Event"
    ],
    "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxQM0VnZjhqQjIxZkhhYXIwRHRJb3h1Y1A0MGV4R0dnVWczbTY0aTY1a1R1SnI0S1JWYzlCVDdYWXlwSlhTbXk5R01QLU8zaUtmcnFEOVFMVGo3ZVRvQlo4bm5YV1RsYk41Y1NrNDFjSUp2aTg0clJydEh3NTQ2SjFuN1gyME91M2xfcmU0UFduOEhsLUIxZFVmNEV5OU5EOVVOZGNpVHN3VDhtdTY0T0JVaDFaZ2M4S3lmTVE?oc=5",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiugFBVV95cUxQcjAwaHVuMFl2R2YydUV6ZUpKVllQUVUxOWo1dmRlYzdKclRrdl9kaDdtV1R5ckdsRFlEWEpSR0dUQnNBTlNPcS05MnpYOHllRjhENHJCRGxGQWJ4eE9DRVNSVHAxWjkwMUR1NG9ZS0lDZWptXzlIR005TDhCRmt4MzJBRXlVRjFfNkhSUndpUmNqTEVYamxPOVgyZjRZWjRXX05PTm5aZ05fMDV1d2pPa2E1NV9JUDFjc2fSAb8BQVVfeXFMUG81ME9HWHZCT3NDWHM0YjBfQ0lQNUNBNWFiYkxQT1lTZTZWb1UweHZWYlU2b2toR0oyU3VQSmVWbnFzMjF5SS1SRHBwRXFtSVRrczRHc1ZpaHdicmtsTFotYzNDM3U3bHd3UlNmWkhkOUhpb3NLbjdGQi1PNjY4WXJzeGlCTnRiQm9TWklzV0E0SU1aNFMwUGk0aDl2M21uajRUYmh3T2JMR3hiaV9lYlF0eXZicXdkQUhNMjlFTUU?oc=5",
      "https://www.nytimes.com/2025/12/14/world/australia/witness-accounts-bondi-beach-shooting.html"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMiugFBVV95cUxQM0VnZjhqQjIxZkhhYXIwRHRJb3h1Y1A0MGV4R0dnVWczbTY0aTY1a1R1SnI0S1JWYzlCVDdYWXlwSlhTbXk5R01QLU8zaUtmcnFEOVFMVGo3ZVRvQlo4bm5YV1RsYk41Y1NrNDFjSUp2aTg0clJydEh3NTQ2SjFuN1gyME91M2xfcmU0UFduOEhsLUIxZFVmNEV5OU5EOVVOZGNpVHN3VDhtdTY0T0JVaDFaZ2M4S3lmTVE?oc=5",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.931,
      "consensus": 0.769,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.761,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story raises awareness about a tragic event, but it doesn't provide any actionable insights or deeper understanding for the reader. It doesn't report on solutions or attempts to solve problems, nor does it increase clarity around systems, causes, trends, or impacts.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Gunmen opened fire at a Hanukkah celebration on Sydney’s Bondi Beach, killing at least 11 people. The attack occurred during a Jewish holiday event. Authorities are investigating the incident, and no group has claimed responsibility. The situation remains under investigation.",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "Ukraine leader says country will not join NATO in talks",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Sun, 14 Dec 2025 16:42:25 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "Globe and Mail"
    ],
    "domains": [
      "news.google.com"
    ],
    "snippets": [
      "Ukraine's Zelenskiy drops NATO ambition as Berlin peace talks begin Reuters",
      "Zelensky ditches NATO ambition as peace talks get under way in Berlin The Globe and Mail"
    ],
    "image_url": "",
    "titles": [
      "Ukraine's Zelenskiy drops NATO ambition as Berlin peace talks begin - Reuters",
      "Zelensky ditches NATO ambition as peace talks get under way in Berlin - The Globe and Mail"
    ],
    "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxOWml6MWxSWTEtOV93R1pBV05WOW1JVzhtUTVtM05vRmp0anNONVpEV3c1YVNVWWJkSTdzS1dIOTBGYzFtUlhmLVVQNVFKalk5bnh1SVBVVnJQUjExN0VMUmFLSlEyV3lrMGJGWGlMaHhpLWhoZkxvT2JqZ3dveHlvM29HVFdKODZfWW5peVhKWTJyYUxMRWRud1BKWHR1eXRLYVpWaEJrZnRka3gwZFJHYzRLX1N0Zw?oc=5",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMirAFBVV95cUxOcVFOOHY1a2pzbllhNkhKOGwyeTIyTXNoVW9ENmZsTmEyNVRSYlhMV1pqM01lcEtweXBZQlN0dWxQWE9BSkdtVmt1T3FDZmlsYjh3WEdQbUhaTFhTOGo1YU9HMno5b21sTlRZYjBtcXJ5ZHJGOGdNOWkxUUhCdGY0b1ZzVEVyNGRSc2lraVlIY0lOdTNjUXM5X000RzE2NFllV1BjVGt3Uy16WU52?oc=5"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMitgFBVV95cUxOWml6MWxSWTEtOV93R1pBV05WOW1JVzhtUTVtM05vRmp0anNONVpEV3c1YVNVWWJkSTdzS1dIOTBGYzFtUlhmLVVQNVFKalk5bnh1SVBVVnJQUjExN0VMUmFLSlEyV3lrMGJGWGlMaHhpLWhoZkxvT2JqZ3dveHlvM29HVFdKODZfWW5peVhKWTJyYUxMRWRud1BKWHR1eXRLYVpWaEJrZnRka3gwZFJHYzRLX1N0Zw?oc=5",
    "score_components": {
      "magnitude": 0.795,
      "recency": 0.905,
      "consensus": 0.571,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.754,
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it provides useful information about a significant geopolitical development, contributing to the reader's understanding of international relations. However, it does not clearly highlight progress or solutions.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Ukrainian President Volodymyr Zelensky has dropped Ukraine's ambition to join NATO as peace talks begin in Berlin. The move comes as part of efforts to advance negotiations aimed at ending the conflict with Russia. The talks in Berlin mark a significant development in attempts to reach a diplomatic resolution.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Jimmy Lai waits for court decision in Hong Kong trial",
    "domain": "general",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Sun, 14 Dec 2025 19:40:37 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Reuters"
    ],
    "domains": [
      "aljazeera.com",
      "news.google.com"
    ],
    "snippets": [
      "Media mogul Lai was arrested in 2020 under a national security law imposed by China.",
      "Jimmy Lai's supporters queue in Hong Kong overnight for verdict Reuters"
    ],
    "image_url": "",
    "titles": [
      "Jimmy Lai supporters queue outside Hong Kong court ahead of verdict",
      "Jimmy Lai's supporters queue in Hong Kong overnight for verdict - Reuters"
    ],
    "url": "https://www.aljazeera.com/news/2025/12/14/jimmy-lai-supporters-queue-outside-hong-kong-court-ahead-of-verdict?traffic_source=rss",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMipgFBVV95cUxNcDFYSVlTZ0ZiNzNkTmJOYUhzMjhDTmZwTExaczRvM1VfWGVVc0dsQVdOcUhnbjVJQlEwVk9NeWZrRlJPMFRGNWN5NDAxeTdJenVtVUkwbFY3MVNkVWd4YnRkdVZFb3ZYSDRzaXlDdXVRaWRBTlVNME5iQUhzVERtd09WelhGc2tJcXpQd2l6SmRTdVl6TTExT1RpM0FEYWdMYWhtUmRn?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2025/12/14/jimmy-lai-supporters-queue-outside-hong-kong-court-ahead-of-verdict?traffic_source=rss",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.982,
      "consensus": 0.591,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.749,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful context about the public support for Jimmy Lai and the ongoing legal situation in Hong Kong. However, it doesn't report on solutions or attempts to solve problems, and it doesn't provide a deep understanding of the systems, causes, trends, or impacts involved.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Media mogul Jimmy Lai, who was arrested in 2020 under a national security law imposed by China, is awaiting a verdict in Hong Kong. Supporters have queued overnight outside the court ahead of the decision. The outcome of Lai's trial has not yet been announced as of December 14, 2025.",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Fernando Mendoza wins Heisman Trophy for Indiana football team",
    "domain": "sports",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Sun, 14 Dec 2025 01:18:12 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "ESPN",
      "Associated Press",
      "Sports Illustrated",
      "Sportsnet"
    ],
    "domains": [
      "news.google.com",
      "espn.com",
      "sportsnet.ca"
    ],
    "snippets": [
      "Indiana QB Fernando Mendoza wins the Heisman Axios",
      "Indiana's Fernando Mendoza, who guided the Hoosiers to their first No. 1 ranking and the top seed in the 12-team CFP bracket by throwing for 2,980 yards and a national-best 33 touchdown passes, won the Heisman Trophy on Saturday night.",
      "Fernando Mendoza wins the Heisman Trophy as college football’s top player AP News",
      "Fernando Mendoza Is the First Cal Graduate to Win Heisman Trophy Sports Illustrated",
      "Fernando Mendoza’s remarkable season is now etched in history forever, as the star quarterback took home the 2025 Heisman Trophy on Saturday."
    ],
    "image_url": "",
    "titles": [
      "Indiana QB Fernando Mendoza wins the Heisman - Axios",
      "QB Mendoza first Hoosier to win Heisman Trophy",
      "Fernando Mendoza wins the Heisman Trophy as college football’s top player - AP News",
      "Fernando Mendoza Is the First Cal Graduate to Win Heisman Trophy - Sports Illustrated",
      "Indiana’s Fernando Mendoza wins 2025 Heisman Trophy"
    ],
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE8tZ0dzRU1BYWNYSEE4eTlKTmtGSnVwNmV4MVJ2LWFMVTVpMEtNQUFlb1NRMlRGNkg4YnU3cHpZRnNaWi02eHNFV1Y2ZVl4d3VZV0NCTWJZVGZlamlvbGdYa3NDZjdzaFpXRmtidzI5dDZUM3U2NmZVNWY1aEF5RnM?oc=5",
    "alternate_urls": [
      "https://www.espn.com/college-football/story/_/id/47298246/fernando-mendoza-becomes-1st-indiana-hoosier-win-heisman",
      "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPVmhoUHUxMHVYZTNVQ0RtcWRJdHdpOGxiREllQ1BUSTZ2RU15eHFSYnRkbEpnd2thODNTQmN2OHA0WHRMcE9yeFhVSWtTRVZSQ1N0cTNsczIyUkk1ZmY2S2pQMTVHYU84VmdUMnJOY3RNREJZOFFsZDZySzZlamY1ZXdtbkFocHlV?oc=5",
      "https://news.google.com/rss/articles/CBMiuAFBVV95cUxOWjZkUDNvY2pqeWJLSFN1bnVCYm9qU1dwSlgwSkhNaHdGU0hiWXIwTC0xQTVvNkE0NDVjYTNsNU9FQl92dlFLVHdXUkFrMFl5TkpEbm1UZUp4aGtyMUtQYm9Ha3pTaU1vR0tubjd1YzRmSXVna2FjU3ViS3B4NWxPVkI1Wk9Eb1Vsc2JTNTRnYW5ONUtsTllMdnVLOEY1R0pNWU9WTzhpbnFxdHJBU0NqQm9ITGVnU1Rr?oc=5"
    ],
    "location_scope": "national",
    "link": "https://news.google.com/rss/articles/CBMif0FVX3lxTE8tZ0dzRU1BYWNYSEE4eTlKTmtGSnVwNmV4MVJ2LWFMVTVpMEtNQUFlb1NRMlRGNkg4YnU3cHpZRnNaWi02eHNFV1Y2ZVl4d3VZV0NCTWJZVGZlamlvbGdYa3NDZjdzaFpXRmtidzI5dDZUM3U2NmZVNWY1aEF5RnM?oc=5",
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.59,
      "consensus": 0.955,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.731,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers basic awareness about a sports achievement. It does not provide much depth or insight that would contribute to the reader's understanding or decision-making.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Indiana quarterback Fernando Mendoza won the 2025 Heisman Trophy on December 13, becoming the first Cal graduate to receive the award. Mendoza led the Hoosiers to their first No. 1 ranking and top seed in the 12-team College Football Playoff, throwing for 2,980 yards and 33 touchdowns, the most in the nation.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Trump aides to meet Ukrainian leader Zelenskyy on Sunday",
    "domain": "politics",
    "source_domain": "npr.org",
    "location": "national",
    "published": "Sun, 14 Dec 2025 05:48:15 -0500",
    "source": "NPR",
    "sources": [
      "NPR",
      "New York Times"
    ],
    "domains": [
      "npr.org",
      "nytimes.com"
    ],
    "snippets": [
      "U.S. President Donald Trump's special envoy Steve Witkoff and son-in-law Jared Kushner will meet Ukrainian leader Volodymyr Zelenskyy on Sunday, as Trump grows increasingly exasperated by delays.",
      "Ukraine’s president is meeting with U.S. negotiators about plans to end the war with Russia. He said he would give up hopes of joining NATO in exchange for security guarantees."
    ],
    "image_url": "",
    "titles": [
      "US envoys arrive in Berlin for latest round of Ukraine peace talks with Zelenskyy",
      "Zelensky Offers Compromise Before Latest Round of Peace Plan Talks"
    ],
    "url": "https://www.npr.org/2025/12/14/g-s1-102218/us-envoys-arrive-in-berlin-for-more-ukraine-peace-talks",
    "alternate_urls": [
      "https://www.nytimes.com/2025/12/14/world/europe/zelensky-ukraine-peace-talks.html"
    ],
    "location_scope": "national",
    "link": "https://www.npr.org/2025/12/14/g-s1-102218/us-envoys-arrive-in-berlin-for-more-ukraine-peace-talks",
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.768,
      "consensus": 0.591,
      "constructiveness": 0.7,
      "proximity": 0.75
    },
    "score": 0.726,
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story informs about ongoing peace talks, providing useful context for understanding the current political climate. However, it does not clearly highlight progress or solutions.",
    "constructiveness_source": "gpt",
    "summary_source": "snippet",
    "summary_reason": "invalid_roles",
    "headline_source": "gpt",
    "summary": "U.S. President Donald Trump's special envoy Steve Witkoff and son-in-law Jared Kushner will meet Ukrainian leader Volodymyr Zelenskyy on Sunday, as Trump grows increasingly exasperated by delays.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Rome Odunze will not play for Bears because of foot injury",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Sun, 14 Dec 2025 14:31:44 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "espn.com",
      "cbssports.com"
    ],
    "snippets": [
      "Bears wide receiver Rome Odunze will not play against the Cleveland Browns on Sunday after aggravating his foot injury during pregame warmups.",
      "Odunze planned on playing, but reportedly aggravated his foot injury while warming up"
    ],
    "image_url": "",
    "titles": [
      "Bears' Odunze out after aggravating foot injury",
      "Bears WR Rome Odunze ruled out for Week 15 matchup vs. Browns after aggravating foot injury, per report"
    ],
    "url": "https://www.espn.com/nfl/story/_/id/47304596/bears-rome-odunze-aggravating-foot-injury",
    "alternate_urls": [
      "https://www.cbssports.com/nfl/news/rome-odunze-out-browns-bears-foot-injury/"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/nfl/story/_/id/47304596/bears-rome-odunze-aggravating-foot-injury",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.978,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.707,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Chicago Bears wide receiver Rome Odunze will miss Sunday's game against the Cleveland Browns after aggravating a foot injury during pregame warmups. Odunze had intended to play, but the injury worsened before kickoff, leading to his absence from the lineup.",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Merrill Kelly set to return to Arizona Diamondbacks team",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Sun, 14 Dec 2025 14:31:44 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "espn.com",
      "sportsnet.ca"
    ],
    "snippets": [
      "Merrill Kelly, after being dealt by the Diamondbacks to the Rangers at the trade deadline last season, is returning to Arizona on a two-year, $40 million deal, a source confirmed to ESPN.",
      "PHOENIX — Veteran starting pitcher Merrill Kelly agreed Sunday to return to the Arizona Diamondbacks on a $40 million, two-year deal, according to a person familiar with the move. The person spoke to The Associated Press on condition of anonymity because the deal has not been announced and is pending a physical. It was first reported by Ken Rosenthal of The Athletic . The right-hander spent the first six-and-a-half years of his career with the Diamondbacks before the pending free agent was dealt to the Texas Rangers at this year’s trade deadline in July. He was good for both teams, finishing..."
    ],
    "image_url": "",
    "titles": [
      "Source: Kelly to D-backs on 2-year, $40M deal",
      "Reports: Merrill Kelly returns to Diamondbacks on two-year, $40M deal"
    ],
    "url": "https://www.espn.com/mlb/story/_/id/47302930/reports-merrill-kelly-diamondbacks-agree-2-year-40m-deal",
    "alternate_urls": [],
    "location_scope": "national",
    "link": "https://www.espn.com/mlb/story/_/id/47302930/reports-merrill-kelly-diamondbacks-agree-2-year-40m-deal",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.978,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.707,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Veteran pitcher Merrill Kelly is returning to the Arizona Diamondbacks on a two-year, $40 million contract, according to multiple sources. Kelly was traded from the Diamondbacks to the Texas Rangers at the 2025 trade deadline but will now rejoin Arizona. The agreement is pending a physical and has not been officially announced.",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Bystander stops gunman after shooting at Bondi Beach",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Sun, 14 Dec 2025 15:22:56 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "The Guardian"
    ],
    "domains": [
      "news.google.com",
      "theguardian.com"
    ],
    "snippets": [
      "Bystander who tackled armed man at Bondi Beach shooting hailed as hero Reuters",
      "Video shows the man rushing one of the alleged gunmen who shot dozens of people on Sunday evening in Australia Bondi beach shooting live updates Bondi terror attack: full report What we know so far about the shooting in Australia A bystander tackled and wrestled a gun from one of the two alleged gun"
    ],
    "image_url": "",
    "titles": [
      "Bystander who tackled armed man at Bondi Beach shooting hailed as hero - Reuters",
      "Bystander tackles and wrestles gun from alleged gunman during Bondi beach mass shooting"
    ],
    "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxNT2l6LTJkTkFGOHFIWFB3eFRGMG1fV1YxelR5TzVORm85eEVBeUZuWWU0Y0RINWVfWDlvN2hVWDNtRGx6S1gxNl81N29QWTdGN3NGbGFEeGQxY1M3NUtXaEhGaFBlT0ExN19iT1lYcTJmcV95X2Q1MHF5MUlGS09vMEwwcFByZS1pdEg4OE9fVHdzeEZ6VENwazd2VzBVM3VrWTNPdkNKNGRIa1VQM3dUMzVmSmFmLXBxbFlZ?oc=5",
    "alternate_urls": [
      "https://www.theguardian.com/australia-news/2025/dec/14/bystander-tackles-and-wrestles-gun-from-alleged-gunmen-during-bondi-beach-mass-shooting"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxNT2l6LTJkTkFGOHFIWFB3eFRGMG1fV1YxelR5TzVORm85eEVBeUZuWWU0Y0RINWVfWDlvN2hVWDNtRGx6S1gxNl81N29QWTdGN3NGbGFEeGQxY1M3NUtXaEhGaFBlT0ExN19iT1lYcTJmcV95X2Q1MHF5MUlGS09vMEwwcFByZS1pdEg4OE9fVHdzeEZ6VENwazd2VzBVM3VrWTNPdkNKNGRIa1VQM3dUMzVmSmFmLXBxbFlZ?oc=5",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.872,
      "consensus": 0.591,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.706,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about a specific event, but does not offer much depth or insight beyond the individual act of heroism. It does not provide actionable insights or deeper understanding of broader issues.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "A bystander at Bondi Beach tackled and disarmed one of two alleged gunmen during a shooting on Sunday evening in Australia. The incident left dozens of people shot. The bystander's actions have been widely praised. Authorities are continuing to investigate the attack.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Twelve people die in attack at Sydney Jewish festival",
    "domain": "politics",
    "source_domain": "theguardian.com",
    "location": "global",
    "published": "Sun, 14 Dec 2025 16:50:40 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "New York Times"
    ],
    "domains": [
      "theguardian.com",
      "nytimes.com"
    ],
    "snippets": [
      "Police say one alleged shooter among dead, with second arrested and in a critical condition, after attack on Jewish festival in Sydney Bondi beach shooting live updates What we know so far about the Bondi beach attack At least 12 people have died, including one alleged gunman, following a terrorist",
      "Mass attacks have been rare in the wake of stringent gun controls brought in after the Port Arthur massacre of 1996 Bondi beach shooting: live updates Associated Press contributed reporting. Continue reading...",
      "A string of incidents has targeted the Jewish community in recent months."
    ],
    "image_url": "https://i.guim.co.uk/img/media/bed7cb130f2cb408a3af41c55df5c926a5e701e6/104_300_4126_3301/master/4126.jpg?width=140&quality=85&auto=format&fit=max&s=fe70e5b5fe3405e048fd10fe0fe01e50",
    "titles": [
      "Bondi beach terror attack: 12 people killed in ‘evil antisemitic’ shooting at park in Australia",
      "Timeline: Bondi beach terror attack becomes Australia’s worst mass shooting in three decades",
      "Bondi Shooting Is Latest in Alarming Rise of Antisemitic Attacks in Australia"
    ],
    "url": "https://www.theguardian.com/australia-news/2025/dec/14/police-advise-people-to-take-shelter-following-reports-of-active-shooter-at-bondi-beach",
    "alternate_urls": [
      "https://www.theguardian.com/australia-news/2025/dec/14/timeline-bondi-beach-terror-attack-australia-mass-shooting-port-arthur",
      "https://www.nytimes.com/2025/12/14/world/australia/bondi-shooting-antisemitic-attacks-australia.html"
    ],
    "location_scope": "global",
    "link": "https://www.theguardian.com/australia-news/2025/dec/14/police-advise-people-to-take-shelter-following-reports-of-active-shooter-at-bondi-beach",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.908,
      "consensus": 0.591,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.691,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "While the story raises awareness about a tragic event, it lacks depth and insight. It does not provide actionable insights, report on solutions, or increase clarity around systems, causes, trends, or impacts.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "At least 12 people, including one alleged gunman, have died in a terrorist attack on a Jewish festival at Sydney's Bondi Beach. Police report that a second suspect has been arrested and is in critical condition. Mass attacks are rare in Australia due to strict gun laws. The incident follows a series of recent incidents targeting the Jewish community.",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "Hong Kongs last big opposition party decides to close down",
    "domain": "politics",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Sun, 14 Dec 2025 13:02:06 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "The Guardian"
    ],
    "domains": [
      "news.google.com",
      "theguardian.com"
    ],
    "snippets": [
      "Hong Kong's last opposition party votes to disband under China pressure Reuters",
      "Senior DP members previously allege being told to disband or face severe consequences including possible arrest Hong Kong’s last major opposition party has disbanded after a vote by its members, the culmination of Chinese pressure on the city’s remaining liberal voices in a years-long security crack"
    ],
    "image_url": "",
    "titles": [
      "Hong Kong's last opposition party votes to disband under China pressure - Reuters",
      "Hong Kong’s last major opposition party disbands amid Chinese pressure"
    ],
    "url": "https://news.google.com/rss/articles/CBMiugFBVV95cUxQWVN4TjFWWHQ0UFhmN0J1NDVUWGJIZFhzeWN2bXpaRmVLdTA5MGVFR1hCSnEzcjRfS3c2TzZ3MGhZQWpNRmp2dnNPZU8yNDdHenFmRkpJMk5SdW1CM3lINDBYYlVXZndFdkEwN2I1WllzdFJnQnZaNFUxS19IbFVobnRUckxJdUpQSHlKWk5PMXFRT0F3a19BalFvZkw0MVZFM1dvekRGbUVaQXhKOEdNV2NfS3g1SDRvRFE?oc=5",
    "alternate_urls": [
      "https://www.theguardian.com/world/2025/dec/14/hong-kong-opposition-democratic-party-disbands-chinese-pressure"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMiugFBVV95cUxQWVN4TjFWWHQ0UFhmN0J1NDVUWGJIZFhzeWN2bXpaRmVLdTA5MGVFR1hCSnEzcjRfS3c2TzZ3MGhZQWpNRmp2dnNPZU8yNDdHenFmRkpJMk5SdW1CM3lINDBYYlVXZndFdkEwN2I1WllzdFJnQnZaNFUxS19IbFVobnRUckxJdUpQSHlKWk5PMXFRT0F3a19BalFvZkw0MVZFM1dvekRGbUVaQXhKOEdNV2NfS3g1SDRvRFE?oc=5",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.817,
      "consensus": 0.591,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.69,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story provides basic awareness about political pressure in Hong Kong, but it lacks depth or insight into the broader implications or potential solutions.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Hong Kong’s last major opposition party has voted to disband, following pressure from Chinese authorities. Senior members of the Democratic Party reported being warned to dissolve or risk arrest. The decision marks the end of organized opposition in Hong Kong amid an ongoing crackdown on dissent.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Connor Hellebuyck helps Jets win after knee injury return",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sun, 14 Dec 2025 13:48:27 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "NHL"
    ],
    "domains": [
      "globalnews.ca",
      "news.google.com"
    ],
    "snippets": [
      "Connor Hellebuyck was flashing some smiles after his return from injury helped the Winnipeg Jets take down the Washington Capitals 5-1 on Saturday.",
      "Hellebuyck makes 24 saves in return from knee injury, Jets top Capitals NHL.com",
      "GAMEDAY: Capitals at Jets NHL.com"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/12/e3c95828d12d6745e5ffb12ff7f0e763dc5c7f659716a4b7fc4b08c0565ada41.jpg?quality=65&strip=all",
    "titles": [
      "Hellebuyck all smiles in return from knee surgery",
      "Hellebuyck makes 24 saves in return from knee injury, Jets top Capitals - NHL.com",
      "GAMEDAY: Capitals at Jets - NHL.com"
    ],
    "url": "https://globalnews.ca/news/11577284/hellebuyck-all-smiles-in-return-from-knee-surgery/",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMijwFBVV95cUxNNDhXaFhRRGp6LXFZcGYxUVhlQlZxUF9Kb25EYUxMbEtQUEFBUVEwVjgwdlVMQzdSYWtGWENQcUJ5VE5OdnZTUHAzUE1UMEVnaTcydF9LTTZtNnNfYTVfazI2YXlvR2pQY2ctZ2pNSDVjbkRmdGxXSjhSOU9IMFVEb2NEUWVFWllWakRLbENjaw?oc=5",
      "https://news.google.com/rss/articles/CBMibEFVX3lxTE9OamlpX2FNcFEwSW1ubVZjS1otcW1RRkVPZEI5eWwyc1RvS21qTHE2MXhEMWdaS3lDclNZbEhmaG1QdHphenplQ1F5d2tyYnR4REV5blhnOENCSTlMeS1BMlBKVERCQ1J6UmNtUw?oc=5"
    ],
    "location_scope": "national",
    "link": "https://globalnews.ca/news/11577284/hellebuyck-all-smiles-in-return-from-knee-surgery/",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.835,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.689,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Connor Hellebuyck returned from a knee injury and made 24 saves, helping the Winnipeg Jets defeat the Washington Capitals 5-1 on Saturday. Hellebuyck appeared in good spirits following the win.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "United Airlines plane returns safely after engine fire no injuries",
    "domain": "business",
    "source_domain": "npr.org",
    "location": "national",
    "published": "Sat, 13 Dec 2025 17:16:27 -0500",
    "source": "NPR",
    "sources": [
      "NPR",
      "Reuters",
      "Bloomberg",
      "Associated Press"
    ],
    "domains": [
      "npr.org",
      "news.google.com"
    ],
    "snippets": [
      "Shortly after departing the Virginia airport on Saturday, the Tokyo-bound plane's engine cover separated and caught fire, according to the transportation secretary. No injuries were reported.",
      "Engine failure forces United Airlines flight to return to DC-area airport Reuters",
      "United Flight to Tokyo Returns to Dulles After Engine Fails Bloomberg.com",
      "United Airlines flight safely returns to Dulles airport after engine failure during takeoff AP News"
    ],
    "image_url": "",
    "titles": [
      "United Airlines flight returns to Dulles airport after engine loses power during takeoff",
      "Engine failure forces United Airlines flight to return to DC-area airport - Reuters",
      "United Flight to Tokyo Returns to Dulles After Engine Fails - Bloomberg.com",
      "United Airlines flight safely returns to Dulles airport after engine failure during takeoff - AP News"
    ],
    "url": "https://www.npr.org/2025/12/13/nx-s1-5643589/united-airlines-flight-dulles-airport-engine",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiygFBVV95cUxOeFBPRl93U0pwc21hZzBhc0h5TkxfMkdVc1NRSldPUzVPSm0xNmhJdWNQRGl1bGdkaU4wbkFPclcwZmVjamNMNC02ZUszeFltN2dFTERrQ3pXOUxERTNMU3R3UFN5NFhsV2dhZk9QTGw1bjB0N1duY1JWemlOQnV3VUQwT1pzd3hkX1hxZG1wSDNGLTYzOVc2d3ZjZ0l2eFRzV2FYZ3owTlZlYnZGdUozMHpVRTZiZWVXYnhSU1E3Y1hSSTRVZm52cE13?oc=5",
      "https://news.google.com/rss/articles/CBMisgFBVV95cUxQTmZ5d21VbG1aR2JhaW04VnRvYk1oNi1rZE10aEJFblJmSm4zVkRqcFgtWTdqZTBYcUFOM2JVUnc2cGdQdGkyMFdtR0xLZUhFTVJXWDEwUjlfUFFoMEtQRFV3Yk9paThybjlNVEtxYlNBOVBXTTR4dXlzcTVlV3RlaFNMbXpFdzV0ZHMzNTJMTWRManh6eFFMeURZU0Fwc016TWtxU0p4T09fOVl4Y0w5Mzhn?oc=5",
      "https://news.google.com/rss/articles/CBMikAFBVV95cUxQQnNQbGR5WHpYQk9heUlGTFhnekd2SGIyMDQxcWVfMkxoblduV2hXcjZyVkR6RmlMd1ljSVR3S09BN3N4SkV4M2JyU1EyN3Y3QVZaV1Bza2RnNlRMc042dFVEcnNPSy1BQ25ZbmtaNzZManpvMzdpX3hTeDkwVUpXd3BSaGNrcmdXUlpUT1QwckU?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.npr.org/2025/12/13/nx-s1-5643589/united-airlines-flight-dulles-airport-engine",
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.542,
      "consensus": 0.868,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.685,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "cache",
    "summary_reason": "",
    "headline_source": "cache",
    "summary": "A United Airlines flight bound for Tokyo returned safely to Dulles airport shortly after takeoff when its engine cover separated and caught fire, according to the transportation secretary. No injuries were reported. The incident occurred on Saturday, and all passengers and crew were safely evacuated.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Womens Super League takes winter break with close title race",
    "domain": "sports",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Sun, 14 Dec 2025 19:28:22 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Yahoo Sports"
    ],
    "domains": [
      "bbc.com",
      "sports.yahoo.com"
    ],
    "snippets": [
      "As the Women's Super League pauses for its winter break, BBC Sport looks at how the title race is shaping up - and who looks most likely to finish bottom come May."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/f36f/live/64e2f290-d919-11f0-a8dc-93c15fe68710.png",
    "titles": [
      "Man City favourites and Liverpool in trouble - how WSL stands at winter break",
      "How does the WSL stand at the winter break?"
    ],
    "url": "https://www.bbc.com/sport/football/articles/cx2dyr7gz7eo?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://sports.yahoo.com/articles/does-wsl-stand-winter-break-193129483.html"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/sport/football/articles/cx2dyr7gz7eo?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.977,
      "consensus": 0.591,
      "constructiveness": 0.022,
      "proximity": 0.5
    },
    "score": 0.684,
    "constructiveness_score": 0.022,
    "constructiveness_reason": "semantic: pos_sim=0.09, neg_sim=0.00; semantic_boost=0.02; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The Women's Super League has entered its winter break, with BBC Sport analyzing the current standings. The title race remains competitive, with several teams in close contention for the top spot. At the other end of the table, some clubs are at risk of finishing last when the season concludes in May. The league will resume after the break.",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Video shows gunman firing at Sydney Hanukkah event police say",
    "domain": "general",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Sun, 14 Dec 2025 15:45:28 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "New York Times"
    ],
    "domains": [
      "bbc.com",
      "nytimes.com"
    ],
    "snippets": [
      "Aerial footage appears to show a gunman firing from a bridge in a nearby carpark.",
      "The video, verified by The New York Times, shows a man sneaking up on one of the shooters who targeted a Hanukkah celebration in Sydney on Sunday."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/1c23/live/0a15e3c0-d916-11f0-aae2-2191c0e48a3b.jpg",
    "titles": [
      "Drone footage shows Bondi Beach gunmen on bridge",
      "Man Tackled and Disarmed One of the Bondi Beach Gunmen, Video Shows"
    ],
    "url": "https://www.bbc.com/news/videos/cgl68d8yjwzo?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://www.nytimes.com/2025/12/14/world/australia/bondi-beach-gunman-tackled-video.html"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/news/videos/cgl68d8yjwzo?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.881,
      "consensus": 0.591,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.683,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story is largely sensational, focusing on the dramatic visual aspect of a crime. It does not provide useful information or context, nor does it increase clarity around systems, causes, trends, or impacts that matter.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "A verified video shows a gunman firing from a bridge near a carpark during an attack on a Hanukkah celebration in Sydney on Sunday. The footage also captures another individual approaching one of the shooters. The incident is under investigation, and authorities have not yet released further details about the suspects or casualties.",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Leeds draw with Brentford and move further from danger zone",
    "domain": "sports",
    "source_domain": "theguardian.com",
    "location": "global",
    "published": "Sun, 14 Dec 2025 18:48:53 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "Sky Sports"
    ],
    "domains": [
      "theguardian.com",
      "skysports.com"
    ],
    "snippets": [
      "It had been a game to reflect the tyranny of analytics-based football, when thought and expression are abandoned for the playbook, where set pieces rule, and long throws become key events. For Brentford’s Michael Kayode, read Leeds’ Ethan Ampadu, both taking an age before hurling the ball into a mas",
      "Dominic Calvert-Lewin scored for the fourth Premier League game running as Leeds United came from behind to draw 1-1 at Brentford and move three points clear of the relegation zone."
    ],
    "image_url": "https://i.guim.co.uk/img/media/bb93cadb8962919a859720c6fd69934790a85414/768_0_3616_2894/master/3616.jpg?width=140&quality=85&auto=format&fit=max&s=4c8e78cd177d8cc6d9803c06fefd1d61",
    "titles": [
      "Calvert-Lewin header earns Leeds point after Henderson strikes for Brentford",
      "Calvert-Lewin earns Leeds a draw at Brentford to go three clear of drop"
    ],
    "url": "https://www.theguardian.com/football/2025/dec/14/brentford-leeds-premier-league-match-report",
    "alternate_urls": [
      "https://www.skysports.com/football/brentford-vs-leeds-united/report/531280"
    ],
    "location_scope": "global",
    "link": "https://www.theguardian.com/football/2025/dec/14/brentford-leeds-premier-league-match-report",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.959,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.682,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Dominic Calvert-Lewin scored for the fourth consecutive Premier League match as Leeds United came from behind to draw 1-1 against Brentford. The result moves Leeds three points clear of the relegation zone. The match featured a focus on set pieces and long throws, with both teams relying heavily on structured play.",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "John Cena wrestles last match and loses to Gunther",
    "domain": "business",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Sun, 14 Dec 2025 09:15:34 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "ESPN",
      "Forbes"
    ],
    "domains": [
      "bbc.com",
      "espn.com",
      "forbes.com"
    ],
    "snippets": [
      "The actor and wrestler brought the curtain down on a 24-year career that saw him become one of wrestling's biggest stars.",
      "After sending John Cena out on a loss, Gunther has a new 'legend killer' nickname, and young talent shines.",
      "John Cena tapped out to Gunther in his final match at WWE Saturday Night's Main Event. Here are the five huge takeaways and full results.",
      "John Cena wrestled his last match at WWE Saturday Night's Main Event, and it went down in spectacular fashion."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/bbea/live/a3411430-d8ca-11f0-a8dc-93c15fe68710.jpg",
    "titles": [
      "Watch: John Cena takes his final bow, after last ever WWE fight",
      "John Cena takes his last bow at WWE Saturday Night's Main Event",
      "WWE Saturday Night’s Main Event Results: 5 Takeaways After John Cena's Final Match",
      "WWE Saturday Night’s Main Event Takeaways As John Cena Calls It Quits"
    ],
    "url": "https://www.bbc.com/news/videos/cy4xgxm2848o?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://www.espn.com/wwe/story/_/id/47300293/wwe-john-cena-takes-last-bow-saturday-night-main-event",
      "https://www.forbes.com/sites/brianmazique/2025/12/13/wwe-saturday-nights-main-event-results-5-takeaways-after-john-cenas-final-match/",
      "https://www.forbes.com/sites/robwolkenbrod/2025/12/13/wwe-saturday-nights-main-event-takeaways-as-john-cena-calls-it-quits/"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/news/videos/cy4xgxm2848o?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.736,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.677,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "John Cena ended his 24-year wrestling career with his final match at WWE Saturday Night's Main Event, where he lost to Gunther by submission. Gunther, now nicknamed the \"legend killer,\" gained attention for the victory, while several young wrestlers also stood out during the event.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Tottenham manager says mistakes led to loss against Forest",
    "domain": "sports",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Sun, 14 Dec 2025 18:30:58 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Sky Sports"
    ],
    "domains": [
      "bbc.com",
      "skysports.com"
    ],
    "snippets": [
      "\"It's pretty evident if no-one gets the time, no-one can turn it around,\" says Thomas Frank as Spurs beaten at Nottingham Forest.",
      "Individual errors, poor passing, losing duels and the squad's inability to respond correctly to setbacks were among the reasons Tottenham boss Thomas Frank listed for his side's 3-0 defeat at Nottingham Forest."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/fb48/live/cd6ffd40-d913-11f0-b67b-690eb873de1b.jpg",
    "titles": [
      "'Burning, annoying' - Frank calls for time after 'very bad' Spurs loss",
      "'No quick fix' - Frank highlights Spurs issues after 'burning annoying' loss at Forest"
    ],
    "url": "https://www.bbc.com/sport/football/articles/cqlk4pr3e6ko?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://www.skysports.com/football/news/12040/13483408/tottenham-thomas-frank-highlights-a-range-of-spurs-problems-after-step-back-3-0-loss-at-nottingham-forest"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/sport/football/articles/cqlk4pr3e6ko?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.951,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.674,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Tottenham manager Thomas Frank cited individual errors, poor passing, and an inability to respond to setbacks as key reasons for his team's 3-0 loss to Nottingham Forest. Frank emphasized that without adequate time, it is difficult for anyone to improve the situation.",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Police arrest five men over planned attack at German Christmas market",
    "domain": "business",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Sun, 14 Dec 2025 08:46:19 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Deutsche Welle",
      "Reuters"
    ],
    "domains": [
      "bbc.com",
      "dw.com",
      "news.google.com"
    ],
    "snippets": [
      "Local media says one of the suspects is an imam at a mosque, and police allege he \"called for a vehicle attack\".",
      "The five men are suspected of planning an Islamist-motivated attack on a Christmas market in southern Germany, the Munich public prosecutor's office said.",
      "German authorities arrest five men suspected of planning Christmas market attack Reuters"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/fc21/live/a753ba70-d8c3-11f0-bcc5-99954b034d81.jpg",
    "titles": [
      "Five arrested over plot to attack German Christmas market",
      "Germany: 5 arrested for suspected Christmas market plot",
      "German authorities arrest five men suspected of planning Christmas market attack - Reuters"
    ],
    "url": "https://www.bbc.com/news/articles/c2dz7r708dxo?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://www.dw.com/en/germany-5-arrested-for-suspected-christmas-market-plot/a-75148071?maca=en-rss-en-top-1022-rdf",
      "https://news.google.com/rss/articles/CBMiuwFBVV95cUxPSjVxRHBueWZtSWlaRGNQZ0ZQU0I0UEFVOVVWZzJrZE1XaVVReWg3SUpfM2NuaDFBU0l3U1JDTlduNjRZRTcyd2ltR1FxX21oY3VjMVlZMEpXY3V1ZUllcnFsQ0szZ3pJX0ZMQ05tNG56N0tHOTVIMUxKZXNVeWhnQ0RqS2J0X1B1aGMxakd2anUxeURPOEdUSVpzdGdBdUN1Zm1XS25IYTVXOFIwenNQTVJxQ3NFMHUzOWdr?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/news/articles/c2dz7r708dxo?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.726,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.674,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "negative_penalty=0.08 (keywords: attack); semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "German authorities have arrested five men suspected of planning an Islamist-motivated attack on a Christmas market in southern Germany, according to the Munich public prosecutor's office. Local media report that one suspect is an imam at a mosque and is alleged by police to have called for a vehicle attack. The investigation is ongoing.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Ukraine may stop trying to join NATO if it gets new security",
    "domain": "business",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Sun, 14 Dec 2025 15:56:43 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Financial Times"
    ],
    "domains": [
      "aljazeera.com",
      "ft.com"
    ],
    "snippets": [
      "The Ukrainian president says Kyiv could drop its long-held ambition of joining NATO in exchange for security guarantees.",
      "Zelenskyy says Kyiv still needs US and European protection guarantees ahead of Berlin talks"
    ],
    "image_url": "",
    "titles": [
      "Zelenskyy says willing to drop NATO membership bid ahead of peace talks",
      "Ukraine offers to drop Nato membership demands"
    ],
    "url": "https://www.aljazeera.com/news/2025/12/14/zelenskyy-says-willing-to-drop-nato-membership-bid-ahead-of-peace-talks?traffic_source=rss",
    "alternate_urls": [
      "https://www.ft.com/content/c98d24a4-0df3-43dd-a008-56feb0266f45"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2025/12/14/zelenskyy-says-willing-to-drop-nato-membership-bid-ahead-of-peace-talks?traffic_source=rss",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.886,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.66,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Ukrainian President Volodymyr Zelenskyy stated that Kyiv may abandon its goal of joining NATO if it receives strong security guarantees. Zelenskyy emphasized the need for continued US and European protection ahead of upcoming talks in Berlin. The comments reflect a possible shift in Ukraine’s approach to its security amid ongoing conflict.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Ukraine may accept security help from US and Europe",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Sun, 14 Dec 2025 16:10:08 GMT",
    "source": "Bloomberg",
    "sources": [
      "Bloomberg",
      "Financial Post"
    ],
    "domains": [
      "news.google.com",
      "financialpost.com"
    ],
    "snippets": [
      "Zelenskiy Eyes US Guarantees as He Meets With Witkoff, Kushner Bloomberg.com",
      "President Volodymyr Zelenskiy signaled that Ukraine could accept security guarantees from the US and Europe as a way to prevent future Russian aggression, and substitute for its long-term goal of joining NATO."
    ],
    "image_url": "",
    "titles": [
      "Zelenskiy Eyes US Guarantees as He Meets With Witkoff, Kushner - Bloomberg.com",
      "Zelenskiy Eyes US Guarantees as He Meets With Witkoff, Kushner"
    ],
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxPaXBPWFAyMS1nUUMyVlo3NjdnY1RYdHA4aWxZNmlfWHRqRV95bklLMGVUOVBwcXR1UE52eVpFd0UxdnFkZHRnZ1c1RGlYcXE1UHAzdzhyOHRhSlFlXzdreFRWX0RJWGxXMmIta2dMc3hUNWVyaUlYVlNVam1rd1VaYUN2dXpIMl90eXlwUVgzU1dBdlY1RDd4ZUpnaVRWSFc2UjFhdTlLeGtWWHZleFo5QnJR?oc=5",
    "alternate_urls": [
      "https://financialpost.com/pmn/business-pmn/zelenskiy-eyes-us-eu-guarantees-to-prevent-future-aggression"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMisgFBVV95cUxPaXBPWFAyMS1nUUMyVlo3NjdnY1RYdHA4aWxZNmlfWHRqRV95bklLMGVUOVBwcXR1UE52eVpFd0UxdnFkZHRnZ1c1RGlYcXE1UHAzdzhyOHRhSlFlXzdreFRWX0RJWGxXMmIta2dMc3hUNWVyaUlYVlNVam1rd1VaYUN2dXpIMl90eXlwUVgzU1dBdlY1RDd4ZUpnaVRWSFc2UjFhdTlLeGtWWHZleFo5QnJR?oc=5",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.891,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.656,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Ukrainian President Volodymyr Zelenskiy stated that Ukraine is considering accepting security guarantees from the US and European countries as an alternative to immediate NATO membership, aiming to deter future Russian aggression. This approach is intended to provide protection while long-term alliance goals remain unresolved.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Alphabet investment in SpaceX is now worth more money",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Sun, 14 Dec 2025 15:00:00 GMT",
    "source": "Bloomberg",
    "sources": [
      "Bloomberg",
      "Fortune"
    ],
    "domains": [
      "news.google.com",
      "fortune.com"
    ],
    "snippets": [
      "Alphabet Poised for Another Paper Gain as SpaceX Valuation Jumps Bloomberg.com",
      "Alphabet, Google’s parent, has been an investor in SpaceX since at least 2015, when it joined Fidelity Investments in a $1 billion funding round for a combined stake of about 10% at the time."
    ],
    "image_url": "",
    "titles": [
      "Alphabet Poised for Another Paper Gain as SpaceX Valuation Jumps - Bloomberg.com",
      "Alphabet poised for another paper gain as SpaceX valuation jumps"
    ],
    "url": "https://news.google.com/rss/articles/CBMitgFBVV95cUxNUDk2WEtGZ3VDd0RXcEJzQ3JxdExPd0plTTdJVlRENUhsdktOMkNNV29vNFN4VldIaFAzbnItX2dqVDlOdjB6aGhhSnpnYnlDY3FmZ09nN1pDdmVjMUNyVUNCbHpyLTZsUWRhZVpiSnFYTUM4WnFZVzhPeWRFTWJfSmZRc1ZBNzFmVVdZZ0VNdXgyZk5JX2I5XzdRa19jS0V5TkNjcFpGZ3h2NzZ6MWJwRFJnSnpmdw?oc=5",
    "alternate_urls": [
      "https://fortune.com/2025/12/14/alphabet-stock-gain-spacex-investment-stake-valuation-musk/"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMitgFBVV95cUxNUDk2WEtGZ3VDd0RXcEJzQ3JxdExPd0plTTdJVlRENUhsdktOMkNNV29vNFN4VldIaFAzbnItX2dqVDlOdjB6aGhhSnpnYnlDY3FmZ09nN1pDdmVjMUNyVUNCbHpyLTZsUWRhZVpiSnFYTUM4WnFZVzhPeWRFTWJfSmZRc1ZBNzFmVVdZZ0VNdXgyZk5JX2I5XzdRa19jS0V5TkNjcFpGZ3h2NzZ6MWJwRFJnSnpmdw?oc=5",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.863,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.654,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Alphabet, the parent company of Google, has held a stake in SpaceX since 2015, when it joined Fidelity Investments in a $1 billion funding round for about 10% ownership at that time. Recent increases in SpaceX’s valuation are expected to boost the value of Alphabet’s investment.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Belarus frees Maria Kolesnikova and others from jail",
    "domain": "general",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Sun, 14 Dec 2025 11:11:48 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "BBC"
    ],
    "domains": [
      "aljazeera.com",
      "bbc.com"
    ],
    "snippets": [
      "Prisoners released from jail in Belarus as part of a sanctions-relief deal with the US, reunited with their loved ones.",
      "\"It's a feeling of incredible happiness,\" says political prisoner Maria Kolesnikova, freed after more than five years."
    ],
    "image_url": "",
    "titles": [
      "Video: Belarus frees prisoners after US lifts potash sanctions",
      "'Never give up': Belarusian prisoners celebrate release after US lifts sanctions"
    ],
    "url": "https://www.aljazeera.com/video/newsfeed/2025/12/14/video-belarus-frees-prisoners-after-us-lifts-potash-sanctions?traffic_source=rss",
    "alternate_urls": [
      "https://www.bbc.com/news/articles/cvg1r89m6g7o?at_medium=RSS&at_campaign=rss"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/video/newsfeed/2025/12/14/video-belarus-frees-prisoners-after-us-lifts-potash-sanctions?traffic_source=rss",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.776,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.622,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Several prisoners, including political activist Maria Kolesnikova, were released from jail in Belarus as part of a sanctions-relief agreement with the United States. Kolesnikova, who had been imprisoned for over five years, reunited with her family. The releases mark a key outcome of the recent US-Belarus negotiations.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Minnesota Wild win 3 to 2 over Ottawa Senators",
    "domain": "politics",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Sat, 13 Dec 2025 23:37:30 GMT",
    "source": "NHL",
    "sources": [
      "NHL",
      "Sportsnet"
    ],
    "domains": [
      "news.google.com",
      "sportsnet.ca"
    ],
    "snippets": [
      "Eriksson Ek scores late, Wild recover against Senators NHL.com",
      "Joel Eriksson Ek scored with 23.1 seconds remaining to lift the Minnesota Wild to a 3-2 win over the Ottawa Senators on Saturday."
    ],
    "image_url": "",
    "titles": [
      "Eriksson Ek scores late, Wild recover against Senators - NHL.com",
      "Joel Eriksson Ek’s late goal lifts Wild past Senators"
    ],
    "url": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxPODlGNmsxTzRycDNYc1hvM2hlU1ZGbzdTWlB5YnhUSDRydEhyTVFSN2UxTERkaFpZaEl1WjIxbnhCbExrbFJlLWFqd0FNaXpOQ1FmQlFMbF9UVC1jY3lEX2FEcmFBTEZhSlBUNjhTTFB6NW53a3ppV3NsUG5jQjZPTUZ1QXNUMGpxVmZn?oc=5",
    "alternate_urls": [],
    "location_scope": "national",
    "link": "https://news.google.com/rss/articles/CBMiiwFBVV95cUxPODlGNmsxTzRycDNYc1hvM2hlU1ZGbzdTWlB5YnhUSDRydEhyTVFSN2UxTERkaFpZaEl1WjIxbnhCbExrbFJlLWFqd0FNaXpOQ1FmQlFMbF9UVC1jY3lEX2FEcmFBTEZhSlBUNjhTTFB6NW53a3ppV3NsUG5jQjZPTUZ1QXNUMGpxVmZn?oc=5",
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.563,
      "consensus": 0.591,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.6,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness of a sports event, but doesn't offer any deeper understanding or insight. It doesn't report on solutions, improvements or innovations, nor does it increase clarity around systems, causes, trends, or impacts that matter.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Joel Eriksson Ek scored with 23.1 seconds left, securing a 3-2 victory for the Minnesota Wild over the Ottawa Senators on Saturday. The Wild overcame a late deficit to win the game.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Fernando Mendoza wins the 2025 Heisman Trophy",
    "domain": "politics",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Sun, 14 Dec 2025 01:08:00 GMT",
    "source": "Sports Illustrated",
    "sources": [
      "Sports Illustrated"
    ],
    "domains": [
      "news.google.com"
    ],
    "snippets": [
      "2025 Heisman Trophy: Full Voting Results Revealed Sports Illustrated",
      "The Case for Jeremiyah Love to Take Heisman Trophy Over 2025 Winner Fernando Mendoza Sports Illustrated"
    ],
    "image_url": "",
    "titles": [
      "2025 Heisman Trophy: Full Voting Results Revealed - Sports Illustrated",
      "The Case for Jeremiyah Love to Take Heisman Trophy Over 2025 Winner Fernando Mendoza - Sports Illustrated"
    ],
    "url": "https://news.google.com/rss/articles/CBMijAFBVV95cUxNTFZGbFpFeW1KRFlXLUVnYmtSM3p4NmNlZWxqNVM5MVRiZ3dKOUxqZUtqRDU2YU5mYmFSNUpWaUpma00ySTBTelBlWjh4RFBnc1RmeVRVck8tZWdfd290UmxWSHVrRzljUmFiWDc3akJVdUNGVmdtdFR0cFhvOWhlX3pXN0Y4WnZTY2RBTA?oc=5",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMirgFBVV95cUxQWDk2clhodjgxSWNGdk5tQmx3eEFrbWpFaGxnYWM5Y3MwYTNSd1pIM1FqTE5jQzBxR2xYdlVHR3FyVW1JRHo5MFBxZFpuRU5veF9Ib3A0QjAyenFuQ1FYaW5lXzZWMWtIRVNEcGRkNHFERERCWExfLXg1MDlNbmJvU0I3cDUxSXlybkJQeDdMS0xRSE5KUDlOejBjX3hwbS1jLVRsLW5PMDh0dWUxMmc?oc=5"
    ],
    "location_scope": "national",
    "link": "https://news.google.com/rss/articles/CBMijAFBVV95cUxNTFZGbFpFeW1KRFlXLUVnYmtSM3p4NmNlZWxqNVM5MVRiZ3dKOUxqZUtqRDU2YU5mYmFSNUpWaUpma00ySTBTelBlWjh4RFBnc1RmeVRVck8tZWdfd290UmxWSHVrRzljUmFiWDc3akJVdUNGVmdtdFR0cFhvOWhlX3pXN0Y4WnZTY2RBTA?oc=5",
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.587,
      "consensus": 0.35,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.438,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness of the Heisman Trophy voting results, but doesn't provide any deeper understanding or insight. It doesn't report on solutions, improvements or innovations, nor does it increase clarity around systems, causes, trends, or impacts that matter.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Fernando Mendoza has won the 2025 Heisman Trophy, according to official voting results released by Sports Illustrated. Jeremiyah Love was also a leading contender, with some analysts arguing he had a strong case for the award. The announcement confirms Mendoza as the winner for 2025.",
    "is_trending": false,
    "trending_score": 0.0
  }
]