[
  {
    "title": "Piastri Wins Dutch GP, Extends Lead; Norris, Hamilton Out",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 31 Aug 2025 15:39:07 GMT",
    "source": "BBC",
    "sources": [
      "Yahoo Sports",
      "The Guardian",
      "Al Jazeera",
      "Sky Sports",
      "BBC"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.bbc.com",
      "www.theguardian.com",
      "www.skysports.com"
    ],
    "snippets": [
      "Lando Norris retires with an apparent engine failure as McLaren team-mate Oscar Piastri takes a controlled victory in the Dutch Grand Prix.",
      "Norris&#039;s title chances took a heavy blow when his McLaren broke down after smoke poured from the back of the car.",
      "Lando Norris retires with an apparent engine failure as McLaren team-mate Oscar Piastri takes a controlled victory in the Dutch Grand Prix.",
      "<ul><li><p>Win extends Australian’s championship lead to 34 points</p></li><li><p>Lewis Hamilton crashes out early after unforced error</p></li></ul><p>Oscar Piastri won the Dutch Grand Prix with a dominant drive to victory from pole position, a win which may have turned the course of the world cham",
      "Oscar Piastri won a dramatic Dutch Grand Prix as his McLaren team-mate Lando Norris' championship chances were dealt a huge blow as he retired late on at Zandvoort."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/9844/live/098d6980-867a-11f0-84c8-99de564f0440.jpg",
    "titles": [
      "Norris retires as Piastri wins chaotic Dutch GP",
      "Piastri wins Dutch GP as Norris’s McLaren breaks down",
      "Norris retires as Piastri wins chaotic Dutch GP",
      "Piastri opens gap in title race after Norris forced to retire from F1 Dutch GP",
      "Piastri wins dramatic Dutch GP as Norris' title chances dealt huge blow"
    ],
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.97,
      "consensus": 0.975,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.818,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Oscar Piastri won the Dutch Grand Prix, extending his championship lead to 34 points, after a dominant performance from pole position. Meanwhile, his McLaren teammate, Lando Norris, retired from the race due to an apparent engine failure, significantly impacting his title chances. Lewis Hamilton also exited early after an unforced error.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Israeli Airstrike Kills Yemeni Houthi PM and Ministers in Sanaa",
    "domain": "general",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Sun, 31 Aug 2025 01:56:37 GMT",
    "source": "The Guardian",
    "sources": [
      "Financial Post",
      "The Guardian",
      "Washington Post",
      "New York Times"
    ],
    "domains": [
      "www.washingtonpost.com",
      "www.theguardian.com",
      "financialpost.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "<p>Ahmed al-Rahawi killed alongside several ministers gathered for prerecorded speech by rebel group’s leader</p><p>An Israeli airstrike killed the prime minister of the Houthi rebel-controlled government in Yemen’s capital, Sana’a, the Houthis have said.</p><p>Ahmed al-Rahawi was killed in a strike",
      "Prime Minister Ahmad al-Rahawi and several ministers were killed in an Israeli strike Thursday on Sanaa, the Houthis said.",
      "Ahmed al-Rahawi had led the Houthi cabinet in Yemen since 2024. His killing is unlikely to halt the Iranian-backed group’s missile attacks on Israel.",
      "The prime minister of Yemen’s Houthi government was killed in Israeli strikes on Thursday, along with a number of ministers, the group’s presidency said in a statement."
    ],
    "image_url": "https://i.guim.co.uk/img/media/233c8e99e93a6aef56ad839313d558f03faafe9f/0_225_1839_1470/master/1839.jpg?width=140&quality=85&auto=format&fit=max&s=8cbd0988c46fe71e1c2ba98ca3a4971b",
    "titles": [
      "Israeli airstrike kills Houthi prime minister in Yemen, rebels say",
      "Netanyahu vows more attacks after Israeli strike kills Houthi prime minister",
      "Houthis Say Prime Minister Was Killed in Israeli Attack",
      "Yemen’s Houthis Say Prime Minister Died in Israeli Strike"
    ],
    "score_components": {
      "magnitude": 0.952,
      "recency": 0.729,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.756,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Ahmed al-Rahawi, the Prime Minister of the Houthi-controlled government in Yemen, and several ministers were killed in an Israeli airstrike on Sanaa. The strike, confirmed by Israel's military as targeting a Houthi location, represents a significant escalation in the conflict involving the Iranian-backed Houthis. Al-Rahawi's death marks the highest-profile casualty in the ongoing Israeli-U.S. campaign against the rebels. Despite his killing, it is reported that the incident is unlikely to stop the Houthis' missile attacks on Israel.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Israel Kills Hamas Spokesperson in Gaza Airstrike; Tensions Escalate",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-08-31T13:38:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "Financial Post",
      "Global News"
    ],
    "domains": [
      "globalnews.ca",
      "financialpost.com",
      "www.dw.com"
    ],
    "snippets": [
      "Israel announced that prominent Hamas spokesperson Abu Obeida was killed by an Israeli strike. It comes as Israel's major Gaza City offensive is underway. DW has more.",
      "Israel says it killed Hamas spokesperson Abu Obeida in Gaza as at least 43 Palestinians died over the weekend amid renewed fighting, worsening hunger, and mass displacement.",
      "Israel claimed it killed an iconic Hamas spokesman in a Gaza City airstrike, and said more such blows would follow if a sweep of the Palestinian Islamist faction’s last stronghold goes ahead as planned."
    ],
    "image_url": "",
    "titles": [
      "Israel says Hamas spokesman killed in Gaza airstrike",
      "Israel kills Hamas spokesperson as hospitals report dozens killed in Gaza City",
      "Israel Says It Killed Key Hamas Spokeman as Cabinet Meets"
    ],
    "score_components": {
      "magnitude": 0.887,
      "recency": 0.95,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.748,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Israel announced the death of Hamas spokesperson Abu Obeida in an airstrike in Gaza City, amid a significant offensive. This action coincides with a weekend that saw at least 43 Palestinian fatalities, escalating hunger, and widespread displacement. The Israeli military has warned of further strikes against Hamas if operations in the region continue as planned.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Norway and UK Sign £10bn Anti-Submarine Warship Deal, Boosting Jobs",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 31 Aug 2025 14:36:04 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian",
      "Financial Times"
    ],
    "domains": [
      "www.bbc.com",
      "www.theguardian.com",
      "www.ft.com"
    ],
    "snippets": [
      "The government says the agreement will support thousands of jobs, including more than 2,000 in Scotland.",
      "The £10bn agreement will deliver major boost for British defence industry and Glasgow shipyards",
      "<p>MoD says agreement will support 4,000 jobs and ‘significantly strengthen Nato’s northern flank’</p><p>Norway has agreed a £10bn deal for anti-submarine warships that will be built in the UK, as the two countries plan joint operations in northern Europe to deal with <a href=\"https://www.theguardia"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/26f3/live/2cdbfc10-8677-11f0-af50-c1dc79fc71e5.jpg",
    "titles": [
      "UK secures £10bn deal to supply Norway with warships",
      "UK secures its largest ever warship deal from Norway",
      "Norway signs £10bn deal for anti-submarine warships built in UK"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.949,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.737,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Norway has entered a £10bn deal for anti-submarine warships to be built in the UK, expected to support 4,000 jobs, including over 2,000 in Scotland, and boost the British defence industry. The agreement, aimed at strengthening NATO's northern flank, involves joint operations in northern Europe.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Indonesia's President Subianto Vows Policy Revocation Amid Protests",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 31 Aug 2025 13:36:31 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Deutsche Welle",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.bbc.com",
      "www.dw.com"
    ],
    "snippets": [
      "The move aims to subdue anti-government demonstrations that have swept across the country.",
      "Prabowo Subianto says some parliament policies to be revoked as he also promises stern action against rioters, looters.",
      "President Prabowo Subianto has addressed the ongoing protests against economic inequality in Indonesia and appeared to offer major concessions. The protests intensified after police killed a young delivery driver."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/b316/live/9b1adae0-8666-11f0-b391-6936825093bd.jpg",
    "titles": [
      "Indonesian politicians to have perks cut in bid to quell unrest",
      "Indonesian president says lawmakers’ perks to be cut after deadly protests",
      "Indonesia: President calls protests 'treason and terrorism'"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.93,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.733,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "President Prabowo Subianto of Indonesia has responded to widespread anti-government protests, sparked by economic inequality and exacerbated by the police killing of a young delivery driver. Subianto announced intentions to revoke certain parliamentary policies and promised strict measures against rioters and looters in an effort to quell the demonstrations.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Liverpool vs. Arsenal: Premier League Giants Clash Sunday",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sun, 31 Aug 2025 12:05:44 +0000",
    "source": "CBS Sports",
    "sources": [
      "Sports Illustrated",
      "CBS Sports",
      "The Guardian"
    ],
    "domains": [
      "www.cbssports.com",
      "www.theguardian.com",
      "news.google.com"
    ],
    "snippets": [
      "What will happen when two of the Premier League's title favorites square off on Sunday?",
      "<ul><li><p>Follow every kick of crunch 4.30pm (BST) kick-off</p></li><li><p>Thoughts on the game? Email Will <a href=\"mailto:will.unwin.freelancer@theguardian.com\">here</a></p></li></ul><p><strong>Eze begins life at Arsenal with a watching brief.</strong></p><p><strong>Brighton are beating City.</st",
      "<a href=\"https://news.google.com/rss/articles/CBMijgFBVV95cUxPV244ZDlEOEF2MG8tNWg1aFg4X3NQcEEyV3NfUFh2ZE1kNVJFOW9kU3h0M3ktWTZLRFBPSm82X2E5OVVMYU5NbmFCTGxZWXN6Sl9OQ3dZcEhtRHZudWhjZDdGbVN1bXJ6X3RRWEthWExNUW5pUFFpa1RsMXdvNjI4VEY2VlU4LXRoN0RydUVB?oc=5\" target=\"_blank\">How to Watch Liverpool vs. Arsenal "
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/08/31/e1f9bf43-957d-438e-a6de-be9bbc3caed9/untitled-design-2025-08-31t140338-465.png",
    "titles": [
      "Liverpool vs. Arsenal live stream: Where to watch Premier League online, odds, predicted lineup, TV channel",
      "Liverpool v Arsenal: Premier League updates – live",
      "How to Watch Liverpool vs. Arsenal on TV, Live Stream - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.92,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.721,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Two of the Premier League's title favorites, Liverpool and Arsenal, are set to clash on Sunday at 4.30pm (BST). The match is highly anticipated, with Arsenal's Eze expected to start on the bench. In another match, Brighton is currently leading against Manchester City. Fans can follow the Liverpool vs. Arsenal game through various live updates and commentary.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Violent Clashes at March for Australia Rallies Amid Hate Speech Claims",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 31 Aug 2025 09:29:39 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Al Jazeera",
      "The Guardian"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.bbc.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "March for Australia rallies were condemned by the centre-left government as \"spreading hate\".",
      "Police in Australia used pepper spray as clashes broke out between anti-immigration demonstrators &amp; counter-protesters.",
      "<p>One Nation leader Pauline Hanson joins gathering in Canberra while far-right figure speaks outside state parliament in Melbourne</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/aug/31/australia-news-live-victoria-premier-anti-immigrant-protests-sydney-marathon-porepunk"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/9beb/live/843f1bd0-8641-11f0-a1bf-a3698e2d3fe1.jpg",
    "titles": [
      "Thousands attend Australia anti-immigration rallies",
      "Clashes break out at anti-immigration protest in Australia",
      "Neo-Nazis and politicians among protesters at anti-immigration March for Australia rallies"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.853,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.714,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In Australia, March for Australia rallies, criticized by the centre-left government for \"spreading hate,\" led to violent clashes. Police used pepper spray to manage the conflict between anti-immigration demonstrators and counter-protesters. Notable participants included One Nation leader Pauline Hanson in Canberra and a far-right figure speaking in Melbourne.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Canadian Federal Workers' Sick Days Revert to Pre-Pandemic Levels",
    "domain": "general",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sun, 31 Aug 2025 13:31:06 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "CityNews"
    ],
    "domains": [
      "globalnews.ca",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "Federal public servants took fewer sick days during peak pandemic remote work, but sick leave has now risen to pre-COVID levels, with 9.2 days on average in 2023–24.",
      "OTTAWA — Federal public servants were less likely to call in sick to work during the height of the COVID-19 pandemic, new government data shows. The figures shared by the Treasury Board of Canada Secretariat indicate that in 2020-21, when the pandemic had most office employees working entirely remot"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/08/00c7bf336ca532d25ee0540c2972c0017559bde92d453b2315fb00c6ae8d2bd8.jpg?quality=65&strip=all",
    "titles": [
      "Number of sick days taken by public servants growing post-COVID",
      "Number of sick days taken by public servants growing post-COVID"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.948,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.702,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "During the COVID-19 pandemic's peak, federal public servants in Canada took fewer sick days while working remotely. However, government data from the Treasury Board of Canada Secretariat reveals that sick leave has returned to pre-pandemic levels, with an average of 9.2 days taken in 2023-24.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "PEI Man Under Terrorism Peace Bond, Internet and Passport Restricted",
    "domain": "general",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sun, 31 Aug 2025 12:08:17 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "CityNews"
    ],
    "domains": [
      "globalnews.ca",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "A P.E.I. man under a terrorism peace bond must follow strict conditions, including no internet access and no passport, after RCMP seized 3D-printed gun parts.",
      "CHARLOTTETOWN — A Prince Edward Island man facing a terrorism peace bond has been ordered to follow a raft of conditions, including not accessing the internet and not holding a passport. The RCMP in Prince Edward Island sought a terrorism peace bond for the 51-year-old man, fearing he may commit a t"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/08/63178d78eb875c2057da7f699649ce697cb8d9b7df86d952901730e88d999e20_9e926b.jpg?quality=65&strip=all",
    "titles": [
      "Terrorism peace bond prohibits P.E.I. man from accessing internet or having passport",
      "Terrorism peace bond prohibits P.E.I. man from accessing internet or having passport"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.921,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.689,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A 51-year-old man from Prince Edward Island is under a terrorism peace bond, enforced by the RCMP, which includes conditions such as no internet access and no passport possession. This follows the seizure of 3D-printed gun parts by the authorities.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UCLA's Iamaleava Debuts with 136 Yards in Loss to Utah",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sun, 31 Aug 2025 11:52:29 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "Nico Iamaleava threw for 136 yards with a touchdown and an interception and led UCLA with 47 rushing yards in a lopsided, season-opening loss to Utah.",
      "Iamaleava struggled in his debut as UCLA's quarterback"
    ],
    "image_url": "",
    "titles": [
      "Iamaleava: Only way is up after UCLA debut dud",
      "Nico Iamaleava gets a reality check in Utah's rout of UCLA: Tennessee transfer's debut falls flat"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.995,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.689,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In his debut as UCLA's quarterback, Nico Iamaleava threw for 136 yards, achieving one touchdown and one interception, and led the team with 47 rushing yards. Despite his efforts, UCLA faced a significant defeat in their season opener against Utah.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Doncic, Antetokounmpo Shine in EuroBasket Wins for Slovenia, Greece",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sun, 31 Aug 2025 11:52:29 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Luka Doncic posted the fourth triple-double at EuroBasket since 1995 to power Slovenia to its first win, while Giannis Antetokounmpo returned with 27 points to help Greece stay perfect with a 94-53 rout of Georgia.",
      "<p>Luka Doncic’s triple-double powered Slovenia to an 86-69 victory over Belgium on Sunday and its first win at EuroBasket. Also, Giannis Antetokounmpo returned with 27 points to help Greece stay perfect with a 94-53 rout of Georgia.</p>"
    ],
    "image_url": "",
    "titles": [
      "Doncic's rare Euro triple-double carries Slovenia",
      "Doncic’s triple-double powers Slovenia to EuroBasket win over Belgium"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.995,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.679,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Luka Doncic achieved a triple-double, leading Slovenia to its first EuroBasket win against Belgium, 86-69. Meanwhile, Giannis Antetokounmpo scored 27 points in his return, guiding Greece to maintain a perfect record with a 94-53 victory over Georgia.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "2025 NFL Fantasy Insights: Breakouts, Busts, and Draft Strategy Revealed",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sun, 31 Aug 2025 11:52:28 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "Weekly individual and composite rankings for each position in PPR and IDP formats, as well as Eric Karabell's superflex ranks.",
      "SportsLine simulated the NFL season 10,000 times and revealed its 2025 Fantasy football breakouts for 2025 Fantasy football draft prep",
      "SportsLine simulated the new NFL season 10,000 times and identified Fantasy football busts 2025 to fade during your Fantasy football draft prep",
      "SportsLine simulated the new NFL season 10,000 times to help form your 2025 Fantasy football draft strategy"
    ],
    "image_url": "",
    "titles": [
      "🏈 Fantasy football PPR rankings for Week 1",
      "Fantasy football rankings 2025: Top breakouts from model that nailed Jayden Daniels' huge season",
      "Fantasy football rankings 2025: Busts from the computer simulation that called Mostert's challenging year",
      "Fantasy football rankings 2025: Sleepers, breakouts, busts by model that called Stroud's rough second season"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.995,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.679,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "SportsLine conducted 10,000 simulations of the new NFL season, providing insights for 2025 Fantasy football including breakouts, busts, and overall draft strategy. Additionally, weekly rankings for both PPR and IDP formats, along with Eric Karabell's superflex ranks, are available to assist with draft preparation and season planning.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Osaka vs. Gauff in U.S. Open Fourth Round Showdown",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sun, 31 Aug 2025 11:34:10 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "Osaka and Gauff will meet in the fourth round on Monday. And it's more of a toss-up than recent results suggest.",
      "Osaka is chasing her first major title since 2021 while Gauff is looking to win the US Open for a second time"
    ],
    "image_url": "",
    "titles": [
      "Coco Gauff vs. Naomi Osaka: Who will win?",
      "US Open 2025: Coco Gauff, Naomi Osaka set for what could be an epic battle years in the making in fourth round"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.989,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.678,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Naomi Osaka and Coco Gauff are set to compete in the fourth round of the U.S. Open on Monday night. This match is considered highly competitive, despite past results. Notably, in this U.S. Open, Coco Gauff achieved a first by not double-faulting or getting broken in her opening service game.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Conservative Leader Vows to Boost North Sea Oil, Gas Amid Climate Concerns",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 31 Aug 2025 15:26:44 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "www.bbc.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "The government warns Kemi Badenoch's plans would \"only accelerate the worsening climate crisis\".",
      "<p>Conservative leader says it is ‘absurd’ to shift away from fossil fuels and leave ‘vital resources untapped’</p><p>The Conservative party will aim to “maximise extraction” of oil and gas in the North Sea if it wins power, Kemi Badenoch has vowed.</p><p>The Tory party leader will use a speech in A"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/468a/live/43964620-85fc-11f0-9cf6-cbf3e73ce2b9.jpg",
    "titles": [
      "Tories pledge to get all oil and gas out of North Sea",
      "Tories would maximise North Sea oil and gas extraction, Badenoch to say"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.966,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.658,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Kemi Badenoch, a Conservative leader, plans to maximize oil and gas extraction in the North Sea if her party wins power, arguing against moving away from fossil fuels. This stance has drawn warnings from the government, which believes such actions would worsen the climate crisis.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Inter Miami Aims for Second Trophy Against Seattle Sounders",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sun, 31 Aug 2025 15:00:41 +0000",
    "source": "CBS Sports",
    "sources": [
      "Sports Illustrated",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "news.google.com"
    ],
    "snippets": [
      "Inter Miami will try to win their second trophy ever on Sunday night",
      "<a href=\"https://news.google.com/rss/articles/CBMiigFBVV95cUxQWENiTWJ1aGw1Sk14Ujl6RjlCaHVJZlF0RnhrX1FKVGkzcnJZWlV3VmVlampTYldGY0NvR3NBbXFzcjVWRW82X1pPZ3ZGbHo5cGZNM3VmRlRJbnR5eHhYd3lKNXJWbURVYjV6eEZzdTluRXZFckl5bUp5OXRUZFI4dmRjSXhxMndWelE?oc=5\" target=\"_blank\">Inter Miami Predicted Lineup vs. Seattle",
      "<a href=\"https://news.google.com/rss/articles/CBMiekFVX3lxTE53WUlvME9XS0FpT2RJeUJfYjF4a1YyWjFieko1cTJtbFhDMTNYM0hIUXZJMXhOZkVFLTM1eWItaTdWN0t0c1ZIaFFMa1oxam9Ja25BcWUzOWd1SF9QOFNhVXhaMldNVUZlbU5jd1lsMTBnekZpWGZjRVNR?oc=5\" target=\"_blank\">‘Messi Is the Best… But We’ve Got Rothrock’—Seattle Sounders Co"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/08/31/fecb3d49-7cee-48a8-a865-a871f7d0033a/untitled-design-2025-08-31t165442-432.png",
    "titles": [
      "Seattle Sounders vs. Inter Miami live stream: Where to watch Lionel Messi in all MLS Leagues Cup final",
      "Inter Miami Predicted Lineup vs. Seattle Sounders: Messi, Herons Seek Second Leagues Cup Title - Sports Illustrated",
      "‘Messi Is the Best… But We’ve Got Rothrock’—Seattle Sounders Confident Ahead of Leagues Cup Final - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.977,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.657,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Inter Miami is set to compete for their second trophy in the club's history on Sunday night. The team has announced its predicted lineup for the match against the Seattle Sounders, highlighting the significance of the game. Seattle Sounders, on the other hand, have expressed confidence in their player Rothrock, humorously comparing him to Lionel Messi. The outcome of this match will determine if Inter Miami can secure their second trophy.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Xi, Modi Pledge to Resolve Border Issues, Boost Cooperation",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sun, 31 Aug 2025 04:14:49 -0400",
    "source": "NPR",
    "sources": [
      "Financial Post",
      "NPR"
    ],
    "domains": [
      "financialpost.com",
      "www.npr.org"
    ],
    "snippets": [
      "Modi is on his first visit to China since relations between the two countries deteriorated after Chinese and Indian soldiers engaged in deadly border clashes in 2020.",
      "TIANJIN, China (AP) &#8212; Chinese leader Xi Jinping and Indian Prime Minister Narendra Modi pledged on Sunday to resolve their border differences and bolster cooperation ahead of the opening of a regional summit in Tianjin. Modi is on his first visit to China since relations between the two countr"
    ],
    "image_url": "",
    "titles": [
      "China's Xi and India's Modi vow to resolve border differences at meeting in Tianjin",
      "China’s Xi and India’s Modi vow to resolve border differences at a meeting in Tianjin"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.849,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.65,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Chinese leader Xi Jinping and Indian Prime Minister Narendra Modi, during Modi's first visit to China since the 2020 border clashes, have pledged to resolve their border differences and enhance cooperation. This commitment was made ahead of a regional summit in Tianjin, marking a significant step towards improving relations between the two countries.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Xi, Modi Meet Amid Summit, Signal China-India Rapprochement Amid Trade Tensions",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 31 Aug 2025 09:14:19 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Financial Times"
    ],
    "domains": [
      "www.bbc.com",
      "www.ft.com"
    ],
    "snippets": [
      "Xi Jinping and Narendra Modi met on the sidelines of a summit that Russia's Vladimir Putin is also attending.",
      "Donald Trump’s trade war drives a rapprochement between the world’s two most populous countries"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/90a9/live/a2c476a0-8677-11f0-b391-6936825093bd.jpg",
    "titles": [
      "China and India pledge to be 'partners not rivals'",
      "Xi and Modi say they are ‘partners not rivals’ in bid to repair ties"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.849,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.632,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Xi Jinping and Narendra Modi met on the sidelines of a summit attended by Vladimir Putin, signifying a rapprochement between China and India amid tensions from Donald Trump's trade war.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Drones Play AC/DC to Protect Cattle from Wolves Near CA-OR Border",
    "domain": "science",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Sun, 31 Aug 2025 01:18:16 -0400",
    "source": "ABC News",
    "sources": [
      "ABC News",
      "Phys.org"
    ],
    "domains": [
      "abcnews.go.com",
      "phys.org"
    ],
    "snippets": [
      "Biologists are using drones to scare wolves away from cattle",
      "For millennia humans have tried to scare wolves away from their livestock. Most of them didn't have drones."
    ],
    "image_url": "https://s.abcnews.com/images/US/wirestory_ea893a7f07796d03664b02a33dd5ddcb_4x3_384.jpg",
    "titles": [
      "Drones blasting AC/DC, Scarlett Johannson help biologists protect cattle from wolves",
      "Drones blasting AC/DC and Scarlett Johansson are helping biologists protect cattle from wolves"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.798,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.625,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Biologists near the California-Oregon border are using drones to deter wolves from cattle by playing AC/DC's \"Thunderstruck,\" movie clips, and live human voices. This innovative approach aims to protect livestock without harming the wolves, leveraging technology to continue a millennia-old human effort to safeguard animals.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Williams, Fernandez Reach U.S. Open Round of 16 in Doubles",
    "domain": "sports",
    "source_domain": "www.sportsnet.ca",
    "location": "national",
    "published": "Sat, 30 Aug 2025 23:06:26 EDT",
    "source": "Sportsnet",
    "sources": [
      "Sportsnet",
      "CityNews"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "<p>Felix Auger-Aliassime of Montreal promised fans he was &#8220;getting closer&#8221; after a recent rash of disappointing showings.</p>",
      "<p>Canadian Felix Auger-Aliassime takes match point against Germany&#8217;s Alexander Zverev to cap off the upset during the third round of the US Open.</p>",
      "<p>Venus Williams and Leylah Fernandez reached the third round of women’s doubles at the U.S. Open by defeating Ulrikke Eikeri and Eri Hozumi 7-6 (1), 6-1 on Saturday.</p>",
      "Felix Auger-Aliassime of Montreal promised fans he was &#8220;getting closer&#8221; after a recent rash of disappointing showings. After taking down the world&#8217;s third-ranked Alexander Zverev of Germany in Saturday&#8217;s third round of the U.S. Open, he wagged his finger at Louis Armstrong St"
    ],
    "image_url": "https://www.sportsnet.ca/wp-content/uploads/2025/08/FAA-4.jpg",
    "titles": [
      "Canada’s Auger-Aliassime stuns Zverev, advances to fourth round of US Open",
      "Auger-Aliassime clinches third-round win over Zverev at US Open",
      "Canada’s Fernandez, Williams reach third round of doubles at US Open",
      "Canada’s Auger-Aliassime stuns 3rd seed Zverev, advances to 4th round of US Open"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.763,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.608,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Venus Williams and Leylah Fernandez advanced to the Round of 16 at the U.S. Open after beating Ulrikke Eikeri and Eri Hozumi 7-6 (1), 6-1 in women's doubles. This result marks Williams' best Grand Slam performance in nearly ten years.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]