[
  {
    "title": "Seahawks beat 49ers to win NFC West and top playoff spot",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Sat, 3 Jan 2026 23:45:13 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports",
      "Sportsnet",
      "Yahoo Sports",
      "BBC Sport",
      "The Guardian"
    ],
    "domains": [
      "espn.com",
      "cbssports.com",
      "sportsnet.ca",
      "sports.yahoo.com",
      "bbc.com",
      "theguardian.com"
    ],
    "snippets": [
      "After the loss, the 49ers will have the No. 5 or the No. 6 seed when the playoffs begin next week.",
      "In a performance that would make the Legion of Boom proud, the Seahawks kept the 49ers out of the end zone and won 13-3 to secure the NFC's No. 1 seed.",
      "In what's been a chaotic regular season, three division races will come down to Week 18",
      "Zach Charbonnet scored on a 27-yard run in the first quarter and Seattle shut down the high-powered San Francisco offense in a 13-3 victory over the 49ers on Saturday night that secured the No. 1 seed for the Seahawks in the NFC playoffs.",
      "Here's where every NFL playoff contender stands.",
      "The Seattle Seahawks beat the San Francisco 49ers 13-3 to claim the NFC's No. 1 seed. Here are winners and losers from the Week 18 finale.",
      "Matt Maiocco hands out team grades for the San Francisco 49ers' 13-3 loss to the Seattle Seahawks on Saturday night.",
      "The San Francisco 49ers now will have to go on the road during the NFC playoffs after losing soundly to the Seattle Seahawks on Saturday night.",
      "The winner of this game will get a bye in the first round of the playoffs",
      "The Seattle Seahawks beat the San Francisco 49ers 13-3 to secure the NFC West title and top spot in the NFC.",
      "Seattle will get a bye in the first round of the playoffs and home-field advantage throughout.",
      "Seahawks shut down 49ers to secure NFC top seed Seattle ride defense and run game in 13-3 win Buccaneers survive Panthers, await NFC South fate Zach Charbonnet scored on a 27-yard run in the first quarter and Seattle shut down the high-powered San Francisco offense in a 13-3 victory over the 49ers o"
    ],
    "image_url": "",
    "titles": [
      "Seahawks silence 49ers' offense in Week 18, win NFC's No. 1 seed",
      "Seahawks silence 49ers, lock up NFC's No. 1 seed",
      "NFL playoff picture: Seahawks beat 49ers to claim No. 1 seed in NFC; Ravens-Steelers to decide AFC North",
      "Seahawks clinch NFC’s No. 1 seed with win over 49ers",
      "NFL playoff picture: Seahawks secure NFC No. 1 seed; 49ers fall to No. 5 and could end up No. 6 in conference",
      "Winners, losers as Seahawks claim NFC's No. 1 seed over 49ers with 13-3 win",
      "Grades for 49ers' frustrating loss to Seahawks, ending bid for NFC's No. 1 seed",
      "What we learned as 49ers' dream of NFC's No. 1 seed ends with loss to Seahawks",
      "49ers vs. Seahawks prediction: San Francisco and Seattle do battle for top seed in the NFC",
      "Seahawks beat 49ers to claim top spot in NFC",
      "Seahawks beat 49ers 13-3 for division title, NFC's top seed",
      "Seahawks clinch NFC’s No 1 seed as Buccaneers cling to playoff hopes"
    ],
    "url": "https://www.espn.com/nfl/story/_/id/47496166/nfl-san-francisco-49ers-seattle-seahawks-win-nfc-west-sam-darnold-brock-purdy",
    "alternate_urls": [
      "https://www.espn.com/nfl/story/_/id/47497275/seattle-seahawks-secure-nfc-no-1-seed-13-3-victory",
      "https://www.cbssports.com/nfl/news/2025-nfl-playoff-picture-standings-race/",
      "https://sports.yahoo.com/nfl/article/nfl-playoff-picture-week-18-2025-011601536.html",
      "https://sports.yahoo.com/articles/winners-losers-seahawks-claim-nfcs-230229450.html",
      "https://sports.yahoo.com/articles/grades-49ers-frustrating-loss-seahawks-211010857.html",
      "https://sports.yahoo.com/articles/learned-49ers-dream-nfcs-no-195142131.html",
      "https://www.cbssports.com/nfl/news/49ers-vs-seahawks-where-to-watch-pick-odds-prediction-saturday-nfc-west-showdown/",
      "https://www.bbc.com/sport/american-football/articles/c1504ywx8xzo?at_medium=RSS&at_campaign=rss",
      "https://sports.yahoo.com/articles/seahawks-beat-49ers-claim-top-090438262.html",
      "https://sports.yahoo.com/articles/seahawks-beat-49ers-13-3-035557188.html",
      "https://www.theguardian.com/sport/2026/jan/03/nfl-week-18-saturday-games-scores"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/nfl/story/_/id/47496166/nfl-san-francisco-49ers-seattle-seahawks-win-nfc-west-sam-darnold-brock-purdy",
    "score_components": {
      "magnitude": 0.986,
      "recency": 0.834,
      "consensus": 1.0,
      "constructiveness": 0.5,
      "proximity": 0.75
    },
    "score": 0.871,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This sports news story provides basic awareness about the result of a specific game and its implications for the teams involved. However, it lacks depth and does not offer any actionable insights or deeper understanding for the reader.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The Seattle Seahawks defeated the San Francisco 49ers 13-3, securing the NFC West title and the No. 1 seed in the NFC playoffs. Seattle will receive a first-round bye and home-field advantage. The 49ers, limited to a field goal, will enter the playoffs as either the No. 5 or No. 6 seed and will play on the road.",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Venezuela has no leader after US removes President Maduro",
    "domain": "politics",
    "source_domain": "dw.com",
    "location": "global",
    "published": "2026-01-04T06:49:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "Al Jazeera",
      "BBC",
      "NPR",
      "Axios",
      "Reuters",
      "Al Arabiya",
      "Financial Times",
      "The Guardian",
      "New York Times",
      "LA Times",
      "Bloomberg",
      "MarketWatch",
      "CNBC",
      "SCMP",
      "Associated Press",
      "Washington Post",
      "Financial Post",
      "BusinessLine",
      "Business Insider"
    ],
    "domains": [
      "dw.com",
      "aljazeera.com",
      "bbc.co.uk",
      "npr.org",
      "news.google.com",
      "ft.com",
      "theguardian.com",
      "nytimes.com",
      "latimes.com",
      "marketwatch.com",
      "scmp.com",
      "washingtonpost.com",
      "financialpost.com",
      "thehindubusinessline.com",
      "businessinsider.com"
    ],
    "snippets": [
      "Venezuela is without clear leadership following the US strike that ousted President Nicolas Maduro. Maduro and wife have been taken to New York to face criminal charges. DW has more.",
      "After months of planning, US forces, with 150 jets taking off from 20 airbases, undertook an operation to seize Maduro.",
      "President Nicolas Maduro faces criminal charges in New York.",
      "Trump says the US will ‘take back’ Venezuela’s oil, arguing it should be used to reimburse Washington for past spending.",
      "President Trump says the United States conducted a strike in Venezuela and captured that country's president, Nicolás Maduro along with his wife, Cilia Flores.",
      "U.S. oil companies will rebuild Venezuela's industry, Trump says Axios",
      "Trump says US oil companies will spend the billions needed to restore Venezuela's crude output Reuters",
      "Trump says U.S. will run Venezuela after U.S. captures Maduro Reuters",
      "Trump says US ‘will run’ Venezuela until ‘safe’ transition Al Arabiya English",
      "US president upends his own foreign policy but critics fear a dangerous power vacuum in Caracas",
      "Audacious US military operation plucks leader Nicolás Maduro from power and removed him from the country US attacks Venezuela – live updates The US attacked Venezuela and captured its long-serving president Nicolás Maduro on Saturday, with Donald Trump promising to put the country under American con",
      "Nicolás Maduro, the ousted president of Venezuela, arrived in Brooklyn and will be held on drugs and weapons charges. The country’s interim leader demanded his return.",
      "Trump offered few details about how the U.S. plans to run Venezuela, saying only that he intends to designate 'a group' from his administration to oversee the eventual transition of power.",
      "Trump Says US to ‘Run Venezuela’ in Interim After Maduro Bloomberg.com",
      "U.S. oil companies will repair infrastructure in Venezuela, President Donald Trump tells reporters.",
      "Trump says U.S. oil companies will invest billions of dollars in Venezuela after Maduro’s overthrow CNBC",
      "South American country’s leader lands in New York after dramatic military operation in Caracas",
      "US President Donald Trump said on Saturday that the United States would maintain direct control of Venezuela to prevent “somebody else” taking it over after a military operation that captured President Nicolas Maduro, pledging to keep oil flowing to China even as Washington signalled it would manage",
      "President Nicolas Maduro has been captured and brought to New York to face narco-terrorism charges after US strikes on Venezuela. Meanwhile, Donald Trump has said the US will 'run' Venezuela.",
      "Republican US president says Washington will 'run' Venezuela after US troops seize the country's leader.",
      "The US has bombed Venezuela and toppled President Nicolas Maduro, who was abducted with his wife and taken to New York.",
      "President Trump said the U.S. would \"run\" Venezuela, following the capture of President Nicolás Maduro on Saturday. But many questions remain about what's next.",
      "Venezuelan leader Maduro arrives in New York, news outlets report Reuters",
      "Venezuela’s Nicolás Maduro arrives in New York after capture by US forces AP News",
      "The government of the oil-rich nation took control of its petroleum industry in 1976, nationalizing hundreds of private businesses and foreign-owned assets.",
      "Professor slams US attacks and removal of Venezuelan President Nicolas Maduro from power as 'illegal use of force'.",
      "The US president has a growing appetite for military adventure",
      "Country’s crude output has fallen under Maduro regime despite its vast reserves",
      "President Trump opened a new chapter in American nation building as he declared that the United States had toppled Venezuela’s leader and would “run” the country for an indefinite period.",
      "President Donald Trump said US oil companies will spend billions of dollars to rebuild Venezuela’s crumbling energy infrastructure after a military operation that led to the capture of Nicolas Maduro, the country’s former leader.",
      "Military deployment and removal of Maduro echoes centuries of armed intervention by the US in Latin America",
      "US plans to 'run' Venezuela and tap its oil reserves, Trump says, after operation to oust Maduro AP News",
      "Trump said the move followed months of secret planning aimed at dismantling what the US calls a narco-terrorism regime",
      "The White House had pointed to drug trafficking and migration as reasons to crack down on Nicolás Maduro. But oil emerged as central to President Trump.",
      "Supporters of President Nicolás Maduro of Venezuela gathered in Caracas, Venezuela, on Saturday, after the United States captured him in an early morning raid.",
      "The tactically precise operation successfully extracted Mr. Maduro with no loss of American life, a result heralded by President Trump amid larger questions about the legality and rationale for the U.S. actions in Venezuela.",
      "Operation Absolute Resolve involved over 150 military aircraft, including fighter jets, helicopters, drones, and bomber planes.",
      "Legal experts and other critics said President Trump's decision to capture Venezuelan President Nicolás Maduro to face drug charges was a clear violation of both U.S. and international law.",
      "Trump Sees US Oil Producers Spending Billions in Venezuela Bloomberg.com",
      "Chevron, the only U.S. firm currently operating there, could soon be joined by Exxon Mobil and ConocoPhillips, though infrastructure challenges remain significant."
    ],
    "image_url": "",
    "titles": [
      "Venezuela in limbo after Maduro ouster by US",
      "How the US attack on Venezuela, abduction of Maduro unfolded",
      "Trump strikes Venezuela, captures the President, says the US will take over",
      "Trump says US will take Venezuela’s oil",
      "Trump says U.S. will 'run' Venezuela and sell seized oil in remarks on the strikes",
      "U.S. oil companies will rebuild Venezuela's industry, Trump says - Axios",
      "Trump says US oil companies will spend the billions needed to restore Venezuela's crude output - Reuters",
      "Trump says U.S. will run Venezuela after U.S. captures Maduro - Reuters",
      "Trump says US ‘will run’ Venezuela until ‘safe’ transition - Al Arabiya English",
      "How will Trump ‘run’ Venezuela?",
      "Trump says US will ‘run’ Venezuela after Nicolás Maduro captured and taken to New York",
      "Maduro Arrives in N.Y.; Trump Says U.S. Will ‘Run’ Venezuela",
      "Trump says U.S. will 'run' Venezuela after capturing Maduro in audacious attack",
      "Trump Says US to ‘Run Venezuela’ in Interim After Maduro - Bloomberg.com",
      "Trump says U.S. has captured Maduro and will ‘run’ Venezuela. What happens next in markets.",
      "Trump says U.S. oil companies will invest billions of dollars in Venezuela after Maduro’s overthrow - CNBC",
      "US capture of Maduro as it happened: Trump says US will ‘run’ Venezuela",
      "Trump says US will ‘run Venezuela’, keep oil flowing to China after Maduro capture",
      "Venezuela's Maduro arrives in New York after capture by US",
      "Fact-checking Trump following US ‘capture’ of Venezuela’s Maduro",
      "LIVE: Maduro being questioned in New York; Trump says US to ‘run’ Venezuela",
      "Maduro arrives in New York. What to know about the U.S. operation in Venezuela",
      "Venezuelan leader Maduro arrives in New York, news outlets report - Reuters",
      "Venezuela’s Nicolás Maduro arrives in New York after capture by US forces - AP News",
      "Trump says Venezuela stole U.S. oil, land and assets. Here’s the history.",
      "‘Act of war’: Expert rejects Trump rationale for Venezuela attack",
      "Trump now owns Venezuela",
      "Trump bets US will extract ‘tremendous’ oil wealth from Venezuela",
      "Trump Plunges the U.S. Into a New Era of Risk in Venezuela",
      "Trump Sees US Oil Producers Spending Billions in Venezuela",
      "Trump revives gunboat diplomacy with Venezuela attack",
      "US plans to 'run' Venezuela and tap its oil reserves, Trump says, after operation to oust Maduro - AP News",
      "US plans to ‘run’ Venezuela, tap oil reserves after operation to oust Maduro, Trump says",
      "Trump Long Wanted to ‘Take the Oil.’ He Says He’ll Do It in Venezuela.",
      "Venezuela broadcasts messages of resistance from Maduro loyalists after the U.S. attack.",
      "Inside ‘Operation Absolute Resolve,’ the U.S. Effort to Capture Maduro",
      "What the top US general revealed about how the surprise 'Absolute Resolve' raid to capture Maduro unfolded in Venezuela",
      "U.S. capture of Maduro in Venezuela criticized as violation of international, U.S. law",
      "Trump Sees US Oil Producers Spending Billions in Venezuela - Bloomberg.com",
      "Trump says US oil companies will invest billions to revive Venezuela’s oil industry"
    ],
    "url": "https://www.dw.com/en/venezuela-in-limbo-after-maduro-ouster-by-us/live-75382023?maca=en-rss-en-top-1022-rdf",
    "alternate_urls": [
      "https://www.aljazeera.com/news/2026/1/4/how-the-us-attack-on-venezuela-abduction-of-maduro-unfolded?traffic_source=rss",
      "https://www.bbc.co.uk/sounds/play/p0mrykq0?at_medium=RSS&at_campaign=rss",
      "https://www.aljazeera.com/video/newsfeed/2026/1/4/trump-says-us-will-take-venezuelas-oil?traffic_source=rss",
      "https://www.npr.org/2026/01/03/g-s1-104346/trump-venezuela-maduro-press-conference",
      "https://news.google.com/rss/articles/CBMie0FVX3lxTE1qcGpRYjN5UGZCYVRLd3FnejlfaEhOcHZjRVl0Nmh2WlBoNWlDWFdqX0tNRi1QQVpBSGYweXdRcm5zOC0xN2JiSktaZUZ2VFFpRFBDWHYxUWhLcXkwYTByejFKTnB1RXNnV1FYa0ZyTmtJWDdkS28zWEN2dw?oc=5",
      "https://news.google.com/rss/articles/CBMirgFBVV95cUxORzR3X0M0WHZTeVRfSmswTTVDWVJJZ2lidm5aTHFLUkRwaXBxZUtWaFZNcHJjaGJ0dUVLRHhjSElRRkFDQmNJSkg3T2Z4S1VwSjR1SkRTd3Q5Q284R0VFcGpXSHUzLUpzSmtBVDcyazJ2Q0NyaGZhU2dMaExSSG9Vem9GVGxkNDVkUEFyV2FsY2U1OEhNN2dvOGIzS2JEYm04YjBtNDRXWk9Rdl81V3c?oc=5",
      "https://news.google.com/rss/articles/CBMivAFBVV95cUxNOHlKUEVLY3Y4SGhSVk5GTTdoN19CcTJ0MkhWRTFvRXg0ZjBHaVpZSXhRM1JHVHhjWmhJcjlMMXk2bVktWVZtMFp3em9uNE5XdUxPUXpjTkRsMkQtd24xckgwY1FjWXh4M2FIeUFVWWpwVU81djQzRXc0MjkzNFQ5RndFQmVheVhNdFVyc043ZG55S3VfRVhFMno1UGlKbFhkQ2M3Um9kMlZEOWQwYkNCWFhaa1RjdHRHTDBrbg?oc=5",
      "https://news.google.com/rss/articles/CBMi3gFBVV95cUxQSTQ3a3d1RDItVncwZHFLQWI0YlFxaFZac2VlSHB4OXl2ZzY3R0FuZUo2ZmZhNVhQNlpjQy0zSlItY1FURFRLTTNxRFpoSkYzWFJGWkRaT1pIZ2NoUmFYOXNDUWZvbHVraWhQSVVNZW5rZmwzaDI4eEJUUU5WR0VORE42a0hSWU9wcHgtYXh2RzVQVmtGNW5Ec243V0htX3BfWnRmd0dmQ2tUU2lUTzJ0S2VYQzhEZU9YZ283Nm1iaUN4M1VXMFQzQlZCV29GdVZMUlNxaVJ2eHVmUVctdFHSAeMBQVVfeXFMUHJ4QkNod1dMVGU0OWRHc01Qb1JNN0dLS2h3VzZhR3ZMcDdIWmhGdmJYeXA1R2tmUjY0X3NhTFhCcWRGSFJ5STBGVzl2VWlva05NUjBxUEF1SVJ2ajdxd0EzeU1panNKSlFUNFRDdWZkWFh0LUJIdXlrU2FlWmRGdm9BbWxzVk5YSlY5TzVrazVJQ2d1S3pwWVJRMG9kLTdmc1RGcVhJS1NMZVJ3TmJoZ3d4clpNbnk2ZVFmS0dKcWpSR0x6bWNpakFSREdqVW1RdW94Vmk2dFE5cjVkU3NocVpoSTg?oc=5",
      "https://www.ft.com/content/8e3b1a88-b037-457c-8ca8-798f203b6011",
      "https://www.theguardian.com/us-news/2026/jan/03/trump-venezuela-oil-industry",
      "https://www.nytimes.com/live/2026/01/03/world/trump-united-states-strikes-venezuela",
      "https://www.latimes.com/politics/story/2026-01-03/trump-says-u-s-will-run-venezuela-after-capturing-maduro-in-audacious-attack",
      "https://news.google.com/rss/articles/CBMiswFBVV95cUxPUmU4RGdpSi1ZRzhPQkNNR0FBMGVibjM5VFh1dEJ3Rld5Z18yLVJ6VUVJZkY3N0VlWUVPU01lYXhFRGgwQWhPSTRYTzVqWEhYTTh5SkY4cER0TzJpaHUyZFl1aGtHUXZuUXA3MlVSTHdNVjVUd0NhY2RDbWZLdThKNjRWSW5wR19WZnZqUkNpRk5XRUllUEN6VmhhcjVSaU4xQzVKWUFrdTdHdEZhd0NwNEVGSQ?oc=5",
      "https://www.marketwatch.com/story/trump-says-u-s-has-captured-maduro-what-happens-next-in-markets-46fae56e?mod=mw_rss_topstories",
      "https://news.google.com/rss/articles/CBMiZ0FVX3lxTE5oWkVmdmtMNmloNWxZdU9nOHdHb29MMFhFU0pYekE4clJlWkVlU3ZHX25KOGtialJoVklfOUxXaUprcHRyTmxlbDVCU1NQTVBhRmd3QmRiNmtUck04aEhheGRMVmprbzDSAWxBVV95cUxNOTFiX2EzX0RuWVVqRnVZbFRjX3FNZG0zVnNTalRGYWp1eXZ4QXg2bjZxZ1dxMk9IQlJPZlVxNDBXc01NWnlUa25JbXBvb3laOHdWWkptSWxLZ0gtMG85UEpqaV8wYWVjS0dtcWM?oc=5",
      "https://www.ft.com/content/48be0c3d-0a37-4aac-be47-f15f7f1761b8",
      "https://www.scmp.com/news/china/article/3338641/trump-says-us-will-run-venezuela-keep-oil-flowing-china-after-maduro-capture?utm_source=rss_feed",
      "https://www.dw.com/en/venezuela-s-maduro-arrives-in-new-york-after-capture-by-us/live-75373644?maca=en-rss-en-top-1022-rdf",
      "https://www.aljazeera.com/news/2026/1/4/fact-checking-trump-following-us-capture-of-venezuelas-maduro?traffic_source=rss",
      "https://www.aljazeera.com/news/liveblog/2026/1/3/live-venezuelas-maduro-arrives-in-new-york-after-capture?traffic_source=rss",
      "https://www.npr.org/2026/01/03/nx-s1-5665670/venezuela-strikes-us-maduro",
      "https://news.google.com/rss/articles/CBMisgFBVV95cUxQQ2o4SEF5UFFiTVllbG5WRFVkMGFCQ3VWNVBOLTN4ejU3VnIxZU45c1ZiOEdSZ1pNRzdVcGdhT2RBMEttOF80MGZLRFMxbnRpUmFSalk4QVdpRWZ3VFpHbE1TZDdQcUtnT1FDUzZ3YjRpeUQ0Y1FwempoOTJfT0ExcVJCbjJNTlU0d2hFWTFIRE5kcjRBU2MzMGcwSnF0YlZWQkZvRG5KOFd1Y3Q0X05WcnZR?oc=5",
      "https://news.google.com/rss/articles/CBMibkFVX3lxTE5oSkl3NW41dllicVR3VGxMMXBDZ1FPTVYzWEF6NnRiQ0pEclRBR3N3blg1VUNObDg0eDNrMWhEWXJmYjQ1T2RzQWtFdTR4RVhaTDRPWDE1NDhqVXNWRWNkMXZDMVprSzNCQXJzZ3NR?oc=5",
      "https://www.washingtonpost.com/world/2025/12/20/venezuela-oil-nationalization-expropriation/",
      "https://www.aljazeera.com/news/2026/1/3/act-of-war-expert-rejects-trump-rationale-for-venezuela-attack?traffic_source=rss",
      "https://www.ft.com/content/43888865-8e3c-44fa-8901-54b8d21103f6",
      "https://www.ft.com/content/b395033a-bb3a-4022-a58c-60594e73512c",
      "https://www.nytimes.com/2026/01/03/us/politics/trump-venezuela-oil-risks.html",
      "https://financialpost.com/pmn/business-pmn/trump-says-us-oil-producers-to-invest-billions-in-venezuela",
      "https://www.ft.com/content/0dd424de-9992-4d45-ad77-9dc7f75caaf1",
      "https://news.google.com/rss/articles/CBMilgFBVV95cUxONkN3NGVXSDF3cVc5V2s4OXpWaGw0NV8za3FsSzAzYkMzR2JGQU90YjRqUU9OM1lEUGRyejVNZHBxeVNwMnAzeHltVG1KYlhFNVBhMGRmcUNkc3JEUVA2dE5PNFhlTGJXdG9fdm1weXBtVWwycFZFMTg1cTQ2UzNkX1laWEFRdlZfRTZMVUZFWW5YWWpfbXc?oc=5",
      "https://www.thehindubusinessline.com/news/world/us-to-run-venezuela-until-power-transition-says-trump-after-maduro-capture/article70468771.ece",
      "https://www.nytimes.com/2026/01/03/us/politics/trump-venezuela-oil.html",
      "https://www.nytimes.com/live/2026/01/03/world/trump-maduro-venezuela-us-strikes/venezuela-broadcasts-messages-of-resistance-from-maduro-loyalists-after-the-us-attack",
      "https://www.nytimes.com/2026/01/03/us/politics/trump-capture-maduro-venezuela.html",
      "https://www.businessinsider.com/top-general-details-us-military-raid-that-captured-venezuelas-maduro-2026-1",
      "https://www.latimes.com/world-nation/story/2026-01-03/u-s-capture-of-maduro-in-venezuela-criticized-as-violation-of-international-u-s-law",
      "https://news.google.com/rss/articles/CBMirwFBVV95cUxNdDFlVzVaeEYxcVpBYTVrMTJWNmgtRmx0UkU5d1d0Q1Y1QVMzQlZTZ2FPVmxiSXNmbTN5a0FQbVFTMDFlWjZMdVVSRG44R1R2LTVzckpuNVByQmNSejNuV0VDMUUwa2U4Ykt0TE4yYkpkWXR1NFNLVTB5SDhTUWVVRkxCSGd3VHJ6T1VzVXlSTzNzZGVRbGNiVkJoeVhuRGIwZEJncTJOVlU4bzJIT2xn?oc=5",
      "https://www.thehindubusinessline.com/markets/commodities/trump-says-us-oil-companies-will-invest-billions-to-revive-venezuelas-oil-industry/article70469604.ece"
    ],
    "location_scope": "global",
    "link": "https://www.dw.com/en/venezuela-in-limbo-after-maduro-ouster-by-us/live-75382023?maca=en-rss-en-top-1022-rdf",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.884,
      "consensus": 1.0,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.865,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness of the situation in Venezuela after Maduro's ouster. However, it lacks depth and does not provide actionable insights or deeper understanding of the situation.",
    "constructiveness_source": "gpt",
    "summary_source": "snippet",
    "summary_reason": "invalid_roles",
    "headline_source": "gpt",
    "summary": "Venezuela is without clear leadership following the US strike that ousted President Nicolas Maduro. Maduro and wife have been taken to New York to face criminal charges. DW has more.",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "North Korea fires missiles before South Korea China leaders meet",
    "domain": "politics",
    "source_domain": "dw.com",
    "location": "global",
    "published": "2026-01-04T09:18:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "Reuters",
      "Al Jazeera",
      "Associated Press",
      "The Guardian",
      "SCMP"
    ],
    "domains": [
      "dw.com",
      "news.google.com",
      "aljazeera.com",
      "theguardian.com",
      "scmp.com"
    ],
    "snippets": [
      "President Lee's trip to Beijing marks the first by any South Korean leader in the last six years and comes amid heightened tensions over Taiwan.",
      "South Korea's Lee begins China state visit after North fires missiles Reuters",
      "Pyongyang's latest display of firepower comes ahead of South Korean President Lee's meeting with China's Xi Jinping.",
      "The missile test comes as President Lee Jae Myung arrives in Beijing to meet his Chinese counterpart, Xi Jinping.",
      "North Korea fires ballistic missiles as rival South's leader visits China Reuters",
      "North Korea launches ballistic missiles toward sea ahead of South Korean leader's visit to China AP News",
      "South Korea’s military reports projectile launch hours before Lee Jae Myung was due to head to Beijing North Korea launched ballistic missiles towards the sea on Sunday, its neighbours said, just hours before South Korea’s president was due to leave for talks in China expected to cover North Korea’s",
      "North Korea fired multiple ballistic missiles off its east coast on Sunday, Seoul’s military said, its first launch of the year just hours before South Korea’s leader heads to China for a summit. Sunday’s launch follows a US military operation against Pyongyang’s socialist ally Venezuela that snatch"
    ],
    "image_url": "",
    "titles": [
      "South Korean president begins China state visit",
      "South Korea's Lee begins China state visit after North fires missiles - Reuters",
      "North Korea fires ballistic missiles off its east coast",
      "North Korea fires missiles towards sea as South Korean leader visits China",
      "North Korea fires ballistic missiles as rival South's leader visits China - Reuters",
      "North Korea launches ballistic missiles toward sea ahead of South Korean leader's visit to China - AP News",
      "North Korea launches ballistic missiles towards sea before South Korean leader’s visit to China",
      "North Korean missiles fall near Japan; South Korea, Japan on alert"
    ],
    "url": "https://www.dw.com/en/south-korean-president-begins-china-state-visit/a-75382207?maca=en-rss-en-top-1022-rdf",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMixgFBVV95cUxPSzlMVm8yRFVEZHRVV2dZOXFXNEdVY19saGpaVEZhUEUzNEFCNGpNX2dXaWhEOEc1ajAxUTdPZEJ3WWF0S3U0QWExT1ZtSmMtQ3hEWTNzVU1xTWxoVTQwRFRWSVBvQXFPS3lyQ1dOSHYweExVZDlUQTRQWW1TXzRHTlk4T0p1R3NPclNPa0poRW1ia2k0Wks0SWQ5aFBGR1VQaEJuRVV6VjlZSXh4OVluYk5SRUxRRVUtWkJZTFBNNkwzZnIwTGc?oc=5",
      "https://www.dw.com/en/north-korea-fires-ballistic-missiles-off-its-east-coast/a-75381682?maca=en-rss-en-top-1022-rdf",
      "https://www.aljazeera.com/news/2026/1/4/north-korea-fires-missiles-towards-sea-as-south-korean-leader-visits-china?traffic_source=rss",
      "https://news.google.com/rss/articles/CBMivgFBVV95cUxNdER5dDBOM2t0bzFVUkxPWjZZR2ZwczJTWlN4ZjRucWE5Y0lSa1N4VDc5Z2ZwXzlsV0dVWGNnb3owWEpFMGpHQTY2MUxBYmEyTFo4QkVaZURQN2hvRzlwdHEyazN2NHFuZk5pMmdCTWcxVFh2UWNWYjF3VlhwbllMajRubWZiOXNxZlhXeGZISXYwcTNyUXpqZFBWaXhfeFpCS0ZGdm5tZ2RFTXZ1RlpKaWk5SVVpQjhnOXNsOGln?oc=5",
      "https://news.google.com/rss/articles/CBMijgFBVV95cUxQZXplT245M3FydmtMRkZfdGUzRFZWR1pKNmlaSkZVU05uc21pM1FrYVluOEIxZjBKeEpVS3BOekdURTlzS1Z5ZWdtVVM2MFhsSEVvMTJnbDRvT2Nsa3MtYXVzMW9zbGhISUVBd25tdFJBemx0eU1uWnJiZDRiSGhaRlM2WjNwMmdxQmE4YlNn?oc=5",
      "https://www.theguardian.com/world/2026/jan/03/north-korea-has-fired-ballistic-missile-towards-the-sea-of-japan",
      "https://www.scmp.com/news/asia/east-asia/article/3338644/north-korean-missile-falls-near-japan-takaichi-orders-safety-checks?utm_source=rss_feed"
    ],
    "location_scope": "global",
    "link": "https://www.dw.com/en/south-korean-president-begins-china-state-visit/a-75382207?maca=en-rss-en-top-1022-rdf",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.947,
      "consensus": 1.0,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.864,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story only provides basic awareness of an event but does not offer any depth or insight into its implications, potential outcomes, or the context surrounding it.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "North Korea fired multiple ballistic missiles off its east coast on Sunday, marking its first launch of 2026, according to South Korea's military. The launches occurred just hours before South Korean President Lee Jae Myung traveled to Beijing for a state visit and summit with Chinese President Xi Jinping. The meeting is set against a backdrop of heightened regional tensions, including issues related to Taiwan.",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "US special forces capture Venezuelan President Maduro in Venezuela",
    "domain": "politics",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Sun, 04 Jan 2026 07:17:18 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "ABC News",
      "Reuters",
      "CNBC",
      "The Guardian",
      "CBC News",
      "SCMP",
      "BusinessLine",
      "Axios",
      "Associated Press",
      "Fortune",
      "NPR",
      "Financial Times"
    ],
    "domains": [
      "aljazeera.com",
      "abcnews.go.com",
      "news.google.com",
      "cnbc.com",
      "theguardian.com",
      "cbc.ca",
      "scmp.com",
      "thehindubusinessline.com",
      "fortune.com",
      "npr.org",
      "ft.com"
    ],
    "snippets": [
      "Video shows Venezuelan President Nicolas Maduro arriving at the Drug Enforcement Agency detention centre in New York.",
      "Secretary Hegseth called the operation \"sheer guts and grit, gallantry and glory of the American warrior.\"",
      "\"He was provided multiple very, very, very generous offers, and chose instead to act like a wild man,\" Rubio said.",
      "Was the US capture of Venezuela's president legal? Reuters",
      "Investors and economists react to US capture of Venezuela's Maduro Reuters",
      "Who is Nicolas Maduro, Venezuela's president? Reuters",
      "The indictment was unsealed hours after U.S. forces launched an attack on Venezuela and captured its president Nicolas Maduro and his wife, Cilia Flores.",
      "US president lauds ‘brilliant operation’ on social media as attorney general says couple will face criminal charges US attacks Venezuela – live updates What we know so far about the attack Watch: Aircraft fly low over Caracas as explosions hit city Donald Trump has said the US “captured” Venezuela’s",
      "Key facts about Nicolás Maduro, the Venezuelan leader who U.S. President Donald Trump said had been captured by U.S. forces on Saturday.",
      "The US captured Venezuela’s President Nicolas Maduro in a military operation early on Saturday morning, ‌culminating in a months-long pressure campaign by President Donald Trump’s administration that drew condemnation from some international leaders. Hours later on Saturday evening, Maduro was in a",
      "At 4.21am on Saturday, US President Donald Trump sent a message on his Truth Social ‌platform: the United States had carried out a daring mission to capture Venezuelan President Nicolas Maduro and his wife. The action came as a surprise, but according to sources familiar with the matter, ‍planning f",
      "Video footage showed the aircraft arriving at Stewart International Airport, roughly 60 miles northwest of New York City, with several US personnel, including FBI agents, boarding the plane.",
      "US forces studied Maduro’s movements, rehearsed on replica compounds and waited for precise weather conditions before striking",
      "Trump says Maduro \"captured\" by U.S. in stunning move Axios",
      "\"We can't take a chance that somebody else takes over Venezuela that doesn't have the good of the Venezuelan people in mind,\" President Donald Trump said.",
      "\"We can't take a chance that somebody else takes over Venezuela that doesn't have the good of the Venezuelan people in mind,\" Trump said.",
      "Trump says US to run Venezuela after raid captures Maduro Reuters",
      "Maduro arrives in US after stunning capture in operation that Trump says will let US 'run' Venezuela AP News",
      "\"We're not afraid of boots on the ground. We're not afraid of it. We're we don't mind saying it, and we're gonna make sure that that country is run properly.\"",
      "The announcement came a few hours after explosions rocked the Venezuelan capital, Caracas.",
      "Photos show people reacting to the US capture of Venezuelan President Nicolas Maduro AP News",
      "US special forces have seized Venezuela's president and his wife.",
      "On a day when most reporters are chasing facts, NPR's Morning Edition host Steve Inskeep has a few questions.",
      "The U.S. Justice Department has unsealed a new indictment alleging \"drug trafficking and narco-terrorism conspiracies\" against Maduro, his wife and other defendants.",
      "Multiple attacks targeted military, transport and communication sites in Caracas and Venezuela’s north",
      "World leaders denounce U.S. operation to capture Maduro Axios",
      "Mock house, CIA source and Special Forces: The US operation to capture Maduro Reuters",
      "Scenes from Venezuela as U.S. forces capture Maduro Reuters"
    ],
    "image_url": "",
    "titles": [
      "Video shows Venezuela’s President Maduro in US custody",
      "WATCH:  Secretary Hegseth on US capture of Venezuelan President Maduro",
      "WATCH:  Secretary Rubio on US capture of Venezuelan President Maduro",
      "Was the US capture of Venezuela's president legal? - Reuters",
      "Investors and economists react to US capture of Venezuela's Maduro - Reuters",
      "Who is Nicolas Maduro, Venezuela's president? - Reuters",
      "U.S. indictment against Venezuela President Maduro, wife is unsealed",
      "US has captured Venezuela’s President Maduro and wife, says Trump",
      "Who is Nicolás Maduro, Venezuela's recently captured president?",
      "Was the US capture of Venezuela’s President Maduro legal?",
      "Inside the US operation in Venezuela to capture President Nicolas Maduro",
      "Venezuelan President Nicolas Maduro arrives in the US after capture",
      "How the US captured Venezuela’s President Maduro",
      "Trump says Maduro \"captured\" by U.S. in stunning move - Axios",
      "WATCH:  Trump says US 'going to run the country' after Maduro capture",
      "WATCH:  Trump says U.S. is 'going to the run the country' after capture of Maduro",
      "Trump says US to run Venezuela after raid captures Maduro - Reuters",
      "Maduro arrives in US after stunning capture in operation that Trump says will let US 'run' Venezuela - AP News",
      "Trump says ‘we’re going to run’ Venezuela and is not afraid to put U.S. troops on the ground after Maduro’s capture",
      "WATCH:  President Trump addresses nation after capture of Venezuelan President Maduro",
      "Photos show people reacting to the US capture of Venezuelan President Nicolas Maduro - AP News",
      "What are the implications of US ‘capture’ of Nicolas Maduro?",
      "Six questions about the capture of Maduro",
      "What are the charges against Venezuela's Nicolás Maduro?",
      "Inside the audacious US operation to capture Nicolás Maduro",
      "World leaders denounce U.S. operation to capture Maduro - Axios",
      "Mock house, CIA source and Special Forces: The US operation to capture Maduro - Reuters",
      "Scenes from Venezuela as U.S. forces capture Maduro - Reuters"
    ],
    "url": "https://www.aljazeera.com/video/newsfeed/2026/1/4/video-shows-venezuelas-president-maduro-in-us-custody?traffic_source=rss",
    "alternate_urls": [
      "https://abcnews.go.com/International/video/secretary-hegseth-us-capture-venezuelan-president-maduro-128872681",
      "https://abcnews.go.com/International/video/secretary-rubio-us-capture-venezuelan-president-maduro-128873454",
      "https://news.google.com/rss/articles/CBMijwFBVV95cUxOd25GNkdSbjg4b0dKTXN0VTVuNmh2aHhfdE83V2EtTlBkX29NVjhQb1JIWGxVUjRNdjdlNS1qWUlPak05WDFsUTRKUUgxdXdtclJ6ZGhRb1ZLOU1Ma09KT2U2eVA0Tm4za0tydWZGbk9oMGdjeGNDaGNSblRyeXA1emJyQ3lUZ2dycFowNXQxVQ?oc=5",
      "https://news.google.com/rss/articles/CBMisAFBVV95cUxPMW5HYjFNY2pWdVZ4MVIxaGRkeTR6NDZHNTdSRzdJV2luRW1DcElROWlKcURmX01kZUtNLUNxRmJCamlrWFhiQjZwOElWRkt1VW14Tl9UcmRfekJJZEZtTEVyWlpnT28zZnE4dHhGT0UzeThqSld2TUpPS3BYbGJfak9Qam5oV1NaenJhUkVYbzNITVBNUjI4elZ0UW1qaXVVUUc4R1ZwZmU5cGh3WVJaMA?oc=5",
      "https://news.google.com/rss/articles/CBMimAFBVV95cUxNWDlHREFXMm1oSDlySDh0SW1IaUpWZ2hkWW9CNmdJaUZvM0VBTlRwa0oxQUxHTlJackMtV2cySHR4MUNlTUNZaGdMdmdJdXE1VEVsbGxEYXZUaDhlYk5hbWRTZ3JCejNZeFhrTDE1WHZDY2NDX2xQVThpRGYwcHh4WHlEQVVkZ0lFcGtNbjdZWFdkVlN1WWE1Zg?oc=5",
      "https://www.cnbc.com/2026/01/03/maduro-indictment-drugs-venezuela.html",
      "https://www.theguardian.com/world/2026/jan/03/explosions-reported-venezuela-caracas",
      "https://www.cbc.ca/news/world/nicolas-maduro-venezuela-9.7032594?cmp=rss",
      "https://www.scmp.com/news/world/americas/article/3338646/was-us-capture-venezuelas-president-maduro-legal?utm_source=rss_feed",
      "https://www.scmp.com/news/world/americas/article/3338645/inside-us-operation-venezuela-capture-president-nicolas-maduro?utm_source=rss_feed",
      "https://www.thehindubusinessline.com/news/world/venezuelan-president-nicolas-maduro-arrives-in-the-us-after-capture/article70469080.ece",
      "https://www.thehindubusinessline.com/news/world/how-the-us-captured-venezuelas-president-maduro/article70469050.ece",
      "https://news.google.com/rss/articles/CBMilgFBVV95cUxQamo4TjQ4WUMtbWN3RnhqVUhxN0pxQWNFLTBDZ21TT2RsRk9STkFFMzV2SllVeXp1bl8zdmlkanB2R25HekVxcmRkOVZhWkl1aGx3S3FjZ3hRNkxTNkkzenk2REl4S05uSnRXN25fWExubzZmenRGdnJUdVNQX3d6QzQzWFk3UTM1MDRHeERudjR6VlNGeWc?oc=5",
      "https://abcnews.go.com/International/video/trump-us-run-country-after-maduro-capture-128869596",
      "https://abcnews.go.com/International/video/trump-us-run-country-after-capture-maduro-128872497",
      "https://news.google.com/rss/articles/CBMiowFBVV95cUxOS3FJcHBQZnFkdGMyZ2F5dmJSTkJFd0F5UENaOEJvNVBHRzlDdjQ3ZHhlOWxkNllGVzhCbkRFdjZKLWcxOEdicmJWZW01d0ZEcjctNTE4MlpwQ3lpT1pTRXVEZDJzNWFZNV9hWWc2V0w5cWNELUZHcV94MnVaanAwd1R6djVVNktwOGdiX2h6alpFVDJYYlV6UXRIWDVjeE02TTJN?oc=5",
      "https://news.google.com/rss/articles/CBMiowFBVV95cUxQNUhKRmRYVWh3Vk93MjBfbk0yb255QTJMS3F2b0I3TWV6a0FlbFpHaUVOaG5sdm5PUWM3RDBhYW5EWkJqV3ZZRTYwMlVvT1Rkc2V1XzhzU0Y3OXFHNG5qcVJ1a3oxY1pRelk2MXJiVzA4QUVkeW50bHpfUU1saEUyeVlIWU1vc01OT3J2Z3dmZVhZWFgzSU1JYXNHcHZFbFBnSGhB?oc=5",
      "https://fortune.com/2026/01/03/trump-us-control-maduro-rubio-venezuela-us-troops-boots-on-the-ground/",
      "https://abcnews.go.com/International/video/president-trump-addresses-nation-after-capture-venezuelan-president-128871286",
      "https://news.google.com/rss/articles/CBMingFBVV95cUxOb2VMc0NPWEVnWWdrWHZGdTc4bFNxdS1BbE1ETlZXZk81UFRTQ3dNdlBuX2N1NzhLQ3ExYkxYV2c1cWRfU2VseGlITXQ1T3EyR2FLYzZyeWVNUjZUN2xQQlA4R05JVkdjQ0tMaTByaWRjUTdJNm9YY2E5VFBLUjRzZlcyTVU0bkR3NUdDLWZmUFgycXFuVEwxeWNQbVBXdw?oc=5",
      "https://www.aljazeera.com/video/inside-story/2026/1/3/what-are-the-implications-of-the-us-capture-of-nicolas-maduro?traffic_source=rss",
      "https://www.npr.org/2026/01/03/nx-s1-5665756/six-questions-about-the-capture-of-maduro",
      "https://www.npr.org/2026/01/03/nx-s1-5665617/venezuela-nicolas-maduro-charges",
      "https://www.ft.com/content/7772cf0f-c5ab-4d9c-b9a2-aa2164049c5e",
      "https://news.google.com/rss/articles/CBMie0FVX3lxTE80b0g2MGRiWUk4LXVGVWZpY29QNlpjX3VqMk93NXU3c2tnbmRyWU84cDdTbUE0cVYzemstel8yZFVJWW5CeDJ2WlJMZUtNUHM4T0c4OVU5WnZRSUVWUlZWQ2ZjanVlV3pPQ25RckM3Zi1KN3NGc2x4d2xsbw?oc=5",
      "https://news.google.com/rss/articles/CBMixgFBVV95cUxQSlVaZVMyZDJZMFlaNGJrYWJzRG1NcGVnN2dBYWFBbWxpRHN3Z0RpQk9wSXZYTmp2QkU2SXBDMjUyMzFFRHowS3d0UVA5WjBTdUNweV90VWRXR1p1XzdFcTNmdTRWdjRYSHVUVnYxYVhjXzZ1eklkZ243eDMwT3AzUWhWTHNFclFzSVFkSmtrWFhBNEN4Q1B6amxNZW9EWGd2LVhWZjlPMHJXYVo1MjcwTmVuWl9POWgyazBHUVNLUE9keGV0QlE?oc=5",
      "https://news.google.com/rss/articles/CBMikAFBVV95cUxPOGdlZHYwYmlFX2NuVHlib01nclJWaHdZUV9zczd0THFrV2dpWTF2RVd0NzM2QmhfWlloUW12U2FTb2NWU1JybU51U2lLUXpDR014Z3NqYUJyZ2dwS251UWR2SFBDSHRqNmhlZHlyWWRERHdzem1aT1VMVWtaSjFyVnNaYnJjX1ctQlJzVWltQVI?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/video/newsfeed/2026/1/4/video-shows-venezuelas-president-maduro-in-us-custody?traffic_source=rss",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.895,
      "consensus": 1.0,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.849,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story merely reports an event without providing any useful context or insight. It does not contribute to the reader's understanding of the situation in Venezuela or the implications of President Maduro's custody.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "On January 4, 2026, U.S. special forces captured Venezuelan President Nicolas Maduro and his wife, Cilia Flores, during a military operation in Venezuela. The U.S. Justice Department unsealed an indictment charging them with drug trafficking and narco-terrorism conspiracies. Maduro was transported to a DEA detention center in New York. The operation drew condemnation from some international leaders, while U.S. officials praised its execution.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "US military captures Venezuelan leader Maduro and takes control",
    "domain": "politics",
    "source_domain": "npr.org",
    "location": "national",
    "published": "Sun, 04 Jan 2026 00:19:41 -0500",
    "source": "NPR",
    "sources": [
      "NPR",
      "Fortune",
      "SCMP",
      "BusinessLine"
    ],
    "domains": [
      "npr.org",
      "fortune.com",
      "scmp.com",
      "thehindubusinessline.com"
    ],
    "snippets": [
      "Venezuelans scrambled to understand who was in charge of their country after the U.S. captured Nicolás Maduro. President Trump offered an answer: The United States would take control of Venezuela.",
      "“What is being done to Venezuela is an atrocity that violates international law,” she said. “History and justice will make the extremists who promoted this armed aggression pay.”",
      "Venezuelans on Saturday scrambled to understand who was in charge of their country after the US military captured President Nicolas Maduro, ousting the strongman who had outlasted a botched coup attempt, several army mutinies, mass protests and economic sanctions in the vast nation of 29 million. “W",
      "Trump says Maduro’s deputy Delcy Rodríguez had a long conversation with US Secretary of State Marco Rubio, claims she’ll agree to all US demands"
    ],
    "image_url": "",
    "titles": [
      "Venezuelans wonder who's in charge as Trump claims contact with Maduro's deputy",
      "Maduro’s deputy demands his release after U.S. arrest as Venezuelans wonder who’s in charge",
      "Power vacuum in Caracas? Venezuelans wonder who’s in charge after Maduro capture"
    ],
    "url": "https://www.npr.org/2026/01/04/g-s1-104439/venezuelans-wonder-who-in-charge",
    "alternate_urls": [
      "https://fortune.com/2026/01/03/venezuela-vice-president-delcy-rodriguez-maduro-release-us-arrest-miltary-raid/",
      "https://www.scmp.com/news/world/americas/article/3338647/power-vacuum-caracas-venezuelans-wonder-whos-charge-after-maduro-capture?utm_source=rss_feed",
      "https://www.thehindubusinessline.com/news/world/venezuelans-wonder-whos-in-charge-as-trump-claims-contact-with-maduros-deputy/article70470201.ece"
    ],
    "location_scope": "national",
    "link": "https://www.npr.org/2026/01/04/g-s1-104439/venezuelans-wonder-who-in-charge",
    "score_components": {
      "magnitude": 0.932,
      "recency": 0.848,
      "consensus": 0.908,
      "constructiveness": 0.5,
      "proximity": 0.75
    },
    "score": 0.841,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness of the political situation in Venezuela, but without a summary or further details, it's unclear whether it provides actionable insights or deeper understanding.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The U.S. military captured Venezuelan President Nicolás Maduro, leading to confusion over the country's leadership. President Trump announced that the United States would take control of Venezuela. Maduro’s deputy, Delcy Rodríguez, reportedly spoke with U.S. Secretary of State Marco Rubio and is expected to agree to U.S. demands. The situation has drawn criticism as a violation of international law.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Toronto Blue Jays sign Kazuma Okamoto for four years",
    "domain": "sports",
    "source_domain": "cbssports.com",
    "location": "national",
    "published": "Sat, 03 Jan 2026 20:07:39 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Associated Press",
      "Sports Illustrated",
      "Sportsnet",
      "Yahoo Sports",
      "ESPN"
    ],
    "domains": [
      "cbssports.com",
      "news.google.com",
      "sportsnet.ca",
      "sports.yahoo.com",
      "espn.com"
    ],
    "snippets": [
      "The 29-year-old Japanese third baseman is coming to MLB after 11 years with Tokyo's Yomiuri Giants",
      "Infielder Kazuma Okamoto and Blue Jays agree to $60 million, 4-year contract, AP sources say AP News",
      "Blue Jays Add Six-Time Japanese All-Star Kazuma Okamoto on Four-Year Contract Sports Illustrated",
      "The Blue Jays are in agreement with Kazuma Okamoto on a free agent deal that gives the defending AL champions an established Japanese star, an industry source told Ben Nicholson-Smith.",
      "Okamoto's signing is a bold reminder of Toronto's fresh status as one of baseball's certified behemoths.",
      "A six-time All-Star, Okamoto has a .277 average with 248 homers and 717 RBIs in 11 Japanese big league seasons.",
      "Blue Jays’ Kazuma Okamoto Deal Has Ripple Effects For Red Sox Sports Illustrated",
      "Blue Jays Reach Agreement With NPB Third Baseman Kazuma Okamoto Sports Illustrated",
      "The Blue Jays and Japanese third baseman Kazuma Okamoto are in agreement on a free agent contract, sources told ESPN."
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2026/01/03/3c6db3e5-390f-4100-8bfa-7e49195515de/kazuma-okamoto-blue-jays-usatsi.jpg",
    "titles": [
      "Blue Jays continue active offseason, agree with Kazuma Okamoto on four-year, $60 million deal, per reports",
      "Infielder Kazuma Okamoto and Blue Jays agree to $60 million, 4-year contract, AP sources say - AP News",
      "Blue Jays Add Six-Time Japanese All-Star Kazuma Okamoto on Four-Year Contract - Sports Illustrated",
      "NPB star Kazuma Okamoto, Blue Jays agree to contract",
      "Blue Jays finally land a Japanese star with Kazuma Okamoto — but where does he fit on the roster?",
      "Report: Infielder Kazuma Okamoto and Blue Jays agree to $60 million, 4-year contract",
      "Blue Jays’ Kazuma Okamoto Deal Has Ripple Effects For Red Sox - Sports Illustrated",
      "Blue Jays Reach Agreement With NPB Third Baseman Kazuma Okamoto - Sports Illustrated",
      "Sources: Japan's Okamoto, Jays reach $60M deal"
    ],
    "url": "https://www.cbssports.com/mlb/news/blue-jays-kazuma-okamoto-free-agent-contract/",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMikwFBVV95cUxQVm1qQmo4Rm1FWHV1RXRDRzE4Uk1UbXVjNUxabC0wSzhXcEhJd3NtdE8yZTNWZXhZRUxWT3ZjS2ZlM2w3ZkJtR2dhem5aMlhJZmNiZUJaOU1FZnBPcldjaW9yQWVTRnpyT1BvNjg1dDdkSGpqRUFJUDczc01KWWhVeHhEZDhvRHEtOTYyYkxscXFwdjQ?oc=5",
      "https://news.google.com/rss/articles/CBMingFBVV95cUxPNXZZNnRpdGxSN285enFSSFRMOVRFYnhtNjJTWHhKbmdOQWZzNndDVHBuRW9BTWxRNG5wSFFhdUhRNGVxLTUwaFVRelg0NGk2dWYzTm9nRXpLRDRTR3ktZkphMFRORjBqaTcwR1NMYjJTWERsZDZYZVBLTVNpN0FHajJkbVB5UHNPYVdrVUVsbV84aWJ1RWVGZE9KblU0dw?oc=5",
      "https://sports.yahoo.com/mlb/article/blue-jays-finally-land-a-japanese-star-with-kazuma-okamoto--but-where-does-he-fit-on-the-roster-235314924.html",
      "https://sports.yahoo.com/articles/report-infielder-kazuma-okamoto-blue-194629767.html",
      "https://news.google.com/rss/articles/CBMivgFBVV95cUxPb2o3RUhqUy1pd2I4U1RIUTN1dDlmdmlFa1ducUthUEVPdDc5djIwNzVKQXNXWWRrMFNMNm9iczJHeGEwS1dKQ1Z5LXRLN0Z0X3ZobFJrYUxxb1VTRDRPLXE3QjU5OGRTdlFHbkR1RTI3bzY3Z0xfT2RMOXl4dWcyM0ZYWkJpZTJOZVFQSEFwYVJVZENjd3k3UEQ3X3pJQUVYQk81S2dVX0NiSGtXMVdxSFZNLXdXVm1VY0FpTWlR?oc=5",
      "https://news.google.com/rss/articles/CBMiogFBVV95cUxNZ3Zfa2RUaThHYkh3QWJJRnRrRzhhSU8zWWtfU3RoYVRteU1wZU0ySmJiLVd1WHYwQ3lSRzFpZEhOS0dBUld0aElJM2lmdzFyQk5uaXByU21VRlBqbXN0cTNKQzljdk1UVHNhcnNEZElGeU9UWmFBSlgxSmlNVkYzaEhXUEh2MWpEX29aOE5iNWVvZjdIZjZTWmZkWVktMVpRNUE?oc=5",
      "https://www.espn.com/mlb/story/_/id/47491589/sources-japanese-3b-kazuma-okamoto-blue-jays-agree-deal"
    ],
    "location_scope": "national",
    "link": "https://www.cbssports.com/mlb/news/blue-jays-kazuma-okamoto-free-agent-contract/",
    "score_components": {
      "magnitude": 0.986,
      "recency": 0.657,
      "consensus": 1.0,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.803,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story informs about the Blue Jays' offseason activities and their new deal with Kazuma Okamoto. This could be useful for fans or those interested in the team's strategies, but it does not necessarily provide a deeper understanding or insight beyond the basic information.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The Toronto Blue Jays have agreed to a four-year, $60 million contract with Japanese third baseman Kazuma Okamoto, according to multiple sources. Okamoto, 29, spent 11 seasons with the Yomiuri Giants and is a six-time All-Star with a .277 batting average, 248 home runs, and 717 RBIs in Japan. The deal adds an established infielder to the defending AL champions' roster.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "US flights to the Caribbean start again after airspace closed",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Sun, 04 Jan 2026 04:43:00 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "CNBC",
      "New York Times",
      "Fortune",
      "Financial Post",
      "Bloomberg",
      "Business Insider"
    ],
    "domains": [
      "news.google.com",
      "cnbc.com",
      "nytimes.com",
      "fortune.com",
      "financialpost.com",
      "businessinsider.com"
    ],
    "snippets": [
      "US lifts Caribbean airspace curbs after attack on Venezuela Reuters",
      "Airlines including United and Delta began restoring flights to Puerto Rico and other Caribbean destinations early Sunday after aviation authorities lifted temporary airspace restrictions.",
      "The Federal Aviation Administration cited “safety-of-flight risks” in restricting the U.S.-controlled airspace as a result of the military operation in Venezuela.",
      "JetBlue said it canceled about 215 flights “due to airspace closures across the Caribbean related to military activity.”",
      "The US lifted airspace restrictions around the Caribbean after military operations in Venezuela upended travel in the region just as many vacationers are trying to get home from their winter breaks.",
      "Flights Canceled Across Caribbean After US Raid in Venezuela Bloomberg.com",
      "From outbound vacationers to students returning for the new semester, the US raid on Venezuela disrupted travel across the region."
    ],
    "image_url": "",
    "titles": [
      "US lifts Caribbean airspace curbs after attack on Venezuela - Reuters",
      "Airlines restore Caribbean flights after U.S. lifts airspace restrictions tied to Venezuela strikes",
      "Airlines Are Canceling Flights After U.S. Closes Airspace Over the Caribbean",
      "Airlines cancel hundreds of flights across the eastern Caribbean after U.S. raid on Venezuela",
      "Flights to Resume Across Caribbean After US Raid in Venezuela",
      "Flights Canceled Across Caribbean After US Raid in Venezuela - Bloomberg.com",
      "Thousands of travelers stranded as US strikes on Venezuela push airlines out of Caribbean airspace"
    ],
    "url": "https://news.google.com/rss/articles/CBMirwFBVV95cUxORTF0X1J4Sk9qQ0lTVzJlWFprVC1NWjJPT0wzTkdRaVdCUFZwbEVCbGc2S0V5VnhFbDMtcDlvUGdKY3c3cm00T19JQ3o0Wk1maEtzdENjNXpiZmFzbThvV3dPczlVcllvLUN1R18zdHd1NS1nemFELV95LWItTnBZM0gyVnBxWWhEay1jVEtPd2U0clVWcTNLMXNlazQxbHBRNnlVbzZvMWpUdDUxYjQ4?oc=5",
    "alternate_urls": [
      "https://www.cnbc.com/2026/01/04/us-airlines-resume-caribbean-flights-after-venezuela-strikes.html",
      "https://www.nytimes.com/live/2026/01/03/world/trump-united-states-strikes-venezuela/flights-canceled-caribbean-faa-venezuela",
      "https://fortune.com/2026/01/03/airline-flight-cancelations-eastern-caribbean-us-raid-venezuela-maduro/",
      "https://financialpost.com/pmn/business-pmn/flights-canceled-across-caribbean-after-us-raid-in-venezuela",
      "https://news.google.com/rss/articles/CBMisAFBVV95cUxPbXdQcVRYeGVIQzVLMjh2LWt3Rkl6WmZMejl2c1p4eFVzN3ZnN3p1dEtIbFFXQ1JROVV6ZWo3dDM1SDJ4NldHc1FUNjZxYnV0a2t2V2hLYzFteDFwUzIzSDUzQnhaUXFHVWxuSm1LV0xud2FDencxbHpQbXpLa3dlaldEWFlzZkM1SWU0UURXVDhySTFjWWw3LV9hbWxzT0sySEZRLXVvcDJyRTNXOVFKQg?oc=5",
      "https://www.businessinsider.com/venezuela-raid-flight-cancellations-strands-travelers-caribbean-2026-1"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMirwFBVV95cUxORTF0X1J4Sk9qQ0lTVzJlWFprVC1NWjJPT0wzTkdRaVdCUFZwbEVCbGc2S0V5VnhFbDMtcDlvUGdKY3c3cm00T19JQ3o0Wk1maEtzdENjNXpiZmFzbThvV3dPczlVcllvLUN1R18zdHd1NS1nemFELV95LWItTnBZM0gyVnBxWWhEay1jVEtPd2U0clVWcTNLMXNlazQxbHBRNnlVbzZvMWpUdDUxYjQ4?oc=5",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.834,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.8,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "negative_penalty=0.08 (keywords: attack); semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The US lifted temporary airspace restrictions over the Caribbean on Sunday, following military operations in Venezuela that had led to widespread flight cancellations. Airlines such as United, Delta, and JetBlue had suspended or canceled flights, affecting travelers returning from winter vacations. The Federal Aviation Administration cited safety concerns for the initial closures. Flight operations are now resuming.",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "US captures Venezuelan President Maduro in New York",
    "domain": "business",
    "source_domain": "npr.org",
    "location": "national",
    "published": "Sat, 03 Jan 2026 20:19:53 -0500",
    "source": "NPR",
    "sources": [
      "NPR",
      "The Economist",
      "Axios",
      "The Guardian",
      "Financial Times",
      "BusinessLine"
    ],
    "domains": [
      "npr.org",
      "news.google.com",
      "theguardian.com",
      "ft.com",
      "thehindubusinessline.com"
    ],
    "snippets": [
      "The United States has captured Venezuelan President Nicolás Maduro. Opposition leader María Corina Machado has been one of his biggest critics.",
      "The United States has captured Venezuela’s dictator, Nicolás Maduro The Economist",
      "How the operation to take out Venezuela's Maduro unfolded Axios",
      "Read the indictment of Venezuela's Nicolás Maduro Axios",
      "Venezuelan president accused of running a ‘corrupt’ government fuelled by a drug-trafficking operation that flooded US with cocaine Maduro detained in New York after – live updates A newly unsealed US justice department indictment accuses the captured Venezuelan president, Nicolás Maduro , of runnin",
      "Authoritarian leader withstood previous attempts to oust him but presided over collapse of country’s economy",
      "How the Pentagon snatched Nicolás Maduro The Economist",
      "Trump administration says the action was justified by criminal indictments accusing Maduro of narco-terrorism, legal experts argue that an indictment alone does not authorise the use of military force against a foreign government."
    ],
    "image_url": "",
    "titles": [
      "Who is María Corina Machado, Venezuela's Nobel Peace Prize winning opposition leader?",
      "The United States has captured Venezuela’s dictator, Nicolás Maduro - The Economist",
      "How the operation to take out Venezuela's Maduro unfolded - Axios",
      "Read the indictment of Venezuela's Nicolás Maduro - Axios",
      "Unsealed indictment reveals charges against Nicolás Maduro and his wife",
      "From rising revolutionary to Trump’s captive: Venezuela’s Nicolás Maduro",
      "How the Pentagon snatched Nicolás Maduro - The Economist",
      "Explained: The legality of the US operation to seize Venezuela’s Maduro"
    ],
    "url": "https://www.npr.org/2026/01/03/g-s1-104412/venezuela-nicolas-maduro-maria-corina-machado-opposition",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMitgFBVV95cUxOdi1IQ3dabmtLWm1xblBPb0lRMl9PUlIyQk5SdmRWZ0JUcWNEdWV4ZW93V0FHcDE1QkREOGRKZGRHVWE5dzJRN2F5TXNMRWxQRjd4N1B2LTZLNVFSbEhyWXJyczRoRVIwSXFrX3duMUtPRUdjT1d1NDk3TXM3dXFrMU9fNlQ4X1BuemdhdjFIOV90Q3NycmVydHVXcHhSMlEwS0NScjVFMVJMUTMyMEpOaVF5ekhydw?oc=5",
      "https://news.google.com/rss/articles/CBMifkFVX3lxTE1rajU3d3BmQjZZWkx2VDROUzY3WmNjYjRGTmRSejh0ZWQ4Z1huaTg0S0xJWVZvWGdBOFBxMFhfMDBUeG42bE84Z3VYT0dXdlFaVlhScFlqYVlZUUtqVDR2MlNGemlnUnVzQnd2OGs0endjMHZrcG5rampLRmd6QQ?oc=5",
      "https://news.google.com/rss/articles/CBMif0FVX3lxTFBHSWQ0MllSYkk5V0ZTZkdFYzlEc1dFdnpnVERyUXBYQlRWNko5T09aczNlSmhPdGx5M2p0YjJ0c0tpMTRkYW9YYTVUYTZEVVpOaHVKTWJXYzhBNDZ4SUtkRjRZT1VZUnNjUlF1Z3JyN0hqNXZKcG5TRXJNcUpHQ0k?oc=5",
      "https://www.theguardian.com/world/2026/jan/04/nicolas-maduro-cocaine-corruption-charges",
      "https://www.ft.com/content/689b7aa1-e912-43bc-b536-6c90ef0aa7bc",
      "https://news.google.com/rss/articles/CBMilAFBVV95cUxNTTV1UEphNm1CSGdscWd1amp2bjJKcWlLUVlrV1ppMEJpTzF4V0hkejBaX0dCTUNUbjRxT3IwS0xmdzl0YjZacUlRUHBQQ1l1U0xFckRKNU5pVWMtODFudWUwTU5NeFRjcEs3amFKV1BzcWtEVmE3OEh6QWJXOEpFejRjc01SbUE5TnpnRVNnVm5nSW9z?oc=5",
      "https://www.thehindubusinessline.com/news/world/explained-the-legality-of-the-us-operation-to-seize-venezuelas-maduro/article70469048.ece"
    ],
    "location_scope": "national",
    "link": "https://www.npr.org/2026/01/03/g-s1-104412/venezuela-nicolas-maduro-maria-corina-machado-opposition",
    "score_components": {
      "magnitude": 0.986,
      "recency": 0.759,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.798,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The United States has captured Venezuelan President Nicolás Maduro, who was detained in New York. A newly unsealed US Justice Department indictment accuses Maduro of leading a corrupt government and running a drug-trafficking operation that sent cocaine to the US. The operation to apprehend Maduro involved US military action. Opposition leader María Corina Machado has been a prominent critic of Maduro.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "US forces capture Venezuelan leader Maduro and his wife",
    "domain": "politics",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Sat, 03 Jan 2026 23:30:56 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "New York Times",
      "Business Insider",
      "NPR",
      "Reuters",
      "Financial Post",
      "SCMP",
      "BusinessLine",
      "Associated Press",
      "The Guardian"
    ],
    "domains": [
      "bbc.com",
      "nytimes.com",
      "businessinsider.com",
      "npr.org",
      "news.google.com",
      "financialpost.com",
      "scmp.com",
      "thehindubusinessline.com",
      "theguardian.com"
    ],
    "snippets": [
      "The US capture of Venezuela's President Nicolás Maduro dominates Sunday's papers.",
      "President Trump announced that U.S. forces had captured Venezuela’s president, Nicolás Maduro, following a “large-scale attack.”",
      "In the aftermath of the attack on Venezuela, the president said the US would be running the country and bringing in American oil companies.",
      "Top Republicans in Congress praised President Trump for the operation in Venezuela amid calls for briefings in the days to come.",
      "Trump signals US may expand focus to Cuba amid Venezuela operation Reuters",
      "The U.S. military operation that captured Venezuelan President Nicolas Maduro and flew him out of the country early Saturday also disrupted Caribbean travel at a busy travel time for the region. No airline flights were crossing over Venezuela that day, according to FlightRadar24.com. And major airli",
      "The US military operation that captured Venezuelan President Nicolas Maduro and flew him out of the country early on Saturday also disrupted Caribbean travel at a busy travel time for the region. No airline flights were crossing over Venezuela that day, according to FlightRadar24.com. Major airlines",
      "Flights were cancelled to and from Puerto Rico, the Virgin Islands, Aruba and more than a dozen other destinations in the Lesser Antilles island group north of Venezuela. Airlines waived change fees for passengers who had to reschedule flights",
      "What we know about a US strike that captured Venezuela’s Maduro and what comes next AP News",
      "Donald Trump says US will ‘run’ Venezuela as Nicolás Maduro and wife Cilia Flores are flown to New York US strikes on Venezuela – live updates The US president, Donald Trump, has said the US will ‘run’ Venezuela after its president, Nicolás Maduro, and his wife, Cilia Flores, were captured and taken",
      "U.S. forces carried out an audacious raid on the country’s capital, seizing President Nicolás Maduro. President Trump said the United States now intends to “run” Venezuela."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/c53a/live/1fa2db00-e8fa-11f0-aae2-2191c0e48a3b.jpg",
    "titles": [
      "The Papers: 'America on the warpath' and 'Trump to run Venezuela'",
      "An Operation in Venezuela",
      "The most important things Trump said about the operation that captured Venezuela's Nicolás Maduro",
      "Top Republicans praise Venezuela operation as some lawmakers question legal authority",
      "Trump signals US may expand focus to Cuba amid Venezuela operation - Reuters",
      "US military operation in Venezuela disrupts Caribbean holiday travel, hundreds of flights canceled",
      "Caribbean holidaymakers stranded after US operation to seize Maduro halts flights",
      "US military operation in Venezuela disrupts Caribbean holiday travel, hundreds of flights cancelled",
      "What we know about a US strike that captured Venezuela’s Maduro and what comes next - AP News",
      "Venezuela attack: what we know so far as US captures President Maduro",
      "What We Know About the U.S. Operation in Venezuela and Maduro’s Capture"
    ],
    "url": "https://www.bbc.com/news/articles/cvgpewy0rgjo?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://www.nytimes.com/2026/01/03/briefing/an-operation-in-venezuela.html",
      "https://www.businessinsider.com/key-things-trump-said-about-venezuela-raid-oil-maduro-capture-2026-1",
      "https://www.npr.org/2026/01/03/g-s1-104407/top-republicans-back-trump-venezuela",
      "https://news.google.com/rss/articles/CBMitAFBVV95cUxQQldtcGppWU9SZWlidHV6RVIydlUwR3Q1NW01VmZTOHdMYnBiWFpsMU1iTUhENG1MSVZod20zVENIQUNqQ1gxTG5HNHhsY281MzdENVNIVV94TTFwTjlBd0NmVExlVEotNEZYSmlLMXJlZDhyYWc0b1lSRnY2dlhVMUpYRC0waDlySmlEVGR4UjhvLXpiOGJoa1c5THVBc3F3UzFReUZFeEprc21zNFFLU2Z2V0M?oc=5",
      "https://financialpost.com/pmn/maduros-capture-disrupts-caribbean-holiday-travel-hundreds-of-flights-canceled",
      "https://www.scmp.com/news/world/americas/article/3338655/caribbean-holidaymakers-stranded-after-us-operation-seize-maduro-halts-flights?utm_source=rss_feed",
      "https://www.thehindubusinessline.com/news/world/us-military-operation-in-venezuela-disrupts-caribbean-holiday-travel-hundreds-of-flights-cancelled/article70470093.ece",
      "https://news.google.com/rss/articles/CBMilwFBVV95cUxPQ3FqNjVvN013dkxjSlYzZTZGNlczREFwTmN6RjNkZmFsODczSXZwcnp2NGc2SUxIOXlSVGdoUnVvRnRQQnc5MktmRmZfVVRtVTcwY0ZJQWNJejBqX09McnB2dWRyWnZ1UUI3djRDdXprNDc0bm9DTm5pX3FxZjZVLWNqSDdyVWhMNmNmRGdEOGo1bjBURVRB?oc=5",
      "https://www.theguardian.com/world/2026/jan/03/venezuela-attack-what-we-know-so-far-as-trump-claims-maduro-captured",
      "https://www.nytimes.com/2026/01/03/world/americas/venezuela-maduro-capture-trump.html"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/news/articles/cvgpewy0rgjo?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.721,
      "consensus": 1.0,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.796,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "The title suggests a sensational approach to the topic, focusing on conflict and power struggles. Without a summary or further details, it's hard to determine if the story offers any constructive elements.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "On January 4, 2026, U.S. forces captured Venezuelan President Nicolás Maduro and his wife, Cilia Flores, in a large-scale military operation. President Trump announced that the U.S. would run Venezuela and bring in American oil companies. The operation disrupted Caribbean air travel, with flights over Venezuela suspended and cancellations affecting nearby islands. Congressional leaders praised Trump and requested briefings. Trump also indicated potential U.S. action toward Cuba.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Rockets player Alperen Sengun hurts ankle and leaves game",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Sun, 4 Jan 2026 02:47:12 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet",
      "Yahoo Sports"
    ],
    "domains": [
      "espn.com",
      "sportsnet.ca",
      "sports.yahoo.com"
    ],
    "snippets": [
      "Rockets center Alperen Sengun suffered a lateral sprain of his right ankle in the first quarter of Saturday's game against the Mavericks and was ruled out for the rest of the game.",
      "Alperen Sengun’s night came to an abrupt and early end. The Houston Rockets star forward has been ruled out for the remainder of the team’s contest against the Dallas Mavericks on Saturday due to an ankle injury.",
      "That's one of the last things the Rockets want to see."
    ],
    "image_url": "",
    "titles": [
      "Rockets center Sengun exits loss with ankle sprain",
      "Rockets’ Alperen Sengun exits vs. Mavericks with ankle injury",
      "Rockets All-Star Alperen Şengün exits game vs. Mavericks with ankle sprain after 1 minute"
    ],
    "url": "https://www.espn.com/nba/story/_/id/47496692/rockets-sengun-done-night-sprained-right-ankle",
    "alternate_urls": [
      "https://sports.yahoo.com/nba/article/rockets-all-star-alperen-sengun-exits-game-vs-mavericks-with-ankle-sprain-after-1-minute-031342140.html"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/nba/story/_/id/47496692/rockets-sengun-done-night-sprained-right-ankle",
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.908,
      "consensus": 0.789,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.789,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about a player's injury but does not provide any deeper understanding or insight into the situation, nor does it report on any solutions or improvements.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Houston Rockets center Alperen Sengun suffered a lateral sprain of his right ankle in the first quarter of Saturday's game against the Dallas Mavericks and was ruled out for the remainder of the game. The team has not provided further updates on his condition.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "US strikes Venezuela and captures Maduro as world reacts",
    "domain": "politics",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Sun, 04 Jan 2026 06:02:11 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Reuters",
      "New York Times",
      "Globe and Mail"
    ],
    "domains": [
      "bbc.com",
      "news.google.com",
      "nytimes.com"
    ],
    "snippets": [
      "There has been a mixed reaction to a large-scale strike on Venezuela and Maduro's capture by the US.",
      "World reacts to US strikes on Venezuela Reuters",
      "Several Latin American leaders responded with anger, while European leaders were more cautious. President Trump’s audacious raid drew support, too.",
      "World leaders respond to U.S. strikes on Venezuela The Globe and Mail"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/19a6/live/dce55250-e905-11f0-a6e9-39449fe1d5f3.jpg",
    "titles": [
      "'Deeply shocked': World leaders react to US attack on Venezuela",
      "World reacts to US strikes on Venezuela - Reuters",
      "World Leaders React With Shock and Skepticism After U.S. Captures Maduro",
      "World leaders respond to U.S. strikes on Venezuela - The Globe and Mail"
    ],
    "url": "https://www.bbc.com/news/articles/czx1rpxzyx9o?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMijAFBVV95cUxNdHpzcHZRSXUzTjRaN09URlAyNGZrT2RRaHdxamlsV3djaGxadUZlTWVpRFBWMkd2LS0wZ1JmR0djdVVYRzlrX3g2WXlUbHBtVjBfWEFTdDNWUmNQT3FvckpKRzd3VS1CNjRtS1E2bmNQd0NIX0lEVG5na2NCNHl1SnRiREdGcGpROUE5LQ?oc=5",
      "https://www.nytimes.com/2026/01/03/world/americas/maduro-capture-venezuela-reaction-global.html",
      "https://news.google.com/rss/articles/CBMimwFBVV95cUxNa01tWEhFSEZNVHNOU1BCV1lEQ3hKS1lYaXNkYzRWRXJXVG1ZUU1YbGR3bEFBQi1ReUtiWm1saTk0N3haMV9UUzlETGhyQWlGN1lINnpHOXR0Z3VOVl8zd0N1SXh3RGoyVEhLNm8yMW5rU3h2dnVIVF9YczZQYlY4Y2pkTVZ2S3FvT20zNVU2ZWlfdFJpUms2dVBhcw?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/news/articles/czx1rpxzyx9o?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.865,
      "consensus": 0.888,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.785,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story seems to focus on reactions to a conflict situation, which might raise awareness about international relations. However, without a summary or further details, it's unclear if the story provides actionable insights or solutions.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The U.S. conducted large-scale strikes on Venezuela and captured Maduro, prompting mixed international reactions. Several Latin American leaders condemned the action, while European leaders responded with caution. President Trump’s decision received both criticism and support from world leaders. The situation remains tense following these developments.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Trump says Machado does not have respect to lead Venezuela",
    "domain": "politics",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Sun, 04 Jan 2026 07:06:15 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "ABC News",
      "New York Times"
    ],
    "domains": [
      "aljazeera.com",
      "abcnews.go.com",
      "nytimes.com"
    ],
    "snippets": [
      "US President Donald Trump says Venezuela’s opposition leader Maria Corina Machado lacks the respect to run the country.",
      "Venezuelans are reacting to the U.S. operation early Saturday that led to the capture of Venezuelan President Nicolás Maduro and his wife.",
      "María Corina Machado, Venezuela’s leading opposition figure, at a rally during the country’s presidential election in 2024."
    ],
    "image_url": "",
    "titles": [
      "Trump says opposition leader Maria Corina Machado unfit to run Venezuela",
      "Trump says Venezuelan opposition leader doesn't have the 'respect' to govern",
      "Trump administration declines to back Venezuela’s opposition leader."
    ],
    "url": "https://www.aljazeera.com/video/newsfeed/2026/1/4/trump-says-opposition-leader-maria-corina-machado-unfit-to-run-venezuela?traffic_source=rss",
    "alternate_urls": [
      "https://abcnews.go.com/International/trump-venezuelan-opposition-leader-respect-govern-after-maduro/story?id=128868550",
      "https://www.nytimes.com/live/2026/01/03/world/trump-maduro-venezuela-us-strikes/trump-administration-opposition-leader"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/video/newsfeed/2026/1/4/trump-says-opposition-leader-maria-corina-machado-unfit-to-run-venezuela?traffic_source=rss",
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.891,
      "consensus": 0.789,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.759,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about the political situation in Venezuela and the viewpoint of a significant international actor, but it lacks depth and insight into the reasons behind this statement or its implications for Venezuela and its people.",
    "constructiveness_source": "gpt",
    "summary_source": "snippet",
    "summary_reason": "invalid_roles",
    "headline_source": "gpt",
    "summary": "US President Donald Trump says Venezuela’s opposition leader Maria Corina Machado lacks the respect to run the country.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "President Trump criticizes Russia as leaders talk about Ukraine peace",
    "domain": "politics",
    "source_domain": "dw.com",
    "location": "global",
    "published": "2026-01-03T18:26:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "Bloomberg",
      "SCMP",
      "Reuters"
    ],
    "domains": [
      "dw.com",
      "news.google.com",
      "scmp.com"
    ],
    "snippets": [
      "US President Trump has said he is \"not thrilled with Putin\" during a press conference. Meanwhile, European security advisers discussed a 20-point peace plan put forward by Zelenskyy.",
      "Trump ‘Not Thrilled’ With Putin, Says Too Many People Dying Bloomberg.com",
      "US President Donald Trump expressed fresh frustration with Russian President Vladimir Putin on Saturday, bristling at the Kremlin’s continuing military operations even as the US leader seeks to bring an end to the war in Ukraine. “I’m not thrilled with Putin, he’s killing too many people,” Trump sai",
      "Trump says he's 'not thrilled' with Putin over war in Ukraine Reuters"
    ],
    "image_url": "",
    "titles": [
      "Ukraine updates: Trump says Putin 'killing too many people'",
      "Trump ‘Not Thrilled’ With Putin, Says Too Many People Dying - Bloomberg.com",
      "Trump ‘not thrilled’ with Putin, says too many people dying in Ukraine war",
      "Trump says he's 'not thrilled' with Putin over war in Ukraine - Reuters"
    ],
    "url": "https://www.dw.com/en/ukraine-updates-trump-says-putin-killing-too-many-people/live-75373512?maca=en-rss-en-top-1022-rdf",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiqwFBVV95cUxQUzJIQmNNckR2Qy0wQVpfbTdxLVZUd05YZ3BPV202VlFCN3ZiQ2RPUWFpM1RCdHdZenExTlZVbDVwWkJXUUVNNENMTTQwaWh6aXJyZzhvVlNXR0dQYTExcnRqdlh5M19vank1Vk5GeFJWeTQ3U19oQ251V05iRnZWc2lfa19VaW5zRDB4bUl1UlJOdHlJcjhLUWRsalkwdnl1YUFxTlM0RjU5V0E?oc=5",
      "https://www.scmp.com/news/world/russia-central-asia/article/3338640/trump-not-thrilled-putin-says-too-many-people-dying-ukraine-war?utm_source=rss_feed",
      "https://news.google.com/rss/articles/CBMiqgFBVV95cUxPTFR6OTVZN1lBdW8zRHZfaXY5VHdRSU9vb0E1ZjEwOU0ybWpVbDFReFZrQ2pMb2V4THRFU1FxRG1GSmlJTmxKTTh2Z1gzNUtZYVVhZC1BV2EtT1Yxbk9ObFlvdjU1VWVLOVljaS01c0RONlpKWkZ4MV9NYXVzak5QYnlWS3JxNzJ3bFYxTGQ0aGdRSXNMeXZMWk9KSndsczFpTE5TQXh3VzJLZw?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.dw.com/en/ukraine-updates-trump-says-putin-killing-too-many-people/live-75373512?maca=en-rss-en-top-1022-rdf",
    "score_components": {
      "magnitude": 0.952,
      "recency": 0.626,
      "consensus": 0.888,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.731,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "The title of the story suggests it may provide some awareness about the situation in Ukraine, but without more context or depth, it doesn't offer much in terms of usefulness or progress.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "US President Trump stated he is \"not thrilled with Putin,\" criticizing Russia's ongoing military actions in Ukraine and the resulting casualties. At the same time, European security advisers met to discuss a 20-point peace plan proposed by Zelenskyy. The discussions and criticisms reflect ongoing international efforts to address the conflict.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Swiss police investigate bar managers after deadly New Year fire",
    "domain": "business",
    "source_domain": "dw.com",
    "location": "global",
    "published": "2026-01-03T16:08:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "Al Jazeera",
      "Reuters",
      "The Guardian",
      "Washington Post",
      "New York Times",
      "Associated Press",
      "SCMP"
    ],
    "domains": [
      "dw.com",
      "aljazeera.com",
      "news.google.com",
      "theguardian.com",
      "washingtonpost.com",
      "nytimes.com",
      "scmp.com"
    ],
    "snippets": [
      "Authorities have launched an investigation into the managers of a bar in Crans-Montana after 40 people died at a New Year's Eve party.",
      "The managers are suspected of committing homicide, causing bodily harm and arson by negligence.",
      "Swiss prosecutors place bar managers under investigation after deadly blaze Reuters",
      "Suspected offences include homicide by negligence, causing bodily harm by negligence and arson by negligence The two managers of a bar where a blaze on New Year’s Day killed at least 40 people have been placed under criminal investigation, Swiss prosecutors have said. French couple Jacques and Jessi",
      "Swiss prosecutors investigate pair who ran bar over deadly blaze Reuters",
      "Police initiated a criminal case over the inferno, which killed 40 and injured 119, and said they were focused on champagne sparklers, venue capacity and building materials.",
      "The Swiss authorities say small fireworks on beverage bottles probably ignited foam insulation on the bar’s basement ceiling, setting off the broader blaze.",
      "What to know about the Swiss Alpine bar fire that killed 40 AP News",
      "Swiss authorities have opened an investigation into the managers of the bar where a fire at a New Year’s Eve party left 40 people dead, police said on Saturday. The two are suspected of involuntary homicide, involuntary bodily harm and involuntarily causing a fire, the Valais region’s chief prosecut"
    ],
    "image_url": "",
    "titles": [
      "Swiss NYE fire: Bar managers face criminal investigation",
      "Swiss launch criminal investigation over deadly fire at ski resort bar",
      "Swiss prosecutors place bar managers under investigation after deadly blaze - Reuters",
      "Swiss prosecutors place bar managers under investigation after deadly fire",
      "Swiss prosecutors investigate pair who ran bar over deadly blaze - Reuters",
      "Police accuse Swiss bar operators of negligent homicide in deadly fire",
      "Managers of Swiss Bar Are Suspected of Negligence in Deadly Fire, Police Say",
      "What to know about the Swiss Alpine bar fire that killed 40 - AP News",
      "Managers of Swiss bar face negligence probe after fatal New Year’s Eve fire that killed 40"
    ],
    "url": "https://www.dw.com/en/swiss-nye-fire-bar-managers-face-criminal-investigation/a-75378122?maca=en-rss-en-top-1022-rdf",
    "alternate_urls": [
      "https://www.aljazeera.com/news/2026/1/3/swiss-launch-criminal-investigation-over-deadly-fire-at-ski-resort-bar?traffic_source=rss",
      "https://news.google.com/rss/articles/CBMiwgFBVV95cUxPbkRnNXFYVHhVQVF3RFNkdjZCdFYwUl9LSHI4djhsTV9LUEszLUdmdkNVSDhBYTFPSVJFOXZvT3hURHpjSV85c2dybk9UWGJoRzNzdWN4TTVlVjdGNDBfM1g3cDBpbnVJZ3gyYmU3S0JQUHljUExrVmNpQmVPajVHdUtzWUNOclFQWHdSdjBhV21WQ1ZmSXpkZS1peWFTTmFGbHA4TTQxZ09wOFEtS1ZObzVpU3UtUmp0VXlVTkxacDNFZw?oc=5",
      "https://www.theguardian.com/world/2026/jan/03/swiss-prosecutors-place-bar-managers-investigation-deadly-fire",
      "https://news.google.com/rss/articles/CBMiqgFBVV95cUxONTBkRmItUGhoNUhaaFdYc1JrODB6TXdVUnpwcWdpYTg3OHNYcTl5aDFqNzhfNDlnWkVuc0poMkhvN3BrelV3aEpPQS1sN0JPbUpCeDFYRnJrZkRnU2UxWnFUdktxWktSLUNXR2EwRWxTdXlpMDdfbkVEalBQQ05SVzZBdkY0M2NsbTR0MWtUSDNUVXFFTnpVV3ZvT0FvSkJxVVRZTHdvMGJPdw?oc=5",
      "https://www.washingtonpost.com/world/2026/01/03/swiss-fire-investigation-champagne-sparklers/",
      "https://www.nytimes.com/2026/01/03/world/europe/swiss-fire-bar-managers-charged.html",
      "https://news.google.com/rss/articles/CBMimgFBVV95cUxNR3IzMFl4OVAxbzRjMDZxaEctdlphWjEzQjJ0cGw0VG5VLW1zNTRNZ2wzdm5SZWVaYkRuM3h5ZkpFOXJnZVZzR2s4UHhVdXU0ZFhmRTNuTnRydUVxTjhGdGdJNlItNV9mQXdXNmZ2WGdoajRlMW40Z1BMdEVxUDZuVTY0YmU2UGg5cWlPMWdRc2F5bTVlV1BDRVdR?oc=5",
      "https://www.scmp.com/news/world/europe/article/3338635/managers-swiss-bar-face-negligence-probe-after-fatal-new-years-fire-killed-40?utm_source=rss_feed"
    ],
    "location_scope": "global",
    "link": "https://www.dw.com/en/swiss-nye-fire-bar-managers-face-criminal-investigation/a-75378122?maca=en-rss-en-top-1022-rdf",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.588,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.726,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Swiss authorities have opened a criminal investigation into the managers of a bar in Crans-Montana after a New Year's Eve fire killed 40 people and injured 119. The managers, identified as Jacques and Jessi, are suspected of homicide by negligence, causing bodily harm by negligence, and arson by negligence. Investigators believe champagne sparklers ignited foam insulation, leading to the blaze. The case is ongoing.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Detroit Pistons will play without Jalen Duren and Tobias Harris",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Sun, 4 Jan 2026 02:47:12 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Yahoo Sports"
    ],
    "domains": [
      "espn.com",
      "sports.yahoo.com"
    ],
    "snippets": [
      "The Eastern Conference-leading Detroit Pistons will be without starters Jalen Duren and Tobias Harris for at least the next few games.",
      "Tobias Harris has a left hip sprain and will be re-evaluated in two weeks, Jalen Duren's right ankle sprain will be re-evaluated in a week."
    ],
    "image_url": "",
    "titles": [
      "Pistons starters Duren (ankle), Harris (hip) out",
      "Pistons' starters Jalen Duren, Tobias Harris to miss several games with injuries"
    ],
    "url": "https://www.espn.com/nba/story/_/id/47493237/pistons-jalen-duren-ankle-tobias-harris-hip-sidelined",
    "alternate_urls": [
      "https://sports.yahoo.com/articles/pistons-starters-jalen-duren-tobias-221151303.html"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/nba/story/_/id/47493237/pistons-jalen-duren-ankle-tobias-harris-hip-sidelined",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.908,
      "consensus": 0.591,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.716,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about the players' injuries but does not offer any deeper understanding or insight into the situation, nor does it report on any solutions or improvements.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The Detroit Pistons, who lead the Eastern Conference, will play their next few games without starters Jalen Duren and Tobias Harris. Harris is sidelined with a left hip sprain and will be re-evaluated in two weeks, while Duren has a right ankle sprain and will be re-evaluated in one week.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "UK and France bomb tunnels in Syria to stop threats",
    "domain": "general",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Sun, 04 Jan 2026 03:40:40 -0500",
    "source": "ABC News",
    "sources": [
      "ABC News",
      "The Guardian"
    ],
    "domains": [
      "abcnews.go.com",
      "theguardian.com"
    ],
    "snippets": [
      "British and French warplanes have carried out an airstrike in central Syria, targeting an underground facility suspected of storing weapons for the Islamic State group",
      "Guided bombs used to target tunnels at site near to city of Palmyra in raid intended to ‘eliminate dangerous terrorists’ British and French aircraft have carried out a joint strike on an underground facility in Syria that had been occupied by Islamic State, the UK Ministry of Defence has said. Guide"
    ],
    "image_url": "https://s.abcnews.com/images/US/abc_news_default_2000x2000_update_4x3t_384.jpg",
    "titles": [
      "British and French warplanes strike suspected IS weapons facility in Syria",
      "British and French aircraft attack underground Islamic State weapons store in Syria"
    ],
    "url": "https://abcnews.go.com/International/wireStory/british-french-warplanes-strike-suspected-weapons-facility-syria-128884467",
    "alternate_urls": [
      "https://www.theguardian.com/world/2026/jan/03/british-and-french-aircraft-attack-underground-isis-weapons-store-in-syria"
    ],
    "location_scope": "national",
    "link": "https://abcnews.go.com/International/wireStory/british-french-warplanes-strike-suspected-weapons-facility-syria-128884467",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.93,
      "consensus": 0.591,
      "constructiveness": 0.5,
      "proximity": 0.25
    },
    "score": 0.699,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides awareness about the ongoing conflict and actions taken by international actors. However, it does not delve into the broader context, the effectiveness of these actions, or potential solutions to the conflict.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "British and French warplanes conducted a joint airstrike in central Syria near Palmyra, targeting an underground facility previously used by Islamic State. The UK Ministry of Defence stated that guided bombs were used to strike tunnels at the site, aiming to eliminate threats from the group. The operation was intended to disrupt weapons storage and terrorist activity.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Fire in Swiss ski town kills at least 40 people",
    "domain": "general",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Sun, 04 Jan 2026 09:35:27 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "bbc.com",
      "theguardian.com"
    ],
    "snippets": [
      "A criminal investigation has been launched into the fire, with families now facing an agonising wait to identify missing loved ones.",
      "The community spirit of the close-knit Swiss resort where at least 40 people died in a fire is strong even as inhabitants say they feel crushed by the tragedy Mourners have continued to bring flowers and light candles at a makeshift memorial in the Swiss ski resort of Crans-Montana to commemorate th"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/5887/live/18e0d720-e94c-11f0-ba71-4b785691acc9.jpg",
    "titles": [
      "Police identify 16 more victims of Swiss bar fire",
      "‘It has hit us very hard’: grief grips Crans-Montana as police identify more victims"
    ],
    "url": "https://www.bbc.com/news/articles/c3vel0xvlvgo?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://www.theguardian.com/world/2026/jan/04/it-has-hit-us-very-hard-grief-stricken-crans-montana-residents-on-how-their-world-has-changed-forever"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/news/articles/c3vel0xvlvgo?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.954,
      "consensus": 0.591,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.695,
    "constructiveness_score": 0.2,
    "constructiveness_reason": "This story is reactive and focuses on the aftermath of a tragic event. It does not provide actionable insights, nor does it report on solutions or improvements to prevent such incidents in the future.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "A criminal investigation has begun after a fire in the Swiss ski resort of Crans-Montana killed at least 40 people. Families are waiting to identify missing loved ones, while residents and mourners gather at a makeshift memorial to honor the victims. The community remains united in grief as authorities continue their inquiry.",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Anthony Joshua returns to UK after car crash in Nigeria",
    "domain": "sports",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Sun, 04 Jan 2026 09:39:08 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "BBC Sport"
    ],
    "domains": [
      "aljazeera.com",
      "bbc.com"
    ],
    "snippets": [
      "Joshua returns after recovering from the minor injuries he sustained during a crash that killed two of his friends.",
      "Former world heavyweight champion Anthony Joshua flies back to the UK following a fatal car crash that killed two of his close friends in Nigeria."
    ],
    "image_url": "",
    "titles": [
      "Boxer Anthony Joshua returns to UK after fatal Nigeria car crash",
      "Joshua flies back to UK after Nigeria car crash"
    ],
    "url": "https://www.aljazeera.com/sports/2026/1/4/boxer-anthony-joshua-returns-to-uk-after-fatal-nigeria-car-crash?traffic_source=rss",
    "alternate_urls": [
      "https://www.bbc.com/sport/boxing/articles/c368p7zld0wo?at_medium=RSS&at_campaign=rss"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/sports/2026/1/4/boxer-anthony-joshua-returns-to-uk-after-fatal-nigeria-car-crash?traffic_source=rss",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.956,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.675,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Anthony Joshua has returned to the UK after recovering from minor injuries sustained in a car crash in Nigeria that killed two of his friends. The incident occurred recently, and Joshua had been receiving treatment before traveling back. No further details on the crash have been released.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Britain and France carry out airstrike on site in Syria",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Sat, 03 Jan 2026 22:56:12 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "SCMP",
      "BusinessLine"
    ],
    "domains": [
      "news.google.com",
      "scmp.com",
      "thehindubusinessline.com"
    ],
    "snippets": [
      "Britain says it and France bombed suspected Islamic State arms dump in Syria Reuters",
      "Britain’s and France’s air forces conducted a joint operation ‍on Saturday evening to bomb a suspected underground arms cache previously used by the Islamic State (Isis) in Syria, Britain’s defence ministry said. “Royal Air Force aircraft have completed successful strikes against Daesh in a joint op",
      "The operation used Typhoon FGR4 jets and Paveway IV guided bombs, supported by a Voyager refuelling tanker."
    ],
    "image_url": "",
    "titles": [
      "Britain says it and France bombed suspected Islamic State arms dump in Syria - Reuters",
      "Britain and France bombed suspected Isis arms dump in Syria: UK defence ministry",
      "Britain and France conduct joint airstrike on suspected ISIS arms cache in Syria"
    ],
    "url": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxOdTRPcWFJTW1xaU5oUE9tbDhET2RyYWo0Tkg2X2ptOEZXdkpwbUpRM2tDdTh0aEVqV3N2SDVHV2l0S2c3T184TVZnQWtCVGJHWlItRHBhV1VnV1hGS2EwUjRjNzl5MnpnT2dvb2pkZ2FuUG1kVi1uNWJqNzFhNUllUDhrNE5rMnhzLWVQdHNJeDVNeE5hUk9TcDM0ZTE2QUhOYWZEUkw2YUk?oc=5",
    "alternate_urls": [
      "https://www.scmp.com/news/world/middle-east/article/3338643/britain-and-france-bombed-suspected-isis-arms-dump-syria-uk-defence-ministry?utm_source=rss_feed",
      "https://www.thehindubusinessline.com/news/world/britain-and-france-conduct-joint-airstrike-on-suspected-isis-arms-cache-in-syria/article70469078.ece"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMiqAFBVV95cUxOdTRPcWFJTW1xaU5oUE9tbDhET2RyYWo0Tkg2X2ptOEZXdkpwbUpRM2tDdTh0aEVqV3N2SDVHV2l0S2c3T184TVZnQWtCVGJHWlItRHBhV1VnV1hGS2EwUjRjNzl5MnpnT2dvb2pkZ2FuUG1kVi1uNWJqNzFhNUllUDhrNE5rMnhzLWVQdHNJeDVNeE5hUk9TcDM0ZTE2QUhOYWZEUkw2YUk?oc=5",
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.71,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.675,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Britain and France conducted a joint airstrike on Saturday evening, targeting a suspected underground Islamic State arms cache in Syria, according to Britain's defence ministry. The operation involved Typhoon FGR4 jets and Paveway IV guided bombs, with support from a Voyager refuelling tanker. The strikes were described as successful.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Trump says US will control Venezuela after Maduro captured",
    "domain": "business",
    "source_domain": "washingtonpost.com",
    "location": "global",
    "published": "Sun, 04 Jan 2026 08:39:30 +0000",
    "source": "Washington Post",
    "sources": [
      "Washington Post",
      "Forbes"
    ],
    "domains": [
      "washingtonpost.com",
      "forbes.com"
    ],
    "snippets": [
      "President Donald Trump said the United States will control Venezuela for an unspecified period after a U.S. raid captured Venezuelan President Nicolás Maduro.",
      "Maduro and his wife will face charges in federal court in New York, Attorney General Pam Bondi said."
    ],
    "image_url": "",
    "titles": [
      "Live updates: Maduro in Brooklyn detention center after U.S. capture",
      "Maduro Arrives In U.S. After Capture (Live Updates)"
    ],
    "url": "https://www.washingtonpost.com/world/2026/01/03/us-venezuela-strikes-trump-maduro/",
    "alternate_urls": [
      "https://www.forbes.com/sites/saradorn/2026/01/03/maduro-arrives-in-us-after-capture-live-updates/"
    ],
    "location_scope": "global",
    "link": "https://www.washingtonpost.com/world/2026/01/03/us-venezuela-strikes-trump-maduro/",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.93,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.668,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "snippet",
    "summary_reason": "invalid_roles",
    "headline_source": "gpt",
    "summary": "President Donald Trump said the United States will control Venezuela for an unspecified period after a U.S. raid captured Venezuelan President Nicolás Maduro.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Amanda Serrano wins boxing match and keeps world title",
    "domain": "sports",
    "source_domain": "skysports.com",
    "location": "global",
    "published": "Sun, 04 Jan 2026 07:27:00 GMT",
    "source": "Sky Sports",
    "sources": [
      "Sky Sports",
      "BBC Sport"
    ],
    "domains": [
      "skysports.com",
      "bbc.com"
    ],
    "snippets": [
      "Amanda Serrano had to overcome a badly-swollen right eye in a homecoming world title win over Reina Tellez.",
      "Featherweight world champion Amanda Serrano marks her Puerto Rico homecoming with a hard-earned but dominant points win over Reina Tellez."
    ],
    "image_url": "https://e0.365dm.com/26/01/1920x1080/skysports-amanda-serrano-boxing_7125821.jpg?20260104081302",
    "titles": [
      "Serrano retains world titles after tough homecoming clash",
      "Serrano retains world titles in homecoming win"
    ],
    "url": "https://www.skysports.com/boxing/news/12040/13490209/amanda-serrano-overcomes-badly-swollen-right-eye-in-world-title-win-over-reina-tellez-in-puerto-rico",
    "alternate_urls": [
      "https://www.bbc.com/sport/boxing/articles/ce8rdprey6ro?at_medium=RSS&at_campaign=rss"
    ],
    "location_scope": "global",
    "link": "https://www.skysports.com/boxing/news/12040/13490209/amanda-serrano-overcomes-badly-swollen-right-eye-in-world-title-win-over-reina-tellez-in-puerto-rico",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.899,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.664,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Amanda Serrano defeated Reina Tellez by points in Puerto Rico, retaining her featherweight world title. Serrano overcame a badly-swollen right eye during the fight but secured a dominant victory in her homecoming match.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Root and Brook help England reach 211 for three in Sydney",
    "domain": "sports",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Sun, 04 Jan 2026 07:22:09 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Sky Sports"
    ],
    "domains": [
      "bbc.com",
      "skysports.com"
    ],
    "snippets": [
      "Joe Root and Harry Brook are denied the chance to improve on their 154-run partnership as bad light and rain cut day one of the fifth Ashes Test in Sydney short, leaving England on 211-3.",
      "Joe Root and Harry Brook shared in England's highest partnership of the series to put the tourists on top after a storm-affected first day of the fifth Ashes Test in Sydney."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/0618/live/3f37d770-e938-11f0-a8dc-93c15fe68710.jpg",
    "titles": [
      "England make good start to fifth Test as first day cut short",
      "Root and Brook stand has England on top in stormy Sydney"
    ],
    "url": "https://www.bbc.com/sport/cricket/videos/c0mkz27g2v8o?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://www.skysports.com/cricket/news/12040/13490189/the-ashes-england-on-top-in-stormy-sydney-as-joe-root-and-harry-brook-share-in-unbroken-century-partnership"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/sport/cricket/videos/c0mkz27g2v8o?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.897,
      "consensus": 0.591,
      "constructiveness": 0.03,
      "proximity": 0.5
    },
    "score": 0.661,
    "constructiveness_score": 0.03,
    "constructiveness_reason": "actions: start; semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Joe Root and Harry Brook scored a 154-run partnership, England’s highest of the series, on the first day of the fifth Ashes Test in Sydney. Play was halted early due to bad light and rain, with England finishing the day at 211-3.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Auston Matthews sets Leafs goal record but Islanders win game",
    "domain": "sports",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Sun, 04 Jan 2026 05:49:21 GMT",
    "source": "NHL",
    "sources": [
      "NHL",
      "Sportsnet"
    ],
    "domains": [
      "news.google.com",
      "sportsnet.ca"
    ],
    "snippets": [
      "Schaefer, Islanders rally in OT after Matthews sets Maple Leafs career goals record NHL.com",
      "Watch as New York Islanders’ Matthew Schaefer calls sniping home the OT winner for his second goal of the night against the Toronto Maple Leafs.",
      "Toronto Maple Leafs captain Auston Matthews scored twice in the second period against the New York Islanders on Saturday night to pass Mats Sundin and set the franchise record for career goals with 421."
    ],
    "image_url": "",
    "titles": [
      "Schaefer, Islanders rally in OT after Matthews sets Maple Leafs career goals record - NHL.com",
      "Islanders’ Schaefer calls game with OT winner vs. Maple Leafs",
      "Maple Leafs’ Matthews breaks Sundin’s franchise goals record"
    ],
    "url": "https://news.google.com/rss/articles/CBMikwFBVV95cUxPWEYyQWpaUEdBU3RZN1l5RC1BQVBOaWtYTjJYb0pzVUx6S29ESmlTXzJUWnp3T3QyTlZUcVpUUnNEN2JmSkpncF9vRFZfb3dDVkxISmdJcFBFZWlvZWJlbm9ZbkZaeWc2ZDl1SFlnVGY0UFpseC1CWkZMdnlQQ1Z3dFNfZmJVT1VzMTNtVm12OUUzY2s?oc=5",
    "alternate_urls": [],
    "location_scope": "national",
    "link": "https://news.google.com/rss/articles/CBMikwFBVV95cUxPWEYyQWpaUEdBU3RZN1l5RC1BQVBOaWtYTjJYb0pzVUx6S29ESmlTXzJUWnp3T3QyTlZUcVpUUnNEN2JmSkpncF9vRFZfb3dDVkxISmdJcFBFZWlvZWJlbm9ZbkZaeWc2ZDl1SFlnVGY0UFpseC1CWkZMdnlQQ1Z3dFNfZmJVT1VzMTNtVm12OUUzY2s?oc=5",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.86,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.647,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Auston Matthews scored twice for the Toronto Maple Leafs, surpassing Mats Sundin to set a new franchise record with 421 career goals. Despite Matthews' achievement, the New York Islanders won the game in overtime, with Matthew Schaefer scoring the decisive goal—his second of the night.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Fire cuts power for 50000 homes in Berlin during cold weather",
    "domain": "business",
    "source_domain": "theguardian.com",
    "location": "global",
    "published": "Sat, 03 Jan 2026 16:31:37 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "Bloomberg",
      "SCMP"
    ],
    "domains": [
      "theguardian.com",
      "news.google.com",
      "scmp.com"
    ],
    "snippets": [
      "Damage to cables means tens of thousands will be without electricity until Thursday amid freezing temperatures Tens of thousands of homes in Berlin will be without electricity until Thursday as authorities struggle to repair power cables seriously damaged in a suspected arson attack, officials have",
      "Berlin Power Outage Hits 50,000 Homes in Suspected Arson Attack Bloomberg.com",
      "Tens of thousands of homes in Berlin will be without electricity until Thursday as authorities struggle to repair power cables seriously damaged in a suspected arson attack, officials said. Some may also be without heating as the outage has affected local systems, at a time when the German capital i"
    ],
    "image_url": "https://i.guim.co.uk/img/media/243df7c7e6fc9af33afe8336c57c99a5ba492fac/168_0_2915_2333/master/2915.jpg?width=140&quality=85&auto=format&fit=max&s=156e966f9a1acec1592957576f5d13b9",
    "titles": [
      "Berlin power outage hits 45,000 homes after suspected arson attack",
      "Berlin Power Outage Hits 50,000 Homes in Suspected Arson Attack - Bloomberg.com",
      "Cable fire cuts power to tens of thousands of Berlin homes and businesses"
    ],
    "url": "https://www.theguardian.com/world/2026/jan/03/berlin-power-outage-hits-homes-suspected-arson-attack",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMitAFBVV95cUxQUlZUWUtBZVUzR2MyTlhMeFVVM08wc0VPS1MwQUVKSzdpOWhtOXRuV1ZyWlFicG54b0NEQXhlSTNrajZFSE1teHlIOF9NdzdHMl96UjhmbDE1MnY4RGZoX3lSNHFpNm9IOWxsYTBFcDFSb0RHbTVZSC12WW1KY3ZIa3JNZ0o0U0s5RTFKRzBMbmE4aEZFbkdxbEptQlBjaF9BNlpvWHNYZVZpZjdwZWx5QzhJNEI?oc=5",
      "https://www.scmp.com/news/world/europe/article/3338637/cable-fire-cuts-power-tens-thousands-berlin-homes-and-businesses?utm_source=rss_feed"
    ],
    "location_scope": "global",
    "link": "https://www.theguardian.com/world/2026/jan/03/berlin-power-outage-hits-homes-suspected-arson-attack",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.594,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.634,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "negative_penalty=0.08 (keywords: attack); semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "cache",
    "summary_reason": "",
    "headline_source": "cache",
    "summary": "A suspected arson attack on power cables has left around 50,000 homes in Berlin without electricity, with some also losing heating. Authorities report that repairs are ongoing, and power is not expected to be restored until Thursday. The outage comes during freezing temperatures, raising concerns for affected residents.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Stranger Things ends with final episode and big crowds watching",
    "domain": "business",
    "source_domain": "forbes.com",
    "location": "global",
    "published": "Sat, 03 Jan 2026 22:34:20 -0500",
    "source": "Forbes",
    "sources": [
      "Forbes",
      "The Verge"
    ],
    "domains": [
      "forbes.com",
      "theverge.com"
    ],
    "snippets": [
      "‘Stranger Things’ delivers a dramatic ending with series finale “The Rightside Up,” leaving the final fate of Eleven (Millie Bobby Brown) ambiguous—but there are clues.",
      "The parking lot was packed. That's the first Strange Thing. A little background. Just about every mall is struggling now, but the Neshaminy Mall in Bensalem, Pennsylvania is more or less comatose. As Defector's Dan McQuade, a lifelong Pennsylvanian and mall fan, wrote in his fond remembrance of the"
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/6959dc46f09a645d12508c44/0x0.jpg?width=960",
    "titles": [
      "Netflix’s ‘Stranger Things’ Finale—What Really Happened To Eleven?",
      "I went to the Stranger Things finale in theaters and the strangest thing happened"
    ],
    "url": "https://www.forbes.com/sites/danidiplacido/2026/01/03/netflixs-stranger-things-finale-what-really-happened-to-eleven/",
    "alternate_urls": [
      "https://www.theverge.com/streaming/853133/stranger-things-finale-theater-scene-report"
    ],
    "location_scope": "global",
    "link": "https://www.forbes.com/sites/danidiplacido/2026/01/03/netflixs-stranger-things-finale-what-really-happened-to-eleven/",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.807,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.631,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The series finale of \"Stranger Things,\" titled “The Rightside Up,” aired, concluding the show with a dramatic ending. The fate of the character Eleven (Millie Bobby Brown) is left ambiguous, though hints are provided. The episode has generated significant attention, including large gatherings at locations like the Neshaminy Mall in Pennsylvania.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Khamenei says security forces should act against Iran protests",
    "domain": "business",
    "source_domain": "cbc.ca",
    "location": "national",
    "published": "Sat, 03 Jan 2026 13:57:27 EST",
    "source": "CBC News",
    "sources": [
      "CBC News",
      "SCMP"
    ],
    "domains": [
      "cbc.ca",
      "scmp.com"
    ],
    "snippets": [
      "The first comments by 86-year-old Ayatollah Ali Khamenei come as violence surrounding the demonstrations sparked by Iran's ailing economy has killed at least 10 people.",
      "Iran’s supreme leader insisted on Saturday that “rioters must be put in their place” after a week of protests that have shaken the Islamic Republic, likely giving security forces a green light to aggressively put down the demonstrations. The first comments by 86-year-old Ayatollah Ali Khamenei come"
    ],
    "image_url": "",
    "titles": [
      "Iran's Khamenei says 'rioters should be put in their place'",
      "Iran’s Khamenei demands rioters ‘be put in their place’ as protests grow amid Trump warning"
    ],
    "url": "https://www.cbc.ca/news/world/iran-khamenei-protesters-9.7032737?cmp=rss",
    "alternate_urls": [
      "https://www.scmp.com/news/world/middle-east/article/3338626/irans-khamenei-demands-rioters-be-put-their-place-protests-grow-amid-trump-warning?utm_source=rss_feed"
    ],
    "location_scope": "national",
    "link": "https://www.cbc.ca/news/world/iran-khamenei-protesters-9.7032737?cmp=rss",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.636,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.629,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Ayatollah Ali Khamenei, 86, made his first public comments following a week of protests over Iran's struggling economy, during which at least 10 people have died. Khamenei stated that \"rioters must be put in their place,\" signaling support for security forces to take stronger action against the demonstrations. The unrest has significantly impacted the country.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Scientists find new ways to help aging bodies heal better",
    "domain": "science",
    "source_domain": "sciencedaily.com",
    "location": "global",
    "published": "Sat, 03 Jan 2026 20:59:17 EST",
    "source": "ScienceDaily",
    "sources": [
      "ScienceDaily",
      "SciTechDaily"
    ],
    "domains": [
      "sciencedaily.com",
      "scitechdaily.com"
    ],
    "snippets": [
      "Researchers have discovered a way to help aging intestines heal themselves using CAR T-cell therapy. By targeting senescent cells that build up over time, the treatment boosted gut regeneration, reduced inflammation, and improved nutrient absorption in mice. It even helped protect the intestine from",
      "Alzheimer’s has long been seen as irreversible, but new findings suggest that assumption may be wrong. For more than a century, Alzheimer’s disease has been widely viewed as a condition that cannot be reversed. Because of this, most research has focused on preventing the disease or slowing its progr"
    ],
    "image_url": "",
    "titles": [
      "Scientists found a way to help aging guts heal themselves",
      "Scientists Found a Way to Help the Brain Bounce Back From Alzheimer’s"
    ],
    "url": "https://www.sciencedaily.com/releases/2026/01/260103155028.htm",
    "alternate_urls": [
      "https://scitechdaily.com/scientists-found-a-way-to-help-the-brain-bounce-back-from-alzheimers/"
    ],
    "location_scope": "global",
    "link": "https://www.sciencedaily.com/releases/2026/01/260103155028.htm",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.773,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.621,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Researchers have developed a CAR T-cell therapy that targets senescent cells in aging intestines, leading to improved gut healing, reduced inflammation, and better nutrient absorption in mice. Separately, new findings challenge the belief that Alzheimer’s disease is irreversible, suggesting it may be possible to reverse aspects of the condition. Both advances could impact future treatments for aging-related diseases.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Maduro is in jail in New York says news report",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Sun, 04 Jan 2026 04:17:00 GMT",
    "source": "Al Arabiya",
    "sources": [
      "Al Arabiya"
    ],
    "domains": [
      "news.google.com"
    ],
    "snippets": [
      "Venezuela’s Maduro now in New York jail Al Arabiya English",
      "Russia says information that Venezuela’s VP is in Russia is fake Al Arabiya English"
    ],
    "image_url": "",
    "titles": [
      "Venezuela’s Maduro now in New York jail - Al Arabiya English",
      "Russia says information that Venezuela’s VP is in Russia is fake - Al Arabiya English"
    ],
    "url": "https://news.google.com/rss/articles/CBMiogFBVV95cUxQZTRSazFEbWtEOGxHeU9wdGF5TVlXcEktcWFEaHBuMkRRWTM2X3FpdlhYS0Uzd3ZDLU9qbHEwU09xd0dkQTUwRmlYUmE0NHZmaVBIYVlsSXpJb19LcDhqRGwtSlcxclhmd0NkQnlkUDlmNEJyRGxYVlU2anpwZm5LYkVBU3MwcGVQZVNzMFhHNFNNUWZfbi1vbE1BQjNDMWh6Y0HSAacBQVVfeXFMTkpIa2gweV9EblJ5SVk2ZjM0cVlaLUFtbVBOTFF1cVZacmRjYVZ5aTBWU1NRTTNXSUJqYVpDRTY3UzJHNWpheTBYbURSWVJKaENJNUpqZnY1bmt3SWNQU2pIUUVrYWpBdUdRT2l4YTNtcDFSNmxWSks1dU5lWkZMaE5mRmMxUHRJNUM3UEMzTVppUzAyay0zSThGYW5fQzRGWlA5S2tKYmc?oc=5",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMitAFBVV95cUxORk94dXVmUE8yZzI0MzBReFhZejk0UTdZbl9ZaHRyTUZKZVF0aHpFbGgtaTRPb1YzbVlaTEtaLXV4di1lclRhc0UyeHQ5M2NWWnduSm9vcFFQUTcySkhzVDlpSUdJcVhDUzkyRTdoNDZrUGZUaFIzbVMzd1IweXFyWmw2NEM0cnc0bjB0X1ZuV2pzNWlKdmtKd0YtQWVKdzlMZ1pVNTlKY0xvejZRZkZfMXhhdF_SAboBQVVfeXFMTjlyWlJBSHYybWhZaXdzYzlBLWE3dTVrdDNGRHA4ZEJERWhkYkxsQ3JnTHM4Yk9XQXJXUngycS1VRWwxbl9HZkhHY3JKdzFUN3Q3SnV4T1VOOWZrSGJJWTdrUTlsTFhuNFBuQlFEYjEtOEFfaVd0ZWZJRUZ2WFJRSmlpV2pRa0tUS2NjLWdsVGxYUTNPZTFNVnUwMWVCZjlTXzhwYmctNzg2WG1sYm94X0FlNjBnMVdvdnN3?oc=5"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMiogFBVV95cUxQZTRSazFEbWtEOGxHeU9wdGF5TVlXcEktcWFEaHBuMkRRWTM2X3FpdlhYS0Uzd3ZDLU9qbHEwU09xd0dkQTUwRmlYUmE0NHZmaVBIYVlsSXpJb19LcDhqRGwtSlcxclhmd0NkQnlkUDlmNEJyRGxYVlU2anpwZm5LYkVBU3MwcGVQZVNzMFhHNFNNUWZfbi1vbE1BQjNDMWh6Y0HSAacBQVVfeXFMTkpIa2gweV9EblJ5SVk2ZjM0cVlaLUFtbVBOTFF1cVZacmRjYVZ5aTBWU1NRTTNXSUJqYVpDRTY3UzJHNWpheTBYbURSWVJKaENJNUpqZnY1bmt3SWNQU2pIUUVrYWpBdUdRT2l4YTNtcDFSNmxWSks1dU5lWkZMaE5mRmMxUHRJNUM3UEMzTVppUzAyay0zSThGYW5fQzRGWlA5S2tKYmc?oc=5",
    "score_components": {
      "magnitude": 0.393,
      "recency": 0.824,
      "consensus": 0.35,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.515,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about a current event, but it does not offer any deeper insights or actionable information for the reader. It does not report on solutions, improvements, or attempts to solve problems.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Venezuela’s Maduro is currently in jail in New York, according to Al Arabiya English. In related news, Russia has denied reports claiming that Venezuela’s Vice President is in Russia, calling the information false. No further details on the circumstances of Maduro’s detention have been provided.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Venezuela stops sending oil because of political problems",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Sat, 03 Jan 2026 21:35:00 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters"
    ],
    "domains": [
      "news.google.com"
    ],
    "snippets": [
      "Venezuela's oil exports paralyzed amid political turmoil, sources say Reuters",
      "Venezuela's oil facilities unscathed in US strike, sources say Reuters"
    ],
    "image_url": "",
    "titles": [
      "Venezuela's oil exports paralyzed amid political turmoil, sources say - Reuters",
      "Venezuela's oil facilities unscathed in US strike, sources say - Reuters"
    ],
    "url": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxPZ0dHUEhsVXdwSlFOQkpvNzl5Z19Eam9yN2tPMjZqSE41MXZjTmQxY0Y2WnZkLU1NdW92TmVXMXpLTHE5Uk8zLTFNbUg0NktWMHdBY1BRZXMtR3JaT2tKc25RT21oQ2lLUUZKSzZ2NU53b1JmSTduWXpRRWRjaERRYnpYQ3FyY1NvYlhhUjVrdE1ic3ZwUk50Q3dDVlVoYVVCSE9NbUJJSUUzaENlSER5N2VNaF9RdUNiRXZB?oc=5",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiqgFBVV95cUxQZndZYXpIejIzRkhHNmNRVzh1MVdZMkRBUWw3SjBkTXhxVUNhamZtR1pwc2hndnhQX3kwbFpBWUNXZEtsdjhUMThtOWtGR3QxcHBXNTlBWm5TdWRjZVZydVVPbXcyTzYzUFRkdzBIT21zV1JLUGxLdkF6bnlNVXhPa0dvWVRlS0JoeHFiUXYxczlFMF9RcEI2Sm5WS29HS1hYSUZORVJwVTVPQQ?oc=5"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMiuwFBVV95cUxPZ0dHUEhsVXdwSlFOQkpvNzl5Z19Eam9yN2tPMjZqSE41MXZjTmQxY0Y2WnZkLU1NdW92TmVXMXpLTHE5Uk8zLTFNbUg0NktWMHdBY1BRZXMtR3JaT2tKc25RT21oQ2lLUUZKSzZ2NU53b1JmSTduWXpRRWRjaERRYnpYQ3FyY1NvYlhhUjVrdE1ic3ZwUk50Q3dDVlVoYVVCSE9NbUJJSUUzaENlSER5N2VNaF9RdUNiRXZB?oc=5",
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.684,
      "consensus": 0.35,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.497,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs about the current state of Venezuela's oil exports and the impact of political turmoil, providing useful context for readers. However, it does not highlight any progress or solutions, nor does it empower the reader with actionable insights.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Venezuela's oil exports have been halted due to ongoing political turmoil, according to sources. Despite a recent US strike, Venezuela's oil facilities remain undamaged. The disruption in exports is attributed to internal instability rather than physical damage to infrastructure.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Caribbean flights canceled after US strikes on Venezuela",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Sat, 03 Jan 2026 14:57:24 GMT",
    "source": "Axios",
    "sources": [
      "Axios"
    ],
    "domains": [
      "news.google.com"
    ],
    "snippets": [
      "Caribbean flights canceled as Trump strikes Venezuela Axios",
      "Trump warns of more possible Venezuela strikes after Maduro capture Axios",
      "Trump faces quick criticism from Democrats over Maduro capture Axios",
      "Trump shares photo of Maduro after capture Axios"
    ],
    "image_url": "",
    "titles": [
      "Caribbean flights canceled as Trump strikes Venezuela - Axios",
      "Trump warns of more possible Venezuela strikes after Maduro capture - Axios",
      "Trump faces quick criticism from Democrats over Maduro capture - Axios",
      "Trump shares photo of Maduro after capture - Axios"
    ],
    "url": "https://news.google.com/rss/articles/CBMigAFBVV95cUxPNjFBdEhNQjhkdGcwajhlMk5weGNUelhqd3E4RGliTWVkRVhBNTVVRk9BOUJ1SE43QjNRYkljWndSaUhuTU14S0g2RnB1aWp0TlQ1X1NUY2VnSmhNdmhLVW5NT2JoYmp5dzlobHlkSXJqSk1GVUdxQnVSQVQ0RzdiUw?oc=5",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMicEFVX3lxTE1PNXRtZzB1ZDFlR1dseHdRVUJCbTBnOUNTd0tJY2Y4TUc5WHp2U19MUi01X3REcUVRSUdwR2pweVpTZk1XeElIcW5RMnBXZXJ5c1VTbGlqdkNvZTM5eUVqbUswWndPLVQ5dmU4ZURpbEM?oc=5",
      "https://news.google.com/rss/articles/CBMigAFBVV95cUxOcGhWRnM5RHhHeXBsd3I3U292RW9pT1ZHWkpteUs0MXUteXJwSXhJWlpWRGtubEZnREtPX0p6UWM1RDltc2Z4S0FEMXVGSG5GNUtDUnN0bGJreXZQU3VnZE43cjVoNnRhWC1wWjJQTm1BLTdxWF9LdTJhVk4wWlh0Sg?oc=5",
      "https://news.google.com/rss/articles/CBMia0FVX3lxTE5Ed0dHUzh6QzBWOGFfaExPYmIzaEY5bi1CNjRmMk5hcjV6Wkx2Snp0T0dfbnhhT2d2SWFTUVRKRnpZLXhnQ1hvYU5xZzRCR3dkQU5GN3kwZVJJc3BqWHZKNDRuY05KRlBsUEJJ?oc=5"
    ],
    "location_scope": "national",
    "link": "https://news.google.com/rss/articles/CBMigAFBVV95cUxPNjFBdEhNQjhkdGcwajhlMk5weGNUelhqd3E4RGliTWVkRVhBNTVVRk9BOUJ1SE43QjNRYkljWndSaUhuTU14S0g2RnB1aWp0TlQ1X1NUY2VnSmhNdmhLVW5NT2JoYmp5dzlobHlkSXJqSk1GVUdxQnVSQVQ0RzdiUw?oc=5",
    "score_components": {
      "magnitude": 0.413,
      "recency": 0.569,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.415,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Several Caribbean flights have been canceled following U.S. strikes on Venezuela. Donald Trump warned of possible further strikes after the capture of Maduro. Trump also shared a photo of Maduro after his capture. Democrats quickly criticized Trump’s actions regarding the operation.",
    "is_trending": false,
    "trending_score": 0.0
  }
]