[
  {
    "title": "Erin Patterson Gets Life for Murdering 3 Relatives with Poisonous Mushrooms",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Mon, 08 Sep 2025 01:14:43 -0400",
    "source": "NPR",
    "sources": [
      "Deutsche Welle",
      "New York Times",
      "NPR",
      "Al Jazeera",
      "The Guardian",
      "Washington Post"
    ],
    "domains": [
      "www.dw.com",
      "www.aljazeera.com",
      "www.washingtonpost.com",
      "www.npr.org",
      "www.nytimes.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "An Australian judge sentenced triple-murderer Erin Patterson to life in prison with a non-parole period of 33 years for poisoning four of her estranged husband's relatives with death cap mushrooms.",
      "Australian mother Erin Patterson has been sentenced to a minimum of 33 years in prison for murdering three of her former",
      "Judge says Patterson showed no remorse after serving her in-laws a meal of Beef Wellington laced with toxic mushrooms.",
      "The judge handed out a non-parole period of 33 years to Erin Patterson for poisoning four of her estranged husband's relatives with death cap mushrooms.",
      "Erin Patterson was convicted of killing three relatives with a lunch laced with death cap mushrooms. The judge called her actions “an enormous betrayal of trust.”",
      "Erin Patterson was found guilty of murdering three of her husband’s relatives and trying to kill a fourth by serving them deadly mushrooms.",
      "<p>Triple murderer sentenced in Victorian supreme court after killing relatives with a beef wellington lunch laced with death cap mushrooms</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/sep/08/australia-news-live-erin-patterson-mushroom-murders-trial-sentencing-blood-mo",
      "<p>Erin Patterson has been sentenced to life in prison with a non-parole period of 33 years after murdering three people and attempting to murder a fourth with a lunch laced with death cap mushrooms. Patterson, 50, was found guilty of murdering Don and Gail Patterson – the parents of her estranged h"
    ],
    "image_url": "",
    "titles": [
      "Australian woman is sentenced to life for poisoning relatives with mushrooms",
      "Australia mushroom murderer sentenced to life imprisonment",
      "Australia ‘mushroom murderer’ Erin Patterson sentenced to life in prison",
      "Australia: 'Mushroom murderer' sentenced to life in prison",
      "Australian woman gets life in prison for ‘mushroom murders’",
      "Australian Woman, Erin Patterson, Gets Life in Mushroom Murder Case",
      "Australia mushroom murderer Erin Patterson sentenced to life in prison with a non-parole period of 33 years",
      "Erin Patterson: Australia's mushroom murderer sentenced to life in prison – video"
    ],
    "score_components": {
      "magnitude": 0.986,
      "recency": 0.942,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.859,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Erin Patterson was sentenced to life in prison with a minimum non-parole period of 33 years by an Australian court for murdering three of her estranged husband's relatives and attempting to murder a fourth by serving them a meal containing death cap mushrooms. The judge noted Patterson showed no remorse for her actions, which were described as a significant betrayal of trust.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Alcaraz Wins Second US Open, Regains World No. 1 Ranking",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 07 Sep 2025 22:09:49 GMT",
    "source": "BBC",
    "sources": [
      "Deutsche Welle",
      "Al Jazeera",
      "Sky Sports",
      "Sportsnet",
      "BBC",
      "Forbes",
      "The Guardian",
      "ESPN",
      "Sports Illustrated"
    ],
    "domains": [
      "www.dw.com",
      "www.aljazeera.com",
      "www.sportsnet.ca",
      "www.forbes.com",
      "www.skysports.com",
      "news.google.com",
      "www.theguardian.com",
      "www.bbc.com",
      "www.espn.com"
    ],
    "snippets": [
      "Carlos Alcaraz triumphs in the latest chapter of his compelling rivalry with Jannik Sinner, earning a four-set victory to regain the US Open title.",
      "Alcaraz returns to number one spot after winning his sixth Grand Slam title and second of 2025 in four sets in New York.",
      "By beating Jannik Sinner in four sets, Carlos Alcaraz once again becomes the world's number one tennis player. The US Open final was delayed due to tightened security measures owing to the presence of Donald Trump.",
      "Carlos Alcaraz reasserted his superiority over Jannik Sinner with a 6-2, 3-6, 6-1, 6-4 win Sunday in the US Open final -- the third Grand Slam tournament in a row in which these rivals met to decide a champion -- for his second title at Flushing Meadows.",
      "<ul><li><p>Spaniard wins final 6-2, 3-6, 6-1, 6-4</p></li><li><p>Alcaraz new world No 1 after victory</p></li></ul><p>When Carlos Alcaraz is fully focused and his impossibly complete game is in full flow, nothing in the world can stop him. As he has spent the early years of his career collecting maj",
      "Carlos Alcaraz enjoyed the double of winning the U.S. Open and displacing Jannik Sinner as the world No. 1 on Sunday. Sinner had no answer to Alcaraz's box of tricks.",
      "<a href=\"https://news.google.com/rss/articles/CBMikAFBVV95cUxPU0lVeThuNXFSbHBFTkJxMmVBaWJiYUYxRDB0cWx5RHNBeXZaSUxwblFUc0s3MHJfWjI3VWlYTFdGbXFRZzZCVEhuZU9uYkNOQ3U0aDM4U2NwYUF2YW5PZktuNGpCYy1mVXY2RjE0MkVMem5EUGw5cTIzeGVXS2Y2eEdIZW1MSXJKaVdCSGFTSkw?oc=5\" target=\"_blank\">Carlos Alcaraz Wins Trilogy Matc",
      "Carlos Alcaraz dethroned Jannik Sinner in sensational fashion to seal his second US Open title and become new world No 1 after security delays frustrated fans.",
      "<p>Watch as Carlos Alcaraz serves an ace vs. Jannik Sinner to win his second US Open title in four sets and claim his sixth career Grand Slam victory.</p>"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/ae90/live/3d244610-8c38-11f0-b619-ffd5de982357.jpg",
    "titles": [
      "Alcaraz beats Sinner to win US Open and topple him as world number one",
      "Alcaraz beats Sinner to lift US Open 2025 trophy as Trump watches on",
      "Carlos Alcaraz beats Jannik Sinner to win second US Open title",
      "Alcaraz bests Sinner to win US Open, sixth Slam",
      "Carlos Alcaraz powers past Jannik Sinner in four sets to win US Open",
      "Alcaraz Trumps Sinner To Claim U.S. Open Title",
      "Carlos Alcaraz Wins Trilogy Match vs. Jannik Sinner at U.S. Open - Sports Illustrated",
      "Alcaraz dethrones Sinner to win second US Open and become world No 1",
      "Alcaraz wins US Open with perfect ace vs. Sinner"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.796,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.809,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Carlos Alcaraz defeated Jannik Sinner in four sets (6-2, 3-6, 6-1, 6-4) to win his second US Open title and his sixth Grand Slam. This victory in New York also returned Alcaraz to the world number one ranking. The final, which marked the third consecutive Grand Slam final between Alcaraz and Sinner, experienced delays due to heightened security measures.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Rodgers Leads Steelers to Win Over Jets with 4 TD Passes",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 8 Sep 2025 01:48:49 EST",
    "source": "ESPN",
    "sources": [
      "The Guardian",
      "CBS Sports",
      "ESPN",
      "Yahoo Sports"
    ],
    "domains": [
      "sports.yahoo.com",
      "www.theguardian.com",
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "Aaron Rodgers threw four touchdown passes Sunday to help the Steelers win their opener and show the Jets that he 'still can' play.",
      "Here's what we know after Pittsburgh's first game of the season",
      "The new Pittsburgh Steelers quarterback required a bit of luck to win on his debut but there were signs he can be an effective weapon for his team",
      "<p>The new Pittsburgh Steelers quarterback required a bit of luck to win on his debut but there were signs he can be an effective weapon for his team</p><p>As revenge games go, this one was pretty sweet. Aaron Rodgers led the Steelers to a 34-32 win over the Jets, his former team, and over a coachin"
    ],
    "image_url": "",
    "titles": [
      "Steelers' Rodgers shows Jets he still has it in win",
      "Steelers overreactions from Week 1 win: Aaron Rodgers still elite? Is the run defense still horrible?",
      "Aaron Rodgers’ Jets revenge tour shows the old guy may still have it",
      "Aaron Rodgers’ Jets revenge tour shows the old guy may still have it"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.953,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.805,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Aaron Rodgers led the Pittsburgh Steelers to victory in their season opener against the Jets, throwing four touchdown passes. This performance was particularly satisfying for Rodgers as it came against his former team, showcasing his ongoing prowess in the game. The win highlights Rodgers' capability and the Steelers' strong start to the season.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Israel's Supreme Court Orders Better Food for Palestinian Prisoners",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 08 Sep 2025 02:53:54 GMT",
    "source": "BBC",
    "sources": [
      "Deutsche Welle",
      "BBC",
      "The Guardian",
      "Al Jazeera"
    ],
    "domains": [
      "www.dw.com",
      "www.aljazeera.com",
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The court said the state is legally obligated to provide enough food to ensure \"a basic level of existence.\"",
      "Israel&#039;s highest court says Palestinian prisoners are being deliberately starved in harsh prison conditions.",
      "The High Court of Justice found that Palestinian prisoners were not receiving sufficient food and ordered that more be supplied. Meanwhile, Trump issues a \"last warning\" to Hamas to accept ceasefire deal. DW has more.",
      "<p>Justices rule state is legally obliged to ensure ‘basic level of existence’ and orders authorities to improve nutrition</p><p>Israel’s supreme court has ruled that the government has failed to provide Palestinian security prisoners with adequate food for basic subsistence and ordered authorities "
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/871c/live/9776dda0-8c4f-11f0-84c8-99de564f0440.jpg",
    "titles": [
      "Palestinian prisoners not being given adequate food, Israel top court says",
      "Israel depriving Palestinian prisoners of food, its Supreme Court rules",
      "Israel court demands more food for Palestinian prisoners",
      "Israel’s top court says government is not giving Palestinian prisoners enough food"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.878,
      "consensus": 0.908,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.782,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Israel's Supreme Court ruled that the government must provide Palestinian prisoners with adequate food to ensure a basic level of existence, finding current provisions insufficient. This decision mandates authorities to improve nutrition for these prisoners. Concurrently, Trump issued a \"last warning\" to Hamas to accept a ceasefire deal, although this aspect is separate from the court's ruling.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: improve",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "South Korea to Repatriate 300 Workers Detained in ICE Raid at Hyundai-LG in Geor",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sun, 07 Sep 2025 07:13:08 -0400",
    "source": "NPR",
    "sources": [
      "LA Times",
      "New York Times",
      "NPR",
      "The Guardian"
    ],
    "domains": [
      "www.nytimes.com",
      "www.npr.org",
      "www.theguardian.com",
      "www.latimes.com"
    ],
    "snippets": [
      "More than 300 South Korean workers were detained in an immigration raid on Thursday. Presidential chief of staff Kang Hoon-sik said South Korea plans to send a charter plane to bring the workers home.",
      "The South Korean government said on Sunday that it would send a charter plane to the United States to retrieve hundreds of workers detained in an immigration raid.",
      "<p>South Korea says it has a deal for release of those caught in Hyundai Georgia raid.</p>",
      "<p>Footage of raid by US immigration officials showed detained workers in handcuffs and with chains around their ankles</p><p>South Korea announced on Sunday that the roughly 300 of its nationals detained during an immigration raid in Georgia would be released and flown home, as the sudden detention"
    ],
    "image_url": "",
    "titles": [
      "South Korea says it has reached a deal with the US for the release of workers in a Georgia plant",
      "South Korea Negotiates Release of Korean Workers Detained in Georgia Raid",
      "South Korea, irked at U.S. raid at Hyundai plant, announces deal for detainees' release",
      "300 South Koreans detained at Hyundai plant in US to be released, says Seoul"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.647,
      "consensus": 0.908,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.761,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Over 300 South Korean workers were detained in the largest ICE raid of Trump's administration at a Hyundai-LG site in Georgia. South Korea announced plans to repatriate the workers, stating a charter plane will be sent to the U.S. once administrative procedures are completed. The South Korean government's action follows the significant immigration enforcement operation, highlighting its commitment to assisting its nationals abroad.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Lamar Jackson Regrets Shoving Fan After Helmet Slap Incident",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 8 Sep 2025 01:48:49 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.cbssports.com",
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "During Sunday night's 41-40 loss to the Buffalo Bills in the season opener, Baltimore Ravens quarterback Lamar Jackson shoved a fan who slapped Jackson on the helmet. \"I just let my emotions get the best of me,\" Jackson later told reporters.",
      "DeAndre Hopkins also got slapped on the helmet by the same fan just before Jackson did",
      "<p>Watch as a Bills fan hits DeAndre Hopkins and Lamar Jackson as they celebrate their touchdown, and the Ravens&#8217; QB responds with a shove of his own in the stands.</p>"
    ],
    "image_url": "",
    "titles": [
      "Jackson shoves fan in retaliation in Ravens' loss",
      "Lamar Jackson shoves Bills fan in retaliation for getting slapped on helmet following Ravens TD in Buffalo",
      "Bills fan, Ravens’ Jackson trade shoves after Hopkins TD"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.953,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.752,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "During the season opener against the Buffalo Bills, Baltimore Ravens quarterback Lamar Jackson and teammate DeAndre Hopkins were slapped on the helmet by a fan while celebrating a touchdown. Jackson responded by shoving the fan. Jackson later expressed regret, stating his emotions got the best of him.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Japan PM Ishiba Resigns After Election Loss, Aims to Unite Party",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sun, 07 Sep 2025 05:13:46 -0400",
    "source": "NPR",
    "sources": [
      "Deutsche Welle",
      "New York Times",
      "NPR",
      "CNBC"
    ],
    "domains": [
      "www.dw.com",
      "www.nytimes.com",
      "www.npr.org",
      "www.cnbc.com"
    ],
    "snippets": [
      "Japan's Prime Minister Shigeru Ishiba has expressed his intention on Sunday to step down following growing calls from his party to take responsibility for a historic defeat in July's parliamentary election.",
      "Shigeru Ishiba's ruling coalition suffered a historic setback in national elections in July.",
      "Japanese Prime Minister Shigeru Ishiba over the weekend announced he will resign.",
      "Ishiba had faced calls for his resignation after the ruling Liberal Democratic Party failed to secure a majority in the lower house election on Oct. 27.",
      "The embattled leader is trying to head off a deep split in his party over a right-wing political surge, a weakened economy and turbulent trade relations with the United States.",
      "Japan, one of the world’s most stable democracies, is experiencing unusually rapid change. Shigeru Ishiba’s departure could herald a leadership crisis."
    ],
    "image_url": "",
    "titles": [
      "Japan's Prime Minister Shigeru Ishiba to resign",
      "Japanese Prime Minister Ishiba announces resignation",
      "Japanese stocks jump as Prime Minister Ishiba set to step down",
      "Japan Prime Minister Ishiba Shigeru says he will step down after election setback",
      "Prime Minister Shigeru Ishiba of Japan Says He Will Step Down",
      "Japan’s Prime Minister, Shigeru Ishiba, Resigns: What to Know"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.621,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.745,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Japan's Prime Minister Shigeru Ishiba has announced his resignation due to pressure from his party after a significant defeat in the July parliamentary elections. His decision aims to prevent a split in the Liberal Democratic Party, following criticism over handling the economy, a right-wing political rise, and strained U.S. trade relations. Ishiba, who took office with promises of revitalizing Japan and addressing demographic challenges, faced further calls for resignation after failing to secure a majority in the October 27 lower house election.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Carlo Acutis Canonized as First Millennial Saint by Pope Leo XIV",
    "domain": "sports",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-09-07T15:09:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "New York Times",
      "The Guardian",
      "ABC News"
    ],
    "domains": [
      "www.dw.com",
      "www.nytimes.com",
      "www.theguardian.com",
      "abcnews.go.com"
    ],
    "snippets": [
      "'Cyber-apostle' Carlo Acutis, who died of leukaemia in 2006 aged just 15, was officially canonized at the Vatican on Sunday. Pope Leo said he was happy to see many young Catholics attending the ceremony.",
      "Pope Leo XIV has declared a 15-year-old computer whiz the Catholic Church's first millennial saint.",
      "<p>London-born Italian, who died in 2006, built websites to spread Catholic teaching and is credited with two miracles</p><p>A London-born Italian teenage computer whiz who died in 2006 age 15, has been declared the Catholic church’s first millennial saint during an open-air mass in a packed St Pete",
      "Carlo, who died at 15, was canonized alongside Pier Giorgio Frassati, who also died young. The church is looking to the two saints to inspire new generations of Catholics."
    ],
    "image_url": "",
    "titles": [
      "Vatican: 'God's influencer' declared first millennial saint",
      "WATCH:  Teen influencer becomes Catholic Church's 1st millennial saint",
      "Carlo Acutis, ‘God’s influencer’ who died age 15, declared a saint by Pope Leo",
      "Carlo Acutis, Known as ‘God’s Influencer,’ Is Declared a Saint by Pope Leo XIV"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.702,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.737,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Carlo Acutis, a London-born Italian teenager who died of leukemia in 2006 at age 15, was canonized by Pope Leo XIV at the Vatican, becoming the Catholic Church's first millennial saint. Known as \"God's influencer\" and a \"cyber-apostle,\" Acutis used his computer skills to document and spread Catholic teachings, particularly about miracles. His canonization, celebrated in an open-air mass attended by many young Catholics, highlights his role as a relatable figure for new generations, emphasizing his blend of typical teenage interests and devout faith. Acutis is credited with two miracles since h",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Thousands Rally Across Brazil Amid Bolsonaro Trial Countdown",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Mon, 08 Sep 2025 05:27:50 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Deutsche Welle",
      "New York Times",
      "Al Jazeera"
    ],
    "domains": [
      "www.dw.com",
      "www.aljazeera.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "Thousands march in support of and against Brazil&#039;s former president ahead of Supreme Court decision on coup attempt.",
      "Thousands gathered to show their support for Jair Bolsonaro in the cities of Sao Paulo, Rio de Janeiro, Porto Alegre and Brasilia. The former Brazilian president is accused of trying to overturn the 2022 election result.",
      "Tensions are heating up in Brazil as the nation enters the final week of former President Jair Bolsonaro’s trial on attempted coup charges."
    ],
    "image_url": "",
    "titles": [
      "Huge crowds rally for Brazil’s Bolsonaro ahead of verdict in coup trial",
      "Brazil: Bolsonaro backers rally ahead of coup trial verdict",
      "Brazilians Protest as Bolsonaro Coup Trial Nears Verdict"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.946,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.736,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Thousands rallied in Sao Paulo, Rio de Janeiro, Porto Alegre, and Brasilia, both supporting and opposing former Brazilian President Jair Bolsonaro, as his trial for attempting to overturn the 2022 election result approaches its final week.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "\"Blood Moon Eclipse Enchants Viewers from Australia to Europe\"",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Mon, 08 Sep 2025 06:30:57 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Phys.org",
      "The Guardian",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "phys.org",
      "www.theguardian.com"
    ],
    "snippets": [
      "A total lunar eclipse brought a &#039;blood moon&#039; over Asia, Europe, and Africa as stargazers marvelled at the sight.",
      "<p>Visible from Australia, across Asia, to western Europe, a blood moon has been captivating stargazers. This marvel is caused when the Earth shades the moon from direct solar light, causing the moon to appear red</p> <a href=\"https://www.theguardian.com/artanddesign/gallery/2025/sep/07/blood-moon-a",
      "Stargazers enjoyed a \"Blood Moon\" Sunday night during a total lunar eclipse visible across Asia and swaths of Europe and Africa."
    ],
    "image_url": "",
    "titles": [
      "‘Blood moon’ rises during total lunar eclipse",
      "Blood moon and lunar eclipse cast an ethereal light – in pictures",
      "'Blood Moon' rises during total lunar eclipse"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.967,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.73,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A total lunar eclipse resulted in a \"Blood Moon,\" captivating viewers across Asia, Europe, and Africa. This phenomenon occurs when Earth blocks direct sunlight from reaching the moon, making it appear red. The event was visible from Australia to western Europe, attracting attention from stargazers worldwide.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Bills Overcome 15-Point Deficit to Beat Ravens 41-40 in Season Opener",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 08 Sep 2025 05:36:38 GMT",
    "source": "BBC",
    "sources": [
      "Sky Sports",
      "BBC",
      "Sports Illustrated"
    ],
    "domains": [
      "news.google.com",
      "www.bbc.com",
      "www.skysports.com"
    ],
    "snippets": [
      "Josh Allen leads Buffalo Bills to an epic comeback over Lamar Jackson's Baltimore Ravens, while Aaron Rodgers and Micah Parsons enjoy winning debuts in week one of the NFL season.",
      "<a href=\"https://news.google.com/rss/articles/CBMimwFBVV95cUxNdkZmc1AzNVpxZDREMU91YnRMbVhFVFBmdWxzOGE5aGZpUTYxRDRxeU9vbmxST05QbzdUZDlwRk1McnMtdTNYQTdZLUNkOGtjNVVsNjYxemtibS1lRXVCSlpyTVhsYTY2VkMxQW01MEtUN19MZTlZVGUtb2NKMXE5dXI0MU0tSGttdm9NY2JEVHFPRzJMOS1iSzhmOA?oc=5\" target=\"_blank\">Josh Allen Calls ",
      "The Buffalo Bills rallied from 15 points down to stun the Baltimore Ravens 41-40 in a season-opening Sunday night thriller."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/d7f2/live/328f8060-8c6b-11f0-abf2-59737b062552.jpg",
    "titles": [
      "Allen shines as Bills stun Ravens in wild comeback",
      "Josh Allen Calls Out Bills Fans Who Left Early During Comeback vs. Ravens - Sports Illustrated",
      "Bills rally to stun Ravens in thriller"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.929,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.723,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Josh Allen led the Buffalo Bills to a dramatic 41-40 victory over the Baltimore Ravens, coming back from a 15-point deficit in a season-opening game. Meanwhile, Aaron Rodgers and Micah Parsons both enjoyed wins in their first week of the NFL season.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Lady Gaga Tops 2025 MTV VMAs Nominations; Mariah Carey Honored",
    "domain": "general",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Sun, 07 Sep 2025 23:40:40 -0400",
    "source": "ABC News",
    "sources": [
      "The Guardian",
      "Forbes",
      "ABC News"
    ],
    "domains": [
      "www.theguardian.com",
      "abcnews.go.com",
      "www.forbes.com"
    ],
    "snippets": [
      "Lady Gaga was the most nominated artist heading into the 2025 MTV VMAs.",
      "<p>Singers took home two trophies each as Mariah Carey won a lifetime achievement award, in a night that largely celebrated female artists</p><ul><li><p><a href=\"https://www.theguardian.com/music/gallery/2025/sep/08/mtv-vmas-2025-red-carpet-sabrina-carpenter-ariana-grande-katseye-and-more-in-picture",
      "The MTV VMAs are airing live on CBS, MTV and Paramount+. Follow along for the full list of winners announced throughout the night, including Video of the Year and Artist of the Year."
    ],
    "image_url": "https://s.abcnews.com/images/US/sabrina-carpenter-awards-gty-jt-250907_1757300766181_hpMain_4x3t_384.jpg",
    "titles": [
      "MTV VMAs 2025: See the full winners list",
      "MTV VMAs 2025 winners: Lady Gaga, Ariana Grande and Sabrina Carpenter triumph at muted award ceremony",
      "MTV VMAs 2025 Full Winners List (Live Updates)"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.912,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.719,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "At the 2025 MTV VMAs, Lady Gaga led with the most nominations. The event highlighted female artists, with singers each taking home two awards. Mariah Carey received a lifetime achievement award. The VMAs were broadcast live across CBS, MTV, and Paramount+, with key winners including Video of the Year and Artist of the Year announced during the show.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Hundreds Detained in US Raid on Hyundai, 300 South Koreans to be Repatriated",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 07 Sep 2025 23:14:55 GMT",
    "source": "BBC",
    "sources": [
      "Business Insider",
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "www.businessinsider.com",
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Some 400 US agents took part in the immigration raid on the Hyundai facility, detaining hundreds of workers, many South Korean nationals.",
      "<p>South Korea has said that 300 of its nationals detained during the immigration raid would be flown home. Key US politics stories from Sunday 7 September at a glance</p><p>Donald Trump has told foreign companies that they must hire and train American workers and respect immigration laws, after a r",
      "\"What we ask in return is that you hire and train American Workers,\" Trump wrote on Truth Social."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/0960/live/23864c30-8c33-11f0-b391-6936825093bd.jpg",
    "titles": [
      "South Korean worker tells BBC of panic during US immigration raid at Hyundai plant",
      "Trump news at a glance: President tells foreign companies to ‘respect’ immigration law after Hyundai Ice raid",
      "Trump, post-Hyundai ICE raid, says all foreign companies need to 'please respect our nation's immigration laws'"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.814,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.707,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "During a large immigration raid on a Hyundai facility by 400 US agents, hundreds of workers were detained, including many South Korean nationals. South Korea announced that 300 of its detained nationals would be repatriated. This incident follows a statement by Donald Trump emphasizing the need for foreign companies in the US to hire and train American workers and adhere to immigration laws.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Attends US Open Final, Elicits Mixed Crowd Reactions",
    "domain": "sports",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Sun, 07 Sep 2025 18:54:32 GMT",
    "source": "The Guardian",
    "sources": [
      "CityNews",
      "The Guardian",
      "Global News"
    ],
    "domains": [
      "www.theguardian.com",
      "ottawa.citynews.ca",
      "globalnews.ca"
    ],
    "snippets": [
      "<ul><li><p>US president attends <a href=\"https://www.theguardian.com/sport/live/2025/sep/07/us-open-tennis-2025-jannik-sinner-v-carlos-alcaraz-mens-singles-final-live\">Sinner v Alcaraz final</a></p></li><li><p>USTA told broadcasters not to show crowd reaction</p></li></ul><p>Donald Trump was booed a",
      "President Donald Trump was greeted with a mixture of cheers and boos when he arrived for the start of the U.S. Open men's tennis final match in New York on Sunday.",
      "NEW YORK (AP) — President Donald Trump was loudly booed at the men&#8217;s final of the U.S. Open on Sunday, where extra security caused by his visit led to lines long enough that many people missed the start of play, even after organizers delayed it. Wearing a suit and long, red tie, Trump briefly "
    ],
    "image_url": "https://i.guim.co.uk/img/media/6648a7823188d75c990e3b3decf988630db12149/30_0_5902_4723/master/5902.jpg?width=140&quality=85&auto=format&fit=max&s=5ab941e6241bc072a7e1d6832bb8af73",
    "titles": [
      "Crowd greets Donald Trump with boos and cheers at US Open men’s final",
      "Trump arrives at US Open to cheers and boos, prompts security delay",
      "Trump’s US Open visit sparks boos and long security lines"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.744,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.693,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "President Donald Trump attended the U.S. Open men's final between Sinner and Alcaraz in New York, where he received mixed reactions from the crowd, including cheers and boos. The USTA requested broadcasters to avoid showing crowd reactions to Trump's presence.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Hamlin Wins at World Wide Technology Raceway, Advances to Round of 12",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 8 Sep 2025 00:30:54 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "Denny Hamlin won from the pole position at World Wide Technology Raceway, playing the strategy perfectly to lead the final 25 laps in his series-high fifth victory this season.",
      "Hamlin now advances to the Round of 12 as he pursues his elusive first Cup championship"
    ],
    "image_url": "",
    "titles": [
      "Denny Hamlin wins at Gateway to advance in playoffs",
      "NASCAR playoffs at St. Louis results: Denny Hamlin gets fifth win of 2025, Toyota's 200th victory at Gateway"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.928,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.666,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Denny Hamlin won at World Wide Technology Raceway from the pole position, leading the last 25 laps for his fifth victory this season. This win advances him to the Round of 12 in his quest for his first Cup championship.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Volkswagen Aims to Boost EV Adoption in Europe with Affordable Pricing Strategy",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Mon, 08 Sep 2025 07:34:25 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "The Verge"
    ],
    "domains": [
      "www.cnbc.com",
      "www.theverge.com"
    ],
    "snippets": [
      "The chief executive of Volkswagen says the German auto giant is pushing to strengthen its European market dominance.",
      "Everyone basically agrees: if you want people to transition from polluting gas guzzlers to electric cars, you have to make them more affordable. The luxury EVs, with their big battery packs and fine leather interiors, are all well and good, but if you really want to move the needle on EV adoption, w"
    ],
    "image_url": "",
    "titles": [
      "Volkswagen targets dominance in Europe with affordable EV push",
      "Volkswagen rounds out new lineup of affordable EVs with ID. Cross concept"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.968,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.666,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The CEO of Volkswagen has announced the company's plan to reinforce its dominance in the European market by making electric vehicles (EVs) more affordable. This strategy aims to boost EV adoption by addressing the cost barrier that has hindered consumers from transitioning from traditional gasoline vehicles to electric ones.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Uber to Test Driverless Cars in Germany Next Year with Momenta",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-09-08T02:00:00-04:00",
    "source": "The Verge",
    "sources": [
      "TechCrunch",
      "The Verge"
    ],
    "domains": [
      "techcrunch.com",
      "www.theverge.com"
    ],
    "snippets": [
      "Uber and one of its many robotaxi partners, Momenta, will test fully driverless cars in Germany next year. The news comes as Europe continues to lag behind the US and China in the number of commercially operational robotaxi services. The companies say they will test Level 4 autonomous vehicles in Mu",
      "Momenta is one of 20 global AV partners that Uber has scooped up across its ridehail, delivery, and freight businesses. Uber says those partnerships have already generated an annualized rate of 1.5 million mobility and delivery."
    ],
    "image_url": "",
    "titles": [
      "Uber and Momenta will test fully driverless cars in Germany",
      "Uber and Momenta to test autonomous vehicles in Germany in 2026"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.957,
      "consensus": 0.591,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.666,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Uber, in partnership with Momenta, plans to test fully driverless, Level 4 autonomous vehicles in Germany next year, marking a step towards catching up with the US and China in commercial robotaxi services. This initiative is part of Uber's broader strategy, involving 20 global AV partners, aimed at enhancing its ride-hail, delivery, and freight services, which have already achieved an annualized rate of 1.5 million mobility and delivery operations.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: initiative, plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "European Stocks Open Week with Gains",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Mon, 08 Sep 2025 07:33:32 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Financial Times"
    ],
    "domains": [
      "www.ft.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "European stocks have started the new trading week on a positive note.",
      "Bayrou’s exit would leave President Macron searching for his fifth prime minister in two years"
    ],
    "image_url": "",
    "titles": [
      "European markets open higher as focus turns on French confidence vote",
      "French PM on the brink in crucial confidence vote"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.968,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.656,
    "summary_source": "snippet",
    "summary_reason": "retry_exhausted",
    "summary": "European stocks have started the new trading week on a positive note.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "President's Late Arrival Delays Sports Event; Alcaraz, Sinner Dominate Titles",
    "domain": "sports",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sun, 07 Sep 2025 20:37:01 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "ESPN"
    ],
    "domains": [
      "www.npr.org",
      "www.espn.com"
    ],
    "snippets": [
      "The president's arrival delayed the match and left many ticketholders waiting in line. He watched from Rolex's luxury box.",
      "With the past eight major titles, Alcaraz and Sinner are clearly dominant. Can anyone compete with them?"
    ],
    "image_url": "",
    "titles": [
      "Carlos Alcaraz wins his 2nd U.S. Open at match delayed by Trump's attendance",
      "As Carlos Alcaraz wins another US Open title, can anyone challenge these Big Two?"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.855,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.651,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The president's late arrival at a sports event caused delays, leaving ticket holders waiting outside. He watched the game from a Rolex luxury box. Meanwhile, Alcaraz and Sinner have dominated the last eight major titles in their sport, showcasing their clear dominance in the field.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Former Chancellor to Assume Part-Time Role at Robey Warshaw Post-Deal",
    "domain": "business",
    "source_domain": "www.ft.com",
    "location": "global",
    "published": "Mon, 08 Sep 2025 04:00:14 GMT",
    "source": "Financial Times",
    "sources": [
      "The Guardian",
      "Financial Times"
    ],
    "domains": [
      "www.theguardian.com",
      "www.ft.com"
    ],
    "snippets": [
      "Former chancellor is expected to step back to part-time role some time after deal for London investment bank closes",
      "<p>Former chancellor is now partner at Robey Warshaw but is expected to move to part-time role, report says</p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/sep/08/chinese-export-growth-slowest-six-months-shipments-us-fall-amid-tariff-tensions-oil-prices-climb-business-live\">Bus"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Fc447d75c-5d96-4f3c-9d9e-1ded7fcd0ac9.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "George Osborne to miss out on Robey Warshaw windfall after Evercore sale",
      "George Osborne ‘to miss out on big windfall’ from sale of investment bank"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.899,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.645,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A former chancellor, currently a partner at Robey Warshaw, is anticipated to transition to a part-time role at the London investment bank following the closure of a deal. This development was reported without specifying the timing of the change.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Megan Moroney Wins First VMAs Best Country Award in NYC",
    "domain": "business",
    "source_domain": "www.forbes.com",
    "location": "global",
    "published": "Sun, 07 Sep 2025 20:56:15 -0400",
    "source": "Forbes",
    "sources": [
      "Business Insider",
      "Forbes"
    ],
    "domains": [
      "www.businessinsider.com",
      "www.forbes.com"
    ],
    "snippets": [
      "Megan Moroney won the first VMAs Best Country award, topping a category that included Jelly Roll, Morgan Wallen, Lainey Wilson and more.",
      "The MTV Video Music Awards were held in New York City on Sunday night. Stars like Sabrina Carpenter and Ice Spice turned heads on the red carpet."
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/68be289511968f83751ce3c9/0x0.jpg?width=960",
    "titles": [
      "MTV VMAs 2025: Megan Moroney Wins New ‘Best Country’ Award",
      "The best and worst looks at the 2025 MTV VMAs"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.861,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.627,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Megan Moroney won the inaugural VMAs Best Country award, outperforming nominees like Jelly Roll and Morgan Wallen. The MTV Video Music Awards took place in New York City, with celebrities such as Sabrina Carpenter and Ice Spice making notable appearances on the red carpet.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Bessent Dismisses Tariff Concerns, Predicts US Economic Boost",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Sun, 07 Sep 2025 22:18:02 GMT",
    "source": "CNBC",
    "sources": [
      "The Guardian",
      "CNBC"
    ],
    "domains": [
      "www.theguardian.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "Bessent has warned that a delayed ruling \"could result in a scenario in which $750 billion-$1 trillion in tariffs have already been collected.\"",
      "<p>Billionaire Scott Bessent dismisses concerns about president’s levies and predicts ‘acceleration’ in US economy </p><p>US treasury secretary Scott Bessent has refused to acknowledge that the sweeping trade tariffs imposed by Donald Trump around the world are taxes on Americans.</p><p>In a new int"
    ],
    "image_url": "",
    "titles": [
      "Treasury Secretary Bessent warns of massive refunds if the Supreme Court voids Trump tariffs",
      "US treasury secretary denies Trump tariffs are tax on Americans"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.798,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.622,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Billionaire and US Treasury Secretary Scott Bessent has dismissed concerns over President Donald Trump's global trade tariffs, refusing to see them as taxes on Americans. He predicts an 'acceleration' in the US economy despite warnings that a delayed ruling could lead to $750 billion-$1 trillion in tariffs being collected.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Visible Time Crystal Created; CRISPR Efficiency Tripled",
    "domain": "science",
    "source_domain": "www.sciencedaily.com",
    "location": "global",
    "published": "Sun, 07 Sep 2025 17:09:24 EDT",
    "source": "ScienceDaily",
    "sources": [
      "ScienceDaily"
    ],
    "domains": [
      "www.sciencedaily.com"
    ],
    "snippets": [
      "Physicists at the University of Colorado Boulder have created the first time crystal that humans can actually see, using liquid crystals that swirl into never-ending patterns when illuminated by light. This breakthrough builds on Nobel laureate Frank Wilczek’s 2012 theory of time crystals—structures",
      "Northwestern scientists have developed a new nanostructure that supercharges CRISPR’s ability to safely and efficiently enter cells, potentially unlocking its full power to treat genetic diseases. By wrapping CRISPR’s tools in spherical DNA-coated nanoparticles, researchers tripled gene-editing succ"
    ],
    "image_url": "",
    "titles": [
      "Scientists just made the first time crystal you can see",
      "Scientists just made CRISPR three times more effective"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.796,
      "consensus": 0.35,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.437,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Physicists at the University of Colorado Boulder have developed the first visible time crystal, which forms endless patterns in liquid crystals under light, advancing Frank Wilczek's 2012 theory. Concurrently, Northwestern scientists have enhanced CRISPR's efficiency and safety in gene editing by encapsulating its components in DNA-coated nanoparticles, tripling its success rate. These innovations mark significant advancements in physics and genetic engineering.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: innovation",
    "constructiveness_source": "heuristic"
  }
]