[
  {
    "title": "Ghislaine Maxwell's Supreme Court Appeal Declined, Transferred to Texas Camp",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 06 Oct 2025 19:11:11 GMT",
    "source": "BBC",
    "sources": [
      "CNBC",
      "Al Jazeera",
      "ABC News",
      "BBC",
      "Forbes",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "www.aljazeera.com",
      "abcnews.go.com",
      "www.cnbc.com",
      "www.forbes.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The British socialite is serving a 20-year prison sentence on sex-trafficking charges related to former boyfriend Jeffrey Epstein.",
      "Former girlfriend of convicted sex abuser Jeffrey Epstein is serving a 20-year prison sentence for sex trafficking.",
      "<a href=\"https://news.google.com/rss/articles/CBMifEFVX3lxTE10cURkM1huYWlic0RVWWJVQ0F1ZUprbUYzdkE3Y0VhTUZSR04yV2s4Y0hoWHlvMU9aWkRabVdpTzNxc1h0N05SUGphQUxEUEh2azBRRUFhb2xrYmY5SHBUYkFoUzYxTmthQjhyTV9nejE5OUNBZ0JsZzhNSUQ?oc=5\" target=\"_blank\">Supreme Court rejects Epstein associate Ghislaine Maxwell's ",
      "The Supreme Court has declined to take up the appeal of Maxwell, who was contesting her prosecution and conviction on grounds that the government had violated an agreement made with Jeffrey Epstein before his death.",
      "Ghislaine Maxwell, the convicted procurer of Jeffrey Epstein, may now focus efforts to get a pardon or sentence commutation from President Donald Trump.",
      "Maxwell, a longtime associate of Jeffrey Epstein, is serving a 20-year prison sentence for sex trafficking."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/fd26/live/1f0875e0-a2d4-11f0-92db-77261a15b9d2.jpg",
    "titles": [
      "US Supreme Court rejects Ghislaine Maxwell appeal in Epstein case",
      "US Supreme Court declines to hear Ghislaine Maxwell appeal",
      "Supreme Court rejects Epstein associate Ghislaine Maxwell's appeal - Axios",
      "WATCH:  Supreme Court denies Ghislaine Maxwell appeal",
      "Supreme Court rejects appeal of Ghislaine Maxwell for Epstein abetting conviction",
      "Trump Says He’ll ‘Take A Look’ At Maxwell Case When Asked About Pardon After Supreme Court Rejects Her Appeal"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.811,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.812,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Ghislaine Maxwell, associated with Jeffrey Epstein, is serving a 20-year sentence for sex trafficking and related crimes as of 2022. Her appeal to the US Supreme Court was declined. Maxwell attempted to argue her indictment was invalid due to Epstein's 2007 non-prosecution agreement. Recently, she was transferred from a low-security prison in Florida to a minimum-security camp in Texas.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Suggests Insurrection Act to Deploy National Guard Amid Opposition",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Mon, 06 Oct 2025 17:15:56 +0000",
    "source": "Al Jazeera",
    "sources": [
      "The Guardian",
      "Financial Times",
      "ABC News",
      "Al Jazeera",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "www.aljazeera.com",
      "abcnews.go.com",
      "www.ft.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "US president&#039;s comments came as Portland, Chicago continue to fight the deployment of the national guard in the courts.",
      "<a href=\"https://news.google.com/rss/articles/CBMikgFBVV95cUxPaTloMElYeEl6RXlMdEtxOGNKMVJzNWdqczg1bWdTcFpaZFZNTmZEeEV3Y3JEYkd5VTF0Wm5yZUNHR3Q2bDRiY2lFdU1Cbl9IZWd5OGxUQTRtaGtOZTZ3RXFNN3NxdEkwRm95THVyNHBVQkFxVUFESzFOdU44VE02R3BiOWpxdTBDLUxuZGU3QWNXUQ?oc=5\" target=\"_blank\">Trump floats Insurrection Act",
      "<a href=\"https://news.google.com/rss/articles/CBMigwFBVV95cUxPWkI3UmdwUUFlb1F6Nlo4dWJZT09WeWpibEtiNXF1OS1DRVBkNUwyWGFIcTFicUxST3c5WEU3cHVDaGJDbTlpcmFhdEpzUEdyZjd1MEtJY2RWWld2amcwVDZKSTk0MW9EWkJGT0tfWGlWeFNySWhlR0JMb1Vxck9ZQ3F5Yw?oc=5\" target=\"_blank\">MAGA calls for Trump to overrule judges on Nation",
      "<p>The president threatened the use of emergency powers after a federal judge temporarily halted national guard deployment in Portland. Key US politics stories from 6 October at a glance</p><p>Donald Trump threatened to use emergency powers to deploy more troops into Democrat-led cities, as his atte",
      "Illinois Gov. JB Pritzker on Monday accused the Trump administration of staging a \"military-style invasion\" of Chicago.",
      "Warning to use 19th century law comes as president faces legal setbacks in bid to put soldiers on streets of US cities"
    ],
    "image_url": "",
    "titles": [
      "Trump threatens use of Insurrection Act to deploy troops to cities",
      "Trump floats Insurrection Act use amid National Guard standoff with states - Axios",
      "MAGA calls for Trump to overrule judges on National Guard deployments - Axios",
      "Trump news at a glance: President mulls use of insurrection act as national guard deployment faces legal issues",
      "Trump threatens use of Insurrection Act as governor says Black Hawks used in ICE raid",
      "Donald Trump threatens to invoke 200-year-old Insurrection Act to deploy troops"
    ],
    "score_components": {
      "magnitude": 0.964,
      "recency": 0.795,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.795,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "President Trump suggested using the Insurrection Act to deploy the National Guard in cities like Portland and Chicago, despite legal challenges and opposition from local leaders. This follows a federal judge's temporary block on the deployment in Portland. Illinois Governor JB Pritzker criticized the move as a \"military-style invasion\" of Chicago. The situation highlights Trump's intent to override local authorities amid legal setbacks.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "US Government Shutdown Enters Second Week; Negotiations Ongoing",
    "domain": "business",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-10-07T02:09:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "The Guardian",
      "Forbes",
      "ABC News",
      "Deutsche Welle"
    ],
    "domains": [
      "www.forbes.com",
      "www.theguardian.com",
      "abcnews.go.com",
      "www.dw.com"
    ],
    "snippets": [
      "Democrats and Republicans traded blame for the ongoing shutdown as the Senate rejected two proposals to fund the federal government.",
      "The Senate on Monday again rejected Democratic and Republican proposals to fund the government and end the shutdown, now in its sixth day.",
      "<p>Competing bills fail to pass 60-vote threshold, while Trump hints at possible deal with Democrats over health subsidies </p><p>The US government shutdown entered its second week as the Senate again rejected rival bills to restart funding and Donald Trump suggested he might be open to negotiating ",
      "The government shut down began at midnight on Wednesday as Democrats and Republicans appeared to be nowhere close to reaching a funding deal."
    ],
    "image_url": "",
    "titles": [
      "US in shutdown impasse as Senate again rejects funding bill",
      "Government shutdown updates: Senate again fails to pass funding bills",
      "US shutdown enters second week as Senate again rejects rival funding bills",
      "Government Shutdown: Deadlocked Senate Again Fails To Pass Funding Bills As Shutdown Hits Week 2"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.957,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.788,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The US government shutdown extended into its second week after the Senate failed to pass both Democratic and Republican funding bills. Negotiations continue as President Trump hints at a possible compromise involving health subsidies.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Raises Tariff on Brazil to 40%; Discusses Cooperation with Lula",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Mon, 06 Oct 2025 17:41:00 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Deutsche Welle",
      "Fortune",
      "The Guardian"
    ],
    "domains": [
      "fortune.com",
      "www.theguardian.com",
      "www.dw.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Trump had imposed a 40% tariff on Brazil in July on top of a 10% earlier even though US has a trade surplus with Brazil.",
      "Brazil's leader held a \"positive\" call with US President Donald Trump, and discussed punitive measures imposed by the US president who has claimed a criminal case against Brazil's ex-president Jair Bolsonaro was biased.",
      "<p>Presidents spoke on a video call as expert speculates that Haiti could be an area where the two leaders can cooperate</p><p>Brazil’s president, Luiz Inácio Lula da Silva, has urged Donald Trump to scrap tariffs on his country’s imports and sanctions against its officials, as the two men held what",
      "Later, Trump posted on Truth Social that he had had a good conversation with Lula. “We discussed many things, but it was mostly focused on the Economy.”"
    ],
    "image_url": "",
    "titles": [
      "Lula asks Trump to lift 40 percent tariff from Brazilian goods",
      "Brazil's Lula asks Trump to lift tariffs in video call",
      "Brazil’s president asks US to scrap tariffs in ‘friendly’ call with Trump",
      "Trump, Lula talk for 30 minutes, exchange numbers and Brazilian boss asks again for lifting of 40% tariff"
    ],
    "score_components": {
      "magnitude": 0.952,
      "recency": 0.802,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.771,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "In July, President Trump imposed a 40% tariff on Brazil, adding to a previous 10% tariff despite the US having a trade surplus with Brazil. Following a \"positive\" video call between Brazil's President Luiz Inácio Lula da Silva and Trump, discussions were held on the punitive measures, including tariffs and sanctions against Brazilian officials. The call also touched on cooperation opportunities, such as in Haiti. Lula urged Trump to reconsider the tariffs and sanctions.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Israel-Hamas Talks in Egypt Show Progress, Set to Continue",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 07 Oct 2025 02:07:21 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Al Jazeera",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "www.bbc.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "The talks in Egypt are expected to be among the most consequential since the start of the war two years ago.",
      "Sources familiar with the talks with Israel and Hamas say that progress was made on Monday, negotiations to continue.",
      "<a href=\"https://news.google.com/rss/articles/CBMidkFVX3lxTFAwS0N3djJhQVdKMGgzc2FYSUxMakxndzIxc3dGM1ZRdE5oTWp5cngtcUxqWmYtZkhBRkFiMzh2Mjg4WGMtYTRPd0FQNU9pQUJka1pSS0ZBNVpUX3ZNU3F0aVQ4S1RVY2lfd09kNjJJQV9EVy1rZnc?oc=5\" target=\"_blank\">Amid talks in Egypt, Trump says there's \"a really good chance\" for a"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/9e99/live/02c2b3f0-a324-11f0-92db-77261a15b9d2.jpg",
    "titles": [
      "Trump says chance of Gaza peace deal 'really good' as talks to continue in Egypt",
      "Day one of Gaza peace talks ends on ‘positive’ note in Egypt",
      "Amid talks in Egypt, Trump says there's \"a really good chance\" for a Gaza deal - Axios"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.937,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.731,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Talks in Egypt, deemed crucial since the war began two years ago, have shown progress between Israel and Hamas, with negotiations set to continue. These discussions are highlighted as some of the most significant in recent times, aiming to address and potentially resolve ongoing conflict issues.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "ICC Convicts Janjaweed Leader of War Crimes in Darfur",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Mon, 06 Oct 2025 15:05:55 -0400",
    "source": "NPR",
    "sources": [
      "The Guardian",
      "NPR",
      "Deutsche Welle"
    ],
    "domains": [
      "www.npr.org",
      "www.theguardian.com",
      "www.dw.com"
    ],
    "snippets": [
      "The International Criminal Court in The Hague handed down its first-ever Darfur war crimes conviction, finding Janjaweed leader Ali Kushayb, guilty of atrocities committed more than two decades ago.",
      "For the first time, the ICC has found a militia leader guilty of war crimes committed in Sudan's Darfur region more than 20 years ago.",
      "<p>Janjaweed commander Ali Muhammad Ali Abd-al-Rahman, known as Ali Kushayb, found guilty over atrocities</p><p>The international criminal court has convicted a leader of the Janjaweed militia of playing a leading role in a campaign of atrocities committed in the Sudanese region of Darfur more than "
    ],
    "image_url": "",
    "titles": [
      "ICC finds former Sudan militia leader guilty of war crimes in Darfur",
      "Darfur militia leader convicted by ICC for war crimes",
      "ICC convicts former Sudan militia leader for war crimes in Darfur"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.826,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.727,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The International Criminal Court (ICC) has convicted Janjaweed militia leader Ali Muhammad Ali Abd-Al-Rahman, known as Ali Kushayb, of war crimes in Sudan's Darfur region, marking the court's first conviction for crimes in this area. Abd-Al-Rahman was found guilty on 27 counts of war crimes committed over 20 years ago.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "U.S. Deports 10 More to Eswatini Amid Human Rights Concerns",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Mon, 06 Oct 2025 22:31:05 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Axios",
      "The Guardian"
    ],
    "domains": [
      "news.google.com",
      "www.theguardian.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Trump administration continues to send individuals to countries where they have no ties amid mass deportation push.",
      "<a href=\"https://news.google.com/rss/articles/CBMiZ0FVX3lxTE51Y3ozUTlFV25zWEtiNmlNbDMyS05wdk1QZHJ5ZUp2NTJyOGc3TWJ2ZE5IT1RGYWxPeW5CbklNU3dJaFhJT1JnYVZ1NHVueVVPbk9BZ1VtUzNfOWgwZ1ZadTh5RDBudVU?oc=5\" target=\"_blank\">10 more migrants sent to Eswatini as part of U.S.' third-country deportation agreement</",
      "<p>African kingdom receives second group of third-country nationals in what NGOs and lawyers say is violation of human rights</p><p>Ten people deported by the US have arrived in Eswatini, its government said, the second group of third-country deportees to be sent to the southern African kingdom by t"
    ],
    "image_url": "",
    "titles": [
      "US sends another ‘third-country’ deportation flight to Eswatini",
      "10 more migrants sent to Eswatini as part of U.S.' third-country deportation agreement - Axios",
      "Eswatini confirms arrival of 10 more people as part of US deportation deal"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.887,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.714,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The U.S. has deported ten more individuals to Eswatini as part of its third-country deportation policy, despite criticisms from NGOs and lawyers who argue this violates human rights. This marks the second instance of deportees with no ties to the African kingdom being sent there, following an agreement between the U.S. and Eswatini.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "France's PM Lecornu Resigns After Less Than 24 Hours Amid Political Crisis",
    "domain": "business",
    "source_domain": "www.ft.com",
    "location": "global",
    "published": "Mon, 06 Oct 2025 19:57:14 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times",
      "New York Times",
      "Washington Post"
    ],
    "domains": [
      "www.nytimes.com",
      "www.washingtonpost.com",
      "www.ft.com"
    ],
    "snippets": [
      "Sébastien Lecornu, who quit on Monday, is asked by Emmanuel Macron to quickly negotiate a stability plan",
      "Sébastien Lecornu, a former defense minister, was in the job less than a month. He was appointed after a no-confidence vote toppled his predecessor.",
      "Sébastien Lecornu’s departure ratcheted up pressure on President Emmanuel Macron to call snap parliamentary elections."
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Fa8203189-4539-47a3-b3ee-407e11ff91b2.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "France in fresh political and market turmoil after prime minister resigns",
      "Prime minister of France resigns hours after naming new government",
      "French Prime Minister Sébastien Lecornu Resigns"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.824,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.712,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Sébastien Lecornu, France's newly appointed Prime Minister, resigned less than 24 hours after forming his government and less than a month in office, citing deep political divisions and criticism from various factions, including threats from rightwing allies to withdraw support. His resignation, accepted by President Emmanuel Macron, follows criticism over the largely unchanged cabinet lineup and plunges the country into a political crisis. Lecornu, a former defense minister, had assumed the role after a no-confidence vote ousted his predecessor.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Harry Kane Open to New Contract Talks with Bayern, Less Keen on Premier League R",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 06 Oct 2025 22:00:58 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Sky Sports",
      "The Guardian"
    ],
    "domains": [
      "www.skysports.com",
      "www.bbc.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Harry Kane says his interest in returning to the Premier League has cooled and he is willing to open talks with Bayern Munich over a new contract.",
      "<ul><li><p>Kane’s current deal at German club expires in 2027</p></li><li><p>‘In terms of staying longer I could definitely see that’</p></li></ul><p>Harry Kane says he is open to extending his stay at Bayern Munich and believes a return to the Premier League is no longer guaranteed.</p><p>The Engla",
      "Harry Kane has revealed that his desire to play in the Premier League again has cooled, as he suggested he is open to extending his Bayern Munich stay."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/8504/live/d1758290-a2f2-11f0-b741-177e3e2c2fc7.jpg",
    "titles": [
      "'I'm fully all in with Bayern' - Kane cools on Premier League return",
      "Harry Kane open to Bayern Munich stay and unsure of Premier League return",
      "Kane open to new Bayern deal as he dampens Premier League return talk"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.86,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.709,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Harry Kane has expressed a diminished interest in returning to the Premier League, indicating openness to discussing a new contract with Bayern Munich. His current deal with the German club is set to expire in 2027, and he sees potential for an extended stay.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Rescue Efforts Underway for Hikers Trapped on Everest's North Slope",
    "domain": "general",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Mon, 06 Oct 2025 12:38:23 -0400",
    "source": "ABC News",
    "sources": [
      "ABC News",
      "Washington Post",
      "New York Times"
    ],
    "domains": [
      "www.washingtonpost.com",
      "abcnews.go.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "An effort is underway to rescue hundreds of hikers who became trapped on Mount Everest due to an unexpected blizzard.",
      "Some 350 hikers were rescued and 200 remained stranded, Chinese state media reported Monday, as rescue efforts continued in China’s Tibet Autonomous Region.",
      "The snowfall buried tents and reduced visibility. The local authorities said that they were in contact with the hikers and that rescue efforts were underway."
    ],
    "image_url": "https://s.abcnews.com/images/International/251006_abc_social_everest_hpMain_4x3_384.jpg",
    "titles": [
      "WATCH:  Hundreds of hikers trapped by blizzard on Mount Everest",
      "Snowstorm traps hundreds on Mount Everest",
      "Snowstorm Traps Hundreds of Everest Hikers"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.785,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.704,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Rescue workers in Tibet are assisting hundreds of hikers trapped by a snowstorm on Mount Everest's northern slope. Chinese state media reported that tents at tourist campsites were damaged, and there are casualties. The heavy snowfall has buried tents and blocked rescue roads, but local authorities are in contact with the hikers and rescue efforts are ongoing.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Supreme Court Term Begins, Presidential Power Limits in Focus",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 06 Oct 2025 20:08:48 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "New York Times",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "www.bbc.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "Legal challenges have slowed Trump's attempts to expand presidential power. Now the highest US court is going to weigh in.",
      "<a href=\"https://news.google.com/rss/articles/CBMiiwFBVV95cUxPVEpBWDJPcGpPNEZCVVUtR3RlbDU5NXNGR2NYZDhPcWVPQ3F1TGgxYTVoWU9PYUEtNFVjNExJdzYzZVZoODgxN2p1SWdsRmRmVkxRNVVhVUlMQXNsSTR6Vm1XdTEzVmUxNEpycEhWUUV0eEViOU92aDcyRXBVYU1fekQ0MGQwTnkyREo4?oc=5\" target=\"_blank\">Trump, tariffs and trans rights: The Su",
      "Today, we look ahead at the potential consequences of the Supreme Court term that begins today."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/1c9a/live/721ac360-a2f1-11f0-b741-177e3e2c2fc7.jpg",
    "titles": [
      "New Supreme Court term will reshape Trump's powers",
      "Trump, tariffs and trans rights: The Supreme Court gears up for a new term - Axios",
      "President Trump and the Supreme Court"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.827,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.702,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Supreme Court's new term starts today, amid concerns over its failure to limit presidential power, which critics argue has had negative consequences. This term's outcomes could have significant implications, especially in the context of global authoritarian trends highlighted by leaders like Hungary's Viktor Orbán and Turkey's Recep Tayyip Erdoğan.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Canada Coffee Prices Surge Amid Climate Impact on Beans",
    "domain": "general",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Mon, 06 Oct 2025 23:38:01 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "CityNews"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "globalnews.ca"
    ],
    "snippets": [
      "A surge in price of coffee beans, up 28 per cent in August, compared to a year ago, means Canadians digging a lot deeper into their pocket to pay for that morning cup of joe.",
      "Your daily cup of java is getting a little more expensive as roasters and cafés grapple with rising coffee bean prices. Climate change has been the biggest contributor to the ongoing surge in bean prices, as coffee crops are very sensitive to temperature changes, said Michael von Massow, food econom"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/10/coffee-latte.jpg?quality=65&strip=all",
    "titles": [
      "Coffee roasters and cafés grapple with increasing cost of beans",
      "Roasters and cafés grapple with rising coffee bean prices"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.908,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.687,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Coffee prices in Canada have risen due to a 28% increase in coffee bean costs compared to last year. Climate change, affecting temperature-sensitive coffee crops, is a major factor behind this surge. This has led to higher prices for consumers at roasters and cafés.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "2025 Nobel Prize in Medicine Awarded for Autoimmunity Research",
    "domain": "science",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-10-06T09:51:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Ars Technica",
      "Deutsche Welle",
      "New Scientist"
    ],
    "domains": [
      "www.newscientist.com",
      "www.dw.com",
      "arstechnica.com"
    ],
    "snippets": [
      "Mary E. Brunkow, Fred Ramsdell, and Shimon Sakaguchi will be awarded the Nobel Prize in physiology or medicine for their instrumental work in improving our understanding of how the immune system functions.",
      "The 2025 Nobel prize in physiology or medicine has gone to Mary Brunkow, Fred Ramsdell and Shimon Sakaguchi for their discoveries around how we keep our immune system under control",
      "Their work revealed a peripheral mechanism that keeps immune system from causing harm."
    ],
    "image_url": "",
    "titles": [
      "Trio wins Nobel Prize in medicine for immune system research",
      "Nobel prize for medicine goes to trio for work on immune tolerance",
      "Discovery of cells that keep immune responses in check wins medicine Nobel Prize"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.682,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.683,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Mary E. Brunkow, Fred Ramsdell, and Shimon Sakaguchi were awarded the 2025 Nobel Prize in Physiology or Medicine for their groundbreaking research on how the immune system is regulated to prevent it from attacking the body's own tissues. Their work, which involves the identification of mechanisms that help maintain immune system balance, has been pivotal in advancing our understanding of autoimmunity. This US-Japanese team's discoveries have significantly contributed to the field of immunology.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: research",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Optimistic on Israel-Hamas Talks Amid Gaza Violence",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-10-06T07:20:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "The Guardian",
      "Deutsche Welle",
      "Washington Post"
    ],
    "domains": [
      "www.washingtonpost.com",
      "www.theguardian.com",
      "www.dw.com"
    ],
    "snippets": [
      "Delegations from Israel and Hamas are holding indirect talks on US President Donald Trump's plan for Gaza. Germany's foreign minister is heading to Egypt for talks on the negotiations. DW has the latest.",
      "<p>Talks on Monday expected to focus on release of hostages and end to war, after Israel kills 63 people in Gaza in past day</p><p>Donald Trump has urged negotiators to “move fast” in talks focused on the release of hostages held by Hamas in Gaza and a broader end to the war, as representatives arri",
      "Israel and Hamas gathered in Egypt for indirect talks over a U.S.-backed plan to end the Gaza war after months of deadlock."
    ],
    "image_url": "",
    "titles": [
      "Middle East updates: Gaza ceasefire talks start in Egypt",
      "Trump urges negotiators to ‘move fast’ as Gaza ceasefire talks set to begin in Egypt",
      "Gaza ceasefire talks begin in Egypt, as Israel strikes enclave"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.647,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.68,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "US President Donald Trump expressed optimism about the speed of negotiations between Israel and Hamas, focusing on the release of hostages and ending the conflict. This comes as talks are set to begin, following a deadly day in Gaza where 63 people were killed by Israeli forces. Trump has urged for quick action in these discussions.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Connor McDavid Signs Extension with Oilers Through 2027-28",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 6 Oct 2025 23:47:26 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "No. 97 is sticking with the Oilers through 2027-28 -- with a wide range of downstream impacts around the NHL.",
      "<p>Mark Spector joins The FAN Hockey Show to discuss Connor McDavid&#8217;s contract extension with the Oilers, discussing what may have been behind the decision to hold out through the summer, and how the team should be positioned for success around him.</p>"
    ],
    "image_url": "",
    "titles": [
      "Winners and losers of Connor McDavid's contract extension",
      "What factored into McDavid’s decision to wait on an extension?"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.99,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.678,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Connor McDavid has extended his contract with the Edmonton Oilers through the 2027-28 season. The decision, discussed by Mark Spector on The FAN Hockey Show, reflects strategic planning for the Oilers' future success around McDavid. This extension is expected to have significant implications for the NHL.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Dodgers Beat Phillies 4-3 in NLDS Game 2, Snell Dominates",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 6 Oct 2025 21:19:53 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "With a dominant effort from Blake Snell, a well executed wheel play, and one fortuitous scoop from Freddie Freeman for the final out, the Los Angeles Dodgers escaped with a thrilling 4-3 victory over the Philadelphia Phillies Monday in Game 2 of the NLDS.",
      "<p>Blake Snell stuck out nine over six shutout innings of one-hit ball for the Dodgers before relievers Alex Vesia and Roki Sasaki thwarted Philadelphia&#8217;s ninth-inning rally, sending Los Angeles to a 4-3 victory over the Phillies in Game 2 of their NL Division Series on Monday night.</p>"
    ],
    "image_url": "",
    "titles": [
      "Dodgers spin wheel play into win, 2-0 NLDS lead",
      "Dodgers’ bullpen holds off Phillies for commanding 2-0 lead in NLDS"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.941,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.668,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Los Angeles Dodgers won 4-3 against the Philadelphia Phillies in Game 2 of the NLDS, thanks to Blake Snell's six shutout innings with nine strikeouts and one hit allowed. Key defensive plays and effective relief pitching from Alex Vesia and Roki Sasaki halted a late Phillies rally, securing the Dodgers' victory.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Chargers' Omarion Hampton on Injured Reserve, Haskins and Vidal to Step Up",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 6 Oct 2025 21:19:53 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Chargers starting running back Omarion Hampton will be placed on injured reserve due to an ankle injury, coach Jim Harbaugh said Monday.",
      "Hassan Haskins and Kimani Vidal are next up in the Chargers' backfield"
    ],
    "image_url": "",
    "titles": [
      "Chargers placing top RB Hampton (ankle) on IR",
      "Omarion Hampton injury update: Chargers RB (ankle) joins Najee Harris on IR, will miss at least four games"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.941,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.668,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Los Angeles Chargers' starting running back, Omarion Hampton, has been placed on injured reserve due to an ankle injury, as announced by coach Jim Harbaugh. Hassan Haskins and Kimani Vidal are set to take over duties in the Chargers' backfield following Hampton's injury.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Mark Sanchez Charged With Felony Battery After Altercation in Indianapolis",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 6 Oct 2025 21:19:53 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Mark Sanchez is facing a felony battery charge over the altercation between the former NFL quarterback and a 69-year-old truck driver early Saturday in Indianapolis.",
      "<p>Former NFL quarterback Mark Sanchez is now facing a felony charge of battery involving serious bodily injury in addition to the misdemeanor charges stemming from a weekend incident in Indianapolis that led to his arrest.</p>"
    ],
    "image_url": "",
    "titles": [
      "Sanchez now facing felony charge for altercation",
      "Former NFL QB Mark Sanchez facing felony charge in Indianapolis altercation"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.941,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.668,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Former NFL quarterback and Fox Sports commentator Mark Sanchez has been charged with felony battery following an altercation with a 69-year-old truck driver in Indianapolis early Saturday.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Bills' Keon Coleman Benched for Discipline, Coach Seeks Consistency",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 6 Oct 2025 21:19:53 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Buffalo Bills wide receiver Keon Coleman was benched for the first offensive series of Sunday night's loss to the New England Patriots for \"discipline,\" head coach Sean McDermott said Monday.",
      "McDermott wants to see 'more consistency' from the second-year wideout"
    ],
    "image_url": "",
    "titles": [
      "Bills benched WR Coleman for disciplinary reasons",
      "Bills benched Keon Coleman for first series vs. Patriots due to disciplinary reasons, Sean McDermott reveals"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.941,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.668,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Buffalo Bills wide receiver Keon Coleman was benched for the first offensive series during Sunday night's game against the New England Patriots as a disciplinary action, according to head coach Sean McDermott. McDermott emphasized the need for \"more consistency\" from the second-year player.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Florida Panthers Receive Rings for Second Stanley Cup Win",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 6 Oct 2025 21:19:53 EST",
    "source": "ESPN",
    "sources": [
      "NHL",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "news.google.com"
    ],
    "snippets": [
      "The Florida Panthers handed out the rings from their second consecutive Stanley Cup title Monday, a day before the franchise will raise its back-to-back title banner on Opening Night, when they take on the Chicago Blackhawks at Amerant Bank Arena.",
      "<a href=\"https://news.google.com/rss/articles/CBMijAFBVV95cUxOTktMUDg3cHhiUFQ4TUdMVmNUNjZKRkZYcU1GTks4dXp0eGtjMmZyT1hzLV82bW9PaXVYdDlYTkJvZS1oNU5lV0JpaUxzQ0t5LXpFM2RLWEM3VGVqUGt1dV93bkd0QWY0UVZSQjFna09lN0VOeG9WZHhYWVVkYXZZM3RkRGpOdFN1Q0xWZQ?oc=5\" target=\"_blank\">Panthers receive Stanley Cup rings in",
      "<a href=\"https://news.google.com/rss/articles/CBMimgFBVV95cUxQMkQzV2p5bUtSUXNMRTBXSThTbWttbHprel9XdUwxTklpcTE3WVdSbm5MQlRSLWpvUjJXQVVfNjFiZndwSE5QTW1lMFRxLVhEMjhuZUxEQ3RUY2J0Ym81dEhTZFF0OTVIczJWYUpBMEJuamhRTGZhMkp0Z2J1ZFdkSDFyb0lWQ1hHd3JxWmxBSHpJQ3Z1ZmZlbXd3?oc=5\" target=\"_blank\">Florida Panthers Re"
    ],
    "image_url": "",
    "titles": [
      "Panthers receive Cup rings, prep for banner night",
      "Panthers receive Stanley Cup rings in championship celebration - NHL.com",
      "Florida Panthers Receive 2025 Stanley Cup Championship Rings - NHL.com"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.941,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.668,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Florida Panthers received their NHL championship rings for their second consecutive Stanley Cup title on Monday. These rings honor the fans' tradition of throwing plastic rats on the ice after wins. The team will raise their back-to-back title banner during the season opener against the Chicago Blackhawks at Amerant Bank Arena.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump: Talks with Democrats Post-Shutdown; Asserts Authority in Portland Crackdo",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Tue, 07 Oct 2025 03:11:52 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "LA Times"
    ],
    "domains": [
      "www.latimes.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "US President Donald Trump says Democrats must end the shutdown before talks can start after six days of gridlock.",
      "<p>Miller's rhetoric comes amid a federal crackdown on Portland, Ore., where he says the president has unchecked authority to protect federal lives and property.</p>"
    ],
    "image_url": "",
    "titles": [
      "Trump walks back offer to talk to Democrats as government shutdown extends",
      "Trump advisors amp up extreme rhetoric against Democrats during government shutdown, immigration raids"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.978,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.665,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "US President Donald Trump stated that discussions with Democrats would only begin after the shutdown ends, amidst a six-day gridlock. Concurrently, amid a federal crackdown in Portland, Oregon, Miller emphasized the president's authority to safeguard federal lives and property.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Tampa Bay's Last-Second Wins Shake Up NFL Rankings as Week 6 Nears",
    "domain": "sports",
    "source_domain": "sports.yahoo.com",
    "location": "national",
    "published": "Tue, 07 Oct 2025 03:37:24 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Bleacher Report",
      "Yahoo Sports"
    ],
    "domains": [
      "news.google.com",
      "thelistwire.usatoday.com",
      "sports.yahoo.com"
    ],
    "snippets": [
      "Tampa Bay is living off close, last-second wins so far.",
      "The Eagles and Bills fell from the unbeaten ranks, while the Jaguars pulled of a stunner on Monday night. Heading into Week 6, a new top team appears.",
      "<a href=\"https://news.google.com/rss/articles/CBMiiAFBVV95cUxNN0pjczhBQmdkLUF3MUxIWUZZNkNfTW83eWRTeXVVUUxzRlprM09kSmV5Rzd4ZjJybVNvbGlHUjA3clhMT0tzZmJ1WEtBcHlvb2ZLWDduZWNWZEkzQzVMcmlXQ2dkR0p1eUxfQWZnZVlJVFZMeUEtME9BWmhHWmdGS1poMDNHazlR?oc=5\" target=\"_blank\">B/R Experts Week 6 NFL Power Rankings</a>&n"
    ],
    "image_url": "",
    "titles": [
      "NFL Power Rankings entering Week 6: Are the Buccaneers good, or just lucky?",
      "NFL Power Rankings entering Week 6",
      "B/R Experts Week 6 NFL Power Rankings - Bleacher Report"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.987,
      "consensus": 0.611,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.657,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Tampa Bay has secured multiple narrow victories with last-second wins. Both the Eagles and Bills experienced their first losses, shaking up the rankings as Week 6 approaches. Meanwhile, the Jaguars achieved a surprising win on Monday night. Heading into the sixth week of NFL action, there's anticipation for a new top team to emerge in the power rankings.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Supreme Court Denies Google Appeal in Epic Games Case, Upholds Ruling",
    "domain": "business",
    "source_domain": "www.businessinsider.com",
    "location": "global",
    "published": "2025-10-07T02:03:10Z",
    "source": "Business Insider",
    "sources": [
      "Financial Post",
      "Business Insider"
    ],
    "domains": [
      "financialpost.com",
      "www.businessinsider.com"
    ],
    "snippets": [
      "The Supreme Court denied Google's bid to temporarily block parts of a lower court ruling in its legal fight with Epic Games, the maker of Fortnite.",
      "The U.S. Supreme Court on Monday refused to protect Google from a year-old order requiring a major makeover of its Android app store that&#8217;s designed to unleash more competition against a system that a jury declared an illegal monopoly. The rebuff delivered in a one-sentence decision by the Sup"
    ],
    "image_url": "https://i.insider.com/68e44a605dbc4fd10daa4aac?format=jpeg",
    "titles": [
      "Play Store downloads could soon get cheaper after the Supreme Court denies Google's bid to delay antitrust changes",
      "Google’s Play Store shake-up looms after Supreme Court refuses to delay overhaul of the monopoly"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.955,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.646,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The U.S. Supreme Court declined Google's request to halt parts of a lower court's decision in its battle with Epic Games. This decision upholds a mandate for Google to modify its Android app store practices, following a jury's finding that the current system constitutes an illegal monopoly.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "OpenAI Enables App Creation Inside ChatGPT Conversations",
    "domain": "technology",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Mon, 06 Oct 2025 21:17:33 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "TechCrunch"
    ],
    "domains": [
      "news.google.com",
      "techcrunch.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMiakFVX3lxTE9BME9PcGhMV0FFcEdkTXlDclRQMlRQdTk1RWtKZEF5NWJEZExxM1VnQVRldWZUVTB1elZibk9xR3JodTVWWnhTa05vWUxrUkM0SnlQT1VzZkc1UUpUNDlaU3FUaUxrZS1XSnc?oc=5\" target=\"_blank\">OpenAI launches new feature to integrate third-party apps</a>&nbsp;&nbsp;<font color",
      "OpenAI is launching a new way for developers to build applications that appear directly inside of ChatGPT's conversations."
    ],
    "image_url": "",
    "titles": [
      "OpenAI launches new feature to integrate third-party apps - Axios",
      "OpenAI launches apps inside of ChatGPT"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.847,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.631,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "OpenAI has introduced a feature allowing developers to create apps within ChatGPT conversations. This new integration aims to enhance user experience and functionality within the platform.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Paramount Skydance Acquires The Free Press for $150M",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Mon, 06 Oct 2025 13:19:28 GMT",
    "source": "Axios",
    "sources": [
      "CNBC",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMigAFBVV95cUxOMFB6eHNlOTdvV1NnV2tueE9QOW9VRTlBcnctbnZfX1hNQURLQ0JJbFJ4RXFkTUJEUDJ0NlI5VXlIQWM3UW5Ic2FsM3RMUExuNVNoYk9UQTBQSkNpcW4yRVZsa1JFUUtmMWgxeG1kYWgzMk5HTGtJT21BN2FRTGdzYw?oc=5\" target=\"_blank\">Paramount Skydance acquires The Free Press for $150M<",
      "Paramount Skydance has agreed to acquire online publication The Free Press, founded by Bari Weiss."
    ],
    "image_url": "",
    "titles": [
      "Paramount Skydance acquires The Free Press for $150M - Axios",
      "Paramount Skydance to acquire Bari Weiss-founded Free Press"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.718,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.609,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Paramount Skydance has purchased The Free Press for $150 million. The online publication was founded by Bari Weiss. The acquisition marks a significant development in the media industry.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Meta Launches Contest Judged by Celebrities Amid Payout Cuts",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Mon, 06 Oct 2025 15:00:45 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "Winners will be chosen by a panel including Instagram chief Adam Mosseri, filmmaker Spike Lee, designer Marc Jacobs and YouTuber Marques Brownlee.",
      "The move comes as Meta has been scaling back its creator payout programs over the past few years."
    ],
    "image_url": "",
    "titles": [
      "Instagram will award top creators with a gold ring. But no cash",
      "Instagram introduces new ‘Ring’ award for top creators"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.743,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.604,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Meta has announced a competition with winners selected by a panel featuring Instagram's Adam Mosseri, filmmaker Spike Lee, designer Marc Jacobs, and YouTuber Marques Brownlee. This occurs as Meta reduces its creator payout programs.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Consulting Firm to Refund for Report Errors, Admits Using GPT-4o",
    "domain": "technology",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Mon, 06 Oct 2025 06:46:24 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "Ars Technica"
    ],
    "domains": [
      "www.theguardian.com",
      "arstechnica.com"
    ],
    "snippets": [
      "<p>Partial refund to be issued after several errors were found in a report into a department’s compliance framework</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"ht",
      "Consulting firm quietly admitted to GPT-4o use after fake citations were found in August."
    ],
    "image_url": "https://i.guim.co.uk/img/media/515a0bf6dc96a2183fa9f4bc90a2fbeac2d91271/209_0_3292_2635/master/3292.jpg?width=140&quality=85&auto=format&fit=max&s=8962fcf918cd8a7bb9fd43f347b78c8c",
    "titles": [
      "Deloitte to pay money back to Albanese government after using AI in $440,000 report",
      "Deloitte will refund Australian government for AI hallucination-filled report"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.626,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.58,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A consulting firm will issue a partial refund due to multiple errors, including fake citations, found in a compliance framework report. The errors were acknowledged after the firm admitted to using GPT-4o in August.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]