[
  {
    "title": "G20 Leaders Call for Revisions to US Ukraine Peace Plan at Johannesburg Summit",
    "domain": "business",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Sun, 23 Nov 2025 05:46:16 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Reuters",
      "New York Times",
      "The Guardian",
      "Axios",
      "Deutsche Welle",
      "Financial Times",
      "Associated Press"
    ],
    "domains": [
      "aljazeera.com",
      "news.google.com",
      "nytimes.com",
      "theguardian.com",
      "dw.com",
      "ft.com"
    ],
    "snippets": [
      "Officials from the US, Ukraine, and national security advisers from France, UK and Germany to hold talks.",
      "US, Ukraine and European officials hold talks in Geneva on Trump's plan to end war Reuters",
      "European leaders say US peace plan for Ukraine needs work Reuters",
      "E3 advisors to meet EU, US, Ukrainian officials on Sunday on Ukraine peace plan Reuters",
      "Meetings in Geneva will include European officials, as the Trump administration’s pushes Kyiv to accept a 28-point peace plan to end the war with Russia.",
      "28-point draft plan widely seen as favourable to Moscow, despite Russian invasion of Ukraine in February 2022 In a joint statement issued at the G20 summit in South Africa yesterday, a number of Ukraine’s western allies said the draft proposal “would leave Ukraine vulnerable to attack”. In a joint s",
      "U.S. to hold talks in Geneva with Ukraine and EU countries on Trump's peace plan Axios",
      "In a joint statement, the leaders reaffirmed their commitment to Ukraine, which faces the prospect of losing American support if it rejects the latest proposal.",
      "European leaders say Washington’s proposal needs major changes, as Macron warns G20 risks losing relevance Western leaders have said the US peace plan for ending the war in Ukraine “will require additional work” at the G20 summit in Johannesburg, which Donald Trump boycotted. The draft plan , which",
      "A group of US lawmakers says Marco Rubio told them the Trump-backed peace plan is a Russian \"wish list.\" The US top diplomat, however, insists it was US-authored. Follow DW for more.",
      "Senators said Marco Rubio told them that a contentious 28-point proposal was not a Trump administration policy",
      "US senators say Rubio told them Trump’s Ukraine peace plan is Russia’s ‘wish list’ AP News",
      "Rubio says the Ukraine peace proposal was authored by the US Reuters",
      "France's Macron says peace deal proposal needs to be revisited Reuters",
      "This blog is now closed, you can read more on this story here Leaders from Europe , Canada , Japan and Australia are expected to huddle on the sidelines of the G20 summit on Saturday to “discuss the way ahead on Ukraine”, an EU official said. A European diplomatic source told Agence France-Presse (A"
    ],
    "image_url": "",
    "titles": [
      "Russia-Ukraine war live: US, European officials to discuss Trump’s plan",
      "US, Ukraine and European officials hold talks in Geneva on Trump's plan to end war - Reuters",
      "European leaders say US peace plan for Ukraine needs work - Reuters",
      "E3 advisors to meet EU, US, Ukrainian officials on Sunday on Ukraine peace plan - Reuters",
      "Ukraine, U.S. Will Meet About Trump’s Peace Plan to End War With Russia",
      "Ukrainian and US officials meet for emergency talks on plan to end war with Russia – live",
      "U.S. to hold talks in Geneva with Ukraine and EU countries on Trump's peace plan - Axios",
      "G20 Leaders Push Back on Trump’s Ukraine Peace Plan",
      "Western leaders at G20 say US peace plan for Ukraine ‘will require work’",
      "Ukraine updates: US senators say peace plan is from Russia",
      "Lawmakers say US secretary of state rowed back on Ukraine peace plan",
      "US senators say Rubio told them Trump’s Ukraine peace plan is Russia’s ‘wish list’ - AP News",
      "Rubio says the Ukraine peace proposal was authored by the US - Reuters",
      "France's Macron says peace deal proposal needs to be revisited - Reuters",
      "US plan for Ukraine needs ‘additional work’, say Kyiv’s allies at G20 summit – as it happened"
    ],
    "url": "https://www.aljazeera.com/news/liveblog/2025/11/23/ukraine-live?traffic_source=rss",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMitwFBVV95cUxPNzlLeE5xM2h6ZzR4Nm1PcUw3LWpFR3dRcDlWMVo5UzNmSmpLRl9zNERuU2o2M3NiZzZpcmRjUmNRSjNkYXdlUnVGSldZRWl5al9BbDVzT2I3UlZUZWdRWnZvZ05iWU4zcWlvZlpjd3duYl8tQWhiY2F6UFdnN3RaZFpIdlhFRS1CUWlfWEhudGxTYUU3VGFZS2N4Q0FEeE8zSm9jcF9MNTgteXduT3BPOUhERm15bzg?oc=5",
      "https://news.google.com/rss/articles/CBMipAFBVV95cUxQNV9RUXpFRURNQ0ZPWlVrbjJSUlllM1dVSHlaYzY4NTE2Q01vXzd5X0ZQV3RicVJpX1dxLS1JOWVMYkxEbktNWWhjUlRrVnRrV1BTU1EwLWJXbzlWQm1NUnJrREQzYjBmSm9VOEd1VHR0Y1FMZG1TcS1UamRGdlhOMG9TUEc3NWVhWmw4dG82ZkRoeGV1SnZpakhiZi0xUlM3YlBlMA?oc=5",
      "https://news.google.com/rss/articles/CBMirwFBVV95cUxPaUwzSkxnblBpX3E0ampTek4zVVJkVHgyWW50dEd6QjIyWU9GUWtRUm1xc3B2M0hNQmZ5YS04SkdISU9uYUVCektqQThLaWRqZlFXRDVBaFVwc1FDdG1lUG5ieVRHZlhFYXAxY2tzWnJSdUo1R1BvRXpRbzZCZk1FRkUxVnZZci1CR2VvZVBBQmEwYUk1OWdWRVZpV2JDSDQ1elV4dEx3NzBQWjVuNWVj?oc=5",
      "https://www.nytimes.com/2025/11/23/world/europe/ukraine-switzerland-russia-peace-talks.html",
      "https://www.theguardian.com/world/live/2025/nov/23/ukrainian-us-emergency-talks-plan-war-russia-live",
      "https://news.google.com/rss/articles/CBMie0FVX3lxTE1YR09wVktrRjdPYjFyTmhTckF4dWxzaUdPLXFFYU5KZFZTUTZyeE5BOFlRWHpkS1BiODNyeGZTc1JvR25jeG54dW9UX0g1X0ZrYm82TDdJVG9PUWs3SW5FdlNNa3pwVmRLUi1PMXJsYU9HSkYwTHRqT3dyQQ?oc=5",
      "https://www.nytimes.com/2025/11/22/world/africa/g20-south-africa-ukraine-russia-united-states.html",
      "https://www.theguardian.com/world/2025/nov/22/us-peace-plan-ukraine-g20-changes",
      "https://www.dw.com/en/ukraine-updates-us-senators-say-peace-plan-is-from-russia/live-74850575?maca=en-rss-en-top-1022-rdf",
      "https://www.ft.com/content/a32aa172-cfb1-4929-9841-e3aa6ee8c67d",
      "https://news.google.com/rss/articles/CBMitgFBVV95cUxOMTk0Y216ODR3VWdkeXhnYU0ySW0yT1M1OG5KZDBudXMyajJsMXhWS2dtcVZieGJOT1V3aEk0a0hFSnVOLVZva1FMUHBCVDJvUUtJb2l2YWVsTVdkTkhXQ0VGQUhsTnhfS1pUZVRfMFNpV0trR05ZMHo3RVozdFVCY1M3UmV4TWs4cGYxQzNoNGpRaUJHUVpQeWNqSExPYnc4VDZ5Vzl2OENuTVNUeEZvZVhLclpwdw?oc=5",
      "https://news.google.com/rss/articles/CBMiowFBVV95cUxNaWJtZTc5MU94WHB6UmRFNWVXQS1BVWw3YkdGYk11OGdqNm9uMWtsc25NOGh6RjJad2xNNHVOU2hJajFJVXpDX2c0Zlo1NFdYTlFLNWJvTV9hX19MT2xBMDhWdFhXajlTbDJFYmY1ekxRWWxhbkZWdHJtd2g4aGZTMXlsNWhlbS1XcWlPV0FSeUttRDdNWUM3UV9pdTVNQm1JQXNF?oc=5",
      "https://news.google.com/rss/articles/CBMiqwFBVV95cUxPcWhJRzRkZVR6Z2dldWhYcDd0Y0ZOWDEwbFoyUDg0U0l6U3c0eFF4bXlJYkVOWnpZTm1HWl9kU3VoaEtYSks0T1JnZjNsY0I0NFNzc1FucXJrZkM2aWpJdjNhMVdUNGFnVlFTVlNSc3RXLThNVkQzTVJFT2lDVnBjVUl0SEJJWUk2dW9VaXF0U3ppWHFLQkgzel9yQ1BCTHRGZVdhWVE5dHhyMGs?oc=5",
      "https://www.theguardian.com/world/live/2025/nov/22/russia-ukraine-war-trump-peace-plan-g20-zelenskyy-putin-europe-latest-news-updates"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/liveblog/2025/11/23/ukraine-live?traffic_source=rss",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.914,
      "consensus": 1.0,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.923,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "At the G20 summit in Johannesburg, Western and European leaders stated that the US peace plan for Ukraine requires significant revisions. French President Macron cautioned that the G20 risks losing relevance. Leaders reaffirmed their support for Ukraine, which may risk losing US backing if it rejects the current proposal. Former President Trump signaled openness to changes but did not attend the summit.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story clearly highlights the call for revisions to the US peace plan for Ukraine by G20 leaders. It provides a deeper understanding of the international dynamics and the potential implications for Ukraine. It also empowers readers with knowledge about the ongoing efforts to bring peace to Ukraine.",
    "constructiveness_source": "gpt",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "Verstappen Wins Las Vegas GP; Norris and Piastri Face Possible Disqualification",
    "domain": "sports",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Sun, 23 Nov 2025 07:03:38 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "ESPN",
      "The Guardian",
      "Sky Sports",
      "Sportsnet",
      "Forbes"
    ],
    "domains": [
      "aljazeera.com",
      "espn.com",
      "theguardian.com",
      "skysports.com",
      "sportsnet.ca",
      "forbes.com"
    ],
    "snippets": [
      "Lando Norris closes in on first Formula One Drivers' championship after finishing second to Max Verstappen in Nevada.",
      "Max Verstappen claimed his second Las Vegas Grand Prix ahead of championship leader Lando Norris to keep his slim championship chances alive.",
      "Red Bull driver all but untouchable under the lights in Nevada Lando Norris took second, George Russell third and Oscar Piastri fourth Max Verstappen has won the Las Vegas Grand Prix with a dominant drive that was enough to just keep his world championship hopes alive. Title leader Lando Norris took",
      "Max Verstappen dominated the Las Vegas Grand Prix as Lando Norris fought back to finish second - but the McLaren driver and team-mate Oscar Piastri could be disqualified for excessive skid block wear.",
      "Highlights of the Las Vegas Grand Prix.",
      "LAS VEGAS — For a driver who hated the Las Vegas Grand Prix before he’d ever turned a lap, Max Verstappen sure has turned the event into his own personal jackpot. Verstappen won for the second time in four races and the four-time reigning Formula 1 champion continued to claw his way back into title picture with a Saturday night victory on the streets of Las Vegas. It is the second time in three years the Dutchman has won on the course that utilizes a part of the famed Strip. He won the inaugural race in 2023 and clinched his fourth consecutive title here last year. Now he has another win at...",
      "Max Verstappen secured victory at the Las Vegas Grand Prix, while Lando Norris further extended his championship lead. See the full race results."
    ],
    "image_url": "",
    "titles": [
      "Verstappen wins Las Vegas F1 GP while Norris extends championship lead",
      "Verstappen wins Vegas GP, narrows F1 points gap",
      "Max Verstappen dominates F1 Las Vegas GP to keep championship hopes alive",
      "Verstappen wins Las Vegas GP as McLaren duo face disqualification",
      "Highlights: Verstappen dominates in Las Vegas before McLaren drama",
      "Max Verstappen wins Las Vegas Grand Prix, narrows F1 points gap",
      "2025 Las Vegas Grand Prix Results: Verstappen Wins, Norris Moves Closer To F1 Title"
    ],
    "url": "https://www.aljazeera.com/sports/2025/11/23/verstappen-wins-las-vegas-f1-gp-while-norris-extends-championship-lead?traffic_source=rss",
    "alternate_urls": [
      "https://www.espn.com/f1/story/_/id/47023118/max-verstappen-wins-las-vegas-gp-lando-norris-moves-closer-f1-title",
      "https://www.theguardian.com/sport/2025/nov/23/max-verstappen-wins-f1-las-vegas-gp-lando-norris-second",
      "https://www.skysports.com/f1/news/12040/13474306/las-vegas-gp-max-verstappen-wins-as-lando-norris-closes-in-on-world-title-with-second-oscar-piastri-finishes-fourth",
      "https://www.skysports.com/watch/video/13474343/las-vegas-gp-race-highlights",
      "https://www.forbes.com/sites/yaraelshebiny/2025/11/23/2025-las-vegas-grand-prix-results-verstappen-wins-norris-moves-closer-to-f1-title/"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/sports/2025/11/23/verstappen-wins-las-vegas-f1-gp-while-norris-extends-championship-lead?traffic_source=rss",
    "score_components": {
      "magnitude": 0.986,
      "recency": 0.938,
      "consensus": 1.0,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.883,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Max Verstappen won the Las Vegas Grand Prix, finishing ahead of championship leader Lando Norris, who took second place. Verstappen's win keeps his championship hopes alive, but Norris extended his overall lead in the standings. George Russell finished third and Oscar Piastri fourth. The results are pending as Norris and Piastri face possible disqualification for excessive skid block wear.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story provides basic awareness of the event and its outcome, but it doesn't offer any deeper insights or understanding. It doesn't report on progress or solutions, nor does it increase clarity around systems or impacts.",
    "constructiveness_source": "gpt",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "Over 300 Schoolchildren, 12 Teachers Abducted from Catholic School in Nigeria",
    "domain": "business",
    "source_domain": "npr.org",
    "location": "national",
    "published": "Sat, 22 Nov 2025 09:37:45 -0500",
    "source": "NPR",
    "sources": [
      "NPR",
      "Reuters",
      "CBC News",
      "Associated Press",
      "Forbes"
    ],
    "domains": [
      "npr.org",
      "news.google.com",
      "cbc.ca",
      "forbes.com"
    ],
    "snippets": [
      "A total of 303 schoolchildren and 12 teachers were abducted by gunmen during an attack on St. Mary's School, a Catholic institution in north-central Nigeria's Niger state, the Christian Association of Nigeria said.",
      "More than 300 taken from Nigeria school in one of worst mass abductions Reuters",
      "A total of 303 schoolchildren and 12 teachers were abducted by gunmen during an attack on St. Mary's School, a Catholic institution in north-central Nigeria's Niger state, the Christian Association of Nigeria said Saturday, updating an earlier tally of 215 schoolchildren.",
      "Number of children abducted in Nigerian school attack raised to more than 300 AP News",
      "It’s been over a decade since Boko Haram abducted 276 girls from a school in Chibok, Borno, in April 2014. The abduction received international attention, with..."
    ],
    "image_url": "",
    "titles": [
      "More than 300 children were abducted in an attack on a Catholic school in Nigeria",
      "More than 300 taken from Nigeria school in one of worst mass abductions - Reuters",
      "More than 300 Nigerian schoolchildren abducted by gunmen",
      "Number of children abducted in Nigerian school attack raised to more than 300 - AP News",
      "Hundreds Of Children Abducted From A School In Nigeria"
    ],
    "url": "https://www.npr.org/2025/11/22/nx-s1-5617680/nigeria-catholic-school-children-abducted",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMixAFBVV95cUxPYi1RNFVXcXFyb3JmMEd6cjVBdFVJUkVjMVhuV0Y0ZmpCWE9Pa2JBNXN2bGVJb3lSY2pGY1pNakhkczU5bVF5bkZ4T3BMUmVoc0dPM3J6U1BkTF9mYXVPdG82MWlkdUZfbHlmTy1LSFJiVTdKeEE0UFdxWGl0OEs3LTNTbnJBdE5rbkRSTjZCNlVZRXB0N0dRemRpLTN1cmpKQmU0ejN2bHdEU2xuLTY4OXBsaGgyci1Xc1BMdmZfU1hUQzVG?oc=5",
      "https://www.cbc.ca/news/world/children-abducted-nigeria-school-9.6989006?cmp=rss",
      "https://news.google.com/rss/articles/CBMijgFBVV95cUxORmNEbDRaLW5MYW1fdGVSY01RRjA1MVRSYUZZNWZkT3J2NXE0TXBMUHhGUjZwdVg0Y3JpYlpacDBWdWZ6QnZ3Y3ZHX0dMLUlkZEJfNEg0OGdHV3UyUVRWZ3JGemdjUlhmMjlQSEYzT0QxeS16MTUxaFVGMXU3a3l5MzM1WUE5Q0dKc3pCZGxR?oc=5",
      "https://www.forbes.com/sites/ewelinaochab/2025/11/22/hundreds-of-school-children-abducted-from-a-school-in-nigeria/"
    ],
    "location_scope": "national",
    "link": "https://www.npr.org/2025/11/22/nx-s1-5617680/nigeria-catholic-school-children-abducted",
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.666,
      "consensus": 0.975,
      "constructiveness": 0.6,
      "proximity": 0.75
    },
    "score": 0.842,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Gunmen abducted 303 schoolchildren and 12 teachers from St. Mary's School, a Catholic institution in Niger state, north-central Nigeria, according to the Christian Association of Nigeria. This is one of the largest mass abductions in the country since the 2014 Chibok kidnapping. Authorities have updated the number of abducted children from an earlier count of 215. The current status of the hostages remains unclear.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs about a serious incident, providing useful context about the scale of the abduction and its comparison to past incidents. However, it doesn't report on progress or solutions, nor does it provide empowering knowledge or actionable insights.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "UN Climate Deal Boosts Aid for Poor Nations, Omits Fossil Fuel Phase-Out",
    "domain": "science",
    "source_domain": "npr.org",
    "location": "national",
    "published": "Sat, 22 Nov 2025 15:59:57 -0500",
    "source": "NPR",
    "sources": [
      "NPR",
      "Axios",
      "Reuters",
      "Phys.org"
    ],
    "domains": [
      "npr.org",
      "news.google.com",
      "phys.org"
    ],
    "snippets": [
      "Dozens of countries had called for a clear \"roadmap\" to transition away from the use of coal, oil and natural gas. The U.S. did not participate in the negotiations.",
      "Fractious UN climate talks end with no direct push on fossil fuels in deal Axios",
      "COP30 seals uneasy climate deal that sidesteps fossil fuels Reuters",
      "Nations sealed a modest deal at the UN climate summit in the Amazon Saturday, as Europe and others dropped their demands for a plan to phase out fossil fuels after fraught negotiations with oil-producing countries and emerging economies."
    ],
    "image_url": "",
    "titles": [
      "U.N. climate talks end without agreement on phasing out fossil fuels",
      "Fractious UN climate talks end with no direct push on fossil fuels in deal - Axios",
      "COP30 seals uneasy climate deal that sidesteps fossil fuels - Reuters",
      "Amazon summit seals climate deal without fossil fuel plan"
    ],
    "url": "https://www.npr.org/2025/11/22/nx-s1-5615207/u-n-climate-talks-end-cop30-brazil",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMib0FVX3lxTFBRSkptb2VONUQzZWoxbnRscUphOEtJNXNQZ1BkNU1QWmcwWVMyS001eWtqdGhCYUthU0NvSTZMOWk0RUllWUNjSTU2SnM3aGJYdEVHQmlXNkhjb0tjS3duMklab3o0N1hqLXlPZzRUWQ?oc=5",
      "https://news.google.com/rss/articles/CBMisAFBVV95cUxNT0xNSXVjSFByZzk4RzhYZFRqV1F3QldDdEgwOWNNaWZ0MFdhbVZDc0ZNVExUemdRRWVZbk5DQVRhYUZtREVaX2JTTVZFWXNVUm5SR0NXaTB2UW5xS01KN2l4TlI5a1lvdTVoeHU0eE0zWEk3cUJjMVNSMkV4MG4tazRWSFQwZWZjdUdsRXR2OUZrZE9CNWc1ZWp5c1FOZ3czS2h5eG5BLWtQOVFidkpVSA?oc=5",
      "https://phys.org/news/2025-11-amazon-summit-climate-fossil-fuel.html"
    ],
    "location_scope": "national",
    "link": "https://www.npr.org/2025/11/22/nx-s1-5615207/u-n-climate-talks-end-cop30-brazil",
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.761,
      "consensus": 0.888,
      "constructiveness": 0.7,
      "proximity": 0.75
    },
    "score": 0.838,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "UN climate talks concluded with a compromise deal that increases financial support for poorer countries facing climate change but does not directly address or call for a phase-out of fossil fuels. The agreement, led by Brazil’s COP30 presidency, was accepted by participating nations despite calls for stronger action on fossil fuel reduction. The deal aims to encourage more concrete climate plans in the future.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "The story informs about a recent UN climate deal, its implications for poorer countries, and the ongoing controversy around fossil fuel phase-out. It provides awareness about the current state of international climate policy but lacks a deeper examination of potential solutions or progress.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "UAB Football Player Arrested After Alleged Stabbing of Two Teammates",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Sun, 23 Nov 2025 01:10:13 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "The Guardian",
      "Sports Illustrated",
      "Sportsnet"
    ],
    "domains": [
      "espn.com",
      "theguardian.com",
      "news.google.com",
      "sportsnet.ca"
    ],
    "snippets": [
      "A UAB football player was arrested after stabbing two of his teammates Saturday morning at the football facility ahead of the Blazers' home game against USF, a school spokesperson confirmed.",
      "Incident happened hours before Saturday’s game Two players in stable condition in local hospital A University of Alabama at Birmingham football player allegedly stabbed two teammates on Saturday morning, hours before the team’s game against the University of South Florida, the university said in a s",
      "UAB Football Player Arrested for Allegedly Stabbing Two Teammates Sports Illustrated",
      "A University of Alabama at Birmingham football player stabbed two teammates Saturday morning, hours before the team’s game against the University of South Florida, the university said in a statement."
    ],
    "image_url": "",
    "titles": [
      "UAB: Player arrested after stabbing 2 teammates",
      "UAB football player faces attempted murder charge after allegedly stabbing teammates",
      "UAB Football Player Arrested for Allegedly Stabbing Two Teammates - Sports Illustrated",
      "UAB football player accused of stabbing two teammates before game"
    ],
    "url": "https://www.espn.com/college-football/story/_/id/47061708/uab-football-player-arrested-stabbing-two-teammates",
    "alternate_urls": [
      "https://www.theguardian.com/sport/2025/nov/22/uab-football-player-faces-attempted-charge-after-allegedly-stabbing-teammates",
      "https://news.google.com/rss/articles/CBMiowFBVV95cUxQS2ROX3RCc05BUWNONGJXVmswcFgwaXhKTTVHSXJfRjFCU0psRjd1RkRMU0F5Z0JGMHFZYnBJam1keGMyWGN0elBmcjU2alREY0FRcTRXRU82SjFzU1NMdWJYaVlaMkdVTFROUWZpeHNVMG9lbDdZYlV3YmF1NTJuZktzSC1uWEpNTk5iU1VKTHJFNHRBYW5FWTYxN0VINjFHQnpZ?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/college-football/story/_/id/47061708/uab-football-player-arrested-stabbing-two-teammates",
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.921,
      "consensus": 0.908,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.828,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A University of Alabama at Birmingham (UAB) football player was arrested Saturday morning after allegedly stabbing two teammates at the team's facility, according to the university. The incident occurred hours before UAB’s game against the University of South Florida. Both injured players are in stable condition at a local hospital. The university is cooperating with authorities.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "The story provides basic awareness of a negative event, but it doesn't provide actionable insights or deeper understanding. It doesn't report on progress or solutions, nor does it increase clarity around systems or impacts.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "JFK’s Granddaughter Tatiana Schlossberg Reveals Terminal Leukemia Diagnosis",
    "domain": "general",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Sun, 23 Nov 2025 07:42:57 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "ABC News",
      "The Guardian",
      "LA Times"
    ],
    "domains": [
      "bbc.com",
      "abcnews.go.com",
      "theguardian.com",
      "latimes.com"
    ],
    "snippets": [
      "Tatiana Schlossberg, 35, says she was diagnosed shortly after giving birth in 2024 and has less than a year to live.",
      "Tatiana Schlossberg, the daughter of Caroline Kennedy, revealed in an emotional essay Saturday that she has been diagnosed with a terminal cancer.",
      "Journalist, daughter of Caroline Kennedy and Edwin Schlossberg, reveals she has acute myeloid leukemia Tatiana Schlossberg, a journalist and the granddaughter of John F Kennedy, disclosed on Saturday that she has been diagnosed with terminal cancer, saying her doctor informed her that she has less t",
      "President Kennedy's 35-year-old granddaughter disclosed that she has a rare leukemia and may have less than a year to live."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/c290/live/e0127410-c850-11f0-9fb5-5f3a3703a365.jpg",
    "titles": [
      "JFK's granddaughter shares terminal cancer diagnosis",
      "JFK's granddaughter reveals terminal cancer diagnosis",
      "Tatiana Schlossberg, granddaughter of JFK, announces terminal cancer diagnosis",
      "Tatiana Schlossberg, granddaughter of JFK, reveals terminal cancer diagnosis"
    ],
    "url": "https://www.bbc.com/news/articles/cpvdyg348pko?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://abcnews.go.com/US/tatiana-schlossberg-caroline-kennedys-daughter-reveals-terminal-cancer/story?id=127785089",
      "https://www.theguardian.com/us-news/2025/nov/22/tatiana-schlossberg-jfk-terminal-cancer",
      "https://www.latimes.com/entertainment-arts/business/story/2025-11-22/tatiana-schlossberg-reveals-terminal-cancer-diagnosis-another-kennedy-family-tragedy"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/news/articles/cpvdyg348pko?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.951,
      "consensus": 0.908,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.809,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Tatiana Schlossberg, 35, journalist and granddaughter of John F. Kennedy, announced she has been diagnosed with acute myeloid leukemia shortly after giving birth in 2024. She revealed the cancer is terminal and her doctors estimate she has less than a year to live. Schlossberg shared the news in a public essay on Saturday.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "The story provides basic awareness about Tatiana Schlossberg's health condition but lacks depth or insight. It does not provide any actionable insights or deeper understanding about the disease, nor does it report on any solutions or improvements. It does not contribute meaningfully to the reader's understanding or decision-making.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Canadiens Snap Five-Game Skid With 5-2 Win Over Maple Leafs",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sun, 23 Nov 2025 03:02:17 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "NHL",
      "Sportsnet"
    ],
    "domains": [
      "globalnews.ca",
      "news.google.com",
      "sportsnet.ca"
    ],
    "snippets": [
      "Noah Dobson and Josh Anderson scored twice to help the Montreal Canadiens snap a five-game losing streak with a 5-2 win over the rival Toronto Maple Leafs in a battle of two slumping teams on Saturday night.",
      "Canadiens defeat Maple Leafs to end 5-game skid NHL.com",
      "Watch as Toronto Maple Leafs defenceman Dakota Mermis drops the gloves with Montreal Canadiens forward Florian Xhekaj during the third period of his NHL debut.",
      "Josh Anderson and Noah Dobson scored two goals each, while Mike Matheson and Ivan Demidov added two assists apiece as the Montreal Canadiens fended off the Toronto Maple Leafs for a 5-2 win. William Nylander recorded a goal and an assist in the loss.",
      "The Canadiens desperately needed to get back to the style of play that led to so much success to open the season. They found that form on Saturday, doing things the right way in a much-needed win over the Maple Leafs."
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/11/66844a80c0beaf69d2d035971ecfcd0eb9277ddead3a1b5b4f6cf4917e690d2c.jpg?quality=65&strip=all",
    "titles": [
      "Canadiens snap skid with 5-2 win over Maple Leafs",
      "Canadiens defeat Maple Leafs to end 5-game skid - NHL.com",
      "Canadiens’ Florian Xhekaj, Maple Leafs’ Mermis trade blows in fiery bout",
      "NHL Highlights: Canadiens 5, Maple Leafs 2",
      "Slump-busting win over Maple Leafs gives Canadiens recipe to follow"
    ],
    "url": "https://globalnews.ca/news/11539292/canadiens-snap-skid-with-5-2-win-over-maple-leafs/",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMilgFBVV95cUxPNW96dV8zQm50VlM3S3FxSFB4ZDJra1JzYTFvTUtmTjZtTlo0b3BQZlBmZndwX0lUMHRsaHpzX3prRmh5bVFjdm5sbnh6Q3BiRDhIR3hGOEktWGdJSm5NSk9EeHFOLUpiWFBhVGYwZkUtbTE1QjZkQVFyZVBkYURfR2NIS09FNVpSakp4SGg3UG9VbDNydFE?oc=5"
    ],
    "location_scope": "national",
    "link": "https://globalnews.ca/news/11539292/canadiens-snap-skid-with-5-2-win-over-maple-leafs/",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.863,
      "consensus": 0.789,
      "constructiveness": 0.5,
      "proximity": 1.0
    },
    "score": 0.809,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Montreal Canadiens ended a five-game losing streak with a 5-2 victory over the Toronto Maple Leafs on Saturday night. Josh Anderson and Noah Dobson each scored twice, while Mike Matheson and Ivan Demidov contributed two assists each. William Nylander had a goal and an assist for Toronto. The game also featured a fight between Dakota Mermis and Florian Xhekaj.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story provides basic awareness of the event and its outcome, but it doesn't offer any deeper insights or understanding. It doesn't report on progress or solutions, nor does it increase clarity around systems or impacts.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Bolsonaro Arrested in Brasilia After Alleged Escape Plot and Tampered Ankle Moni",
    "domain": "general",
    "source_domain": "npr.org",
    "location": "national",
    "published": "Sat, 22 Nov 2025 08:50:30 -0500",
    "source": "NPR",
    "sources": [
      "NPR",
      "Washington Post",
      "New York Times",
      "Associated Press"
    ],
    "domains": [
      "npr.org",
      "washingtonpost.com",
      "nytimes.com",
      "news.google.com"
    ],
    "snippets": [
      "Brazil's Supreme Court ordered the arrest of Jair Bolsonaro, with a judge claiming the former president was intent on escaping as he was set to begin his prison sentence for leading a coup attempt.",
      "A judge said he ordered the arrest after learning Bolsonaro’s ankle monitor had been tampered with. The Trump ally was convicted earlier this year of attempting a military coup.",
      "The arrest came days before the former president was expected to be ordered to begin a 27-year prison sentence for staging a failed coup.",
      "Brazil's ex-president Bolsonaro arrested over alleged plot to escape and avoid 27-year prison term AP News"
    ],
    "image_url": "",
    "titles": [
      "Brazil's Bolsonaro arrested for allegedly plotting escape ahead of prison term",
      "Brazil’s ex-leader Bolsonaro arrested over allegations of escape plot",
      "Jair Bolsonaro Arrested in Brazil Amid Fears He Might Flee to Avoid Prison",
      "Brazil's ex-president Bolsonaro arrested over alleged plot to escape and avoid 27-year prison term - AP News"
    ],
    "url": "https://www.npr.org/2025/11/22/nx-s1-5617668/brazil-bolsonaro-arrest-order-supreme-court",
    "alternate_urls": [
      "https://www.washingtonpost.com/world/2025/11/22/brazil-bolosnaro-arrested-vigil-disorder/",
      "https://www.nytimes.com/2025/11/22/world/americas/jair-bolsonaro-brazil-arrest.html",
      "https://news.google.com/rss/articles/CBMilAFBVV95cUxNaG1MSUZrbmtULUE2NGkwTEhNakZCRUpKWmEyU3J3dWhtbncyZFhjNGxCaVM5SlNDbUpqeldjNmxQVjZoNWg2SUJHcHRLbVdVR0JfczhDYmJ6UDhCZW93ZDc1ZkQzdHpvejdLam5neHVGM3RmaVRVUHJYVVBSSUJKd0xBeFNtSHlhN09JVlpfcGtCN3Ey?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.npr.org/2025/11/22/nx-s1-5617668/brazil-bolsonaro-arrest-order-supreme-court",
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.656,
      "consensus": 0.908,
      "constructiveness": 0.5,
      "proximity": 0.75
    },
    "score": 0.795,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Former Brazilian president Jair Bolsonaro was arrested in Brasilia after a Supreme Court judge ordered his detention, citing an alleged plan to escape before starting a 27-year prison sentence for leading a failed coup attempt. Bolsonaro’s ankle monitor had reportedly been tampered with. The arrest ends months of house arrest as he appealed his conviction. He is now in federal police custody.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about the arrest of former Brazilian president Jair Bolsonaro. However, it does not offer any actionable insights or deeper understanding of the implications of this event. It also does not report on any solutions, improvements, or attempts to solve problems.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "McLaren Drivers Disqualified from Las Vegas GP for Technical Infringements",
    "domain": "sports",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Sun, 23 Nov 2025 09:49:03 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Reuters",
      "Yahoo Sports"
    ],
    "domains": [
      "bbc.com",
      "news.google.com",
      "sports.yahoo.com"
    ],
    "snippets": [
      "Lando Norris and McLaren team-mate Oscar Piastri are disqualified from the Las Vegas Grand Prix for technical infringements.",
      "Norris and Piastri at risk of Las Vegas disqualification Reuters",
      "Lando Norris and team-mate Oscar Piastri face potentially being disqualified from the Las Vegas Grand Prix for technical infringements.",
      "McLaren suffers a costly disqualification as the 2025 title race heats up"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/5d0d/live/382df110-c84c-11f0-9fb5-5f3a3703a365.jpg",
    "titles": [
      "Norris and Piastri disqualified from Las Vegas GP",
      "Norris and Piastri at risk of Las Vegas disqualification - Reuters",
      "Norris and Piastri face possible disqualifications",
      "Lando Norris, Oscar Piastri disqualified from F1 Las Vegas GP"
    ],
    "url": "https://www.bbc.com/sport/formula1/articles/cr7l5v2exv0o?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMinwFBVV95cUxQSDFiaG16LWVCRVIzRW9uUElqQ2VoVUlvS0E2UUVHVEU1VUZzRVZ1ak1qQ0VvdXBnbW5JUzJhVHJaM0lUYVR4Mm1qSVh0MFg4VldDci1BSHBJVEx2bjExTmxSLUluX3NMZndTcHhMSmRNSkgyRDhqRFRPWWlpUmY4eGs2YmREX1JCZlhDUmZOZXI5d1FoT0NoN3pOUDd3S1E?oc=5",
      "https://sports.yahoo.com/article/norris-moves-closer-title-verstappen-054654549.html",
      "https://sports.yahoo.com/article/lando-norris-oscar-piastri-disqualified-094551593.html"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/sport/formula1/articles/cr7l5v2exv0o?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.994,
      "consensus": 0.789,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.786,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Lando Norris and Oscar Piastri of McLaren have been disqualified from the Las Vegas Grand Prix due to technical infringements. The decision removes their results from the race and impacts McLaren's standing in the ongoing championship. The team has not yet announced if it will appeal the ruling.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story provides awareness about the disqualification of McLaren drivers from the Las Vegas Grand Prix due to technical infringements. However, it lacks depth and does not offer insights into what these technical infringements were or how they could be avoided in the future.",
    "constructiveness_source": "gpt",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "Court Blocks Trump Administration’s Expansion of Fast-Track Deportations",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Sun, 23 Nov 2025 00:34:00 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "Globe and Mail",
      "The Guardian"
    ],
    "domains": [
      "news.google.com",
      "theguardian.com"
    ],
    "snippets": [
      "Trump administration cannot expand rapid deportations, US appeals court rules Reuters",
      "Trump administration cannot expand fast-track deportations, U.S. appeals court rules The Globe and Mail",
      "Federal appeals court declines to put hold on lower court’s finding that administration violated migrants’ due process A federal appeals court on Saturday declined to clear the way for Donald Trump’s administration to expand a fast-track deportation process to allow for the expedited removal of immi"
    ],
    "image_url": "",
    "titles": [
      "Trump administration cannot expand rapid deportations, US appeals court rules - Reuters",
      "Trump administration cannot expand fast-track deportations, U.S. appeals court rules - The Globe and Mail",
      "Court rules Trump can’t expand fast-track deportation process"
    ],
    "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxOenVYaVllU2NUejR2dXJXMmxuYjdjelVoUmMwOS12b3VuLW0yX01zS3dpM3lXMGtWWWs5UWNYTmg4NkpvZFowT0l6YThER0FkdnVrS3lLS2FlWUYzbVVETUJSRm5Uck1JUXl0QnBhN0pvNGx3OFhZWjlybHpnWmZLaWJCV285Q211U2xZTFVLbFQ4VkQyYkRJQngzNnZGOEJZa2NhVzZVbVNEaWh3ekhWZ3lGeDNBb2FQdkNKNFF3?oc=5",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMitgFBVV95cUxORDJUby1YNHhxemVFR3plTURBTnZ3NXZTcHVsZklmV2FsUTBlNFY1VXhSZFNjNzBkUTBRX3hnSlRNWnF1V3VEc3ZhTm1keVR2SmZvUjhqazNfZmx4T1RNS2RPSlY4VFppd3dGVXp0ZEVZT2xDVXFoX3JPVmdBZEF6eEgzVHBoU1FsNnJVXzd1OWsxelR4S3dxcEZjeFMxYlJrRXQ4WG1wMnFoU0tBY3l3ejhzaUJ0UQ?oc=5",
      "https://www.theguardian.com/us-news/2025/nov/22/trump-administration-fast-track-deportation-process"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMivgFBVV95cUxOenVYaVllU2NUejR2dXJXMmxuYjdjelVoUmMwOS12b3VuLW0yX01zS3dpM3lXMGtWWWs5UWNYTmg4NkpvZFowT0l6YThER0FkdnVrS3lLS2FlWUYzbVVETUJSRm5Uck1JUXl0QnBhN0pvNGx3OFhZWjlybHpnWmZLaWJCV285Q211U2xZTFVLbFQ4VkQyYkRJQngzNnZGOEJZa2NhVzZVbVNEaWh3ekhWZ3lGeDNBb2FQdkNKNFF3?oc=5",
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.82,
      "consensus": 0.769,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.783,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A U.S. federal appeals court has ruled that the Trump administration cannot expand the use of fast-track deportations. The court declined to pause a lower court’s decision, which found that the administration’s plan violated migrants’ due process rights. As a result, the expansion of expedited removals remains blocked.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The story informs about a significant court ruling, providing useful context about the Trump administration's immigration policies and how they are being challenged. It increases clarity around the legal system and the rights of migrants, contributing to the reader's understanding of these issues.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "G20 Adopts Climate and Debt Declaration Despite US Boycott at South Africa Summi",
    "domain": "general",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Sat, 22 Nov 2025 18:09:05 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Deutsche Welle",
      "Reuters"
    ],
    "domains": [
      "aljazeera.com",
      "dw.com",
      "news.google.com"
    ],
    "snippets": [
      "World leaders broke with tradition and quickly adopted a new declaration at the start of the G20 summit.",
      "It is unusual for world leaders to adopt a declaration at the start of the G20. Officials from G20 summit host South Africa said Washington had pressured them not to adopt a declaration in its absence.",
      "G20 summit in South Africa adopts declaration despite US boycott, opposition Reuters"
    ],
    "image_url": "",
    "titles": [
      "G20 leaders adopt new declaration, even as US boycotts summit",
      "G20 adopts declaration despite US absence",
      "G20 summit in South Africa adopts declaration despite US boycott, opposition - Reuters"
    ],
    "url": "https://www.aljazeera.com/video/newsfeed/2025/11/22/g20-leaders-adopt-new-declaration-even-as-us-boycotts-summit?traffic_source=rss",
    "alternate_urls": [
      "https://www.dw.com/en/g20-adopts-declaration-despite-us-absence/a-74850499?maca=en-rss-en-top-1022-rdf",
      "https://news.google.com/rss/articles/CBMizAFBVV95cUxPb3hRNU9yVldsQ1ZyLWVOWmhjSk4yZUZfcmhjUWlraHRlQWlUVzNUMjVhQ0hxQTAzbms4TTFDbFNHRTdBSjlGWDJhaW5qSUJ1RkVtaWR4QnFPQVZIVElRaW5JcWJXS2tpTHRNUVJFQ2pISWs2VnpDY3Ywc1pLcG5vaHpuNV9zV1BzU0ZtbHdKRjEwd2J0YUZNclZsUHZ3R3pDZVktTzlTX2tlRHIzejl1OTVLcHAyM2lKTnRLSzMxbU9iSkh2aXlOV0tabzM?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/video/newsfeed/2025/11/22/g20-leaders-adopt-new-declaration-even-as-us-boycotts-summit?traffic_source=rss",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.717,
      "consensus": 0.789,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.76,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "At the G20 summit in South Africa, world leaders swiftly adopted a new declaration at the start of the meeting, despite opposition and a boycott from the United States. The declaration calls for increased international support to address the climate crisis and urges efforts to reduce the debt burden on poorer countries. The agreement was reached more quickly than in previous years.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it provides useful information about the international response to the climate crisis and debt issues. It increases awareness about the positions of different countries, particularly the US, and the progress being made at the G20 summit. However, it doesn't provide specific solutions or actionable insights for the reader.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "UK to Freeze Regulated Rail Fares in 2026 for First Time in 30 Years",
    "domain": "business",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Sun, 23 Nov 2025 09:49:49 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Financial Times",
      "The Guardian"
    ],
    "domains": [
      "bbc.com",
      "ft.com",
      "theguardian.com"
    ],
    "snippets": [
      "Regulated fares, which include season tickets and off-peak returns, will not see annual price rises for the first time in 30 years, the government announces.",
      "Officials said season ticket holders on some of Britain’s busiest routes would save hundreds of pounds annually",
      "Chancellor will confirm the measure, intended to help commuters on expensive routes, in her budget speech Rail fares in England will not be increased in 2026, the government has announced, surprising passengers with the first fare freeze in 30 years. The chancellor, Rachel Reeves, will confirm a fre"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/ae0d/live/bc4bec00-c84b-11f0-9fb5-5f3a3703a365.jpg",
    "titles": [
      "Rail fares to be frozen in England next year",
      "Rail fares in England to be frozen in 2026",
      "Relief for rail passengers as fare freeze in England announced for 2026"
    ],
    "url": "https://www.bbc.com/news/articles/cwygx71g3n7o?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://www.ft.com/content/4e65d8d5-323b-4e76-9026-5594ef563ad6",
      "https://www.theguardian.com/money/2025/nov/22/rail-passengers-freeze-fares-england-2026-budget"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/news/articles/cwygx71g3n7o?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.994,
      "consensus": 0.789,
      "constructiveness": 0.02,
      "proximity": 0.5
    },
    "score": 0.745,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The UK government has announced that regulated rail fares in England, including season tickets and off-peak returns, will be frozen in 2026, marking the first annual fare freeze in 30 years. The measure, to be confirmed by Chancellor Rachel Reeves in her budget speech, is expected to save commuters on busy routes hundreds of pounds annually.",
    "constructiveness_score": 0.02,
    "constructiveness_reason": "semantic: pos_sim=0.08, neg_sim=0.00; semantic_boost=0.02",
    "constructiveness_source": "heuristic",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Gotham FC Wins First NWSL Championship With Victory Over Washington Spirit",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Sun, 23 Nov 2025 01:18:29 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Bleacher Report"
    ],
    "domains": [
      "espn.com",
      "news.google.com"
    ],
    "snippets": [
      "On Saturday night, Gotham's stars shone brightest when it counted most.",
      "Gotham FC Beats Spirit to Win Historic NWSL Championship, Top Highlights and Photos Bleacher Report"
    ],
    "image_url": "",
    "titles": [
      "Gotham rides series of magic moments to win NWSL championship",
      "Gotham FC Beats Spirit to Win Historic NWSL Championship, Top Highlights and Photos - Bleacher Report"
    ],
    "url": "https://www.espn.com/soccer/story/_/id/47067322/gotham-rides-series-magic-moments-win-nwsl-championship",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiwgFBVV95cUxPczRVa1Nod2ZhRm5YZ1ZyM2s3b1djMDNqa24wdGVwemtpOXZvVmRMVEJ0VTNJRm0zYmlUNjBEdDFSZ0FNWlNXcEdSMWJULUQyd2x3TFVWa0JoeGFvVG9oei0wN3hfa2hjWlZicTlsSUhoUnFEVkxGY3hCQTUxN1FkbDMzNGtIS0N3cy1HbFp2ZHB1bzVVQTRwRGdrdjdQX3Q5b2dtd1IyZnpsNFFGczFRejY1NTY1d0xvNWltaUEwdEpsZw?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/soccer/story/_/id/47067322/gotham-rides-series-magic-moments-win-nwsl-championship",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.924,
      "consensus": 0.591,
      "constructiveness": 0.6,
      "proximity": 0.75
    },
    "score": 0.725,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Gotham FC defeated the Washington Spirit to win the NWSL Championship on Saturday night. This marks Gotham FC's first-ever league title. The match featured standout performances from Gotham FC players, securing their historic victory. The team celebrated their win with fans and teammates following the final whistle.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story informs readers about Gotham FC's victory over the Washington Spirit, marking their first-ever league title. It provides useful context about the match and the standout performances from Gotham FC players. However, it does not delve into the strategies or innovations that led to the team's success.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Airlines Suspend Flights to Venezuela After US FAA Issues Security Warning",
    "domain": "business",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Sun, 23 Nov 2025 03:20:23 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Reuters",
      "Bloomberg"
    ],
    "domains": [
      "aljazeera.com",
      "news.google.com"
    ],
    "snippets": [
      "Flight suspensions come after US regulator warned planes of security risk in the airspace in and around Venezuela.",
      "Several international airlines cancel their flights in Venezuela after US warning Reuters",
      "Airlines Cancel Venezuela Flights as US Warns of Security Risks Bloomberg.com"
    ],
    "image_url": "",
    "titles": [
      "Airlines cancel Venezuela flights amid US warning, military buildup",
      "Several international airlines cancel their flights in Venezuela after US warning - Reuters",
      "Airlines Cancel Venezuela Flights as US Warns of Security Risks - Bloomberg.com"
    ],
    "url": "https://www.aljazeera.com/news/2025/11/23/airlines-cancel-flights-to-venezuela-amid-us-military-buildup?traffic_source=rss",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiywFBVV95cUxQTkZ3S2R0V09nMlotT0VDMVBqbl9vQUdIMkZsaHpIYXJBM0d6TW55d3lhMG9LbXpNOUpOcEhkZ3BiVzBMU292V3A1dWhncnFPQXF6TXk4VWhMbjV3RXBHWmpXMy1YdEJuVlRQRWhZUVk3TkRadUs2NktFVWdlYi1uS1J1S3ktRUZ4TTI5ZW02LTRmVVR5eHdGaEtSNEZRNzFSMWl2Sm1Wc3YzWFR0VUk1dEt0cjh5YjhQRmJsUGMtT0taM3BuUVRQbFQ3UQ?oc=5",
      "https://news.google.com/rss/articles/CBMisAFBVV95cUxOdDdjRlBJQnpLTVVIWkR4Y1UtaW9qWmRIbDUtWURXbnBKVXZMd3N0RUpQSUgtYlBoNFIyM0FQS1RXVUpRczdmNkk3dEJEVnV3d0s5M0hGQmp3WURoNFNMUk1abkpKamVnbXY0RmJGNFZHT2tLWjlGN2FCSDVLY3I2WE8wWUZObnV2WnV6Q3hTd2tncGxZcHpnclNhQjBMNG44NVJPM0NhUndreE82VHRSRQ?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2025/11/23/airlines-cancel-flights-to-venezuela-amid-us-military-buildup?traffic_source=rss",
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.868,
      "consensus": 0.769,
      "constructiveness": 0.05,
      "proximity": 0.5
    },
    "score": 0.717,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Several international airlines have suspended flights to and from Venezuela after the US Federal Aviation Administration warned of security risks in the country's airspace. The advisory cited safety concerns for commercial planes operating in and around Venezuela. The cancellations affect multiple carriers and are in effect until further notice.",
    "constructiveness_score": 0.05,
    "constructiveness_reason": "keywords (1): plan; semantic: pos_sim=0.00, neg_sim=0.09",
    "constructiveness_source": "heuristic",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "McLaren Drivers Face Possible Disqualification from Las Vegas Grand Prix",
    "domain": "sports",
    "source_domain": "sports.yahoo.com",
    "location": "national",
    "published": "Sun, 23 Nov 2025 09:48:17 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports",
      "Sky Sports"
    ],
    "domains": [
      "sports.yahoo.com",
      "skysports.com"
    ],
    "snippets": [
      "McLaren isn’t the first team to fall foul of F1’s plank wear rules, but it could end up being the most costly given the points lost for both Lando Norris and Oscar Piastri in the Las Vegas GP. Here’s an explanation of the rules McLaren broke",
      "Craig Slaters explains why both Lando Norris and Oscar Piastri might be disqualified from the Las Vegas Grand Prix, which would have a 'massive impact' on the F1 Drivers' Championship title race."
    ],
    "image_url": "",
    "titles": [
      "How McLaren broke F1's plank wear rules in Las Vegas GP",
      "Explained: Why McLaren duo broke rules at Las Vegas GP - and impact on title race"
    ],
    "url": "https://sports.yahoo.com/article/mclaren-broke-f1s-plank-wear-094817846.html",
    "alternate_urls": [
      "https://www.skysports.com/watch/video/13474390/both-mclaren-drivers-face-las-vegas-grand-prix-disqualification-due-to-skid-block-regulations"
    ],
    "location_scope": "national",
    "link": "https://sports.yahoo.com/article/mclaren-broke-f1s-plank-wear-094817846.html",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.994,
      "consensus": 0.591,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.704,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Both McLaren drivers, Lando Norris and Oscar Piastri, face possible disqualification from the Las Vegas Grand Prix due to violations of F1's plank wear regulations. If disqualified, McLaren would lose valuable points, significantly affecting the Drivers' Championship standings. The final decision on their disqualification is pending.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story raises awareness about the potential disqualification of McLaren drivers due to violations of F1's plank wear regulations. However, it falls short in providing deeper understanding or actionable insights as it does not explain what these regulations are or how the drivers violated them.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Cyclone Hits Northern Territory, Causes Damage and Power Outages, No Injuries",
    "domain": "general",
    "source_domain": "dw.com",
    "location": "global",
    "published": "2025-11-23T06:49:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "Reuters"
    ],
    "domains": [
      "dw.com",
      "news.google.com"
    ],
    "snippets": [
      "Residents of Australia's Northern Territory spent their Sunday morning assessing the damage from an intense cyclone that struck the region overnight. No injuries have been reported.",
      "Thousands of Australians without power after tropical cyclone hits Northern Territory Reuters"
    ],
    "image_url": "",
    "titles": [
      "Cyclone Fina batters Australia's Northern Territory",
      "Thousands of Australians without power after tropical cyclone hits Northern Territory - Reuters"
    ],
    "url": "https://www.dw.com/en/cyclone-fina-batters-australia-s-northern-territory/a-74851157?maca=en-rss-en-top-1022-rdf",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiygFBVV95cUxPNEFYZ0ZadjR0RHNwaS1kZ2ZfTlFEUHF0clZmOGE0SmhacV9zOEFOZm53OUNsWjhiQXd3MXpZYVVOZzd6Q1ZaSkFXel9EUGRIeEJWSFVlVHQtajVRcjZMZDV3MER6M0RkdlhZemc1TS15RHZNTnBqYzlUWFFEbk1wNTRzOUE4SDZOaHA2LUtMNkNjZTVVNkxwd05uOUZWQjBjODRUaDdKTGM0bE1DSXRmTERybDJpWE9XZkZWMEJsNzFoeF9FYmNad0Vn?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.dw.com/en/cyclone-fina-batters-australia-s-northern-territory/a-74851157?maca=en-rss-en-top-1022-rdf",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.934,
      "consensus": 0.591,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.702,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A powerful cyclone struck Australia's Northern Territory overnight, causing widespread damage and leaving thousands without power. Residents spent Sunday morning assessing the aftermath. Authorities report that no injuries have occurred. Repair crews are working to restore electricity to affected areas.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story is constructive as it informs readers about a significant event, its impacts, and the ongoing response. However, it doesn't provide any deeper understanding or actionable insights, or highlight any progress or solutions.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Floods in Vietnam Cause $343 Million in Damages Across Five Provinces",
    "domain": "general",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Sun, 23 Nov 2025 06:45:05 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "BBC"
    ],
    "domains": [
      "aljazeera.com",
      "bbc.com"
    ],
    "snippets": [
      "Vietnamese government estimates economic losses of $343m across five provinces due to the floods.",
      "Days of torrential rain leaves vast swathes of the country inundated and facing landslides."
    ],
    "image_url": "",
    "titles": [
      "Death toll from Vietnam floods rises to 90, several still missing",
      "Vietnam floods leave at least 90 dead and 12 missing"
    ],
    "url": "https://www.aljazeera.com/news/2025/11/23/death-toll-from-vietnam-floods-rises-to-90-several-still-missing?traffic_source=rss",
    "alternate_urls": [
      "https://www.bbc.com/news/articles/cwywl8g31g7o?at_medium=RSS&at_campaign=rss"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2025/11/23/death-toll-from-vietnam-floods-rises-to-90-several-still-missing?traffic_source=rss",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.932,
      "consensus": 0.591,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.701,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Floods caused by days of heavy rain in Vietnam have resulted in estimated economic losses of $343 million across five provinces. Large areas remain flooded, and landslides have been reported. Authorities are assessing damage and coordinating relief efforts as affected regions continue to recover.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information about the impact of the floods in Vietnam, contributing to the reader's understanding of the situation. However, it does not report on any solutions or improvements, nor does it provide deep insights into the causes or trends of such disasters.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Indian Trade Unions to Protest Nationwide Against New Labour Codes",
    "domain": "general",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Sat, 22 Nov 2025 19:38:53 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Reuters"
    ],
    "domains": [
      "aljazeera.com",
      "news.google.com"
    ],
    "snippets": [
      "The unions demand the laws be withdrawn before nationwide protests they plan to hold on Wednesday.",
      "India trade unions condemn new labour codes, plan nationwide protests Reuters"
    ],
    "image_url": "",
    "titles": [
      "Indian trade unions oppose new labour codes, call for demonstrations",
      "India trade unions condemn new labour codes, plan nationwide protests - Reuters"
    ],
    "url": "https://www.aljazeera.com/news/2025/11/22/indian-trade-unions-oppose-new-labour-codes-call-for-demonstrations?traffic_source=rss",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMixgFBVV95cUxONzlZOERJLVhmYWRfV250aFBPZnRpQmhzYXAtQllUWHU1N3N2RnZnTzAtSlZNQnBtbE1hdUZtOHVlSnRwWDJIOEl5VHpMdnJpcFVUWUpJVlR3OVp0djVleUx3SFAzSEhXYkNwSi1yQ3dLSTdMMnhFOWwwR2ZIUTlGbGxBTmRBbTZ0eURyTGFxZXRsQkpNLWViQWZ2UWU1dVNMbGRmcjl4Z2pzaGhsV0FoQjFrUDZ0N3p0M0lJbVhLNWFENjd1M0E?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2025/11/22/indian-trade-unions-oppose-new-labour-codes-call-for-demonstrations?traffic_source=rss",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.74,
      "consensus": 0.591,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.68,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Several Indian trade unions have condemned the government's new labour codes, calling for their withdrawal. The unions have announced plans to hold nationwide protests on Wednesday to oppose the laws. The government has not agreed to withdraw the codes, and the protests are set to proceed as scheduled.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story is constructive as it informs readers about a significant upcoming event and the reasons behind it. However, it doesn't provide a deep understanding of the issue or highlight any solutions or progress.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Drone Sightings Temporarily Disrupt Flights at Eindhoven Airport",
    "domain": "general",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Sat, 22 Nov 2025 22:03:37 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Reuters"
    ],
    "domains": [
      "aljazeera.com",
      "news.google.com"
    ],
    "snippets": [
      "Drone sightings caused suspension of air traffic at Eindhoven airport, impacting both civilian and military operations.",
      "Drone sightings disrupt traffic at Eindhoven airport Reuters"
    ],
    "image_url": "",
    "titles": [
      "Air traffic suspended at Netherlands airport after drone sightings",
      "Drone sightings disrupt traffic at Eindhoven airport - Reuters"
    ],
    "url": "https://www.aljazeera.com/news/2025/11/22/air-traffic-suspended-at-netherlands-airport-after-drone-sightings?traffic_source=rss",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiywFBVV95cUxPNVJ5NEV5dXd1cVE3cHJhejhDUWREYzI1ZGdZelZ2US1PdnBTSXJSRmlGTWpOT2Y0ejdwOXViRmw1c3R1aS14aDlRakpKSEhZQ29LbVhhNnNfQkdKZWtGcUl2dG5uUVByc1hFQkdXUnRCUkZBNG9YZnF1SFNSNnRIU1VhR1B1ZHhHWUNYM3FmN2YzSUp2bEZaZmNLVmozWS1qYnBadWxaN0tKX0l5QW52Q1Z1dTdsNDFRM0NQaXlLTVdEVHVreFEwWTJmUQ?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2025/11/22/air-traffic-suspended-at-netherlands-airport-after-drone-sightings?traffic_source=rss",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.778,
      "consensus": 0.591,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.668,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Drone sightings at Eindhoven Airport led to the suspension of both civilian and military air traffic. Authorities halted operations to ensure safety while investigating the incidents. Flights were temporarily disrupted, but services resumed after no further drone activity was detected. The cause and source of the drones remain under investigation.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about the incident and the immediate response. However, it lacks depth, doesn't offer actionable insights, and doesn't report on any solutions or progress.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Benavidez Stops Yarde in Seventh to Retain WBC Light-Heavyweight Title",
    "domain": "sports",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Sun, 23 Nov 2025 04:00:25 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Sky Sports"
    ],
    "domains": [
      "bbc.com",
      "skysports.com"
    ],
    "snippets": [
      "Briton Anthony Yarde's third shot at a world title ended in disappointment as he was stopped by WBC light-heavyweight champion David Benavidez.",
      "Anthony Yarde suffered defeat in a world title fight for the third time in his career as he was stopped in the seventh round by David Benavidez in Riyadh."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/a92a/live/5ac4ece0-c81c-11f0-bdd1-af2cff3bf70d.jpg",
    "titles": [
      "Bloodied Yarde stopped in third world title heartbreak",
      "Yarde stopped by Benavidez as third world title bid ends in defeat"
    ],
    "url": "https://www.bbc.com/sport/boxing/articles/cy4733xz8v2o?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://www.skysports.com/boxing/news/12040/13474369/anthony-yarde-stopped-by-david-benavidez-as-third-world-title-bid-ends-in-defeat"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/sport/boxing/articles/cy4733xz8v2o?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.881,
      "consensus": 0.591,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.668,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Anthony Yarde was defeated by David Benavidez in the seventh round during their WBC light-heavyweight title fight in Riyadh. This marks Yarde's third unsuccessful attempt at winning a world title. Benavidez retains his WBC championship with this victory.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "The story provides basic awareness of the match result but doesn't offer deeper insight or understanding about the match or its significance. It doesn't report on progress or solutions, and doesn't increase clarity around systems, causes, trends, or impacts.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Roslovic Scores Twice as Oilers Defeat Panthers in Stanley Cup Final Rematch",
    "domain": "sports",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Sun, 23 Nov 2025 05:42:15 GMT",
    "source": "NHL",
    "sources": [
      "NHL",
      "Sportsnet"
    ],
    "domains": [
      "news.google.com",
      "sportsnet.ca"
    ],
    "snippets": [
      "Roslovic scores twice, Oilers hold off Panthers in Stanley Cup Final rematch NHL.com",
      "Saturday’s win over the Panthers feels a little more meaningful for the Oilers, not just because of the opponent, but because of the way they won."
    ],
    "image_url": "",
    "titles": [
      "Roslovic scores twice, Oilers hold off Panthers in Stanley Cup Final rematch - NHL.com",
      "Skinner, Oilers bounce back against Panthers in Cup Final rematch"
    ],
    "url": "https://news.google.com/rss/articles/CBMijgFBVV95cUxNVFJ5eU01RVRsYnI4eGNvbzJSYS1mY29BUFA0LWlmZTRDY3hKODNsTHctSnc0MWUtYVdTSGxEYTRiQ0k5Q250SGtmOElDbmpkZTZoVmtLdGZyb2huNkFWaUY5bUJlZlY4NzFHREJWTjNtVlllY3BIRnFRQVMzTUxlemdkamtFc2FRWXNDOEN3?oc=5",
    "alternate_urls": [],
    "location_scope": "national",
    "link": "https://news.google.com/rss/articles/CBMijgFBVV95cUxNVFJ5eU01RVRsYnI4eGNvbzJSYS1mY29BUFA0LWlmZTRDY3hKODNsTHctSnc0MWUtYVdTSGxEYTRiQ0k5Q250SGtmOElDbmpkZTZoVmtLdGZyb2huNkFWaUY5bUJlZlY4NzFHREJWTjNtVlllY3BIRnFRQVMzTUxlemdkamtFc2FRWXNDOEN3?oc=5",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.912,
      "consensus": 0.591,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.667,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Jack Roslovic scored two goals as the Edmonton Oilers defeated the Florida Panthers in a rematch of the Stanley Cup Final. The Oilers held off a late push from the Panthers to secure the win. This victory marks a notable result for Edmonton against last season’s championship opponent.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness of the match result but doesn't offer deeper insight or understanding about the game or its significance. It doesn't report on progress or solutions, and doesn't increase clarity around systems, causes, trends, or impacts.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Liverpool Lose 3-0 to Nottingham Forest as Pressure Mounts on Arne Slot",
    "domain": "business",
    "source_domain": "sports.yahoo.com",
    "location": "national",
    "published": "Sun, 23 Nov 2025 09:45:00 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports",
      "Forbes"
    ],
    "domains": [
      "sports.yahoo.com",
      "forbes.com"
    ],
    "snippets": [
      "Liverpool fell to a shambolic 3-0 loss to Nottingham Forest on Saturday at Anfield. Igor Jesus, Nicola Savona and Morgan Gibbs-White all scored for Forest, as they condemned the Reds to their sixth d...",
      "Liverpool has lost six of its last seven Premier League matches with Arne Slot coming under increasing pressure."
    ],
    "image_url": "",
    "titles": [
      "Who will be the next manager of Liverpool if Arne Slot is sacked?",
      "Could Arne Slot’s Position As Liverpool Manager Be At Risk?"
    ],
    "url": "https://sports.yahoo.com/article/next-manager-liverpool-arne-slot-094500805.html",
    "alternate_urls": [
      "https://www.forbes.com/sites/grahamruthven/2025/11/22/could-arne-slots-position-as-liverpool-manager-be-at-risk/"
    ],
    "location_scope": "national",
    "link": "https://sports.yahoo.com/article/next-manager-liverpool-arne-slot-094500805.html",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.992,
      "consensus": 0.591,
      "constructiveness": 0.022,
      "proximity": 0.5
    },
    "score": 0.656,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Liverpool lost 3-0 to Nottingham Forest at Anfield, with goals from Igor Jesus, Nicola Savona, and Morgan Gibbs-White. This defeat marks Liverpool's sixth loss in their last seven Premier League matches. Manager Arne Slot is facing growing pressure as the team’s poor run continues.",
    "constructiveness_score": 0.022,
    "constructiveness_reason": "semantic: pos_sim=0.09, neg_sim=0.00; semantic_boost=0.02",
    "constructiveness_source": "heuristic",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "US Retail Sales Growth Slows in September but Remains Strong for the Quarter",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Sun, 23 Nov 2025 07:43:00 GMT",
    "source": "Bloomberg",
    "sources": [
      "Bloomberg",
      "Financial Post"
    ],
    "domains": [
      "news.google.com",
      "financialpost.com"
    ],
    "snippets": [
      "US Retail Sales Are Proving Resilient While Risks Mount Bloomberg.com",
      "US retail sales growth likely moderated a touch in September, capping an otherwise solid quarter of spending by consumers who are nonetheless frustrated by high prices and anxious about job security."
    ],
    "image_url": "",
    "titles": [
      "US Retail Sales Are Proving Resilient While Risks Mount - Bloomberg.com",
      "US Retail Sales Are Proving Resilient While Risks Mount"
    ],
    "url": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxQUDJjNnczRkpzSld0c19kTlc0dnoxcGJiUVdKY0V2d25sRVc1Wkc5ODUxbFhad0YydEo4cTRhYndZbnh0YkNseDdMNTExMlF6aUZqRlFTMUFGTTdheWxBYnlOQ21za0c1dHJ3VTlzQlFpVmZmd1U3X1d3RzJVQUJCU3NzMnQ0ZHN0bi1zbGxqYnUzNnlTcVNNUzlJRm1EM1ljQVdhelJid3dpdw?oc=5",
    "alternate_urls": [
      "https://financialpost.com/pmn/business-pmn/us-retail-sales-are-proving-resilient-while-risks-mount"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMiqgFBVV95cUxQUDJjNnczRkpzSld0c19kTlc0dnoxcGJiUVdKY0V2d25sRVc1Wkc5ODUxbFhad0YydEo4cTRhYndZbnh0YkNseDdMNTExMlF6aUZqRlFTMUFGTTdheWxBYnlOQ21za0c1dHJ3VTlzQlFpVmZmd1U3X1d3RzJVQUJCU3NzMnQ0ZHN0bi1zbGxqYnUzNnlTcVNNUzlJRm1EM1ljQVdhelJid3dpdw?oc=5",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.951,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.652,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "US retail sales growth slowed slightly in September but remained strong overall for the quarter. Consumers continued to spend despite concerns about high prices and job security. The data indicates ongoing resilience in consumer spending, even as economic risks persist.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.06, neg_sim=0.07",
    "constructiveness_source": "heuristic",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Early Black Friday 2025 Deals Launch, Featuring Discounts on AirPods Pro 3",
    "domain": "technology",
    "source_domain": "theguardian.com",
    "location": "global",
    "published": "Sun, 23 Nov 2025 07:00:01 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "The Verge"
    ],
    "domains": [
      "theguardian.com",
      "theverge.com"
    ],
    "snippets": [
      "Want to avoid dud discounts? We’ve rounded up genuinely good Black Friday 2025 offers on our favourite products across skincare, hair care and makeup • The best early Black Friday deals on the products we love • How to shop smart this Black Friday As the nights draw in and the weather gets colder, t",
      "Black Friday is the most anticipated day of the year for bargain hunters. While there’s still some time to go before November 28th, we’ve already found a healthy selection of early discounts, allowing you to get a jump on your holiday shopping. Right now, for instance, the new AirPods Pro 3 are rece"
    ],
    "image_url": "https://i.guim.co.uk/img/media/ac94c1fcaaea47992d83837c6b2f26eeb6ff1674/0_0_5000_4000/master/5000.jpg?width=140&quality=85&auto=format&fit=max&s=b3b57c6dcc18e2d7fe2566d2c190b652",
    "titles": [
      "The best Black Friday beauty deals in the UK, from LED face masks to hair dryers",
      "The absolute best Black Friday deals we’ve found (so far)"
    ],
    "url": "https://www.theguardian.com/thefilter/2025/nov/23/best-black-friday-beauty-deals-2025-uk",
    "alternate_urls": [
      "https://www.theverge.com/tech/814345/black-friday-best-early-deals-2025"
    ],
    "location_scope": "global",
    "link": "https://www.theguardian.com/thefilter/2025/nov/23/best-black-friday-beauty-deals-2025-uk",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.937,
      "consensus": 0.591,
      "constructiveness": 0.019,
      "proximity": 0.5
    },
    "score": 0.651,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Early Black Friday 2025 deals are already available across categories like skincare, hair care, makeup, and electronics. Notable discounts include offers on popular products such as the new AirPods Pro 3. Shoppers can access these early sales ahead of the official Black Friday date on November 28, allowing for advanced holiday shopping and savings.",
    "constructiveness_score": 0.019,
    "constructiveness_reason": "semantic: pos_sim=0.14, neg_sim=0.06; semantic_boost=0.02",
    "constructiveness_source": "heuristic",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "College Football Bowl Eligibility Update: Top 25 Rankings After Week 13",
    "domain": "business",
    "source_domain": "forbes.com",
    "location": "global",
    "published": "Sun, 23 Nov 2025 01:57:00 -0500",
    "source": "Forbes",
    "sources": [
      "Forbes",
      "Bleacher Report"
    ],
    "domains": [
      "forbes.com",
      "news.google.com"
    ],
    "snippets": [
      "The College Football Bowl Eligibility Tracker is your guide to following which teams will reach the postseason heading into the final weekend of the regular season.",
      "B/R's 2025 College Football Experts Top 25 Rankings After Week 13 Bleacher Report"
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/692293a6518d2df11f415590/0x0.jpg?width=960",
    "titles": [
      "2025 College Football Bowl Eligibility Tracker: Week 14",
      "B/R's 2025 College Football Experts Top 25 Rankings After Week 13 - Bleacher Report"
    ],
    "url": "https://www.forbes.com/sites/erikbuchinger/2025/11/23/2025-college-football-bowl-eligibility-tracker-week-14/",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMirAFBVV95cUxQdmFpdmszMzZJNm5GU2lfOWdISnBoQmRoSTl0RktGU0JEaVF6eEdkSGF4bzgxZ3ZpUFhYRkdZY2lKbGlZRGpDZk5zUGxXaEhEMzF4TmM2YkJhMDdWZy01dVBkRkpPYUY3bV90TGctRkk2azNNSm5jX0JBM2t2M3BNRFJZMnp2Zkl6Y1MtX3RQZDhLWGJDVGNacUVfeXhvdWVmbnVhRVA3MmJhTnVx?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.forbes.com/sites/erikbuchinger/2025/11/23/2025-college-football-bowl-eligibility-tracker-week-14/",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.936,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.642,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Heading into the final weekend of the college football regular season, several teams are competing to secure bowl eligibility, which requires at least six wins. The Bowl Eligibility Tracker monitors which teams have qualified and which are still in contention. After Week 13, Bleacher Report released updated Top 25 rankings reflecting recent results and postseason prospects. The final standings will determine bowl game matchups.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.14",
    "constructiveness_source": "heuristic",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Lando Norris Takes Pole for 2025 F1 Las Vegas Grand Prix; Grid Announced",
    "domain": "business",
    "source_domain": "cbssports.com",
    "location": "national",
    "published": "Sun, 23 Nov 2025 02:57:45 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Forbes"
    ],
    "domains": [
      "cbssports.com",
      "forbes.com"
    ],
    "snippets": [
      "SportsLine's Mike McClure reveals his picks and F1 props for 2025 Las Vegas Grand Prix at Las Vegas Strip Street Circuit",
      "Lando Norris of McLaren secured pole position for the 2025 F1 Las Vegas Grand Prix. See the full starting grid for Saturday's race."
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/11/23/99d08081-79d9-4f73-bfa9-7b20741456f8/lando-norris-formula-1-imagn-images.jpg",
    "titles": [
      "2025 Las Vegas Grand Prix odds, Formula 1 picks, props, bets: Expert backs huge F1 longshot",
      "Starting Grid For The 2025 F1 Las Vegas Grand Prix"
    ],
    "url": "https://www.cbssports.com/motor-sports/news/2025-las-vegas-grand-prix-odds-formula-1-picks-props-best-bets/",
    "alternate_urls": [
      "https://www.forbes.com/sites/yaraelshebiny/2025/11/22/starting-grid-for-the-2025-f1-las-vegas-grand-prix/"
    ],
    "location_scope": "national",
    "link": "https://www.cbssports.com/motor-sports/news/2025-las-vegas-grand-prix-odds-formula-1-picks-props-best-bets/",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.862,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.627,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Lando Norris of McLaren has secured pole position for the 2025 Formula 1 Las Vegas Grand Prix at the Las Vegas Strip Street Circuit. The full starting grid for Saturday's race has been announced. SportsLine's Mike McClure has also released his picks and betting props for the event. The race is set to take place as scheduled.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00",
    "constructiveness_source": "heuristic",
    "is_trending": false,
    "trending_score": 0.0
  }
]