[
  {
    "title": "Trump Revises Stance on Ukraine, Backs Territory Reclaim with NATO Support",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Tue, 23 Sep 2025 16:57:42 -0400",
    "source": "NPR",
    "sources": [
      "BBC",
      "Al Jazeera",
      "New York Times",
      "ABC News",
      "Axios",
      "The Guardian",
      "Financial Times",
      "NPR"
    ],
    "domains": [
      "www.npr.org",
      "www.ft.com",
      "www.bbc.com",
      "news.google.com",
      "www.aljazeera.com",
      "www.nytimes.com",
      "abcnews.go.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Last month, President Trump said Ukraine needed to be open to giving up some of its territory in peace talks with Russia. But those talks haven't happened. Now, he says Ukraine could win it all back.",
      "The US president says Ukraine can win back land with support from Nato and Europe, marking a major shift in his position.",
      "Trump previously said both Kyiv and Moscow would have to cede land to end Europe&#039;s deadliest war since World War II.",
      "<a href=\"https://news.google.com/rss/articles/CBMiekFVX3lxTE9ISERQbzZDaV96TXlsaXZ6NG1keUdBMnU2OTY2Rmw0SHVpdWxBZUoySUszSF9XWmFmSEdTYXdLMVRDM3p1RENCSjJyX1RQdkxQNjV3OTNnTW5EZEFSdUZxQU5UU0c1bERMSTJBd3REQlJxLW9mWWswbm1n?oc=5\" target=\"_blank\">In extraordinary shift, Trump says Ukraine can win war with Rus",
      "Zelenskyy thanked Trump for his efforts to bring an end to the war.",
      "US president signals change of stance and suggests Kyiv, with support from Europe and Nato, can restore its old borders",
      "<p>US president claims Russia is in ‘big economic trouble’ as he calls for Nato countries to stop imports of Russian oil</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/live/2025/sep/23/donald-trump-unga-autism-tylenol-us-politics-live-news-updates\">US politics live – latest updates</a></",
      "President Trump’s pivot could give him room to distance himself from a conflict that he once promised to solve in days or weeks."
    ],
    "image_url": "",
    "titles": [
      "Trump, in major shift, suggests Ukraine can win back territory long held by Russia",
      "Kyiv can win all of Ukraine back from Russia, Trump says",
      "In major shift, Trump says Ukraine can win back all territory from Russia",
      "In extraordinary shift, Trump says Ukraine can win war with Russia - Axios",
      "Trump admin live updates: In major shift, Trump says Ukraine can win back seized land",
      "Trump says Ukraine can win back all of its territory seized by Russia",
      "Trump says he believes Ukraine can regain all land lost to Russia since 2022 invasion",
      "In a Sudden Shift, Trump Says Ukraine Can Win the War With Russia"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.934,
      "consensus": 1.0,
      "constructiveness": 0.2,
      "proximity": 0.75
    },
    "score": 0.882,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "President Trump has shifted his stance on the conflict between Ukraine and Russia, now stating that Ukraine can reclaim its territory with support from NATO and Europe. This marks a significant change from his previous position, where he suggested both Kyiv and Moscow might need to cede land to end the conflict. Trump's updated view aligns with increased assistance for Ukraine and suggests a strategic distance from the conflict, which he once claimed he could resolve quickly. Ukrainian President Zelenskyy has expressed gratitude towards Trump for his efforts to end the war.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: effort, support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Man Convicted for Attempted Assassination of Trump, Faces Life Sentence",
    "domain": "sports",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Tue, 23 Sep 2025 14:43:17 -0400",
    "source": "NPR",
    "sources": [
      "Al Jazeera",
      "ABC News",
      "Forbes",
      "Axios",
      "The Guardian",
      "NPR"
    ],
    "domains": [
      "www.npr.org",
      "news.google.com",
      "www.forbes.com",
      "www.aljazeera.com",
      "abcnews.go.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Jurors convicted Routh on five charges, including last year's attempted assassination of Trump as he golfed at his South Florida course. Routh represented himself in court and faces life in prison.",
      "A US jury finds that Routh intended to kill then-presidential candidate Donald Trump last September.",
      "<a href=\"https://news.google.com/rss/articles/CBMihAFBVV95cUxQdEpTbnphd2daQU16UVd1Qzg3dWpNakFRS3dldEg3LVJWbFdITUd2dVNBT3FtM1oxbGEzM25tRlI5OWtyUG1HaFgwTzB2NVZHVFVXLWNHbl9ieGhJbXNWVG9ybTU5ZXVQd1BoUVBjbVJpZVZNM1BTQXJLRlNCekpfc0lxSkc?oc=5\" target=\"_blank\">Ryan Routh found guilty in Trump assassination a",
      "Ryan Routh, the man accused of trying to assassinate President Donald Trump on his West Palm Beach golf course last year, has been found guilty on all five counts.",
      "<p>Routh represented himself in trial over botched attempt on Trump’s life at West Palm Beach golf course </p><p>The man accused of trying to assassinate <a href=\"https://www.theguardian.com/us-news/donaldtrump\">Donald Trump</a> on his West Palm Beach golf course two months before Trump clinched his",
      "Routh attempted to stab himself in the neck with a pen after the guilty verdict was delivered."
    ],
    "image_url": "",
    "titles": [
      "Jury convicts Ryan Routh on all charges in attempted assassination of Donald Trump",
      "Ryan Routh found guilty of attempting to assassinate Trump in Florida",
      "Ryan Routh found guilty in Trump assassination attempt - Axios",
      "WATCH:  Ryan Routh guilty on all counts in Trump golf course assassination attempt",
      "Ryan Routh found guilty of 2024 attempted assassination of Trump in Florida",
      "Ryan Routh Found Guilty Of Assassination Attempt On Trump—Then Tries To Stab Himself"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.892,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.853,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Ryan Routh was convicted on five charges, including the attempted assassination of Donald Trump at a South Florida golf course last year. Representing himself in court, Routh now faces a life sentence. The jury concluded Routh intended to kill Trump during the incident. After the verdict, Routh attempted to stab himself in the neck with a pen.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "OpenAI and Oracle Launch $500B Stargate AI Project in Texas",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Tue, 23 Sep 2025 21:01:02 GMT",
    "source": "Axios",
    "sources": [
      "TechCrunch",
      "CNBC",
      "Financial Times",
      "Axios"
    ],
    "domains": [
      "techcrunch.com",
      "www.ft.com",
      "news.google.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMiekFVX3lxTE10cjBrMDkxZWZWbU1jekZrN3RrVklkTldxWGJSMG44eEdOcmVicXhSTTgzNU4wNmIxdS1zSVNiN1JsbTRiSjFsNjktX19GMFdkdk1XQmdwWFprQ3kybUZzOGZhN3h0VGw3UmNJU3pfUi13ZTlfeEctbEZB?oc=5\" target=\"_blank\">OpenAI announces five new sites for Stargate data center projec",
      "OpenAI and Oracle are betting big on America's AI future, bringing online the flagship site of the $500 billion Stargate program in Abilene, Texas.",
      "The agreements will take the cost of the high-profile data centre initiative to $400bn",
      "OpenAI is continuing to build out massive AI data centers to train and serve increasingly powerful AI models."
    ],
    "image_url": "",
    "titles": [
      "OpenAI announces five new sites for Stargate data center project - Axios",
      "OpenAI's first data center in $500B Stargate project is open in Texas, with sites coming in New Mexico and Ohio",
      "OpenAI expands Stargate AI project with five US sites",
      "OpenAI is building five new Stargate data centers with Oracle and SoftBank"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.916,
      "consensus": 0.908,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.799,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "OpenAI, in partnership with Oracle, has launched the flagship site of the $500 billion Stargate project in Abilene, Texas, marking a significant investment in the future of American AI. This initiative, which aims to expand AI data centers for training and deploying advanced AI models, will see its costs rise to $400 billion as it progresses.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: initiative, progress",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Cancels Meeting on Gov Shutdown, Blames Democrats",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Tue, 23 Sep 2025 12:30:23 -0400",
    "source": "NPR",
    "sources": [
      "CNBC",
      "Axios",
      "NPR"
    ],
    "domains": [
      "www.npr.org",
      "news.google.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "President Trump called off a planned Thursday meeting with top Hill Democrats to discuss a possible deal to avoid a shutdown. He called Democrats' demands \"unserious.\" Democrats say he chickened out.",
      "<a href=\"https://news.google.com/rss/articles/CBMikgFBVV95cUxOWDlTYlFqNlNRRTZVT294VTFRVGhrYlpoV3l5TDdnT0x3N1laNU5nTWFJUXlUOTFnRUpldHVFQ3NHNE1pYms4NXdjeWlWdFU3X3JySjBId3NXVVFFNzU0NTJRbkhBbjRfYnNTWHdoMEdvM2Y4eDlITlI3UEFKLUpCQ2I2OG5DSDJVR0VHblppMkREZw?oc=5\" target=\"_blank\">Trump cancels meeting with to",
      "<a href=\"https://news.google.com/rss/articles/CBMimAFBVV95cUxQOTY0UmlZZE0tWXBpeGF1dU9mYy1NTnFNalZNeFV5bGxEa0NTdUVzTXpIRFpobjV0V19IZHNNbXlxamktbm1XTGN1T1ViZ2RJU1VPYkoxLUxvcjRzMFRHRm5GbUo5TXJyZ19WUDkyY3VoSzNienI5b2xENFhBb2tCdTBCMmotVERQUkpnV1NicHZKbTUtWFhKaQ?oc=5\" target=\"_blank\">Trump to meet with De",
      "New York Democrats Sen. Chuck Schumer and Rep. Hakeem Jeffries say Trump will take the blame for a federal government shutdown if a deal can't be reached."
    ],
    "image_url": "",
    "titles": [
      "Trump cancels meeting with Democrats as prospects for shutdown increase",
      "Trump cancels meeting with top Democrats as shutdown looms - Axios",
      "Trump to meet with Democratic Hill Leaders over shutdown - Axios",
      "Trump cancels meeting with top Democrats as government shutdown looms"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.851,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.746,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Former President Donald Trump canceled a meeting aimed at preventing a federal government shutdown, blaming Congressional Democrats for the impasse. He accused them of losing their way in a post on Truth Social. New York Democrats Senator Chuck Schumer and Representative Hakeem Jeffries countered by stating Trump would be blamed for the shutdown, criticizing him for avoiding negotiations. The potential shutdown threatens federal workers' pay, air travel, and food stamp distribution.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Oklahoma State Fires Coach Mike Gundy After 21 Years Amid Poor Season Start",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 23 Sep 2025 14:55:45 EST",
    "source": "ESPN",
    "sources": [
      "Sports Illustrated",
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.sportsnet.ca",
      "news.google.com"
    ],
    "snippets": [
      "Oklahoma State, which has lost 11 of 12 games since the start of the 2024 season, has fired head coach Mike Gundy, who was in his 21st season with the Cowboys.",
      "Gundy's long tenure in Stillwater is over. Who replaces the Pokes legend and who are the key players on the roster?",
      "<a href=\"https://news.google.com/rss/articles/CBMidkFVX3lxTE1PaUxHa1lHbklxNjM0c1hPUGJqTDhxMkhKaXdOaTl5YVlVaGVoWTBTNW9mRWE4ZGQ4eUF3THF4RGZOVUJia29FMnlMdWVpcF93Sl9PVmNvSHZ0TVk5WnRDd2tCZFBnaGdZaU9pbWR5aGZkRnA3NVE?oc=5\" target=\"_blank\">Oklahoma State Fires Mike Gundy, Program's Winningest Coach</a>&nbsp",
      "<a href=\"https://news.google.com/rss/articles/CBMimgFBVV95cUxOY2ZGS19VN2xZbGNTTGNiUXExUEhyNVZnbldkTjhEQUpOU0RkN01PUTYtLVZQR2ZjS0RILVZqdW43YXNBaFhrMENjTURNWUxmR1Q5RHE1YThoMnVMNExRcE5PR2JCaXZOQ05rUF90M001aFZBVWRuWTFRX3NLeGFxUjVYV0V0N2Q0bHlIUFZhQ1ZHMDZWRTJiLUln?oc=5\" target=\"_blank\">Mike Gundy Fired: T",
      "<a href=\"https://news.google.com/rss/articles/CBMilwFBVV95cUxOVkdPVFdlWlNDemkwOHBCNUJndGVfekM5dWo4Wm8zUTFqazJCSGVUWV9yN1c1bjZQTUx3UUh1bWU1TTNCa2VrcDc5OEpHSGxONVhpalB1ekZWdjVPYVU2cUdtZnRweTJlTHZsT0w0ajhiV1lmeWRhOUV6b0F0emxpNzhYSFhybm9RT3BZZng5ZlJzaGRCdHl3?oc=5\" target=\"_blank\">Mike Gundy Exited Oklah",
      "<p>Mike Gundy, one of college football’s most colourful coaches over the last two decades, has been fired at Oklahoma State, according to multiple media reports.</p>"
    ],
    "image_url": "",
    "titles": [
      "Oklahoma State fires longtime coach Mike Gundy",
      "Mike Gundy is out at Oklahoma State: Top candidates, transfers, recruits to watch",
      "Oklahoma State Fires Mike Gundy, Program's Winningest Coach - Sports Illustrated",
      "Mike Gundy Fired: Ten Candidates for Oklahoma State Football Coaching Search - Sports Illustrated",
      "Mike Gundy Exited Oklahoma State Exactly How You’d Expect - Sports Illustrated",
      "Oklahoma State fires football coach Mike Gundy after 20-plus years"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.895,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.741,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Oklahoma State has dismissed head coach Mike Gundy after a disappointing start to the 2024 season, ending his 21-year tenure with the team. The Cowboys have struggled, losing 11 of their last 12 games. The search for Gundy's replacement is underway, with the future direction of the program and its key players now a primary focus.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "MLB to Introduce ABS Challenge System for Calls in 2026",
    "domain": "sports",
    "source_domain": "www.nydailynews.com",
    "location": "national",
    "published": "Tue, 23 Sep 2025 23:43:00 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Sportsnet",
      "Yahoo Sports",
      "Forbes"
    ],
    "domains": [
      "www.nydailynews.com",
      "www.sportsnet.ca",
      "www.forbes.com"
    ],
    "snippets": [
      "NEW YORK — Starting next season, MLB players will be able to challenge balls and strikes a few times per game. A vote on Tuesday approved the Automated Ball-Strike (ABS) Challenge System, which had been tested in the minor leagues, at spring training and during this summer’s MLB All-Star Game. The r",
      "The automated balls and strikes challenge system will officially be part of all MLB Spring Training, regular season, and postseason starting in 2026. Here's the details",
      "<p>Major league players will be allowed to challenge ball and strike calls beginning in 2026.</p>"
    ],
    "image_url": "",
    "titles": [
      "MLB approves ball-strike challenge system for 2026 season",
      "Automated Balls And Strikes System Coming To MLB In 2026",
      "MLB approves ball-strike challenges beginning in 2026"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.989,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.735,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Starting in 2026, MLB players will have the ability to challenge ball and strike calls during games, following a successful vote to implement the Automated Ball-Strike (ABS) Challenge System. This system, previously tested in minor leagues, spring training, and the MLB All-Star Game, will be applied in Spring Training, regular season, and postseason games.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Giants to Start Rookie QB Dart Over Wilson in Week 4: ESPN",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 23 Sep 2025 12:34:03 EST",
    "source": "ESPN",
    "sources": [
      "Sports Illustrated",
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.sportsnet.ca",
      "news.google.com"
    ],
    "snippets": [
      "The Giants are planning to bench quarterback Russell Wilson in favor of first-round rookie Jaxson Dart after three games, sources told ESPN's Adam Schefter on Tuesday.",
      "<a href=\"https://news.google.com/rss/articles/CBMijgFBVV95cUxNUEtfV3J1d0JUUnU5c2Vtb2JQcjNvdk9iNGdqMm03dHJkYUZaY05YVDFoUkNCMllFUEVOTG1HT3VGOWFMYXBmQkhCOGlfWm9XMVJuanhyWkNrTWZmNnhRQkVvR1hzbVpZV05GNTJMcWVKTFR3bkhodVhTSGZRNE5pTVJaeU9QQVBSZENteGJn?oc=5\" target=\"_blank\">Why Brian Daboll Had to Start Jaxso",
      "<a href=\"https://news.google.com/rss/articles/CBMib0FVX3lxTFBRd050NUlhRVpqOFQ2aEZnVTA2aVM1MVVtdU1RSHg2cjF0Yk5TdUZmQnM0N1pEdmxId28xc3NCMGh3OHJHNTF6Z0NwSFpNdkJBaW5aVFRSbWpSYXhpem9GWEpaNE00THhTcW9XZnRzRQ?oc=5\" target=\"_blank\">Giants Make Decision to Start Jaxson Dart Over Russell Wilson in Week 4</a>&n",
      "<p>The New York Giants are set to thrust their rookie signal-caller into the spotlight.</p>"
    ],
    "image_url": "",
    "titles": [
      "Sources: Giants to bench QB Wilson, start Dart",
      "Why Brian Daboll Had to Start Jaxson Dart and Bench Russell Wilson - Sports Illustrated",
      "Giants Make Decision to Start Jaxson Dart Over Russell Wilson in Week 4 - Sports Illustrated",
      "Report: Giants to start QB Jaxson Dart vs. Chargers"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.852,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.732,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The New York Giants have decided to start rookie quarterback Jaxson Dart over Russell Wilson for Week 4, according to sources cited by ESPN's Adam Schefter. This change comes after just three games into the season.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Claims Resolution of Conflicts, Critiques Global Bodies at U.N.",
    "domain": "sports",
    "source_domain": "www.washingtonpost.com",
    "location": "global",
    "published": "Tue, 23 Sep 2025 17:34:40 +0000",
    "source": "Washington Post",
    "sources": [
      "NHL",
      "Washington Post",
      "New York Times"
    ],
    "domains": [
      "www.washingtonpost.com",
      "news.google.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "In Trump’s speech before the U.N. General Assembly, he said he had ended a growing list of conflicts. In some of them, his role remains contested.",
      "President Trump’swith a rebuke of global institutions,",
      "<a href=\"https://news.google.com/rss/articles/CBMigwFBVV95cUxOTkZoY3V4dHJtV002c2tFQWhWbXloOW03eWRNVGdQbWxUOXNNSG1OdDRsY2pCbHhPeE1nRUZmVzFtNnQ1OUZfbjJsMmtrcThpRmlMeUdzSjU3UzZWR0ctU2RtZGlHWm1EY1drUi1TN3hnckJUSEtDOFFZelhFb1NkR0RLcw?oc=5\" target=\"_blank\">PHI@MTL: What you need to know</a>&nbsp;&nbsp;<fo"
    ],
    "image_url": "",
    "titles": [
      "Trump says he has ‘solved’ 7 conflicts. Here’s what to know about them.",
      "Here’s what to know.",
      "PHI@MTL: What you need to know - NHL.com"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.871,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.725,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "During his speech at the U.N. General Assembly, President Trump claimed to have ended a list of conflicts, though his involvement in some remains disputed. He also criticized global institutions. The specifics of the conflicts or the nature of the criticism were not detailed in the provided content.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "YouTube to Allow Banned Misinformation Channels to Seek Reinstatement",
    "domain": "technology",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Tue, 23 Sep 2025 20:54:25 GMT",
    "source": "CNBC",
    "sources": [
      "Ars Technica",
      "The Verge",
      "CNBC"
    ],
    "domains": [
      "arstechnica.com",
      "www.theverge.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "YouTube on Tuesday said it will allow previously banned accounts to apply for reinstatement, rolling back a policy that had treated violations as permanent.",
      "Google has announced it will reverse a major content moderation decision: YouTube will offer channels that were banned for spreading covid and election misinformation in 2020 a pathway back onto the platform. In a letter sent to the House Judiciary Committee, Alphabet's lawyers claimed that the Bide",
      "Alphabet blames the Biden administration for its moderation decisions."
    ],
    "image_url": "",
    "titles": [
      "YouTube to allow creators banned for Covid-19, election misinformation to apply for reinstatement",
      "YouTube will let creators who spread covid misinformation back on the site",
      "YouTube will restore channels banned for COVID and election misinformation"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.914,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.72,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "YouTube, owned by Alphabet, announced it will enable channels banned for spreading COVID-19 and election misinformation in 2020 to apply for reinstatement. This marks a reversal of its prior policy treating such violations as permanent. The decision was disclosed in a letter to the House Judiciary Committee, where Alphabet suggested the Biden administration influenced its moderation policies.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Criticizes EU Immigration Policy, Global Institutions at UN Assembly",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Tue, 23 Sep 2025 16:22:30 GMT",
    "source": "Axios",
    "sources": [
      "ABC News",
      "Axios",
      "New York Times"
    ],
    "domains": [
      "abcnews.go.com",
      "news.google.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMieEFVX3lxTFB1cFA1NVE4VGczTUtWeFlsa3ZMYzR6bmtWLWpjQWlHTWUwcUMxUTE0bFpNdmZUc1czSGludmxSQWthOVJqUkNXY0FwMFNRbkFsTXEzR3djN25RR3FweEQyV1p3TVFXMHRsb0NUX1gyc1dlekRsQnVTVA?oc=5\" target=\"_blank\">Trump's middle finger to the UN: \"Your countries are going to hel",
      "President Donald Trump criticized the European Union's immigration policies while speaking at the United Nations General Assembly on Tuesday.",
      "In a meandering address, President Trump rebuked global institutions and complained about immigration, environmentalists, windmills and more."
    ],
    "image_url": "",
    "titles": [
      "Trump's middle finger to the UN: \"Your countries are going to hell\" - Axios",
      "WATCH:  Trump tells European Union nations: 'Your countries are going to hell'",
      "‘Your Countries Are Going to Hell’: Trump Airs His Grievances at the U.N."
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.832,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.71,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "During his speech at the United Nations General Assembly, President Donald Trump criticized the European Union's immigration policies and expressed disdain for global institutions, environmentalists, and windmills. His address was wide-ranging and included various complaints.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "NASA's Artemis II to Orbit Moon in 2026, Eyes Lunar Landing in 2027",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 23 Sep 2025 15:29:27 GMT",
    "source": "BBC",
    "sources": [
      "Al Jazeera",
      "Phys.org",
      "BBC"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.bbc.com",
      "phys.org"
    ],
    "snippets": [
      "The mission around the Moon will pave the way for a lunar landing as soon as 2027.",
      "The crew of Artemis II will not land on the moon but will lay the groundwork for the first crewed missions to Mars.",
      "NASA on Tuesday said it was on track to send astronauts to orbit the moon in early 2026, as the United States races China to return to the lunar surface."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/0e57/live/d786ec00-9898-11f0-9b4d-3db5bd560027.png",
    "titles": [
      "Nasa to send first crewed mission around Moon in 50 years",
      "NASA plans to send manned Moon mission by February 2026",
      "NASA says on track to send astronauts around the Moon in 2026"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.816,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.71,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "NASA announced plans for the Artemis II mission to orbit the Moon in early 2026, setting the stage for a lunar landing in 2027 and future crewed missions to Mars. This mission aims to establish groundwork for further space exploration as the US competes with China in returning to the lunar surface.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Micah Parsons Finds Sacking Ex-Teammate Prescott \"Painful\" Ahead of Dallas Retur",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 23 Sep 2025 18:51:55 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Yahoo Sports"
    ],
    "domains": [
      "www.espn.com",
      "www.nbcsports.com"
    ],
    "snippets": [
      "Sacking Dak Prescott would be bittersweet for Micah Parsons, who told The Associated Press that sacking his former teammate and mentor is \"going to be painful.\"",
      "Parsons returns to Dallas on Sunday."
    ],
    "image_url": "",
    "titles": [
      "Parsons on sacking Dak: 'It's going to be painful'",
      "Micah Parsons: &quot;It's going to be painful&quot; to sack Dak Prescott"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.972,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.681,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Micah Parsons expressed that sacking his former teammate and mentor, Dak Prescott, would be \"painful\" in an interview with The Associated Press. Parsons, who returns to Dallas on Sunday, highlighted the bittersweet nature of facing Prescott on the field.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Richard Sherman Enters Deferred Prosecution for DUI Case",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 23 Sep 2025 19:01:46 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Former Seahawks cornerback Richard Sherman has received a deferred prosecution in his ongoing DUI case, a spokesperson with the King County Prosecuting Attorney's Office told ESPN.",
      "Sherman must fulfill court requirements to have his charge dropped"
    ],
    "image_url": "",
    "titles": [
      "Sherman gets deferred prosecution in DUI case",
      "Former NFL star Richard Sherman granted deferred prosecution in DUI case"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.975,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.675,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Former Seahawks cornerback Richard Sherman has entered a deferred prosecution agreement for his DUI case, according to the King County Prosecuting Attorney's Office. To have his charge dropped, Sherman must comply with specific court requirements.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Houston Texans Release Veteran Safety C.J. Gardner-Johnson",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 23 Sep 2025 15:54:22 EST",
    "source": "ESPN",
    "sources": [
      "Sports Illustrated",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "news.google.com"
    ],
    "snippets": [
      "The Houston Texans released veteran safety C.J. Gardner-Johnson on Tuesday.",
      "<a href=\"https://news.google.com/rss/articles/CBMiaEFVX3lxTE5xYWd5YThQMEZTOFNJNTA2M0IycXJXWkF4eFFZV2tERFhaQUppc2tyaWtHVXZENjFBbW53US1rVWZIaDRLUndQUWhsYnJkb0tIQ3lKcHFodWxPZmp4Qy1wQWNpR2htT2Zn?oc=5\" target=\"_blank\">Texans Release Veteran Safety C.J. Gardner-Johnson in Surprise Move</a>&nbsp;&nbsp;<fon"
    ],
    "image_url": "",
    "titles": [
      "Texans release S Gardner-Johnson after 3 games",
      "Texans Release Veteran Safety C.J. Gardner-Johnson in Surprise Move - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.914,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.663,
    "summary_source": "snippet",
    "summary_reason": "retry_exhausted",
    "summary": "The Houston Texans released veteran safety C.J. Gardner-Johnson on Tuesday.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump's Vaccine and Tylenol Remarks Stir Controversy",
    "domain": "science",
    "source_domain": "www.newscientist.com",
    "location": "global",
    "published": "Tue, 23 Sep 2025 21:30:38 +0100",
    "source": "New Scientist",
    "sources": [
      "CityNews",
      "New Scientist"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "www.newscientist.com"
    ],
    "snippets": [
      "Scientific evidence is lacking to support the US government’s decisions to caution against using a common painkiller in pregnancy and fast-track the approval of an experimental medication for autism",
      "Many doctors and scientists were reeling Monday after President Donald Trump went on TV to insist that pregnant women should never take Tylenol and revive debunked theories about vaccines and autism. Trump went beyond his own Food and Drug Administration’s more modest advice that doctors “should con"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/09/23192712/SEI_267248545.jpg",
    "titles": [
      "What we know, and don't, about the link between painkillers and autism",
      "What we know about autism’s causes and any potential link to Tylenol"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.925,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.657,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "President Donald Trump's statements on TV advising against the use of Tylenol by pregnant women and reviving debunked theories about vaccines and autism have sparked controversy. These statements go beyond the FDA's more cautious advice, leading to confusion and concern among doctors and scientists. There is a lack of scientific evidence to support the U.S. government's caution against Tylenol in pregnancy and the fast-tracking of an experimental autism medication.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Dani Dyer-Bowen Exits Strictly Due to Fractured Ankle",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 23 Sep 2025 20:26:32 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The TV presonality says she \"landed funny\" in training on Friday and a scan has confirmed a fracture.",
      "<p>Former Love Island star ‘heartbroken’ to withdraw from 23rd series but promises to return to cheer on remaining cast</p><p>Dani Dyer-Bowen has pulled out of Strictly Come Dancing after fracturing her ankle during rehearsals.</p><p>The 29-year-old reality TV star, who won Love Island in 2018 and t"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/c869/live/cd055240-98a1-11f0-b37c-21373da9ac07.jpg",
    "titles": [
      "Dani Dyer pulls out of Strictly with broken ankle",
      "Dani Dyer-Bowen leaves Strictly Come Dancing after fracturing ankle in rehearsal"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.905,
      "consensus": 0.591,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.656,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Dani Dyer-Bowen, a former Love Island winner, has withdrawn from the 23rd series of Strictly Come Dancing due to a fractured ankle sustained during rehearsal. She reported the injury occurred after landing awkwardly in training. Despite her withdrawal, Dyer-Bowen expressed heartbreak over the situation but promised to return to support the remaining cast.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: support, sustain",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Urges NATO to Shoot Down Russian Jets After Poland Incident",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Tue, 23 Sep 2025 20:54:20 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Forbes"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.forbes.com"
    ],
    "snippets": [
      "US President Donald Trump says NATO countries should shoot down Russian aircraft that violate their airspace.",
      "Trump made the comments after Poland became the first member nation to fire at Russian aircraft earlier this month since the start of the Russia-Ukraine war."
    ],
    "image_url": "",
    "titles": [
      "Trump: NATO countries should shoot down Russian aircraft violating airspace",
      "Trump Says NATO Countries Should Shoot Down Russian Aircraft, Contradicting Rubio"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.933,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.656,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "US President Donald Trump suggested that NATO countries should shoot down Russian aircraft entering their airspace, following an incident where Poland, a NATO member, fired at a Russian aircraft. This marks the first such action by a NATO country against Russia since the onset of the Russia-Ukraine conflict.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "NASA Eyes Crewed Artemis Moon Flight Within 20 Weeks",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Tue, 23 Sep 2025 15:42:03 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org",
      "Ars Technica"
    ],
    "domains": [
      "arstechnica.com",
      "phys.org"
    ],
    "snippets": [
      "After multiple delays, the first crewed Artemis flight around the moon could be less than 20 weeks away, NASA officials said Tuesday, putting the space program one step closer to returning to the moon itself in its \"second space race\" with China.",
      "\"There is a desire for us to be the first to return to the surface of the Moon.\""
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/moon-orbit.jpg",
    "titles": [
      "NASA officials say Artemis II moon flight could come in early February",
      "NASA targeting early February for Artemis II mission to the Moon"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.91,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.647,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "NASA officials announced that the first crewed Artemis flight around the moon could occur in less than 20 weeks, advancing the space agency's goal to return to the lunar surface and stay ahead in the space race with China. This development brings NASA one step closer to its objective of returning humans to the moon.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Jessica Chastain's \"The Savant\" Pulled from Apple TV+ Schedule",
    "domain": "technology",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Tue, 23 Sep 2025 20:37:14 GMT",
    "source": "The Guardian",
    "sources": [
      "The Verge",
      "The Guardian"
    ],
    "domains": [
      "www.theverge.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "<p>The Savant pulled from Apple TV+ release schedule ‘after careful consideration’</p><p>Jessica Chastain-led series The Savant has been pulled from the Apple TV+ release schedule.</p><p>The thriller was set to begin on 26 September but its release has been postponed.</p> <a href=\"https://www.thegua",
      "The Savant, the upcoming Apple TV Plus show about law enforcement working to prevent domestic terrorism, was slated to premiere this Friday. But the streamer has quietly pulled the series from its release slate and it&#8217;s not clear if or when it will now debut. Based on Andrea Stanley&#8217;s 20"
    ],
    "image_url": "https://i.guim.co.uk/img/media/0d2f64f82a0a43e54954f256ff81cca4bc4653b2/720_0_7200_5760/master/7200.jpg?width=140&quality=85&auto=format&fit=max&s=0874ff29255a99028ac9f031f358fe0c",
    "titles": [
      "Apple postpones Jessica Chastain series about domestic extremism",
      "Apple TV Plus has quietly pulled its new show about domestic extremism"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.908,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.644,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Savant, a thriller series led by Jessica Chastain and focused on preventing domestic terrorism, was scheduled to premiere on Apple TV+ on September 26. However, after careful consideration, the show has been removed from the release schedule, and it is currently unclear if or when it will debut.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Drone Strike at Haiti Party Kills 8 Children, Mistargets Gang Leader",
    "domain": "general",
    "source_domain": "www.nytimes.com",
    "location": "global",
    "published": "Tue, 23 Sep 2025 17:31:39 +0000",
    "source": "New York Times",
    "sources": [
      "The Guardian",
      "New York Times"
    ],
    "domains": [
      "www.theguardian.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "A drone meant to strike a gang leader hit a celebration where children had gathered. Haiti is using drones to repel gangs that control much of the capital.",
      "<p>Six others were injured after drone explosions in Cité Soleil, where an alleged gang leader was distributing gifts</p><p>At least eight children were killed and six others seriously injured in a drone attack on a birthday party in <a href=\"https://www.theguardian.com/world/haiti\">Haiti</a>’s capi"
    ],
    "image_url": "https://static01.nyt.com/images/2025/09/23/multimedia/23int-haiti-drones-qtkw/23int-haiti-drones-qtkw-mediumSquareAt3X.jpg",
    "titles": [
      "Drone Strike in Haiti Kills 8 Children at a Birthday Party",
      "Haiti: at least eight children among 13 killed in drone attack on birthday party"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.87,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.643,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In Haiti, a drone attack intended to target a gang leader mistakenly struck a birthday party in Cité Soleil, resulting in the death of at least eight children and serious injuries to six others. The incident occurred as the country employs drones to combat gangs dominating the capital.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Online Retail Giant to Close 19 Shops, 5 to Become Whole Foods",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 23 Sep 2025 17:11:29 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "CNBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "The online retail giant says it would convert five of the 19 shops into Whole Foods stores.",
      "The company's grocery business has undergone significant changes over the past few years, including trimming its brick-and-mortar store footprint."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/bc2e/live/a738bca0-987e-11f0-b146-278281693603.jpg",
    "titles": [
      "Amazon to close its UK grocery stores",
      "Amazon to close all of its Fresh grocery stores in UK"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.846,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.641,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "An online retail giant announced plans to close 19 shops, with five being converted into Whole Foods stores, as part of a strategy adjustment following the unsuccessful adoption of its till-less store concept. This move reflects significant changes in the company's approach to its grocery business, which has seen a reduction in its physical store presence recently.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Disney to Raise Prices Amid Subscription Drop",
    "domain": "business",
    "source_domain": "www.forbes.com",
    "location": "global",
    "published": "Tue, 23 Sep 2025 14:25:22 -0400",
    "source": "Forbes",
    "sources": [
      "TechCrunch",
      "Forbes"
    ],
    "domains": [
      "techcrunch.com",
      "www.forbes.com"
    ],
    "snippets": [
      "Customers will see price increases on October 21, Disney said.",
      "The timing of the price increases isn’t ideal, as Disney+ subscribers canceled their subscriptions in droves last week, protesting Disney’s decision to temporarily pull Jimmy Kimmel from its airwaves."
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/68d2e5b80bc8bd2a6545f7ee/0x0.jpg",
    "titles": [
      "Disney+ And Hulu Prices Will Rise Again Next Month",
      "Disney is raising the price of Disney+, Hulu subscriptions next month"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.886,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.639,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Disney announced that prices will rise on October 21. This follows a significant drop in Disney+ subscriptions last week, attributed to the company's temporary removal of Jimmy Kimmel from its programming.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Macron Walks 30 Minutes in NYC Amid Transport Disruption During UN Assembly",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 23 Sep 2025 20:22:23 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Macron and Trump were in New York for the 80th UN General Assembly",
      "<p>Bemused French president forced to take unscheduled 30-minute trek through the streets of New York</p><p>Emmanuel Macron had to walk half an hour by foot through New York after his <a href=\"https://www.theguardian.com/world/2025/sep/22/arab-and-muslim-leaders-to-meet-trump-to-discuss-peace-plan-f"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/1c6e/live/c3b26190-98b7-11f0-858a-a904eacbef23.jpg",
    "titles": [
      "Macron calls Trump after motorcade blocks his car",
      "‘Guess what?’ Macron phones Trump after US president’s motorcade blocks his car"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.904,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.636,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "French President Emmanuel Macron unexpectedly had to walk for 30 minutes through New York due to circumstances that disrupted his planned transport. This occurred while both Macron and former U.S. President Donald Trump were in the city for the 80th UN General Assembly.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Disney+ to Hike Prices on Some Subscriptions Starting October 21",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Tue, 23 Sep 2025 20:02:19 GMT",
    "source": "CNBC",
    "sources": [
      "Business Insider",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "www.businessinsider.com"
    ],
    "snippets": [
      "Disney announced price hikes of roughly $2 to $3 for its subscription packages on Tuesday.",
      "Disney is set to increase streaming prices for select Disney+ plans, including entry-level subscriptions and several bundle deals, on October 21."
    ],
    "image_url": "",
    "titles": [
      "Disney raises prices for streaming packages",
      "Disney has another announcement: Its streaming prices are going up"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.897,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.634,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Disney announced it will raise prices for select Disney+ subscription packages, including entry-level subscriptions and bundle deals, by approximately $2 to $3. The price increases will take effect on October 21.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Ragasa: World's Strongest Storm Causes Deaths, Disruptions in Asia",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 23 Sep 2025 18:53:29 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "New York Times"
    ],
    "domains": [
      "www.bbc.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "Ragasa is the strongest storm anywhere on Earth so far this year.",
      "Two people were reported dead in Taiwan, with dozens missing. Hong Kong canceled flights, Macau shut casinos and Shenzhen planned to evacuate 400,000 people."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/f359/live/1d3a9a80-989e-11f0-858a-a904eacbef23.png",
    "titles": [
      "Typhoon bursts Taiwan lake as  strongest storm barrels towards China",
      "Typhoon Ragasa Floods Taiwan and Barrels Toward China’s Coast"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.876,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.63,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Ragasa, the year's strongest storm globally, has caused significant disruptions and fatalities. In Taiwan, it resulted in two deaths and numerous missing persons. Hong Kong responded by canceling flights, Macau closed its casinos, and Shenzhen is evacuating 400,000 residents due to the storm's impact.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Meta Launches Super PAC to Oppose AI Regulation Policies",
    "domain": "technology",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Tue, 23 Sep 2025 13:32:24 GMT",
    "source": "Axios",
    "sources": [
      "TechCrunch",
      "Axios"
    ],
    "domains": [
      "techcrunch.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMibEFVX3lxTE5EUTlOMkprWjVvMFZDRkRHekpselFfUkczV05DbXpPY09DZ3hHTl9LV0UtSG5LUVo5dkp3d3djVGVNRC1RWm5iTGFYYWtYMUxqeVVCWXl1VXlDZEZDTXZJVjZoLV9SbzNIYjBDcA?oc=5\" target=\"_blank\">Exclusive: Meta launches super PAC to fight AI regulation</a>&nbsp;&nbsp;<font co",
      "Meta is investing 'tens of millions' into a new pro-AI super PAC called the American Technology Excellence Project to fight state-level tech policy that would regulate AI."
    ],
    "image_url": "",
    "titles": [
      "Exclusive: Meta launches super PAC to fight AI regulation - Axios",
      "Meta launches super PAC to fight AI regulation as state policies mount"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.784,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.619,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Meta has launched the American Technology Excellence Project, a super PAC, with an investment of 'tens of millions'. The purpose is to oppose state-level policies aimed at regulating AI technology.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "NASA Picks 10 Astronauts for 2025 Class, Eyes Moon and Mars Missions",
    "domain": "science",
    "source_domain": "www.sciencedaily.com",
    "location": "global",
    "published": "Tue, 23 Sep 2025 10:10:07 EDT",
    "source": "ScienceDaily",
    "sources": [
      "NASA",
      "ScienceDaily"
    ],
    "domains": [
      "www.nasa.gov",
      "www.sciencedaily.com"
    ],
    "snippets": [
      "NASA has chosen 10 new astronaut candidates who will train for missions to the Moon and Mars. Their selection represents a powerful blend of talent and ambition, fueling humanity’s next great leaps into space.",
      "NASA’s 2025 astronaut candidate class greets the crowd in this Sept. 22, 2025, image. The group was introduced Monday following a competitive selection process of more than 8,000 applicants from across the United States. The class now will complete nearly two years of training before becoming eligib"
    ],
    "image_url": "",
    "titles": [
      "10 people who beat 8,000 others to become NASA astronaut candidates",
      "NASA’s New Astronaut Candidates"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.811,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.617,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "NASA selected 10 astronaut candidates from over 8,000 applicants for its 2025 class, introduced on Sept. 22, 2025. These candidates will undergo nearly two years of training for future Moon and Mars missions, marking a significant step in human space exploration.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Mamdani Leads NYC Mayor Race, Endorsed by Harris Amid Party Hesitancy",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Tue, 23 Sep 2025 05:18:17 GMT",
    "source": "Axios",
    "sources": [
      "Fortune",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "fortune.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMilAFBVV95cUxQNW0zZEkyTlFoQnUwbTQwR2R6bWlrOGl1VVlPWFB0clNUZVZWalBybHFSQzA2QWw3ckFxMmNUTHhQNEJuem90OTdSd3B6RkxhSnRmTWtIWVlvZGZTbVRXekFMemhNOUVYUTk5Zk1vR2dsMGV4U1NxekQzQWJBS0EzeGhUenB2OUNLcnVZMzlpanF6SnU5?oc=5\" target=\"_blank\">Harris on endorsing Mamdani",
      "Unlike Bernie Sanders and Alexandria Ocasio-Cortez's full-throated endorsements of the favorite to be next New York mayor, the former vice president said \"sure,\" she endorses him."
    ],
    "image_url": "",
    "titles": [
      "Harris on endorsing Mamdani for NYC mayor: \"I support the Democrat in the race, sure\" - Axios",
      "Kamala Harris endorses Zohran Mamdani without saying his name: ‘I support the Democrat in this race’"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.66,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.597,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Zohran Mamdani is currently leading the NYC Mayor's race polls and has received an endorsement from Kamala Harris. Despite his lead and high-profile backing, some Democratic party leaders have been hesitant to support Mamdani, who identifies as a Democratic-Socialist.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Tech Leaders to Discuss AI, Space Economy, and Startups at TechCrunch Disrupt 20",
    "domain": "technology",
    "source_domain": "techcrunch.com",
    "location": "global",
    "published": "Tue, 23 Sep 2025 22:00:00 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com"
    ],
    "snippets": [
      "At TechCrunch Disrupt 2025, True Anomaly’s Even Rogers and Vast’s Max Haot will join the Space Stage to explore what’s needed to unlock a sustainable and scalable space economy.",
      "On the AI Stage at TechCrunch Disrupt 2025, Mercor co-founder and CEO Brendan Foody will break down how artificial intelligence is transforming not just how we work, but also who gets to work in the first place.",
      "Vinod Khosla, founder of Khosla Ventures, takes the Disrupt Stage for a candid fireside chat on AI, climate, healthcare, and transformational startups. Hear blunt, big-picture advice from one of tech’s most legendary investors, and learn what founders truly need to succeed in turbulent times."
    ],
    "image_url": "",
    "titles": [
      "Building the new backbone of space at TechCrunch Disrupt 2025",
      "Mercor’s Brendan Foody breaks down AI’s impact on hiring at TechCrunch Disrupt 2025",
      "Vinod Khosla on AI, moonshots, and building enduring startups — all at TechCrunch Disrupt 2025"
    ],
    "score_components": {
      "magnitude": 0.393,
      "recency": 0.955,
      "consensus": 0.35,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.476,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "At TechCrunch Disrupt 2025, leaders in technology and investment, including Even Rogers, Max Haot, Brendan Foody, and Vinod Khosla, will discuss key topics shaping the future. They'll cover the development of a sustainable space economy, the impact of AI on employment, and the role of startups in addressing major global challenges such as climate change and healthcare. The event aims to provide insights into creating successful ventures in a rapidly changing world.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Morrissey, The Strokes Announce US, Canada, Mexico Tours; Tickets Available",
    "domain": "business",
    "source_domain": "www.businessinsider.com",
    "location": "global",
    "published": "2025-09-23T21:48:08Z",
    "source": "Business Insider",
    "sources": [
      "Business Insider"
    ],
    "domains": [
      "www.businessinsider.com"
    ],
    "snippets": [
      "Despite some setbacks, Morrissey will be performing across the US, Canada, Mexico, and more. Here's how to get tickets.",
      "The Strokes are returning to the stage for a brief tour before hitting Austin City Limits and Coachella. Here's how to get tickets."
    ],
    "image_url": "https://i.insider.com/68d3156ef9db348adc0c096f?format=jpeg",
    "titles": [
      "How to get Morrissey concert tickets: Tour dates in Los Angeles, San Antonio, and more",
      "How to get The Strokes concert tickets: Las Vegas, El Paso, Austin, and Indio"
    ],
    "score_components": {
      "magnitude": 0.393,
      "recency": 0.951,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.465,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Morrissey and The Strokes are both set to perform in upcoming tours across the US, Canada, Mexico, and other locations, despite some setbacks for Morrissey. Morrissey's tour details and ticket information are available, while The Strokes will tour briefly before appearing at Austin City Limits and Coachella, with ticket information also provided for their shows.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]