[
  {
    "title": "Hamas Agrees to Release Hostages, Engages in Peace Talks with Trump's Plan",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sat, 04 Oct 2025 15:14:11 -0400",
    "source": "NPR",
    "sources": [
      "Axios",
      "New York Times",
      "BBC",
      "Forbes",
      "Al Jazeera",
      "Financial Times",
      "NPR"
    ],
    "domains": [
      "www.npr.org",
      "www.aljazeera.com",
      "news.google.com",
      "www.nytimes.com",
      "www.forbes.com",
      "www.bbc.com",
      "www.ft.com"
    ],
    "snippets": [
      "Israeli Prime Minister Benjamin Netanyahu said on Saturday that he hopes Hamas will have returned all remaining hostages by Oct. 13.",
      "Hamas agreed to release the hostages and to the idea of handing over governing Gaza to Palestinian technocrats, but did not give a clear response to many other elements.",
      "Families describe a \"fragile situation\", with negotiations between Israel and Hamas expected to resume.",
      "Hamas accepted parts of US President Trump’s 20-point Gaza ceasefire plan but wants more talks on several key points.",
      "Hope-filled reactions follow Hamas’s response, which marks a potential turning point in Israel&#039;s two-year war on Gaza.",
      "<a href=\"https://news.google.com/rss/articles/CBMif0FVX3lxTE1vUzN3NUNhdW5KdGZNLW0tdndmRk0tU3p3aDhxMkdHLW84YVJCTGR0RnFvTl8zVHNLU090NTBfMEpzN3JFbUQ1VERoV1phR1RRX1g0QXhnWmk3ektQTFdNZFBDcm8ydERPWVI3U01vaGZfMHR5cy1jTm5qV1NYLVE?oc=5\" target=\"_blank\">Trump tells Israel to stop bombing Gaza after Hamas resp",
      "Israel and Hamas said they would work with President Trump’s plan to end the war, but a number of sticking points could derail efforts to reach a diplomatic breakthrough.",
      "US president tells militant group that it has limited time to seal a deal to end the conflict",
      "Israel and Hamas announced they’ve agreed to parts of Trump’s plan to end the war."
    ],
    "image_url": "",
    "titles": [
      "Trump urges Hamas to 'move quickly' on Gaza peace plan",
      "Shock in Gaza as Trump appears to welcome Hamas response to US peace plan",
      "Hope and fear for hostage families after Hamas response to Gaza peace plan",
      "What we know about Hamas’ response to Trump’s Gaza peace plan",
      "World reacts to Hamas’s response to Trump’s Gaza plan",
      "Trump tells Israel to stop bombing Gaza after Hamas responds to peace plan - Axios",
      "Trump’s Gaza Peace Plan: What to Know",
      "Trump tells Hamas to ‘move quickly’ on hostage deal during pause in Israeli bombardment",
      "Trump Warns Hamas ‘Must Move Quickly’ To Release Hostages As Part Of His Peace Plan"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.981,
      "consensus": 1.0,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.881,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Hamas has agreed to release Israeli hostages and accepted parts of President Trump's peace plan to end the nearly two-year war, but seeks further negotiations on many terms. Trump has ordered Israel to immediately stop bombing Gaza, signaling a potential move towards peace. Despite not fully agreeing to the U.S. proposal, Hamas's willingness to discuss the plan and release hostages has been acknowledged by Trump as a step towards achieving lasting peace in the Middle East.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "ANO Party Wins Czech Elections; Babiš Eyes Policy Shift on Ukraine",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sat, 04 Oct 2025 13:42:19 -0400",
    "source": "NPR",
    "sources": [
      "Financial Post",
      "BBC",
      "The Guardian",
      "Al Jazeera",
      "NPR"
    ],
    "domains": [
      "www.npr.org",
      "www.aljazeera.com",
      "financialpost.com",
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "His political comeback put the country on a course away from supporting Ukraine and toward Hungary and Slovakia, which have taken a pro-Russian path.",
      "However, his ANO party falls short of an overall majority in preliminary results.",
      "With most votes tallied, Babis’s ANO party is ahead, but it appears set to fall short of a majority in parliament.",
      "<p>With Babiš’s victory the Czech Republic looks set to join Hungary and Slovakia in refusing support for Ukraine</p><p>Populist billionaire Andrej Babiš has won the Czech Republic parliamentary elections, preliminary results show, but fallen short of the overall majority.</p><p>This win marks a pol",
      "Czech billionaire Andrej Babis was on track to return to power after securing a decisive victory in a parliamentary election, pledging to undo four years of austerity and curb military aid to Ukraine."
    ],
    "image_url": "",
    "titles": [
      "Populist billionaire Andrej Babiš wins Czech parliamentary election",
      "Billionaire populist Andrej Babis' party wins Czech parliamentary election",
      "Populist billionaire Andrej Babis’s party set to win Czech election",
      "Populist billionaire Andrej Babiš wins Czech parliamentary election",
      "Czech Billionaire Set to Return to Power After Election Win"
    ],
    "score_components": {
      "magnitude": 0.984,
      "recency": 0.95,
      "consensus": 0.995,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.868,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Andrej Babiš's ANO party won the Czech Republic parliamentary elections, according to preliminary results. Despite the victory, ANO did not achieve an overall majority. Babiš's win signals a shift in the Czech Republic's foreign policy, aligning closer with Hungary and Slovakia's stance of limiting support for Ukraine. This marks a significant political comeback for the billionaire, who aims to reverse austerity measures and reduce military aid to Ukraine.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Sanae Takaichi Elected LDP Leader, Set to Be Japan's First Female PM",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sat, 04 Oct 2025 06:17:39 -0400",
    "source": "NPR",
    "sources": [
      "Washington Post",
      "New York Times",
      "BBC",
      "The Guardian",
      "Al Jazeera",
      "Deutsche Welle",
      "NPR"
    ],
    "domains": [
      "www.npr.org",
      "www.aljazeera.com",
      "www.theguardian.com",
      "www.dw.com",
      "www.nytimes.com",
      "www.bbc.com",
      "www.washingtonpost.com"
    ],
    "snippets": [
      "Japan's governing party on Saturday elected Sanae Takaichi, a hard-line ultra-conservative and China hawk, as its new leader, making her likely to become the country's first female prime minister.",
      "Takaichi is a long-time admirer of Margaret Thatcher, but many female voters do not see her as an advocate for progress.",
      "If elected, Takaichi will face a host of issues, including an ageing population and growing unease about immigration.",
      "Conservative hard-liner Takaichi is the former internal affairs minister of Japan. She holds hawkish views on China, and has also visited the controversial Yasukuni Shrine, which memorializes Japan's war dead.",
      "<p>Margaret Thatcher admirer beat her more moderate rival to become leader of Liberal Democratic party</p><p>Japan is poised to get its first female prime minister after Sanae Takaichi was elected as leader of the governing Liberal Democratic party (LDP) – a victory that should lead to her being ins",
      "The new leader will take the helm of the world’s fourth-largest economy at a time of unusual political instability, rising prices and increasing regional tensions.",
      "Sanae Takaichi, a hard-line conservative, was elected as leader by Japan’s embattled governing party, paving the way for her to become prime minister of the coalition government.",
      "Ms. Takaichi would be Japan’s first female prime minister in a country where women are drastically underrepresented at the highest levels of power."
    ],
    "image_url": "",
    "titles": [
      "Japan's ruling party elects Sanae Takaichi as leader, likely to become first female PM",
      "Sanae Takaichi set to become Japan's first female prime minister",
      "Japan’s LDP elects Takaichi as new leader, likely to be first female PM",
      "Sanae Takaichi expected to be Japan's first female PM",
      "Japan poised to get first female PM after Sanae Takaichi wins ruling party leadership",
      "Sanae Takaichi is set to become Japan’s first female prime minister",
      "Japan Is Set for Its First Female Prime Minister",
      "Sanae Takaichi Is Likely to Be Japan’s Next Leader. Who Is She?"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.814,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.838,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Sanae Takaichi, a conservative hard-liner and former Economic Security Minister, has been elected as the new leader of Japan's governing Liberal Democratic Party (LDP), positioning her to become the country's first female prime minister. Takaichi, known for her admiration of Margaret Thatcher and hawkish views on China, won against her more moderate rival, Shinjiro Koizumi, in a second-round party vote. Her leadership arrives amidst challenges such as political instability, an ageing population, rising prices, and regional tensions.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Police Use Force on Protesters at Georgian Presidential Palace",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 04 Oct 2025 17:31:04 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Financial Post",
      "Al Jazeera",
      "Deutsche Welle"
    ],
    "domains": [
      "www.bbc.com",
      "www.dw.com",
      "www.aljazeera.com",
      "financialpost.com"
    ],
    "snippets": [
      "Police used pepper spray to disperse demonstrators amid growing turmoil in the Caucasus country.",
      "Opposition protests turned violent as riot police used tear gas and water cannon after disputed local elections.",
      "Demonstrators were trying to enter the presidential palace in Tbilisi. A former president had called on Georgians to protest for what he called the \"last chance\" to save the country.",
      "TBILISI, Georgia (AP) &#8212; Police in Georgia used water cannons and pepper spray on Saturday to push back protesters who tried to storm the presidential palace, as the South Caucasus country held a municipal election boycotted by the main opposition blocs amid a sweeping crackdown on dissent. Ten"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/c5b2/live/76a96bd0-a147-11f0-9be2-514f62a90aaf.png",
    "titles": [
      "Georgia protesters try to storm Tbilisi presidential palace",
      "Police fire water cannon at Georgia protesters near presidential palace",
      "Georgia: Police fire tear gas at anti-government protesters",
      "Georgia’s police use water cannons to push back protesters trying to storm presidential palace"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.927,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.775,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In Tbilisi, Georgia, police deployed water cannons and pepper spray to repel protesters attempting to storm the presidential palace following a municipal election. The demonstrations, which turned violent, were part of opposition protests against the election results, viewed as the \"last chance\" to save the country according to a former president. The main opposition blocs had boycotted the election, citing a crackdown on dissent.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Blue Jays Drop Bichette for ALDS, Yesavage to Debut",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sat, 04 Oct 2025 15:36:51 +0000",
    "source": "Global News",
    "sources": [
      "Sportsnet",
      "Sports Illustrated",
      "Global News"
    ],
    "domains": [
      "news.google.com",
      "www.sportsnet.ca",
      "globalnews.ca"
    ],
    "snippets": [
      "Bo Bichette will not be suiting up for the Toronto Blue Jays in the American League Division Series.",
      "<a href=\"https://news.google.com/rss/articles/CBMiigFBVV95cUxQYVpvT0FtNE03Z3lmNmwzdHNYWlVLN3RONndyc29jUjZQUGxlQUFPMzZ2aUlfcm95dWltRUFwMEVNaU9JTFdXUll0dWhHSnh1dEtaZHNSYVdzaFVmTVBNbnFta1B2b0pUSWN6TDhpS1hyNXYtcEhmZDlsQWl6a2JNNHZnLUZqeERJVWc?oc=5\" target=\"_blank\">Blue Jays Make Decision on Bo Bichette f",
      "<p>The Toronto Blue Jays will have to wait a little longer for Bo Bichette to make his return to the lineup. </p>",
      "<p>Former MLBer Hunter Pence joins Blair and Barker to discuss and break down the Toronto Blue Jays&#8217; blueprint for beating the New York Yankees in the ALDS, saying they need to lean into their identity of a contact-oriented and steady team.</p>"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/10/59e42da3d49e8f2be2e93406ab583c31cc8b5630b8ef04baf8b65ceec73bff45.jpg?quality=65&strip=all",
    "titles": [
      "Bichette ruled out for ALDS against Yankees",
      "Blue Jays Make Decision on Bo Bichette for ALDS Matchup vs. Yankees - Sports Illustrated",
      "Blue Jays’ Bo Bichette ruled out of ALDS against Yankees",
      "What is the blueprint for Blue Jays to beat Yankees in ALDS?"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.91,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.769,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Toronto Blue Jays have excluded shortstop Bo Bichette from their roster for the ALDS against the Yankees due to his recovery from a knee sprain. In his absence, Trey Yesavage is set to make his postseason debut after only three regular-season starts.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Russell Clinches Pole at Singapore GP, Edges Out Verstappen and Piastri",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sat, 4 Oct 2025 14:28:21 EST",
    "source": "ESPN",
    "sources": [
      "Sky Sports",
      "ESPN",
      "The Guardian"
    ],
    "domains": [
      "www.skysports.com",
      "www.espn.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "George Russell took a surprise pole position for Mercedes at the Singapore Grand Prix ahead of Red Bull's Max Verstappen in second place and championship leader Oscar Piastri in third.",
      "<ul><li><p>Rejuvenated Mercedes driver takes top spot by 0.182sec</p></li><li><p>Norris accused of impeding Dutchman’s flying lap</p></li></ul><p>George Russell is in talks to extend his contract with Mercedes, but could surely do no more to make his case than a magnificent lap on Saturday to claim ",
      "George Russell delivered a virtuoso performance under the lights to claim a stunning pole for Mercedes for the Singapore Grand Prix as second-placed Max Verstappen also outqualified the title-leading McLaren drivers."
    ],
    "image_url": "",
    "titles": [
      "Russell takes surprise Singapore pole over Verstappen",
      "Verstappen points finger at Norris after Russell grabs brilliant pole in Singapore",
      "Russell storms to Singapore pole as Verstappen beats McLarens too"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.966,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.755,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "George Russell of Mercedes secured pole position for the Singapore Grand Prix, outperforming Max Verstappen and both McLaren drivers, including title leader Oscar Piastri who placed third. Russell's impressive lap at the Marina Bay street circuit placed him 0.182 seconds ahead of Verstappen, showcasing a significant performance boost for Mercedes.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Mark Sanchez Hospitalized After Stabbing in Indianapolis, in Stable Condition",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sat, 04 Oct 2025 19:15:33 +0000",
    "source": "CBS Sports",
    "sources": [
      "Yahoo Sports",
      "CBS Sports",
      "Sportsnet"
    ],
    "domains": [
      "deadline.com",
      "www.cbssports.com",
      "www.hollywoodreporter.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "The latest on Mark Sanchez, who is in stable condition, according to Fox Sports PR",
      "The former NFL quarterback was reportedly injured on Saturday morning and is in &quot;stable condition,&quot; according to Fox Sports.",
      "Fox Sports analyst Mark Sanchez has been hospitalized after he was reportedly stabbed on Friday night in Indianapolis. The former NFL player is in “stable condition,” according to Fox, as he recovers ahead of Sunday’s game between the Colts and Las Vegas Raiders. “Mark Sanchez was injured in Indiana",
      "<p>NFL commentator and former quarterback Mark Sanchez was apparently stabbed in an overnight altercation in downtown Indianapolis and was hospitalized on Saturday.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/10/04/a4e9f857-461b-4eb8-9c39-3b8d6c018f90/sanchez.png",
    "titles": [
      "Mark Sanchez hospitalized with injuries from reported stabbing in Indianapolis ahead of Raiders vs. Colts game",
      "Fox Sports Analyst Mark Sanchez Hospitalized Following Stabbing in Indianapolis",
      "Fox Sports’ Mark Sanchez In “Stable Condition” After Stabbing In Indianapolis",
      "Mark Sanchez hospitalized in stable condition after stabbing in Indianapolis"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.982,
      "consensus": 0.809,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.738,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Former NFL quarterback and current Fox Sports analyst Mark Sanchez was hospitalized after being stabbed in an overnight altercation in downtown Indianapolis on Friday night. He is in stable condition, as confirmed by Fox Sports PR. The incident occurred ahead of Sunday's game between the Colts and the Las Vegas Raiders.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Russia Strikes Ukraine Train Station; Both Nations Target Energy Sites",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sat, 04 Oct 2025 10:41:43 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Deutsche Welle",
      "Al Jazeera",
      "New York Times"
    ],
    "domains": [
      "www.nytimes.com",
      "www.dw.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "President Zelenskyy condemns Moscow&#039;s latest strike on Ukraine&#039;s railway infrastructure.",
      "Russia has continued attacks on civilians in Ukraine with a strike targeting a passenger train station. Meanwhile, Moscow and Kyiv traded attacks on each other's energy infrastructure. DW has the latest.",
      "The drone strikes killed at least one person and injured dozens of others, officials said. The attack came amid rising alarm about the status of a nuclear plant relying solely on generators."
    ],
    "image_url": "",
    "titles": [
      "Russian attack on passenger train in Ukraine’s Sumy kills one, injures 30",
      "Ukraine updates: Russia hits passenger train, injures dozens",
      "Russian Drones Hit 2 Passenger Trains, Ukraine Says"
    ],
    "score_components": {
      "magnitude": 0.887,
      "recency": 0.821,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.722,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Russia launched an attack on Ukraine's railway infrastructure and targeted a passenger train station, causing an unspecified number of casualties. Concurrently, Moscow and Kyiv exchanged strikes on each other's energy facilities. The exact impact on the infrastructure and casualty figures have not been disclosed.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "US President Urges Israel to Stop Gaza Bombings Amid Peace Efforts",
    "domain": "general",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Sat, 04 Oct 2025 06:37:39 -0400",
    "source": "ABC News",
    "sources": [
      "ABC News",
      "Washington Post",
      "New York Times"
    ],
    "domains": [
      "www.nytimes.com",
      "abcnews.go.com",
      "www.washingtonpost.com"
    ],
    "snippets": [
      "Hamas responded to President Trump's proposal for peace in Gaza, saying it will release all remaining hostages if Israel withdraws from Gaza and \"proper field conditions are met.\"",
      "The plan aims to secure the release of Israeli hostages held in the Gaza Strip and end a two-year conflict that has reduced much of the enclave to rubble.",
      "Israel said it would cooperate with the White House to end the war, but much is still unclear about Hamas’s future and whether it will agree to disarm."
    ],
    "image_url": "https://s.abcnews.com/images/International/251004_abc_soc_hamas_hpMain_4x3_384.jpg",
    "titles": [
      "WATCH:  Hamas responds to President Trump's proposal to end Gaza war",
      "Hamas accepts Trump’s plan to end the war in Gaza, but with conditions",
      "Israel and Hamas Say They’ll Work With Trump’s Gaza Plan, but Gaps Remain"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.82,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.718,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The US President has called on Israel to halt bombings in Gaza, indicating Hamas's willingness for a 'lasting peace.' This move is part of a peace plan aimed at ending a two-year conflict and securing the release of Israeli hostages in Gaza. While Hamas agrees to aspects of the plan, it hesitates to fully endorse the proposal, particularly the demand to disarm.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Sean \"Diddy\" Combs Sentenced to Over 4 Years for Prostitution Charges",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-10-03T21:20:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "Axios",
      "ABC News",
      "CityNews"
    ],
    "domains": [
      "news.google.com",
      "abcnews.go.com",
      "www.dw.com",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "The US rapper and record producer was convicted over sexual encounters, capping a sordid federal case that featured harrowing testimony. The judge said \"these were serious offenses that irreparably harmed two women.\"",
      "<a href=\"https://news.google.com/rss/articles/CBMihwFBVV95cUxNNGVad0ZMd0hIWDZMV1dpdmxQZ2tTdTM2UncxRlMtLWlGdkM2aEZrMHEwb3dCejM2RGRiYXFmcW5XTHdRQ2VFcEJaX0YxYlphV2hLNzd6UlpKUTd2OGtpenNxM3laXzVLYnVvS3I2bXI1US1yc0IxaUxHRGZHQkVnVF9nQkc3Um8?oc=5\" target=\"_blank\">Sean \"Diddy\" Combs sentenced to four years f",
      "Sean Combs sat expressionless in his seat when the judge sentenced him to just over four years in prison Friday for his conviction on two prostitution-related offenses.",
      "Attorneys for Sean “Diddy” Combs are planning to appeal after the Grammy-winning artist and music executive was sentenced Friday to more than four years in prison for transporting people across state lines for sexual encounters. The case shattered his carefully cultivated reputation as an affable ce"
    ],
    "image_url": "",
    "titles": [
      "US: Sean 'Diddy' Combs sentenced to over 4 years in prison",
      "Sean \"Diddy\" Combs sentenced to four years for prostitution charges - Axios",
      "WATCH:  Sean 'Diddy' Combs sentenced to 50 months in prison",
      "Sean ‘Diddy’ Combs’ lawyers plan to appeal as convicted hip-hop star faces more years behind bars"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.622,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.714,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Sean \"Diddy\" Combs was sentenced to 4 years and 2 months in prison after being convicted on two counts of transportation for prostitution. In his trial, he admitted his actions were \"disgusting\" and \"shameful.\" Despite his plea for leniency and the prosecution's push for a longer sentence of 11 years and three months, the judge determined the crimes caused irreparable harm to two women and emphasized the need for a lengthy sentence to serve as a deterrent.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Blue Jays Name Rookie Yesavage as Game 2 Starter in ALDS vs Yankees",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sat, 04 Oct 2025 19:47:06 +0000",
    "source": "Global News",
    "sources": [
      "Sportsnet",
      "Global News"
    ],
    "domains": [
      "www.sportsnet.ca",
      "globalnews.ca"
    ],
    "snippets": [
      "The Toronto Blue Jays have carefully managed Trey Yesavage's innings and pitch counts across five levels of professional baseball in one season all leading up to this one moment.",
      "<p>The Blue Jays and Yankees kick off their ALDS series. Watch Kevin Gausman take the mound against Luis Gil in Game 1 on Sportsnet and Sportsnet+.</p>",
      "<p>Toronto Blue Jays rookie pitcher Trey Yesavage discusses the opportunity to start Game 2 of the ALDS against the New York Yankees, saying he is ready for the moment and that he&#8217;s &#8220;built for this.&#8221;</p>",
      "<p>Luis Gil was very good last time out against the Toronto Blue Jays. The New York Yankees hope he’ll deliver similar results in the American League Division Series opener.</p>",
      "<p>The Toronto Blue Jays are going with a rookie in Game 2 of the ALDS. Trey Yesavage will start on Sunday at home against the New York Yankees, manager John Schneider announced on Saturday.</p>"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/10/c5fb074b1ed904307c597aeadfedd1aa23b67bb41b3a8f606566954450c67ccb.jpg?quality=65&strip=all",
    "titles": [
      "Rookie Yesavage to start ALDS Game 2 for Blue Jays",
      "ALDS on Sportsnet: Blue Jays vs. Yankees, Game 1",
      "‘I’m built for this’: Blue Jays’ Yesavage ready to start Game 2",
      "Yankees’ Luis Gil to start Game 1 of ALDS vs. Blue Jays",
      "Blue Jays name Trey Yesavage as Game 2 starter vs. Yankees"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.992,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.703,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Toronto Blue Jays have announced rookie pitcher Trey Yesavage as the starter for Game 2 of the ALDS against the New York Yankees, following careful management of his innings and pitch counts across multiple levels. Yesavage expressed confidence in his readiness for the challenge. The series begins with Kevin Gausman facing Luis Gil in Game 1, with the Yankees looking for Gil to replicate his previous successful performance against the Blue Jays.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Canada Post Workers' Union Slams Latest Contract Offers",
    "domain": "business",
    "source_domain": "financialpost.com",
    "location": "national",
    "published": "Sat, 04 Oct 2025 18:05:36 +0000",
    "source": "Financial Post",
    "sources": [
      "Financial Post",
      "CityNews"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "financialpost.com"
    ],
    "snippets": [
      "The union representing Canada Post workers says the Crown corporation is &#8220;making a mockery of the collective bargaining process&#8221; with its latest contract offers. In a statement released Friday, the union said it is disappointed with the latest offer, which it calls a &#8220;major step ba",
      "The union representing Canada Post workers says the Crown corporation is &#8220;making a mockery of the collective bargaining process&#8221; with its latest contract offers. In a statement released Friday, the union said it is disappointed with the latest offer, which it calls a &#8220;major step ba"
    ],
    "image_url": "",
    "titles": [
      "Canada Post union says latest contract offer is a ‘major step backwards’",
      "Canada Post union says latest contract offer is a ‘major step backwards’"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.958,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.697,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The union for Canada Post workers criticized the corporation's latest contract offers as a \"mockery of the collective bargaining process\" and a \"major step back.\" They expressed disappointment in a statement released Friday.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Munich Airport Reopens After Drone Sightings Affect 6,500",
    "domain": "business",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sat, 04 Oct 2025 15:52:35 +0000",
    "source": "Global News",
    "sources": [
      "Financial Post",
      "Global News"
    ],
    "domains": [
      "financialpost.com",
      "globalnews.ca"
    ],
    "snippets": [
      "Munich Airport reopens after second drone disruption in 24 hrs; over 6,500 affected as EU faces surge in mysterious drone flyovers near key infrastructure.",
      "MUNICH (AP) &#8212; Germany&#8217;s Munich Airport reopened Saturday morning after authorities shut it down the night before for the second time in less than 24 hours after two additional drone sightings, officials said. The closures are the latest after mysterious drone overflights in the airspace "
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/10/cacf9be6e2bf60527f72a9235abe2ae842eee940418de51564d21ba2d3436804.jpg?quality=65&strip=all",
    "titles": [
      "Germany’s Munich Airport reopens after second closure in less than 24 hours due to drones",
      "Germany’s Munich Airport reopens after second closure in less than 24 hours due to drones"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.915,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.695,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Munich Airport reopened after being closed twice in less than 24 hours due to drone sightings, affecting over 6,500 people. This incident is part of a surge in mysterious drone activities near key infrastructure across the EU.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Mariners Drop Woo from ALDS Roster, Blue Jays Sideline Veterans Against Yankees",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sat, 4 Oct 2025 15:17:21 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.espn.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "The Mariners left All-Star starter Bryan Woo off their AL Division Series roster, a clear indication that he has not fully recovered from a pectoral injury.",
      "<p>The Seattle Mariners will be without one of their most important arms in the ALDS.</p>",
      "<p>The Toronto Blue Jays finalized their roster for the American League Division Series against the New York Yankees, and two veteran pitchers will be watching from the sidelines. </p>"
    ],
    "image_url": "",
    "titles": [
      "Mariners leave All-Star Woo off ALDS roster",
      "Mariners ace Bryan Woo to miss ALDS vs. Tigers with pectoral injury",
      "Blue Jays leave Chris Bassitt, Max Scherzer off ALDS roster"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.982,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.683,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Seattle Mariners have excluded All-Star starter Bryan Woo from their AL Division Series roster due to an incomplete recovery from a pectoral injury. Meanwhile, the Toronto Blue Jays have also made their roster decisions for the ALDS against the New York Yankees, sidelining two veteran pitchers for the series.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Netanyahu Vows Quick Hostage Return, Sends Team to Egypt for Gaza Plan Talks",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-10-04T18:47:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "New York Times"
    ],
    "domains": [
      "www.nytimes.com",
      "www.dw.com"
    ],
    "snippets": [
      "Israeli Prime Minister Netanyahu said he wants to see hostages returned in the coming days. He also said a team has been sent to Egypt \"to finalize technical details\" of Trump's plan for the future of Gaza. Follow DW.",
      "The families of hostages have reacted with a mix of optimism and trepidation, urging the Israeli government to not squander the opportunity."
    ],
    "image_url": "",
    "titles": [
      "Netanyahu hopes Gaza hostages return home in coming days",
      "The Next Steps for Hostages in Gaza"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.972,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.659,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Israeli Prime Minister Netanyahu announced intentions to secure the return of hostages within days and has dispatched a team to Egypt to conclude technical aspects of Trump's Gaza plan. The hostages' families express cautious optimism, urging the government to seize this chance for resolution.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "U.S. Treasury Considers New $1 Coin with Trump for 250th Anniversary",
    "domain": "general",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Sat, 04 Oct 2025 14:30:59 -0400",
    "source": "ABC News",
    "sources": [
      "ABC News",
      "The Guardian"
    ],
    "domains": [
      "abcnews.go.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "The U.S. treasurer said on Friday that Treasury is considering minting new one-dollar coins for the nation's 250th anniversary featuring President Trump's image.",
      "<p>US treasurer says officials looking at drafts for country’s 250th anniversary featuring president with raised fist</p><p>To commemorate the 250th anniversary of the US’s independence, the treasury department is mulling production of a $1 coin displaying <a href=\"https://www.theguardian.com/us-new"
    ],
    "image_url": "https://s.abcnews.com/images/US/donald-trump-33-rt-gmh-250930_1759256171129_hpMain_4x3t_384.jpg",
    "titles": [
      "Trump administration considers minting a $1 Trump coin",
      "US treasury considers special $1 Trump coin reading ‘fight, fight, fight’"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.966,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.655,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The U.S. Treasury is exploring the creation of a new one-dollar coin to celebrate the country's 250th anniversary, featuring an image of President Trump with a raised fist. This consideration was confirmed by the U.S. Treasurer on Friday.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Hamas Agrees to Release Hostages, Engages in Peace Talks with Trump's Plan",
    "domain": "general",
    "source_domain": "www.washingtonpost.com",
    "location": "global",
    "published": "Sat, 04 Oct 2025 15:14:32 +0000",
    "source": "Washington Post",
    "sources": [
      "Washington Post",
      "New York Times"
    ],
    "domains": [
      "www.nytimes.com",
      "www.washingtonpost.com"
    ],
    "snippets": [
      "Both sides have backed President Trump’s peace plan to free all Israeli hostages — but key differences remain on how Israel’s military would withdraw from Gaza.",
      "President Trump said he believed Hamas was “ready for a lasting peace” after the militant group offered to release hostages and discuss the U.S.-led peace proposal."
    ],
    "image_url": "",
    "titles": [
      "Israel pauses Gaza City push after Hamas accepts Trump plan with conditions",
      "Trump Calls on Israel to Stop Bombing Gaza After Hamas Agrees to Parts of Cease-Fire Plan"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.903,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.653,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Hamas has agreed to release Israeli hostages and accepted parts of President Trump's peace plan to end the nearly two-year war, but seeks further negotiations on many terms. Trump has ordered Israel to immediately stop bombing Gaza, signaling a potential move towards peace. Despite not fully agreeing to the U.S. proposal, Hamas's willingness to discuss the plan and release hostages has been acknowledged by Trump as a step towards achieving lasting peace in the Middle East.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Brewers' Chourio Injured in NLDS Opener After Historic Hits",
    "domain": "sports",
    "source_domain": "sports.yahoo.com",
    "location": "national",
    "published": "Sat, 04 Oct 2025 19:33:47 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "sports.yahoo.com"
    ],
    "snippets": [
      "Milwaukee's Jackson Chourio left Saturday's NL Division Series opener against the Chicago Cubs with a hamstring injury after becoming the first player to have three hits in the first two innings of a postseason game.  Chourio spent a month on the injured list after straining his right hamstring whil",
      "<p>After racing out to a 9-1 lead in Game 1 of the NLDS, the early excitement for the Milwaukee Brewers was tempered by an injury to one of their top players.</p>"
    ],
    "image_url": "",
    "titles": [
      "Brewers' Chourio leaves NLDS Game 1 with hamstring injury after getting 3 hits in first 2 innings",
      "Brewers star outfielder Jackson Chourio leaves vs. Cubs with hamstring injury"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.988,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.653,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Milwaukee Brewers' Jackson Chourio was injured during the NL Division Series opener against the Chicago Cubs after making history with three hits in the first two innings of a postseason game. He left the game due to a hamstring injury, having previously spent a month on the injured list for a similar issue. The Brewers led 9-1 early in the game despite Chourio's exit.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Hull KR Beats St Helens 20-12, Advances to Super League Final vs Wigan",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "national",
    "published": "Sat, 04 Oct 2025 19:31:30 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports",
      "Sky Sports"
    ],
    "domains": [
      "www.skysports.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Oliver Gildart's two second-half tries give Hull Kingston Rovers a Grand Final clash with Wigan Warriors in next week's Super League Grand Final.",
      "Hull KR secured their place in the Super League Grand Final with a 20-12 victory over St Helens at Sewell Group Craven Park."
    ],
    "image_url": "",
    "titles": [
      "Hull KR beat Saints to reach Grand Final",
      "Hull KR secure Super League Grand Final spot with steely win over Saints"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.987,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.652,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Oliver Gildart scored twice in the second half to lead Hull Kingston Rovers to a 20-12 win over St Helens, securing a spot in the Super League Grand Final against Wigan Warriors next week.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Over 440 Arrested at London Rally Despite Calls to Postpone After Attack",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 04 Oct 2025 19:54:23 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "www.bbc.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Demonstrations went ahead despite calls from politicians and police leaders for the protests to be postponed in wake of the Manchester synagogue attack.",
      "<p>Officers arrest activists at silent vigil in support of banned organisation, as demos go ahead despite PM’s pleas</p><p>Police have made more than 440 arrests in London at what organisers hoped would be the biggest demonstration so far against a ban on the proscribed organisation Palestine Action"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/6b09/live/9d0674b0-a135-11f0-a9f1-8d9167fcc08f.png",
    "titles": [
      "Hundreds arrested at Palestine Action protest in London",
      "Police make more than 440 arrests at Palestine Action protest in London"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.974,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.65,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Despite requests from politicians and police to delay protests following the Manchester synagogue attack, demonstrations proceeded. In London, over 440 arrests were made during a large rally against the ban on Palestine Action. This included activists at a silent vigil.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "DFS Expert McClure Shares Week 5 Picks, Focuses on Fields and Lions",
    "domain": "business",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sat, 04 Oct 2025 18:14:58 +0000",
    "source": "CBS Sports",
    "sources": [
      "Forbes",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "www.forbes.com"
    ],
    "snippets": [
      "SportsLine's model reveals its Week 5 Fantasy football projections, PPR rankings, start-sit advice for sites like CBS Sports, ESPN and Yahoo",
      "The best Week 5 fantasy football DFS stacks and value plays for DraftKings main Sunday slate. Playing the Justin Fields chalk and the Detroit Lions onslaught to win."
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/10/03/3bc757ee-b265-4efe-964a-676f12dfbb0d/devonta-smith-eagles-imagn-images.jpg",
    "titles": [
      "Fantasy Football Rankings, sleepers, streamers, cheat sheets for NFL Week 5, 2025 in PPR, standard",
      "NFL Week 5 Fantasy Football DraftKings DFS Stacks And Value Picks"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.961,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.647,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "DFS expert Mike McClure has revealed his top picks and lineup advice for Week 5's main Sunday slate in daily fantasy football. His strategy includes playing Justin Fields and focusing on the Detroit Lions for a winning lineup. This advice is specifically for DraftKings players.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Belichick's First Season at UNC Marked by Challenges, Loss to Clemson",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sat, 04 Oct 2025 18:03:13 +0000",
    "source": "CBS Sports",
    "sources": [
      "Yahoo Sports",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "clemsonwire.usatoday.com"
    ],
    "snippets": [
      "Belichick's much-anticipated first season at North Carolina has already flown off the rails",
      "Clemson gets a much-needed win, putting a beatdown on a struggling North Carolina."
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/10/04/c6e87b44-fc4a-4533-a3e9-38a9d4035278/adobe-express-file-22.jpg",
    "titles": [
      "Bill Belichick buyout: What would it cost North Carolina to move on from coach as Tar Heels struggle in 2025",
      "Dabo Swinney, Clemson Tigers embarrass Bill Belichick, North Carolina Tar Heels at UNC"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.957,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.646,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In his first season coaching at North Carolina, Belichick has faced challenges as the team struggles. Clemson secured a decisive victory against North Carolina, highlighting the difficulties Belichick's team is encountering.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "OpenAI's Sora App Features Copyrighted Characters, Signals IP Strategy Shift",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Sat, 04 Oct 2025 12:00:01 GMT",
    "source": "CNBC",
    "sources": [
      "TechCrunch",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "techcrunch.com"
    ],
    "snippets": [
      "CNBC has seen videos of characters from shows like \"SpongeBob SquarePants\" on the platform and was able to independently generate other characters.",
      "OpenAI may be reversing course on how it approaches copyright and intellectual property in its new video app Sora."
    ],
    "image_url": "",
    "titles": [
      "AI Sam Altman and the Sora copyright gamble: 'I hope Nintendo doesn't sue us'",
      "Sam Altman says Sora will add ‘granular,’ opt-in copyright controls"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.826,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.637,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "OpenAI's new video app Sora, as observed by CNBC, features characters from copyrighted shows like \"SpongeBob SquarePants.\" This development suggests that OpenAI might be changing its approach to copyright and intellectual property rights in its applications.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Taylor Swift's \"The Life of a Showgirl\" Sets Records After Friday Release",
    "domain": "business",
    "source_domain": "www.businessinsider.com",
    "location": "global",
    "published": "2025-10-04T19:17:09Z",
    "source": "Business Insider",
    "sources": [
      "Business Insider"
    ],
    "domains": [
      "www.businessinsider.com"
    ],
    "snippets": [
      "Taylor Swift released her 12th studio album, \"The Life of a Showgirl,\" on Friday and its already breaking records.",
      "In this Saturday edition of Business Insider Today, we're talking about Taylor Swift's latest album, \"The Life of a Showgirl.\""
    ],
    "image_url": "https://i.insider.com/68e169401c1f80efbec4f179?format=jpeg",
    "titles": [
      "Taylor Swift is breaking her own records with 'The Life of a Showgirl'",
      "Taylor Swift's 12th album is out. BI breaks down what 'The Life of a Showgirl' is all about."
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.982,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.464,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Taylor Swift released her 12th studio album, \"The Life of a Showgirl,\" on Friday, which is already setting new records. The album's immediate impact was highlighted in the Saturday edition of Business Insider Today.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]