[
  {
    "title": "Trump to Sign Order Renaming Defense Department to Department of War",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Thu, 04 Sep 2025 22:18:13 -0400",
    "source": "NPR",
    "sources": [
      "Forbes",
      "Axios",
      "Al Jazeera",
      "The Guardian",
      "Deutsche Welle",
      "BBC",
      "NPR"
    ],
    "domains": [
      "www.npr.org",
      "www.forbes.com",
      "www.aljazeera.com",
      "www.theguardian.com",
      "news.google.com",
      "www.bbc.com",
      "www.dw.com"
    ],
    "snippets": [
      "The change would return the department to a name that it carried for much of its history, until it became the Department of Defense in the wake of World War II.",
      "The US president has sought to refocus the department on \"warfighting\" and a \"warrior ethos\".",
      "President Donald Trump recently said &#039;defence is too defensive&#039; as the US wants &#039;to be offensive too&#039;.",
      "US President Donald Trump is set to sign an executive order to change the name of the Department of Defense to the \"Department of War.\" This would revive a name that was abandoned over seven decades ago.",
      "<a href=\"https://news.google.com/rss/articles/CBMid0FVX3lxTE5ENDJYTUxaT3Y3VXNfdWxGXzM0VlF0dnlubDdzbGtXTi1VWlVSdmtKYl9TV3o3WGpXc0JUOXozV2c4VWFZbDhYY3pUeHYyYW01Z3RzeUVMNk04MkJ3Ni1obkhGOWtCS3ZCekpZVEdwd0U3XzZTQVIw?oc=5\" target=\"_blank\">Trump seeks to rename Department of Defense to Department of War</a",
      "<p>Order would authorize Pete Hegseth, the defense secretary, to introduce legislation to revert to pre-1947 name. This blog is now closed.</p><p><strong>Health secretary Robert F</strong><strong> Kennedy Jr</strong><strong> will appear before a congressional committee on Thursday, where he’s expect",
      "The name change will be made official through an executive order Trump is slated to sign Friday."
    ],
    "image_url": "",
    "titles": [
      "President Trump plans to rename the Defense Department as the Department of War",
      "Trump to rebrand Pentagon as Department of War",
      "US Department of Defense to be renamed ‘Department of War’: Report",
      "US: Trump to relabel Pentagon as 'Department of War'",
      "Trump seeks to rename Department of Defense to Department of War - Axios",
      "Trump plans to sign executive order to rename Pentagon to ‘Department of War’ – as it happened",
      "Defense Department Being Renamed Department Of War Under Trump Executive Order"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.884,
      "consensus": 1.0,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.862,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "President Trump plans to sign an executive order renaming the Department of Defense to the Department of War, emphasizing a focus on \"warfighting\" and a \"warrior ethos.\" The change, which can be used in official correspondence and ceremonial contexts, requires Congressional approval for full implementation.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Eagles' Jalen Carter Ejected for Spitting, Eagles Beat Cowboys 24-20",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 05 Sep 2025 06:52:20 GMT",
    "source": "BBC",
    "sources": [
      "ESPN",
      "Sportsnet",
      "Sky Sports",
      "The Guardian",
      "ABC News",
      "Yahoo Sports",
      "CBS Sports",
      "BBC",
      "Sports Illustrated"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com",
      "www.theguardian.com",
      "www.skysports.com",
      "news.google.com",
      "www.bbc.com",
      "abcnews.go.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Philadelphia Eagles' Jalen Carter is dismissed for spitting as his side beat the Dallas Cowboys 24-20 in a season opener that included a 65-minute weather delay.",
      "Philadelphia Eagles defensive tackle Jalen Carter was ejected moments after a pregame Super Bowl championship celebration for spitting on Dallas quarterback Dak Prescott",
      "Eagles defensive tackle Jalen Carter was ejected from Thursday night's season-opening win before the first play from scrimmage for spitting on Cowboys quarterback Dak Prescott.",
      "Carter was ejected before the first play from scrimmage",
      "Philadelphia Eagles' Jalen Carter is dismissed for spitting as his side beat the Dallas Cowboys 24-20 in a season opener that included a 65-minute weather delay.",
      "<ul><li><p>Dallas Cowboys 20-24 Philadelphia Eagles</p></li><li><p>Philadelphia DT thrown out after confrontation</p></li></ul><p>The defending Super Bowl champions got their title defence off to a winning start as they beat the Dallas Cowboys 24-20 in the NFL season opener on Thursday night.</p><p>",
      "<a href=\"https://news.google.com/rss/articles/CBMigAFBVV95cUxOSkJNTUlzTFFMMHFPb3ZtUm1OdDVza2ZETWVGTGwwdGhUSFJzdHRJRzVoREpQREtXR0dFMHgyTS0zWEIwYTh2V0tWazZwRTQ2T0JnNlh4Z2M2Um80WFY1aWxIam5zNGVNUUE0N2k1TlNVQmVoSUZaNmJicGQzZ1h5Vg?oc=5\" target=\"_blank\">Eagles’ Jalen Carter Ejected Before a Single Snap Aft",
      "<a href=\"https://news.google.com/rss/articles/CBMikwFBVV95cUxNWXBtWGdXVXh2ZF9SWHZPUTNpSUdoX3BmOXFDeG1kUDc5RUdpNWh3Y2gwUURaX2c2YVlnTlg0SHBsR2xNYTlueFpDaWVHdzV4aXlqcWNiWU9DXzAtNk9zcUtsdEc5Nkh2aEtsVUkweWQ5aUdQaFN3T1lJbXgwV0V5ZTlZUV9rZ1VROEpqdnlzUnRXcUk?oc=5\" target=\"_blank\">Jalen Carter Getting Ejected",
      "Philadelphia Eagles defensive tackle Jalen Carter was ejected from the game before the first play against the Dallas Cowboys after spitting on Dak Prescott.",
      "Jalen Hurts rushed for two touchdowns while Jalen Carter was ejected for spitting at Dak Prescott as the Super Bowl champion Philadelphia Eagles&#160;opened the 2025 NFL season with a 24-20 victory over the Dallas Cowboys.",
      "<p>Philadelphia Eagles defensive tackle Jalen Carter was ejected moments after a pregame Super Bowl championship celebration for spitting on Dallas quarterback Dak Prescott.</p>",
      "<p>Watch as Philadelphia Eagles&#8217; Jalen Carter is ejected before taking his first defensive snap of the season, after spitting on Dallas Cowboys quarterback Dak Prescott during an injury timeout.</p>"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/54cc/live/3665e020-8a23-11f0-9e7e-b3fca215fe16.jpg",
    "titles": [
      "Carter ejected for spitting as Eagles open with win",
      "Eagles' Jalen Carter ejected for spitting on Cowboys' Dak Prescott",
      "Carter sorry for spitting on Prescott: 'A mistake'",
      "Jalen Carter ejected for spitting on Dak Prescott after opening kickoff of Eagles vs. Cowboys season opener",
      "Carter ejected for spitting as Eagles open with win",
      "Eagles squeeze past Cowboys as Carter ejected for spitting on Prescott six seconds into season",
      "Eagles’ Jalen Carter Ejected Before a Single Snap After Spitting on Dak Prescott - Sports Illustrated",
      "Jalen Carter Getting Ejected for Spitting on Dak Prescott Sent NFL Fans in a Tizzy - Sports Illustrated",
      "Eagles' Carter ejected for spitting on first play of NFL season",
      "Carter ejected for spitting after six seconds as Eagles beat Cowboys in NFL opener",
      "Eagles’ Carter apologizes following ejection for spitting on Cowboys’ Prescott",
      "Eagles’ Carter ejected on opening drive after spitting on Prescott"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.952,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.84,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Philadelphia Eagles defensive tackle Jalen Carter was ejected before the first play of the NFL season opener for spitting on Dallas Cowboys quarterback Dak Prescott. Despite the incident and a 65-minute weather delay, the Eagles defeated the Cowboys 24-20.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Anisimova to Face Sabalenka in US Open Final After Defeating Osaka",
    "domain": "sports",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Thu, 04 Sep 2025 13:38:55 -0400",
    "source": "NPR",
    "sources": [
      "ESPN",
      "Al Jazeera",
      "Sportsnet",
      "Sky Sports",
      "NPR"
    ],
    "domains": [
      "www.espn.com",
      "www.npr.org",
      "www.aljazeera.com",
      "www.skysports.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Amanda Anisimova beat Naomi Osaka in the U.S. Open semifinals early Friday in a tense, three-set match. Both players have been climbing up the rankings after taking mental health breaks from the sport.",
      "Reigning champ Aryna Sabalenka beat Jessica Pegula while Amanda Anisimova upset Naomi Osaka to make first US Open final.",
      "Defending champion Aryna Sabalenka will face Amanda Anisimova in the U.S. Open women's final.",
      "Amanda Anisimova made it through to consecutive Grand Slam finals and a shot at ultimate redemption with a showdown against defending US Open champion Aryna Sabalenka.",
      "<p>Defending champion Aryna Sabalenka was simply too good for Jessica Pegula yet again, winning their U.S. Open semifinal 4-6, 6-3, 6-4 on Thursday night in a rematch of last year&#8217;s final.</p>"
    ],
    "image_url": "",
    "titles": [
      "A clash of the comebacks: Anisimova outlasts Osaka in the U.S. Open semifinals",
      "Osaka knocked out of US Open; Sabalenka to play Anisimova in final",
      "Anisimova wins, sets up Open final vs. Sabalenka",
      "Anisimova sets up US Open final against defending champion Sabalenka",
      "Defending champion Aryna Sabalenka to face Amada Anisimova in US Open final"
    ],
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.738,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.802,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Amanda Anisimova defeated Naomi Osaka in a tense, three-set match to reach the U.S. Open women's final, where she will face defending champion Aryna Sabalenka. Sabalenka secured her spot in the final by beating Jessica Pegula. Both Anisimova and Sabalenka have shown strong performances after taking mental health breaks, with Anisimova aiming for her first US Open title against the reigning champion.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "49ers' McCaffrey on Injury Report with Calf Issue Before Season Opener",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Fri, 5 Sep 2025 00:59:24 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Running back Christian McCaffrey was added to the San Francisco 49ers' injury report Thursday night because of a calf issue.",
      "McCaffrey was limited to just four games in 2024 due to injury",
      "<p>San Francisco 49ers star running back Christian McCaffrey was added to the team&#8217;s injury report with a calf injury three days before the season opener.</p>"
    ],
    "image_url": "",
    "titles": [
      "49ers add McCaffrey to injury report with calf issue",
      "Christian McCaffrey injury: 49ers star running back limited during Thursday's practice with calf issue",
      "49ers’ Christian McCaffrey added to injury report with calf issue ahead of Week 1"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.935,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.749,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Christian McCaffrey, the San Francisco 49ers running back, was listed on the team's injury report with a calf issue ahead of the season opener. This comes after he was limited to just four games in 2024 due to injuries.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Golden State Valkyries Secure Playoff Spot in Debut Season with Win Over Wings",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Fri, 5 Sep 2025 00:59:25 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "The Golden State Valkyries became the first WNBA team to reach the playoffs in its inaugural season when they defeated the Dallas Wings on Thursday.",
      "Golden State clinched a playoff spot with a win over the Wings on Thursday",
      "<p>The Golden State Valkyries became the first WNBA team to reach the playoffs in its inaugural season Thursday night, with Janelle Salaun scoring 19 points in an 84-80 comeback victory against the Dallas Wings for their fifth straight win.</p>"
    ],
    "image_url": "",
    "titles": [
      "Valkyries make WNBA history with playoff debut",
      "Valkyries become first expansion team in WNBA history to make playoffs in inaugural season",
      "Valkyries beat Wings, reach playoffs in inaugural season"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.935,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.749,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Golden State Valkyries made history by becoming the first WNBA team to reach the playoffs in their inaugural season, securing their spot with an 84-80 win over the Dallas Wings. Janelle Salaun led the victory with 19 points, marking the team's fifth consecutive win.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Thaksin Shinawatra Leaves for Dubai Ahead of Court Verdict and PM Vote",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-09-05T05:51:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "New York Times",
      "The Guardian",
      "Deutsche Welle"
    ],
    "domains": [
      "www.nytimes.com",
      "www.theguardian.com",
      "www.dw.com"
    ],
    "snippets": [
      "Thaksin flew to Dubai days ahead of court ruling that could see him jailed, overshadowing a vote for a new prime minister of Thailand.",
      "Mr. Thaksin flew to Dubai days before a verdict that could send him to prison. He said he would be back in time for the hearing.",
      "<p>After questions over whether the former prime minister was going back into exile, Thaksin said he would return no later than Monday to attend court</p><p>Thailand’s influential former prime miniser Thaksin Shinawatra flew out of the country on Thursday, police said, a day before a parliamentary v"
    ],
    "image_url": "",
    "titles": [
      "Thaksin Shinawatra leaves Thailand as parliament vote on new prime minister",
      "Thailand Ex-Premier Thaksin Shinawatra Abruptly Leaves Country",
      "Former PM Thaksin Shinawatra leaves Thailand days ahead of court ruling that could see him jailed"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.952,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.734,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Thailand's former Prime Minister Thaksin Shinawatra traveled to Dubai shortly before a court ruling that might imprison him, casting a shadow over Thailand's prime ministerial vote. Despite concerns of exile, Thaksin announced his intention to return by Monday to face the verdict. His departure occurred one day before a significant parliamentary vote.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Eagles Win Week 1 Amid \"Spitgate\" Controversy",
    "domain": "sports",
    "source_domain": "www.bleedinggreennation.com",
    "location": "national",
    "published": "Fri, 05 Sep 2025 07:29:12 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Sportsnet",
      "Sports Illustrated",
      "Yahoo Sports"
    ],
    "domains": [
      "www.bleedinggreennation.com",
      "news.google.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Highlights and lowlights from Philadelphia’s Week 1 win.",
      "<a href=\"https://news.google.com/rss/articles/CBMimAFBVV95cUxQZXJEbGFOVnNSZHhqZGpSbWJsckJMVEJYUXIya09IeVM1cnlsYTRrdUlwRXlJSEdCMUtpMjN6YzdwUGtERGxydmJVQ3dBMm5CLVItZVZyZm52TGh3UUFLTlBPdWxqNW1MWVNlMHNnb1h0NkdIMzFZS1E1WUhOZmstZXk4NWR1ZnhFNWRpSHVMNmN0Rk9GT1JzTA?oc=5\" target=\"_blank\">Eagles Make Surprisin",
      "<a href=\"https://news.google.com/rss/articles/CBMid0FVX3lxTE9Nb2pVMkRra3BKRjB6RzNCMGtaa2liYmI0a092YzJBTTc5NDBUbFgzd25iVHZFclFIeUlHYngtdEFYbkNKejNUTERySXlOeUtOS0hrZm15bVJBY182SVplZFpzRUNXMWVBbm1SRU12d2c4YWxOaVBJ?oc=5\" target=\"_blank\">SI:AM | Eagles’ Quest to Repeat Starts Now</a>&nbsp;&nbsp;<font col",
      "<p>The NFL got off to a spitting start &#8230; yes, literally. With the eyes of the sports world on the opening game of the NFL season, many took to social media to share their account of &#8220;spitgate.&#8221; Here are some of the best responses.</p>"
    ],
    "image_url": "",
    "titles": [
      "Eagles vs. Cowboys: The good, the bad, and the ugly",
      "Eagles Make Surprising Moves With Inactives Vs. Cowboys - Sports Illustrated",
      "SI:AM | Eagles’ Quest to Repeat Starts Now - Sports Illustrated",
      "The two sides of ‘spitgate’ in Eagles vs. Cowboys"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.985,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.734,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Philadelphia Eagles secured a win in their Week 1 game, marking a positive start to their quest for a repeat season. The game, which caught significant attention, was also marred by an incident widely discussed on social media, referred to as \"spitgate.\"",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Clippers Accused of $28M \"No-Show\" Deal for Leonard; Ballmer Denies Wrongdoing",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Fri, 05 Sep 2025 07:15:06 +0000",
    "source": "CBS Sports",
    "sources": [
      "Sportsnet",
      "CBS Sports",
      "Yahoo Sports"
    ],
    "domains": [
      "sports.yahoo.com",
      "www.cbssports.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "The Clippers are accused of facilitating a $28 million \"no-show\" endorsement deal for Leonard",
      "Ballmer insisted that the Clippers didn't circumvent the salary cap and that he'd been 'conned' by a company whose co-founder recently pleaded guilty to fraud.",
      "<p>Los Angeles Clippers owner Steve Ballmer says he did nothing wrong when negotiating Kawhi Leonard&#8217;s contract.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/05/fbf7ffdd-af8a-4270-a048-187fcdfcfa32/gettyimages-2190009550-2.jpg",
    "titles": [
      "Clippers owner Steve Ballmer doubles down on denial of Kawhi Leonard salary cap circumvention allegations",
      "Clippers' Steve Ballmer claims ignorance over reported $28M Kawhi Leonard deal, says third-party company 'conned me'",
      "Clippers owner Steve Ballmer denies team broke salary-cap rules with Kawhi Leonard"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.98,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.733,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Los Angeles Clippers are accused of arranging a $28 million \"no-show\" endorsement deal for Kawhi Leonard. Owner Steve Ballmer denies circumventing the salary cap, stating he was misled by a company involved in fraud, with a co-founder pleading guilty.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Tyson vs. Mayweather Exhibition Match Set for Early 2026",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Fri, 05 Sep 2025 00:18:56 +0000",
    "source": "CBS Sports",
    "sources": [
      "Sportsnet",
      "Forbes",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "www.sportsnet.ca",
      "www.forbes.com"
    ],
    "snippets": [
      "The two legendary fighters have said that they signed on for a match, but no info on date or location has been announced",
      "Mike Tyson and Floyd Mayweather are going to clash in an exhibition match. Yes, you read that correctly. Here's what you need to know.",
      "<p>Mike Tyson and Floyd Mayweather Jr. are set to meet in an early 2026 matchup of boxing Hall of Famers.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/05/39e1e411-282e-4ca0-9d5d-3f70ab11fd78/mike-tyson-corner.jpg",
    "titles": [
      "Mike Tyson vs. Floyd Mayweather? Boxing legends agree to match in 2026, per press release",
      "Mike Tyson Vs. Floyd Mayweather Is Real And Here’s the Details",
      "Mike Tyson, Floyd Mayweather Jr. set to meet in exhibition boxing match in 2026"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.848,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.706,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Mike Tyson and Floyd Mayweather Jr. have agreed to fight in an exhibition match scheduled for early 2026. Details regarding the date and location of the match have not yet been announced.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Germany Suffers Historic 2-0 Loss to Slovakia in World Cup Qualifier",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Thu, 04 Sep 2025 21:51:36 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Sportsnet",
      "Al Jazeera",
      "Deutsche Welle"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.sportsnet.ca",
      "www.dw.com"
    ],
    "snippets": [
      "Germany begin their World Cup qualifying group with defeat by Slovakia, the third straight loss for four-time winners.",
      "Germany's 2026 World Cup qualifying campaign got off to a disastrous start as they suffered a deserved 2-0 defeat to Slovakia. Furious head coach Julian Nagelsmann questioned his team's mentality.",
      "<p>Germany lost an away World Cup qualifying game for the first time in a 2-0 upset against Slovakia on Thursday, which threw its campaign to reach the 2026 tournament into immediate jeopardy.</p>"
    ],
    "image_url": "",
    "titles": [
      "Germany shocked by Slovakia with third loss in row as World Cup path begins",
      "Germany suffer shock World Cup qualifying loss to Slovakia",
      "Germany stunned by Slovakia in rare World Cup qualifying loss"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.806,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.698,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Germany's 2026 World Cup qualifying campaign began with a historic 2-0 defeat to Slovakia, marking their first-ever away loss in a World Cup qualifier. This setback is Germany's third consecutive defeat, putting their campaign for the 2026 tournament in jeopardy. Head coach Julian Nagelsmann expressed frustration over the team's performance and mentality.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Tech Leaders Attend White House AI Event; Musk Absent",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Thu, 04 Sep 2025 18:38:42 GMT",
    "source": "CNBC",
    "sources": [
      "The Guardian",
      "CNBC",
      "Business Insider"
    ],
    "domains": [
      "www.businessinsider.com",
      "www.cnbc.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Invitees include Meta founder Mark Zuckerberg, Apple CEO Tim Cook, Microsoft founder Bill Gates and OpenAI founder Sam Altman. Elon Musk will not attend.",
      "<p>Tesla CEO’s absence is marked departure from his constant presence at the White House in early days of Trump 2.0</p><p>As <a href=\"https://www.theguardian.com/us-news/donaldtrump\">Donald Trump</a> hosted leaders from the biggest US tech companies at a lavish White House state dining room dinner o",
      "Top tech executives from Google and OpenAI flocked to the White House for an AI education event and praised President Donald Trump over dinner."
    ],
    "image_url": "",
    "titles": [
      "Musk will not attend Trump tech CEO dinner at White House",
      "Trump hosts US tech leaders at White House dinner – minus Elon Musk",
      "Sam Altman, Tim Cook, and other tech leaders lauded Trump at a White House AI dinner"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.738,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.691,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "At a White House AI education event hosted by President Donald Trump, top tech executives including Meta's Mark Zuckerberg, Apple's Tim Cook, Microsoft's Bill Gates, and OpenAI's Sam Altman were present. Notably absent was Tesla CEO Elon Musk, marking a significant change from his previous frequent visits during the early days of Trump's administration. The event received praise from attendees.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Fever's Playoff Hopes Dampened as Caitlin Clark Sidelined for Season",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Fri, 5 Sep 2025 00:43:38 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "The Fever continue their playoff chase without Caitlin Clark, who was ruled out for the rest of the season Thursday.",
      "The massive audience that Clark commands was left disappointed in 2025"
    ],
    "image_url": "",
    "titles": [
      "Caitlin Clark’s season is over: What comes next for the Fever star?",
      "Caitlin Clark's injury-plagued sophomore season was a disaster for the WNBA, the Fever and herself"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.93,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.683,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Fever will proceed with their playoff ambitions minus Caitlin Clark, who, as of Thursday, is sidelined for the remainder of the season. This development has notably disappointed her substantial fanbase in 2025.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Iconic Fashion Designer Giorgio Armani Dies at 91",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 04 Sep 2025 13:34:28 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC",
      "Deutsche Welle"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com",
      "www.dw.com"
    ],
    "snippets": [
      "He worked his way up from a Milan department store to a global empire that changed the way we dress.",
      "The Piacenza native founded the Milan-based luxury fashion company of the same name in 1975. Prime Minister Giorgia Meloni called him a \"symbol of the best of Italy.\"",
      "<p>Donatella Versace says ‘the world lost a giant today’ while Victoria Beckham called him ‘a visionary designer whose legacy will live on forever’</p><ul><li><p><a href=\"https://www.theguardian.com/fashion/2025/sep/04/giorgio-armani-celebrated-italian-fashion-designer-dies-at-91\">Giorgio Armani, ce"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/0459/live/af688e70-89e0-11f0-b391-6936825093bd.jpg",
    "titles": [
      "A style guru who revolutionised fashion - Giorgio Armani dies aged 91",
      "Italian fashion icon Giorgio Armani dies",
      "‘A void that is impossible to fill’: tributes paid to fashion designer Giorgio Armani"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.664,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.67,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Giorgio Armani, the iconic Italian fashion designer known for revolutionizing the suit with casual silhouettes and softer colors, has died at the age of 91. His company, founded in Milan in 1975, confirmed his peaceful passing surrounded by loved ones. Armani, celebrated for his contributions to modern Italian style and elegance, transformed global fashion with his designs. Prime Minister Giorgia Meloni hailed him as a symbol of the best of Italy. His legacy includes being the founder of the world's largest privately-owned luxury fashion brand.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UN: Wildfires Impact Air Quality Globally, Link to Climate Change",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Fri, 05 Sep 2025 06:56:31 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Deutsche Welle"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.dw.com"
    ],
    "snippets": [
      "Wildfires release a &quot;witches&#039; brew&quot; of pollutants that can wreck air quality even a continent away.",
      "Wildfires are releasing a risky mix of pollutants that can end up damaging air quality, according to a report from the UN weather agency. It said that air quality and climate change are closely connected."
    ],
    "image_url": "",
    "titles": [
      "Climate-change-driven wildfires increasing air pollution across globe: UN",
      "Wildfires fuel air pollution, says UN report"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.974,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.657,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Wildfires emit a dangerous mix of pollutants, affecting air quality far beyond their origin, as reported by the UN weather agency. This contributes to the linkage between air quality and climate change, highlighting the global impact of such fires.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Lululemon Shares Drop After Forecast Cut Due to Poor Sales, Tariff Impact",
    "domain": "business",
    "source_domain": "www.businessinsider.com",
    "location": "global",
    "published": "2025-09-05T06:35:46Z",
    "source": "Business Insider",
    "sources": [
      "MarketWatch",
      "Business Insider"
    ],
    "domains": [
      "www.businessinsider.com",
      "www.marketwatch.com"
    ],
    "snippets": [
      "Lululemon's CEO Calvin McDonald said that customers are not responding well to new colors and some products have been on the shelf too long.",
      "Shares of Lululemon Athletica Inc. tumbled after hours on Thursday after the yoga-wear maker cut its full-year outlook, citing costs related to U.S. tariffs on imports."
    ],
    "image_url": "https://i.insider.com/68ba7a68f9db348adc0ae2d8?format=jpeg",
    "titles": [
      "Lululemon is feeling the squeeze, and its CEO says the brand's gotten predictable",
      "Lululemon says it has gotten ‘too predictable,’ as tariffs, outlook sink its stock"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.967,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.655,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Lululemon's CEO, Calvin McDonald, reported poor customer response to new product colors and items remaining unsold for extended periods. Following this, Lululemon Athletica Inc. saw its shares fall after reducing its yearly financial forecast, attributing the decision to the impact of U.S. tariffs on imports.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Former President Biden Undergoes Surgery for Skin Cancer Lesions",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 05 Sep 2025 07:01:58 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The former US president had been spotted with a wound on the right side of his head in recent days.",
      "<a href=\"https://news.google.com/rss/articles/CBMicEFVX3lxTE42US0tQWpPaWN1b2ZUemx4UXFBMW5OWEs1NWszN045ZW94NDFZUDBJRWVYYVNMVGVUMG5IN0RQWUdVNEZyRHBKTncydVV4MC1Mb09IaTdNT1BzMTdEYzRCc0FPTzlydWxvMzc5Mml5bFQ?oc=5\" target=\"_blank\">Biden has surgery to remove skin cancer lesions</a>&nbsp;&nbsp;<font color=\""
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/cca7/live/27d583a0-8a26-11f0-b917-03bcebef22ec.jpg",
    "titles": [
      "Joe Biden undergoes skin cancer surgery",
      "Biden has surgery to remove skin cancer lesions - Axios"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.956,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.653,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The former US President, Joe Biden, underwent surgery to remove skin cancer lesions. He was recently seen with a wound on the right side of his head, which is related to this medical procedure. The surgery has been completed.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "High Demand for Australian Game Crashes Major Gaming Platforms",
    "domain": "technology",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Fri, 05 Sep 2025 07:19:01 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "Ars Technica"
    ],
    "domains": [
      "arstechnica.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "<p>Steam, the Nintendo eShop and Playstation Store among those that crashed on Friday, unable to cope with demand for the Australian-made game</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">",
      "Valve's usually stable platform struggles thanks in part to lack of pre-loading options."
    ],
    "image_url": "https://i.guim.co.uk/img/media/26950369fe4b03c2268620eb9815c8a246aa0b06/723_0_1800_1440/master/1800.jpg?width=140&quality=85&auto=format&fit=max&s=92580ee7450e297dc860e4bd24f5684e",
    "titles": [
      "Hollow Knight: Silksong launch crashes online gaming stores",
      "Hollow Knight: Silksong is breaking Steam, Nintendo’s eShop"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.961,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.647,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "On Friday, major online gaming platforms including Steam, the Nintendo eShop, and the PlayStation Store crashed due to high demand for a new Australian-made game. The surge overwhelmed Valve's Steam service, which is noted for its stability, partly because it did not offer pre-loading options.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Senators Grill Health Secretary on Vaccine Access, CDC Leadership",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Thu, 04 Sep 2025 15:38:13 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "ABC News"
    ],
    "domains": [
      "abcnews.go.com",
      "www.npr.org"
    ],
    "snippets": [
      "In a blistering hearing, Senators from both parties challenged the health secretary to defend his actions, including on vaccines access and CDC leadership.",
      "\"We're denying people vaccines,\" Republican Sen. Bill Cassidy told Kennedy."
    ],
    "image_url": "",
    "titles": [
      "Senators from both parties grilled RFK Jr. on vaccines and more",
      "Both Republicans and Democrats clash with RFK Jr. on vaccines, CDC turmoil"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.769,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.641,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "During a heated hearing, Senators from both parties questioned the Health Secretary on issues such as vaccine access and CDC leadership. Republican Senator Bill Cassidy accused the Secretary of denying people vaccines. The Secretary was challenged to defend his actions in these areas.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Beijing, Pyongyang, Moscow Strengthen Ties with Goodwill Messages",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Fri, 05 Sep 2025 02:34:58 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Deutsche Welle"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.dw.com"
    ],
    "snippets": [
      "Goodwill messages continued this week&#039;s public display of diplomatic unity between Beijing, Pyongyang and Moscow.",
      "Chinese President Xi Jinping and Kim Jong Un have held further talks after the North Korean leader attended a military parade in Beijing, along with Vladimir Putin, to commemorate the end of World War II."
    ],
    "image_url": "",
    "titles": [
      "Kim, Xi hail bond as North Korea says it will protect China’s interests",
      "China's position on North Korea ties 'will not change' — Xi"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.889,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.633,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "This week, Beijing, Pyongyang, and Moscow showed diplomatic unity through goodwill messages. Chinese President Xi Jinping and North Korean leader Kim Jong Un engaged in further talks after attending a military parade in Beijing with Vladimir Putin, marking the end of World War II.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Attorney Mark S. Zuckerberg Loses Business Over Facebook Profile Issues",
    "domain": "technology",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 05 Sep 2025 02:22:38 GMT",
    "source": "BBC",
    "sources": [
      "TechCrunch",
      "BBC"
    ],
    "domains": [
      "techcrunch.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The Facebook founder's namesake in Indiana says he has lost business because his social accounts keep getting shut.",
      "Mark S. Zuckerberg, an attorney, says that he's losing business because his Facebook business profile keeps getting disabled.",
      "Former Meta exec Nick Clegg recalls an MMA session with Zuckerberg at a management offsite."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/28df/live/1a8a11c0-89fe-11f0-84c8-99de564f0440.jpg",
    "titles": [
      "Mark Zuckerberg - no, not that one - sues Facebook for account shutdowns",
      "Mark Zuckerberg sues Mark Zuckerberg",
      "Mark Zuckerberg encouraged execs to do MMA training with him"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.867,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.628,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Mark S. Zuckerberg, an attorney not affiliated with Meta, reports losing business due to his Facebook profile being repeatedly disabled, likely due to confusion with Meta's CEO. Meanwhile, former Meta executive Nick Clegg shared a memory of an MMA session with Meta's CEO, Zuckerberg, at a management offsite, highlighting a personal anecdote unrelated to the attorney's issue.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Cowboys Aim to Overcome Parsons Trade, Focus on Season After Eagles Loss",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Thu, 04 Sep 2025 22:37:23 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Yahoo Sports"
    ],
    "domains": [
      "www.cnbc.com",
      "www.usatoday.com"
    ],
    "snippets": [
      "Jones appeared on CNBC's \"Closing Bell: Overtime\" to talk about the Dallas Cowboys' record $12.5 billion valuation as the team kicks off the 2025-2026 season.",
      "The Dallas Cowboys say they are ready to move on from the aftermath of the Micah Parsons trade following their 24-20 loss to the Philadelphia Eagles."
    ],
    "image_url": "",
    "titles": [
      "Dallas Cowboys owner Jerry Jones says Micah Parsons trade was 'based on mathematics'",
      "Dallas Cowboys desperate to move on from Micah Parsons trade after loss to Eagles"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.802,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.622,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Dallas Cowboys, valued at $12.5 billion, discussed their readiness to move past the Micah Parsons trade aftermath after a 24-20 loss to the Philadelphia Eagles. This was shared on CNBC's \"Closing Bell: Overtime\" as the team begins the 2025-2026 season.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Waymo Expands to Austin and Atlanta, Adds California Airport Rides",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Thu, 04 Sep 2025 21:29:18 GMT",
    "source": "CNBC",
    "sources": [
      "TechCrunch",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "techcrunch.com"
    ],
    "snippets": [
      "Waymo has launched commercial operations in Austin, Texas, as well as Atlanta, San Francisco, Phoenix and Los Angeles.",
      "It's the first airport in California that Waymo will offer rides to and from. The company's been active at the Phoenix airport for nearly two years."
    ],
    "image_url": "",
    "titles": [
      "Waymo to begin testing at San Jose airport this fall",
      "Waymo cleared to offer robotaxi rides at San Jose airport"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.783,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.619,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Waymo has expanded its commercial operations to Austin, Texas, and Atlanta, joining San Francisco, Phoenix, and Los Angeles. This includes offering rides to and from the first airport in California, building on nearly two years of operations at the Phoenix airport.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Nepal to Block 26 Social Media Sites, Sparking Public Protests",
    "domain": "technology",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-09-04T16:01:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "TechCrunch",
      "Deutsche Welle"
    ],
    "domains": [
      "techcrunch.com",
      "www.dw.com"
    ],
    "snippets": [
      "Nepal's government said it would block access to several social media platforms which had so far failed to register with authorities as part of a crackdown on misuse. The law has been met with some protests and dissent.",
      "Nepal has moved to block 26 social media platforms for failing to comply with its registration requirements."
    ],
    "image_url": "",
    "titles": [
      "Nepal to block Facebook, YouTube, X, LinkedIn, others",
      "Nepal blocks Facebook, Instagram, YouTube, X over rule breach, amid censorship concerns"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.714,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.608,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Nepal's government announced plans to block 26 social media platforms for not registering with authorities, aiming to curb misuse. This decision has sparked protests and dissent among the public.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  }
]