[
  {
    "title": "Netanyahu Advocates for Israel's Control of Gaza Amid International Criticism",
    "domain": "general",
    "location": "national",
    "published": "Sun, 10 Aug 2025 18:06:52 -0400",
    "source": "NPR",
    "sources": [
      "BBC",
      "Al Jazeera",
      "NPR",
      "The Guardian"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "Israeli Prime Minister Benjamin Netanyahu doubled down on his plan for Israel to seize control of Gaza City and the remaining sliver of Gaza not already under Israeli control.",
      "Israel's Prime Minister also claimed Israeli hostages held in Gaza were \"the only ones being deliberately starved\".",
      "The Israeli prime minister is pushing to take control of Gaza&#039;s largest urban hub despite a wave of global criticism.",
      "<p>Israeli PM says taking over city is ‘best way’ to end war, despite condemnation from within Israel and around world</p><p>Benjamin Netanyahu has defended his plan to take control of Gaza City in the face of widespread international outrage, even as senior UN officials warned that the move risked "
    ],
    "image_url": "",
    "titles": [
      "Netanyahu defends Israel's plan to seize Gaza City, despite global condemnation",
      "Netanyahu defends Gaza plans as Israel heavily criticised at UN Security Council",
      "UN warns of ‘calamity’ as Netanyahu pushes for Israel to seize Gaza City",
      "Netanyahu defends Gaza City plan as UN warns of ‘calamity’ and starvation"
    ],
    "score_components": {
      "magnitude": 0.92,
      "recency": 0.959,
      "consensus": 0.935,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.823,
    "summary": "Israeli Prime Minister Benjamin Netanyahu is advocating for Israel to take control of Gaza City and the remaining areas of Gaza not yet under its dominion, asserting this strategy as the \"best way\" to conclude the ongoing conflict. This stance comes despite extensive international condemnation and warnings from senior UN officials about the potential risks of such a move. Netanyahu also highlighted the plight of Israeli hostages in Gaza, claiming they are being deliberately starved, as part of his justification for the takeover.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 83 tokens"
  },
  {
    "title": "Trump Threatens Eviction of Homeless in D.C., Questions on Authority Arise",
    "domain": "business",
    "location": "global",
    "published": "Sun, 10 Aug 2025 21:44:07 +0000",
    "source": "Al Jazeera",
    "sources": [
      "CNBC",
      "Forbes",
      "Al Jazeera",
      "The Guardian",
      "Axios",
      "Fortune"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "The White House declined to explain what legal authority Trump would use to evict people from the nation&#039;s capital.",
      "<a href=\"https://news.google.com/rss/articles/CBMif0FVX3lxTFAzaWVia1k5bldleWEwX2tuWDNqa1cxeE5zckRaTXBLalJ1dVAtU0Zsb3ZfdHpHS29hbjlUQ0Z4MUt6cVRjWFllLWJOZzdhbmtZTnBuRzhfbFFMNUl6enpLZkRKMS1VeEJwQmVqaEl0YktfcUJ0V2hrTW5PejlBVGM?oc=5\" target=\"_blank\">Trump tells homeless people in D.C. to move out \"IMMEDIA",
      "President Donald Trump's remarks come as he has increased his rhetoric about countering crime in the District in recent days.",
      "<p>President demands unhoused residents leave US capital or face eviction and vowed to use officers to make arrests</p><p>In a social media post on Sunday, Donald Trump demands homeless residents of Washington DC leave the country’s capital or face eviction, and again promised to use federal officer",
      "The president claimed Washington, D.C., had become “one of the most dangerous cities anywhere in the world,” despite federal data indicating crime fell to historic lows.",
      "\"I'm going to make our Capital safer and more beautiful than it ever was before,\" the president posted on his Truth Social platform Sunday."
    ],
    "image_url": "",
    "titles": [
      "Trump pledges to move homeless people in Washington, DC ‘far’ from the city",
      "Trump tells homeless people in D.C. to move out \"IMMEDIATELY\" amid capital crackdown - Axios",
      "Trump warns homeless to leave Washington, D.C., ‘immediately’",
      "Trump orders homeless he passed en route to golf course to leave Washington DC",
      "Trump Says Homeless People Must Move From D.C. ‘Immediately’—Here’s What We Know About His Plans For D.C.",
      "Trump says homeless people must leave Washington, DC, immediately — ‘We will give you places to stay, but FAR from the Capital’"
    ],
    "score_components": {
      "magnitude": 0.92,
      "recency": 0.952,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.812,
    "summary": "President Donald Trump demanded that homeless individuals in Washington D.C. leave the city or face eviction, threatening to use federal officers to enforce this. Despite his claim that D.C. is \"one of the most dangerous cities in the world,\" federal data shows a decline in crime rates. Trump's legal authority to enforce such evictions remains unexplained by the White House. His statements align with recent rhetoric on combating crime in the capital.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 75 tokens"
  },
  {
    "title": "Nvidia and AMD to Pay US 15% Revenue from China Chip Sales for Export Licenses",
    "domain": "business",
    "location": "national",
    "published": "Sun, 10 Aug 2025 22:20:44 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "MarketWatch",
      "The Guardian",
      "Financial Times",
      "Fortune"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "The arrangement comes as President Donald Trump's tariffs continue to reverberate through the global economy.",
      "Chipmakers agree to unusual arrangement to secure export licences from Trump administration",
      "<p>Chipmakers agree to quid pro quo deal as condition for obtaining export licenses for Chinese market, FT reports</p><p>Nvidia and AMD have agreed to give the US government 15% of their revenues from chip sales in China, under an unprecedented arrangement to obtain export licenses for the semicondu",
      "Nvidia plans to share 15% of the revenue from sales of its H20 chip in China and AMD will deliver the same share from MI308 revenues.",
      "Nvidia Corp. and Advanced Micro Devices Inc. will give 15% of their chip revenue from sales in China to the U.S. government as a condition of receiving new export licenses, according to a report Sunday."
    ],
    "image_url": "",
    "titles": [
      "Nvidia and AMD to pay 15% of China chip sales revenues to the U.S. government, FT reports",
      "Nvidia and AMD to pay 15% of China chip sale revenues to US government",
      "Nvidia and AMD reportedly agree to pay 15% of China chip sale revenues to US",
      "Nvidia, AMD agree to pay US 15% of China chip sale revenue",
      "Nvidia and AMD reportedly will give U.S. government 15% of their China chip revenues"
    ],
    "score_components": {
      "magnitude": 0.92,
      "recency": 0.944,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.811,
    "summary": "Nvidia Corp. and Advanced Micro Devices Inc. (AMD) have agreed to pay the U.S. government 15% of their revenue from certain chip sales in China as part of a unique deal to secure export licenses. This arrangement, reported as a response to ongoing global economic shifts due to President Donald Trump's tariffs, marks an unprecedented approach to obtaining the necessary permissions for operating in the Chinese market.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 69 tokens"
  },
  {
    "title": "Israeli Airstrike Kills 4 Al Jazeera Journalists in Gaza, Sparks Outrage",
    "domain": "general",
    "location": "global",
    "published": "Sun, 10 Aug 2025 22:29:46 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC",
      "Al Jazeera",
      "Deutsche Welle"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "Al Jazeera had condemned a \"campaign of incitement\" by the IDF against its reporters, but the military claims one of the journalists was part of Hamas.",
      "Anas al-Sharif along with four other Al Jazeera journalists have been killed by an Israeli attack.",
      "Al Jazeera correspondent Hani Mahmoud, gives more details on the Israeli attack that killed five of his colleagues.",
      "An Israeli air strike has killed four Al Jazeera journalists including correspondent Anas al-Sharif.",
      "Al Jazeera staff killed in targeted Israeli attack on a tent housing journalists near al-Shifa Hospital, Gaza City.",
      "Israel says it killed Al Jazeera journalist Anas Al-Sharif. Israel's plans to expand operations to capture and occupy Gaza City have drawn severe condemnation. DW has the latest.",
      "<p>Anas al-Sharif, known for frontline coverage, died with three colleagues in an attack outside al-Shifa hospital</p><p>A prominent Al Jazeera journalist who had raised concerns about being killed has died in an Israeli airstrike.</p><p>Anas al-Sharif, known for documenting the release of hostages "
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/6174/live/3d88cde0-7637-11f0-98e7-df8858adb909.png",
    "titles": [
      "Four Al Jazeera journalists killed in Israeli strike near Gaza City's Al-Shifa hospital",
      "Israel kills Anas al-Sharif and four other Al Jazeera journalists in Gaza",
      "Gaza journalist reports on Israeli attack that killed Al Jazeera colleagues",
      "Israel kills four Al Jazeera journalists including Anas al-Sharif in Gaza",
      "Anas al-Sharif among five Al Jazeera journalists killed by Israel in Gaza",
      "Al Jazeera journalist killed in Israeli attack in Gaza City",
      "Prominent Al Jazeera journalist killed in Israeli airstrike on Gaza"
    ],
    "score_components": {
      "magnitude": 0.96,
      "recency": 0.947,
      "consensus": 0.935,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.809,
    "summary": "An Israeli airstrike near al-Shifa Hospital in Gaza City killed four Al Jazeera journalists, including Anas al-Sharif. Al Jazeera condemned the attack, describing it as a targeted strike on journalists and accused the IDF of inciting against its reporters, while Israel claimed Sharif was associated with Hamas. The incident has intensified scrutiny on Israel's military actions in Gaza, with plans to expand operations in the area facing widespread criticism.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 72 tokens"
  },
  {
    "title": "Crystal Palace Wins Community Shield Against Liverpool in Penalty Shootout",
    "domain": "general",
    "location": "global",
    "published": "Sun, 10 Aug 2025 17:57:58 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Le Monde",
      "Al Jazeera",
      "Sportsnet",
      "The Guardian"
    ],
    "domains": [
      "general",
      "sports"
    ],
    "snippets": [
      "FA Cup winners Crystal Palace upset Premier League champions Liverpool in English season opening Community Shield.",
      "Le club de football de la banlieue sud de Londres, lauréat en mai de la Coupe d’Angleterre, est venu à bout des Reds, vainqueurs de la Premiere League, aux tirs au but (2-2, t.a.b. 3-2), dimanche à Wembley.",
      "<ul><li><p>Premier League champions lose on penalties at Wembley</p></li><li><p>Crystal Palace await Europa League verdict after victory</p></li></ul><p>After his Liverpool team lost the Community Shield in a penalty shootout to Crystal Palace, their manager, Arne Slot admitted the difficulty of bed",
      "<p>Crystal Palace won the Community Shield on Sunday by beating Premier League champion Liverpool in a penalty shootout at Wembley.</p>"
    ],
    "image_url": "",
    "titles": [
      "New-look Liverpool beaten by Crystal Palace in Community Shield",
      "Tombeur de Liverpool, Crystal Palace remporte le Community Shield et un deuxième trophée majeur",
      "Arne Slot says Liverpool ‘need to be better’ after Community Shield defeat",
      "Henderson plays hero as Crystal Palace tops Liverpool in Community Shield"
    ],
    "score_components": {
      "magnitude": 0.92,
      "recency": 0.88,
      "consensus": 0.985,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.794,
    "summary": "Crystal Palace defeated Premier League champions Liverpool in the Community Shield match at Wembley, winning in a penalty shootout (3-2) after a 2-2 draw in regular time. This victory comes after Crystal Palace's FA Cup win in May. The match concluded with Liverpool's manager, Arne Slot, acknowledging the challenge of the game.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 56 tokens"
  },
  {
    "title": "Union Demands Government Denounce Vaccine Misinformation After CDC Shooting",
    "domain": "general",
    "location": "national",
    "published": "Sun, 10 Aug 2025 22:55:05 GMT",
    "source": "Axios",
    "sources": [
      "Global News",
      "CityNews",
      "Axios",
      "The Guardian"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMiigFBVV95cUxQblhKSUVOT1VBdGtyNFVSUkFoZkN0Y3VJZGFOMzA0VF93VFBvQlhlMEFVdWFHd0I1dHpkaHJvYTF5Y3dPajVtZ3RGU1FpSzgzSW5NaWxIVXl3SlFKVDh1S2xLRDVMc2JtRGpiUjRCaEhmMXFBQXZZVWlyNy04MTlGVkVpeUVCdS1qOWc?oc=5\" target=\"_blank\">CDC union demands Trump officials condem",
      "<p>Deadly violence not random as staff have endured ‘months of mistreatment, neglect and vilification’, says union</p><p>A union representing US Centers for Disease Control employees has demanded that the federal government condemn vaccine misinformation after a <a href=\"https://www.theguardian.com/",
      "A union representing workers at the CDC said the shooting was not random and “compounds months of mistreatment, neglect, and vilification that CDC staff have endured.\"",
      "A Georgia man who had blamed the COVID-19 vaccine for making him depressed and suicidal has been identified as the shooter who opened fire late Friday on the U.S. Centers for Disease Control and Prevention headquarters, killing a police officer. The 30-year-old suspect, who died during the incident,"
    ],
    "image_url": "",
    "titles": [
      "CDC union demands Trump officials condemn vaccine disinformation after shooting - Axios",
      "CDC union says vaccine misinformation put staff at risk after Atlanta shooting",
      "CDC shooter blamed COVID vaccine for depression; union demands statement against misinformation",
      "CDC shooter blamed COVID vaccine for depression; union demands statement against misinformation"
    ],
    "score_components": {
      "magnitude": 0.9,
      "recency": 0.955,
      "consensus": 0.935,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.79,
    "summary": "A union representing CDC employees has demanded the federal government condemn vaccine misinformation, linking it to a deadly shooting at CDC headquarters by a Georgia man. The shooter, who blamed the COVID-19 vaccine for his depression and suicidal thoughts, killed a police officer before dying during the incident. The union highlighted that this act of violence reflects the culmination of months of mistreatment, neglect, and vilification faced by CDC staff.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 71 tokens"
  },
  {
    "title": "Justin Rose Wins FedEx St. Jude Championship in Playoff Comeback",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 10 Aug 2025 19:54:52 EST",
    "source": "ESPN",
    "sources": [
      "Sky Sports",
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Justin Rose made up a three-shot deficit over the last five holes against hard-luck Tommy Fleetwood, and then made two birdies in a playoff against U.S. Open champion J.J. Spaun to win the FedEx St. Jude Championship on Sunday.",
      "Justin Rose produced a sensational finish at the FedEx St Jude Championship with six birdies in his final eight holes to win a play-off against US Open champion JJ Spaun.",
      "<p>Justin Rose made up a three-shot deficit over the last five holes against hard-luck Tommy Fleetwood, and then made two birdies in a playoff against U.S. Open champion J.J. Spaun to win the FedEx St. Jude Championship on Sunday.</p>"
    ],
    "image_url": "",
    "titles": [
      "Rose rallies late, tops Spaun in St. Jude playoff",
      "Rose beats Spaun in St Jude Championship play-off after Fleetwood fades",
      "Justin Rose rallies late and beats Spaun to capture FedEx St. Jude Championship"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.996,
      "consensus": 0.847,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.766,
    "summary": "Justin Rose overcame a three-shot deficit in the final five holes against Tommy Fleetwood and won the FedEx St. Jude Championship by making two birdies in a playoff against U.S. Open champion J.J. Spaun. Rose clinched the victory with six birdies in his last eight holes, showcasing a remarkable comeback on Sunday.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 55 tokens"
  },
  {
    "title": "Van Gisbergen Sets Record with 4th Straight Road Win, Tops Rookie Season",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 10 Aug 2025 17:19:21 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Shane van Gisbergen tied a Cup Series record with his fourth straight road-course victory, blowing out the competition again at Watkins Glen International.",
      "SVG's four wins are now the most for a driver in their Cup rookie season",
      "<p>Shane van Gisbergen’s latest victory in NASCAR’s premier series was as historical as it was emotional.</p>"
    ],
    "image_url": "",
    "titles": [
      "Shane van Gisbergen wins fourth race this season",
      "NASCAR at Watkins Glen results: Shane van Gisbergen sets new high mark with fourth straight road course win",
      "Rookie Shane van Gisbergen secures fourth victory of the season"
    ],
    "score_components": {
      "magnitude": 0.82,
      "recency": 0.944,
      "consensus": 0.847,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.763,
    "summary": "Shane van Gisbergen made history by winning his fourth consecutive road-course race in the Cup Series at Watkins Glen International. This victory also marked the most wins by a driver in their rookie season. Van Gisbergen's latest NASCAR triumph was both significant and emotional.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 46 tokens"
  },
  {
    "title": "European Leaders Urge Inclusion of Ukraine in Talks with Russia",
    "domain": "general",
    "location": "national",
    "published": "Sun, 10 Aug 2025 15:15:39 -0400",
    "source": "NPR",
    "sources": [
      "Global News",
      "NPR",
      "The Guardian"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "Some European leaders say that Ukraine must be included in any talks with Russia over ending the war.",
      "<p>Move comes as Germany warns White House against any deal hatched ‘over heads of Europeans and Ukrainians’</p><p>Europe’s leaders have raised the pressure on Donald Trump to involve Ukraine in a planned summit with Vladimir Putin, as Germany warned the White House against any deal hatched “over th",
      "A White House official said Trump remains open to a trilateral summit with both the Russian and Ukrainian leaders, but for now, he will have a bilateral meeting requested by Putin."
    ],
    "image_url": "",
    "titles": [
      "European leaders urge for Ukraine to be included in Trump-Putin Alaska peace talks",
      "Europe’s leaders raise pressure on Trump to involve Ukraine in Putin talks",
      "European leaders rally behind Ukraine ahead of Trump-Putin meeting"
    ],
    "score_components": {
      "magnitude": 0.84,
      "recency": 0.904,
      "consensus": 0.847,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.762,
    "summary": "European leaders are insisting that Ukraine be included in discussions with Russia to end the war, pressuring Donald Trump to involve Ukraine in a summit with Vladimir Putin. Germany has specifically warned against making any agreements without European and Ukrainian involvement. Meanwhile, a White House official stated that while Trump is open to a trilateral summit including Ukraine, he will first hold a bilateral meeting with Putin as requested by the Russian leader.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 73 tokens"
  },
  {
    "title": "Magnitude 6.1 Earthquake Strikes Northwest Turkey, 1 Dead, 29 Injured",
    "domain": "general",
    "location": "global",
    "published": "2025-08-10T22:24:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Global News",
      "CityNews",
      "Deutsche Welle"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "Over a dozen buildings collapsed as a result of the tremor, which was felt as far as Istanbul.",
      "The earthquake, with an epicenter in the town of Sindirgi, sent shocks that were felt some 200 kilometers away in Istanbul, a city of more than 16 million people.",
      "ISTANBUL (AP) — A magnitude 6.1 earthquake struck Turkey’s northwestern province of Balikesir on Sunday, killing at least one person and causing more than a dozen buildings to collapse, officials said. At least 29 people were injured. The earthquake, with an epicenter in the town of Sindirgi, sent s"
    ],
    "image_url": "",
    "titles": [
      "Turkey: 6.1 magnitude earthquake kills 1 in Balikesir",
      "6.1 earthquake hits Turkey’s Balikesir province, killing 1 and collapsing buildings",
      "6.1 earthquake hits Turkey’s Balikesir province, killing 1 and collapsing buildings"
    ],
    "score_components": {
      "magnitude": 0.82,
      "recency": 0.965,
      "consensus": 0.847,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.742,
    "summary": "A magnitude 6.1 earthquake hit Balikesir province in northwest Turkey, with its epicenter in Sindirgi. The quake resulted in at least one death and 29 injuries, causing over a dozen buildings to collapse. The tremors were felt up to 200 kilometers away, including in Istanbul, a city home to over 16 million people.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 54 tokens"
  },
  {
    "title": "Two Japanese Boxers Die After Fights on Same Tokyo Card",
    "domain": "general",
    "location": "global",
    "published": "Sun, 10 Aug 2025 10:04:01 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Forbes",
      "Deutsche Welle"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "Shigetoshi Kotari and Hiromasa Urakawa pass away within a day of each other after separate bouts on the same card.",
      "The Japanese athletes, both 28 years old, were rushed into emergency surgery after competing in separate bouts on August 2.",
      "Japanese boxers Shigetoshi Kotari and Hiromasa Urakawa died after competing on the same card in Tokyo on Aug. 2."
    ],
    "image_url": "",
    "titles": [
      "Two fighters die from brain injuries in boxing bouts in Japan",
      "Japan: Two boxers die from brain injuries at Tokyo event",
      "Two Japanese Boxers On The Same Card Die From Brain Injuries"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.746,
      "consensus": 0.897,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.703,
    "summary": "Japanese boxers Shigetoshi Kotari and Hiromasa Urakawa, both 28, passed away within a day of each other after competing in separate bouts on the same card in Tokyo on August 2. They were rushed into emergency surgery following their fights. The tragic deaths occurred following their participation in the boxing event.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 51 tokens"
  },
  {
    "title": "Jets Activate Jermaine Johnson, Boosting Pass Rush",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 10 Aug 2025 19:54:52 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "The Jets activated edge rusher Jermaine Johnson from the PUP list Sunday.",
      "<p>Jermaine Johnson is officially back and ready to bolster the New York Jets&#8217; pass rush.</p>"
    ],
    "image_url": "",
    "titles": [
      "Jets activate key pass rusher Johnson from PUP",
      "Jets activate Jermaine Johnson from PUP list 11 months after torn Achilles tendon"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.996,
      "consensus": 0.632,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.684,
    "summary": "The New York Jets activated edge rusher Jermaine Johnson from the PUP list on Sunday. Johnson's return is expected to strengthen the Jets' pass rush as they prepare for upcoming games.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 32 tokens"
  },
  {
    "title": "Titans' Tyjae Spears Sidelined for Weeks with High Ankle Sprain",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 10 Aug 2025 19:54:52 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Titans running back Tyjae Spears is expected to be out for a few weeks due to a high ankle sprain.",
      "The Titans were hopeful Spears would take on a bigger workload in the backfield with Tony Pollard"
    ],
    "image_url": "",
    "titles": [
      "Titans RB Spears (ankle) out rest of preseason",
      "Tyjae Spears injury: Titans RB to miss the rest of preseason due to high ankle sprain"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.996,
      "consensus": 0.632,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.684,
    "summary": "Titans running back Tyjae Spears is expected to miss several weeks of play due to a high ankle sprain. This injury comes at a time when the Titans had plans for Spears to assume a larger role in the backfield, particularly in light of Tony Pollard's involvement.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 48 tokens"
  },
  {
    "title": "Yankees' Boone Ejected for 5th Time This Season Against Astros",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 10 Aug 2025 19:54:52 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Yankees manager Aaron Boone was ejected from a game for the fifth time this season on Sunday.",
      "<p>New York Yankees manager Aaron Boone was ejected from a game for the fifth time this season in the third inning on Sunday against the Houston Astros.</p>"
    ],
    "image_url": "",
    "titles": [
      "Yankees' Boone ejected for 5th time this season",
      "Yankees’ Boone ejected for fifth time of season against Astros"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.996,
      "consensus": 0.632,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.684,
    "summary": "New York Yankees manager Aaron Boone was ejected from a game for the fifth time this season during the third inning against the Houston Astros on Sunday. This incident marks Boone's fifth ejection of the season, highlighting ongoing tensions.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 40 tokens"
  },
  {
    "title": "Netanyahu Defends Gaza Offensive, Cites Security and Demilitarization Goals",
    "domain": "general",
    "location": "national",
    "published": "Sun, 10 Aug 2025 17:36:17 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "CityNews"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "Benjamin Netanyahu said the goals include demilitarizing Gaza, the Israeli military having “overriding security control” and a non-Israeli civilian administration in charge.",
      "JERUSALEM (AP) — Israeli Prime Minister Benjamin Netanyahu on Sunday defended a new military offensive in Gaza that&#8217;s more sweeping than previously announced, declaring in the face of growing condemnation at home and abroad that Israel “has no choice but to finish the job and complete the defe"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/01/20241229051220-20241229051220-6771225ed5e3812d22e2d93fjpeg_c0f04d.jpg?quality=65&strip=all",
    "titles": [
      "Israel defends planned military offensive in Gaza, lashes out at ‘global campaign of lies’",
      "Netanyahu defends new military offensive in Gaza and says it will be wider than announced"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.873,
      "consensus": 0.632,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.678,
    "summary": "Israeli Prime Minister Benjamin Netanyahu defended a significant military offensive in Gaza, emphasizing the need to demilitarize the area, maintain Israeli military's \"overriding security control,\" and establish a non-Israeli civilian administration. This stance comes amidst increasing domestic and international criticism, with Netanyahu insisting on completing the operation for Israel's security.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 53 tokens"
  },
  {
    "title": "Burmester Triumphs in LIV Golf Chicago; Rose Wins FedEx St. Jude Championship",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 10 Aug 2025 18:37:07 EST",
    "source": "ESPN",
    "sources": [
      "Yahoo Sports",
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Dean Burmester beat Jon Rahm and Josele Ballester in a three-way playoff Sunday to win LIV Golf Chicago.",
      "Justin Rose made up a three-shot deficit over the last five holes against hard-luck Tommy Fleetwood, and then made two birdies in a playoff against U.S. Open champion J.J. Spaun to win the FedEx St. Jude Championship on Sunday.  Rose delivered another sterling performance, closing with a 3-under 67 "
    ],
    "image_url": "",
    "titles": [
      "Dean Burmester wins LIV Chicago in three-way playoff",
      "Rose wins FedEx St. Jude in playoff. Burmester also needs extra holes at LIV Golf Chicago"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.969,
      "consensus": 0.632,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.672,
    "summary": "Dean Burmester won LIV Golf Chicago in a playoff against Jon Rahm and Josele Ballester. In a separate event, Justin Rose overcame a three-shot deficit in the last five holes to beat Tommy Fleetwood and then won the FedEx St. Jude Championship in a playoff against J.J. Spaun, closing with a 3-under 67.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 56 tokens"
  },
  {
    "title": "Justin Verlander Hits 3,500 Strikeouts, 10th in MLB History",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 10 Aug 2025 23:44:42 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Sportsnet",
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Justin Verlander is Major League Baseball's active strikeouts leader.",
      "<p>Justin Verlander became the 10th pitcher in MLB history to record 3,500 strikeouts in fashion on Sunday, striking out the side in the first inning against the Washington Nationals. </p>"
    ],
    "image_url": "",
    "titles": [
      "Justin Verlander becomes 10th pitcher in MLB history to reach 3,500 strikeouts as Nationals roll over Giants",
      "Giants’ Verlander Ks side to reach 3,500 strikeout threshold"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.992,
      "consensus": 0.632,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.658,
    "summary": "Justin Verlander, a prominent Major League Baseball pitcher, achieved a significant milestone by becoming the 10th pitcher in MLB history to reach 3,500 strikeouts. He accomplished this feat by striking out three batters in the first inning of a game against the Washington Nationals. Verlander is currently the active leader in strikeouts in the MLB.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 56 tokens"
  },
  {
    "title": "Chargers Overcome Saints 27-13 in Low-Energy Exhibition Game",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 10 Aug 2025 23:40:19 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Sportsnet",
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Trey Lance scrambled for a 5-yard score and rookie Eric Rogers had a 43-yard pick-6 in a mostly sluggish offensive performance by the Los Angeles Chargers in a 27-13 exhibition win over the New Orleans Saints on Sunday.  The Chargers’ defense had a goal-line stand and a strip-sack that led to a turn",
      "<p>Trey Lance scrambled for a 5-yard score and rookie Eric Rogers had a 43-yard pick-6 in a mostly sluggish offensive performance by the Los Angeles Chargers in a 27-13 exhibition win over the New Orleans Saints on Sunday.</p>"
    ],
    "image_url": "",
    "titles": [
      "Chargers' defense shines in 27-13 win over Saints with pick-6 and goal-line stand",
      "Chargers’ defence steps up in pre-season win against Saints"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.991,
      "consensus": 0.632,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.658,
    "summary": "In a low-energy exhibition game, the Los Angeles Chargers defeated the New Orleans Saints 27-13. Key moments included Trey Lance's 5-yard touchdown scramble and Eric Rogers' 43-yard interception return for a touchdown. Despite a lackluster offensive showing, the Chargers' defense secured the win with a crucial goal-line stand and a strip-sack that resulted in a turnover.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 63 tokens"
  },
  {
    "title": "Ukrainian Drones Strike Major Refinery in Russia's Saratov Region",
    "domain": "business",
    "location": "global",
    "published": "Sun, 10 Aug 2025 14:43:57 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Financial Post"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "Drones launched by Kyiv are targeting deeper into Russian territory than in past, Al Jazeera&#039;s correspondent reports.",
      "Ukraine’s General Staff said it made a successful drone strike early Sunday on a major refinery in the Saratov region, the latest in a series of attacks this month on Russian oil facilities."
    ],
    "image_url": "",
    "titles": [
      "Ukraine says it hit Russian oil refinery in drone exchanges; key talks loom",
      "Ukraine Says It Struck Russia’s Large Saratov Oil Refinery"
    ],
    "score_components": {
      "magnitude": 0.74,
      "recency": 0.823,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.644,
    "summary": "Ukrainian drones have targeted further into Russian territory, with a successful strike on a major refinery in the Saratov region reported by Ukraine's General Staff. This attack is part of a series of recent strikes on Russian oil facilities, indicating an escalation in Ukraine's drone operations.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 48 tokens"
  },
  {
    "title": "EU Leaders Call for More Pressure on Russia Before Trump-Putin Summit",
    "domain": "business",
    "location": "global",
    "published": "Sun, 10 Aug 2025 17:01:54 GMT",
    "source": "Financial Times",
    "sources": [
      "New York Times",
      "Financial Times"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "Russian president secures first official invitation to US in almost two decades ahead of sanctions deadline",
      "For President Vladimir V. Putin of Russia, it is an opportunity not just to end the Ukraine war on his terms, but to split apart the Western security alliance."
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F9bfd8efc-435f-4895-b421-471379f83239.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "What Putin wants from Trump at Alaska summit",
      "With Ukraine in the Balance, Trump and Putin Head Into Summit With Mismatched Goals"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.845,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.642,
    "summary": "Leaders of six European countries and the EU have urged for increased pressure on Russia ahead of a scheduled summit in Alaska between President Trump and President Putin. The meeting, set for next Friday, aims to discuss a resolution to the Ukraine war. European leaders express concerns that the summit could allow Putin to achieve his goals on his terms, potentially fracturing the Western security alliance.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 66 tokens"
  },
  {
    "title": "\"Weapons\" Tops Box Office with $42.5M Debut in August",
    "domain": "business",
    "location": "national",
    "published": "Sun, 10 Aug 2025 18:02:58 +0000",
    "source": "Financial Post",
    "sources": [
      "Financial Post",
      "CityNews"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "LOS ANGELES (AP) &#8212; It&#8217;s August, and horror and humor came to play. In a month that&#8217;s long been known to let edgier movies thrive, Zach Cregger&#8217;s highly anticipated horror film &#8220;Weapons&#8221; did not disappoint, topping the box office during its debut weekend with $42.5",
      "LOS ANGELES (AP) — It’s August, and horror and humor came to play. In a month that’s long been known to let edgier movies thrive, Zach Cregger’s highly anticipated horror film “Weapons” did not disappoint, topping the box office during its debut weekend with $42.5 million domestically from 3,202 the"
    ],
    "image_url": "",
    "titles": [
      "‘Weapons’ horror film scores a box office victory",
      "‘Weapons’ horror film scores a box office victory"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.881,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.642,
    "summary": "In August, Zach Cregger's horror film \"Weapons\" debuted strongly, earning $42.5 million domestically and topping the box office with 3,202 theaters. The movie's success highlights the appeal of edgier films in this month traditionally favorable to such genres.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 42 tokens"
  },
  {
    "title": "Air Canada Flight Attendants to Stage Action at Four Major Airports",
    "domain": "business",
    "location": "national",
    "published": "Sun, 10 Aug 2025 14:07:09 +0000",
    "source": "Financial Post",
    "sources": [
      "Financial Post"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Media Advisory On Monday, August 11th , Air Canada flight attendants, represented by the Canadian Union of Public Employees (CUPE), will hold a simultaneous action at airports in Montreal, Toronto, Vancouver, and Calgary, to raise awareness among Canadians about ongoing issues related to their worki"
    ],
    "image_url": "",
    "titles": [
      "Air Canada flight attendants organize national action to protest working conditions"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.812,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.508,
    "summary": "Air Canada flight attendants, represented by CUPE, will stage a coordinated action at Montreal, Toronto, Vancouver, and Calgary airports on August 11th to highlight work-related concerns. The event aims to raise awareness among Canadians about the challenges faced by the attendants.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 42 tokens"
  },
  {
    "title": "Wall Street Awaits July CPI Report: Expected 0.2% Inflation Rise",
    "domain": "business",
    "location": "global",
    "published": "Sun, 10 Aug 2025 22:53:56 +0000",
    "source": "Fortune",
    "sources": [
      "Fortune"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "The consumer price index for July will come out on Tuesday, and Wall Street expects a 0.2% monthly overall increase and a 0.3% uptick in the core CPI."
    ],
    "image_url": "https://fortune.com/img-assets/wp-content/uploads/2025/08/GettyImages-2228317556-e1754861176727.jpg?w=2048",
    "titles": [
      "Dow futures rise as Wall Street and the Fed brace for updates on how much Trump’s tariffs are stoking inflation"
    ],
    "score_components": {
      "magnitude": 0.44,
      "recency": 0.975,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.497,
    "summary": "Wall Street anticipates the consumer price index (CPI) report for July, set to be released on Tuesday, to show a 0.2% rise in overall monthly inflation and a 0.3% increase in the core CPI, which excludes volatile food and energy prices. This data will provide insights into current inflation trends and their potential impact on the economy.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 59 tokens"
  },
  {
    "title": "Study Explains Why Humans See Faces in Objects Due to Brain's Bias",
    "domain": "science",
    "location": "global",
    "published": "Sun, 10 Aug 2025 23:21:31 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/why-your-brain-sees-faces-everywhere-and-cant-look-away/\" rel=\"nofollow\" title=\"Why Your Brain Sees Faces Everywhere and Can’t Look Away\"><img alt=\"Coffee Face Scream\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Cof"
    ],
    "image_url": "",
    "titles": [
      "Why Your Brain Sees Faces Everywhere and Can’t Look Away"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.984,
      "consensus": 0.393,
      "constructiveness": 0.053,
      "proximity": 0.5
    },
    "score": 0.497,
    "summary": "Research explains why humans tend to see faces in everyday objects, a phenomenon known as pareidolia. This tendency is rooted in the brain's overactive facial recognition system. The study highlights that recognizing faces quickly is crucial for social interaction and survival, leading our brains to err on the side of caution by sometimes seeing faces where there are none. This insight sheds light on human evolution and the importance of faces in social communication.",
    "constructiveness_score": 0.053,
    "constructiveness_reason": "1 constructive keywords out of 75 tokens"
  },
  {
    "title": "Security flaws in a carmaker’s web portal let one hacker remotely unlock cars from anywhere",
    "domain": "technology",
    "location": "global",
    "published": "Mon, 11 Aug 2025 00:00:00 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Security researcher Eaton Zveare told TechCrunch that the flaws he discovered in the carmaker's centralized dealer portal exposed vast access to customer and vehicle data. With this access, Zveare said he could remotely take over a customer's account and unlock their cars, and more."
    ],
    "image_url": "",
    "titles": [
      "Security flaws in a carmaker’s web portal let one hacker remotely unlock cars from anywhere"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.998,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.488,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 16 tokens"
  },
  {
    "title": "Sandia Labs Develops Chiplet Tech to Boost AI, Quantum Computing",
    "domain": "science",
    "location": "global",
    "published": "Sun, 10 Aug 2025 18:39:36 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/chiplet-technology-becomes-sandias-secret-weapon-for-ai-and-quantum/\" rel=\"nofollow\" title=\"Chiplet Technology Becomes Sandia’s Secret Weapon for AI and Quantum\"><img alt=\"Quantum Wafer\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"527\" src=\"https://scitechd"
    ],
    "image_url": "",
    "titles": [
      "Chiplet Technology Becomes Sandia’s Secret Weapon for AI and Quantum"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.893,
      "consensus": 0.393,
      "constructiveness": 0.119,
      "proximity": 0.5
    },
    "score": 0.486,
    "summary": "Sandia National Laboratories has developed a new chiplet technology aimed at enhancing AI and quantum computing capabilities. This innovation allows for the integration of different semiconductor materials into a single chip, potentially leading to more powerful and efficient computing systems. The technology is seen as a significant advancement in the field of computing, offering a promising avenue for the development of advanced AI and quantum computing solutions.",
    "constructiveness_score": 0.119,
    "constructiveness_reason": "2 constructive keywords out of 67 tokens"
  },
  {
    "title": "Why investors just bet $85M on this Indian company’s generic drug strategy",
    "domain": "technology",
    "location": "global",
    "published": "Sun, 10 Aug 2025 23:30:00 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Truemeds has taken a different route from other Indian online pharmacies — and it has helped the startup double its revenue."
    ],
    "image_url": "",
    "titles": [
      "Why investors just bet $85M on this Indian company’s generic drug strategy"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.987,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.486,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 13 tokens"
  },
  {
    "title": "Breakthrough in Egg Freezing Enhances Fertility Preservation",
    "domain": "science",
    "location": "global",
    "published": "Sun, 10 Aug 2025 22:56:06 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/frozen-in-time-the-hidden-trick-that-keeps-human-eggs-alive-for-decades/\" rel=\"nofollow\" title=\"Frozen in Time: The Hidden Trick That Keeps Human Eggs Alive for Decades\"><img alt=\"Early Stage Embryo\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"htt"
    ],
    "image_url": "",
    "titles": [
      "Frozen in Time: The Hidden Trick That Keeps Human Eggs Alive for Decades"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.976,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.483,
    "summary": "Scientists have discovered a mechanism that allows human eggs to remain viable for decades when frozen. This process, essential for fertility preservation, involves a unique cellular structure that protects the eggs from damage over time. This breakthrough could significantly enhance fertility treatments and egg banking, offering hope to those looking to conceive later in life.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 55 tokens"
  },
  {
    "title": "Breakthrough: Babies Born Healthy Using DNA from Three People",
    "domain": "science",
    "location": "global",
    "published": "Sun, 10 Aug 2025 22:31:05 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/dna-from-three-people-creates-healthy-babies-free-of-genetic-disease/\" rel=\"nofollow\" title=\"DNA From Three People Creates Healthy Babies Free of Genetic Disease\"><img alt=\"Newborn Baby Holding Mothers Hand\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" "
    ],
    "image_url": "",
    "titles": [
      "DNA From Three People Creates Healthy Babies Free of Genetic Disease"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.967,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.482,
    "summary": "Scientists have successfully used DNA from three individuals to create healthy babies free of genetic diseases. This breakthrough technique involves combining genetic material from two women and one man to prevent inherited conditions. The procedure aims to eliminate mitochondrial diseases, which are passed down from mother to child. As of the report, the babies born using this method are healthy, marking a significant advancement in genetic and reproductive science.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 69 tokens"
  },
  {
    "title": "BC Wildfire Service to Keep Crews at Wesley Ridge Indefinitely Amid Challenges",
    "domain": "business",
    "location": "national",
    "published": "Sun, 10 Aug 2025 21:14:54 +0000",
    "source": "Financial Post",
    "sources": [
      "Financial Post"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "VICTORIA &#8212; The BC Wildfire Service says it will keep crews on the out-of-control Wesley Ridge wildfire near Cameron Lake for the &#8220;foreseeable future&#8221; as they deal with steep terrain and limited access to water. Beau Michaud, operations sections chief, says in a video shared Sunday "
    ],
    "image_url": "",
    "titles": [
      "Steep terrain and limited water impact out-of-control fire on Vancouver Island"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.942,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.477,
    "summary": "The BC Wildfire Service announced plans to maintain crews at the Wesley Ridge wildfire near Cameron Lake indefinitely due to challenging conditions, including steep terrain and limited water access. Beau Michaud, the operations chief, highlighted these difficulties in a recent video update.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 42 tokens"
  },
  {
    "title": "Discovery of Quasicrystals Challenges Traditional Matter Rules",
    "domain": "science",
    "location": "global",
    "published": "Sun, 10 Aug 2025 19:04:54 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/what-happens-when-matter-refuses-to-follow-the-rules-quasicrystals/\" rel=\"nofollow\" title=\"What Happens When Matter Refuses to Follow the Rules? Quasicrystals.\"><img alt=\"Abstract Modern Materials Crystal Technology\" class=\"webfeedsFeaturedVisual wp-post-image\" heig"
    ],
    "image_url": "",
    "titles": [
      "What Happens When Matter Refuses to Follow the Rules? Quasicrystals."
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.901,
      "consensus": 0.393,
      "constructiveness": 0.073,
      "proximity": 0.5
    },
    "score": 0.476,
    "summary": "Scientists have discovered quasicrystals, unique structures that do not follow traditional rules of matter by exhibiting a non-repeating pattern while maintaining a form of order. This breakthrough challenges previous understandings of crystalline structures and opens new avenues for research in materials science. Quasicrystals demonstrate properties that could lead to innovative applications in various technologies.",
    "constructiveness_score": 0.073,
    "constructiveness_reason": "1 constructive keywords out of 55 tokens"
  },
  {
    "title": "The hidden cost of living amid Mark Zuckerberg’s $110M compound",
    "domain": "technology",
    "location": "global",
    "published": "Sun, 10 Aug 2025 19:59:20 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Mark Zuckerberg has spent 14 years gobbling up his leafy Palo Alto neighborhood, according to a New York Times report detailing how the Meta CEO has purchased 11 properties for over $110 million to create his own personal fiefdom in Crescent Park. The piecemeal compound features a main residence, gu"
    ],
    "image_url": "",
    "titles": [
      "The hidden cost of living amid Mark Zuckerberg’s $110M compound"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.918,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.472,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 11 tokens"
  },
  {
    "title": "The computer science dream has become a nightmare",
    "domain": "technology",
    "location": "global",
    "published": "Sun, 10 Aug 2025 18:59:42 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Well, the coding-equals-prosperity promise has officially collapsed. Fresh computer science graduates are facing unemployment rates of 6.1% to 7.5% &#8212; more than double what biology and art history majors are experiencing, according to a recent Federal Reserve Bank of New York study. A crushing "
    ],
    "image_url": "",
    "titles": [
      "The computer science dream has become a nightmare"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.899,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.468,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 8 tokens"
  },
  {
    "title": "New Detector May Significantly Advance Dark Matter Research",
    "domain": "science",
    "location": "global",
    "published": "Sun, 10 Aug 2025 18:14:56 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/scientists-may-have-found-the-ultimate-dark-matter-detector/\" rel=\"nofollow\" title=\"Scientists May Have Found the Ultimate Dark Matter Detector\"><img alt=\"Time Clock Dark Matter Detector\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitech"
    ],
    "image_url": "",
    "titles": [
      "Scientists May Have Found the Ultimate Dark Matter Detector"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.885,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.465,
    "summary": "Scientists have potentially discovered a highly effective detector for dark matter, a mysterious substance that constitutes a significant portion of the universe's mass. This new detection method could significantly advance our understanding of dark matter, though specific details about the detector's operation or findings were not disclosed in the summary provided.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 53 tokens"
  },
  {
    "title": "Indigenous Groups Discuss Plastic Treaty in Geneva to Protect Environment",
    "domain": "science",
    "location": "global",
    "published": "Sun, 10 Aug 2025 14:09:45 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Indigenous communities from North America are at talks on a global treaty on plastic pollution in Geneva, pleading the case for the environment they depend upon, which is slowly being choked by microplastics."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/delegates-are-meeting.jpg",
    "titles": [
      "Indigenous communities plead for action at plastic pollution talks"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.883,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.465,
    "summary": "Indigenous communities from North America are participating in discussions in Geneva on a global treaty aimed at addressing plastic pollution. They are advocating for measures to protect their environment, which is increasingly affected by microplastics.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 35 tokens"
  },
  {
    "title": "Stanford sticks with legacy admissions",
    "domain": "technology",
    "location": "global",
    "published": "Sun, 10 Aug 2025 18:18:08 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Stanford University has confirmed its admissions policies for fall 2026 will continue considering legacy status, a decision that could influence access to one of Silicon Valley&#8217;s most important talent pipelines. Stanford is also ending its test-optional policy, requiring SAT or ACT scores for "
    ],
    "image_url": "",
    "titles": [
      "Stanford sticks with legacy admissions"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.886,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.465,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 5 tokens"
  },
  {
    "title": "Crew-10 Astronauts Safely Return After 5-Month ISS Mission",
    "domain": "science",
    "location": "global",
    "published": "Sun, 10 Aug 2025 13:53:01 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Four astronauts returned to Earth on Saturday after hustling to the International Space Station five months ago to relieve the stuck test pilots of Boeing's Starliner."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/astronauts-return-to-e.jpg",
    "titles": [
      "Astronauts return to Earth with SpaceX after 5 months at the International Space Station"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.878,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.464,
    "summary": "Four astronauts successfully returned to Earth on Saturday, concluding their five-month mission aboard the International Space Station (ISS) where they replaced stranded astronauts Wilmore and Williams. The Crew-10 mission, utilizing a SpaceX capsule, parachuted into the Pacific Ocean off the Southern California coast, marking a successful end to their journey initiated to assist the pilots of Boeing’s Starliner.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 61 tokens"
  },
  {
    "title": "We found stuff AI is pretty good at",
    "domain": "technology",
    "location": "global",
    "published": "2025-08-10T11:00:00-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Tech companies keep telling everyone that this or that AI feature is going to change everything. But when you press them for examples, real, concrete examples of how those AI tools should be used, the answers tend to be lackluster. Sometimes AI tools feel so open-ended, it's hard to know where to st"
    ],
    "image_url": "",
    "titles": [
      "We found stuff AI is pretty good at"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.827,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.461,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 8 tokens"
  },
  {
    "title": "7 password managers to help keep your apps safe",
    "domain": "technology",
    "location": "global",
    "published": "2025-08-10T11:00:00-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Passwords still seem to be the most popular method of ensuring that the right person is using the right app or service, despite the slow adoption of passkeys, which are considered more secure. And because we should be using different ones for each device and/or app, the best way to track all of them"
    ],
    "image_url": "",
    "titles": [
      "7 password managers to help keep your apps safe"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.827,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.454,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 9 tokens"
  },
  {
    "title": "Sex is getting scrubbed from the internet, but a billionaire can sell you AI nudes",
    "domain": "technology",
    "location": "global",
    "published": "2025-08-10T08:30:00-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "In the fascinating new reality of the internet, teen girls can't learn about periods on Reddit and indie artists can't sell smutty games on Itch.io, but a military contractor will make you nonconsensual deepfakes of Taylor Swift taking her top off for $30 a month. Early Tuesday, Elon Musk's xAI laun"
    ],
    "image_url": "",
    "titles": [
      "Sex is getting scrubbed from the internet, but a billionaire can sell you AI nudes"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.785,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.452,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 15 tokens"
  }
]