[
  {
    "title": "Bangladesh Jet Crash Kills 20, Injures 200 at Dhaka School",
    "domain": "general",
    "location": "national",
    "published": "Mon, 21 Jul 2025 11:17:50 -0400",
    "source": "NPR",
    "sources": [
      "New York Times",
      "Al Jazeera",
      "The Guardian",
      "NPR",
      "BBC",
      "Deutsche Welle"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "The jet crashed into a school campus in the capital, Dhaka, shortly after takeoff on Monday.",
      "The air force says the F-7 jet experienced a mechanical fault after taking off for a training exercise in Dhaka.",
      "Mostly students killed and more than 50 wounded as training aircraft crashes into campus in capital Dhaka.",
      "At least 19 people were killed and more than 100 were injured after a Bangladesh Air Force plane crashed into a school building in Dhaka. It is the country's deadliest aviation disaster in more than 40 years.",
      "<p>Another 164 injured when training jet had technical problem after takeoff, with pilot said to be among the dead</p><p>At least 19 people were killed and 164 injured after a Bangladesh air force training jet crashed into a college and school campus in the capital, Dhaka, on Monday after experienci",
      "More than 160 people were injured after the training aircraft crashed because of a mechanical error, military officials said. The country’s interim leader called the loss “irreparable.”",
      "<p>Injured number almost 200 after training jet had technical problem once airborne, with pilot among the dead</p><p>At least 20 people were killed and nearly 200 injured – many of them children – when a Bangladeshi fighter jet on a routine training exercise crashed into a school in Dhaka in the cou"
    ],
    "image_url": "",
    "titles": [
      "A Bangladesh Air Force training jet crashes into a Dhaka school, killing at least 19",
      "At least 19 dead after air force jet crashes into Bangladesh school",
      "Bangladesh air force plane crashes into college campus, killing at least 19",
      "Bangladesh Air Force plane crashes into school, several killed",
      "At least 19 killed as military plane crashes into Bangladesh school campus",
      "Bangladesh Air Force Plane Crashes Into School, Killing at Least 20",
      "At least 20 killed as military plane crashes into Bangladesh school campus"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.982,
      "consensus": 1.0,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.831,
    "summary": "An F-7 training jet of the Bangladesh Air Force crashed into a school campus in Dhaka due to a mechanical fault shortly after takeoff, resulting in at least 20 deaths and nearly 200 injuries. The crash, described as the country's deadliest aviation disaster in over 40 years, occurred during a routine training exercise. Among the casualties were mostly students, and the pilot was also confirmed dead. The country's interim leader has called the loss \"irreparable.\"",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about a tragic event but lacks depth or insight. It does not offer any actionable insights for the reader, nor does it report on solutions or improvements. The causes of the crash are briefly mentioned, but there is no discussion of the broader implications or potential measures to prevent similar incidents in the future.",
    "image": {
      "src": "https://live.staticflickr.com/65535/51650035961_cb078d8fc1_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/b8d89cf7-5c87-455d-8954-b9e08fbb84c4/thumb/",
      "alt": "First Minister Nicola Sturgeon meets with Bangladesh Prime Minister Sheikh Hasina",
      "credit": "Scottish Government / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Scottie Scheffler Wins First Open Championship at Royal Portrush",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 21 Jul 2025 11:27:05 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Scheffler's march on Royal Portrush was a masterclass and proof that his approach is unlike anyone else's.",
      "Plus, Rory McIlroy was rejuvenated in his return home, and Bryson DeChambeau is bouncing into the Ryder Cup",
      "<p>Watch as Scottie Scheffler taps in his final putt in on the 18th hole at Royal Portrush to capture his first win at the Open Championship and be named Champion Golfer of the Year.</p>"
    ],
    "image_url": "",
    "titles": [
      "Scottie Scheffler's unique dominance over golf continues at Open Championship",
      "2025 Open Championship takeaways: Scottie Scheffler's maturity matters, Americans continue dominance in majors",
      "Scheffler’s dominance continues with first Open Championship victory"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.985,
      "consensus": 0.847,
      "constructiveness": 0.6,
      "proximity": 0.75
    },
    "score": 0.789,
    "summary": "Scottie Scheffler won his first Open Championship at Royal Portrush, demonstrating exceptional skill and a unique approach to the game. By tapping in his final putt on the 18th hole, Scheffler secured the title of Champion Golfer of the Year. This victory marks a significant achievement in his career.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information about Scottie Scheffler's victory at the Open Championship, which can contribute to the reader's understanding of his career progression. However, it doesn't provide a deeper context or analysis of his unique approach to the game or the significance of this win in the broader golf landscape.",
    "image": {
      "src": "https://live.staticflickr.com/3547/3320553551_e623ec19d8.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/926c6ac5-290c-42b8-9cb9-0fa0be4cb030/thumb/",
      "alt": "Dennis Rodman gets tackled by Michael Jordan and Scottie Pippen",
      "credit": "OPEN Sports / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Chris Paul Returns to LA Clippers for Final NBA Season",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 21 Jul 2025 11:28:27 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Free agent point guard Chris Paul has agreed to a deal with the LA Clippers for his expected final, 21st NBA season.",
      "Paul is returning to the team he played for between 2011 and 2017",
      "<p>Chris Paul is joining the Los Angeles Clippers, ESPN&#8217;s Shams Charania reported Monday.</p>"
    ],
    "image_url": "",
    "titles": [
      "Paul reuniting with Clippers for 21st NBA season",
      "Chris Paul returns to Clippers in NBA free agency: CP3 back in L.A. for 21st NBA season, per report",
      "Report: Chris Paul to sign with Clippers"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.986,
      "consensus": 0.847,
      "constructiveness": 0.5,
      "proximity": 0.75
    },
    "score": 0.779,
    "summary": "Chris Paul, a free agent point guard, has agreed to join the LA Clippers for what is anticipated to be his final, 21st season in the NBA. This marks Paul's return to the Clippers, a team he previously played for from 2011 to 2017. The news was reported by ESPN's Shams Charania.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness about Chris Paul's career move. However, it lacks depth or insight into why this move is significant, how it might affect the team's performance, or what it means for Chris Paul's career.",
    "image": {
      "src": "https://live.staticflickr.com/4165/33486317634_84f3e6ae87_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/cc9027ea-32d4-409d-b63f-d20c957ffd36/thumb/",
      "alt": "Elon Musk and Chris Anderson at TED 2017",
      "credit": "jurvetson / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "13 Arrested in Pakistan for Honor Killing of Married Couple",
    "domain": "general",
    "location": "global",
    "published": "Mon, 21 Jul 2025 13:29:41 +0000",
    "source": "Al Jazeera",
    "sources": [
      "The Guardian",
      "Deutsche Welle",
      "Al Jazeera"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "Thirteen arrested in Balochistan province for alleged involvement in the killing of a couple ordered by a tribal leader.",
      "The viral video shows a Pakistani woman holding a copy of the Quran, somewhere in the Balochistan desert, before she was shot. She reportedly married against the wishes of her family.",
      "<p>Arrests made in Balochistan after video showing man and woman being fatally shot went viral</p><p>Thirteen suspects have been arrested in Pakistan’s south-western Balochistan province after a video emerged of a woman and a man being shot dead for marrying against the wishes of their families in a"
    ],
    "image_url": "",
    "titles": [
      "Pakistan arrests over a dozen suspects as ‘honour killing’ video goes viral",
      "Pakistan: Police arrest suspect in viral honor killing video",
      "Pakistan authorities arrest 11 suspects over ‘honour’ killing video"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.946,
      "consensus": 0.847,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.766,
    "summary": "Thirteen individuals were arrested in Pakistan's Balochistan province following the circulation of a video depicting the fatal shooting of a couple who married against their families' wishes. The arrests were made after the video, showing the woman holding the Quran before being shot in a desert, went viral. The killings were reportedly ordered by a tribal leader.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful information about a social issue in Pakistan, increasing awareness about the practice of honor killings. It reports on the arrests made in response to the crime, indicating an attempt to address the problem. However, it does not delve into the root causes of such practices or potential solutions, limiting its overall constructiveness.",
    "image": {
      "src": "https://live.staticflickr.com/6069/6058724126_966285b5e7_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/b3695ef9-d66c-4097-82b7-f163194b5b86/thumb/",
      "alt": "13 Witches",
      "credit": "13 Witches / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Barcelona Secures Loan Deal for England's Rashford from Man United",
    "domain": "general",
    "location": "global",
    "published": "Mon, 21 Jul 2025 12:21:44 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Sportsnet",
      "The Guardian",
      "Al Jazeera"
    ],
    "domains": [
      "sports",
      "general"
    ],
    "snippets": [
      "Barcelona agree deal to sign England international Marcus Rashford on an initial loan deal from Manchester United.",
      "<p><a href=\"https://www.theguardian.com/info/2022/nov/14/football-daily-email-sign-up\"><strong>Sign up now! Sign up now! Sign up now? Sign up now!</strong></a></p><p>The transfer boffins at Manchester United didn’t have a great record last summer when it came to the club’s departures. Scott McTomina",
      "<p>Rashford is in Barcelona to complete a move from Manchester United, a person with knowledge of the transfer told The Associated Press on Monday.</p>"
    ],
    "image_url": "",
    "titles": [
      "Barcelona sign Marcus Rashford from Manchester United on loan",
      "Football Daily | Marcus Rashford and the Manchester United transfer boffins",
      "Marcus Rashford in Barcelona to complete loan move from Manchester United"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.924,
      "consensus": 0.897,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.754,
    "summary": "Barcelona has reached an agreement to sign England international Marcus Rashford on an initial loan from Manchester United. Rashford is currently in Barcelona to finalize the move, according to a source familiar with the transfer. This development follows a period of criticism regarding Manchester United's handling of player departures.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story provides basic awareness about a sports transfer. While it does inform about a significant event in the sports world, it does not offer deeper understanding or actionable insights for the reader. The story does not report on progress or solutions, nor does it increase clarity around systems or trends.",
    "image": {
      "src": "https://live.staticflickr.com/33/42632006_72e138b8dd_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/023dc0aa-aa02-4faa-805f-505c763e4b1b/thumb/",
      "alt": "Barcelona",
      "credit": "lorentey / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Stellantis Posts $2.68B Loss, Cites US Tariffs and Charges",
    "domain": "business",
    "location": "national",
    "published": "Mon, 21 Jul 2025 13:15:57 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Financial Post"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Stellantis released preliminary estimates for the first six months of the year shortly after withdrawing its full-year financial guidance.",
      "Stellantis, the maker of Jeep and Ram vehicles, says its preliminary estimates show a 2.3 billion euros ($2.68 billion) net loss in the first half of the year due to U.S. tariffs and some hefty charges. The automaker anticipates an impact of about 300 million euros for net tariffs incurred, and also"
    ],
    "image_url": "",
    "titles": [
      "Jeep maker Stellantis warns of a shock $2.7 billion loss as tariffs bite",
      "Stellantis warns of $2.7 billion loss for 1st half of 2025 due to tariffs and some big charges"
    ],
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.941,
      "consensus": 0.632,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.703,
    "summary": "Stellantis reported a preliminary net loss of 2.3 billion euros ($2.68 billion) for the first half of the year, attributing the loss to U.S. tariffs and significant charges. The automaker, known for producing Jeep and Ram vehicles, highlighted that tariffs contributed approximately 300 million euros to its losses. This announcement came shortly after Stellantis withdrew its full-year financial guidance.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story provides a deeper understanding of the financial situation of Stellantis, the impacts of US tariffs, and the challenges faced by the automotive industry. It increases clarity around the systems and causes of the company's losses and could potentially influence decision-making for stakeholders and investors.",
    "image": {
      "src": "https://upload.wikimedia.org/wikipedia/commons/3/36/Stellantis_net_income.webp",
      "thumbnail": "https://api.openverse.org/v1/images/70f72199-17da-4466-a822-1ad4e3c820b9/thumb/",
      "alt": "Stellantis net income",
      "credit": "",
      "license": "cc0",
      "license_version": "1.0",
      "license_url": "https://creativecommons.org/publicdomain/zero/1.0/deed.en/",
      "provider": "wikimedia",
      "source": "Openverse"
    }
  },
  {
    "title": "Titans QB Will Levis Out for Season, Surgery Ends Starting Bid",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 21 Jul 2025 11:28:26 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Titans quarterback Will Levis has elected to undergo season-ending surgery on his right shoulder, meaning rookie Cam Ward will take first-team reps in training camp.",
      "Levis had been competing with Ward for Tennessee's starting quarterback spot"
    ],
    "image_url": "",
    "titles": [
      "Titans' Levis to have surgery, miss 2025 season",
      "Titans' Will Levis to undergo shoulder surgery, miss 2025 season as No. 1 pick Cameron Ward becomes starter"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.986,
      "consensus": 0.632,
      "constructiveness": 0.6,
      "proximity": 0.75
    },
    "score": 0.7,
    "summary": "Titans quarterback Will Levis will have season-ending surgery on his right shoulder. This decision ends his competition with rookie Cam Ward for the starting quarterback position. Ward will now take first-team reps in training camp as the team prepares for the upcoming season.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information for fans and followers of the Titans, especially those interested in the team’s lineup and performance. However, it does not provide any solutions or insights into how the team plans to address the situation, nor does it provide a broader context or understanding of the implications for the team.",
    "image": {
      "src": "https://live.staticflickr.com/65535/50350620677_92b2cc9fd1_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/8f219415-16db-453a-80e1-d049b265089e/thumb/",
      "alt": "Titan - Map Projected - July 25 2015",
      "credit": "Kevin M. Gill / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "DeChambeau Confirmed for U.S. Team at Bethpage Black by Bradley",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 21 Jul 2025 11:28:27 EST",
    "source": "ESPN",
    "sources": [
      "Sports Illustrated",
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Bryson DeChambeau will represent the United States at this year's Ryder Cup regardless of whether he secures an automatic qualifying spot for the event.",
      "<a href=\"https://news.google.com/rss/articles/CBMiiwFBVV95cUxQMlZHelc3WS1YaWxCYzZuUFZDNnI3djhKdVhTZjRsQldVSU9rQWlTMWVCRGlyUWFfcGxwOUZwOVRrQm9UQmw4eXNtTXRQVzRRU3VsN1hfWWx2U2xxajRuSFJWeTFJTXVoNnExQ2kwY1V0V1Jzdy1VSG9HX19nY1Y0a01EVDl2ZUNQSzBv?oc=5\" target=\"_blank\">Keegan Bradley Confirms Bryson DeChambe",
      "<a href=\"https://news.google.com/rss/articles/CBMibkFVX3lxTFA1bE80OWxLc0cwLWczMzhFWFRDMnREaFRPbm52anpEV0wwN1hQTFVlb3pXU2NmWUpsZ04zeUIxa29sNnFyNTRlZnRJV2ZWalpPRl9zSEVONUFKRWYyLU5Id2xkY1RCSDBqT0p1YlFn?oc=5\" target=\"_blank\">Fact or Fiction: The U.S. Will Win the Ryder Cup in a Rout</a>&nbsp;&nbsp;<font"
    ],
    "image_url": "",
    "titles": [
      "Bradley says Bryson will make Ryder Cup team",
      "Keegan Bradley Confirms Bryson DeChambeau Will Be on U.S. Ryder Cup Team - Sports Illustrated",
      "Fact or Fiction: The U.S. Will Win the Ryder Cup in a Rout - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.986,
      "consensus": 0.632,
      "constructiveness": 0.6,
      "proximity": 0.75
    },
    "score": 0.7,
    "summary": "Keegan Bradley has confirmed that Bryson DeChambeau will be part of the U.S. team at Bethpage Black, regardless of his ranking in the upcoming month. This decision ensures DeChambeau's participation in the event, highlighting his significance to the team.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information about the team selection for the upcoming event, which could be relevant for fans and followers of the sport. However, it doesn't delve into why this decision was made or the potential impacts on the team's performance.",
    "image": {
      "src": "https://live.staticflickr.com/7926/46898909101_412471be11_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/9c66f184-3bf1-4e04-9ad9-ce72b72ec6d3/thumb/",
      "alt": "Bryson DeChambeau (Trending Twitter Topics from 27.01.2019)",
      "credit": "trendingtopics / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Trump Threatens to Block NFL Stadium Deal Over Team Name Change",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 21 Jul 2025 11:28:26 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "President Donald Trump is threatening to hold up a new stadium deal for Washington's NFL team if it does not restore its old name and is calling for Cleveland's baseball team to revert to its former name as well.",
      "<p>President Donald Trump is threatening to hold up a new stadium deal for Washington&#8217;s NFL team if it does not restore its old name, which was considered offensive to Native Americans.</p>"
    ],
    "image_url": "",
    "titles": [
      "Trump aims at stadium over Commanders' name",
      "Trump threatens to hold up stadium deal unless Washington Commanders undo name change"
    ],
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.986,
      "consensus": 0.632,
      "constructiveness": 0.5,
      "proximity": 0.75
    },
    "score": 0.697,
    "summary": "President Donald Trump is threatening to obstruct the stadium deal for Washington's NFL team, the Commanders, unless they revert to their previous name, the Redskins, which has been criticized as offensive to Native Americans. He also demands that Cleveland's baseball team return to its old name, criticizing their decision to retire the \"Indians\" nickname for the Guardians. The proposed new stadium for the Commanders is planned on land managed by the US National Park Service.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story raises awareness about the ongoing debate over sports team names that are offensive to certain groups, and the political involvement in it. However, it does not provide much depth or insight beyond the basic facts of the situation, and does not report on any potential solutions or improvements.",
    "image": {
      "src": "https://live.staticflickr.com/815/40567174204_f340b664a7_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/193cb26a-47b0-4ceb-90ff-c10ce8c0ee1c/thumb/",
      "alt": "trump",
      "credit": "Book Catalog / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Airline Introduces Staff Bonus for Enforcing Bag Size, Caps at €80",
    "domain": "general",
    "location": "global",
    "published": "Mon, 21 Jul 2025 10:18:34 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "The airline says it is \"determined to eliminate the scourge of oversized bags\" on its planes.",
      "<p>No-frills carrier’s ‘gate bag bonus’ of €1.50 a passenger capped at €80 a month for staff members but ceiling could rise </p><ul><li><p><a href=\"https://www.theguardian.com/business/2025/jul/19/from-liquids-to-border-queues-how-changes-at-uk-airports-will-affect-your-trip\">From liquids to border "
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/0583/live/a5859b10-660d-11f0-a91e-6325aab01240.jpg",
    "titles": [
      "Ryanair considers increasing bonus for staff who spot oversized bags",
      "Ryanair weighs up increasing bonus to staff for intercepting oversized luggage"
    ],
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.885,
      "consensus": 0.632,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.692,
    "summary": "An airline has announced its commitment to addressing the issue of oversized luggage on its flights. It has introduced a 'gate bag bonus' system, rewarding staff with €1.50 per passenger for enforcing bag size restrictions, with a monthly cap of €80. This cap may increase, signaling the airline's serious approach to ensuring luggage compliance.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story clearly highlights a solution to a common problem in the airline industry. It provides useful information about the airline's new policy and how it plans to enforce luggage compliance. However, it could provide more context about the impact of oversized luggage on airlines and passengers, and how other airlines are addressing this issue.",
    "image": {
      "src": "https://live.staticflickr.com/8085/8490274506_efc1687f17_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/24cb3e5a-05be-4825-a689-9b764ccd2ab0/thumb/",
      "alt": "United Airlines Stewardesses [1968]",
      "credit": "KurtClark / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "High Court Approves Wimbledon Expansion, Dismisses Opposition Challenge",
    "domain": "general",
    "location": "global",
    "published": "Mon, 21 Jul 2025 15:07:20 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "A High Court judge dismisses a legal challenge against the decision to approve the club's expansion.",
      "<p>Judge upholds decision to allow club to build 39 new courts, after campaigners called for it to be overturned</p><p>A proposed expansion of the Wimbledon tennis site will go ahead after the high court ruled in favour of an original decision to allow a further 39 courts, including an 8,000-seat sh"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/4cf8/live/ce0e6320-6633-11f0-af20-030418be2ca5.jpg",
    "titles": [
      "Plans to expand Wimbledon tennis site can go ahead, judge rules",
      "Wimbledon tennis site expansion can go ahead, high court rules"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.978,
      "consensus": 0.632,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.674,
    "summary": "A High Court judge has ruled in favor of the Wimbledon tennis site's expansion, dismissing a legal challenge against it. The decision allows for the construction of 39 new courts, including an 8,000-seat show court. This ruling confirms the original approval for the expansion, despite opposition from campaigners.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information about the Wimbledon tennis site's expansion, which could influence decisions related to sports, tourism, and local development. However, it doesn't highlight solutions or progress beyond the court ruling, and it doesn't delve into the implications of the expansion.",
    "image": {
      "src": "https://live.staticflickr.com/65535/51913289677_f7951de108_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/e61d7b80-edba-4433-bf68-3b20ef933045/thumb/",
      "alt": "Constructing 'The Nest' apartment high rise",
      "credit": "Alan Light / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Manchester United Approves Rashford's Season-Long Loan to Barcelona",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 21 Jul 2025 11:05:22 EST",
    "source": "ESPN",
    "sources": [
      "Sky Sports",
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Marcus Rashford landed in Barcelona on Sunday ahead of completing a season-long loan move from Manchester United.",
      "Marcus Rashford is understood to have completed his Barcelona medical this morning."
    ],
    "image_url": "",
    "titles": [
      "Rashford arrives in Barcelona ahead of loan move",
      "Rashford completes Barcelona medical ahead of loan"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.978,
      "consensus": 0.632,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.669,
    "summary": "Manchester United has approved a season-long loan move for Marcus Rashford to Barcelona. Rashford arrived in Barcelona on Sunday to finalize the deal. The agreement between the clubs includes an option to buy. Rashford, 27, is set to join the Spanish giants after the clubs reached a consensus over the weekend.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about a player's transfer in the football world, but it doesn't offer deep insights or actionable information for the reader. It doesn't report on solutions, improvements, or attempts to solve problems.",
    "image": {
      "src": "https://live.staticflickr.com/122/262767295_3c81c3afb3_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/6afb660e-89f2-48db-badf-42ad9102c851/thumb/",
      "alt": "Ryan Giggs (Manchester United Museum)",
      "credit": "edwin.11 / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Liverpool Secures Hugo Ekitike for £79m, Summer Spending Nears £300m",
    "domain": "general",
    "location": "global",
    "published": "Mon, 21 Jul 2025 10:54:24 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "Sky Sports"
    ],
    "domains": [
      "sports",
      "general"
    ],
    "snippets": [
      "<ul><li><p>Eintracht Frankfurt to get guaranteed £69m for striker</p></li><li><p>He will join squad in Hong Kong subject to medical</p></li></ul><p>Liverpool are to take their summer spending to almost £300m after agreeing to pay £69m plus £10m in add-ons for the Eintracht Frankfurt striker Hugo Eki",
      "Hugo Ekitike is expected to arrive in the UK on Tuesday for a medical and to finalise a six-year contract after Liverpool reached a total agreement in principle with Eintracht Frankfurt over a deal worth &#163;79m (&#8364;91.5m)."
    ],
    "image_url": "https://i.guim.co.uk/img/media/5b58802b5b4182d077b1cafe7f9c0b95108f71a5/344_0_1899_1519/master/1899.jpg?width=140&quality=85&auto=format&fit=max&s=88d10232d3d7315791a8a8aafdfe1b87",
    "titles": [
      "Liverpool agree £79m deal for Hugo Ekitike, taking summer spend to almost £300m",
      "Ekitike set for medical after Liverpool agree £79m deal"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.896,
      "consensus": 0.682,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.66,
    "summary": "Liverpool has agreed to a deal with Eintracht Frankfurt for striker Hugo Ekitike, totaling £79m, including add-ons. Ekitike is set to join Liverpool's squad in Hong Kong after completing a medical and finalizing a six-year contract. This move brings Liverpool's summer spending to nearly £300m.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about Liverpool's recent acquisition and its impact on their summer spending. However, it lacks depth or insight into why this move is significant, how it might affect the team's performance, or how it compares to other teams' spending.",
    "image": {
      "src": "https://live.staticflickr.com/5585/14776998738_2d442e5313_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/7d774ad6-cde4-4ded-b15b-982f8e629af9/thumb/",
      "alt": "Lovely Sefton Park, Liverpool.",
      "credit": "Radarsmum67 / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "McLaren CEO Unsurprised by Horner's Red Bull Exit Amid Team Drama",
    "domain": "general",
    "location": "global",
    "published": "Mon, 21 Jul 2025 14:59:46 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Sky Sports"
    ],
    "domains": [
      "sports",
      "general"
    ],
    "snippets": [
      "McLaren Racing CEO Zak Brown says he was \"not surprised\" Christian Horner was sacked as team boss of Red Bull.",
      "McLaren chief executive Zak Brown says he was \"not surprised\" by the sacking of Christian Horner after \"a lot of drama\" at Red Bull in the last two years."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/0733/live/19d80420-6641-11f0-a892-5dfba37f7a84.jpg",
    "titles": [
      "Brown 'not surprised' by Horner's Red Bull sacking",
      "Brown 'not surprised' by Horner sacking after 'a lot of drama'"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.976,
      "consensus": 0.682,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.656,
    "summary": "McLaren Racing CEO, Zak Brown, expressed he was \"not surprised\" by the dismissal of Christian Horner as Red Bull's team boss, citing \"a lot of drama\" at Red Bull over the past two years. This statement reflects Brown's perspective on the recent changes within the Red Bull racing team's leadership.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides some basic awareness about changes within the Red Bull racing team's leadership, but it doesn't offer much in terms of depth or insight. It doesn't contribute to the reader's understanding or decision-making, nor does it report on solutions or improvements.",
    "image": {
      "src": "https://live.staticflickr.com/7041/6953157111_9bfd4aaa4a.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/fe9e3638-b735-4a73-8212-07aeb036cdaf/thumb/",
      "alt": "Mclaren F1`s testing at Goodwood Circuit - 20 May 1993",
      "credit": "PSParrot / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Body Found in Lake Believed to be Missing Rachel Booth, 38",
    "domain": "general",
    "location": "global",
    "published": "Mon, 21 Jul 2025 14:50:56 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "Rachel Booth, 38, went missing in the early hours of Saturday, prompting a widespread search.",
      "<p>Police say formal identification yet to take place but body is believed to be that of Booth, who went missing on Saturday</p><p>A body has been found in a lake following an extensive search for a woman who went missing in Cheshire on Saturday morning.</p><p>Rachel Booth was reported missing in th"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/762a/live/83cc4460-6595-11f0-9cdf-2998217641f9.jpg",
    "titles": [
      "Body found in lake in search for missing mum",
      "Body found in lake in search for missing Cheshire woman Rachel Booth"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.973,
      "consensus": 0.632,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.643,
    "summary": "A body, believed to be that of 38-year-old Rachel Booth who went missing early Saturday in Cheshire, has been found in a lake. While formal identification is pending, police are proceeding under the assumption that it is Booth. Her disappearance had initiated a widespread search effort.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "While this story informs the public about the tragic end of a search for a missing person, it doesn't provide actionable insights or deeper understanding. It also doesn't report on solutions, improvements, or attempts to solve problems. The story mainly serves to update the public on a specific event.",
    "image": {
      "src": "https://live.staticflickr.com/3231/3044633211_99a8fb5a14.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/97fefa90-d8c8-4341-9a8c-138381be95d3/thumb/",
      "alt": "body",
      "credit": "Angelic Gorgeous kirst / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Chiefs' Rice to Join Training Camp After Jail Sentence for Crash",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 21 Jul 2025 00:51:51 +0000",
    "source": "CBS Sports",
    "sources": [
      "Sportsnet",
      "CBS Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Rice was sentenced to 30 days in jail last week",
      "<p>Rashee Rice will be a full participant in training camp, Chiefs coach Andy Reid said Sunday, three days after the standout wide receiver was sentenced to 30 days in jail after authorities said he and another speeding driver caused a chain-reaction crash that left multiple people injured on a Dall"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/07/21/4be8c775-f225-4dc4-903b-57f135abbb34/r-rice-getty.png",
    "titles": [
      "Chiefs WR Rashee Rice to be full participant in training camp despite upcoming jail stint",
      "Chiefs’ Rashee Rice to participate in training camp despite jail sentence"
    ],
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.727,
      "consensus": 0.632,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.62,
    "summary": "Rashee Rice, the Chiefs' wide receiver, will join the team's training camp as a full participant, confirmed by Coach Andy Reid. This announcement came three days after Rice was sentenced to 30 days in jail for his involvement in a chain-reaction crash in Dallas, caused by speeding, which resulted in multiple injuries.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story provides basic awareness about the incident and the player's return to the training camp. However, it lacks depth and insight into the implications of this decision, the player's rehabilitation process, or the team's stance on such behavior.",
    "image": {
      "src": "https://live.staticflickr.com/7200/7030420783_59657c07f9_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/2eff702f-ff85-4a5d-b905-41326f0311ea/thumb/",
      "alt": "Chief Dan George, 'His Heart Soared Like the Eagle'",
      "credit": "Tony Fischer Photography / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Top 3 MLB Pitcher Strikeout Props Identified for Monday's Games",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 21 Jul 2025 15:55:12 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "After simulating every MLB game 10,000 times, the SportsLine Projection Model has identified the three best pitcher strikeout props for Monday's 15-game schedule"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/07/12/bbfad8ca-3dd1-4a31-8482-cd8edd484242/zack-wheeler-cbs.jpg",
    "titles": [
      "Today's best MLB pitcher strikeout props: Fade Phillies starter against Red Sox"
    ],
    "score_components": {
      "magnitude": 0.229,
      "recency": 0.995,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.507,
    "summary": "The SportsLine Projection Model analyzed all MLB games and found the top three pitcher strikeout props for Monday's 15-game schedule. The model simulated each game 10,000 times to determine the best options. The identified pitcher strikeout props are based on this analysis.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides actionable insights for those interested in betting or fantasy leagues. It also provides a deeper understanding of the game's dynamics by explaining the process of how the top three pitcher strikeout props were identified. However, it doesn't report on any progress, solutions, or improvements.",
    "image": {
      "src": "https://live.staticflickr.com/8395/8674505872_0b39d3a96b_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/34d01a23-274a-44fe-9d2b-a3d0bbf26e00/thumb/",
      "alt": "Flat-top Mountain - Anchorage",
      "credit": "Accretion Disc / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Canada's Q2 Sentiment Dips on Tariffs, Trade Outlook Slightly Brighter",
    "domain": "business",
    "location": "national",
    "published": "Mon, 21 Jul 2025 15:45:50 +0000",
    "source": "Financial Post",
    "sources": [
      "Financial Post"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "A pair of reports from the Bank of Canada say tariff-related uncertainty continued to put a damper on business and consumer sentiment in the second quarter, but the worst-case trade scenarios previously anticipated seem less likely. The central bank&#8217;s business outlook survey said business sent"
    ],
    "image_url": "",
    "titles": [
      "Business confidence subdued amid tariffs but ‘worst-case’ less likely: BoC survey"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.992,
      "consensus": 0.393,
      "constructiveness": 0.7,
      "proximity": 1.0
    },
    "score": 0.487,
    "summary": "The Bank of Canada released two reports indicating that tariff-related uncertainty negatively impacted business and consumer sentiment in the second quarter. However, the reports also suggest that the worst-case trade scenarios previously feared are now considered less likely. This reflects a mixed outlook, with ongoing concerns about trade tensions but a somewhat improved risk assessment.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful information about the impact of tariffs on business and consumer sentiment, as well as a change in the risk assessment for worst-case trade scenarios. It could be more constructive if it offered more depth or insight into the causes or potential solutions.",
    "image": {
      "src": "https://live.staticflickr.com/2110/13156906733_27e2f04f8b_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/299a40b6-7c69-4652-a8bb-352b5869a18b/thumb/",
      "alt": "Canada",
      "credit": "kevin dooley / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "AI voice company Hyper raises $6.3M to help automate 9-1-1 calls",
    "domain": "technology",
    "location": "global",
    "published": "Mon, 21 Jul 2025 16:00:00 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Hyper announced Monday a $6.3 million seed round led by Eniac Ventures, as well as an official emergence from stealth."
    ],
    "image_url": "",
    "titles": [
      "AI voice company Hyper raises $6.3M to help automate 9-1-1 calls"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.996,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.458,
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive because it reports on an innovation that could significantly improve the efficiency of emergency response systems. It could provide readers with a deeper understanding of how AI technology is being used to solve real-world problems.",
    "image": {
      "src": "https://live.staticflickr.com/7594/28799579322_f9e3ce8511_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/b52e7dfb-5b36-417b-8387-f8d7fd8c07e3/thumb/",
      "alt": "Intelligence Inside: the future of AI and computation",
      "credit": "jurvetson / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Study Identifies Genes Linked to Human Brain Features, Language Disorders",
    "domain": "science",
    "location": "global",
    "published": "Mon, 21 Jul 2025 11:00:01 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "What makes the human brain distinctive? A new study published in Cell identifies two genes linked to human brain features and provides a road map to discover many more. The research could lead to insights into the functioning and evolution of the human brain, as well as the roots of language disorde"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2021/dna.jpg",
    "titles": [
      "Mapping DNA repeats: Newly found genes may explain brain evolution and language disorders"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.976,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.454,
    "summary": "A study published in Cell has identified two genes that contribute to the unique features of the human brain, offering a pathway to uncover additional genes. This research aims to enhance understanding of human brain evolution, functioning, and the origins of language disorders.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story clearly highlights progress in the understanding of the human brain and language disorders. It provides actionable insights into the potential for further research and increases understanding of human brain evolution and functioning. It also suggests potential solutions for language disorders.",
    "image": {
      "src": "https://live.staticflickr.com/8144/7653312938_e77f116d69_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/c3f2ab41-2760-4250-8193-636c43f9018b/thumb/",
      "alt": "Medical Study",
      "credit": "born1945 / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Anduril alums raise $24M Series A to bring military logistics out of the Excel spreadsheet era",
    "domain": "technology",
    "location": "global",
    "published": "Mon, 21 Jul 2025 15:00:15 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Rune Technologies raised $24 million to advance deployment of TyrOS, AI-enabled predictive software for military logistics that can run on the ground without internet connection."
    ],
    "image_url": "",
    "titles": [
      "Anduril alums raise $24M Series A to bring military logistics out of the Excel spreadsheet era"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.976,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.454,
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it reports on a significant funding round for a company that is working to modernize military logistics. It provides readers with insights into how technology is being used to improve efficiency in this sector.",
    "image": {
      "src": "https://upload.wikimedia.org/wikipedia/commons/e/ed/Hodor_anduril_%2810.1093-zoolinnean-zly063%29_Figure_13.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/2ad586d0-f993-46f4-87db-673cde6d8963/thumb/",
      "alt": "Hodor anduril (10.1093-zoolinnean-zly063) Figure 13",
      "credit": "Bonifácio, P., Menot, L. 2018. New genera and species from the Equatorial Pacific provide phylogenetic insights into deep-sea Polynoidae (Annelida). Zoological Journal of the Linnean Society. 185(3): 555-635. DOI: 10.1093/zoolinnean/zly063 / CC BY 4.0",
      "license": "by",
      "license_version": "4.0",
      "license_url": "https://creativecommons.org/licenses/by/4.0/",
      "provider": "wikimedia",
      "source": "Openverse"
    }
  },
  {
    "title": "AI Systems Advance Fusion Energy Safety, Efficiency",
    "domain": "science",
    "location": "global",
    "published": "Mon, 21 Jul 2025 10:20:05 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "A research team led by Prof. Sun Youwen from the Hefei Institutes of Physical Science of the Chinese Academy of Sciences has developed two innovative artificial intelligence (AI) systems to enhance the safety and efficiency of fusion energy experiments."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/new-ai-advances-boost.jpg",
    "titles": [
      "New AI advances boost safety and performance in fusion reactors"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.962,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.451,
    "summary": "A research team led by Prof. Sun Youwen at the Hefei Institutes of Physical Science, Chinese Academy of Sciences, has created two AI systems aimed at improving the safety and efficiency of fusion energy experiments. These developments mark significant progress in the field of fusion energy, potentially leading to safer and more effective research practices.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive as it reports on significant progress in the field of fusion energy through the use of AI systems. It provides useful information about new research practices and innovations in fusion energy safety and efficiency, empowering readers with knowledge about advancements in this field.",
    "image": {
      "src": "https://live.staticflickr.com/7594/28799579322_f9e3ce8511_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/b52e7dfb-5b36-417b-8387-f8d7fd8c07e3/thumb/",
      "alt": "Intelligence Inside: the future of AI and computation",
      "credit": "jurvetson / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "From idea to first check: Raising pre-seed and seed capital with Charles Hudson and Navin Chaddha at TechCrunch Disrupt 2025",
    "domain": "technology",
    "location": "global",
    "published": "Mon, 21 Jul 2025 14:15:00 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "More than 10,000 founders, investors, and tech insiders will convene at Moscone West in San Francisco from October 27-29 for TechCrunch Disrupt 2025 — one of the year’s most anticipated tech conferences.&#160; Of the 250+ tech leaders taking the stage, don’t miss this standout panel on the Builders "
    ],
    "image_url": "",
    "titles": [
      "From idea to first check: Raising pre-seed and seed capital with Charles Hudson and Navin Chaddha at TechCrunch Disrupt 2025"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.961,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.451,
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive. It provides actionable insights into how to raise early-stage capital, reports on a specific solution (the TechCrunch Disrupt event), and increases clarity around the system of startup funding.",
    "image": {
      "src": "https://live.staticflickr.com/7155/6442111703_0160b8e0af.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/020d7c3b-f10f-46ad-93cc-5f806be53919/thumb/",
      "alt": "ideas",
      "credit": "Sean MacEntee / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "New Quick-Serve Lounges Offer Rest for Travelers at Hubs",
    "domain": "business",
    "location": "global",
    "published": "Mon, 21 Jul 2025 15:48:00 GMT",
    "source": "MarketWatch",
    "sources": [
      "MarketWatch"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "The new quick-serve lounges are aimed at travelers looking for a short respite"
    ],
    "image_url": "https://images.mktw.net/im-82831679",
    "titles": [
      "Why American Express and American Airlines shrunk the airport lounge"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.992,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.45,
    "summary": "The new quick-serve lounges introduced at various travel hubs are designed to offer travelers a brief period of rest and relaxation. These facilities target individuals in need of a quick break during their journeys, providing a comfortable space for short-term respite.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story clearly highlights an innovation designed to improve the travel experience. It provides actionable insights for travelers and increases awareness about the facilities available at travel hubs.",
    "image": {
      "src": "https://live.staticflickr.com/7226/7228043754_55199398fc_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/030b1429-f719-40b3-b4a8-6b9a3bed26d4/thumb/",
      "alt": "New York med mamma",
      "credit": "Rockspindeln / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Xbox cloud games will soon follow you across Xbox, PC, and Windows handhelds",
    "domain": "technology",
    "location": "global",
    "published": "2025-07-21T11:28:41-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Microsoft is starting to test updates to the Xbox PC app and Xbox consoles that will allow cloud games to follow you across devices. A new play history section of the Xbox PC app and Xbox console home UI will display cloud games as part of the recently played titles list and this will roam [&#8230;]"
    ],
    "image_url": "",
    "titles": [
      "Xbox cloud games will soon follow you across Xbox, PC, and Windows handhelds"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.986,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.449,
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story reports on an innovation in the gaming industry, which is useful for readers interested in this topic. It also provides actionable insights for gamers who use these platforms and could potentially impact their decision-making.",
    "image": {
      "src": "https://live.staticflickr.com/151/435337341_5cee6be1df_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/7913801c-3c16-4fa7-9403-734477c84534/thumb/",
      "alt": "Xbox Live Service Maintenance",
      "credit": "Major Nelson / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Cleveland-Cliffs CEO Reports Tariff Benefits for U.S. Steel Demand",
    "domain": "business",
    "location": "global",
    "published": "Mon, 21 Jul 2025 15:18:00 GMT",
    "source": "MarketWatch",
    "sources": [
      "MarketWatch"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Cleveland-Cliffs CEO Lourenco Goncalves said the steelmaker is starting to see the positive impact of President Donald Trump’s tariffs on domestic manufacturing, as it expects increased demand from U.S. automakers."
    ],
    "image_url": "https://images.mktw.net/im-49697238",
    "titles": [
      "Steel company CEO calls for new Fed chief and praises Trump’s tariffs"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.982,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.445,
    "summary": "Cleveland-Cliffs CEO Lourenco Goncalves reported that the company is experiencing benefits from President Donald Trump's tariffs on steel, anticipating higher demand from U.S. automakers. This reflects a positive impact on domestic manufacturing as a result of the tariffs.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful information about the impact of tariffs on domestic manufacturing and steel demand. It reports on a positive outcome for Cleveland-Cliffs, but it doesn't explore the broader impacts of the tariffs or offer insights into potential solutions for the challenges facing the steel industry.",
    "image": {
      "src": "https://live.staticflickr.com/65535/52351122448_51d4012867_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/633e5355-136c-4ffa-84a5-b854c1752982/thumb/",
      "alt": "Model of the Cleveland Cliffs 'Cadillac' Great Lakes bulk freighter",
      "credit": "quinet / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Study Explores Origins of Hydrogen Peroxide on Europa",
    "domain": "science",
    "location": "global",
    "published": "Mon, 21 Jul 2025 11:26:37 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Southwest Research Institute (SwRI) scientists conducted lab experiments to address a mystery about the origins of frozen hydrogen peroxide (H2O2) on Jupiter's icy moon Europa. Their results, published in the July 2025 issue of Planetary Science Journal, may help explain puzzling observations made b"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/swri-experiments-may-e.jpg",
    "titles": [
      "Experiments may explain mysterious distribution of hydrogen peroxide on Europa"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.985,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.439,
    "summary": "Scientists at the Southwest Research Institute conducted laboratory experiments to explore the origins of frozen hydrogen peroxide on Europa, one of Jupiter's moons. Their findings, published in the July 2025 Planetary Science Journal, aim to clarify the cause of this chemical compound's presence on Europa, addressing long-standing questions about its formation. This research could shed light on the moon's chemical makeup and its potential for supporting life.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful insights into the scientific research being conducted on Europa's chemical makeup, which could potentially support life. It increases awareness about the scientific process and the importance of understanding celestial bodies. However, it does not report on any specific solutions or improvements.",
    "image": {
      "src": "https://live.staticflickr.com/8144/7653312938_e77f116d69_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/c3f2ab41-2760-4250-8193-636c43f9018b/thumb/",
      "alt": "Medical Study",
      "credit": "born1945 / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "U.S. Threatens Higher EU Tariffs if Trade Deals Miss August Deadline",
    "domain": "business",
    "location": "national",
    "published": "Mon, 21 Jul 2025 16:00:07 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "The U.S. is keeping up the pressure on the Aug. 1 deadline for higher tariffs for the EU."
    ],
    "image_url": "",
    "titles": [
      "U.S. plays hardball on tariffs deadline as EU battles for a deal"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.996,
      "consensus": 0.393,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.438,
    "summary": "The U.S. has maintained its stance on increasing tariffs for the European Union (EU) if certain trade agreements are not met by the August 1 deadline. This move is part of ongoing negotiations aimed at addressing trade imbalances between the U.S. and EU.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "The story informs about the ongoing negotiations between the U.S. and EU and the potential increase in tariffs. It provides some context about the trade imbalances, which can be useful for understanding the situation. However, it doesn't report on any solutions or progress.",
    "image": {
      "src": "https://live.staticflickr.com/65535/50277580568_01f38f90a0_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/6d331665-7a90-45c7-9e18-79e947016de3/thumb/",
      "alt": "U.S. Secretary of State Michael R. Pompeo meets PM Netanyahu",
      "credit": "U.S. Embassy Jerusalem / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Spacecraft Face Challenges Keeping Fuel Cold Despite Frigid Temperatures",
    "domain": "science",
    "location": "global",
    "published": "Mon, 21 Jul 2025 12:00:08 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "In the vacuum of space, where temperatures can plunge to -455°F, it might seem like keeping things cold would be easy. But the reality is more complex for preserving ultra-cold fluid propellants—or fuel—that can easily overheat from onboard systems, solar radiation, and spacecraft exhaust. The solut"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/nasa-tests-innovative.jpg",
    "titles": [
      "NASA tests innovative technique for super-cold fuel storage"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.996,
      "consensus": 0.393,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.431,
    "summary": "In space, despite the extremely cold temperatures of -455°F, maintaining ultra-cold fluid propellants is challenging due to heat from onboard systems, solar radiation, and spacecraft exhaust. This complexity requires innovative cooling solutions to prevent fuel overheating in the vacuum of space.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides a deeper understanding of the complexities and challenges in space missions, specifically in maintaining ultra-cold fluid propellants. It raises awareness about the need for innovative cooling solutions, even if it doesn't report on specific solutions or improvements. The knowledge can be useful for those involved in space technology and research.",
    "image": {
      "src": "https://live.staticflickr.com/3815/12493628335_fa0ab71d3e_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/c7a6d84e-355c-419e-bc06-acfff60b353a/thumb/",
      "alt": "Largest part of an Apollo Lunar Module spacecraft, brought back by Commander Gene Cernan, last man on the moon",
      "credit": "jurvetson / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Trump Administration Faces Uncertainty Over Tariff Increases",
    "domain": "business",
    "location": "global",
    "published": "Mon, 21 Jul 2025 15:27:00 GMT",
    "source": "MarketWatch",
    "sources": [
      "MarketWatch"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "With less than two weeks to go before country-specific tariffs could rise sharply, the Trump administration is drawing a lot of questions about what’s ahead."
    ],
    "image_url": "https://images.mktw.net/im-72183729",
    "titles": [
      "‘Quality’ deals are more crucial than Aug. 1 deadline: What the Trump team is saying about its tariff hikes"
    ],
    "score_components": {
      "magnitude": 0.099,
      "recency": 0.985,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.43,
    "summary": "The Trump administration is facing uncertainty as country-specific tariffs may increase soon. There are many questions about the future of these tariffs. The outcome remains unclear as the deadline approaches in less than two weeks.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about the potential increase in tariffs and the uncertainty surrounding it. However, it does not offer any deeper insights into the reasons, potential impacts, or possible solutions.",
    "image": {
      "src": "https://live.staticflickr.com/815/40567174204_f340b664a7_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/193cb26a-47b0-4ceb-90ff-c10ce8c0ee1c/thumb/",
      "alt": "trump",
      "credit": "Book Catalog / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Why tech billionaires want a ‘corporate dictatorship’",
    "domain": "technology",
    "location": "global",
    "published": "2025-07-21T10:00:00-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Hello, and welcome to Decoder! This is Jon Fortt, CNBC journalist, cohost of Closing Bell: Overtime, and creator of the Fortt Knox streaming series on LinkedIn. I’m guest-hosting for a couple more episodes of Decoder this summer while Nilay is out on parental leave.   Today, I’m talking with a very "
    ],
    "image_url": "",
    "titles": [
      "Why tech billionaires want a ‘corporate dictatorship’"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.956,
      "consensus": 0.393,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.43,
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story seems to provide useful insight into the motivations of tech billionaires, potentially increasing reader understanding of this group's actions and decisions. However, without knowing more about the content, it's unclear whether it offers solutions or highlights progress.",
    "image": {
      "src": "https://live.staticflickr.com/3508/3864076061_cc32cb6a10_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/319a92d9-ed4b-472c-b007-9460df317163/thumb/",
      "alt": "Why?",
      "credit": "kevin dooley / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Ph.D. Candidate Studies AI's Ability to Read Emotions",
    "domain": "science",
    "location": "global",
    "published": "Mon, 21 Jul 2025 12:00:02 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Just imagine new AI technology is able to read human emotions flawlessly. How would that affect us as humans? That is the question Ph.D. candidate Alexandra Prégent is exploring."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/ai-and-emotion-recogni.jpg",
    "titles": [
      "AI and emotion recognition: 'It could disrupt social interactions'"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.996,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.428,
    "summary": "Ph.D. candidate Alexandra Prégent is researching the potential impact of new AI technology that can accurately read human emotions. The study aims to understand how this advancement could affect human behavior and interactions. The outcome of the research is currently pending.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story offers awareness of ongoing research into AI's ability to read human emotions, which could potentially be useful. However, it lacks depth as the outcome of the research is still pending and does not provide actionable insights or solutions.",
    "image": {
      "src": "https://live.staticflickr.com/5820/23587990646_9f23cf677c_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/1c3610d1-c7fb-4d22-b139-8ad185949aa7/thumb/",
      "alt": "J.R. Nereus O. Acosta, PH.D.",
      "credit": "",
      "license": "cc0",
      "license_version": "1.0",
      "license_url": "https://creativecommons.org/publicdomain/zero/1.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Grok’s AI companions drove downloads, but its latest model is the one making money",
    "domain": "technology",
    "location": "global",
    "published": "Mon, 21 Jul 2025 15:20:29 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Grok's unfiltered AI companions may be making headlines for their unhinged and NSFW responses, but it's Grok 4 that's driven the app's revenue of late."
    ],
    "image_url": "",
    "titles": [
      "Grok’s AI companions drove downloads, but its latest model is the one making money"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.983,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.425,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about Grok's business model and its success in monetizing its latest AI model. However, it does not seem to offer insights into solutions, improvements, or attempts to solve problems.",
    "image": {
      "src": "https://live.staticflickr.com/1134/527303223_e642391221_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/3b7630c6-c1b1-4b40-b1f3-1565d222e8c4/thumb/",
      "alt": "Grokking Page load time w/ flickr photos",
      "credit": "kentbye / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Figma looks to raise nearly $1 billion as it kicks off its IPO roadshow",
    "domain": "technology",
    "location": "global",
    "published": "Mon, 21 Jul 2025 14:47:17 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Figma looks to offer more than 36 million shares with an expected price range between $25 and $28 a share."
    ],
    "image_url": "",
    "titles": [
      "Figma looks to raise nearly $1 billion as it kicks off its IPO roadshow"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.972,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.423,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story is constructive as it provides useful information about Figma's financial plans, which could inform investment decisions. However, it doesn't provide much insight into the broader context or implications, limiting its overall constructive value.",
    "image": {
      "src": "https://live.staticflickr.com/5216/5421058162_d8203e67c4.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/15477aab-1e24-485a-aba3-7ea32e535f22/thumb/",
      "alt": "figma Black Rock Strength",
      "credit": "animaster / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Dating App Sector Struggles: Falling Users, Rising Costs, Bumble Layoffs",
    "domain": "science",
    "location": "global",
    "published": "Mon, 21 Jul 2025 12:00:09 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "With plummeting subscriber numbers, rising costs and users who are sick of endless swiping, the dating app industry is in crisis. Recent layoffs at Bumble are raising questions about the future of dating apps and alternatives for people who want to find romance and connection offline instead."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2023/restaurant-date.jpg",
    "titles": [
      "Why in-person dating is making a comeback—and why Gen Z is struggling with it"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.997,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.421,
    "summary": "The dating app industry faces challenges, including declining subscriber numbers, increasing costs, and user dissatisfaction with the swiping mechanism. Recent layoffs at Bumble have intensified concerns about the sector's viability and sparked interest in finding romance and connection through offline alternatives.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the current challenges facing the dating app industry, such as declining subscriber numbers and increasing costs. While it does not offer solutions or progress, it does increase awareness about the sector's viability and trends, thus aiding in decision-making for those involved in the industry.",
    "image": {
      "src": "https://live.staticflickr.com/7179/6820053542_84383eefbc_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/df9fa05f-964e-45ae-95b1-fafec88aeba2/thumb/",
      "alt": "Dates",
      "credit": "Cara Harpole / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Companies Cut Profit Margins Amid Weak Demand, Competition",
    "domain": "business",
    "location": "national",
    "published": "Mon, 21 Jul 2025 15:25:26 +0000",
    "source": "Financial Post",
    "sources": [
      "Financial Post"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Weak demand and competition forcing companies to cut their margins rather than charge customers more"
    ],
    "image_url": "",
    "titles": [
      "Bank of Canada says inflation expectations easing as businesses hold off passing on tariff price hikes"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.985,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.419,
    "summary": "Companies are facing pressure from weak demand and competition, leading them to reduce their profit margins instead of raising prices for customers. This trend reflects a challenging business environment where companies are prioritizing maintaining market share over increasing prices.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful insight into the current business environment and the strategies companies are using to maintain market share. However, it doesn't offer solutions or highlight progress, and it doesn't deeply explore the causes or impacts of the trend.",
    "image": {
      "src": "https://live.staticflickr.com/4033/4584246148_0ed3e5bef0_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/827b853e-87b5-43e1-9783-16e506111b7c/thumb/",
      "alt": "World's Leading Companies",
      "credit": "GDS Infographics / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Students Debate AI Intelligence in Academic Courses",
    "domain": "science",
    "location": "global",
    "published": "Mon, 21 Jul 2025 11:40:01 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "In my writing and rhetoric courses, students have plenty of opinions on whether AI is intelligent: how well it can assess, analyze, evaluate and communicate information."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/plato.jpg",
    "titles": [
      "Can AI think—and should it? What it means to think, from Plato to ChatGPT"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.99,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.417,
    "summary": "In writing and rhetoric courses, students actively debate the intelligence of AI, focusing on its abilities to assess, analyze, evaluate, and communicate information. This discussion reflects varied perspectives on AI's capabilities within academic settings.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness about the debate on AI's intelligence in academic settings, but provides minimal depth or insight. It does not provide actionable insights or report on solutions, improvements, or innovations.",
    "image": {
      "src": "https://live.staticflickr.com/2790/4077667914_ca78542c10_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/49c4e7ba-a95c-4f7d-a53e-7c0e50434ad3/thumb/",
      "alt": "Student",
      "credit": "Anarkee / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Rare Genetic Disorder AHC Affects Infants, No Cure Available",
    "domain": "science",
    "location": "global",
    "published": "Mon, 21 Jul 2025 11:00:02 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "By the time they are a few months old, infants born with alternating hemiplegia of childhood (AHC) begin experiencing terrifying episodes of paralysis and seizures, and will soon show developmental delays and intellectual disability. There is no cure or effective treatment for this rare genetic dise"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2024/gene-editing-2.jpg",
    "titles": [
      "Prime editing repairs five genetic mutations to treat rare brain disorder in mice"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.976,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.414,
    "summary": "Alternating hemiplegia of childhood (AHC) is a rare genetic disorder that starts affecting infants a few months after birth, causing episodes of paralysis and seizures. This condition leads to developmental delays and intellectual disability. As of now, there is no cure or effective treatment available for AHC.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "While the story raises awareness about a rare genetic disorder, it does not provide any actionable insights or deeper understanding beyond the basic information about the disease. It also does not report on any attempts to find a cure or improve the situation.",
    "image": {
      "src": "https://live.staticflickr.com/5497/9878476996_5d20deebdc_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/ceee003a-3d8d-4468-a4ea-685cc098d340/thumb/",
      "alt": "Only one on roads! 1988 Ford Granada 2.5 DL diesel (extremely rare)",
      "credit": "charles cars / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "2024 US Investment in Combustion Engines Sparks Debate",
    "domain": "business",
    "location": "global",
    "published": "Mon, 21 Jul 2025 10:15:00 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "last year, 2024, was a record year for us in investing in (h2) combustion engines. Some people believe that this is already technology of yesterday, sunset technology"
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/687d9b203603e3c977daf10a/0x0.jpg?width=960",
    "titles": [
      "The Combustion Engine Strikes Back: Volvo Reimagines Hydrogen"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.961,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.404,
    "summary": "In 2024, the US saw a surge in investments in combustion engines, despite some viewing it as outdated technology. Opinions vary on its relevance, with some considering it outdated. The outcome is unclear, as the future of combustion engines remains a topic of debate in the face of advancing technologies.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story raises awareness about the debate surrounding the relevance of combustion engines, but it doesn't provide a deep understanding of the issue or offer actionable insights. It also doesn't report on any solutions or progress, and the impacts of the trend aren't clearly explained.",
    "image": {
      "src": "https://upload.wikimedia.org/wikipedia/commons/4/47/Senate_of_Pakistan%2C_2024.png",
      "thumbnail": "https://api.openverse.org/v1/images/9e5c02ec-1a20-4158-aba0-d398d64e2d55/thumb/",
      "alt": "Senate of Pakistan, 2024",
      "credit": "",
      "license": "cc0",
      "license_version": "1.0",
      "license_url": "https://creativecommons.org/publicdomain/zero/1.0/deed.en/",
      "provider": "wikimedia",
      "source": "Openverse"
    }
  },
  {
    "title": "This ‘violently racist’ hacker claims to be the source of The New York Times’ Mamdani scoop",
    "domain": "technology",
    "location": "global",
    "published": "2025-07-21T10:25:45-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "The ultimate source for The New York Times' story about Zohran Mamdani's college application is an open secret. It's an anime-loving neo-Nazi whose hobbies include furry drawings, posting fan art of a video game character, and hacking universities. On X, the alleged hacker is followed by New York Ti"
    ],
    "image_url": "",
    "titles": [
      "This ‘violently racist’ hacker claims to be the source of The New York Times’ Mamdani scoop"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.964,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.392,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story raises awareness about a potential source of a major news story, but it doesn't provide much depth or insight beyond that. It also doesn't provide actionable insights or report on solutions, limiting its constructive value.",
    "image": {
      "src": "https://live.staticflickr.com/5163/5277106566_17b6582bdb_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/4f9282a1-0442-4204-a7fd-47d4b2de41c3/thumb/",
      "alt": "'Aequitas' ('justice' in Latin), hand tattoo, guns, Murphy MacManus (played by actor Norman Reedus), Boston; The Boondock Saints, film: calm, violent, religious vigilante idealism",
      "credit": "Wonderlane / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  }
]