[
  {
    "title": "Trump Signs Proclamation Hiking H-1B Visa Fees to $100,000",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 20 Sep 2025 06:42:15 GMT",
    "source": "BBC",
    "sources": [
      "Financial Times",
      "Global News",
      "Al Jazeera",
      "Axios",
      "Deutsche Welle",
      "BBC"
    ],
    "domains": [
      "www.ft.com",
      "globalnews.ca",
      "www.bbc.com",
      "news.google.com",
      "www.dw.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "\"Train Americans,\" the US commerce secretary told big companies, some of which have relied on foreign high-skilled workers for years.",
      "Fee paid by companies set to transform high-skill work visa system, upon which technology sector relies heavily.",
      "The H-1B visa program is used extensively by tech companies to attract skilled foreign workers. India and China account for the vast majority of workers under the program.",
      "<a href=\"https://news.google.com/rss/articles/CBMilAFBVV95cUxQTUdUbC1GSDA0ZlYtM1VQRkQzLUsxSW1PWnBpQ3k0WlU2Q1FzUWJ2alhSU1ZMU09zSF9yOVJ3Qmh3enBFRTVRODQ3RDFldUozVjBnUXBETHY5OXRjWTRDeWxYNl94UFFVQXpfS1M0d0JKYTVNcklGMDdVZUJkZ2RqSzFBNVZrOGFqay00eVNkcks1d2F3?oc=5\" target=\"_blank\">Trump seeks $100,000 visa f",
      "Shares in IT consulting groups drop on news of changes to scheme popular with Silicon Valley",
      "H-1B visas are meant to bring in foreigners for high-skilled jobs that tech companies find difficult to fill with qualified U.S. citizens and permanent residents."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/fa5f/live/38c3b210-95af-11f0-9cf6-cbf3e73ce2b9.jpg",
    "titles": [
      "Trump adds $100,000 fee for skilled worker visa applicants",
      "Trump imposes $100,000 fee per year for H-1B visas",
      "Trump announces $100,000 fee for H-1B visa applications",
      "Trump seeks $100,000 visa fee for temporary skilled workers - Axios",
      "Trump to add $100,000 application fee to H-1B foreign worker visas",
      "Trump sets $100K fee for skilled foreign worker visas, $1M for ‘gold card’"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.948,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.84,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "US President Donald Trump signed a proclamation requiring companies to pay $100,000 for each H-1B visa application, significantly increasing costs from the current total of $995. This move is set to transform the high-skill work visa system, heavily relied upon by the technology sector.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "NATO Intercepts Russian Jets in Estonian Airspace; EU Condemns Act",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 20 Sep 2025 05:57:11 GMT",
    "source": "BBC",
    "sources": [
      "New York Times",
      "ABC News",
      "The Guardian",
      "Washington Post",
      "Deutsche Welle",
      "BBC"
    ],
    "domains": [
      "abcnews.go.com",
      "www.washingtonpost.com",
      "www.bbc.com",
      "www.nytimes.com",
      "www.theguardian.com",
      "www.dw.com"
    ],
    "snippets": [
      "Russia denies jets entered Estonian airspace in the same month as its drones violated the airspace of two other Nato members.",
      "Estonia requested a consultation of NATO powers after the Baltic nation said three Russian fighter jets violated its airspace in a \"brazen\" 12-minute incursion. Estonia's president said air defense \"must be a priority.\"",
      "Three Russian fighter jets are accused of violating Estonia's airspace, flying for about 12 minutes over NATO territory. NATO scrambled jets to intercept.",
      "<p>Russia denies what EU calls ‘dangerous provocation’ after Italian air force heads off three MiG-31s over Gulf of Finland</p><p>Nato has intercepted three Russian MiG-31 fighter jets that violated Estonia’s airspace over the Baltic Sea in a 12-minute incursion, calling it proof of Moscow’s “reckle",
      "The Russian breach of E.U. air space is the third in just a matter of days after drone incursions into Poland and Romania.",
      "Estonia’s foreign minister described the flights, which lasted for an unusually long 12 minutes, as an “unprecedentedly brazen” intrusion."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/c13f/live/c28ed850-95c6-11f0-9cf6-cbf3e73ce2b9.jpg",
    "titles": [
      "Estonia seeks Nato consultation after Russian jets violate airspace",
      "Estonia seeks NATO consultations after Russia jets incident",
      "WATCH:  3 Russian fighter jets accused of violating Estonia's airspace",
      "Nato intercepts Russian fighter jets on ‘reckless’ violation of Estonian airspace",
      "Russian fighter jets breach Estonian airspace",
      "Russian Fighter Jets Enter Airspace of Estonia, a NATO Member"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.933,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.837,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "NATO intercepted three Russian MiG-31 fighter jets that entered Estonian airspace for 12 minutes, marking a significant breach. Estonia condemned the act as an \"unprecedentedly brazen\" intrusion and summoned a Russian diplomat in response. NATO highlighted its quick response as evidence of its capability to counter such actions. Russia, however, denied the allegations, which the EU labeled a \"dangerous provocation.\" This incident is part of a series of recent airspace violations by Russia in the EU, including drone incursions into Poland and Romania.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Announces Preliminary Deal with China to Keep TikTok in US",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-09-19T21:21:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "New York Times",
      "Financial Times",
      "CNBC",
      "The Guardian",
      "Deutsche Welle"
    ],
    "domains": [
      "www.ft.com",
      "www.nytimes.com",
      "www.theguardian.com",
      "www.cnbc.com",
      "www.dw.com"
    ],
    "snippets": [
      "US President Donald Trump said Chinese President Xi Jinping had approved a framework agreement to keep TikTok operating in the US after a phone call. But specifics are still unclear.",
      "President Donald Trump and Chinese leader Xi Jinping held a much-anticipated call aimed at finalizing a deal to keep TikTok from going dark in the U.S.",
      "American leader says Chinese counterpart approved sale of video app’s American operations",
      "<p>Trump’s statement suggests preliminary agreement between leaders in the first direct contact between them since June</p><p>Donald Trump said on Friday that he and Xi Jinping had agreed to approve a deal over TikTok.</p><p>“He approved the TikTok deal,” Trump said about Xi to reporters in the Oval",
      "President Trump said he would meet with President Xi Jinping next month in South Korea. Mr. Xi said he welcomes a TikTok deal that would benefit both sides."
    ],
    "image_url": "",
    "titles": [
      "Trump says Xi approved a deal to keep TikTok operating in US",
      "Trump, Xi make progress on TikTok deal, but more work remains, White House says",
      "Trump and Xi to meet in South Korea as US president hails TikTok deal",
      "Trump says Xi Jinping has agreed to approve TikTok deal, but details unclear",
      "Trump Hails Progress on TikTok Deal After Call With Xi"
    ],
    "score_components": {
      "magnitude": 0.984,
      "recency": 0.797,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.803,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "US President Donald Trump announced that after a phone call with Chinese President Xi Jinping, a preliminary agreement has been reached to keep TikTok operating in the US. This marks the first direct contact between the two leaders since June, moving towards finalizing a deal. However, the specifics of the agreement remain unclear.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Week 3 Fantasy Football: Start/Sit Advice, Including Jared Goff Highlight",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sat, 20 Sep 2025 00:42:32 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "Sports Illustrated",
      "ESPN",
      "Bleacher Report"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com",
      "news.google.com"
    ],
    "snippets": [
      "Do injuries have you seeking a late-week pickup? Need a defense to stream? These options have favorable setups.",
      "Matchup ratings for every player in Week 3 for Non-PPR leagues",
      "Matchup ratings for every player in Week 3 for PPR leagues",
      "Dig into the players who might be tough start/sit calls in your lineup based on game film notes, stats, more",
      "<a href=\"https://news.google.com/rss/articles/CBMimAFBVV95cUxPcFNzZ05nVDNEMVprNlVmU3Nkd1VMLUI4STdWX0xRVXBVVTZmeFk0UEFCTnR0YVA2TmFxSHlMT3pyS2pkNjl6VlZLek14UmMzY2FzaXVuUllXOHktR25mNy1QV3d0SHlWcmFzS2lCdHloT3BZbzVJT0FuMjFwR0U0ZHlwVjNxcG5NTWpyZzFxNjlWN0pjeWN0cg?oc=5\" target=\"_blank\">NFL Week 3 Fantasy Fo",
      "Under-the-radar players who could give your lineup an edge in Week 3",
      "<a href=\"https://news.google.com/rss/articles/CBMinAFBVV95cUxOaFJtUmN3ekswSW5jVzdxYURpeldRZUdFT21rUV9raXhlc1l5UGhxbXhydUtmU2FfbjRLclktczRSa2JueEJfZGlOVWotb182RFBqTFNwVFF6SklwekNtZEFzZldpQ0RRRFg0WUZHWGExWC12QS1JNG5fanNMdXc3VWV0OHBieTVhdEtyY1hqRmh5S3p4YmhVenlsd18?oc=5\" target=\"_blank\">Fab's Five Fanta"
    ],
    "image_url": "",
    "titles": [
      "🏈 Fantasy football: Week 3 last-minute pickups",
      "Fantasy Football 2025 Week 3 Non-PPR Cheat Sheet: Player ratings to guide your toughest lineup calls",
      "Fantasy Football 2025 Week 3 PPR Cheat Sheet: Player ratings to guide your toughest lineup calls",
      "Fantasy Football Week 3 Lineup Decisions: Who to start, who to sit, must-start plays, flex plays and more",
      "NFL Week 3 Fantasy Football 2025 Start 'Em, Sit 'Em - Bleacher Report",
      "Fantasy Football Week 3 Sleepers: Marcus Mariota steps in for Jayden Daniels and emerges as a sleeper QB",
      "Fab's Five Fantasy Football Defenses Streamers For Week 3 - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.929,
      "consensus": 0.888,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.795,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "This week's fantasy football advice focuses on players with challenging start/sit decisions based on game film, stats, and more. Specifically, it's suggested that quarterback Jared Goff is expected to perform well in week 3. For more detailed insights, links to articles on running backs and tight ends to start or sit are provided.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "British Couple Released from Detention in Afghanistan After 8 Months",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 20 Sep 2025 06:02:19 GMT",
    "source": "BBC",
    "sources": [
      "New York Times",
      "Deutsche Welle",
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.nytimes.com",
      "www.dw.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Jonathan Reynolds tells the BBC he is \"overwhelmed\" by release after nearly eight months in prison.",
      "Relatives of Peter Reynolds, 80, and his wife Barbara, 76, had made repeated pleas about their deteriorating health since their arrest in February.",
      "Peter and Barbara Reynolds, 80 and 76, ran an education and training company in the country for years, and chose to remain after the Taliban took over in 2021.",
      "<p>Peter and Barbie Reynolds were arrested and held without charge for eight months, raising fears for their health</p><p>A British couple have been freed from months of detention in Afghanistan, to the “immense joy” of their family.</p><p>The Taliban released Barbie Reynolds, 76, and her husband, P"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/8658/live/2f0ef280-95ea-11f0-90f2-5f87cb020b24.jpg",
    "titles": [
      "Son of British couple held by Taliban 'ecstatic' as they return to UK",
      "Taliban release British couple after seven-month ordeal",
      "Taliban Releases British Couple, Peter and Barbie Reynolds, Detained for Months in Afghanistan",
      "Family tell of ‘immense joy’ at release of British couple detained in Afghanistan"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.935,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.776,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Peter and Barbara Reynolds, a British couple aged 80 and 76, were released from detention in Afghanistan after eight months. Their arrest in February had caused concern over their health. The UK acknowledged Qatar's role in negotiating their release. The couple, who ran an education and training company in Afghanistan and stayed after the Taliban's 2021 takeover, were freed to their family's immense joy.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "US Strikes Target Boats in Caribbean for Drug Trafficking, Sparking Controversy",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 20 Sep 2025 01:30:13 GMT",
    "source": "BBC",
    "sources": [
      "Financial Times",
      "Washington Post",
      "ABC News",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "abcnews.go.com",
      "www.washingtonpost.com",
      "www.ft.com"
    ],
    "snippets": [
      "Venezuela has condemned a series of strikes by US forces in the Caribbean targeting alleged drug traffickers.",
      "President Donald Trump said Friday he ordered another strike against a boat in international waters that he said was \"trafficking illicit narcotics.\"",
      "Earlier attacks targeted alleged Venezuelan cartels that Trump claims were trafficking narcotics",
      "The strike marks the third such attack on boats alleged to be carrying illicit drugs this month. Experts have questioned the legality of the strikes."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/7fb0/live/8519c9b0-95be-11f0-91c6-1b7e88174a1b.jpg",
    "titles": [
      "US forces strike third alleged drug vessel killing three, Trump says",
      "3 killed in 3rd US strike on alleged drug boat in international waters, Trump says",
      "US military conducts third fatal strike on alleged drug smuggling vessel",
      "U.S. kills 3 in another strike on ‘narcoterrorists’ vessel, Trump says"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.851,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.766,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The US conducted a series of strikes in the Caribbean against boats accused of drug trafficking, targeting alleged Venezuelan cartels. President Trump confirmed ordering a strike on a boat in international waters for carrying narcotics, marking the third attack this month. Venezuela condemned these actions. Legal experts have raised questions about the strikes' legality.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Robert Griffin III Backs Commanders' Decision to Bench Daniels for Health",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sat, 20 Sep 2025 01:56:14 +0000",
    "source": "CBS Sports",
    "sources": [
      "Sportsnet",
      "Sports Illustrated",
      "Yahoo Sports",
      "CBS Sports"
    ],
    "domains": [
      "www.sportsnet.ca",
      "commanderswire.usatoday.com",
      "www.cbssports.com",
      "news.google.com"
    ],
    "snippets": [
      "Griffin III, who battled his own injury problems while playing for Washington, was happy to see the decision taken out of the players' hands",
      "Robert Griffin III on Commanders' decision to sit Jayden Daniels in Week 3.",
      "<a href=\"https://news.google.com/rss/articles/CBMicEFVX3lxTE5NUnZfekFjcU5lRTh6eW5PYlp2M2ZvWG1UMl9ndy1Ia3BSLXlTRVpvQnpUWE1kNHNXYzNNckRvbm91cDhzQjFNWFl3SkVWM29mSVNNS00wcjBSOUhGRm14ZzRHOHY5LVQ2Q1ZoT0RQMk4?oc=5\" target=\"_blank\">Commanders Make Starting Quarterback Decision Amid Jayden Daniels Injury</a>",
      "<p>Washington Commanders quarterback Jayden Daniels will miss Sunday&#8217;s game against the Las Vegas Raiders because of an injured left knee.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/20/069aaf89-cc21-4cf1-aec3-9c5f95531eee/robert-griffin-iii-washington.jpg",
    "titles": [
      "Robert Griffin III applauds the Commanders' handling of injury to star QB Jayden Daniels: 'Bravo'",
      "Ex-Washington quarterback Robert Griffin III weighs in on Jayden Daniels' injury",
      "Commanders Make Starting Quarterback Decision Amid Jayden Daniels Injury - Sports Illustrated",
      "Commanders’ Jayden Daniels ruled out vs. Raiders"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.877,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.765,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Robert Griffin III expressed approval of the Washington Commanders' decision to bench quarterback Jayden Daniels for the upcoming game against the Las Vegas Raiders due to a knee injury. This move prioritizes player health by not risking further injury.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "49ers to Start Mac Jones as QB Against Cardinals, Purdy Out Again",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sat, 20 Sep 2025 00:42:32 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "Sports Illustrated",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com",
      "news.google.com"
    ],
    "snippets": [
      "Barring a significant last-minute change, the San Francisco 49ers will start Mac Jones at quarterback for a second consecutive week Sunday against the Arizona Cardinals.",
      "Purdy has made progress but likely won't be back on the field Sunday",
      "<a href=\"https://news.google.com/rss/articles/CBMiZkFVX3lxTE5ZRmNEWDZFYm9Sc2RCRG5SWDlWLVFqeG9vUG1pbHdoNTVvLWVUNkJES242WUI1dXZuanZWSGlPQVpUZUFWNHdKcUxxaHpLdUNHN25FTFFEdjE1YXhhY2x3aDdYQ3dWdw?oc=5\" target=\"_blank\">Brock Purdy Shares Hopeful Injury Update Ahead of 49ers' Week 3 Game vs. Cardinals</a>&nb"
    ],
    "image_url": "",
    "titles": [
      "49ers to start Jones at QB in place of ailing Purdy",
      "Brock Purdy injury update: 49ers QB 'highly unlikely' to play vs. Cardinals, Mac Jones set to start again",
      "Brock Purdy Shares Hopeful Injury Update Ahead of 49ers' Week 3 Game vs. Cardinals - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.929,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.754,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The San Francisco 49ers will start Mac Jones as quarterback for the second consecutive week in their upcoming game against the Arizona Cardinals. Despite showing progress, Brock Purdy is not expected to play in Sunday's game.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Federal Judge Dismisses Trump's Defamation Suit Against NYT, Allows Revision",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Fri, 19 Sep 2025 18:09:50 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Deutsche Welle",
      "Axios",
      "Al Jazeera",
      "Business Insider"
    ],
    "domains": [
      "www.businessinsider.com",
      "www.dw.com",
      "www.aljazeera.com",
      "news.google.com"
    ],
    "snippets": [
      "Complaint not a &#039;megaphone for PR’, says Judge Merryday, who deemed long-winded content &#039;tedious and burdensome&#039;.",
      "A judge in Florida said the US president's defamation complaint against the newspaper was too long and full of personal invective. Trump has 28 days to file a new complaint.",
      "<a href=\"https://news.google.com/rss/articles/CBMie0FVX3lxTE43NWRlLXFTU1hON0Z5T21JVEF6OVpJVlRwUy1yRnJFMlZVMWxQYkd6RGZqS3B5bDlVY2UtR3lyRXZuN1Q5c0piV1JGSmIxWUxYX3djTVBjaUlVdHN5RXl4MGVXQ2lpYzFOVFRsalE0d0ZZLVhuZTg3NUhZSQ?oc=5\" target=\"_blank\">Trump told to refile New York Times lawsuit judge dismissed a",
      "Trump's defamation lawsuit against the New York Times was \"tedious\" and could be 45 pages shorter, a federal judge ruled."
    ],
    "image_url": "",
    "titles": [
      "Federal judge dismisses Trump’s $15bn defamation lawsuit against NYT",
      "US judge tosses Trump's $15 billion New York Times lawsuit",
      "Trump told to refile New York Times lawsuit judge dismissed as too wordy - Axios",
      "Judge tosses Trump's $15 billion lawsuit against The New York Times, saying it's too long"
    ],
    "score_components": {
      "magnitude": 0.932,
      "recency": 0.745,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.752,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A US federal judge ruled that Donald Trump's defamation lawsuit against the New York Times was excessively long and filled with unnecessary personal attacks. The judge dismissed the complaint but gave Trump 28 days to submit a revised version that addresses these issues.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "France, UK Among 11 Nations to Recognize Palestinian Statehood at UN Assembly",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 20 Sep 2025 07:46:16 GMT",
    "source": "BBC",
    "sources": [
      "Deutsche Welle",
      "Al Jazeera",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.dw.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "A host of countries, including France and the UK, are expected to do the same when world leaders gather at the UN General Assembly next week.",
      "Nine other countries, including France and the UK, also plan to recognise Palestinian statehood next week.",
      "Despite widespread international recognition of Palestine as a state, some Western nations say they will only endorse Palestinian statehood as part of a comprehensive peace agreement with Israel. But the tide's changing."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/a396/live/a223bb00-95e7-11f0-9cf6-cbf3e73ce2b9.png",
    "titles": [
      "Portugal confirms it will recognise Palestinian state",
      "Portugal to recognise a Palestinian state",
      "Which countries recognize Palestinian statehood?"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.969,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.741,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "At the upcoming UN General Assembly, France, the UK, and nine other countries plan to recognize Palestinian statehood. This move comes despite some Western nations' stance of only endorsing Palestinian statehood within a comprehensive peace agreement with Israel, indicating a shift in international policy towards Palestine.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Phoenix Mercury Beats NY Liberty, Advances to WNBA Second Round",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sat, 20 Sep 2025 05:54:56 +0000",
    "source": "CBS Sports",
    "sources": [
      "Forbes",
      "CBS Sports",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.forbes.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Phoenix overcame a heroic effort from New York's Breanna Stewart to advance to the semifinals",
      "Phoenix Mercury edged the New York Liberty 79-73 in a physical Game 3, surviving late runs to advance in the WNBA playoffs. Here’s how they pulled it off.",
      "<p>Alyssa Thomas had 20 points, 11 rebounds and 11 assists in her fifth career playoff triple-double, and the Phoenix Mercury advanced to the second round of the WNBA playoffs by eliminating the defending champion New York Liberty 79-73 in Game 3 on Friday night.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/20/5ae0ea7f-e2d9-4d48-b158-51b9709ecba3/091925-alyssathomas.jpg",
    "titles": [
      "Alyssa Thomas makes WNBA playoff history as Mercury eliminate defending champion Liberty",
      "Mercury Eliminate Defending Champs Liberty With Gritty Game 3 Win",
      "Thomas has triple-double as Mercury eliminate defending champion Liberty"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.952,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.737,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Phoenix Mercury advanced to the second round of the WNBA playoffs by defeating the New York Liberty 79-73 in Game 3, eliminating the defending champions. Alyssa Thomas led Phoenix with a triple-double, scoring 20 points, grabbing 11 rebounds, and distributing 11 assists, marking her fifth career playoff triple-double. This victory came despite a strong effort from New York's Breanna Stewart.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Sen. Cruz Compares FCC Chair's Comments on Kimmel to Mafia Threat",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Sat, 20 Sep 2025 02:47:33 GMT",
    "source": "Axios",
    "sources": [
      "The Guardian",
      "CNBC",
      "Axios"
    ],
    "domains": [
      "www.theguardian.com",
      "www.cnbc.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMie0FVX3lxTE5CMEVPcFd5TjZpeTJuM2NKc1lja29rZnU1Tl9qTVA4aVhWYlF0TzFacWdKWVc5bGdCV05Qcjc2M2dteVBOZ0lKNV9JazhXdzZzXzNuQlJKdHV4cmdUWW04eEVtYmViNmZVM3BqUi1UUFpTNldORUE2VFF0VQ?oc=5\" target=\"_blank\">Ted Cruz: MAGA \"will regret\" what it did to Jimmy Kimmel</a>&",
      "Republican Sen. Ted Cruz of Texas sharply criticized Federal Communications Commission Chairman Brendan Carr over his comments related to Jimmy Kimmel.",
      "<p>Texas senator says Brendan Carr’s threats to revoke licenses amid Jimmy Kimmel suspension ‘right out of Goodfellas’ </p><p>Senator Ted Cruz, a Texas Republican, compared Federal Communications Commission chair Brendan Carr’s threats to revoke the broadcast licenses of ABC stations over late-night"
    ],
    "image_url": "",
    "titles": [
      "Ted Cruz: MAGA \"will regret\" what it did to Jimmy Kimmel - Axios",
      "Ted Cruz compares FCC Chair Carr to Mafia boss in Jimmy Kimmel warnings",
      "Ted Cruz compares threats to ABC by FCC chair to those of mob boss"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.874,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.719,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Republican Senator Ted Cruz criticized FCC Chairman Brendan Carr for comments about Jimmy Kimmel, likening them to a threat reminiscent of a mafia movie. Cruz expressed concern over the implications of Carr's remarks, highlighting a serious disagreement within political circles.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Microsoft Raises Xbox Prices in US Due to Tariffs",
    "domain": "technology",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Fri, 19 Sep 2025 19:37:08 GMT",
    "source": "CNBC",
    "sources": [
      "Ars Technica",
      "The Verge",
      "CNBC"
    ],
    "domains": [
      "arstechnica.com",
      "www.theverge.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "Many consumer companies have been warning for months that higher prices are on the way following President Trump's tariffs.",
      "Microsoft is raising the prices of its Xbox Series S / X consoles in the US next month. The Xbox Series X will be priced at $649.99 in the US starting October 3rd, up from its existing $599.99 price. The Xbox Series S will move to $399.99, up from $379.99. Microsoft blames the price hikes [&#8230;]",
      "Asking prices for some models are up 33 percent in less than a year."
    ],
    "image_url": "",
    "titles": [
      "Microsoft raises Xbox prices in U.S. due to economic environment",
      "Microsoft is raising prices on Xbox consoles in the US again",
      "Microsoft raises Xbox console prices for the second time this year"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.753,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.701,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Following President Trump's tariffs, consumer companies warned of rising prices. Microsoft is increasing Xbox Series S / X prices in the US starting October 3rd, citing these tariffs. The Xbox Series X will go from $599.99 to $649.99, and the Series S from $379.99 to $399.99. This is part of a broader trend, with some product prices rising by up to 33% in less than a year.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Blue Jays' Berrios Moved to Bullpen After 20-1 Loss to Royals",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sat, 20 Sep 2025 04:48:32 +0000",
    "source": "Global News",
    "sources": [
      "Sportsnet",
      "Global News"
    ],
    "domains": [
      "www.sportsnet.ca",
      "globalnews.ca"
    ],
    "snippets": [
      "Toronto Blue Jays right-hander Jose Berrios is moving to the bullpen, manager John Schneider told reporters following Friday's 20-1 loss to the Kansas City Royals.",
      "<p>Jose Berrios’ appearance in the Blue Jays’ bullpen on Friday wasn’t merely circumstantial, as John Schneider said the righty will be a relief option through the weekend and “going forward.”</p>"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/bc489d5c8aea80fa26a4b42644ca8beefc90f3d2691d2df0d6c00f3fc162e83a.jpg?quality=65&strip=all",
    "titles": [
      "Blue Jays to move pitcher Jose Berrios to bullpen",
      "Blue Jays moving Jose Berrios to bullpen going forward"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.931,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.691,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Following a 20-1 loss to the Kansas City Royals, Toronto Blue Jays manager John Schneider announced that right-hander Jose Berrios will be transitioning to the bullpen. Berrios, previously a starter, will serve as a relief option throughout the weekend and into the foreseeable future.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Canada Ends New Zealand's Reign with World Cup Semifinal Win",
    "domain": "sports",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Fri, 19 Sep 2025 20:11:33 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "Sky Sports",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.skysports.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "<ul><li><p>Semi-final: New Zealand 19-34 Canada</p></li><li><p>Six-times champions out after consecutive title wins</p></li></ul><p>Canada always had a good chance of beating New Zealand in their Rugby World Cup semi-final but no one anticipated the manner of the win as they dominated the defending ",
      "Canada upset the odds to beat New Zealand 34-19 and secure their place in the Women's Rugby World Cup final.",
      "<p>The Women&#8217;s Rugby World Cup will have a new queen. New Zealand&#8217;s eight-year reign as world champion was terminated by Canada in a stunning 34-19 semifinal victory in Bristol, England, on Friday.</p>"
    ],
    "image_url": "https://i.guim.co.uk/img/media/f0e6bff4f703faa74bf0d6ab7174d7678e226b14/462_0_5000_4000/master/5000.jpg?width=140&quality=85&auto=format&fit=max&s=4a967f72e786850b0c0fe116d59120a3",
    "titles": [
      "Clinical Canada end Black Ferns’ reign and book place in Rugby World Cup final",
      "Canada stun New Zealand to reach Women's Rugby World Cup final",
      "Canada stuns New Zealand, advances to first women’s Rugby World Cup final since 2014"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.762,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.689,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Canada defeated New Zealand 34-19 in the Women's Rugby World Cup semifinal, ending New Zealand's eight-year championship reign. This victory in Bristol, England, secures Canada's place in the Twickenham final, marking New Zealand's first loss in the tournament in 11 years.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "2025 WNBA Semifinals Begin Sunday, New Champion Guaranteed",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sat, 20 Sep 2025 02:16:00 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "The 2025 WNBA postseason is underway, with the semifinals set to begin Sunday.",
      "<p>The WNBA semifinals are set and a new champion is guaranteed after all four remaining teams were challenged in the opening round</p>"
    ],
    "image_url": "",
    "titles": [
      "WNBA playoff schedule: Semifinals set with Mercury-Lynx, Fever-Aces",
      "WNBA semifinals set: Lynx, Aces, Mercury and Fever reach second round"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.959,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.682,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The 2025 WNBA postseason has progressed to the semifinals, starting Sunday. With the completion of the opening round, all four remaining teams have faced significant challenges, ensuring that a new champion will be crowned this season.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: progress",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Lesnar Defeats Graves, Sets Stage for Wrestlepalooza 2025 Main Event",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Fri, 19 Sep 2025 23:54:22 EST",
    "source": "ESPN",
    "sources": [
      "Forbes",
      "ESPN"
    ],
    "domains": [
      "www.forbes.com",
      "www.espn.com"
    ],
    "snippets": [
      "SmackDown's go-home show sets up a perfect main event for Saturday's Wrestlepalooza in Indianapolis.",
      "WWE SmackDown results, winners and grades on the go-home show for WWE Wrestlepalooza 2025 as Brock Lesnar destroys Corey Graves."
    ],
    "image_url": "",
    "titles": [
      "WWE SmackDown takeaways: Contracts for Wrestlepalooza signed",
      "WWE SmackDown Results, Winners And Grades Ahead Of Wrestlepalooza 2025"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.913,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.67,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "On the final SmackDown episode before WWE Wrestlepalooza 2025 in Indianapolis, Brock Lesnar defeated Corey Graves, setting up a highly anticipated main event for the upcoming Saturday's Wrestlepalooza.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Global Ocean Protection Treaty to Take Effect in 2026",
    "domain": "science",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sat, 20 Sep 2025 07:28:35 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Phys.org",
      "Al Jazeera"
    ],
    "domains": [
      "phys.org",
      "www.aljazeera.com"
    ],
    "snippets": [
      "World&#039;s first-ever pact aims to fight threats like climate change, over-fishing and deep-sea mining.",
      "A multinational treaty to protect vast expanses of the world's oceans is finally set to become law in January 2026, with environmentalists hailing its enactment Friday as crucial to safeguarding the marine ecosystems."
    ],
    "image_url": "",
    "titles": [
      "First treaty to protect marine life in high seas to take effect in January",
      "International treaty protecting world's oceans to take effect"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.984,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.652,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A historic multinational treaty designed to combat climate change, over-fishing, and deep-sea mining, aimed at protecting the world's oceans, will officially become law in January 2026. Environmentalists have praised its enactment as a vital step in preserving marine ecosystems.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Reforms Legal Migration, Prioritizes Wealthy Workers",
    "domain": "business",
    "source_domain": "www.ft.com",
    "location": "global",
    "published": "Sat, 20 Sep 2025 04:00:09 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times",
      "Financial Post"
    ],
    "domains": [
      "www.ft.com",
      "financialpost.com"
    ],
    "snippets": [
      "Ageing societies seeking to preserve living standards will continue to rely on new arrivals — but governments can be clearer about the trade-offs",
      "President Donald Trump took his most extensive step yet toward overhauling the US legal migration system, with a pair of proclamations that explicitly favor the wealthiest of the world’s prospective expat workers."
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F76018def-6cdb-46ba-8d23-f987b6595864.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "The truth about immigration",
      "Trump Shapes Gilded Age of US Immigration With $100,000 H-1B Fee"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.896,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.641,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "President Donald Trump has significantly moved towards reforming the US legal migration system with two proclamations that prioritize wealthy expat workers. This approach underscores the ongoing reliance of ageing societies on new arrivals to maintain living standards, highlighting the need for governments to be transparent about the implications of such policies.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "FCC Chair's Actions Spark Free Speech Concerns Among Late-Night Hosts",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Fri, 19 Sep 2025 13:27:58 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "Business Insider"
    ],
    "domains": [
      "www.businessinsider.com",
      "www.npr.org"
    ],
    "snippets": [
      "In the eight months since becoming chair of the Federal Communications Commission, Brendan Carr has waged war against the free speech of those who have reported on, criticized, or satirized the president.",
      "Jimmy Kimmel's suspension has provoked dread in the late-night world. Hollywood writers rallied against Disney and Trump.",
      "Stephen Colbert, Jon Stewart, Seth Meyers, Jimmy Fallon, and Conan O'Brien have all weighed in on Kimmel's suspension."
    ],
    "image_url": "",
    "titles": [
      "Jimmy Kimmel's suspension shows power of FCC's Brendan Carr",
      "Jimmy Kimmel's suspension spreads fear through late-night TV about more targets",
      "Late-night hosts reacted to Jimmy Kimmel's suspension with the sharpest tools in their kit: comedy and defiance"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.735,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.634,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Since becoming FCC chair 8 months ago, Brendan Carr has taken actions perceived as limiting free speech, particularly targeting critics of the president. This has led to the suspension of Jimmy Kimmel, causing concern among late-night hosts and Hollywood writers. Figures like Stephen Colbert, Jon Stewart, Seth Meyers, Jimmy Fallon, and Conan O'Brien have publicly addressed the issue.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Administration Strikes Deal to Keep TikTok Operating in U.S.",
    "domain": "business",
    "source_domain": "www.marketwatch.com",
    "location": "global",
    "published": "Fri, 19 Sep 2025 21:08:00 GMT",
    "source": "MarketWatch",
    "sources": [
      "MarketWatch",
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com",
      "www.marketwatch.com"
    ],
    "snippets": [
      "Here’s the latest on the Trump administration’s agreement with China on TikTok.",
      "The two countries have been working on a way to save TikTok's U.S. business, after TikTok was banned in January over national security concerns."
    ],
    "image_url": "https://images.mktw.net/im-23387648",
    "titles": [
      "Trump touts TikTok deal but doesn’t address fear that China ‘retains a veto’",
      "Trump and ByteDance tout TikTok deal approval, but no official details yet"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.777,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.624,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Trump administration reached an agreement with China to preserve TikTok's operations in the U.S. This deal comes after the app was banned in January due to national security concerns.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "ACIP Votes Against Prescription Requirement for Covid-19 Vaccines",
    "domain": "science",
    "source_domain": "www.wired.com",
    "location": "global",
    "published": "Fri, 19 Sep 2025 21:39:56 +0000",
    "source": "Wired",
    "sources": [
      "MarketWatch",
      "Wired"
    ],
    "domains": [
      "www.wired.com",
      "www.marketwatch.com"
    ],
    "snippets": [
      "In a chaotic meeting, ACIP voted not to recommend a prescription requirement for Covid-19 vaccines. Some panelists seemed unaware of the point of the meeting, while others went on strange tangents.",
      "The government declined to provide a recommendation, saying individuals should decide whether to get the vaccine."
    ],
    "image_url": "https://media.wired.com/photos/68ca927739bdb01e906d623c/master/pass/GettyImages-2233024834.jpg",
    "titles": [
      "RFK Jr.’s Vaccine Panel Votes Down Its Own Proposal to Require Prescriptions for Covid-19 Shots",
      "COVID-19 vaccine recommendations dropped by panel, shots won’t require a prescription"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.802,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.622,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "During a disorganized ACIP meeting, the panel voted against recommending a prescription requirement for Covid-19 vaccines. Confusion and off-topic discussions marked the session. The government stated that the decision to get vaccinated should be left to individuals, effectively not issuing a formal recommendation.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Disney, ABC Criticized for Benching Kimmel After FCC Pressure",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Fri, 19 Sep 2025 21:43:12 GMT",
    "source": "CNBC",
    "sources": [
      "Fortune",
      "CNBC"
    ],
    "domains": [
      "fortune.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "Disney and ABC have faced criticism for bowing to pressure from Federal Communications Commission Chairman Brendan Carr in benching Jimmy Kimmel.",
      "\"If not for university presidents, law firm managing partners and corporate chief executives standing up to bullies, then who will step up for the First Amendment?”"
    ],
    "image_url": "",
    "titles": [
      "Former Disney CEO Eisner backs Jimmy Kimmel, blasts FCC 'intimidation' of ABC",
      "‘Where has all the leadership gone?’: Former Disney CEO Michael Eisner blasts Kimmel suspension"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.786,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.612,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Disney and ABC received criticism for succumbing to pressure from FCC Chairman Brendan Carr, leading to the benching of Jimmy Kimmel. Critics argue this move undermines First Amendment rights, questioning who will defend free speech if not influential leaders.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "ABC Suspends \"Jimmy Kimmel Live!\" Amid Controversy, Criticism from Eisner",
    "domain": "business",
    "source_domain": "www.forbes.com",
    "location": "global",
    "published": "Fri, 19 Sep 2025 16:08:48 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes",
      "The Verge"
    ],
    "domains": [
      "www.theverge.com",
      "www.forbes.com"
    ],
    "snippets": [
      "“Jimmy Kimmel Live!” was removed from the air by ABC and broadcasters this week after Kimmel made comments about conservative activist Charlie Kirk and Trump supporters in a show monologue.",
      "Michael Eisner, Disney's former CEO who ran the company for 21 years and oversaw its acquisition of ABC in 1995, does not think his successor, Bob Iger, made the right decision in moving to put Jimmy Kimmel Live! on indefinite pause following threats from Trump-appointed FCC chairman Brendan Carr. I"
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/68cdb8074c95d39f532fa0f5/0x0.jpg?width=960&precrop=3140%2C2094%2Cx0%2Cy0",
    "titles": [
      "Ex-Disney Chief Blasts Current Leadership And FCC For ‘Out-Of-Control Intimidation’ After Kimmel’s Removal",
      "Ex-Disney CEO Michael Eisner calls the FCC’s threats ‘out-of-control intimidation’"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.777,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.61,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "ABC pulled \"Jimmy Kimmel Live!\" off the air after Jimmy Kimmel made remarks about Charlie Kirk and Trump supporters in a monologue. Former Disney CEO Michael Eisner criticized current CEO Bob Iger's decision to indefinitely pause the show following threats from Trump-appointed FCC chairman Brendan Carr.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Cardi B Drops 'Am I the Drama?' Album, Addresses Divorce and Feuds",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 19 Sep 2025 16:30:26 GMT",
    "source": "BBC",
    "sources": [
      "Forbes",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.forbes.com"
    ],
    "snippets": [
      "The US rapper references her 2024 divorce and a beef with another female rapper on Am I The Drama?",
      "After seven years, Cardi B has returned with her long-awaited sophomore album, 'Am I the Drama?'"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/7cad/live/cbc39870-9549-11f0-9cf6-cbf3e73ce2b9.jpg",
    "titles": [
      "Settling old scores and creating new drama - Cardi B releases first album in seven years",
      "Cardi B Asks ‘Am I The Drama?’ On New Album"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.705,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.596,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Cardi B released her second album, 'Am I the Drama?', marking her return to music after seven years. In it, she discusses her 2024 divorce and conflicts with another female rapper.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]