[
  {
    "title": "China races robots against humans in Beijing half marathon",
    "domain": "general",
    "location": "global",
    "published": "Sat, 19 Apr 2025 04:32:12 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Yizhuang half marathon is the first time robots have raced against humans over such a distance.",
      "The Yizhuang half marathon is the first time robots have raced against humans over such a distance."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/c470/live/1abd1850-1cd4-11f0-b1b3-7358f8d35a35.jpg",
    "titles": [
      "China races robots against humans in Beijing half marathon",
      "China races robots against humans in Beijing half marathon"
    ],
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about an innovative event, which can help readers understand the current state of robotics. However, it does not provide any solutions or improvements, nor does it delve deeply into the causes or impacts.",
    "score_components": {
      "magnitude": 0.24,
      "recency": 0.934,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.516,
    "normalized_score": 10.0,
    "summary": "The Yizhuang half marathon marked the first occasion where robots competed against humans in a race covering such a distance."
  },
  {
    "title": "The forgotten Indian explorer who uncovered an ancient civilisation",
    "domain": "general",
    "location": "global",
    "published": "Sat, 19 Apr 2025 01:36:17 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Rakhaldas Banerjee is credited with discovering Mohenjo-daro, but his legacy is tainted by controversy."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/20f3/live/c341b6b0-1c3a-11f0-857e-c31f6e495ac8.jpg",
    "titles": [
      "The forgotten Indian explorer who uncovered an ancient civilisation"
    ],
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful information about an overlooked figure in history, contributing to a deeper understanding of historical exploration and archaeology. However, it does not report on any solutions or improvements.",
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.893,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.513,
    "normalized_score": 9.88,
    "summary": "Rakhaldas Banerjee, an Indian archaeologist, is recognized for discovering Mohenjo-daro, a major site of the ancient Indus Valley Civilization. However, his legacy is marred by controversy, reflecting debates and disputes within the academic and historical communities about his work and contributions. Despite the controversies, Banerjee's discovery remains a significant contribution to archaeology."
  },
  {
    "title": "Designed in US, made in China: Why Apple is stuck",
    "domain": "general",
    "location": "global",
    "published": "Fri, 18 Apr 2025 22:56:24 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "China sits at the heart of Apple's supply chain - and has benefited hugely from it. Can they break up?"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/f86a/live/3d6b7190-16a2-11f0-b2d2-fdaed6fdfe2b.jpg",
    "titles": [
      "Designed in US, made in China: Why Apple is stuck"
    ],
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it provides useful insights into the manufacturing processes of a major company and the challenges it faces. It increases clarity around the systems and trends in global manufacturing.",
    "score_components": {
      "magnitude": 0.22,
      "recency": 0.856,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.51,
    "normalized_score": 9.76,
    "summary": "Apple's supply chain is deeply integrated with China, resulting in significant mutual benefits. However, the possibility of Apple distancing itself from China is not explicitly confirmed or detailed in the provided content."
  },
  {
    "title": "'Child in arms, luggage on my head, I fled Sudan camp for safety'",
    "domain": "general",
    "location": "global",
    "published": "Fri, 18 Apr 2025 16:05:54 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Inhabitants of Sudan's biggest camp for displaced people have had their lives upturned once again."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/b92f/live/78bc69d0-1c5f-11f0-8a1e-3ff815141b98.png",
    "titles": [
      "'Child in arms, luggage on my head, I fled Sudan camp for safety'"
    ],
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides a deep understanding of the personal experiences and impacts of a major crisis. It raises awareness about the conditions in Sudan and the experiences of refugees. However, it does not report on any solutions or improvements.",
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.761,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.7
    },
    "score": 0.47,
    "normalized_score": 8.18,
    "summary": "Residents of Sudan's largest displacement camp have experienced significant upheaval, impacting their daily lives and stability. The current status or specific causes of this disruption were not detailed in the provided information."
  },
  {
    "title": "US Supreme Court halts deportation of detained Venezuelans",
    "domain": "general",
    "location": "global",
    "published": "Sat, 19 Apr 2025 08:48:35 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The accused gang members are being sent to a notorious jail in El Salvador under a 19th-Century law."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/2d86/live/a2b3c120-1cf5-11f0-bead-17ff6258b15e.jpg",
    "titles": [
      "US Supreme Court halts deportation of detained Venezuelans"
    ],
    "score_components": {
      "magnitude": 0.22,
      "recency": 0.993,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.464,
    "normalized_score": 7.94,
    "summary": "Accused gang members in El Salvador are being transferred to a notorious jail as part of a crackdown under a law from the 19th century. This move is part of the government's efforts to combat gang violence in the country."
  },
  {
    "title": "Breaking: Arsenal cleared to try AGAIN for stunning Premier League transfer raid",
    "domain": "sports",
    "location": "national",
    "published": "Sat, 19 Apr 2025 08:10:00 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Arsenal look to have been handed a huge boost as it now looks like Aston Villa striker Ollie Watkins will be available this summer.The Gunners saw a bid turned down for the England international back ..."
    ],
    "image_url": "",
    "titles": [
      "Breaking: Arsenal cleared to try AGAIN for stunning Premier League transfer raid"
    ],
    "score_components": {
      "magnitude": 0.22,
      "recency": 0.984,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.382,
    "normalized_score": 4.7,
    "summary": "Arsenal received a significant boost in their pursuit of Aston Villa striker Ollie Watkins, as he is reported to be available for transfer this summer. Despite having an initial bid rejected for the England international, Arsenal's chances of securing Watkins have improved, indicating a potential move during the transfer window."
  },
  {
    "title": "USC shuts down Lake McRee for remainder of spring camp",
    "domain": "sports",
    "location": "national",
    "published": "Sat, 19 Apr 2025 08:33:30 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "According to head coach Lincoln Riley, McRee has been dealing with several nagging injuries."
    ],
    "image_url": "",
    "titles": [
      "USC shuts down Lake McRee for remainder of spring camp"
    ],
    "score_components": {
      "magnitude": 0.12,
      "recency": 0.99,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.354,
    "normalized_score": 3.6,
    "summary": "Head coach Lincoln Riley reported that McRee is currently facing multiple nagging injuries. These health issues are affecting his ability to play."
  },
  {
    "title": "Conte’s latest claims spark Napoli exit rumours",
    "domain": "sports",
    "location": "national",
    "published": "Sat, 19 Apr 2025 08:17:00 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Antonio Conte admits ‘many things can’t be done at Napoli’, sparking exit rumours after just eight months at the club.Napoli will visit Monza at the U-Power Stadium today, but the matchday has b..."
    ],
    "image_url": "",
    "titles": [
      "Conte’s latest claims spark Napoli exit rumours"
    ],
    "score_components": {
      "magnitude": 0.12,
      "recency": 0.986,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.353,
    "normalized_score": 3.56,
    "summary": "Antonio Conte hinted at possible limitations within Napoli, leading to speculation about his departure just eight months into his tenure. Despite this, Napoli is set to play against Monza at the U-Power Stadium. The context of Conte's remarks and the outcome of the match might influence his future at the club."
  },
  {
    "title": "Werder Bremen sign captain Marco Friedl to contract extension",
    "domain": "sports",
    "location": "national",
    "published": "Sat, 19 Apr 2025 08:07:00 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Werder Bremen squad captain Marco Friedl – considered one of the primary reasons why SV Werder Bremen have recently pulled themselves out of a horrible midseason slump – has been rewarded with a n..."
    ],
    "image_url": "",
    "titles": [
      "Werder Bremen sign captain Marco Friedl to contract extension"
    ],
    "score_components": {
      "magnitude": 0.12,
      "recency": 0.984,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.352,
    "normalized_score": 3.52,
    "summary": "Werder Bremen has extended the contract of their squad captain Marco Friedl, acknowledging his significant role in helping the team recover from a midseason slump. This move demonstrates the club's appreciation for Friedl's contributions to their recent improvement in performance."
  },
  {
    "title": "Headed to the Boston Marathon? Here's how to go from Brockton to Boston on the commuter rail",
    "domain": "sports",
    "location": "national",
    "published": "Sat, 19 Apr 2025 08:01:39 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Cheer on the runners! Here's how to easily get from Brockton to the Boston Marathon and be part of the excitement without the hassle."
    ],
    "image_url": "",
    "titles": [
      "Headed to the Boston Marathon? Here's how to go from Brockton to Boston on the commuter rail"
    ],
    "score_components": {
      "magnitude": 0.12,
      "recency": 0.982,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.352,
    "normalized_score": 3.52,
    "summary": "Residents of Brockton can join the Boston Marathon festivities by utilizing convenient transportation options to reach the event. This ensures participation in the excitement without dealing with transportation hassles."
  },
  {
    "title": "Will You REALLY Need a REAL ID to Fly on May 7?",
    "domain": "business",
    "location": "global",
    "published": "Sat, 19 Apr 2025 09:00:00 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "<figure><img alt=\"Jeffrey Greenberg / Universal Images Group via Getty Images\" src=\"https://www.investopedia.com/thmb/bfbql4qKt0ILNLpeCVgVzSVERec=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2166906417-e659136e02ca421dad862f432d6103a5.jpg\" title=\"REAL ID sign at Miami International Airport\" /><figcaption><i><p>Jeffrey Greenberg / Universal Images Group via Getty Images</p></i></figcaption></figure><br /><h3>Key Takeaways</h3><ul><li>The REAL ID Act was signed into law by President George W. Bush in 2005 and expected to be implemented in 2008. That still hasn't happened.</li><li>However, the Department of Homeland Security now says it will begin enforcement on May 7.</li><li>The government says passengers hoping to fly then without REAL ID-compliant identification \"should plan to arrive at airports about three hours in advance of their flight, as delays are possible at the identity verification station within checkpoints.\"</li></ul><br /><br /><p>The REAL ID Act, signed into law 20 years ago, still hasn't gone into effect.<span class=\"ql-inline-citation\"></span> This time, though, the Department of Homeland Security swears it will—starting early next month.<span class=\"ql-inline-citation\"></span></p><p>Republican and Democratic administrations alike have kicked the can down the road since President George W. Bush signed the REAL ID Act to establish federal standards for identification documents into law in May 2005.</p><p>That looks set to end May 7, when its Transportation Security Administration unit says at long last it will step up enforcement. \"If you plan to fly, make sure you get a Real ID so you won't be denied from your flight or face travel delays!\" DHS Secretary Kristi Noem said on a recent X post.<span class=\"ql-inline-citation\"></span></p><p>Here's what this means for American travelers.</p><h2>Countdown Clock</h2><p>Despite having extended the deadline on multiple occasions over the decades, the DHS insists REAL ID enforcement will take place soon. It even has a \"Countdown to REAL ID Enforcement\" clock ticking down on its website.</p><p>The bottom line: If you want to travel using your state driver's license or ID—or do other activities that require federal identification—you'll need it to be a REAL ID, though other forms of identification, such as valid passports, can also work. A <a href=\"https://www.tsa.gov/travel/security-screening/identification\">full list is here</a>.</p><p>\"On May 7, 2025, U.S. travelers must be REAL ID compliant to board domestic flights and access certain federal facilities,\" reads the DHS website, which has an interactive tool to help people determine if they're \"REAL ID ready\" that you can <a href=\"https://www.dhs.gov/real-id/are-you-real-id-ready\">check out here</a>.</p><p>In a statement provided to <em>Investopedia</em>, the TSA said that beginning May 7, \"every air traveler 18 years of age and older is expected to have a REAL ID-compliant ID. That is a state-issued driver's license, state-issued identification card or another acceptable form of ID.\"</p><p>REAL ID-compliant IDs are marked with a star. The TSA also will continue accepting Enhanced Driver's Licenses, which \"provide proof of identity and U.S. citizenship when crossing the U.S. border and are available in Michigan, Minnesota, New York, Vermont, and Washington.\"</p><h2>What Will ID Checks Be Like at Airports Starting May 7?</h2><p>Things may be bumpy at the start. Asked what will happen to passengers who arrive at U.S. airports without acceptable ID on May 7, the TSA say they \"should plan to arrive at airports about three hours in advance of their flight, as delays are possible at the identity verification station within checkpoints.\"</p><p>As of April 11, more than 80% of travelers at TSA checkpoints were presenting acceptable identification, the TSA said, adding it \"expects the number of passengers obtaining REAL IDs to steadily increase and will continue with additional screening measures for those without a REAL ID until it is no longer considered a security vulnerability.\"<span class=\"ql-inline-citation\"></span> </p><p>If you're in the estimated 20% of Americans not already compliant, DHS instructs you to \"visit your state's driver’s licensing agency website to find out exactly what documentation is required to obtain a REAL ID.\"</p>"
    ],
    "image_url": "https://www.investopedia.com/thmb/bfbql4qKt0ILNLpeCVgVzSVERec=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2166906417-e659136e02ca421dad862f432d6103a5.jpg",
    "titles": [
      "Will You REALLY Need a REAL ID to Fly on May 7?"
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.996,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.459,
    "normalized_score": 7.75,
    "summary": "The Department of Homeland Security (DHS) has announced that enforcement of the REAL ID Act will begin on May 7, 2025. This act, signed into law by President George W. Bush in 2005, mandates federal standards for identification documents. Travelers aged 18 and over will be required to present a REAL ID-compliant ID, marked with a star, for domestic flights and access to certain federal facilities. Other forms of identification, like passports, will still be acceptable. The TSA advises passengers without a REAL ID to arrive at airports three hours early due to potential delays. Over 80% of trav"
  },
  {
    "title": "Trump tariffs bring furrowed brows to Ireland’s Botox town",
    "domain": "business",
    "location": "global",
    "published": "Sat, 19 Apr 2025 04:00:58 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Westport makes the world’s entire supply of the anti-wrinkle drug — now it fears production could move to the US"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F30add343-9057-48cc-a4ec-79182d89614f.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Trump tariffs bring furrowed brows to Ireland’s Botox town"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.24,
      "recency": 0.927,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.454,
    "normalized_score": 7.55,
    "summary": "Westport, the sole global producer of a specific anti-wrinkle drug, is concerned that its production might be relocated to the United States. This shift in manufacturing location has yet to occur, but the potential move has raised fears among those involved in its current production."
  },
  {
    "title": "Donald Trump vs Mr Market",
    "domain": "business",
    "location": "global",
    "published": "Sat, 19 Apr 2025 04:00:58 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "As the US president’s rollercoaster tariff policy creates global financial chaos, Tim Harford asks: is he in a fight he can’t win?"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F5f0837a5-fb2a-443a-b641-0b51ac00a054.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Donald Trump vs Mr Market"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.22,
      "recency": 0.927,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.448,
    "normalized_score": 7.31,
    "summary": "Tim Harford analyzes the impact of the US president's fluctuating tariff policy, suggesting it has caused global financial turmoil. He raises the question of whether this strategy is sustainable or if it's a battle the president might ultimately lose."
  },
  {
    "title": "What abundance can’t achieve",
    "domain": "business",
    "location": "global",
    "published": "Sat, 19 Apr 2025 04:00:58 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Growth is worthwhile in itself — but it’s not a cure for populism"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F91b3bed1-3491-4a1f-b503-16053ff900c2.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "What abundance can’t achieve"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.927,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.442,
    "normalized_score": 7.08,
    "summary": "Economic growth, while valuable, does not automatically solve the issue of populism. This conclusion stems from the understanding that despite the benefits of economic expansion, such as increased wealth and job opportunities, it does not directly address the political or social factors that fuel populist movements."
  },
  {
    "title": "Wall Street slashes stock market forecasts amid Trump tariff fears",
    "domain": "business",
    "location": "global",
    "published": "Fri, 18 Apr 2025 20:00:56 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Banks expect gain of just 2% for S&amp;P 500 this year, with JPMorgan and BofA among those lowering estimates"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F39a16559-38b9-4129-8e7d-9d364a8a9d92.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Wall Street slashes stock market forecasts amid Trump tariff fears"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.24,
      "recency": 0.816,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.426,
    "normalized_score": 6.44,
    "summary": "Several banks, including JPMorgan and Bank of America, have revised their forecasts for the S&P 500, now expecting a modest gain of just 2% for the year. This adjustment reflects a more cautious outlook on the stock market's performance."
  },
  {
    "title": "New colour seen for the first time by tricking the eyes",
    "domain": "science",
    "location": "global",
    "published": "Fri, 18 Apr 2025 20:00:33 +0100",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A device has enabled people to see a new a shade of blue-green, which they say is more intense than any experienced before"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/04/17153716/SEI_247864690.jpg",
    "titles": [
      "New colour seen for the first time by tricking the eyes"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.802,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.41,
    "normalized_score": 5.81,
    "summary": "A newly developed device allows users to perceive a unique shade of blue-green, described as more intense than any previously known. This innovation marks a significant advancement in visual technology, offering a novel visual experience."
  },
  {
    "title": "Claims of alien life are overhyped – and miss the real accomplishment",
    "domain": "science",
    "location": "global",
    "published": "Fri, 18 Apr 2025 18:14:03 +0100",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Whenever there’s even a slight chance that an exoplanet shows signs of biological activity, people understandably get excited – but it’s never been aliens, and we shouldn’t jump to conclusions, not this time or the next, says Chris Lintott"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/04/18165312/SEI_247864467.jpg",
    "titles": [
      "Claims of alien life are overhyped – and miss the real accomplishment"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.22,
      "recency": 0.777,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.41,
    "normalized_score": 5.81,
    "summary": "Chris Lintott cautions against jumping to conclusions about alien life on exoplanets, even when they exhibit potential signs of biological activity. He emphasizes that past excitement has never confirmed alien life, advising a more measured approach in future instances."
  },
  {
    "title": "Quantum GPS can help planes navigate when regular GPS is jammed",
    "domain": "science",
    "location": "global",
    "published": "Fri, 18 Apr 2025 17:00:43 +0100",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A quantum sensor using Earth's magnetic fields outperformed standard GPS backups in test flights. This technology could help commercial aircraft stay on course amid a rise in GPS jamming and spoofing attacks"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/04/17192123/SEI_247838477.jpg",
    "titles": [
      "Quantum GPS can help planes navigate when regular GPS is jammed"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.76,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.4,
    "normalized_score": 5.42,
    "summary": "A quantum sensor, leveraging Earth's magnetic fields, demonstrated superior performance to traditional GPS backups during test flights, offering a promising solution for commercial aircraft navigation. This advancement comes as a response to the increasing challenges posed by GPS jamming and spoofing attacks, ensuring more reliable and accurate course maintenance for aircraft."
  },
  {
    "title": "Artificial light pollution could fuel growth of toxic algal blooms",
    "domain": "science",
    "location": "global",
    "published": "Fri, 18 Apr 2025 13:00:20 +0100",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The \"skyglow\" produced when light from cities bounces off clouds can help cyanobacteria and other aquatic microbes grow at night"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/04/17150404/SEI_247850474.jpg",
    "titles": [
      "Artificial light pollution could fuel growth of toxic algal blooms"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.704,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.386,
    "normalized_score": 4.86,
    "summary": "Research indicates that \"skyglow,\" a phenomenon where city lights are reflected off clouds, can stimulate the growth of cyanobacteria and other aquatic microbes during nighttime. This finding highlights the broader ecological impact of urban lighting beyond its immediate surroundings."
  },
  {
    "title": "A wearable smart insole can track how you walk, run and stand",
    "domain": "science",
    "location": "global",
    "published": "Fri, 18 Apr 2025 11:29:07 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A new smart insole system that monitors how people walk in real time could help users improve posture and provide early warnings for conditions from plantar fasciitis to Parkinson's disease."
    ],
    "image_url": "",
    "titles": [
      "A wearable smart insole can track how you walk, run and stand"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.697,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.384,
    "normalized_score": 4.78,
    "summary": "A newly developed smart insole system can monitor walking patterns in real-time, offering potential benefits such as posture improvement and early detection of conditions ranging from plantar fasciitis to Parkinson's disease. This technology aims to aid users in identifying and addressing gait-related health issues promptly."
  },
  {
    "title": "Will You REALLY Need a REAL ID to Fly on May 7?",
    "domain": "business",
    "location": "global",
    "published": "Sat, 19 Apr 2025 09:00:00 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "<figure><img alt=\"Jeffrey Greenberg / Universal Images Group via Getty Images\" src=\"https://www.investopedia.com/thmb/bfbql4qKt0ILNLpeCVgVzSVERec=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2166906417-e659136e02ca421dad862f432d6103a5.jpg\" title=\"REAL ID sign at Miami International Airport\" /><figcaption><i><p>Jeffrey Greenberg / Universal Images Group via Getty Images</p></i></figcaption></figure><br /><h3>Key Takeaways</h3><ul><li>The REAL ID Act was signed into law by President George W. Bush in 2005 and expected to be implemented in 2008. That still hasn't happened.</li><li>However, the Department of Homeland Security now says it will begin enforcement on May 7.</li><li>The government says passengers hoping to fly then without REAL ID-compliant identification \"should plan to arrive at airports about three hours in advance of their flight, as delays are possible at the identity verification station within checkpoints.\"</li></ul><br /><br /><p>The REAL ID Act, signed into law 20 years ago, still hasn't gone into effect.<span class=\"ql-inline-citation\"></span> This time, though, the Department of Homeland Security swears it will—starting early next month.<span class=\"ql-inline-citation\"></span></p><p>Republican and Democratic administrations alike have kicked the can down the road since President George W. Bush signed the REAL ID Act to establish federal standards for identification documents into law in May 2005.</p><p>That looks set to end May 7, when its Transportation Security Administration unit says at long last it will step up enforcement. \"If you plan to fly, make sure you get a Real ID so you won't be denied from your flight or face travel delays!\" DHS Secretary Kristi Noem said on a recent X post.<span class=\"ql-inline-citation\"></span></p><p>Here's what this means for American travelers.</p><h2>Countdown Clock</h2><p>Despite having extended the deadline on multiple occasions over the decades, the DHS insists REAL ID enforcement will take place soon. It even has a \"Countdown to REAL ID Enforcement\" clock ticking down on its website.</p><p>The bottom line: If you want to travel using your state driver's license or ID—or do other activities that require federal identification—you'll need it to be a REAL ID, though other forms of identification, such as valid passports, can also work. A <a href=\"https://www.tsa.gov/travel/security-screening/identification\">full list is here</a>.</p><p>\"On May 7, 2025, U.S. travelers must be REAL ID compliant to board domestic flights and access certain federal facilities,\" reads the DHS website, which has an interactive tool to help people determine if they're \"REAL ID ready\" that you can <a href=\"https://www.dhs.gov/real-id/are-you-real-id-ready\">check out here</a>.</p><p>In a statement provided to <em>Investopedia</em>, the TSA said that beginning May 7, \"every air traveler 18 years of age and older is expected to have a REAL ID-compliant ID. That is a state-issued driver's license, state-issued identification card or another acceptable form of ID.\"</p><p>REAL ID-compliant IDs are marked with a star. The TSA also will continue accepting Enhanced Driver's Licenses, which \"provide proof of identity and U.S. citizenship when crossing the U.S. border and are available in Michigan, Minnesota, New York, Vermont, and Washington.\"</p><h2>What Will ID Checks Be Like at Airports Starting May 7?</h2><p>Things may be bumpy at the start. Asked what will happen to passengers who arrive at U.S. airports without acceptable ID on May 7, the TSA say they \"should plan to arrive at airports about three hours in advance of their flight, as delays are possible at the identity verification station within checkpoints.\"</p><p>As of April 11, more than 80% of travelers at TSA checkpoints were presenting acceptable identification, the TSA said, adding it \"expects the number of passengers obtaining REAL IDs to steadily increase and will continue with additional screening measures for those without a REAL ID until it is no longer considered a security vulnerability.\"<span class=\"ql-inline-citation\"></span> </p><p>If you're in the estimated 20% of Americans not already compliant, DHS instructs you to \"visit your state's driver’s licensing agency website to find out exactly what documentation is required to obtain a REAL ID.\"</p>"
    ],
    "image_url": "https://www.investopedia.com/thmb/bfbql4qKt0ILNLpeCVgVzSVERec=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2166906417-e659136e02ca421dad862f432d6103a5.jpg",
    "titles": [
      "Will You REALLY Need a REAL ID to Fly on May 7?"
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.996,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.459,
    "normalized_score": 7.75,
    "summary": "The Department of Homeland Security (DHS) has announced that enforcement of the REAL ID Act will begin on May 7, 2025. This act, signed into law by President George W. Bush in 2005, mandates federal standards for identification documents. Travelers aged 18 and over will be required to present a REAL ID-compliant ID, marked with a star, for domestic flights and access to certain federal facilities. Other forms of identification, like passports, will still be acceptable. The TSA advises passengers without a REAL ID to arrive at airports three hours early due to potential delays. Over 80% of trav"
  },
  {
    "title": "Trump tariffs bring furrowed brows to Ireland’s Botox town",
    "domain": "business",
    "location": "global",
    "published": "Sat, 19 Apr 2025 04:00:58 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Westport makes the world’s entire supply of the anti-wrinkle drug — now it fears production could move to the US"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F30add343-9057-48cc-a4ec-79182d89614f.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Trump tariffs bring furrowed brows to Ireland’s Botox town"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.24,
      "recency": 0.927,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.454,
    "normalized_score": 7.55,
    "summary": "Westport, the sole global producer of a specific anti-wrinkle drug, is concerned that its production might be relocated to the United States. This shift in manufacturing location has yet to occur, but the potential move has raised fears among those involved in its current production."
  },
  {
    "title": "Donald Trump vs Mr Market",
    "domain": "business",
    "location": "global",
    "published": "Sat, 19 Apr 2025 04:00:58 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "As the US president’s rollercoaster tariff policy creates global financial chaos, Tim Harford asks: is he in a fight he can’t win?"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F5f0837a5-fb2a-443a-b641-0b51ac00a054.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Donald Trump vs Mr Market"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.22,
      "recency": 0.927,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.448,
    "normalized_score": 7.31,
    "summary": "Tim Harford analyzes the impact of the US president's fluctuating tariff policy, suggesting it has caused global financial turmoil. He raises the question of whether this strategy is sustainable or if it's a battle the president might ultimately lose."
  },
  {
    "title": "What abundance can’t achieve",
    "domain": "business",
    "location": "global",
    "published": "Sat, 19 Apr 2025 04:00:58 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Growth is worthwhile in itself — but it’s not a cure for populism"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F91b3bed1-3491-4a1f-b503-16053ff900c2.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "What abundance can’t achieve"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.927,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.442,
    "normalized_score": 7.08,
    "summary": "Economic growth, while valuable, does not automatically solve the issue of populism. This conclusion stems from the understanding that despite the benefits of economic expansion, such as increased wealth and job opportunities, it does not directly address the political or social factors that fuel populist movements."
  },
  {
    "title": "Wall Street slashes stock market forecasts amid Trump tariff fears",
    "domain": "business",
    "location": "global",
    "published": "Fri, 18 Apr 2025 20:00:56 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Banks expect gain of just 2% for S&amp;P 500 this year, with JPMorgan and BofA among those lowering estimates"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F39a16559-38b9-4129-8e7d-9d364a8a9d92.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Wall Street slashes stock market forecasts amid Trump tariff fears"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.24,
      "recency": 0.816,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.426,
    "normalized_score": 6.44,
    "summary": "Several banks, including JPMorgan and Bank of America, have revised their forecasts for the S&P 500, now expecting a modest gain of just 2% for the year. This adjustment reflects a more cautious outlook on the stock market's performance."
  },
  {
    "title": "China races robots against humans in Beijing half marathon",
    "domain": "general",
    "location": "global",
    "published": "Sat, 19 Apr 2025 04:32:12 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Yizhuang half marathon is the first time robots have raced against humans over such a distance.",
      "The Yizhuang half marathon is the first time robots have raced against humans over such a distance."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/c470/live/1abd1850-1cd4-11f0-b1b3-7358f8d35a35.jpg",
    "titles": [
      "China races robots against humans in Beijing half marathon",
      "China races robots against humans in Beijing half marathon"
    ],
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about an innovative event, which can help readers understand the current state of robotics. However, it does not provide any solutions or improvements, nor does it delve deeply into the causes or impacts.",
    "score_components": {
      "magnitude": 0.24,
      "recency": 0.934,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.516,
    "normalized_score": 10.0,
    "summary": "The Yizhuang half marathon marked the first occasion where robots competed against humans in a race covering such a distance."
  },
  {
    "title": "The forgotten Indian explorer who uncovered an ancient civilisation",
    "domain": "general",
    "location": "global",
    "published": "Sat, 19 Apr 2025 01:36:17 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Rakhaldas Banerjee is credited with discovering Mohenjo-daro, but his legacy is tainted by controversy."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/20f3/live/c341b6b0-1c3a-11f0-857e-c31f6e495ac8.jpg",
    "titles": [
      "The forgotten Indian explorer who uncovered an ancient civilisation"
    ],
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful information about an overlooked figure in history, contributing to a deeper understanding of historical exploration and archaeology. However, it does not report on any solutions or improvements.",
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.893,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.513,
    "normalized_score": 9.88,
    "summary": "Rakhaldas Banerjee, an Indian archaeologist, is recognized for discovering Mohenjo-daro, a major site of the ancient Indus Valley Civilization. However, his legacy is marred by controversy, reflecting debates and disputes within the academic and historical communities about his work and contributions. Despite the controversies, Banerjee's discovery remains a significant contribution to archaeology."
  },
  {
    "title": "Designed in US, made in China: Why Apple is stuck",
    "domain": "general",
    "location": "global",
    "published": "Fri, 18 Apr 2025 22:56:24 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "China sits at the heart of Apple's supply chain - and has benefited hugely from it. Can they break up?"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/f86a/live/3d6b7190-16a2-11f0-b2d2-fdaed6fdfe2b.jpg",
    "titles": [
      "Designed in US, made in China: Why Apple is stuck"
    ],
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it provides useful insights into the manufacturing processes of a major company and the challenges it faces. It increases clarity around the systems and trends in global manufacturing.",
    "score_components": {
      "magnitude": 0.22,
      "recency": 0.856,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.51,
    "normalized_score": 9.76,
    "summary": "Apple's supply chain is deeply integrated with China, resulting in significant mutual benefits. However, the possibility of Apple distancing itself from China is not explicitly confirmed or detailed in the provided content."
  },
  {
    "title": "'Child in arms, luggage on my head, I fled Sudan camp for safety'",
    "domain": "general",
    "location": "global",
    "published": "Fri, 18 Apr 2025 16:05:54 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Inhabitants of Sudan's biggest camp for displaced people have had their lives upturned once again."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/b92f/live/78bc69d0-1c5f-11f0-8a1e-3ff815141b98.png",
    "titles": [
      "'Child in arms, luggage on my head, I fled Sudan camp for safety'"
    ],
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides a deep understanding of the personal experiences and impacts of a major crisis. It raises awareness about the conditions in Sudan and the experiences of refugees. However, it does not report on any solutions or improvements.",
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.761,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.7
    },
    "score": 0.47,
    "normalized_score": 8.18,
    "summary": "Residents of Sudan's largest displacement camp have experienced significant upheaval, impacting their daily lives and stability. The current status or specific causes of this disruption were not detailed in the provided information."
  },
  {
    "title": "US Supreme Court halts deportation of detained Venezuelans",
    "domain": "general",
    "location": "global",
    "published": "Sat, 19 Apr 2025 08:48:35 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The accused gang members are being sent to a notorious jail in El Salvador under a 19th-Century law."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/2d86/live/a2b3c120-1cf5-11f0-bead-17ff6258b15e.jpg",
    "titles": [
      "US Supreme Court halts deportation of detained Venezuelans"
    ],
    "score_components": {
      "magnitude": 0.22,
      "recency": 0.993,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.464,
    "normalized_score": 7.94,
    "summary": "Accused gang members in El Salvador are being transferred to a notorious jail as part of a crackdown under a law from the 19th century. This move is part of the government's efforts to combat gang violence in the country."
  },
  {
    "title": "New colour seen for the first time by tricking the eyes",
    "domain": "science",
    "location": "global",
    "published": "Fri, 18 Apr 2025 20:00:33 +0100",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A device has enabled people to see a new a shade of blue-green, which they say is more intense than any experienced before"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/04/17153716/SEI_247864690.jpg",
    "titles": [
      "New colour seen for the first time by tricking the eyes"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.802,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.41,
    "normalized_score": 5.81,
    "summary": "A newly developed device allows users to perceive a unique shade of blue-green, described as more intense than any previously known. This innovation marks a significant advancement in visual technology, offering a novel visual experience."
  },
  {
    "title": "Claims of alien life are overhyped – and miss the real accomplishment",
    "domain": "science",
    "location": "global",
    "published": "Fri, 18 Apr 2025 18:14:03 +0100",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Whenever there’s even a slight chance that an exoplanet shows signs of biological activity, people understandably get excited – but it’s never been aliens, and we shouldn’t jump to conclusions, not this time or the next, says Chris Lintott"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/04/18165312/SEI_247864467.jpg",
    "titles": [
      "Claims of alien life are overhyped – and miss the real accomplishment"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.22,
      "recency": 0.777,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.41,
    "normalized_score": 5.81,
    "summary": "Chris Lintott cautions against jumping to conclusions about alien life on exoplanets, even when they exhibit potential signs of biological activity. He emphasizes that past excitement has never confirmed alien life, advising a more measured approach in future instances."
  },
  {
    "title": "Quantum GPS can help planes navigate when regular GPS is jammed",
    "domain": "science",
    "location": "global",
    "published": "Fri, 18 Apr 2025 17:00:43 +0100",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A quantum sensor using Earth's magnetic fields outperformed standard GPS backups in test flights. This technology could help commercial aircraft stay on course amid a rise in GPS jamming and spoofing attacks"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/04/17192123/SEI_247838477.jpg",
    "titles": [
      "Quantum GPS can help planes navigate when regular GPS is jammed"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.76,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.4,
    "normalized_score": 5.42,
    "summary": "A quantum sensor, leveraging Earth's magnetic fields, demonstrated superior performance to traditional GPS backups during test flights, offering a promising solution for commercial aircraft navigation. This advancement comes as a response to the increasing challenges posed by GPS jamming and spoofing attacks, ensuring more reliable and accurate course maintenance for aircraft."
  },
  {
    "title": "Artificial light pollution could fuel growth of toxic algal blooms",
    "domain": "science",
    "location": "global",
    "published": "Fri, 18 Apr 2025 13:00:20 +0100",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The \"skyglow\" produced when light from cities bounces off clouds can help cyanobacteria and other aquatic microbes grow at night"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/04/17150404/SEI_247850474.jpg",
    "titles": [
      "Artificial light pollution could fuel growth of toxic algal blooms"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.704,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.386,
    "normalized_score": 4.86,
    "summary": "Research indicates that \"skyglow,\" a phenomenon where city lights are reflected off clouds, can stimulate the growth of cyanobacteria and other aquatic microbes during nighttime. This finding highlights the broader ecological impact of urban lighting beyond its immediate surroundings."
  },
  {
    "title": "A wearable smart insole can track how you walk, run and stand",
    "domain": "science",
    "location": "global",
    "published": "Fri, 18 Apr 2025 11:29:07 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A new smart insole system that monitors how people walk in real time could help users improve posture and provide early warnings for conditions from plantar fasciitis to Parkinson's disease."
    ],
    "image_url": "",
    "titles": [
      "A wearable smart insole can track how you walk, run and stand"
    ],
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.697,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.384,
    "normalized_score": 4.78,
    "summary": "A newly developed smart insole system can monitor walking patterns in real-time, offering potential benefits such as posture improvement and early detection of conditions ranging from plantar fasciitis to Parkinson's disease. This technology aims to aid users in identifying and addressing gait-related health issues promptly."
  },
  {
    "title": "Breaking: Arsenal cleared to try AGAIN for stunning Premier League transfer raid",
    "domain": "sports",
    "location": "national",
    "published": "Sat, 19 Apr 2025 08:10:00 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Arsenal look to have been handed a huge boost as it now looks like Aston Villa striker Ollie Watkins will be available this summer.The Gunners saw a bid turned down for the England international back ..."
    ],
    "image_url": "",
    "titles": [
      "Breaking: Arsenal cleared to try AGAIN for stunning Premier League transfer raid"
    ],
    "score_components": {
      "magnitude": 0.22,
      "recency": 0.984,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.382,
    "normalized_score": 4.7,
    "summary": "Arsenal received a significant boost in their pursuit of Aston Villa striker Ollie Watkins, as he is reported to be available for transfer this summer. Despite having an initial bid rejected for the England international, Arsenal's chances of securing Watkins have improved, indicating a potential move during the transfer window."
  },
  {
    "title": "USC shuts down Lake McRee for remainder of spring camp",
    "domain": "sports",
    "location": "national",
    "published": "Sat, 19 Apr 2025 08:33:30 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "According to head coach Lincoln Riley, McRee has been dealing with several nagging injuries."
    ],
    "image_url": "",
    "titles": [
      "USC shuts down Lake McRee for remainder of spring camp"
    ],
    "score_components": {
      "magnitude": 0.12,
      "recency": 0.99,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.354,
    "normalized_score": 3.6,
    "summary": "Head coach Lincoln Riley reported that McRee is currently facing multiple nagging injuries. These health issues are affecting his ability to play."
  },
  {
    "title": "Conte’s latest claims spark Napoli exit rumours",
    "domain": "sports",
    "location": "national",
    "published": "Sat, 19 Apr 2025 08:17:00 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Antonio Conte admits ‘many things can’t be done at Napoli’, sparking exit rumours after just eight months at the club.Napoli will visit Monza at the U-Power Stadium today, but the matchday has b..."
    ],
    "image_url": "",
    "titles": [
      "Conte’s latest claims spark Napoli exit rumours"
    ],
    "score_components": {
      "magnitude": 0.12,
      "recency": 0.986,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.353,
    "normalized_score": 3.56,
    "summary": "Antonio Conte hinted at possible limitations within Napoli, leading to speculation about his departure just eight months into his tenure. Despite this, Napoli is set to play against Monza at the U-Power Stadium. The context of Conte's remarks and the outcome of the match might influence his future at the club."
  },
  {
    "title": "Werder Bremen sign captain Marco Friedl to contract extension",
    "domain": "sports",
    "location": "national",
    "published": "Sat, 19 Apr 2025 08:07:00 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Werder Bremen squad captain Marco Friedl – considered one of the primary reasons why SV Werder Bremen have recently pulled themselves out of a horrible midseason slump – has been rewarded with a n..."
    ],
    "image_url": "",
    "titles": [
      "Werder Bremen sign captain Marco Friedl to contract extension"
    ],
    "score_components": {
      "magnitude": 0.12,
      "recency": 0.984,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.352,
    "normalized_score": 3.52,
    "summary": "Werder Bremen has extended the contract of their squad captain Marco Friedl, acknowledging his significant role in helping the team recover from a midseason slump. This move demonstrates the club's appreciation for Friedl's contributions to their recent improvement in performance."
  },
  {
    "title": "Headed to the Boston Marathon? Here's how to go from Brockton to Boston on the commuter rail",
    "domain": "sports",
    "location": "national",
    "published": "Sat, 19 Apr 2025 08:01:39 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Cheer on the runners! Here's how to easily get from Brockton to the Boston Marathon and be part of the excitement without the hassle."
    ],
    "image_url": "",
    "titles": [
      "Headed to the Boston Marathon? Here's how to go from Brockton to Boston on the commuter rail"
    ],
    "score_components": {
      "magnitude": 0.12,
      "recency": 0.982,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.352,
    "normalized_score": 3.52,
    "summary": "Residents of Brockton can join the Boston Marathon festivities by utilizing convenient transportation options to reach the event. This ensures participation in the excitement without dealing with transportation hassles."
  }
]