[
  {
    "title": "Tottenham Beats Manchester City 2-0, Maintains Premier League Lead",
    "domain": "sports",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sat, 23 Aug 2025 14:19:28 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Sportsnet",
      "Al Jazeera",
      "Sports Illustrated",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.sportsnet.ca",
      "www.aljazeera.com",
      "news.google.com"
    ],
    "snippets": [
      "Spurs maintain their winning start to the season but leave Manchester City with yet more questions to answer.",
      "Tottenham earned a 2-0 away win over Manchester City on Saturday, maintaining their top spot in the Premier League.",
      "<a href=\"https://news.google.com/rss/articles/CBMiekFVX3lxTE9fU0RzZzJwU0VCX3lYOEp2RVZOY09KdlBwQ0lPR09PQm52bEtoVTNYR0ZwSFRrRGFYcUR6OVVqOUVzbG1Dejh4em43VmtCNG9CMlBDVkppcURRSkU3TXhLSDdkaS1BN3NoZzZXek1PSGRpVm1XVmFVaE93?oc=5\" target=\"_blank\">Tottenham Player Ratings vs. Man City: Spurs Stun Cityzens in I",
      "<p>Tottenham continued its flying start to the Premier League season under new coach Thomas Frank as Brennan Johnson and Joao Palhinha secured an impressive 2-0 victory at Manchester City on Saturday.</p>"
    ],
    "image_url": "",
    "titles": [
      "Tottenham stun Man City with 2-0 win in Premier League",
      "Tottenham shines in win over disjointed Man City",
      "Tottenham Player Ratings vs. Man City: Spurs Stun Cityzens in Impressive 2–0 Win - Sports Illustrated",
      "Impressive Tottenham defeats Man City in Premier League"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.963,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.789,
    "summary": "Tottenham Hotspur secured a 2-0 victory over Manchester City, continuing their winning streak in the Premier League. Goals from Brennan Johnson and Joao Palhinha led Spurs to maintain their top spot in the standings. The match, held on Saturday, highlighted Tottenham's strong start to the season under coach Thomas Frank, while raising concerns for Manchester City's performance.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Young Canadians Question Tipping Culture Amid Self-Service Tip Requests",
    "domain": "general",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sat, 23 Aug 2025 14:03:06 +0000",
    "source": "Global News",
    "sources": [
      "CityNews",
      "Financial Post",
      "Global News"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "financialpost.com",
      "globalnews.ca"
    ],
    "snippets": [
      "Young Canadians say constant tip prompts, even at self-serve counters, are pushing them to question a culture they see as outdated and economically unfair.",
      "EDMONTON &#8212; Ren Alva is no stranger to leaving a good tip. The Edmonton university student believes in tipping service workers for a job well done, even leaving more during the holidays and after special events. But the 22-year-old from Bahrain was taken aback during a recent visit to a U-pick ",
      "EDMONTON — Ren Alva is no stranger to leaving a good tip. The Edmonton university student believes in tipping service workers for a job well done, even leaving more during the holidays and after special events. But the 22-year-old from Bahrain was taken aback during a recent visit to a U-pick berry "
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/08/7b21d45b4619aa3fb510fac4c108212c3d55e5d93809f53bfa26d917f0d38b5a.jpg?quality=65&strip=all",
    "titles": [
      "‘It’s ridiculous’: Why some Canadian youth feel ready to tap out of tipping culture",
      "‘It’s ridiculous’: Why some Canadian youth feel ready to tap out of tipping culture",
      "‘It’s ridiculous’: Why some Canadian youth feel ready to tap out of tipping culture"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.958,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 1.0
    },
    "score": 0.788,
    "summary": "Young Canadians, including Edmonton university student Ren Alva, are reevaluating the tipping culture due to frequent tip requests, even at self-service counters. Alva, who typically supports tipping, found it surprising to encounter tip prompts during a self-serve berry picking experience. This has sparked discussions among young people in Canada about the fairness and relevance of current tipping practices.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "U.S. Government Acquires 10% Stake in Intel Amid CEO Resignation Demand",
    "domain": "technology",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Fri, 22 Aug 2025 18:49:00 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "TechCrunch",
      "CNBC",
      "The Verge",
      "Ars Technica"
    ],
    "domains": [
      "news.google.com",
      "www.cnbc.com",
      "www.theverge.com",
      "techcrunch.com",
      "arstechnica.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMibkFVX3lxTE81Snd4SUZzUnZJdG1yMGpOb2hueS0zeGJsV0NjRmZNQlg1eGVUOWFPRkJUQk5jemJ3U25BakxBYWxibXZXUWpkMjJpTzJ2RjZPVVVjTUhNc3ZJZnVTdjFUeTE2MG9hZVVZZ0lYNkp3?oc=5\" target=\"_blank\">Trump: Intel agreed to sell 10% stake to U.S. government</a>&nbsp;&nbsp;<font c",
      "Commerce Secretary Howard Lutnick said that the U.S. government has taken a 10% stake in chipmaker Intel.",
      "The US is investing $8.9 billion into Intel, but most of the funds come from money that the government was supposed to pay the embattled chipmaker anyway. In an announcement on Friday, Intel said the federal government will fund its investment using the remaining $5.7 billion in grants it hasn’t yet",
      "Such federal government ownership of a major corporation would mark a dramatic departure from long-standing U.S. policy.",
      "Intel deal could pave the way for the US to profit off CHIPS Act funding."
    ],
    "image_url": "",
    "titles": [
      "Trump: Intel agreed to sell 10% stake to U.S. government - Axios",
      "U.S. government takes 10% stake in Intel, as Trump expands control over private sector",
      "US government takes 10 percent stake in Intel in exchange for money it was already on the hook for",
      "US government plans to take a 10% stake in Intel",
      "Trump says US will take 10% stake in Intel because CEO wants to “keep his job”"
    ],
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.628,
      "consensus": 0.995,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.775,
    "summary": "The U.S. government has taken an unprecedented 10% stake in chipmaker Intel, a move announced by President Trump and confirmed by both parties. This decision follows Trump's demand for Intel CEO Lip-Bu Tan to resign due to his connections with Chinese firms. The investment, totaling $8.9 billion, is part of a broader strategy to support the struggling chipmaker and is financed largely through previously allocated government grants. This development marks a significant shift in U.S. policy, as it is rare for the government to take ownership in private corporations. The deal was finalized after ",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: development, support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Shawn Kemp Sentenced to Home Monitoring for Shooting Incident",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sat, 23 Aug 2025 11:58:37 EST",
    "source": "ESPN",
    "sources": [
      "Yahoo Sports",
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.nbcsports.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Former NBA star Shawn Kemp was sentenced to 30 days of electronic home monitoring for shooting at two men inside a vehicle in a Washington state mall parking lot.",
      "Kemp was arrested in May following a shooting in Tacoma, Washington",
      "This stems from a 2023 shooting where nobody was injured."
    ],
    "image_url": "",
    "titles": [
      "Kemp sentenced to home monitoring for shooting",
      "Ex-NBA star Shawn Kemp sentenced to 30 days of electronic home monitoring following arrest for assault",
      "Former NBA star Shawn Kemp given 30 days of home monitoring for Washington parking lot shooting"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.997,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.761,
    "summary": "Former NBA player Shawn Kemp received a 30-day sentence for electronic home monitoring after shooting at two men in a vehicle in a Tacoma, Washington mall parking lot in 2023. Kemp was arrested in May following the incident. No injuries were reported from the shooting.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Judge Blocks Trump's Bid to Cut Funds to Sanctuary Cities",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sat, 23 Aug 2025 00:10:12 -0400",
    "source": "NPR",
    "sources": [
      "ABC News",
      "The Guardian",
      "NPR"
    ],
    "domains": [
      "abcnews.go.com",
      "www.npr.org",
      "www.theguardian.com"
    ],
    "snippets": [
      "A judge ruled the Trump administration cannot deny funding to Boston, Chicago, Los Angeles and 30 other cities and counties because of policies that limit cooperation with federal immigration efforts.",
      "A federal judge halted the Trump administration's efforts to withhold grant funding from \"sanctuary cities\" for not cooperating with immigration enforcement.",
      "<p>Cities that limit cooperation with immigration authorities had sued Trump administration over funding freeze</p><p>A federal judge has blocked the <a href=\"https://www.theguardian.com/us-news/trump-administration\">Trump administration</a> from cutting off federal funding to 34 “sanctuary cities” "
    ],
    "image_url": "",
    "titles": [
      "Judge blocks Trump from cutting funding over 'sanctuary' policies",
      "Trump blocked from withholding funding to 34 'sanctuary' cities and counties",
      "Judge blocks White House from defunding 34 municipalities over ‘sanctuary’ policies"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.779,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.735,
    "summary": "A federal judge has ruled against the Trump administration's attempt to withhold federal funding from 34 \"sanctuary cities,\" including Boston, Chicago, and Los Angeles. These cities, which limit their cooperation with federal immigration enforcement, had sued over the funding freeze. The judge's decision effectively halts the administration's efforts to penalize these jurisdictions for their immigration policies.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "2009-Born Dowman Joins Premier League Squad; Arsenal Adjusts After Win",
    "domain": "sports",
    "source_domain": "www.independent.co.uk",
    "location": "national",
    "published": "Sat, 23 Aug 2025 15:41:50 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Sky Sports",
      "Yahoo Sports",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.skysports.com",
      "www.independent.co.uk"
    ],
    "snippets": [
      "Born in 2009, Dowman is included in a Premier League squad for the first time",
      "<ul><li><p>Premier League updates from 5.30pm BST</p></li><li><p>Send your thoughts to <a href=\"mailto:scott.murray.casual@theguardian.com\">Scott via email</a></p></li></ul><p><strong>Arsenal make two changes to their starting XI after the 1-0 win at Manchester United.</strong> Jurriën Timber replac",
      "Arsenal manager Mikel Arteta has reiterated his desire to \"dig for gold\" this season in the Premier League and feels the club are ready to go to the next level."
    ],
    "image_url": "",
    "titles": [
      "Arsenal name Max Dowman, 15, on bench for Premier League match",
      "Arsenal v Leeds: Premier League – live",
      "Arteta on his desire to dig for Premier League gold with Arsenal"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.991,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.735,
    "summary": "In a recent Premier League update, a player born in 2009, Dowman, was included in a Premier League squad for the first time. Arsenal made two changes to their starting XI following a 1-0 win at Manchester United, with specific player adjustments not detailed. Arsenal's manager, Mikel Arteta, expressed his ambition to excel this season, aiming to \"dig for gold\" and elevate the club to the next level.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Canada Offers Support for Peace in Ukraine Amid US-Russia Talks",
    "domain": "general",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sat, 23 Aug 2025 13:30:52 +0000",
    "source": "Global News",
    "sources": [
      "CityNews",
      "Global News"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "globalnews.ca"
    ],
    "snippets": [
      "Canada signals readiness to support Ukraine peace efforts as Trump hosts Putin and Zelenskyy for talks aiming to end the decade-long conflict.",
      "OTTAWA — Ottawa is watching closely as U.S. President Donald Trump attempts to play peacemaker in the war in Ukraine. Canada has volunteered to play a role in helping maintain peace in Ukraine, if a ceasefire deal can be reached between Russian President Vladimir Putin and Ukrainian President Volody"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/08/b55b785e1dc02de6acee72f7b2b94a1bbf020d7958d577a28e8ad95b25f49f60.jpg?quality=65&strip=all",
    "titles": [
      "Contributing to war and peace: Canada’s role in Ukraine explained",
      "Contributing to war and peace: Canada’s role in Ukraine explained"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.947,
      "consensus": 0.591,
      "constructiveness": 0.2,
      "proximity": 1.0
    },
    "score": 0.728,
    "summary": "Canada has expressed willingness to support peace efforts in Ukraine amid talks hosted by U.S. President Donald Trump with Russian President Vladimir Putin and Ukrainian President Volodymyr Zelenskyy. The discussions aim to resolve the decade-long conflict. Ottawa is prepared to assist in maintaining peace if a ceasefire agreement is achieved.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: effort, support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Lyle Menendez Denied Parole in First Hearing After 1989 Parents' Murder",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sat, 23 Aug 2025 07:35:10 +0000",
    "source": "Al Jazeera",
    "sources": [
      "LA Times",
      "Deutsche Welle",
      "Al Jazeera"
    ],
    "domains": [
      "www.latimes.com",
      "www.aljazeera.com",
      "www.dw.com"
    ],
    "snippets": [
      "His brother Erik was also denied parole on Thursday for the 1989 shotgun killing of their parents in Beverly Hills.",
      "The Menendez brothers were convicted and jailed in the 1989 for murdering their parents in Los Angeles.",
      "<p>A day after denying release for his younger brother, Erik, a California Parole Board ruled that Lyle Menendez should also remain in prison for gunning down his parents with a shotgun in 1989.</p>"
    ],
    "image_url": "",
    "titles": [
      "Lyle Menendez denied parole decades after murder of parents",
      "Lyle Menendez denied parole a day after brother Erik",
      "Lyle Menendez denied parole, will remain in prison along with younger brother Erik"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.837,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.704,
    "summary": "Lyle Menendez was denied parole at his first-ever hearing on Friday, following a decision a day prior against his brother, Erik. Both were convicted for the 1989 murder of their parents in their Beverly Hills mansion. The parole board's decision comes after examining Lyle's prison violations and the details of the case during a hearing that lasted over 10 hours.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "HIV Advocates Decry Canada's Delay in Reforming Disclosure Laws",
    "domain": "general",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sat, 23 Aug 2025 13:58:21 +0000",
    "source": "Global News",
    "sources": [
      "CityNews",
      "Global News"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "globalnews.ca"
    ],
    "snippets": [
      "HIV advocates say Ottawa’s delay in reforming disclosure laws is fuelling stigma and fear, nearly a decade after the Liberals first pledged change.",
      "OTTAWA — HIV activists say there is mounting frustration in communities affected by the virus, amid near-silence from the federal government nearly 10 years after the Liberals pledged to reform laws surrounding HIV disclosure. &#8220;We&#8217;re coming up on a decade,&#8221; said Muluba Habanyama, h"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/08/8de0bb5d315e8069e7f586507122511e4621b33c1c7c98f5c01d655b908928a7.jpg?quality=65&strip=all",
    "titles": [
      "Advocates against HIV criminalization decry Carney silence on reform Trudeau promised",
      "Advocates against HIV criminalization decry Carney silence on reform Trudeau promised"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.956,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.696,
    "summary": "HIV advocates express growing frustration over the Canadian federal government's delay in reforming HIV disclosure laws, a promise made by the Liberals nearly a decade ago. The lack of action is said to be increasing stigma and fear among communities affected by HIV, with activists like Muluba Habanyama highlighting the prolonged silence and inaction as the ten-year mark approaches.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Johnny Walker Secures Comeback KO Victory Over Zhang at UFC Shanghai",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sat, 23 Aug 2025 11:58:37 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Johnny Walker ended a skid of two straight knockout losses by scoring a shocking knockout of his own in a comeback win against Chinese light heavyweight Zhang Mingyang in the main event of UFC Fight Night in Shanghai.",
      "<p>Zhang Mingyang is looking for his fourth consecutive win to start his UFC career as he enters his first main event, taking on tough 14-fight UFC veteran Johnny Walker.</p>"
    ],
    "image_url": "",
    "titles": [
      "Walker tops Zhang at UFC Fight Night in Shanghai",
      "UFC Fight Night: Walker vs. Zhang official results"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.997,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.686,
    "summary": "Johnny Walker rebounded from two consecutive knockout losses by securing a comeback victory with a knockout against Zhang Mingyang at UFC Fight Night in Shanghai. This fight marked Zhang Mingyang's first main event in the UFC, where he was aiming for his fourth straight win since joining the league. Walker, a veteran with 14 UFC fights, successfully halted Zhang's winning streak.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Administration Halts New England Offshore Wind Farm Construction",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sat, 23 Aug 2025 11:38:19 -0400",
    "source": "NPR",
    "sources": [
      "Axios",
      "NPR"
    ],
    "domains": [
      "www.npr.org",
      "news.google.com"
    ],
    "snippets": [
      "The Revolution Wind farm was slated to start sending power to homes and businesses in Rhode Island and Connecticut starting next year.",
      "<a href=\"https://news.google.com/rss/articles/CBMic0FVX3lxTE5UZTNVZFVTNnJHZFFLbkw2SjRNZXlIU3VfWlZUUkFLVTFXTFBGVE5IS1Q4eFU5dmZEbjlXelhuYWhnMW5DQVU5dmRMSDZKNFU5NV9oMWV0SExNeVpreVQ0WHJPNTBJMGozMktUbVJ0VVVCdW8?oc=5\" target=\"_blank\">Trump administration halts work on New England offshore wind project</a>"
    ],
    "image_url": "",
    "titles": [
      "Trump administration halts work on an almost-finished wind farm",
      "Trump administration halts work on New England offshore wind project - Axios"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.99,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.685,
    "summary": "The Trump administration has stopped the construction of an offshore wind farm in New England by Orsted A/S. The project, off the coast of Rhode Island, has been put on hold.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Pirates' Bubba Chandler Shines in MLB Debut with Four Scoreless Innings",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sat, 23 Aug 2025 11:58:37 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Pirates rookie Bubba Chandler, considered the top pitching prospect in baseball, became the first pitcher to throw four scoreless innings and record a save in his major league debut.",
      "<p>Bubba Chandler didn&#8217;t disappoint in his major league debut for the Pittsburgh Pirates.</p>"
    ],
    "image_url": "",
    "titles": [
      "Top prospect Chandler debuts with 4-inning save",
      "Top pitching prospect Bubba Chandler shines in Pirates debut vs. Rockies"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.997,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.679,
    "summary": "Pirates rookie Bubba Chandler, a highly regarded pitching prospect, made an impressive major league debut by pitching four scoreless innings and securing a save. Chandler's performance for the Pittsburgh Pirates was notable, marking a successful start to his career in the MLB.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Kilauea Volcano Erupts in Hawaii, Launching Lava 100 Feet High",
    "domain": "science",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sat, 23 Aug 2025 09:36:49 -0400",
    "source": "NPR",
    "sources": [
      "Phys.org",
      "NPR"
    ],
    "domains": [
      "phys.org",
      "www.npr.org"
    ],
    "snippets": [
      "Hawaii's Kilauea volcano resumed erupting Friday by shooting an arc of lava 100 feet into the air and across a section of its summit crater floor.",
      "Hawaii's Kilauea volcano resumed erupting Friday by shooting an arc of lava 100 feet (30 meters) into the air and across a section of its summit crater floor."
    ],
    "image_url": "",
    "titles": [
      "Hawaii's Kilauea volcano erupts again and shoots lava for 31st time since December",
      "Kilauea's eruption is back as the Hawaii volcano shoots lava for the 31st time since December"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.949,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.677,
    "summary": "Hawaii's Kilauea volcano resumed erupting on Friday, shooting a 100-foot arc of lava into the air and across its summit crater floor. The eruption marked a return to activity for the volcano, which had been dormant for two years. Authorities are monitoring the situation closely to ensure the safety of residents and visitors in the area.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Experts Predict Group of Six Team in 2025 CFP; Release Week 0 Best Bets",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sat, 23 Aug 2025 09:41:41 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Find out which teams our reporters picked for the College Football Playoff ahead of the 2025 season.",
      "Our college football experts rank the top 100 ahead of the 2025 season.",
      "SportsLine's model has revealed its 2025 Week 0 college football picks for Kansas State vs. Iowa State and every other game"
    ],
    "image_url": "",
    "titles": [
      "2025 preseason College Football Playoff predictions",
      "💯 Ranking the top 100 college football players",
      "College football odds, picks, lines, predictions: Computer locks in Week 0 best bets for Aug. 23, 2025"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.951,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.67,
    "summary": "Ahead of the 2025 College Football Playoff (CFP) season, reporters have made their team predictions, indicating that at least one Group of Six team is expected to qualify. Additionally, SportsLine's Projection Model and CBS Sports experts have released their best bets for Friday's major games, including specific picks for the Week 0 matchup between Kansas State and Iowa State, among other games.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Edmonton Elks Beat Ottawa Redblacks 30-20 for Third Straight Win",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sat, 23 Aug 2025 04:16:29 +0000",
    "source": "Global News",
    "sources": [
      "Sportsnet",
      "Global News"
    ],
    "domains": [
      "globalnews.ca",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "The Edmonton Elks rolled to their third straight win, taking advantage of yet another sluggish start by the Ottawa Redblacks, to leave the nation’s capital with a 30-20 victory Friday night. With Ottawa (3-8) mounting a comeback, Edmonton quarterback Cody Fajardo, who finished 22-for-28 for 270 yard",
      "<p>The Edmonton Elks rolled to their third straight win, taking advantage of yet another sluggish start by the Ottawa Redblacks, to leave the nation’s capital with a 30-20 victory Friday night.</p>"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/08/Elks-Aug-22.jpg?quality=65&strip=all",
    "titles": [
      "Visiting Elks win third straight with 30-20 victory over Redblacks",
      "Visiting Elks defeat Redblacks to earn third straight with"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.781,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.668,
    "summary": "The Edmonton Elks secured their third consecutive win with a 30-20 victory over the Ottawa Redblacks. Despite a late comeback attempt by Ottawa, Edmonton's quarterback Cody Fajardo led his team to victory, completing 22 of 28 passes for 270 yards. This match highlighted Ottawa's sluggish start, contributing to their 3-8 record.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "8 Dead from Malnutrition in Gaza Amid Famine, WHO Calls for Aid",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sat, 23 Aug 2025 14:23:17 +0000",
    "source": "Al Jazeera",
    "sources": [
      "The Guardian",
      "Al Jazeera"
    ],
    "domains": [
      "www.theguardian.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Health authorities say eight more people, including two children, die from malnutrition after famine declared in Gaza.",
      "<p>This blog is now closed, you can read more on this story <a href=\"https://www.theguardian.com/world/2025/aug/23/very-sick-and-very-tired-the-reality-of-famine-for-gazas-most-vulnerable\">here</a></p><p>The head of the <strong>World Health Organization (WHO)</strong> has called for an urgent scale-"
    ],
    "image_url": "",
    "titles": [
      "Israeli attacks kill 51 in Gaza as more Palestinians die from starvation",
      "More Palestinians die of starvation as famine spreads in Gaza – as it happened"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.964,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.665,
    "summary": "Eight individuals, including two children, have died due to malnutrition in Gaza following the declaration of famine in the region. The World Health Organization (WHO) has urgently called for increased aid efforts to address the crisis. Further details on the situation can be found in ongoing coverage.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "I'm sorry, but I didn't receive a summary from you. Could you please provide one",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Fri, 22 Aug 2025 17:10:29 GMT",
    "source": "Axios",
    "sources": [
      "ABC News",
      "Axios",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "abcnews.go.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMijgFBVV95cUxOOFNfbzZXa19VV3cyUVR0UFFQR0JpcEVFTERWeWhLMmRvQmU2cC1sU2pGZWh0SXJnYWtjazYwTFRWRmQteV9nbkU1MVZWeE5ZMk9Yekl6R0pJcUUtNTFfTVhIX2cwSG5rS3JTNVA4MEN3UFlhYTlVUVhkc2tLWm9Id0hCY0JqdUZScXdzZlVn?oc=5\" target=\"_blank\">FBI raids former National Security ",
      "ABC News’ Katherine Faulders says the search stems from federal prosecutors’ belief that Bolton could have classified information in his possession..",
      "FBI Director Kash Patel tweeted “NO ONE is above the law… @FBI agents on mission\" as agents searched the home of ex-Trump advisor John Bolton in Maryland."
    ],
    "image_url": "",
    "titles": [
      "FBI raids former National Security Adviser John Bolton's home: Reports - Axios",
      "WATCH:  FBI searches home of former Trump admin. national security adviser John Bolton",
      "FBI raids home, office of John Bolton, former Trump national security advisor"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.607,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.658,
    "summary": "",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "U.S. Ends Low-Value Package Tariff Exemption, Pauses Some Shipments",
    "domain": "business",
    "source_domain": "financialpost.com",
    "location": "national",
    "published": "Sat, 23 Aug 2025 14:42:34 +0000",
    "source": "Financial Post",
    "sources": [
      "CityNews",
      "Financial Post"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "financialpost.com"
    ],
    "snippets": [
      "ATHENS, Greece (AP) &#8212; The end of an exemption on tariff duties for low-value packages coming into the United States is causing a wide array of postal services to pause shipping as they await for more clarity on the rule. The exemption, known as the &#8221; de minimis &#8221; exemption, allows ",
      "ATHENS, Greece (AP) — The end of an exemption on tariff duties for low-value packages coming into the United States is causing a wide array of postal services to pause shipping as they await for more clarity on the rule. The exemption, known as the “ de minimis &#8221; exemption, allows packages wor"
    ],
    "image_url": "",
    "titles": [
      "European postal services suspend shipment of packages to US over import tariffs",
      "European postal services suspend shipment of packages to US over import tariffs"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.971,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.656,
    "summary": "The U.S. has ended an exemption on tariff duties for low-value packages, leading to a pause in shipping by various postal services seeking clarity on the new rule. This exemption, known as the \"de minimis\" exemption, previously allowed for simpler importation of low-value items.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Ethical Diamond Wins Sky Bet Ebor; Mullins Secures Third Victory",
    "domain": "sports",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Sat, 23 Aug 2025 15:32:26 GMT",
    "source": "The Guardian",
    "sources": [
      "Sky Sports",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.skysports.com"
    ],
    "snippets": [
      "<ul><li><p>5-1 favourite claims Europe’s richest Flat handicap</p></li><li><p>Andrew Balding completes £500,000 double at York</p></li></ul><p>It paid to follow the money in the Ebor as the 5-1 favourite, Ethical Diamond, one of two runners in the field from the Willie Mullins yard, replaced his sta",
      "Ethical Diamond provided all-conquering trainer Willie Mullins with a third victory in the Sky Bet Ebor at York."
    ],
    "image_url": "https://i.guim.co.uk/img/media/141e081802534d43c3c617b470c962dc13ea705f/391_0_3620_2896/master/3620.jpg?width=140&quality=85&auto=format&fit=max&s=dba717c5d8e11c9ae92079bcd1ba2b3a",
    "titles": [
      "Ethical Diamond shines bright to hand William Buick a first success in the Ebor",
      "Ethical Diamond shines in Ebor for Buick and Mullins"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.967,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.648,
    "summary": "Ethical Diamond, the 5-1 favourite, won Europe's richest Flat handicap, the Sky Bet Ebor at York, marking trainer Willie Mullins' third victory in this event. Additionally, trainer Andrew Balding secured a £500,000 double at York. Ethical Diamond was one of two runners from the Mullins yard in the race, showcasing the yard's strength and strategy in securing top honors in major racing competitions.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Hall of Fame Jockey Ron Turcotte Dies at 84",
    "domain": "business",
    "source_domain": "fortune.com",
    "location": "global",
    "published": "Sat, 23 Aug 2025 11:43:49 +0000",
    "source": "Fortune",
    "sources": [
      "Sportsnet",
      "Fortune"
    ],
    "domains": [
      "fortune.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "“The world may remember Ron as the famous jockey of Secretariat, but to us he was a wonderful husband, a loving father, grandfather, and a great horseman.” the family said.",
      "<p>Hall of Fame jockey Ron Turcotte, who rode Secretariat to the Triple Crown in 1973, has died. He was 84.</p>"
    ],
    "image_url": "https://fortune.com/img-assets/wp-content/uploads/2025/08/GettyImages-1389868189-e1755949304664.jpg?w=2048",
    "titles": [
      "Hall of fame jockey Ron Turcotte, the man who rode Secretariat to the Triple Crown, dies at 84",
      "Canada’s Ron Turcotte,  jockey who rode Secretariat to Triple Crown, dead at 84"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.912,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.637,
    "summary": "Ron Turcotte, the Hall of Fame jockey famous for riding Secretariat to a Triple Crown victory in 1973, has passed away at the age of 84. Over his career, Turcotte achieved more than 3,000 race wins, with his most notable achievement being his partnership with the legendary racehorse Secretariat.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Texas GOP Passes Electoral Map, Democrats Plan Court Challenge",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sat, 23 Aug 2025 08:32:50 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Forbes"
    ],
    "domains": [
      "www.forbes.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Governor Greg Abbott is expected to quickly sign it into law, though Democrats have vowed to challenge it in court.",
      "Texas Republicans passed the map early on Saturday morning after a failed filibuster attempt from Democrats."
    ],
    "image_url": "",
    "titles": [
      "Texas Senate approves redrawn congressional map favouring Republicans",
      "Texas Senate Passes New Congressional Map, Sending Bill To Abbott’s Desk"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.854,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.626,
    "summary": "Texas Republicans successfully passed a new electoral map after Democrats' filibuster failed. Governor Greg Abbott is likely to sign it into law soon, despite Democrats planning to challenge it in court.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Meta Partners with Midjourney for AI Image Tech Licensing",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-08-22T17:07:04-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge",
      "TechCrunch"
    ],
    "domains": [
      "www.theverge.com",
      "techcrunch.com"
    ],
    "snippets": [
      "Meta is partnering with Midjourney to “license their aesthetic technology” for use in its own models and products, Meta’s new chief AI officer, Alexandr Wang, announced on Friday. The partnership involves a “technical collaboration between our research teams,” Wang said, suggesting the deal involves",
      "Meta's chief AI officer said that the company is partnering with Midjourney to license its AI image and video model technology."
    ],
    "image_url": "",
    "titles": [
      "Meta is going to stuff Midjourney AI images into your feed",
      "Meta partners with Midjourney on AI image and video models"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.673,
      "consensus": 0.591,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.617,
    "summary": "Meta has entered into a partnership with Midjourney to license the latter's AI image and video model technology. Announced by Meta's new Chief AI Officer, Alexandr Wang, the collaboration will include a technical exchange between the companies' research teams, aiming to integrate Midjourney's aesthetic technology into Meta's products and models.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: collaboration, research",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Taiwan Nuclear Plant Restart Referendum Fails Amid Low Turnout",
    "domain": "business",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-08-22T16:13:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "Financial Post"
    ],
    "domains": [
      "financialpost.com",
      "www.dw.com"
    ],
    "snippets": [
      "Taiwan's vote on restarting its last nuclear plant highlights the island's struggle to balance energy security, environmental risks and geopolitical threats. DW unpacks the stakes behind the referendum.",
      "A referendum to restart a Taiwan nuclear plant failed due to poor voter turnout, dealing a blow to attempts by some groups to revive atomic power after the government shut all reactors."
    ],
    "image_url": "",
    "titles": [
      "Taiwan's nuclear referendum reveals energy dilemma",
      "Taiwan Referendum to Restart Nuclear Power Plant Fails"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.608,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.594,
    "summary": "A referendum in Taiwan to restart its last nuclear plant failed due to low voter turnout. This decision underscores the ongoing debate in Taiwan regarding energy security, environmental risks, and geopolitical threats. The failure to pass the referendum halts efforts by certain groups to revive nuclear power after the government had previously shut down all reactors.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Bluesky Blocks Mississippi Access Over New Age Verification Law",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-08-22T17:09:14-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge",
      "TechCrunch"
    ],
    "domains": [
      "www.theverge.com",
      "techcrunch.com"
    ],
    "snippets": [
      "Bluesky will block access from Mississippi IP addresses in response to a new state law requiring age verification and parental consent for underage users. The decision, outlined in a blog post, will stand until courts decide the fate of the law. “Mississippi&#8217;s approach would fundamentally chan",
      "In a blog post published on Friday, the company explains that, as a small team, it doesn't have the resources to make the substantial technical changes this type of law would require, and it raised concerns about the law's broad scope and privacy implications."
    ],
    "image_url": "",
    "titles": [
      "Bluesky blocks Mississippi under new age verification law",
      "Bluesky blocks service in Mississippi over age assurance law"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.673,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.59,
    "summary": "Bluesky announced it will block access from Mississippi due to a new law requiring age verification and parental consent for underage users. The company, citing limited resources and concerns over privacy and the law's broad scope, stated the block will remain until the law's fate is decided by courts. This decision was shared in a blog post, highlighting the challenges small teams face in adapting to such legal requirements.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]