[
  {
    "title": "Trump Admin Appeals to Supreme Court on National Guard Deployment in Chicago",
    "domain": "business",
    "source_domain": "npr.org",
    "location": "national",
    "published": "Fri, 17 Oct 2025 18:19:44 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "Deutsche Welle",
      "ABC News",
      "The Guardian",
      "LA Times",
      "Forbes",
      "CityNews"
    ],
    "domains": [
      "npr.org",
      "dw.com",
      "abcnews.go.com",
      "theguardian.com",
      "latimes.com",
      "forbes.com",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "The Trump administration filed an appeal to the Supreme Court on Friday, asking it to lift lower-court rulings blocking Trump from deploying National Guard troops in Illinois.",
      "The Trump administration has asked the Supreme Court to allow it to send National Guard troops to the Chicago area, after a federal appeals court ruled against its effort to do so.",
      "The Trump administration filed an emergency stay request Friday with the Supreme Court to undo a lower court order over the deployment of the National Guard in Chicago.",
      "Justice department submits emergency filing as Trump pushes to expand use of military in Democratic-led cities The Trump administration on Friday asked the US supreme court to permit the deployment of national guard troops to Illinois, as the president pushes to expand the domestic use of the milita",
      "Trump's lawyers say the National Guard is needed to protect immigration agents",
      "A lower court judge issued an Oct. 9 order blocking the deployment of the National Guard in Illinois for at least two weeks.",
      "WASHINGTON (AP) — The Trump administration on Friday asked the Supreme Court to allow the deployment of National Guard troops in the Chicago area, escalating President Donald Trump’s conflict with Democratic governors over using the military on U.S. soil. The emergency appeal to the high court came"
    ],
    "image_url": "",
    "titles": [
      "Trump administration asks Supreme Court to allow National Guard deployment in Illinois",
      "Trump asks Supreme Court to allow Chicago troop deployment",
      "Trump administration asks Supreme Court to OK National Guard deployment in Illinois",
      "Trump administration asks supreme court to permit national guard troops in Illinois",
      "Trump's lawyers ask the Supreme Court to uphold using the National Guard in Chicago",
      "Trump Asks Supreme Court To Allow National Guard Deployment To Illinois",
      "Trump administration asks Supreme Court to allow deployment of National Guard in Chicago area"
    ],
    "url": "https://www.npr.org/2025/10/17/nx-s1-5578266/trump-supreme-court-national-guard-illinois",
    "alternate_urls": [
      "https://www.dw.com/en/trump-asks-supreme-court-to-allow-chicago-troop-deployment/a-74407602?maca=en-rss-en-top-1022-rdf",
      "https://abcnews.go.com/Politics/trump-administration-asks-supreme-court-national-guard-deployment/story?id=126630415",
      "https://www.theguardian.com/us-news/2025/oct/17/trump-supreme-court-national-guard-illinois",
      "https://www.latimes.com/politics/story/2025-10-17/trumps-lawyers-ask-the-supreme-court-to-uphold-using-national-guard-in-chicago",
      "https://www.forbes.com/sites/antoniopequenoiv/2025/10/17/trump-asks-supreme-court-to-allow-national-guard-deployment-to-illinois/",
      "https://ottawa.citynews.ca/2025/10/17/trump-administration-asks-supreme-court-to-allow-deployment-of-national-guard-in-chicago-area/"
    ],
    "link": "https://www.npr.org/2025/10/17/nx-s1-5578266/trump-supreme-court-national-guard-illinois",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.96,
      "consensus": 1.0,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.877,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Trump administration has appealed to the Supreme Court to overturn lower-court decisions that prevent the deployment of National Guard troops in the Chicago area, Illinois. This move comes after a federal appeals court ruled against the administration's efforts, and a judge issued an order on October 9 blocking the deployment for at least two weeks. The administration argues that the National Guard is needed to protect immigration agents, escalating tensions with Democratic-led cities over the use of military on U.S. soil.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Commutes Ex-Rep. George Santos's Sentence for Fraud, Identity Theft",
    "domain": "business",
    "source_domain": "npr.org",
    "location": "national",
    "published": "Fri, 17 Oct 2025 19:37:55 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "Axios",
      "ABC News",
      "CNBC",
      "The Guardian",
      "Global News",
      "Bloomberg",
      "Fortune",
      "CityNews"
    ],
    "domains": [
      "npr.org",
      "news.google.com",
      "abcnews.go.com",
      "cnbc.com",
      "theguardian.com",
      "globalnews.ca",
      "fortune.com",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "The disgraced New York Republican was sentenced to more than seven years in prison after pleading guilty to a litany of federal charges, including wire fraud and identity theft.",
      "Trump releases former Rep. George Santos from prison sentence Axios",
      "Santos was sentenced to more than seven years in federal prison earlier this year after being convicted of wire fraud and aggravated identity theft.",
      "Trump said he began thinking about Santos after being reminded of a controversy about Democratic Sen. Richard Blumenthal's military service claims.",
      "Former Republican US representative was sentenced in April after admitting to deceiving donors and stealing identities of 11 people Donald Trump announced on Friday he had commuted the sentence of George Santos, the disgraced former New York representative and serial fabulist who had been sentenced",
      "The New York Republican was sentenced in April after admitting last year to deceiving donors and stealing the identities of 11 people to make donations to his campaign.",
      "Trump Commutes Sentence of Former GOP Lawmaker George Santos Bloomberg.com",
      "“George Santos was somewhat of a ‘rogue,’ but there are many rogues throughout our Country that aren’t forced to serve seven years in prison.\"",
      "NEW YORK (AP) — President Donald Trump said Friday he had commuted the sentence of former U.S. Rep. George Santos, who is serving more than seven years in federal prison after pleading guilty to fraud and identity theft charges. The New York Republican was sentenced in April after admitting last yea"
    ],
    "image_url": "",
    "titles": [
      "President Trump commutes the prison sentence of George Santos",
      "Trump releases former Rep. George Santos from prison sentence - Axios",
      "George Santos' prison sentence commuted, to be released 'immediately': Trump",
      "Trump commutes prison sentence of ex-GOP Rep. George Santos",
      "Trump says he has commuted sentence of George Santos in federal fraud case",
      "Trump commutes ex-GOP congressman George Santos’ 7-year prison sentence",
      "Trump Commutes Sentence of Former GOP Lawmaker George Santos - Bloomberg.com",
      "Trump commutes sentence of former Rep. George Santos, who was serving 7 years for fraud and identity theft",
      "Trump says he has commuted sentence of former US Rep. George Santos in federal fraud case"
    ],
    "url": "https://www.npr.org/2025/10/17/nx-s1-5578304/trump-george-santos-prison-sentence-commuted",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMie0FVX3lxTE56ekNHQVBXLXVnWEZCUzhrMXJtR0ZuSTZBbmtRbUw0UFB1bkJ3V2dhUWtTQ0QwUDlLaTN2eFAxdkdMNmgwNmQzeUxReWQ3VWRWY3gzcEFVMm8wdVZSVlRpeEhFeFVvZEVUdVJDUTVpSU5mWUw0MXRnWjQ2NA?oc=5",
      "https://abcnews.go.com/US/george-santos-prison-sentence-commuted-released-immediately-trump/story?id=126633000",
      "https://www.cnbc.com/2025/10/17/trump-george-santos-prison-commutation.html",
      "https://www.theguardian.com/us-news/2025/oct/17/trump-commuted-sentence-george-santos",
      "https://globalnews.ca/news/11483569/george-santos-donald-trump-commutes-prison-sentence/",
      "https://news.google.com/rss/articles/CBMisAFBVV95cUxORFhBVi1MQmVlMUpPWE5YR0ZKeTI0UFJ5cFBfalhHWmw2T3NsRng3WE56NEhHdzByQmhvSU1uaHFzYmNNd2tRMmphR2lRRzlfbmVHSHRCcGZVb2VYaFk1SDQ1eVJKMl81b2pDMDRKNVBJZU5KRWszS2lCcWt3akgxV0Q1ZjFHenRfWGxkOFJfR0s0TEVPUHloUS1tS1I3QmQ4RU96T2Vqam5tT3VWaExrYw?oc=5",
      "https://fortune.com/2025/10/17/trump-commutes-sentence-former-rep-george-santos-7-years-fraud-identity-theft/",
      "https://ottawa.citynews.ca/2025/10/17/trump-says-he-has-commuted-sentence-of-former-us-rep-george-santos-in-federal-fraud-case/"
    ],
    "link": "https://www.npr.org/2025/10/17/nx-s1-5578304/trump-george-santos-prison-sentence-commuted",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.987,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.872,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Former New York Republican Rep. George Santos, who was sentenced to over seven years in prison for wire fraud and identity theft, has had his sentence commuted by Donald Trump. Santos admitted to deceiving donors and stealing the identities of 11 people for campaign donations. Trump's decision to commute Santos's sentence was influenced by comparisons to controversies involving other politicians.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Prince Andrew Relinquishes Duke of York Title Amid Epstein Ties Controversy",
    "domain": "business",
    "source_domain": "npr.org",
    "location": "national",
    "published": "Fri, 17 Oct 2025 15:48:31 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "BBC",
      "Al Jazeera",
      "Deutsche Welle",
      "Forbes",
      "Business Insider",
      "The Guardian"
    ],
    "domains": [
      "npr.org",
      "bbc.com",
      "aljazeera.com",
      "dw.com",
      "forbes.com",
      "businessinsider.com",
      "theguardian.com"
    ],
    "snippets": [
      "Prince Andrew has agreed with King Charles to stop using his Duke of York title, as scrutiny over his past connection to Jeffrey Epstein persists.",
      "The prince said he had made the decision because \"continued accusations about me distract from the work\" of the Royal Family.",
      "He remains a prince but has given up the title of Duke of York among others.",
      "Prince Andrew’s reputation has suffered in recent years, mainly due to his ties to US sex offender Jeffrey Epstein.",
      "The brother of King Charles III says he will give up using his Duke of York title and other honors amid renewed scrutiny of his ties to Jeffrey Epstein. Buckingham Palace said the move aims to end distractions.",
      "Andrew did not explicitly mention his alleged ties to late sex offender Jeffrey Epstein in a statement Friday, but noted he denies “the accusations against me.”",
      "Prince Andrew gave up his Duke of York title after talking with his brother King Charles. He says accusations against him are proving distracting.",
      "Buckingham Palace said to be at ‘tipping point’ over headlines about prince’s links to Jeffrey Epstein and Chinese official King Charles is considering stripping Prince Andrew of his title of Duke of York after a string of allegations, the Guardian understands. Buckingham Palace has reportedly reach"
    ],
    "image_url": "",
    "titles": [
      "Prince Andrew drops Duke of York title as Epstein fallout continues",
      "Prince Andrew gives up his title as Duke of York",
      "Who is Prince Andrew? The royal who has given up his titles",
      "Britain’s Prince Andrew gives up royal title amid Epstein allegations",
      "Prince Andrew sheds title as Epstein scrutiny grows",
      "Prince Andrew Gives Up Royal Titles After Persistent Scrutiny Around Epstein",
      "Prince Andrew gives up his royal titles as controversy swirls around his relationship with Jeffrey Epstein",
      "King Charles ‘considering stripping Prince Andrew of Duke of York title’"
    ],
    "url": "https://www.npr.org/2025/10/17/nx-s1-5578209/prince-andrew-drops-duke-of-york-title-as-epstein-fallout-continues",
    "alternate_urls": [
      "https://www.bbc.com/news/articles/cgqlyw9g7weo?at_medium=RSS&at_campaign=rss",
      "https://www.bbc.com/news/articles/c4g7zn96nevo?at_medium=RSS&at_campaign=rss",
      "https://www.aljazeera.com/news/2025/10/17/the-uks-prince-andrew-gives-up-royal-title-amid-epstein-allegations?traffic_source=rss",
      "https://www.dw.com/en/prince-andrew-sheds-title-as-epstein-scrutiny-grows/a-74407374?maca=en-rss-en-top-1022-rdf",
      "https://www.forbes.com/sites/antoniopequenoiv/2025/10/17/prince-andrew-gives-up-royal-titles-following-scrutiny-around-epstein-connections/",
      "https://www.businessinsider.com/prince-andrew-royal-titles-jeffrey-epstein-controversy-china-spy-2025-10",
      "https://www.theguardian.com/uk-news/2025/oct/17/prince-andrew-duke-of-york-removal-of-titles-king-charles-prince-william-monarchy"
    ],
    "link": "https://www.npr.org/2025/10/17/nx-s1-5578209/prince-andrew-drops-duke-of-york-title-as-epstein-fallout-continues",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.911,
      "consensus": 1.0,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.867,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Prince Andrew has decided to relinquish his Duke of York title and other honors after discussions with King Charles III, amid ongoing scrutiny over his association with Jeffrey Epstein. He stated the decision was made to prevent distractions from the Royal Family's work. Although he denies the accusations against him, his reputation has been impacted by his ties to the convicted sex offender. Buckingham Palace supports the move, aiming to shift focus away from the controversy. Andrew remains a prince but will no longer use his Duke of York title.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "OpenAI Limits AI Videos of MLK on Sora App After Estate Complaints",
    "domain": "business",
    "source_domain": "npr.org",
    "location": "national",
    "published": "Fri, 17 Oct 2025 14:39:47 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "CNBC",
      "New York Times",
      "Fortune"
    ],
    "domains": [
      "npr.org",
      "cnbc.com",
      "nytimes.com",
      "fortune.com"
    ],
    "snippets": [
      "OpenAI is preventing people from making AI videos of King on its Sora app after the estate of the civil rights leader complained about the spread of offensive and vulgar portrayals.",
      "The ChatGPT maker said it will work to toughen \"guardrails\" for historical figures and that public figures can ask to not appear in Sora videos.",
      "People have used its Sora video app to create vulgar and sometimes racist depictions of the civil rights leader.",
      "“For me, many of the AI depictions never rose to the level of free speech,” Bernice A. King wrote on X. “They were foolishness.”"
    ],
    "image_url": "",
    "titles": [
      "OpenAI blocks MLK Jr. videos on Sora after 'disrespectful depictions'",
      "OpenAI stops Sora videos of Martin Luther King Jr. after users made 'disrespectful' deepfakes",
      "OpenAI Blocks Videos of Martin Luther King Jr. After Racist Depictions",
      "OpenAI pauses AI-generated deepfakes of Martin Luther King Jr. on Sora 2 app after ‘disrespectful’ depictions"
    ],
    "url": "https://www.npr.org/2025/10/17/nx-s1-5577869/sora-block-videos-mlk",
    "alternate_urls": [
      "https://www.cnbc.com/2025/10/17/open-ai-sora-mlk-jr-disrespectful-deepfakes.html",
      "https://www.nytimes.com/2025/10/17/business/openai-sora-video-martin-luther-king-jr.html",
      "https://fortune.com/2025/10/17/openai-sora-martin-luther-king-deepfakes-foolishness-direspectful/"
    ],
    "link": "https://www.npr.org/2025/10/17/nx-s1-5577869/sora-block-videos-mlk",
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.89,
      "consensus": 0.908,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.809,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "OpenAI has restricted the creation of AI videos featuring Martin Luther King Jr. on its Sora app following complaints from his estate about offensive content. The company announced plans to strengthen content controls for historical figures and will allow public figures to opt out of appearing in Sora videos. This decision comes after instances of vulgar and racist portrayals of the civil rights leader were highlighted, sparking criticism and calls for better regulation of AI-generated content.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Verstappen Clinches Pole for US Grand Prix Sprint, Edges Out Norris",
    "domain": "sports",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Fri, 17 Oct 2025 22:56:38 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "ESPN",
      "Yahoo Sports",
      "Sky Sports"
    ],
    "domains": [
      "bbc.com",
      "espn.com",
      "skysports.com"
    ],
    "snippets": [
      "Red Bull's Max Verstappen beats McLaren's title rivals Lando Norris and Oscar Piastri to take pole for the United States Grand Prix sprint race.",
      "Max Verstappen beat McLaren drivers to pole position for Saturday's U.S. Grand Prix sprint.",
      "Max Verstappen pipped Lando Norris to Sprint pole at the United States Grand Prix by 0.071s to reinforce a possible title fightback."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/e563/live/2a052b90-aba9-11f0-963b-b5df01a4e6a5.jpg",
    "titles": [
      "Verstappen takes US sprint pole from Norris",
      "Verstappen takes sprint pole at US Grand Prix",
      "Verstappen pips Norris to Sprint pole in Austin"
    ],
    "url": "https://www.bbc.com/sport/formula1/articles/ce3k13ne1zlo?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://www.espn.com/f1/story/_/id/46603558/max-verstappen-takes-sprint-pole-us-grand-prix",
      "https://www.bbc.com/sport/formula1/articles/ce3k13ne1zlo?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bsport%5D-%5Bbizdev%5D-%5Bisapi%5D",
      "https://www.skysports.com/f1/news/12040/13451698/united-states-gp-max-verstappen-beats-lando-norris-oscar-piastri-to-sprint-pole-after-close-battle"
    ],
    "link": "https://www.bbc.com/sport/formula1/articles/ce3k13ne1zlo?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.953,
      "consensus": 0.888,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.775,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Max Verstappen secured pole position for the United States Grand Prix sprint race, narrowly beating McLaren's Lando Norris by 0.071 seconds and Oscar Piastri. This victory positions Verstappen favorably for a potential title fightback in the race.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Cowboys' Trevon Diggs Out Sunday Due to Concussion from Home Accident",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Fri, 17 Oct 2025 19:10:03 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Bleacher Report",
      "Sports Illustrated"
    ],
    "domains": [
      "espn.com",
      "news.google.com"
    ],
    "snippets": [
      "The Cowboys will be without cornerback Trevon Diggs on Sunday against the Commanders after an accident at his home Thursday put him in the concussion protocol.",
      "Cowboys' Trevon Diggs Has Accident at Home, Out With Concussion vs. Commanders Bleacher Report",
      "Cowboys' Trevon Diggs Injured in Household Accident Sports Illustrated"
    ],
    "image_url": "",
    "titles": [
      "Cowboys' Diggs out Sunday after home accident",
      "Cowboys' Trevon Diggs Has Accident at Home, Out With Concussion vs. Commanders - Bleacher Report",
      "Cowboys' Trevon Diggs Injured in Household Accident - Sports Illustrated"
    ],
    "url": "https://www.espn.com/nfl/story/_/id/46626885/cowboys-diggs-vs-commanders-accident-home",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMisgFBVV95cUxOc05HWUU0UU5XMXRINGgxaFNDWEptdnRGLWd2NWVpZ3dpZVpDN2g5QmdjVzFfZThFMzBBaVhLOGdxUnBHUFZucXg3LXdxNG0yWkRzdzd1TE1JeXlXejNfaWZERHhHd0VHSkVFZUdnRGF1Vm9YcWZZWjByUkNLd3ZOVDVxNWtVNkNGVVJpeGRYMUFoSUo3Mkw4SzEtZVRKTnFOWmd4amN3RDNYNXVuMUpuSGxR?oc=5",
      "https://news.google.com/rss/articles/CBMifkFVX3lxTFBnNk01QVB6RzU1RDVxbklUM1JRUm1zS245NGY3MG03dHpxVnNRMkVMbEd3Z2pJM0txdThoUm9BaGZPYTdEcXU1ajJBWnZiRXppQ3c2V1JlWEFkUmxuWWRXVXU3TXNIN29lY05tVWs2MEVIVFctOWdmMjR3TTI3Zw?oc=5"
    ],
    "link": "https://www.espn.com/nfl/story/_/id/46626885/cowboys-diggs-vs-commanders-accident-home",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.977,
      "consensus": 0.769,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.752,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Trevon Diggs, a cornerback for the Cowboys, will miss Sunday's game against the Commanders due to a concussion. This injury resulted from an accident at his home on Thursday, leading to his placement in the concussion protocol.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Ukraine President Seeks Ceasefire; Trump Talks Peace Without Tomahawks",
    "domain": "business",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Fri, 17 Oct 2025 21:33:10 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Axios",
      "Financial Times"
    ],
    "domains": [
      "aljazeera.com",
      "news.google.com",
      "ft.com"
    ],
    "snippets": [
      "The Ukrainian president also expressed optimism about reaching a ceasefire and urged pressure against Russia's Putin.",
      "Trump says he wants to end Ukraine war without sending Tomahawk missiles Axios",
      "US president equivocates on support for Kyiv a day after conversation with Vladimir Putin",
      "Trump rejects Zelensky on Tomahawk missiles in \"tough\" meeting Axios"
    ],
    "image_url": "",
    "titles": [
      "Trump says Ukraine war could end ‘quickly’ as he meets Zelenskyy",
      "Trump says he wants to end Ukraine war without sending Tomahawk missiles - Axios",
      "Trump resists Zelenskyy’s plea for Tomahawk missiles",
      "Trump rejects Zelensky on Tomahawk missiles in \"tough\" meeting - Axios"
    ],
    "url": "https://www.aljazeera.com/news/2025/10/17/trump-says-ukraine-war-could-end-quickly-as-he-meets-zelenskyy?traffic_source=rss",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiiAFBVV95cUxOUk9vSFRLLXBuUkFnTHVqTzRLVFlMMFB0OTdPbkp2bzRaWFZUMnRrdlJ2NUdWWlNuckpTMThhQ01xSHdJbDAzRmZVUXBZajFvOWdLcmkwOVRiT1pGZndHN3ppVGxpMGJjWWp2Y1JQdDZCNEV1N3hHU3FwY3RoQzcyWXdqX0lLbk9h?oc=5",
      "https://www.ft.com/content/dcc3d507-b157-48ee-bca1-707863f61b00",
      "https://news.google.com/rss/articles/CBMigwFBVV95cUxQd3MzZ3pFVWRvRS0xNzRlZ3Y1Z3V1a2lJZnF4aDhQR0stVG1jS3N5YzF6dkRpVnlXQzhuakJSYXBsSWdVMExsS1M1SVZPTTVVRk85dUpqWEdmUlJNQ1Z5X2M0c2NhUVJpNmVjVWtvU0dwMS1sNnNYSlhhaU91QmFKRXNZdw?oc=5"
    ],
    "link": "https://www.aljazeera.com/news/2025/10/17/trump-says-ukraine-war-could-end-quickly-as-he-meets-zelenskyy?traffic_source=rss",
    "score_components": {
      "magnitude": 0.887,
      "recency": 0.945,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.747,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Ukrainian President remains optimistic about achieving a ceasefire and calls for increased pressure on Russia. Meanwhile, former US President Trump has expressed a desire to end the Ukraine war without deploying Tomahawk missiles, following a conversation with Putin. Trump also declined Zelensky's request for Tomahawk missiles during a meeting described as \"tough.\"",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Caley Tips Cal, Vanderbilt, Utah in Week 8; SI Flags 8 Teams for Upsets",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Fri, 17 Oct 2025 13:42:44 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Yahoo Sports",
      "Sports Illustrated"
    ],
    "domains": [
      "espn.com",
      "covers.com",
      "news.google.com"
    ],
    "snippets": [
      "Five games, five stories, each wager backed by form, data and a little gut instinct.",
      "Caley's Triple Option: Back Cal, Vanderbilt, and Utah in Week 8!",
      "Eight college football teams on upset alert in Week 8 Sports Illustrated",
      "UNLV Rebels: Games With College Football Playoff Implications In Week 8 Sports Illustrated"
    ],
    "image_url": "",
    "titles": [
      "College football: Why Texas Tech-ASU is worth two bets this week",
      "Best College Football Bets and +595 Week 8 Parlay: Holy War!",
      "Eight college football teams on upset alert in Week 8 - Sports Illustrated",
      "UNLV Rebels: Games With College Football Playoff Implications In Week 8 - Sports Illustrated"
    ],
    "url": "https://www.espn.com/espn/betting/story/_/id/46606523/college-football-odds-best-bets-week-8-spreads-lines-2025",
    "alternate_urls": [
      "https://www.covers.com/ncaaf/best-bets-parlay-picks-week-8-2025",
      "https://news.google.com/rss/articles/CBMipAFBVV95cUxPSXg1VUtxdVZQY0JRd1BzZ0VJeGxMaFVYTGRKWjdPSVN4T1p0cjkwNUZXMkh4YkVZRUlPNHgyeE1YZG10Q0dGcWt3eUVfN2F4a3hqcHNTN2t3Y2o4YzA5cGZ5cGlGdHBHbDhYWDl0c2ZxNGNpMmVnbzBuTy1oRkRya2NoNEZJZUlVU1dpMzJVbWxsRkJFdFFWamMzTUo1ZTFFZW1vSA?oc=5",
      "https://news.google.com/rss/articles/CBMisAFBVV95cUxPMFBJQjlTUmRhNmQxQmYtY2pheWxCLVJkRlc3d2o5aEw1b2ZoUUltdmxvT2FvYUJldklCdlRyMlAzZHFZUEdGNWdvMUZDWG56ZHpwWUtBTzkxUlNXTHAxNENpTGhScE9PNl9rU05fT1RoYzRzdkJzOUItUXFGbE1WbEFId1RsekJIUW1nVjlyUmgzR3gwYUliWEF1VURxcnZzMGdKdW5HZndhWFZra21fNQ?oc=5"
    ],
    "link": "https://www.espn.com/espn/betting/story/_/id/46606523/college-football-odds-best-bets-week-8-spreads-lines-2025",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.872,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.736,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "This week, Caley recommends betting on Cal, Vanderbilt, and Utah based on form, data, and instinct. Sports Illustrated has flagged eight college football teams as being on upset alert in Week 8, also noting UNLV Rebels' games as having college football playoff implications for the same week.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Leans Toward Peace Talks Over Missiles for Ukraine After Putin Call",
    "domain": "general",
    "source_domain": "theguardian.com",
    "location": "global",
    "published": "Fri, 17 Oct 2025 19:08:55 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "Washington Post",
      "New York Times"
    ],
    "domains": [
      "theguardian.com",
      "washingtonpost.com",
      "nytimes.com"
    ],
    "snippets": [
      "US president seemed more intent on brokering a peace deal after surprise phone call with Putin earlier in day Donald Trump seemed more intent on brokering a peace deal than he was to supply Ukraine with Tomahawk cruise missiles during a White House meeting with Volodymyr Zelenskyy , saying that the",
      "The call with Putin came right before his meeting with Zelensky where the Ukrainian leader was hoping to obtain new long-range weaponry to use against Russia.",
      "President Trump has come close to imposing penalties on Russia several times, only to backtrack after talking with President Vladimir Putin and raising hopes for a diplomatic solution to the war."
    ],
    "image_url": "https://i.guim.co.uk/img/media/d4a61836cc153d29c6af8a23dca14ccd17292c8a/375_0_3750_3000/master/3750.jpg?width=140&quality=85&auto=format&fit=max&s=abcd8881cd99b51da5f3d09ddbbc6bec",
    "titles": [
      "Trump downplays hopes he will supply Ukraine with US missiles after meeting with Zelenskyy",
      "Trump plans Putin summit on Ukraine, raising stakes for Zelensky meeting",
      "After ‘Productive’ Call, Trump Plans Another Meeting With Putin"
    ],
    "url": "https://www.theguardian.com/world/2025/oct/17/trump-putin-phone-call-sinks-kyiv-ukraine-hopes-for-us-tomahawk-missiles",
    "alternate_urls": [
      "https://www.washingtonpost.com/politics/2025/10/16/trump-buoyed-by-gaza-deal-plans-putin-summit-ukraine-peace/",
      "https://www.nytimes.com/2025/10/16/us/politics/trump-putin-cease-fire-ukraine.html"
    ],
    "link": "https://www.theguardian.com/world/2025/oct/17/trump-putin-phone-call-sinks-kyiv-ukraine-hopes-for-us-tomahawk-missiles",
    "score_components": {
      "magnitude": 0.887,
      "recency": 0.88,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.734,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "After a surprise call with Putin, President Trump showed a stronger inclination towards negotiating a peace deal rather than providing Ukraine with Tomahawk cruise missiles during a meeting with Ukrainian President Volodymyr Zelenskyy. Despite previous considerations for imposing penalties on Russia, Trump has often reversed decisions following discussions with Putin, indicating a preference for a diplomatic resolution to the conflict.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Salesforce CEO Apologizes for Backing National Guard Deployment in SF",
    "domain": "business",
    "source_domain": "cnbc.com",
    "location": "national",
    "published": "Fri, 17 Oct 2025 20:40:17 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "The Guardian",
      "Business Insider"
    ],
    "domains": [
      "cnbc.com",
      "theguardian.com",
      "businessinsider.com"
    ],
    "snippets": [
      "In a post on X, Salesforce CEO Marc Benioff said he regrets comments he made in support of President Trump sending federal troops to San Francisco.",
      "Salesforce CEO faced intensifying backlash after saying national guard will make California city safer Marc Benioff, the billionaire CEO of Salesforce and owner of Time magazine, apologized on Friday for saying he supported Donald Trump sending national guard troops to San Francisco. Benioff, who ha",
      "Marc Benioff, CEO of Salesforce, apologized in a post on X for suggesting President Donald Trump should call the National Guard into San Francisco."
    ],
    "image_url": "",
    "titles": [
      "Salesforce CEO apologizes for saying Trump should send National Guard to San Francisco",
      "Billionaire Marc Benioff apologizes for saying troops should be deployed to San Francisco",
      "Marc Benioff apologizes after saying Trump should send National Guard troops to San Francisco"
    ],
    "url": "https://www.cnbc.com/2025/10/17/benioff-trump-national-guard-sf.html",
    "alternate_urls": [
      "https://www.theguardian.com/us-news/2025/oct/17/marc-benioff-apologizes-san-francisco-national-guard",
      "https://www.businessinsider.com/marc-benioff-apologizes-for-national-guard-comments-2025-10"
    ],
    "link": "https://www.cnbc.com/2025/10/17/benioff-trump-national-guard-sf.html",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.909,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.729,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Salesforce CEO Marc Benioff apologized for his comments supporting the deployment of National Guard troops to San Francisco by President Trump. His apology came after facing backlash for his initial statement.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Ceasefire in Israel-Hamas Conflict Fragile Amid Continuing Casualties",
    "domain": "general",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Fri, 17 Oct 2025 18:58:57 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "New York Times",
      "CityNews"
    ],
    "domains": [
      "aljazeera.com",
      "nytimes.com",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "As calls for border crossings to reopen grow, Israeli attacks on Palestinians kill and wound several despite truce.",
      "A single photograph of Palestinians besieging an aid convoy after the new cease-fire took hold in Gaza makes clear how much work lies ahead in the enclave.",
      "DEIR AL-BALAH, Gaza Strip (AP) — Bassil Naggar can finally sleep without getting jolted awake by the sounds of Israeli airstrikes. For Naggar and his displaced family, and for many in Gaza facing similar challenges, the ceasefire in the Israel-Hamas war has provided a much-needed respite from a two-"
    ],
    "image_url": "",
    "titles": [
      "Gaza aid deliveries still face Israeli roadblocks a week into ceasefire",
      "Despite Gaza Cease-Fire, Aid Deliveries Struggle",
      "Daily struggles persist in Gaza even as ceasefire offers some respite"
    ],
    "url": "https://www.aljazeera.com/news/2025/10/17/gaza-aid-deliveries-still-facing-israeli-roadblocks-a-week-into-ceasefire?traffic_source=rss",
    "alternate_urls": [
      "https://www.nytimes.com/2025/10/17/world/middleeast/gaza-food-delivery.html",
      "https://ottawa.citynews.ca/2025/10/17/daily-struggles-persist-in-gaza-even-as-ceasefire-offers-some-respite/"
    ],
    "link": "https://www.aljazeera.com/news/2025/10/17/gaza-aid-deliveries-still-facing-israeli-roadblocks-a-week-into-ceasefire?traffic_source=rss",
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.896,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.723,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Despite a new ceasefire in the Israel-Hamas conflict, Israeli attacks have resulted in Palestinian casualties, underscoring the fragile state of the truce. A photograph highlighting Palestinians swarming an aid convoy post-ceasefire underscores the significant humanitarian needs in Gaza. Meanwhile, residents like Bassil Naggar experience relief from airstrikes, indicating a temporary pause in hostilities and a moment of respite for displaced families in the Gaza Strip.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Halifax Pilot Flies Plane to Sketch Blue Jays Logo in Sky",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Fri, 17 Oct 2025 21:12:17 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "CityNews"
    ],
    "domains": [
      "globalnews.ca",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "A Halifax pilot and longtime Blue Jays fan has taken his support for Canada's baseball team to new heights — literally — tracing the team's logo through the skies over Nova Scotia.",
      "A Halifax pilot and longtime Blue Jays fan has taken his support for Canada’s baseball team to new heights — literally — tracing the team’s logo through the skies over Nova Scotia. “I wanted to cheer on the Blue Jays, I wanted to cheer the fans, I wanted to do it for myself,” said Dimitri […]"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/10/724195f487e7d36dff2347803c764fd5a6ce40fb22a952dda6e27c683cbf22b6.jpg?quality=65&strip=all",
    "titles": [
      "Halifax pilot draws Blue Jays logo in the sky",
      "‘A lot of twists and turns’: Halifax pilot draws Blue Jays logo in the sky"
    ],
    "url": "https://globalnews.ca/news/11483446/halifax-pilot-draws-blue-jays-logo-in-the-sky/",
    "alternate_urls": [
      "https://ottawa.citynews.ca/2025/10/17/halifax-pilot-draws-blue-jays-logo-in-the-sky/"
    ],
    "link": "https://globalnews.ca/news/11483446/halifax-pilot-draws-blue-jays-logo-in-the-sky/",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.938,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 1.0
    },
    "score": 0.703,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A Halifax pilot, Dimitri, a dedicated Blue Jays fan, expressed his support for the team by flying his plane over Nova Scotia to trace the team's logo in the sky. This unique gesture aimed to cheer on the Blue Jays and their fans.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Apple Secures Exclusive U.S. Media Rights for Formula 1 Races",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Fri, 17 Oct 2025 15:39:15 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "CNBC",
      "TechCrunch"
    ],
    "domains": [
      "news.google.com",
      "cnbc.com",
      "techcrunch.com"
    ],
    "snippets": [
      "Apple and F1 strike five-year U.S. media rights deal Axios",
      "Apple and Formula 1 announced their long-awaited five-year U.S. media rights deal that will bring all U.S. televised races to Apple TV",
      "All practice, qualifying, Sprint sessions, and Grand Prix races will be available to Apple TV subscribers."
    ],
    "image_url": "",
    "titles": [
      "Apple and F1 strike five-year U.S. media rights deal - Axios",
      "Apple and F1 reach 5-year media deal, bringing all races to Apple TV streaming in the U.S.",
      "Apple and Formula 1 ink 5-year US streaming deal, bringing all races to Apple TV"
    ],
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxNdm5fRGZfUndSb2kwOUJKejYxOWFqSTVhbjZDLWxpWkdKaUFpbVVRRXFCb0t2M29FSVpzSTItSHhmOHVlcS1KM2FMUF9GLXNkZGd2Y3R2NlBkSm12eEFQSUgxeklBandxNWhqdHR2NlFCaGRzeUhRblREQ0VvRll5NjdKbEo?oc=5",
    "alternate_urls": [
      "https://www.cnbc.com/2025/10/17/apple-f1-media-deal-streaming.html",
      "https://techcrunch.com/2025/10/17/apple-and-formula-1-ink-five-year-us-streaming-deal-bringing-all-races-to-apple-tv/"
    ],
    "link": "https://news.google.com/rss/articles/CBMihAFBVV95cUxNdm5fRGZfUndSb2kwOUJKejYxOWFqSTVhbjZDLWxpWkdKaUFpbVVRRXFCb0t2M29FSVpzSTItSHhmOHVlcS1KM2FMUF9GLXNkZGd2Y3R2NlBkSm12eEFQSUgxeklBandxNWhqdHR2NlFCaGRzeUhRblREQ0VvRll5NjdKbEo?oc=5",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.818,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.7,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Apple and Formula 1 have entered a five-year media rights agreement for the U.S., making all televised races, including practice, qualifying, Sprint sessions, and Grand Prix races, available exclusively to Apple TV subscribers.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "LaLiga Players Protest Match in Miami by Pausing Game",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Fri, 17 Oct 2025 19:00:08 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Yahoo Sports"
    ],
    "domains": [
      "espn.com",
      "sports.yahoo.com"
    ],
    "snippets": [
      "LaLiga players launched protests against the league's decision to stage a regular-season game in Miami by pausing play for the opening seconds after kickoff.",
      "LaLiga is planning to play a Barcelona-Villareal match in Miami at the end of the year. Players aren't happy."
    ],
    "image_url": "",
    "titles": [
      "LaLiga players pause game to protest Miami match",
      "LaLiga players begin protests over controversial game in Miami, but first gets hidden by broadcast"
    ],
    "url": "https://www.espn.com/soccer/story/_/id/46628651/laliga-players-protest-barcelona-villarreal-miami-usa",
    "alternate_urls": [
      "https://sports.yahoo.com/soccer/breaking-news/article/laliga-players-begin-protests-over-controversial-game-in-miami-but-first-gets-hidden-by-broadcast-235128355.html"
    ],
    "link": "https://www.espn.com/soccer/story/_/id/46628651/laliga-players-protest-barcelona-villarreal-miami-usa",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.974,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.685,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "LaLiga players protested the league's decision to hold a Barcelona-Villareal match in Miami by pausing play at the start of a game. This action reflects their dissatisfaction with the plan to stage a regular-season game outside Spain.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Mac Jones to Start for Niners vs. Atlanta; Kittle Returns, Pearsall Out",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Fri, 17 Oct 2025 19:00:08 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Yahoo Sports"
    ],
    "domains": [
      "espn.com",
      "sports.yahoo.com"
    ],
    "snippets": [
      "Niners coach Kyle Shanahan said Mac Jones will step into the starting quarterback role again against Atlanta as Brock Purdy's return from a toe ailment will have to wait at least another week.",
      "Coach Kyle Shanahan also said that tight end George Kittle will return after missing the past five games with a hamstring injury and that receiver Ricky Pearsall will miss his third straight game with a knee injury. Purdy initially hurt his toe in the season opener against Seattle but returned after"
    ],
    "image_url": "",
    "titles": [
      "49ers to start Jones vs. Falcons; Purdy out again",
      "49ers' Brock Purdy out for third straight game; Mac Jones to start against Falcons"
    ],
    "url": "https://www.espn.com/nfl/story/_/id/46629863/niners-qb-mac-jones-start-injured-brock-purdy-george-kittle-back",
    "alternate_urls": [
      "https://sports.yahoo.com/article/49ers-brock-purdy-third-straight-230854098.html"
    ],
    "link": "https://www.espn.com/nfl/story/_/id/46629863/niners-qb-mac-jones-start-injured-brock-purdy-george-kittle-back",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.974,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.675,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Mac Jones will start as quarterback for the Niners against Atlanta, as Brock Purdy's comeback from a toe injury is delayed. George Kittle returns after a five-game absence due to a hamstring injury, while Ricky Pearsall remains sidelined with a knee injury for the third consecutive game.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Imposes 25% Tariff on Imported Trucks, Exempts CUSMA Nations",
    "domain": "business",
    "source_domain": "financialpost.com",
    "location": "national",
    "published": "Fri, 17 Oct 2025 23:46:05 +0000",
    "source": "Financial Post",
    "sources": [
      "Financial Post",
      "CityNews"
    ],
    "domains": [
      "financialpost.com",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "WASHINGTON — U.S. President Donald Trump signed a proclamation Friday to slap a 25 per cent tariff on imported medium- and heavy-duty trucks beginning Nov. 1, with a carveout for vehicles traded under the Canada-U.S.-Mexico Agreement. Trucks compliant with the trade agreement, better known as CUSMA,"
    ],
    "image_url": "",
    "titles": [
      "Trump hitting medium and heavy trucks with 25 per cent tariff on Nov. 1"
    ],
    "url": "https://financialpost.com/pmn/trump-hitting-medium-and-heavy-trucks-with-25-per-cent-tariff-on-nov-1",
    "alternate_urls": [
      "https://ottawa.citynews.ca/2025/10/17/trump-hitting-medium-and-heavy-trucks-with-25-per-cent-tariff-on-nov-1/"
    ],
    "link": "https://financialpost.com/pmn/trump-hitting-medium-and-heavy-trucks-with-25-per-cent-tariff-on-nov-1",
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.99,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.667,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "U.S. President Donald Trump signed a proclamation imposing a 25% tariff on imported medium- and heavy-duty trucks starting Nov. 1. However, trucks traded under the Canada-U.S.-Mexico Agreement (CUSMA) are exempt from this tariff.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "US Detains Survivors from Alleged Narco Submarine Attack in Caribbean",
    "domain": "general",
    "source_domain": "dw.com",
    "location": "global",
    "published": "2025-10-17T22:08:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "Washington Post"
    ],
    "domains": [
      "dw.com",
      "washingtonpost.com"
    ],
    "snippets": [
      "Reports suggest the US has detained two individuals who survived an attack on their vessel in the Caribbean. US President Donald Trump claimed it was a narco submarine.",
      "The operation is the sixth known attack on alleged drug smugglers in the Caribbean, and the first known to have left some people alive."
    ],
    "image_url": "",
    "titles": [
      "US holding survivors from 'drug boat' off Venezuela",
      "U.S. military detains survivors of latest boat strike near Venezuela"
    ],
    "url": "https://www.dw.com/en/us-holding-survivors-from-drug-boat-off-venezuela/a-74407450?maca=en-rss-en-top-1022-rdf",
    "alternate_urls": [
      "https://www.washingtonpost.com/national-security/2025/10/17/boat-strike-survivors-detained-venezuela-caribbean/"
    ],
    "link": "https://www.dw.com/en/us-holding-survivors-from-drug-boat-off-venezuela/a-74407450?maca=en-rss-en-top-1022-rdf",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.956,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.653,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The US has detained two survivors from an attack on their vessel, described by President Trump as a narco submarine, in the Caribbean. This marks the sixth attack on alleged drug smugglers in the region and the first where survivors were taken into custody.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "SportsLine, Kaylor Release Picks for Weekend College Football, MLB Games",
    "domain": "sports",
    "source_domain": "cbssports.com",
    "location": "national",
    "published": "Fri, 17 Oct 2025 23:31:56 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Yahoo Sports"
    ],
    "domains": [
      "cbssports.com",
      "covers.com"
    ],
    "snippets": [
      "The Hurricanes look to build on their unbeaten start in a key ACC game",
      "The SportsLine Projection Model has revealed its Louisville Cardinals vs. Miami Hurricanes picks for Friday",
      "The SportsLine Projection Model has revealed its Minnesota Golden Gophers vs. Nebraska Cornhuskers picks on Friday",
      "SportsLine expert Jimmie Kaylor has revealed his college football picks as the Cal Golden Bears take on Bill Belichick and the UNC Tar Heels",
      "The SportsLine projection model has revealed its Utah State Aggies vs. San Jose State Spartans picks for Friday",
      "SportsLine's model simulated the Seattle Mariners vs. Toronto Blue Jays 10,000 times and revealed its MLB picks",
      "Get the best North Carolina vs. California predictions ahead of Friday's showdown in Berkeley. Free college football picks for October 17."
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/10/15/fa02128b-0729-4df1-bd2a-349e605e1637/miami-carson-beck-charmar-brown.jpg",
    "titles": [
      "Miami vs. Louisville prediction, pick, odds, spread: No. 2 Hurricanes meet Louisville in Friday ACC action",
      "Miami vs. Louisville prediction, odds, line, time: 2025 college football Week 8 picks by proven model",
      "Nebraska vs. Minnesota prediction, odds, line, time: 2025 college football Week 8 picks by proven model",
      "North Carolina vs. California prediction, odds: College football Week 8 Friday picks, props by top expert",
      "San Jose State vs. Utah State prediction, odds: 2025 Week 8 college football picks by proven model",
      "Blue Jays vs. Mariners prediction, odds, time: 2025 MLB playoff betting picks for ALCS Game 5 by proven model",
      "North Carolina vs California Prediction, Picks & Best Bets for College Football Week 8 Tonight"
    ],
    "url": "https://www.cbssports.com/college-football/news/miami-louisville-prediction-pick-odds-spread-where-to-watch-live/",
    "alternate_urls": [
      "https://www.cbssports.com/college-football/news/miami-louisville-prediction-odds-line-time-2025-college-football-week-8-friday-picks-best-bets/",
      "https://www.cbssports.com/college-football/news/nebraska-minnesota-prediction-odds-line-bets-time-2025-college-football-week-8-friday-picks/",
      "https://www.cbssports.com/college-football/news/north-carolina-california-prediction-odds-expert-bill-belichick-picks/",
      "https://www.cbssports.com/college-football/news/san-jose-state-utah-state-prediction-odds-2025-week-8-friday-college-football-picks/",
      "https://www.cbssports.com/mlb/news/blue-jays-mariners-prediction-odds-line-time-2025-mlb-playoff-betting-picks-alcs-game-5/",
      "https://www.covers.com/ncaaf/north-carolina-vs-california-prediction-picks-odds-october-17-2025"
    ],
    "link": "https://www.cbssports.com/college-football/news/miami-louisville-prediction-pick-odds-spread-where-to-watch-live/",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.985,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.652,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The SportsLine Projection Model and expert Jimmie Kaylor have released their picks for several key sports matchups, including college football games featuring Louisville Cardinals vs. Miami Hurricanes, Minnesota Golden Gophers vs. Nebraska Cornhuskers, Cal Golden Bears vs. UNC Tar Heels, Utah State Aggies vs. San Jose State Spartans, and the MLB game between the Seattle Mariners and Toronto Blue Jays. These picks are based on simulations and expert analysis ahead of the games scheduled for Friday, with a notable college football showdown on October 17 between North Carolina and California.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Kopitar Sidelined Week to Week with Foot Injury",
    "domain": "sports",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Fri, 17 Oct 2025 23:34:50 GMT",
    "source": "NHL",
    "sources": [
      "NHL",
      "Sportsnet"
    ],
    "domains": [
      "news.google.com",
      "sportsnet.ca"
    ],
    "snippets": [
      "NHL Status Report: Kopitar week to week for Kings with foot injury NHL.com",
      "The Los Angeles Kings will be without captain Anze Kopitar for the foreseeable future."
    ],
    "image_url": "",
    "titles": [
      "NHL Status Report: Kopitar week to week for Kings with foot injury - NHL.com",
      "Kings captain Anze Kopitar out week-to-week with foot injury"
    ],
    "url": "https://news.google.com/rss/articles/CBMifkFVX3lxTFAtVlNfQzBOS0QxTFZDalg5UVJHQnQtR0xKYVVfY0NWWTRKT3JZY29FRUJmN0ZiVFViMFFNS09ZcWhjTHdqQnBWZUMzbmdnN3loMWNDaVhORGtxdXJVODdYS0RYYy1RTzZRT084RnBPY3Z2U29hR3V4eTl3MFZMZw?oc=5",
    "alternate_urls": [],
    "link": "https://news.google.com/rss/articles/CBMifkFVX3lxTFAtVlNfQzBOS0QxTFZDalg5UVJHQnQtR0xKYVVfY0NWWTRKT3JZY29FRUJmN0ZiVFViMFFNS09ZcWhjTHdqQnBWZUMzbmdnN3loMWNDaVhORGtxdXJVODdYS0RYYy1RTzZRT084RnBPY3Z2U29hR3V4eTl3MFZMZw?oc=5",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.965,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.648,
    "summary_source": "snippet",
    "summary_reason": "retry_exhausted",
    "summary": "NHL Status Report: Kopitar week to week for Kings with foot injury NHL.com",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Countries Delay Ship Emission Charge After US Pressure",
    "domain": "general",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Fri, 17 Oct 2025 16:31:07 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "bbc.com",
      "theguardian.com"
    ],
    "snippets": [
      "President Trump intervened in the talks calling the deal a \"green scam\".",
      "Long-planned charge on greenhouse gas emissions postponed as Trump officials accused of intimidation tactics Under intense pressure from Donald Trump’s government, countries have postponed plans to force shipowners to start paying for the damage they do to the climate. US officials were accused of “"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/784f/live/5e54e370-ab6a-11f0-b2a1-6f537f66f9aa.jpg",
    "titles": [
      "Landmark deal to cut global shipping emissions in tatters after US pressure",
      "Shipping emissions levy shelved as countries bow to US pressure"
    ],
    "url": "https://www.bbc.com/news/articles/c3vnl0yxg53o?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://www.theguardian.com/environment/2025/oct/17/shipping-emissions-levy-shelved-as-countries-bow-to-us-pressure"
    ],
    "link": "https://www.bbc.com/news/articles/c3vnl0yxg53o?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.833,
      "consensus": 0.591,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.642,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Under pressure from the Trump administration, which labeled the initiative a \"green scam,\" countries have delayed implementing a charge on greenhouse gas emissions from shipowners. The postponement comes amid accusations of intimidation tactics by US officials. This decision halts efforts aimed at making shipowners financially responsible for their climate impact.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: effort, initiative",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Considers Supplying Ukraine with Tomahawk Missiles",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Fri, 17 Oct 2025 14:53:55 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "Washington Post"
    ],
    "domains": [
      "news.google.com",
      "washingtonpost.com"
    ],
    "snippets": [
      "Why giving Ukraine Tomahawk missiles could be a gamechanger in the Russia war Axios",
      "President Donald Trump says he is considering sending the long-range weapon to Ukraine for strikes deep inside Russian territory."
    ],
    "image_url": "",
    "titles": [
      "Why giving Ukraine Tomahawk missiles could be a gamechanger in the Russia war - Axios",
      "Would Tomahawk cruise missiles be a game changer for Ukraine?"
    ],
    "url": "https://news.google.com/rss/articles/CBMihgFBVV95cUxOUUxxV2pkN0Q2X2ZsTFpfMVpCT3ZudEJXeEdzQXRBMzFMdDQyOHdOZDRWNkM3cU14eXdOSGFFcTFzZWRqYXJ0eFd2dGQ5aDNsd3ZHX0NXTWZ3dmktTXBINF9fUElqQ0RkUnNhdmVfNzBscFp0b19FdllFTWh5YWZJOU5RRE4xQQ?oc=5",
    "alternate_urls": [
      "https://www.washingtonpost.com/national-security/2025/10/17/ukraine-tomahawk-russia-typhon-launcher/"
    ],
    "link": "https://news.google.com/rss/articles/CBMihgFBVV95cUxOUUxxV2pkN0Q2X2ZsTFpfMVpCT3ZudEJXeEdzQXRBMzFMdDQyOHdOZDRWNkM3cU14eXdOSGFFcTFzZWRqYXJ0eFd2dGQ5aDNsd3ZHX0NXTWZ3dmktTXBINF9fUElqQ0RkUnNhdmVfNzBscFp0b19FdllFTWh5YWZJOU5RRE4xQQ?oc=5",
    "score_components": {
      "magnitude": 0.795,
      "recency": 0.806,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.637,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Former President Donald Trump mentioned he is contemplating the idea of providing Ukraine with Tomahawk missiles, which could significantly impact the dynamics of the conflict with Russia by enabling strikes deep within Russian territory.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UK-China Tensions Rise Over Delayed Embassy Decision",
    "domain": "general",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Fri, 17 Oct 2025 15:32:04 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "bbc.com",
      "theguardian.com"
    ],
    "snippets": [
      "It comes after the UK said it had pushed back a decision on the controversial site for the second time.",
      "Diplomatic tensions escalate amid rows over planning hold-ups and collapse of spying trial Tensions between Britain and China have escalated after Beijing criticised further delays to a planning decision on its proposed “mega embassy” in London. China’s ministry of foreign affairs expressed “grave c"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/2de4/live/9d4c5d40-ab7b-11f0-b2a1-6f537f66f9aa.jpg",
    "titles": [
      "China warns UK of 'consequences' over mega-embassy delays",
      "China threatens UK with ‘consequences’ over delayed London mega embassy"
    ],
    "url": "https://www.bbc.com/news/articles/c629j10gln8o?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://www.theguardian.com/world/2025/oct/17/china-accuses-uk-of-bad-faith-over-delayed-embassy-project"
    ],
    "link": "https://www.bbc.com/news/articles/c629j10gln8o?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.816,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.625,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Tensions between Britain and China have increased following Beijing's criticism of the UK's further delay in making a planning decision on China's proposed \"mega embassy\" in London. This comes after the UK postponed the decision for the second time, amid diplomatic tensions and the collapse of a spying trial.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Says \"I'm Not a King\" Amid Nationwide \"No Kings\" Protests",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Fri, 17 Oct 2025 17:47:00 GMT",
    "source": "Axios",
    "sources": [
      "Axios"
    ],
    "domains": [
      "news.google.com"
    ],
    "snippets": [
      "\"I'm not a king,\" Trump says ahead of nationwide No Kings protests Axios",
      "\"No Kings\" protests return to San Diego Axios",
      "No Kings protest to march through Portland on Saturday Axios",
      "\"No Kings\" protest: What to know about your rights, safely protesting Axios"
    ],
    "image_url": "",
    "titles": [
      "\"I'm not a king,\" Trump says ahead of nationwide No Kings protests - Axios",
      "\"No Kings\" protests return to San Diego - Axios",
      "No Kings protest to march through Portland on Saturday - Axios",
      "\"No Kings\" protest: What to know about your rights, safely protesting - Axios"
    ],
    "url": "https://news.google.com/rss/articles/CBMiZ0FVX3lxTFBLQkFMVHluQ3R3dG0zZEhvZTBsYUVYZG10MDk1Nlk2ZFQyS3VHYTQ3NlJYMXRuTGRHUTJ6UXNZMWdHcHAwZmVEbjM2Z0lGYmpoWGdvdDg1cWtqWHJJMDd5WVhFU0lKMXM?oc=5",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMilAFBVV95cUxNR3lRVEZ5SUF5UHhjenRpdFd5NVVsUUlHRFFYZE5pWDNaVjFDQmtUZ2xqZm5zVkYwNTBrVHM2bmRyXzR0Y1QtWUFZQWpiNTI0V2xQMUktSEhualRId2JSenJ0aTFBWGNlekJzRVZUcDNLN1h5dGVuTmRHNkVXbXBEbk9QRnRuZElMN3ozNW9OdUFMNVVv?oc=5",
      "https://news.google.com/rss/articles/CBMikgFBVV95cUxQZU9pVGM5Q05IaXhMb0UzRlJoWklfR21JUXJla29HNV9ndE82M25lTUstWllYT1hFN3I4ejBRa2RZbVN3LU5VZS1RdnAyVGx0cTk2blFtUHUycUdCM0NNMmZ2NUE0bm9MUUptcUlyYUxIY1BUcXJnZ0xaQW5TUmVheURlWkNhMGVYRTVtMF8yT2tKZw?oc=5",
      "https://news.google.com/rss/articles/CBMidkFVX3lxTE9Gc2E0aG1pZ0VuaXZSWXN6c0c5WFZuczZKUTlSZ2Z4TGhZY1d6STJvR2lJN2ZIeDNNaTRVdE1TSVBPQk9URkFWSzY3Y3ZmUS04a1FkZUlGVDJmLVRFOS1tWlg2YkJJMkdoeDBZU1JZSFpSX3puZGc?oc=5"
    ],
    "link": "https://news.google.com/rss/articles/CBMiZ0FVX3lxTFBLQkFMVHluQ3R3dG0zZEhvZTBsYUVYZG10MDk1Nlk2ZFQyS3VHYTQ3NlJYMXRuTGRHUTJ6UXNZMWdHcHAwZmVEbjM2Z0lGYmpoWGdvdDg1cWtqWHJJMDd5WVhFU0lKMXM?oc=5",
    "score_components": {
      "magnitude": 0.393,
      "recency": 0.856,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.446,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Former President Trump stated, \"I'm not a king,\" ahead of the resurgence of \"No Kings\" protests across the nation, including significant marches in San Diego and Portland. These protests, aimed at Trump's policies and governance style, have prompted discussions on legal rights and safe protesting practices.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Kiss Guitarist Ace Frehley Pulled Over in 1983; Poet Maurice Rutherford Dies at ",
    "domain": "general",
    "source_domain": "theguardian.com",
    "location": "global",
    "published": "Fri, 17 Oct 2025 16:54:20 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "domains": [
      "theguardian.com"
    ],
    "snippets": [
      "Compelling guitarist with the rock band Kiss whose ‘Spaceman’ persona matched his otherworldly performances In May 1983, the guitarist Ace Frehley was driving his DeLorean sports car along the Bronx River Parkway in New York when he was asked to pull over by a police officer. In an intoxicated state",
      "Poet who wrote with originality, warmth and mischief about his home city of Hull, after turning to writing later in life The work of the poet Maurice Rutherford, who has died aged 103, ranges from love poems and elegies for his late wife to friendly, witty, but sometimes politically trenchant respon"
    ],
    "image_url": "https://i.guim.co.uk/img/media/a3c0532443075e69f5c21248bc6e7f6b0d9977f5/0_787_4461_3569/master/4461.jpg?width=140&quality=85&auto=format&fit=max&s=88e8096e6bf00e5fca3b997be74b22a1",
    "titles": [
      "Ace Frehley obituary",
      "Maurice Rutherford obituary"
    ],
    "url": "https://www.theguardian.com/music/2025/oct/17/ace-frehley-obituary",
    "alternate_urls": [
      "https://www.theguardian.com/books/2025/oct/17/maurice-rutherford-obituary"
    ],
    "link": "https://www.theguardian.com/music/2025/oct/17/ace-frehley-obituary",
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.84,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.436,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Ace Frehley, the guitarist known for his 'Spaceman' persona in the rock band Kiss, was involved in an incident in May 1983 where he was pulled over by police while driving his DeLorean intoxicated in New York. Maurice Rutherford, a poet celebrated for his original, warm, and mischievous writings about Hull, has passed away at the age of 103. His work included love poems, elegies for his late wife, and politically poignant pieces.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]