[
  {
    "title": "Judge Blocks Trump's Attempt to End Birthright Citizenship",
    "domain": "general",
    "location": "global",
    "published": "Thu, 10 Jul 2025 16:46:15 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Axios",
      "Al Jazeera",
      "Deutsche Welle",
      "Financial Times"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "The injunction would bar Trump from denying citizenship to US-born babies based on their parents&#039; immigration status.",
      "A US federal judge has blocked Trump's move to end birthright citizenship for some babies. The New Hampshire ruling makes the case a class action, covering all families at risk nationwide.",
      "<a href=\"https://news.google.com/rss/articles/CBMikgFBVV95cUxQeEJNd1pQelVMaTZ6UFVqN3Nna1NZeEJ4LWlaZ2pZd0N3aWRuWjB2N05WUDZDSTF3YldXSm11blFOaHBQNGVoSWxnanI1d3lNUkIzNWtkTXpsZ2FUMkYyT2JoSnpzdGNoOXpOVHNON2NuRGRwUUJock0xRXpQZzVwbjdxRVBfRWR0NWVuelpJU0dUZw?oc=5\" target=\"_blank\">Trump's birthright citizenshi",
      "The ruling is the latest twist in a battle that has already made its way through the Supreme Court"
    ],
    "image_url": "",
    "titles": [
      "Judge blocks Trump’s birthright citizenship order in class-action lawsuit",
      "US judge pauses Trump order ending birthright citizenship",
      "Trump's birthright citizenship order blocked by judge despite SCOTUS ruling - Axios",
      "US judge blocks Trump order limiting birthright citizenship"
    ],
    "score_components": {
      "magnitude": 0.82,
      "recency": 0.882,
      "consensus": 0.985,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.84,
    "summary": "A US federal judge in New Hampshire has issued an injunction blocking former President Trump's attempt to end birthright citizenship for children born in the US to parents with uncertain immigration status. This decision classifies the issue as a class action lawsuit, providing protection to all affected families across the country. The ruling represents a significant development in the ongoing legal battle over birthright citizenship, which has previously reached the Supreme Court.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful information about a significant legal development, which could affect many families across the country. It also increases awareness about the ongoing legal battle over birthright citizenship. However, it doesn't report on solutions or improvements, so it doesn't score the highest."
  },
  {
    "title": "Tottenham Signs Kudus for £55m, Eyes Gibbs-White Deal",
    "domain": "sports",
    "location": "global",
    "published": "Thu, 10 Jul 2025 21:34:34 GMT",
    "source": "BBC",
    "sources": [
      "Yahoo Sports",
      "Sportsnet",
      "BBC"
    ],
    "domains": [
      "general",
      "sports"
    ],
    "snippets": [
      "Tottenham complete the signing of Mohammed Kudus from West Ham for £55m, subject to a work permit.",
      "Tottenham complete the signing of Mohammed Kudus from West Ham for £55m, subject to a work permit.",
      "<p>Tottenham completed the signing of Ghana forward Mohammed Kudus from West Ham on Thursday and was reportedly close to adding Nottingham Forest midfielder Morgan Gibbs-White as well. </p>"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/56fb/live/2a835970-5dcf-11f0-b1af-694104f8ecc2.jpg",
    "titles": [
      "Tottenham sign West Ham midfielder Kudus for £55m",
      "Tottenham sign West Ham midfielder Kudus for £55m",
      "Tottenham signs forward Mohammed Kudus from West Ham"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.975,
      "consensus": 0.897,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.764,
    "summary": "Tottenham has finalized the acquisition of Mohammed Kudus from West Ham for £55m, pending a work permit. Additionally, the club is in advanced talks to secure Nottingham Forest's Morgan Gibbs-White. The signing of Kudus marks a significant move for Tottenham as they bolster their squad for the upcoming season.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about recent developments in the world of football. However, it doesn't provide much in the way of deeper understanding or actionable insights. It also doesn't report on solutions or improvements beyond the immediate context of the football club."
  },
  {
    "title": "Former Cubs and Phillies Manager Lee Elia Dies at 87",
    "domain": "sports",
    "location": "national",
    "published": "Thu, 10 Jul 2025 17:53:04 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "Yahoo Sports",
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Lee Elia, who managed the Cubs and Phillies in a pro baseball career that lasted more than 50 years as a coach and player, died Wednesday at the age of 87.",
      "Elia spent several seasons playing for the White Sox and Cubs before transitioning to coaching and managing",
      "Elia's profanity-laced rant against Cubs fans took on a life of its own in 1983."
    ],
    "image_url": "",
    "titles": [
      "Lee Elia, manager of Cubs and Phillies, dies at 87",
      "Lee Elia, former Cubs and Phillies manager known best for profane rant at fans, dies at 87",
      "Former Cubs, Phillies manager Lee Elia, responsible for one of baseball's most famous rants, dies at 87"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.981,
      "consensus": 0.847,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.758,
    "summary": "Lee Elia, a former player and manager for the Cubs and Phillies with over 50 years in professional baseball, passed away at 87. Known for his long career spanning playing, coaching, and managing, Elia notably played for the White Sox and Cubs before moving into management roles. He is also remembered for a famous profanity-filled rant against Cubs fans in 1983.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "While this story provides basic awareness about the death of a notable figure in professional baseball, it doesn't offer much depth or insight beyond that. There's no actionable insight or deeper understanding provided, nor does it report on solutions, improvements, or innovations."
  },
  {
    "title": "Anisimova Beats No. 1 Sabalenka, Reaches First Grand Slam Final at Wimbledon",
    "domain": "sports",
    "location": "global",
    "published": "Thu, 10 Jul 2025 16:05:32 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Sportsnet",
      "Al Jazeera",
      "CBS Sports"
    ],
    "domains": [
      "general",
      "sports"
    ],
    "snippets": [
      "The world number 12 reaches maiden Grand Slam final with a tough three-set win over top-seeded Aryna Sabalenka.",
      "Anisimova is looking to become America's first singles champion in London since Serena Williams in 2016",
      "<p>Amanda Anisimova upset No. 1-ranked Aryna Sabalenka 6-4, 4-6, 6-4 at Wimbledon on Thursday to reach the first Grand Slam final of her career a little more than a year after taking a break from tennis because of burnout.</p>"
    ],
    "image_url": "",
    "titles": [
      "Amanda Anisimova upsets Aryna Sabalenka to reach Wimbledon tennis final",
      "Wimbledon 2025 results: Amanda Anisimova upsets No. 1 Aryna Sabalenka to reach first Grand Slam final",
      "Anisimova upsets No. 1 Sabalenka, to face Swiatek in Wimbledon final"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.869,
      "consensus": 0.897,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.753,
    "summary": "Amanda Anisimova defeated No. 1-ranked Aryna Sabalenka with scores of 6-4, 4-6, 6-4 at Wimbledon, securing her spot in her first Grand Slam final. This victory comes after Anisimova took a break from tennis due to burnout. She now aims to be the first American singles champion in London since Serena Williams in 2016.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about a major event in the sports world, giving the reader a deeper understanding of the current tennis landscape. However, it does not report on solutions, improvements, or innovations, nor does it increase clarity around systems or trends."
  },
  {
    "title": "NASA Installs Solar Panels on Roman Space Telescope",
    "domain": "science",
    "location": "global",
    "published": "Thu, 10 Jul 2025 15:44:05 EDT",
    "source": "Phys.org",
    "sources": [
      "NASA",
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "On June 14 and 16, technicians installed solar panels onto NASA's Nancy Grace Roman Space Telescope, one of the final steps in assembling the observatory. Collectively called the Solar Array Sun Shield, these panels will power and shade the observatory, enabling all the mission's observations and he",
      "On June 14 and 16, technicians installed solar panels onto NASA’s Nancy Grace Roman Space Telescope, one of the final steps in assembling the observatory. Collectively called the Solar Array Sun Shield, these panels will power and shade the observatory, enabling all the mission’s observations and he"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/nasas-roman-space-tele.jpg",
    "titles": [
      "Roman Space Telescope team installs observatory's solar panels",
      "NASA’s Roman Space Telescope Team Installs Observatory’s Solar Panels"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.938,
      "consensus": 0.632,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.696,
    "summary": "Technicians installed solar panels on NASA's Nancy Grace Roman Space Telescope on June 14 and 16, marking one of the final steps in the observatory's assembly. Named the Solar Array Sun Shield, these panels are designed to power the telescope and protect it from the sun, ensuring it can perform all planned observations.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it reports on progress and innovation in the field of space exploration. It provides useful information about the assembly process of the Roman Space Telescope and the role of the new solar panels. It also increases awareness about the systems and technologies used in space observatories."
  },
  {
    "title": "Trump Accuses Brazil of Targeting US Tech, Bolsonaro",
    "domain": "general",
    "location": "national",
    "published": "Thu, 10 Jul 2025 01:05:45 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "The Guardian",
      "New York Times"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMickFVX3lxTE54cE5ERkktNHU0UEhTbW5qNnllZHl6dkpIa192R05iZmZ4MVlQbzFJU0M1QVZzMXowODJwa1BKWlF3NWY5VVpNQ3lYUk14N19WOEdCZUVaTnU0eEFheXgwejVXdEZtc2RfcFVPZEUwWHY5Zw?oc=5\" target=\"_blank\">Trump announces 50% tariff on copper from Aug. 1</a>&nbsp;&nbsp;<font col",
      "<p>Latest threats heighten fears that the president’s erratic trade strategy risks exacerbating inflation across the US</p><p>Donald Trump announced on Wednesday that his administration will hit Brazil with a 50% tariff on products sent to the US, tying the move to what he called the “witch-hunt” tr",
      "Tensions between the United States and Brazil have suddenly burst open. Brazil’s president promised to reciprocate against President Trump’s tariffs."
    ],
    "image_url": "",
    "titles": [
      "Trump announces 50% tariff on copper from Aug. 1 - Axios",
      "Trump announces 50% tariff on Brazil, citing a ‘witch-hunt’ against Bolsonaro",
      "Trump Pledges 50% Tariffs Against Brazil, Citing ‘Witch Hunt’ Against Bolsonaro"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.636,
      "consensus": 0.847,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.691,
    "summary": "Former US President Donald Trump has accused Brazil of initiating \"attacks\" on American technology companies and of launching a \"witch hunt\" against Brazil's ex-president, Jair Bolsonaro. These accusations come amid concerns that Trump's unpredictable trade policies may worsen inflation in the United States.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story provides basic awareness about the accusations made by former President Trump against Brazil and the potential implications for US inflation. However, it lacks depth or insight into the specifics of these 'attacks' on US technology companies, or why Trump believes there is a 'witch hunt' against Bolsonaro. It also doesn't offer actionable insights or a clear understanding of the systems at play."
  }
]