[
  {
    "title": "Moldova's Pro-European Party Leads Election Amid Russia Interference Claims",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sun, 28 Sep 2025 22:14:08 +0000",
    "source": "Al Jazeera",
    "sources": [
      "The Guardian",
      "Financial Times",
      "Al Jazeera",
      "Financial Post",
      "Deutsche Welle"
    ],
    "domains": [
      "www.theguardian.com",
      "www.ft.com",
      "www.aljazeera.com",
      "financialpost.com",
      "www.dw.com"
    ],
    "snippets": [
      "Moldovans await the results of a closely-watched parliamentary election, amid claims of Russian interference.",
      "Moldovans voted in a high-stakes election to decide whether the country moves closer to the European Union or Russia. Follow DW for more.",
      "Overseas votes may boost Maia Sandu’s ruling party after officials accused Russia of underhand tactics before poll",
      "<p>PAS leads with 46% of vote in ballot that will decide whether country steers closer to EU or Russia</p><p>Moldova’s ruling pro-European party is on course to retain its parliamentary majority after Sunday’s pivotal election, seen as a test of the president’s push to keep the country of 2.4 millio",
      "Moldova’s ruling pro-European party was on track to win the most votes in a parliamentary election Sunday that was marred by allegations of wide-spread Russian meddling."
    ],
    "image_url": "",
    "titles": [
      "Moldova’s pro-EU party takes lead in election as vote counting under way",
      "Moldova election: Pro-EU party ahead as vote count underway",
      "Pro-EU party leads in Moldova’s parliamentary election",
      "Moldova’s pro-European party on course to retain majority in key election",
      "Moldova’s Pro-EU Party Set to Win Most Votes in Election"
    ],
    "score_components": {
      "magnitude": 0.964,
      "recency": 0.96,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.828,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Moldova's pro-European ruling party leads with 46% of the vote in a parliamentary election marked by allegations of Russian interference. The election is pivotal for deciding whether Moldova aligns more closely with the EU or Russia. The outcome could see President Maia Sandu's party retaining its majority, amid a high-stakes vote influenced by overseas ballots and accusations against Russia.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "NYC Mayor Adams Suspends Campaign Amid Funding Issues, Crowded Race",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sun, 28 Sep 2025 17:54:55 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Forbes",
      "The Guardian",
      "Financial Times",
      "Al Jazeera",
      "CNBC",
      "Business Insider"
    ],
    "domains": [
      "www.theguardian.com",
      "www.businessinsider.com",
      "www.ft.com",
      "www.aljazeera.com",
      "www.cnbc.com",
      "www.forbes.com"
    ],
    "snippets": [
      "Adams bows out, leaving the race between Democrat Zohran Mamdani and former New York Governor Andrew Cuomo.",
      "President Donald Trump has suggested that NYC Mayor Eric Adams and Curtis Sliwa, the Republican nominee, should both drop out of the race.",
      "Democratic socialist Zohran Mamdani and Andrew Cuomo will now face off in city’s November poll",
      "<p>New York City mayor abandons faltering bid to win re-election in social media video set to strains of song My Way</p><p>The mayor of <a href=\"https://www.theguardian.com/us-news/new-york\">New York City</a>, <a href=\"https://www.theguardian.com/us-news/eric-adams\">Eric Adams</a>, announced on Sund",
      "Adams’ withdrawal sets up a three-way race between Democrat Zohran Mamdani, Republican Curtis Sliwa and former Gov. Andrew Cuomo, who is running as an independent.",
      "Adams announced his departure on Sunday in an eight-minute video on X, saying media speculation and lack of funding influenced his decision."
    ],
    "image_url": "",
    "titles": [
      "Eric Adams says he is dropping out of New York City mayoral race",
      "Eric Adams drops out of New York City mayoral race",
      "New York mayor Eric Adams abandons re-election bid",
      "Eric Adams drops out of New York City mayoral race",
      "Eric Adams Drops Out Of New York City Mayoral Race",
      "Eric Adams drops out of the New York mayor's race weeks ahead of the election"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.877,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.825,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "New York City Mayor Eric Adams has suspended his re-election campaign, citing media speculation and funding issues. His withdrawal sets up a race between Democrat Zohran Mamdani, Republican Curtis Sliwa, and former Governor Andrew Cuomo, running as an independent. Adams made the announcement through a social media video. President Trump had suggested both Adams and Sliwa should drop out. The election is set for November.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Gunman Attacks Michigan Church: 1 Dead, 9 Injured, Building Set Ablaze",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sun, 28 Sep 2025 16:52:04 +0000",
    "source": "Al Jazeera",
    "sources": [
      "ABC News",
      "The Guardian",
      "Al Jazeera",
      "CityNews",
      "Deutsche Welle",
      "Global News"
    ],
    "domains": [
      "globalnews.ca",
      "www.theguardian.com",
      "abcnews.go.com",
      "www.aljazeera.com",
      "www.dw.com",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "At least eight others injured in shooting and fire at the church in Grand Blanc Township, as police name the suspect.",
      "Multiple people have been injured and one killed in a shooting at the Church of Jesus Christ of Latter-day Saints in Grand Blanc, Michigan, local police said. The church was also set alight.",
      "Multiple people were shot Sunday at the Church of Latter Day Saints in Grand Blanc, Michigan, police said.",
      "<p>Church on fire in violent weekend with shootings also in North Carolina, Texas, and New Orleans’ Bourbon Street</p><p>At least two victims are dead and eight others are injured after a shooting and a fire at a Mormon church in <a href=\"https://www.theguardian.com/us-news/michigan\">Michigan</a>, a",
      "Michigan Gov. Gretchen Whitmer said that her heart is breaking for the Grand Blanc community. “Violence anywhere especially in a place of worship, is unacceptable,” she said.",
      "GRAND BLANC TOWNSHIP, Mich. (AP) — A gunman opened fire inside a Church of Jesus Christ of Latter-day Saints chapel in Michigan during a Sunday service and set the building ablaze, killing at least two people and injuring eight others before police shot him, authorities said. Hundreds of people were"
    ],
    "image_url": "",
    "titles": [
      "At least two killed in shooting at Mormon church in Michigan, US: Police",
      "US: One dead, others wounded in shooting at Mormon church",
      "At least 10 shot, 2 fatally, at Michigan church set on fire by the gunman: Police",
      "At least two dead and eight injured after shooting at Mormon church in Michigan",
      "Suspect named, 2 dead, 8 injured in Michigan church shooting, police say",
      "2 people dead and 8 wounded in a shooting and fire at a Michigan church, police say"
    ],
    "score_components": {
      "magnitude": 0.986,
      "recency": 0.858,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.817,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A gunman attacked The Church of Jesus Christ of Latter-day Saints in Grand Blanc, Michigan, during Sunday services, resulting in at least one death and nine injuries. The assailant also set the church on fire before being shot by police. Michigan Governor Gretchen Whitmer expressed her heartbreak over the violence, emphasizing that such acts, especially in places of worship, are unacceptable. The incident is part of a violent weekend with shootings in several U.S. locations.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Blue Jays Win AL East Title, Kirk Hits 2 HRs in 13-4 Victory Over Rays",
    "domain": "sports",
    "source_domain": "sports.yahoo.com",
    "location": "national",
    "published": "Sun, 28 Sep 2025 23:39:54 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Sportsnet",
      "Global News",
      "Yahoo Sports",
      "CityNews"
    ],
    "domains": [
      "www.sportsnet.ca",
      "globalnews.ca",
      "sports.yahoo.com",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "Alejandro Kirk hit two home runs, including his first career grand slam, and the Toronto Blue Jays clinched their first AL East title in a decade by routing the Tampa Bay Rays 13-4 in their regular-season finale Sunday.  George Springer and Addison Barger also went deep for the Blue Jays, who needed",
      "Alejandro Kirk hit two homers and drove in six runs to power the Blue Jays to a 13-4 victory over the Tampa Bay Rays on Sunday to give Toronto its first American League East Division title since 2015.",
      "<p>For the first time in a decade, the Toronto Blue Jays are AL East champions.</p>",
      "<p>For the first time in a decade, the Toronto Blue Jays are back atop the American League East.</p>",
      "<p>Watch as John Schneider gives an impassioned speech to the Blue Jays after clinching the AL East division title before the team popped their celebratory champagne in the clubhouse.</p>",
      "<p>Toronto Blue Jays stars Alejandro Kirk, George Springer and manager John Schneider speak with Sportsnet&#8217;s Hazel Mae immediately after clinching the team&#8217;s first AL East title since 2015.</p>",
      "TORONTO – Six months of grinding to qualify for the meaningful games of the seventh are over and this&#160;Toronto Blue Jays&#160;season spent walking through a dream continues, with the chance to push back the awakening deep into October.&#160; An American League East title, the club’s first since "
    ],
    "image_url": "",
    "titles": [
      "Kirk hits 1st career slam as Blue Jays clinch 1st AL East title in decade with win over Rays",
      "Blue Jays beat Rays 13-4, take East title",
      "Blue Jays beat Rays to clinch first AL East title since 2015",
      "‘A wagon’: Sports world reacts to Blue Jays winning AL East title",
      "Blue Jays pop champagne in locker room after clinching AL East title",
      "Blue Jays’ Schneider, Kirk and Springer speak after clinching AL East title",
      "Blue Jays beat Rays to clinch first AL East title since 2015"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.989,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.787,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Alejandro Kirk led the Toronto Blue Jays to a 13-4 win over the Tampa Bay Rays with two home runs, securing their first AL East title since 2015. The victory in their regular-season finale was highlighted by Kirk's first career grand slam. George Springer and Addison Barger also contributed with home runs. This triumph marks the team's notable return to the top of the American League East after a decade.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Denmark Bans Civilian Drones Amid Security Concerns, Closes Airports",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sun, 28 Sep 2025 14:57:47 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Deutsche Welle",
      "Global News",
      "Al Jazeera",
      "The Guardian"
    ],
    "domains": [
      "globalnews.ca",
      "www.theguardian.com",
      "www.dw.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Drone sorties over past week have caused the temporary closures of several Danish airports, raising security concerns.",
      "Denmark is closing its entire airspace to civilian drones. The ban comes as the Nordic country prepares to host European leaders after a flurry of suspicious drone activity in recent days.",
      "<p>Civilian unmanned flights to be banned during gathering of heads of EU governments amid spate of drone incursions </p><p>Danish authorities have said drones were seen at several military sites overnight and announced that all civilian use of the unmanned aircraft will be banned this week, as Cope",
      "This is the latest unexplained drone activity after several sightings, including over five Danish airports last week."
    ],
    "image_url": "",
    "titles": [
      "Denmark bans drone flights after latest drone sightings at military bases",
      "Denmark bans civil drones after more sightings",
      "Denmark reports more drone sightings ahead of European summits",
      "Denmark reports new drone sightings over army bases, NATO ups surveillance"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.825,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.761,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Recent drone activity, including sightings over five Danish airports, has prompted Denmark to temporarily close several airports and raise security concerns. Ahead of two European leaders' summits, the Danish government announced a ban on all civilian drone flights this week, especially after drones were observed at military sites. This measure aims to enhance security amid the unexplained drone incursions.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Cincinnati Reds Clinch Playoff Spot After Mets Lose to Marlins",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sun, 28 Sep 2025 19:18:23 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "The Reds are back in the playoffs for the first time since 2020, clinching a wild-card berth after the Mets completed a months-long collapse with a loss to the Marlins.",
      "This marks Cincinnati's first postseason berth since 2020",
      "<p>The Cincinnati Reds are back in the playoffs for the first time since 2020 after overtaking the New York Mets for the National League’s third and final wild card on the season’s final weekend.</p>"
    ],
    "image_url": "",
    "titles": [
      "Reds clinch wild card as Mets complete collapse",
      "Reds clinch MLB playoff spot, take advantage of Mets' collapse to secure wild card berth",
      "Reds earn first playoff berth since 2020 after capitailzing on Mets’ collapse"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.982,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.758,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Cincinnati Reds secured a playoff spot for the first time since 2020 by clinching the National League's third wild-card berth. This came after the New York Mets lost to the Marlins, completing a significant collapse. The Reds' postseason return was confirmed on the final weekend of the season.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Giants' Malik Nabers Carted Off Field, Feared to Have Torn ACL",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sun, 28 Sep 2025 19:18:23 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Giants star wide receiver Malik Nabers is feared to have a torn ACL, a source told ESPN.",
      "Nabers jumped for a high pass and was writhing in pain when he landed",
      "<p>New York Giants star wide receiver Malik Nabers was carted from the field with an apparent injured right leg in the second quarter against the Los Angeles Chargers on Sunday.</p>"
    ],
    "image_url": "",
    "titles": [
      "Source: Giants' Nabers feared to have torn ACL",
      "Malik Nabers injury: Giants star WR believed to have torn ACL against Chargers, per report",
      "Giants’ Malik Nabers carted off, believed to have suffered torn ACL"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.982,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.758,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "New York Giants wide receiver Malik Nabers suffered an apparent right leg injury after jumping for a pass against the Los Angeles Chargers. He was carted off the field in pain. Sources fear Nabers has a torn ACL, which could significantly impact his availability for the rest of the 2025 season and potentially beyond.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Europe Retains Ryder Cup with 15-13 Victory Over USA",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 28 Sep 2025 22:35:59 GMT",
    "source": "BBC",
    "sources": [
      "Sky Sports",
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.theguardian.com",
      "www.skysports.com"
    ],
    "snippets": [
      "Watch the 18th hole between Shane Lowry and Russell Henley which sees Europe retain the Ryder Cup as the Irishman holes for birdie to earn a half-point.",
      "<ul><li><p>Irishman’s birdie takes Europe to crucial 14 points</p></li><li><p>USA stage amazing fightback but lose 15-13 overall</p></li></ul><p>Two points. Two miserly points from 11 matches. So easy to say, much harder to actually accomplish. Anybody in any doubt about that need only ask Luke Dona",
      "Shane Lowry was emotional as he was interviewed after making a crucial putt to retain the Ryder Cup.",
      "There were emotional scenes at Bethpage Black as Shane Lowry secured the vital half-point to retain the Ryder Cup for Europe."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/cb5a/live/cee75590-9cbb-11f0-b741-177e3e2c2fc7.jpg",
    "titles": [
      "How Lowry retained the Ryder Cup for Europe",
      "Lowry sinks putt that retains Ryder Cup for Europe as they hold off US comeback",
      "Lowry in tears after retaining Ryder Cup - 'Hardest couple of hours of my life!'",
      "Incredible scenes as Lowry sinks putt to retain Ryder Cup!"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.947,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.733,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Shane Lowry's birdie on the 18th hole earned Europe a crucial half-point, leading to their retention of the Ryder Cup with a 15-13 victory over the USA. Despite a strong comeback attempt by the USA, Europe reached the necessary 14 points to secure the win. Emotional scenes followed at Bethpage Black as Lowry's performance was celebrated.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UN Reimposes Sanctions on Iran Over Nuclear Concerns",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sun, 28 Sep 2025 22:26:42 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Deutsche Welle",
      "Al Jazeera",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.dw.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "The UN has reimposed sanctions that were lifted under a 2015 nuclear deal.",
      "After last-ditch nuclear talks with Western powers failed, widespread UN sanctions against Iran came back into force for the first time in a decade. Follow DW for the latest.",
      "<p>Foreign ministry attacks ‘unjustifiable’ return of measures expected to have wide effects on troubled economy</p><p>Widespread UN sanctions against Iran have come back into force for the first time in a decade, prompting anger from Tehran, after last-ditch nuclear talks with western powers failed"
    ],
    "image_url": "",
    "titles": [
      "What’s the fallout from the latest UN sanctions on Iran?",
      "Middle East updates: UN sanctions on Iran come into effect",
      "Iran angry as sweeping UN sanctions take effect after failure of nuclear talks"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.964,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.73,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The United Nations has reimposed sanctions on Iran due to concerns over its nuclear program, marking the first return of such measures in a decade. This decision comes after nuclear talks with Western powers failed, significantly affecting Iran's already troubled economy and exacerbating the financial difficulties faced by its citizens. Tehran has criticized the sanctions as \"unjustifiable.\"",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Steelers' Skylar Thompson Robbed, Incident Under Investigation",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sun, 28 Sep 2025 22:28:35 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sportsnet",
      "Sports Illustrated"
    ],
    "domains": [
      "news.google.com",
      "www.sportsnet.ca",
      "www.cbssports.com"
    ],
    "snippets": [
      "The incident occurred on Friday night",
      "<a href=\"https://news.google.com/rss/articles/CBMikgFBVV95cUxOY3pnZXdpc05lcFdITUxrSWJZdlFZWFJwNlMySTEzYmZQQWptcWtpbzVTaVItMHEtaWxEb0F6X2NFV1ViUGduZUpzZi1SNHBiX1BWQ1VrcnAzWTl1b21yeGhjbmpsSFcyOVlwWWE4Um9kQVZpOWhlQUZ4VTFhWUdZY0dHMnF6MEpmMjJaWHFDU2ZVQQ?oc=5\" target=\"_blank\">Steelers Backup QB Skylar Tho",
      "<p>The Pittsburgh Steelers confirmed that backup quarterback Skylar Thompson was involved in an incident Friday night after a report that the player had been robbed.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/28/712765b0-dcfc-41c0-9624-8e947217816a/thompson.jpg",
    "titles": [
      "Steelers QB Skylar Thompson jumped, robbed in Ireland, suffers minor injuries",
      "Steelers Backup QB Skylar Thompson Sustained Minor Injuries in Ireland Robbery - Sports Illustrated",
      "Report: Steelers backup QB Skylar Thompson robbed in Dublin"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.965,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.73,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Pittsburgh Steelers confirmed that backup quarterback Skylar Thompson was involved in an incident on Friday night, following reports that he was robbed. The current status of the situation is under investigation.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Senators Secure 2-0 Pre-Season Win Against Devils",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sun, 28 Sep 2025 23:41:33 +0000",
    "source": "Global News",
    "sources": [
      "Ottawa Citizen",
      "Global News"
    ],
    "domains": [
      "ottawacitizen.com",
      "globalnews.ca"
    ],
    "snippets": [
      "Stephen Halliday scored on the power play and Olle Lycksell scored into an empty net as the Ottawa Senators defeated the New Jersey Devils 2-0 in NHL pre-season action on Sunday at the Videotron Centre.",
      "Rookie centre Stephen Halliday scored the third-period winner as the Senators picked up their second victory of the pre-season"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/5ee59b15d0a74103bbd3509d2c16e975c33e42411b2fa0a44b19f3473754a80d.jpg?quality=65&strip=all",
    "titles": [
      "Ullmark nets shutout as Senators beat Devils 2-0",
      "Takeaways: Linus Ullmark makes 14 stops in Ottawa Senators' victory over Devils"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.989,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.717,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Stephen Halliday and Olle Lycksell scored for the Ottawa Senators in a 2-0 win against the New Jersey Devils during an NHL pre-season game on Sunday at the Videotron Centre. Halliday's goal came in the third period on a power play, securing the Senators' second pre-season victory. Lycksell's goal was scored into an empty net.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Calgary Stampeders Acquire Lorenzo Mauldin IV from Ottawa Redblacks",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sun, 28 Sep 2025 22:39:08 +0000",
    "source": "Global News",
    "sources": [
      "Ottawa Citizen",
      "Global News"
    ],
    "domains": [
      "ottawacitizen.com",
      "globalnews.ca"
    ],
    "snippets": [
      "The Calgary Stampeders acquired all-star American defensive lineman Lorenzo Mauldin IV on Sunday in a trade with the Ottawa Redblacks.",
      "The Calgary Stampeders acquired all-star American defensive lineman Lorenzo Mauldin IV on Sunday in a trade with the Ottawa Redblacks. Ottawa got a fourth-round pick in the 2026 Canadian Football League draft in return. The Redblacks have a 4-10 record this season, which is the worst record among th"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/35f544e9af9cb37edc23a029a411c340477b8d6f03ee5b12fd023f39dc225093.jpg?quality=65&strip=all",
    "titles": [
      "Stampeders get all-star Lorenzo Mauldin IV",
      "Redblacks trade all-star Lorenzo Mauldin IV to Stampeders"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.968,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.699,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Calgary Stampeders traded for all-star American defensive lineman Lorenzo Mauldin IV from the Ottawa Redblacks on Sunday, exchanging a fourth-round pick in the 2026 CFL draft. The trade comes as the Redblacks hold a 4-10 season record, the lowest in the league.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Anthony Stolarz Secures 4-Year, $15M Deal with Toronto Maple Leafs",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sun, 28 Sep 2025 19:07:34 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "NHL"
    ],
    "domains": [
      "news.google.com",
      "globalnews.ca"
    ],
    "snippets": [
      "Goalie Anthony Stolarz and the Toronto Maple Leafs have agreed to a four-year contract extension.",
      "<a href=\"https://news.google.com/rss/articles/CBMikwFBVV95cUxPRGNCc2ZOOWZmNE9oQzBob0NkTFpNUjZ5aFdGZlI4cHI4c0FRTXJoWDBQdEE0SFJYYkJRQzR6QnZubl8wcGtleGs0M2tvOUtjOTVQZ04zV2NWRzY3eFpkU3o2dmpBQVYtdnFUay1HMnZZVnlNa3o5RXc5RW5INldzeGhPSkNDQm0zVzJFRmhYbnJmSVU?oc=5\" target=\"_blank\">Stolarz signs 4-year, $15 mi",
      "<a href=\"https://news.google.com/rss/articles/CBMigwFBVV95cUxPYThrdnVUZVdLeHRIaFMybEkyNTFzUlRKeFVfVzIwRFFaTi1pLUtJWEtsVkt0OXBnbHZLLWk3eXlyV1gxdVJmRHM3WFRlQXU5RW5KeVFTTldxdm9EcVI0NTdpM2dyTWNaeHZWNmh4Ui1MM1JNNFVYb2dCSXFQdG96Y0xxQQ?oc=5\" target=\"_blank\">Fowler signs 3-year, $18.3 million contract with ",
      "<a href=\"https://news.google.com/rss/articles/CBMihwFBVV95cUxNcW5fWUdQQ2FLQUlmMXB3eHNab0F3ektUUXVVTEhVb202ckFLRUxOV2d6X1lWanV5bGRlUVpfLWZJRmV3R1RPRjN6d2c2eG0yX2tVS1ExbFE3cFAwVGg5bTVJZmV1bHhpY3lWT1dvTTlLelVKZTdPcWlIQmNRYTd6X0V0amRlWVU?oc=5\" target=\"_blank\">McTavish signs 6-year contract with Ducks</a"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/bf7a3286377e0a5839a285ffdce045e381f0b808bcacf3e801dd6e6e4377e00b.jpg?quality=65&strip=all",
    "titles": [
      "Stolarz signs four-year extension with Maple Leafs",
      "Stolarz signs 4-year, $15 million contract with Maple Leafs - NHL.com",
      "Fowler signs 3-year, $18.3 million contract with Blues - NHL.com",
      "McTavish signs 6-year contract with Ducks - NHL.com"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.9,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.685,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Anthony Stolarz has signed a four-year, $15 million contract extension with the Toronto Maple Leafs, securing his position as a goalie for the team. This agreement reflects the team's commitment to Stolarz as a key player in their lineup.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Stowaway Found Dead in Plane's Landing Gear in North Carolina",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sun, 28 Sep 2025 17:48:33 -0400",
    "source": "NPR",
    "sources": [
      "ABC News",
      "NPR"
    ],
    "domains": [
      "abcnews.go.com",
      "www.npr.org"
    ],
    "snippets": [
      "Police say maintenance workers discovered the body Sunday morning after the plane landed from Europe.",
      "A stowaway was found dead Sunday in the landing gear of an American Airlines flight that arrived in North Carolina from Europe, according to police."
    ],
    "image_url": "",
    "titles": [
      "Stowaway found dead in landing gear of American Airlines flight in Charlotte",
      "Stowaway found dead inside landing gear of an American Airlines flight"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.951,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.67,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A stowaway was found dead in the landing gear of an American Airlines flight from Europe upon its arrival in North Carolina on Sunday, police reported. Maintenance workers discovered the body that morning.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "U.S. Citizen Amir Amiry Released from Detention in Afghanistan",
    "domain": "general",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Sun, 28 Sep 2025 17:46:37 -0400",
    "source": "ABC News",
    "sources": [
      "ABC News",
      "New York Times"
    ],
    "domains": [
      "www.nytimes.com",
      "abcnews.go.com"
    ],
    "snippets": [
      "Secretary of State Marco Rubio announced in a statement Sunday the release of U.S. citizen Amir Amiry, who had been considered wrongfully detained in Afghanistan.",
      "The move comes as the country seeks to break the international isolation it has faced since the Taliban seized power in 2021."
    ],
    "image_url": "https://s.abcnews.com/images/Politics/amiri-released-20250928-ap-jh_1759094262474_hpMain_4x3t_384.jpg",
    "titles": [
      "Rubio announces release of US citizen held by Afghanistan",
      "Afghanistan Frees a U.S. Citizen Held in Prison"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.951,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.655,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "U.S. citizen Amir Amiry, previously deemed wrongfully detained in Afghanistan, has been released, announced Secretary of State Marco Rubio. This development occurs as Afghanistan aims to mitigate its global isolation following the Taliban's takeover in 2021.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Shares, Then Deletes Fake Fox News Clip on Miracle Tech",
    "domain": "business",
    "source_domain": "www.forbes.com",
    "location": "global",
    "published": "Sun, 28 Sep 2025 17:01:54 -0400",
    "source": "Forbes",
    "sources": [
      "The Verge",
      "Forbes"
    ],
    "domains": [
      "www.forbes.com",
      "www.theverge.com"
    ],
    "snippets": [
      "Some conspiracy theorists have popularized the fictional technology, which they believe holds miracle cures.",
      "Donald Trump is no stranger to outlandish conspiracies or strange social media posts. But, by any measure, his post on Saturday night was particularly bizarre. The president posted (and later removed) a clip on Truth Social of a fake Fox News segment with Lara Trump detailing the White House’s annou"
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/68d9a1f2b357c926da4283c1/0x0.jpg?width=960&precrop=2680%2C1508%2Cx0%2Cy147",
    "titles": [
      "Trump Deletes Post Referencing Bizarre ‘Medbed’ Conspiracy Theory",
      "Trump posts, then pulls bizarre AI video promoting MedBed conspiracy"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.936,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.649,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Former President Donald Trump shared and then removed a fake Fox News clip on Truth Social, involving a fictional technology claimed by some conspiracy theorists to offer miracle cures. The post, featuring Lara Trump discussing the White House's announcement of the technology, was notably strange even by Trump's standards for engaging with outlandish conspiracy theories.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Al Horford Joins Golden State Warriors with Multi-Year Deal",
    "domain": "business",
    "source_domain": "www.forbes.com",
    "location": "global",
    "published": "Sun, 28 Sep 2025 14:44:52 -0400",
    "source": "Forbes",
    "sources": [
      "Sportsnet",
      "Forbes"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.forbes.com"
    ],
    "snippets": [
      "Al Horford has signed a multi-year deal with the Golden State Warriors according to ESPN’s Shams Charania. The 19th year veteran looks to add to the Warriors reserves.",
      "<p>The Golden State Warriors have made a big late off-season addition. Al Horford has agreed on a multi-year contract with the club, ESPN&#8217;s Shams Charania reported on Sunday.</p>"
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/68d981a6e624c230a731bdd2/0x0.jpg?width=960",
    "titles": [
      "Al Horford Signs Multi-Year Deal With Golden State Warriors",
      "Report: Al Horford joins Warriors on multi-year contract"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.893,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.634,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Al Horford, a 19-year veteran of the NBA, has signed a multi-year contract with the Golden State Warriors, as reported by ESPN's Shams Charania. This move adds Horford to the Warriors' bench, strengthening their lineup as they aim for another title.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Global Citizen Festival with Shakira, Cardi B Exceeds Fundraising Goals",
    "domain": "business",
    "source_domain": "financialpost.com",
    "location": "national",
    "published": "Sun, 28 Sep 2025 16:23:34 +0000",
    "source": "Financial Post",
    "sources": [
      "CityNews",
      "Financial Post"
    ],
    "domains": [
      "financialpost.com",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "NEW YORK (AP) &#8212; Global Citizen surpassed its fundraising goals for Amazon rainforest protection, African energy access and community education at the antipoverty nonprofit&#8217;s annual music festival in New York&#8217;s Central Park, headlined by Shakira and late addition Cardi B. Internatio",
      "NEW YORK (AP) — Global Citizen surpassed its fundraising goals for Amazon rainforest protection, African energy access and community education at the antipoverty nonprofit’s annual music festival in New York’s Central Park, headlined by Shakira and late addition Cardi B. Internationally recognized a"
    ],
    "image_url": "",
    "titles": [
      "Tyla and Liza Koshy help remind the Global Citizen Festival audience of their collective power",
      "Tyla and Liza Koshy help remind the Global Citizen Festival audience of their collective power"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.85,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.632,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Global Citizen's annual music festival in Central Park, New York, featuring Shakira and Cardi B, exceeded its fundraising targets for Amazon rainforest protection, African energy access, and community education.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Swiss Voters Narrowly Approve Electronic ID Cards in Referendum",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 28 Sep 2025 15:55:38 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "The proposal was backed by 50.4% of voters, in the second Swiss ballot on the issue in four years.",
      "<p>Pollsters confounded by 50.4% support for e-IDs after forecasting stronger backing for ‘yes’ vote  </p><p>Swiss voters have backed plans for electronic identity cards by a wafer-thin margin, in the second nationwide vote on the issue.</p><p>In a referendum on Sunday, 50.4% of voters supported an "
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/bad5/live/82dc66a0-9c7e-11f0-95c6-7592d7636e22.jpg",
    "titles": [
      "Swiss voters narrowly approve plan for electronic ID cards",
      "Swiss voters back electronic identity cards in close vote"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.824,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.63,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Swiss voters narrowly approved the introduction of electronic identity cards, with 50.4% in favor in a recent referendum. This marks the second vote on the issue within four years, defying pollsters' expectations of stronger support for the proposal.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Pogačar Wins Men's Road Race World Title Again in Rwanda",
    "domain": "business",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Sun, 28 Sep 2025 16:53:01 GMT",
    "source": "The Guardian",
    "sources": [
      "Forbes",
      "The Guardian"
    ],
    "domains": [
      "www.forbes.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "<ul><li><p>Pogacar reclaims rainbow jersey he won last year</p></li><li><p>Remco Evenepoel second, Ireland’s Ben Healy third</p></li></ul><p>Tadej Pogacar lit up Kigali’s climbs with a trademark long-range attack to claim a second consecutive men’s road race world title on Sunday.</p><p>There was an",
      "Tadej Pogačar became the first rider to win the Tour de France and World Championship Road race in consecutive seasons on Sunday in Kigali, Rwanda."
    ],
    "image_url": "https://i.guim.co.uk/img/media/6f1c6605bc7cb4416400b7907e51d6f19abdd846/613_0_6133_4907/master/6133.jpg?width=140&quality=85&auto=format&fit=max&s=25b79da1f104e6a324d0f49808ba8cd8",
    "titles": [
      "Unstoppable Tadej Pogacar defends men’s road race world title in Rwanda",
      "Tadej Pogačar Defends Road World Championship Title In Solo Victory"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.841,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.63,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Tadej Pogačar won the men's road race world title for the second consecutive year in Kigali, Rwanda, with a long-range attack. He became the first rider to win both the Tour de France and the World Championship Road race in consecutive seasons. Remco Evenepoel finished second, and Ireland’s Ben Healy came in third.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Gov Backs Carmaker with £1.5bn Loan After Cyber-Attack Halts Production",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 28 Sep 2025 15:38:20 GMT",
    "source": "BBC",
    "sources": [
      "Financial Times",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.ft.com"
    ],
    "snippets": [
      "Liam Byrne spoke after the government announced it was backing a £1.5bn loan to the company, and warned cyber-attacks could become more common.",
      "Carmaker receives official backing after cyber attack that has halted production"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/d262/live/65281cd0-9c5b-11f0-b66e-67a4632b8ff2.jpg",
    "titles": [
      "Jaguar Land Rover may need more than £1.5bn government loan guarantee, MP says",
      "‘Moral hazard’ warning after £1.5bn government loan guarantee for JLR"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.819,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.629,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The government has supported a carmaker with a £1.5bn loan following a cyber-attack that stopped production. Liam Byrne highlighted the incident as a warning that cyber-attacks may increase in frequency.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Government Shutdown Looms, Stocks Stay Resilient in September",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Sun, 28 Sep 2025 16:07:19 GMT",
    "source": "Axios",
    "sources": [
      "MarketWatch",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "www.marketwatch.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMifEFVX3lxTE5iWldBRFA4eWd0VkFPZHdBcTg4bFh0N2xxUTZ4NWdTajN6RGYzOGQ4dDlNU2V2dG5raXhjWTJENUlybF9fM280RnJhXzFHcmMxNkh0YmZ4OXpkMDdxSXFGcTJqOExrcjZkUzh0a2FIY01oWlBnWXUxY2w3ODg?oc=5\" target=\"_blank\">No one wants to shoulder the government shutdown blame</a>&n",
      "Stocks are defying their typical weakness in September — but it isn’t October yet"
    ],
    "image_url": "",
    "titles": [
      "No one wants to shoulder the government shutdown blame - Axios",
      "The last thing the stock market wants right now is a government shutdown. Here’s why."
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.828,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.628,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Amid concerns over a potential government shutdown, no party is willing to take the blame for the impasse. Meanwhile, contrary to usual trends, stock markets have shown resilience in September, although the situation could change with the arrival of October.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Russia Deploys Kamikaze Drones in Kyiv After Zelensky-Trump Meeting",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sun, 28 Sep 2025 13:44:37 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Washington Post"
    ],
    "domains": [
      "www.washingtonpost.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Russia has launched a heavy attack on Ukraine with hundreds of kamikaze drones hitting residential buildings in Kyiv.",
      "Russia’s missile and drone attack came days after Ukrainian President Volodymyr Zelensky’s meeting with President Donald Trump at the U.N. General Assembly."
    ],
    "image_url": "",
    "titles": [
      "Heavy Russian drone attack kills at least four in Ukraine’s capital Kyiv",
      "Four dead as massive Russian attack hits Kyiv, other Ukrainian cities"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.804,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.623,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Russia launched a significant attack on Ukraine, employing hundreds of kamikaze drones targeting residential areas in Kyiv. This aggressive action followed shortly after Ukrainian President Volodymyr Zelensky's meeting with President Donald Trump at the U.N. General Assembly.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "British Singer Lola Young Collapses on Stage in New York, Says She's \"OK\"",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 28 Sep 2025 14:03:32 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Lola Young was performing at a festival when she appeared to drop her microphone and fall backwards.",
      "<p>British singer thanks fans for support after incident at gig, during which she had told crowd of ‘tricky couple of days’</p><p>The British singer Lola Young has said she is “doing OK” after collapsing on stage during a festival performance in New York.</p><p>In footage posted on social media, the"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/152d/live/a091b3f0-9c77-11f0-8277-67a32d4ec754.jpg",
    "titles": [
      "Lola Young 'doing OK' after collapsing on stage during gig",
      "Lola Young ‘doing OK’ after collapsing on stage at festival in New York"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.793,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.621,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "British singer Lola Young collapsed on stage during a New York festival performance after mentioning she had a \"tricky couple of days.\" She later assured fans she is \"doing OK\" through social media. The incident involved her dropping her microphone and falling backwards, which was captured in online footage.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]