[
  {
    "title": "Saskatchewan Issues Overdose Alerts for Regina, Saskatoon Amid Drug Spike",
    "domain": "general",
    "location": "national",
    "published": "Fri, 13 Jun 2025 23:45:41 +0000",
    "source": "Global News",
    "sources": [
      "Global News"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "Saskatchewan's Health Ministry has issued overdose alerts for both Regina and Saskatoon after first responders saw a high number of overdoses and dangerous drugs in the last week."
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/06/ambulance.jpg?quality=85&strip=all",
    "titles": [
      "More overdose alerts issued for Regina and Saskatoon"
    ],
    "summary": "Saskatchewan's Health Ministry has issued overdose alerts for Regina and Saskatoon following a spike in overdoses and the presence of dangerous drugs reported by first responders in the past week. This action highlights the increasing concern for public health and safety in these areas.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story is constructive as it raises awareness about a serious public health concern and could potentially save lives by alerting people to the danger. However, it does not provide any solutions or deeper insights into the problem, thus limiting its usefulness and progress.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.992,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 1.0
    },
    "score": 0.47
  },
  {
    "title": "Smith Advocates Team Canada Approach for Indigenous Concerns",
    "domain": "general",
    "location": "national",
    "published": "Fri, 13 Jun 2025 23:34:27 +0000",
    "source": "Global News",
    "sources": [
      "Global News"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "Danielle Smith is leaning on the Team Canada approach but does acknowledge that there still need to be work to address Indigenous concerns."
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/06/a6ff8d1521f74c1f201b1d8cb4abc2a0fed7eb9cb0e579ae20cddd09b4c59826.jpg?quality=85&strip=all",
    "titles": [
      "Danielle Smith pitches B.C. on pipeline project, saying it benefits ‘all Canadians’"
    ],
    "summary": "Danielle Smith advocates for a Team Canada approach, acknowledging ongoing efforts are necessary to address Indigenous concerns. This stance highlights a commitment to unity while recognizing the importance of addressing specific issues facing Indigenous communities.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it discusses a possible solution to address Indigenous concerns and promotes unity. However, it could provide more detailed information about the specific issues facing Indigenous communities and how the proposed approach would address them.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.988,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 1.0
    },
    "score": 0.49
  },
  {
    "title": "Seawatch Homes' Value Plummets to $2 After Vandalism Surge",
    "domain": "general",
    "location": "national",
    "published": "Fri, 13 Jun 2025 23:25:29 +0000",
    "source": "Global News",
    "sources": [
      "Global News"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "In the years since, the houses in the Seawatch subdivision have been vandalized and their assessed value has dropped from about a million dollars to two dollars."
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2022/10/seawatch.png",
    "titles": [
      "Broken glass, shattered dreams: No money for Sunshine Coast neighbourhood homeowners"
    ],
    "summary": "Homes in the Seawatch subdivision have experienced significant vandalism over the years, leading to a drastic decrease in their assessed value. Originally valued at approximately one million dollars, these properties are now assessed at just two dollars.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story raises awareness about the issue of vandalism and its impact on property values. However, it does not provide any actionable insights for readers or discuss potential solutions to the problem, limiting its usefulness and progress.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.985,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 1.0
    },
    "score": 0.459
  },
  {
    "title": "B.C. Real Estate Sales, Prices Fall for Fifth Consecutive Month",
    "domain": "general",
    "location": "national",
    "published": "Fri, 13 Jun 2025 23:25:27 +0000",
    "source": "Global News",
    "sources": [
      "Global News"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "Both sales and prices slumped last month, according to data B.C. Real Estate Association -- part of a provincewide trend of sluggish sales activity over the last five months."
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/06/354060325c7578fde5b35985befae870a62a2ed10ad811a5617dfd0a68c2395a_a28553.jpg?quality=85&strip=all",
    "titles": [
      "Sellers ‘aren’t budging’ as inventory builds up in tariff-saddled B.C. real estate market"
    ],
    "summary": "Last month, the B.C. Real Estate Association reported a provincewide decrease in both sales and prices, continuing a five-month trend of sluggish sales activity across British Columbia.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the current state of the real estate market in British Columbia, which could be helpful for potential buyers, sellers, or investors. However, it doesn't provide any insight into why this trend is happening, what it might mean for the future, or any potential solutions or strategies to deal with it.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.985,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 1.0
    },
    "score": 0.469
  },
  {
    "title": "Fire Destroys Historic Robertson's Trading Post in La Ronge",
    "domain": "general",
    "location": "national",
    "published": "Fri, 13 Jun 2025 23:20:46 +0000",
    "source": "Global News",
    "sources": [
      "Global News"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "The iconic Robertson's Trading Post in La Ronge, Sask. went up in flames. Owner Scott Robertson is still coming to terms with the shocking loss"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/06/Robertsons-Aftermath-PKG.jpg?quality=85&strip=all",
    "titles": [
      "Owner of iconic La Ronge business grapples with wildfire decimation"
    ],
    "summary": "The Robertson's Trading Post, a well-known establishment in La Ronge, Saskatchewan, was destroyed by fire. The owner, Scott Robertson, is currently dealing with the aftermath and loss of the business. This event marks a significant loss for the community and the Robertson family.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness of a tragic event in a local community, but it doesn't provide much depth or insight beyond the immediate facts of the situation. It doesn't explore the cause of the fire, the impact on the community, or any potential plans for recovery or rebuilding.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.983,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 1.0
    },
    "score": 0.459
  },
  {
    "title": "Verstappen Embraces \"Villain\" Persona Ahead of Canadian Grand Prix",
    "domain": "general",
    "location": "global",
    "published": "Fri, 13 Jun 2025 23:11:35 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "<p>Dutch four-time world champion rose to fame as something of a scoundrel and has showed signs of reverting to type</p><p>Max Verstappen rose to fame as something of a villain. As the Formula One circuit hops back across the Atlantic for the weekend’s Canadian Grand Prix, he appears on the verge of reclaiming the role.</p><p>Like Tim Robbins’ strong-armed and hot-headed Nuke LaLoosh character in the baseball film Bull Durham, the brash Dutch phenomenon announced his presence with authority – undeniable skills and unfortunate lapses in judgment or focus. He became well acquainted with the..."
    ],
    "image_url": "https://i.guim.co.uk/img/media/7a8940afceac39d8bf5f5363b0c810de910f65bc/767_505_5101_4081/master/5101.jpg?width=140&quality=85&auto=format&fit=max&s=5c3a73d2181a114b1370b8c6cbc1c13a",
    "titles": [
      "Why Verstappen the Villain and Verstappen the Vulnerable are great for F1"
    ],
    "summary": "Max Verstappen, a four-time world champion in Formula One, has gained notoriety for his bold and sometimes controversial behavior on the track, reminiscent of a \"scoundrel\" or \"villain\" persona. As the F1 circuit moves to the Canadian Grand Prix, there are indications that Verstappen is embracing this role again. His career has been marked by exceptional talent and occasional lapses in judgment, drawing comparisons to the fictional character Nuke LaLoosh from the movie \"Bull Durham\" for his strong performance and fiery temperament.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides a deeper understanding of a prominent figure in Formula One racing, Max Verstappen. It offers insight into his persona and behavior, which could be useful for fans or followers of the sport. However, it doesn't necessarily provide actionable insights or report on progress or solutions.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.98,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.445
  },
  {
    "title": "Republicans Criticize Padilla's Approach in Questioning Noem",
    "domain": "general",
    "location": "national",
    "published": "Fri, 13 Jun 2025 23:06:09 GMT",
    "source": "LA Times",
    "sources": [
      "LA Times"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "<p>Republicans continued to chastise Padilla, using words like \"launch,\" \"lunge\" and \"bum rush\" to describe Padilla's behavior as he began to try to pose a question to Noem.</p>"
    ],
    "image_url": "",
    "titles": [
      "The Alex Padilla altercation was captured on video but still seen through a political lens"
    ],
    "summary": "Republicans criticized Padilla for his approach in attempting to ask Noem a question, using terms such as \"launch,\" \"lunge,\" and \"bum rush\" to describe his actions. This indicates a negative perception of Padilla's behavior by the Republican members during the incident.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers basic awareness about a political incident but does not provide any deeper insights or value. It doesn't provide any context or background about the incident, nor does it offer any solutions or progress towards resolving the issue.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.978,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.388
  },
  {
    "title": "NHS Confederation Chair Highlights Racial Disparities in Healthcare",
    "domain": "general",
    "location": "global",
    "published": "Fri, 13 Jun 2025 23:01:32 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "<p>Victor Adebowale says failure to detect his mother’s cancer was example of ‘black service, not NHS service’</p><p>A senior figure in the health service has criticised it for deep-seated racism after his mother “got a black service, not an NHS service” before she died.</p><p><a href=\"https://www.nhsconfed.org/people/victor-adebowale-cbe\">Victor Adebowale</a>, the chair of the NHS Confederation, claimed his mother Grace’s lung cancer went undiagnosed because black people get “disproportionately poor” health service care.</p><p>Black British mothers are up to four times more likely to die..."
    ],
    "image_url": "https://i.guim.co.uk/img/media/89c7acad5cffb2def8054da39af1c3c8f4521f98/0_0_1124_899/master/1124.jpg?width=140&quality=85&auto=format&fit=max&s=cd671013c79aa7fc3527f2da393c2db7",
    "titles": [
      "Senior health figure accuses NHS of racism over care given to dying mother"
    ],
    "summary": "Victor Adebowale, chair of the NHS Confederation, criticized the NHS for systemic racism, stating his mother's lung cancer was undiagnosed due to poor service to black people. He highlighted that black British mothers face significantly higher mortality rates, suggesting deep-seated racial disparities in healthcare quality.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive as it highlights a significant issue of racial disparities in healthcare. It provides useful insights into the systemic racism in the NHS and its impacts. It also raises awareness about the problem, contributing to the reader's understanding and potentially influencing decision-making.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.976,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.454
  },
  {
    "title": "Ilia Topuria Targets Paddy Pimblett for Next UFC Fight to Settle Rivalry",
    "domain": "sports",
    "location": "national",
    "published": "Fri, 13 Jun 2025 23:50:29 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "If he could choose, former UFC featherweight champion Ilia Topuria would choose Paddy Pimblett next to settle their rivalry."
    ],
    "image_url": "",
    "titles": [
      "Ilia Topuria sounds off on rival: 'Who the f*ck is Paddy Pimblett right now?'"
    ],
    "summary": "Former UFC featherweight champion Ilia Topuria has expressed his desire to fight Paddy Pimblett next, aiming to resolve their ongoing rivalry. This statement highlights Topuria's preference for his next opponent in the UFC arena, focusing on settling differences through a competitive match.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness about a rivalry in the UFC and the desire of one fighter to resolve it through a match. However, it doesn't provide deeper insights into the context or causes of the rivalry, nor does it offer any actionable insights for the reader.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.993,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.41
  },
  {
    "title": "Dimock/Emery Baseball Field in Emery, SD Unveils First Upgrades",
    "domain": "sports",
    "location": "national",
    "published": "Fri, 13 Jun 2025 23:48:00 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Jun. 13—EMERY, S.D. — Players and fans were treated to a different look when the Dimock/Emery amateur baseball team took the field at home for the first time this season. The Raptors' home baseball field in Emery, nicknamed Raptors Field, unveiled the first of a series of upgrades aimed at improving the overall experience for both the players, the fans and the various youth programs that use ..."
    ],
    "image_url": "",
    "titles": [
      "Dimock/Emery's ballpark upgrades part of a community-driven effort"
    ],
    "summary": "The Dimock/Emery amateur baseball team's home field in Emery, South Dakota, known as Raptors Field, introduced its first series of enhancements aimed at enhancing the experience for players, fans, and youth programs. This marked a significant improvement as the team played at home for the first time this season.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive because it reports on improvements and innovations at a local baseball field. It provides useful information for players, fans, and youth programs who use the field, and it highlights progress in the community's sports infrastructure.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.992,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.45
  },
  {
    "title": "Philippines Defeats Belgium, Advances to Knockout Stage in Darts World Cup",
    "domain": "sports",
    "location": "global",
    "published": "Fri, 13 Jun 2025 23:47:00 BST",
    "source": "Sky Sports",
    "sources": [
      "Sky Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Philippines caused a major upset on Day Two at the BetVictor World Cup of Darts, dumping out former finalists Belgium to book their place in the knockout stages."
    ],
    "image_url": "https://e2.365dm.com/25/06/1920x1080/skysports-world-cup-of-darts_6941636.jpg?20250613231428",
    "titles": [
      "Philippines shock Belgium as England draw Germany at World Cup of Darts"
    ],
    "summary": "On Day Two of the BetVictor World Cup of Darts, the Philippines achieved a significant victory by defeating Belgium, a team that had previously reached the finals. This win secured the Philippines a spot in the knockout stages of the tournament.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness about the progress of the Philippines team in the Darts World Cup, but it doesn't provide deeper insight into the strategies used, the significance of this victory, or the impact on the team's future performance.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.992,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.41
  },
  {
    "title": "Ohio State Buckeyes Receive Positive Update on Key Playmaker",
    "domain": "sports",
    "location": "national",
    "published": "Fri, 13 Jun 2025 23:45:39 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "The Ohio State Buckeyes received a great update from a highly touted playmaker."
    ],
    "image_url": "",
    "titles": [
      "Ohio State Football Gets Good News on Chances to Land Coveted Playmaker on Friday"
    ],
    "summary": "The Ohio State Buckeyes football team received a positive update regarding a highly regarded playmaker, indicating a beneficial development for the team. The specifics of the update, such as the nature of the news or the identity of the playmaker, were not provided. This development is expected to positively impact the team's performance.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story lacks detailed information and does not provide actionable insights or deeper understanding. It mentions a positive update but does not specify what the update is or who the playmaker is, limiting its usefulness and depth.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.992,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.39
  },
  {
    "title": "Campbell, 39, Prepares for Training Camp with Light Offseason Program",
    "domain": "sports",
    "location": "national",
    "published": "Fri, 13 Jun 2025 23:44:12 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Campbell, almost 39 years old, took it easy in the offseason program but says he will be ready when training camp starts"
    ],
    "image_url": "",
    "titles": [
      "Arizona Cardinals DL Calais Campbell took it easy but will be ready in training camp"
    ],
    "summary": "Campbell, nearing 39, participated lightly in the offseason program. He stated he would be fully prepared for the start of training camp.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information for fans and followers about Campbell's preparation strategy for the training camp. However, it doesn't report on solutions, improvements, or innovations, or increase clarity around systems, causes, trends, or impacts.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.991,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.427
  },
  {
    "title": "Atlanta Falcons to Offer 11 Open Practices, Including Two with Titans",
    "domain": "sports",
    "location": "national",
    "published": "Fri, 13 Jun 2025 23:41:02 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "The Atlanta Falcons will hold 11 open practices available to fans, including two as a joint practice with the Tennessee Titans"
    ],
    "image_url": "",
    "titles": [
      "Open Practice Dates And Times Announced For The Atlanta Falcons"
    ],
    "summary": "The Atlanta Falcons have announced that they will offer 11 open practices for fans to attend. Among these, two will be joint practices with the Tennessee Titans. This move allows fans to engage closely with the team's preseason preparations.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The story informs about the Atlanta Falcons' decision to offer open practices, which is a solution to increase fan engagement. It also provides actionable insights for fans who wish to attend these practices. However, it lacks a deeper understanding or context about the decision.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.99,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.44
  },
  {
    "title": "J.K. Dobbins Surprised by Chargers Not Re-signing Him, Explores Free Agency",
    "domain": "sports",
    "location": "national",
    "published": "Fri, 13 Jun 2025 23:40:12 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "J.K. Dobbins had a shocking message for the Chargers after they didn’t re-sign him."
    ],
    "image_url": "",
    "titles": [
      "JK Dobbins Has Strong Warning for Chargers After Joining AFC West Rival"
    ],
    "summary": "J.K. Dobbins expressed surprise and disappointment towards the Chargers for not re-signing him. His message highlighted his unexpected free agency status, conveying a sense of shock at the team's decision. The outcome is that Dobbins is now exploring his options as a free agent, following the Chargers' choice not to renew his contract.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness about J.K. Dobbins' current status and his reaction to the Chargers' decision. However, it doesn't provide deeper insights into the reasons behind the decision or its implications for Dobbins' career or the Chargers' team composition.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.99,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.41
  },
  {
    "title": "Adam Nightingale Signs Contract Extension with MSU",
    "domain": "sports",
    "location": "national",
    "published": "Fri, 13 Jun 2025 23:40:03 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "There was a key update in Adam Nightingale's contract extension that suggests he won't be leaving MSU anytime soon"
    ],
    "image_url": "",
    "titles": [
      "Key contract detail suggests Adam Nightingale will be with MSU hockey for long haul"
    ],
    "summary": "Adam Nightingale has secured a contract extension with Michigan State University (MSU), indicating he will remain with the institution for the foreseeable future. This update reinforces Nightingale's commitment to MSU and dispels any rumors of his potential departure.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about the contract extension of Adam Nightingale with MSU. However, it doesn't offer any actionable insights or deeper understanding of the implications of this decision.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.99,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.41
  },
  {
    "title": "Trump Approves U.S. Steel and Nippon Steel Merger After Security Pact",
    "domain": "business",
    "location": "national",
    "published": "Fri, 13 Jun 2025 23:58:37 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "President Donald Trump issued an executive order on Friday approving U.S. Steel's merger with Japan's Nippon Steel, after the companies signed a national security agreement with the U.S. government."
    ],
    "image_url": "",
    "titles": [
      "Trump approves U.S. Steel merger with Japan’s Nippon after companies sign national security agreement"
    ],
    "summary": "On Friday, President Donald Trump signed an executive order approving the merger between U.S. Steel and Japan's Nippon Steel. This decision came after both companies entered into a national security agreement with the U.S. government, ensuring the merger's compliance with national security considerations.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The story informs about a significant event - the merger between U.S. Steel and Nippon Steel, and the role of the U.S. government in it. It provides useful context about the national security agreement, which can help readers understand the implications of such mergers.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.996,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.448
  },
  {
    "title": "Oracle Investors See Best Week Since April 2001",
    "domain": "business",
    "location": "national",
    "published": "Fri, 13 Jun 2025 21:43:41 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Oracle investors haven't had a week this good since April 2001, after the stock had collapsed in the dot-com crash."
    ],
    "image_url": "",
    "titles": [
      "Oracle's stock closes out best week since 2001 on cloud momentum"
    ],
    "summary": "Oracle investors experienced their best week since April 2001, marking a significant rebound from the lows following the dot-com crash. This positive shift represents a notable recovery and milestone for the company's stock performance.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story informs about Oracle's stock performance, which could be useful for investors and those interested in the tech industry. However, it doesn't provide much depth or insight into why the company's stock has rebounded or what this might mean for its future.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.95,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.412
  },
  {
    "title": "23andMe Co-Founder Wins Bid for Valuable Genetic Data Collection",
    "domain": "business",
    "location": "global",
    "published": "Fri, 13 Jun 2025 21:40:00 GMT",
    "source": "Bloomberg",
    "sources": [
      "Bloomberg"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMirwFBVV95cUxOMnF6WWJCYUJsUUVhRm56dWpERUNRaHkzVXA5VF9hY1N6VjNjenFCazVBZHFKWUlUX24yNURmbG9SM1QwQ0xVdkQzcFJKc1ZtX24xWTJndHRrZzI4NmROeThuRkZJb2Q3Ui1Sd2dESmRMVUlyY2VlOFkwaEwtWDQ4R1E1aS1iTGZyRlB1ZS1FRTg1SmxjVDZIbExHOC1DNnRmQzQ2SklhLVFZRXRIY2ZF?oc=5\" target=\"_blank\">23andMe Co-Founder Wins Auction for Genetic Data</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Bloomberg</font>"
    ],
    "image_url": "",
    "titles": [
      "23andMe Co-Founder Wins Auction for Genetic Data - Bloomberg"
    ],
    "summary": "23andMe Co-Founder wins an auction for a valuable collection of genetic data. The acquisition marks a significant move in the field of genetics, emphasizing the importance and value of genetic information in today's scientific and medical research. The current status of the story highlights the successful bid and acquisition of the genetic data by the 23andMe Co-Founder, reflecting the ongoing interest and investment in genetic research and data.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it provides useful information about the importance of genetic data in scientific and medical research. It also highlights the progress in the field of genetics, with the successful acquisition of valuable genetic data by a key player in the industry.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.949,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.432
  },
  {
    "title": "Oracle Shares Rise for Two Straight Sessions, Signaling Market Confidence",
    "domain": "business",
    "location": "global",
    "published": "Fri, 13 Jun 2025 21:34:51 GMT",
    "source": "Investopedia",
    "sources": [
      "Investopedia"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "<figure><img alt=\"David Paul Morris / Bloomberg via Getty Images Shares of Oracle climbed for a second straight session on Friday.\" src=\"https://www.investopedia.com/thmb/6KB4ztQu0oKutq7PxxREA4lJL6M=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2217725482-2c247a93869a4e39adab41e3dad813b8.jpg\" title=\"Oracle's offices in Redwood City, Calif., earlier this month. \" /><figcaption><i><p>David Paul Morris / Bloomberg via Getty Images</p> Shares of Oracle climbed for a second straight session on Friday.</i></figcaption></figure><br /><h3>Key Takeaways</h3><ul><li>The..."
    ],
    "image_url": "https://www.investopedia.com/thmb/6KB4ztQu0oKutq7PxxREA4lJL6M=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2217725482-2c247a93869a4e39adab41e3dad813b8.jpg",
    "titles": [
      "S&P 500 Gains & Losses Today: Index Drops as Middle East Tensions Rise; Oracle Climbs"
    ],
    "summary": "Oracle's stock rose for two consecutive sessions as of Friday, indicating a positive trend for the company's shares in the market. This movement reflects investor confidence or reaction to recent company developments, although specific reasons for the increase were not provided. The image from Bloomberg via Getty Images shows Oracle's offices, suggesting the company's physical presence as a backdrop to its financial performance.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about Oracle's stock performance, indicating a positive market trend. However, it lacks depth as it does not provide insight into the specific reasons for the increase in share value, limiting its usefulness for readers.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.948,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.408
  },
  {
    "title": "Meta's New AI App Raises Privacy Concerns with Public Defaults",
    "domain": "business",
    "location": "national",
    "published": "Fri, 13 Jun 2025 21:12:44 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Meta's new AI app shares prompts publicly. Here's how to go private."
    ],
    "image_url": "",
    "titles": [
      "Here's how to keep Meta AI from sharing your prompts on Facebook, Instagram"
    ],
    "summary": "Meta launched a new AI app that by default shares user prompts publicly. Users concerned about privacy can adjust their settings to make their interactions private. This feature has raised privacy concerns among users, prompting some to seek ways to protect their data by altering the app's default settings.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive as it raises awareness about privacy concerns related to a new AI app. It also provides actionable insights for users on how to protect their data by adjusting the app's default settings, empowering them with knowledge to make informed decisions.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.94,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.447
  },
  {
    "title": "JBS Debuts on NYSE with 2% Increase in Shares",
    "domain": "business",
    "location": "national",
    "published": "Fri, 13 Jun 2025 20:45:55 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Investopedia"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Brazilian meat giant JBS is making its U.S. public market debut on the New York Stock Exchange under the ticker \"JBS.\"",
      "<figure><img alt=\"Chet Strange / Bloomberg via Getty Images JBS shares advanced 2% in their NYSE debut Friday, June 13, 2025.\" src=\"https://www.investopedia.com/thmb/5emzIVSB1Y7FLIcfrkkgqlvpHYo=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2202853217-d333f811fe344d87ab2fea29fd62b0ba.jpg\" title=\"The JBS Greeley meatpacking facility in Greeley, Colorado\" /><figcaption><i><p>Chet Strange / Bloomberg via Getty Images</p> JBS shares advanced 2% in their NYSE debut Friday, June 13, 2025.</i></figcaption></figure><p>Shares of JBS posted a slight gain Friday in their <a..."
    ],
    "image_url": "",
    "titles": [
      "Shares of scandal-plagued Brazilian meat giant JBS rise 3% in U.S. public debut",
      "Brazilian Meatpacking Giant JBS Makes Its NYSE Debut"
    ],
    "summary": "Brazilian meat giant JBS made its U.S. public market debut on the New York Stock Exchange (NYSE) under the ticker \"JBS\" on June 13, 2025. On its first trading day, JBS shares saw a 2% increase. This marks a significant step for JBS as it expands its presence in the global market, specifically within the U.S. financial landscape.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about JBS's debut on the NYSE and its impact on the company's shares. However, it doesn't provide deeper understanding or insights into what this means for the industry, the company's future plans, or how it might affect individual investors.",
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.932,
      "consensus": 0.632,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.664
  },
  {
    "title": "Senate Reviews GOP Bill to Alter Family Financial Support Based on Income",
    "domain": "business",
    "location": "national",
    "published": "Fri, 13 Jun 2025 20:36:07 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "As the Senate considers House Republicans' \"big beautiful\" bill, here's why families would get more or less money depending on their incomes."
    ],
    "image_url": "",
    "titles": [
      "Who benefits from Republicans' 'big beautiful' bill depends largely on income. Children are no exception"
    ],
    "summary": "The Senate is currently reviewing a bill introduced by House Republicans, which proposes changes to the financial support for families. The bill's structure means that the amount of money families receive will vary based on their income levels, potentially increasing or decreasing the financial assistance they are eligible for. This legislation aims to adjust the existing financial aid framework, affecting families differently depending on their income.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "The story is constructive as it informs readers about a new legislation that could potentially affect their financial assistance. It provides awareness about changes in the financial aid framework. However, it could have been more constructive if it had included more detailed information on the potential impacts or reactions from different stakeholders.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.928,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.438
  },
  {
    "title": "Adobe's Sales Forecast Misses Skeptics' Expectations Amid AI Concerns",
    "domain": "business",
    "location": "global",
    "published": "Fri, 13 Jun 2025 20:31:48 GMT",
    "source": "Bloomberg",
    "sources": [
      "Bloomberg"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMiqwFBVV95cUxPR1VIQi1PRmxjbzAxWlhOeW10eXZaYWRjdUFoZU1EX0pMQ0ExZkZTOF9jUERlOGhlWjhacUlGbWZuYjEyUmFHWVItOFZRN3dXdW1BbnJZMTFmT1p3dDQ5NUJFOVN4dEVWVnJ4YmFtQ3gyTlRyOENBWUMtVUFDa3FyZmtkdHJaSFU1M2pLczBQd1VBMjd2bWRoNVhEd2xIYkZVeWZaM0ZBTmppU0U?oc=5\" target=\"_blank\">Adobe Gives Sales Outlook That Fails to Convince AI Skeptics</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Bloomberg</font>"
    ],
    "image_url": "",
    "titles": [
      "Adobe Gives Sales Outlook That Fails to Convince AI Skeptics - Bloomberg"
    ],
    "summary": "Adobe provided a sales forecast that did not meet the expectations of skeptics concerned about the company's ability to compete in the artificial intelligence sector. This outlook has led to further discussions regarding Adobe's position and strategy in integrating and leveraging AI technology within its product offerings.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "The story provides useful context about Adobe's sales forecast and the concerns regarding its position in the AI sector. However, it lacks depth in explaining why the expectations were missed and what the implications might be for Adobe and the AI industry.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.927,
      "consensus": 0.393,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.424
  },
  {
    "title": "USDA Ramps Up Fight Against Deadly Bird Flu Outbreak",
    "domain": "science",
    "location": "global",
    "published": "Fri, 13 Jun 2025 22:00:25 +0100",
    "source": "New Scientist",
    "sources": [
      "New Scientist"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Amidst an ongoing outbreak of a deadly bird flu virus in livestock, the US Department of Agriculture is doing more to prevent the spread than public health agencies are"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/06/13172251/SEI_255372835.jpg",
    "titles": [
      "How a US agriculture agency became key in the fight against bird flu"
    ],
    "summary": "The US Department of Agriculture has intensified efforts to curb the spread of a deadly bird flu virus in livestock, surpassing the measures taken by public health agencies. This action is in response to an ongoing outbreak, aiming to protect both animal and public health.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This news story is constructive as it provides useful information about the USDA's efforts to tackle a bird flu outbreak, promoting awareness about the situation. However, it doesn't clearly highlight any specific solutions or progress beyond the general response.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.936,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.436
  },
  {
    "title": "Early Humans Used Fire for Meat Preservation 1M Years Ago",
    "domain": "science",
    "location": "global",
    "published": "Fri, 13 Jun 2025 21:03:34 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/archaeologists-reveal-early-humans-used-fire-in-a-surprising-way-as-early-as-1-million-years-ago/\" rel=\"nofollow\" title=\"Archaeologists Reveal Early Humans Used Fire in a Surprising Way As Early as 1 Million Years Ago\"><img alt=\"Illustration of Elephant Hunting With Spears\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"559\" src=\"https://scitechdaily.com/images/Illustration-of-Elephant-Hunting-With-Spears-777x559.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>Fire helped early humans preserve meat and deter predators,..."
    ],
    "image_url": "",
    "titles": [
      "Archaeologists Reveal Early Humans Used Fire in a Surprising Way As Early as 1 Million Years Ago"
    ],
    "summary": "Archaeologists have discovered that early humans used fire for meat preservation and predator deterrence as early as 1 million years ago. This finding highlights the innovative ways in which our ancestors utilized fire, significantly earlier than previously documented, marking a crucial development in human evolution.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "The story offers a deeper understanding of human evolution and the innovative uses of fire by early humans. It's informative and insightful, but it doesn't provide actionable insights or discuss any current implications or progress.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.937,
      "consensus": 0.393,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.419
  },
  {
    "title": "New Semiconductor Tech Boosts 6G Performance, Says Bristol Team",
    "domain": "science",
    "location": "global",
    "published": "Fri, 13 Jun 2025 20:38:52 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/new-semiconductor-technology-could-supercharge-6g-delivery/\" rel=\"nofollow\" title=\"New Semiconductor Technology Could Supercharge 6G Delivery\"><img alt=\"Artistic Representation of a Futuristic Semiconductor Device Enabling 6G Technology\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"1030\" src=\"https://scitechdaily.com/images/Artistic-Representation-of-a-Futuristic-Semiconductor-Device-Enabling-6G-Technology-777x1030.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>A team at the University of Bristol developed SLCFETs, a..."
    ],
    "image_url": "",
    "titles": [
      "New Semiconductor Technology Could Supercharge 6G Delivery"
    ],
    "summary": "Researchers at the University of Bristol have developed a new semiconductor technology called SLCFETs, which has the potential to significantly enhance the performance and efficiency of 6G wireless communication. This breakthrough could lead to faster data transmission speeds and improved network reliability for future telecommunications.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is very constructive. It reports on an innovation in semiconductor technology that could improve 6G wireless communication. This provides readers with knowledge about progress in telecommunications technology, potentially empowering those in related fields.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.929,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.438
  },
  {
    "title": "\"Ghost Plume Beneath Oman Reveals Unexpected Earth Core Heat Flow\"",
    "domain": "science",
    "location": "global",
    "published": "Fri, 13 Jun 2025 20:37:16 +0100",
    "source": "New Scientist",
    "sources": [
      "New Scientist"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "A ‘ghost plume’ identified deep in the mantle beneath Oman suggests there may be more heat flowing out of Earth’s core than previously thought"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/06/13180403/sei255368578.jpg",
    "titles": [
      "Earth’s mantle may have hidden plumes venting heat from its core"
    ],
    "summary": "A 'ghost plume' detected deep in the Earth's mantle beneath Oman indicates a higher-than-expected heat flow from the planet's core. This discovery challenges previous assumptions about Earth's internal heat dynamics and may have implications for understanding the planet's geological processes.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides a deeper understanding of the Earth's internal heat dynamics, challenging previous assumptions and potentially impacting our understanding of geological processes. However, it does not offer any actionable insights or report on solutions or improvements.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.91,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.424
  },
  {
    "title": "Scientists Uncover Cause of Earth's 9-Day, 90-Second Shake Cycle",
    "domain": "science",
    "location": "global",
    "published": "Fri, 13 Jun 2025 20:13:09 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/the-earth-shook-every-90-seconds-for-9-days-in-2023-scientists-finally-know-why/\" rel=\"nofollow\" title=\"The Earth Shook Every 90 Seconds for 9 Days in 2023 – Scientists Finally Know Why\"><img alt=\"Earth Shaking Lines Concept\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Earth-Shaking-Lines-Concept-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>Scientists used satellite and seismic data to prove mega tsunamis in Greenland fjords created trapped standing waves that shook..."
    ],
    "image_url": "",
    "titles": [
      "The Earth Shook Every 90 Seconds for 9 Days in 2023 – Scientists Finally Know Why"
    ],
    "summary": "In 2023, scientists discovered the cause behind a phenomenon where the Earth shook every 90 seconds for 9 days. Using satellite and seismic data, they determined that mega tsunamis in Greenland fjords generated trapped standing waves, which were responsible for the consistent shaking. This conclusion provides a clear explanation for the unusual seismic activity observed during that period.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "The story clearly explains a previously unexplained phenomenon, providing readers with a deeper understanding of Earth's seismic activity. It also highlights scientific progress in understanding and explaining such phenomena.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.921,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.436
  },
  {
    "title": "Breakthrough in Quantum Computing: Atoms Controlled for 50 Minutes",
    "domain": "science",
    "location": "global",
    "published": "Fri, 13 Jun 2025 20:00:08 +0100",
    "source": "New Scientist",
    "sources": [
      "New Scientist"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Putting unusually large atoms in a box with cold copper sides helped researchers control them for an unprecedented 50 minutes at room-temperature, an improvement necessary for building more powerful quantum computers and simulators"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/06/13165343/sei255278939.jpg",
    "titles": [
      "Giant atoms 'trapped' for record time at room temperature"
    ],
    "summary": "Researchers have successfully controlled unusually large atoms within a box with cold copper sides for an unprecedented duration of 50 minutes at room temperature. This breakthrough is a significant step forward in the development of more powerful quantum computers and simulators, as it allows for extended control periods necessary for their construction and operation.",
    "constructiveness_score": 1.0,
    "constructiveness_reason": "This story reports on a significant innovation in the field of quantum computing, providing readers with insights into the progress being made. It also offers a deeper understanding of the challenges and advancements in quantum computing.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.898,
      "consensus": 0.393,
      "constructiveness": 1.0,
      "proximity": 0.5
    },
    "score": 0.441
  },
  {
    "title": "Japan's Weather Chief Debunks Major Earthquake Rumors as Hoax",
    "domain": "science",
    "location": "global",
    "published": "Fri, 13 Jun 2025 19:40:01 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "The head of Japan's meteorological agency on Friday dismissed widespread rumors of a major earthquake in Japan this summer as unscientific and a \"hoax,\" urging people not to worry because even the most advanced science still cannot predict any quake or tsunami."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/japans-chief-meteorolo.jpg",
    "titles": [
      "Japan's chief meteorologist calls rumors of a July earthquake a hoax and urges people not to worry"
    ],
    "summary": "The head of Japan's meteorological agency has officially debunked rumors of a major earthquake hitting Japan this summer, labeling them as unscientific and a hoax. He emphasized that current scientific capabilities do not allow for the prediction of earthquakes or tsunamis, and urged the public not to be concerned by these baseless claims.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful information to the public by debunking false rumors about a major earthquake, which helps to prevent unnecessary panic. It also increases awareness about the limitations of current scientific capabilities in predicting natural disasters.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.99,
      "consensus": 0.393,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.43
  },
  {
    "title": "Perseverance Rover May Have Samples From Martian Volcano",
    "domain": "science",
    "location": "global",
    "published": "Fri, 13 Jun 2025 19:00:07 +0100",
    "source": "New Scientist",
    "sources": [
      "New Scientist"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "There appears to be a volcano near Jezero crater on Mars and the Perseverance rover might already have samples from it that we could use to precisely date the activity of another planet's volcano for the first time"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/06/13120100/SEI_255292984.jpg",
    "titles": [
      "Perseverance rover may hold secrets to newly discovered Mars volcano"
    ],
    "summary": "Scientists believe there is a volcano near Mars' Jezero crater, and the Perseverance rover may have collected samples from it. If analyzed, these samples could allow experts to precisely date the volcanic activity on another planet for the first time, marking a significant advancement in planetary science.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story reports on a significant advancement in planetary science, which can contribute to a deeper understanding of Mars and its geological history. It also highlights the potential for further discoveries and innovations in the field.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.879,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.428
  }
]