[
  {
    "title": "U.S.-China Deal on TikTok Ensures American Control, Awaiting Beijing's Response",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 20 Sep 2025 22:19:16 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Financial Post",
      "CityNews",
      "Forbes",
      "Fortune",
      "Axios",
      "Global News"
    ],
    "domains": [
      "fortune.com",
      "news.google.com",
      "www.bbc.com",
      "globalnews.ca",
      "www.forbes.com",
      "ottawa.citynews.ca",
      "financialpost.com"
    ],
    "snippets": [
      "The White House said a deal could be signed \"in the coming days\", but Beijing is yet to comment.",
      "<a href=\"https://news.google.com/rss/articles/CBMiY0FVX3lxTE1sX2dONGlOeWtIZ2xuYkgxZDZGUEdsaUtsRTF5Q0dHR1lPU1VxMDZvR05KMHJHRUdBVEZscG9TQW44cVNWSVpWMTdHR3UyWlNJS2JCQjlabnduWTZNVUtJcEM4OA?oc=5\" target=\"_blank\">TikTok deal will be signed soon, with U.S. control of algorithm, White House says</a>&nbsp;&n",
      "White House press secretary Karoline Leavitt expressed confidence that the agreement would be finalized soon, saying she anticipates it will happen 'in the coming days.'",
      "President Donald Trump signaled a deal to keep TikTok online in the U.S. was “approved” by China.",
      "The White House said Oracle would be responsible for TikTok's data and security and that Americans will control six of the seven seats for a planned board.",
      "WASHINGTON (AP) &#8212; An emerging TikTok deal with China will ensure that U.S. companies control the algorithm that powers the app&#8217;s video feed and Americans will hold a majority of seats on a board overseeing U.S. operations, the White House said Saturday. A central question to the tug of w",
      "WASHINGTON (AP) — An emerging TikTok deal with China will ensure that U.S. companies control the algorithm that powers the app&#8217;s video feed and Americans will hold a majority of seats on a board overseeing U.S. operations, the White House said Saturday. A central question to the tug of war bet"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/94ac/live/3b5e1780-9669-11f0-84c8-99de564f0440.jpg",
    "titles": [
      "White House outlines TikTok deal that would give US control of algorithm",
      "TikTok deal will be signed soon, with U.S. control of algorithm, White House says - Axios",
      "Emerging TikTok deal ensures U.S. oversight of algorithm, White House says",
      "TikTok’s Algorithm And Board Will Be U.S.-Controlled In Deal With China, White House Says",
      "U.S. would control TikTok’s board and algorithm under emerging deal with China, White House says",
      "Emerging TikTok deal with China ensures US control of board and crucial algorithm, White House says",
      "Emerging TikTok deal with China ensures US control of board and crucial algorithm, White House says"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.942,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.838,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The White House announced an upcoming deal with China regarding TikTok, stating that it will ensure U.S. control over the app's algorithm and a majority of seats on its board overseeing U.S. operations. Oracle is set to handle TikTok's data and security. The deal, aimed at keeping TikTok online in the U.S., has been signaled as \"approved\" by President Trump, although Beijing has not yet commented. The agreement is expected to be finalized \"in the coming days.\"",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Anti-Immigration Protest in The Hague Turns Violent, 30 Arrested",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 20 Sep 2025 23:04:01 GMT",
    "source": "BBC",
    "sources": [
      "Deutsche Welle",
      "Al Jazeera",
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.dw.com",
      "www.bbc.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Around 1,500 people blocked a highway in The Hague while a police car was also set on fire.",
      "Dutch police deployed water cannons and tear gas to disperse anti-immigration protests in The Hague.",
      "Thousands join anti-immigration protest in the Hague, with clashes leading to attacks on police vehicles.",
      "<p>Thirty arrests made and two officers injured as teargas and water cannon deployed against violent protesters</p><p>Dutch police have used teargas and a water cannon to disperse violent anti-immigration protesters in The Hague on Saturday, a local government spokesperson has said.</p><p>Thirty peo",
      "<p>Event comes a week after the largest far-right event in decades took place in London</p><p>Anti-immigration protesters have clashed with anti-racist counter-protesters in tense scenes in Glasgow this afternoon, a week after <a href=\"https://www.theguardian.com/uk-news/2025/sep/13/unite-the-kingdo",
      "Protesters clashed with police in The Hague at the rally demanding tougher migration policies. Dutch far-right leader Geert Wilders has condemned the unrest, calling the rioters \"idiots.\""
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/0edd/live/0b1db5e0-9672-11f0-9cf6-cbf3e73ce2b9.jpg",
    "titles": [
      "Dutch police clash with anti-immigration protesters",
      "Police fire tear gas at anti-immigration protesters in The Hague",
      "Dutch police use water cannon to disperse anti-immigration protestors",
      "Dutch police clash with anti-immigration protesters in The Hague",
      "Anti-immigration protesters and counter-protesters clash in Glasgow",
      "Netherlands: Violence erupts at anti-immigration protest"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.957,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.781,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In The Hague, around 1,500 anti-immigration protesters clashed with police, blocking a highway and setting a police car on fire. Dutch authorities responded with water cannons and tear gas to disperse the crowd. The protest led to thirty arrests and two officers injured. The incident occurs amid rising tensions, following a large far-right event in London the previous week. Far-right leader Geert Wilders condemned the violence, labeling the rioters as \"idiots.\"",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Former Liverpool Women's Manager Matt Beard Dies at 47",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 20 Sep 2025 22:34:53 GMT",
    "source": "BBC",
    "sources": [
      "Sky Sports",
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.theguardian.com",
      "www.skysports.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Former Liverpool manager Matt Beard has died at the age of 47, the Women's Super League club announces.",
      "<ul><li><p>Beard guided Liverpool to WSL titles in 2013 and 2014</p></li><li><p>Club say they are ‘deeply shocked and saddened’</p></li></ul><p>The former Liverpool manager Matt Beard has died at the age of 47, the Women’s Super League club have announced. A Liverpool statement expressed the club’s ",
      "Former Liverpool Women manager Matt Beard has died aged 47.&#160;"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/4d0e/live/9df73270-9662-11f0-84c8-99de564f0440.jpg",
    "titles": [
      "Former Liverpool manager Beard dies aged 47",
      "Matt Beard, former manager of Liverpool Women, dies aged 47",
      "Former Liverpool Women manager Matt Beard dies aged 47"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.947,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.726,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Former Liverpool Women's manager, Matt Beard, has passed away at the age of 47, as announced by the Women's Super League club. Beard led Liverpool to Women's Super League titles in 2013 and 2014. The club expressed being \"deeply shocked and saddened\" by his death.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "NATO Intercepts Russian Jets in Estonian Airspace; EU Condemns Act",
    "domain": "general",
    "source_domain": "www.bbc.co.uk",
    "location": "global",
    "published": "Sat, 20 Sep 2025 15:54:00 GMT",
    "source": "BBC",
    "sources": [
      "New York Times",
      "BBC",
      "Global News"
    ],
    "domains": [
      "www.bbc.co.uk",
      "www.nytimes.com",
      "globalnews.ca"
    ],
    "snippets": [
      "Estonia has asked to consult other Nato members after warplanes violated its airspace.",
      "Estonia’s foreign minister described the flights, which lasted for an unusually long 12 minutes, as an “unprecedentedly brazen” intrusion.",
      "After entering Estonian airspace without clearance on Friday, officials now say the Russian pilots ignored warnings from NATO aircraft."
    ],
    "image_url": "https://ichef.bbci.co.uk/images/ic/240x135/p0l7jnbt.jpg",
    "titles": [
      "Russian Warplanes Breach Nato Airspace",
      "Russian Fighter Jets Enter Airspace of Estonia, a NATO Member",
      "Russian jets violating Estonia airspace ignored NATO warning, officials say"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.824,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.716,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "NATO intercepted three Russian MiG-31 fighter jets that entered Estonian airspace for 12 minutes, marking a significant breach. Estonia condemned the act as an \"unprecedentedly brazen\" intrusion and summoned a Russian diplomat in response. NATO highlighted its quick response as evidence of its capability to counter such actions. Russia, however, denied the allegations, which the EU labeled a \"dangerous provocation.\" This incident is part of a series of recent airspace violations by Russia in the EU, including drone incursions into Poland and Romania.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Canada Eyes Role as Europe's Key Energy and Defense Supplier",
    "domain": "business",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sat, 20 Sep 2025 19:03:07 +0000",
    "source": "Global News",
    "sources": [
      "Financial Post",
      "Global News"
    ],
    "domains": [
      "globalnews.ca",
      "financialpost.com"
    ],
    "snippets": [
      "The federal finance minister spoke in Europe about the benefits for both Canada and the European Union in solidifying trade deals and other agreements.",
      "OTTAWA &#8212; Canada&#8217;s finance minister says the country could be a &#8220;supplier of choice&#8221; for European markets looking to bolster energy security and defence capabilities. Following a meeting in Denmark with European Union finance ministers, Francois-Philippe Champagne said Saturda"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/78e279cfa1f05ad313e6e3b7b61122a33e857e11fbc92b1623a9ce91506051bf_ae5958.jpg?quality=65&strip=all",
    "titles": [
      "Champagne promoting Canadian critical mineral and energy exports in Europe",
      "Champagne tries to sell Europe on Canadian energy, critical mineral exports"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.899,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.685,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Canada's Finance Minister, Francois-Philippe Champagne, highlighted the potential benefits of Canada as a \"supplier of choice\" for Europe in energy security and defense during a meeting with EU finance ministers in Denmark. This aims to strengthen trade and agreements between Canada and the European Union.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "New York Rangers Cut 13 Players from Training Camp Roster",
    "domain": "sports",
    "source_domain": "thehockeynews.com",
    "location": "national",
    "published": "Sat, 20 Sep 2025 23:32:11 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "NHL",
      "Yahoo Sports"
    ],
    "domains": [
      "thehockeynews.com",
      "news.google.com"
    ],
    "snippets": [
      "The New York Rangers' training camp roster is 13 players shorter.",
      "<a href=\"https://news.google.com/rss/articles/CBMiigFBVV95cUxPU3FzY0hBb3QwT1o5dDRscTdXcElUWVFqbGw5X19qa2RlV0JpZzRJSG1xOUZ1dktPVmdyVnN4aWRWV3FYNnJ3RzJXM2E0TGlPU2cwWkFjdndFRlJkajkweGZkWVBmVmk2YVR2RlBkNlFlRTNUMlBDZGlxTk12MlVIcmxMQVBBYUc4Y1E?oc=5\" target=\"_blank\">Red Wings reduce Training Camp roster by",
      "<a href=\"https://news.google.com/rss/articles/CBMiekFVX3lxTE1sbU9XVUh2RHVucVZoTTV5b2hTVVFpZHlkWE9xbVBlR2E2czdUbUdyVG94bk9GeVNONUFvVkVCOVg3M25ZcTdSOGdHTW85eDFnWmtPN2Y3ellTLVo0SzBWLWNlcWFKSXJ0aGhBZVc2SVVvNWhvM1NOM29B?oc=5\" target=\"_blank\">Lines at training camp – Sept. 20</a>&nbsp;&nbsp;<font color=\"#"
    ],
    "image_url": "",
    "titles": [
      "Rangers Make Several Cuts From Training Camp Roster",
      "Red Wings reduce Training Camp roster by 11 - NHL.com",
      "Lines at training camp – Sept. 20 - NHL.com"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.987,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.684,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The New York Rangers have reduced their training camp roster by 13 players. The team is making adjustments as they prepare for the upcoming season. The current status of the roster changes is reflected in the team's ongoing training camp activities.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "New Law Bans Police from Wearing Facial Coverings",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sat, 20 Sep 2025 18:02:48 -0400",
    "source": "NPR",
    "sources": [
      "Global News",
      "NPR"
    ],
    "domains": [
      "globalnews.ca",
      "www.npr.org"
    ],
    "snippets": [
      "The law, opposed by police organizations, was aimed by lawmakers at immigration agents and will test state powers over the conduct of federal officials.",
      "The new law prohibits neck gators, ski masks and other facial coverings for local and federal officers, while they conduct official business."
    ],
    "image_url": "",
    "titles": [
      "California bans masks meant to hide law enforcement officers' identities",
      "California bans mask use for most law enforcement officers during operations"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.957,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.681,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A new law, opposed by police organizations but supported by lawmakers, restricts local and federal officers from wearing neck gators, ski masks, and other facial coverings while conducting official business. This legislation aims to test state powers over federal officials' conduct, particularly targeting immigration agents.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Atlanta Dream's Naz Hillman Wins First WNBA Sixth Player Award for Franchise",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sat, 20 Sep 2025 19:58:14 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Atlanta veteran forward Naz Hillmon, who averaged 8.6 points and 6.2 rebounds for the Dream and made 53 3-pointers this season, was named the WNBA's Sixth Player of the Year on Saturday, making her the first player in franchise history to win the award.",
      "<p>Atlanta forward Naz Hillmon was named the WNBA&#8217;s Sixth Player of the Year on Saturday, making her the first Dream player in franchise history to win the award.</p>"
    ],
    "image_url": "",
    "titles": [
      "Dream's Hillmon named WNBA's 6th Player of Year",
      "Naz Hillmon makes history as Dream’s first Sixth Player of the Year"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.996,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.679,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Naz Hillmon, an Atlanta Dream forward, was named the WNBA's Sixth Player of the Year, marking the first time a player from the franchise has won this award. Hillmon averaged 8.6 points, 6.2 rebounds, and made 53 3-pointers this season.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Brock Lesnar Triumphs at WWE WrestlePalooza 2025 in Indianapolis",
    "domain": "business",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sat, 20 Sep 2025 19:50:12 EST",
    "source": "ESPN",
    "sources": [
      "Forbes",
      "ESPN"
    ],
    "domains": [
      "www.forbes.com",
      "www.espn.com"
    ],
    "snippets": [
      "WWE heads to Indianapolis for its first Premium Live Event on ESPN Unlimited. Seth Rollins, Cody Rhodes and more join Cena and Lesnar on the card.",
      "Brock Lesnar destroyed John Cena with several F-5's as the Beast returned to dominant form, physically looking as big as he's ever looked.",
      "WWE WrestlePalooza 2025 marked an epic return for Brock Lesnar, who absolutely dismantled John Cena in a lopsided match."
    ],
    "image_url": "",
    "titles": [
      "WWE Wrestlepalooza live updates and results: Lesnar dominates Cena to start the show",
      "WWE Wrestlepalooza 2025 Results As Brock Lesnar Easily Destroys John Cena",
      "WWE WrestlePalooza 2025 Results As Brock Lesnar Demolishes John Cena"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.993,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.679,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "WWE WrestlePalooza 2025 in Indianapolis featured Brock Lesnar's dominant return, defeating John Cena with multiple F-5s. The event, WWE's first Premium Live on ESPN Unlimited, also starred Seth Rollins, Cody Rhodes, and others.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Rock 'n' Roll Songwriter Sonny Curtis Dies at 88",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sat, 20 Sep 2025 16:45:49 +0000",
    "source": "Global News",
    "sources": [
      "CityNews",
      "Global News"
    ],
    "domains": [
      "globalnews.ca",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "Sonny Curtis, inducted into the Rock and Roll Hall of Fame as a member of The Crickets in 2012, died Friday, his wife Louise Curtis said.",
      "Sonny Curtis, a vintage rock &#8216;n&#8217; roller who wrote the raw classic “I Fought the Law” and posed the enduring question “Who can turn the world on with her smile?” as the writer-crooner of the theme song to “The Mary Tyler Moore Show,” has died at 88. Curtis, inducted into the Rock and Roll"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/sonny-curtis-dead.jpg?quality=65&strip=all",
    "titles": [
      "Sonny Curtis, member of Buddy Holly’s Crickets, dead at 88",
      "Sonny Curtis, Crickets member who penned ‘Mary Tyler Moore Show’ theme, dies at 88"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.857,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.676,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Sonny Curtis, renowned rock 'n' roll songwriter and member of The Crickets, passed away at 88. Inducted into the Rock and Roll Hall of Fame in 2012, Curtis was celebrated for classics like “I Fought the Law” and the theme for “The Mary Tyler Moore Show.” His wife, Louise Curtis, confirmed his death.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "White House Clarifies $100K H-1B Visa Fee to Address Tech Industry Reliance",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sat, 20 Sep 2025 17:56:33 -0400",
    "source": "NPR",
    "sources": [
      "Financial Times",
      "NPR"
    ],
    "domains": [
      "www.ft.com",
      "www.npr.org"
    ],
    "snippets": [
      "More than half a million high-skilled U.S. workers are in the country through the H-1B program, which is heavily used by the big tech companies trying to curry favor with the president.",
      "White House moves to clarify $100,000 application fee for visas relied on by tech industry"
    ],
    "image_url": "",
    "titles": [
      "Trump's new $100K fee on H-1B visas will hurt the tech companies trying to woo him",
      "Trump’s new H-1B visa fee prompts emergency guidance from companies"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.955,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.671,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The White House has introduced a clarification regarding a $100,000 application fee for H-1B visas, a program utilized by big tech companies employing over half a million high-skilled workers in the U.S. This move aims to address the tech industry's reliance on the program while engaging with the president.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "WNBA Fines Indiana Fever's Caitlin Clark for Referee Remarks",
    "domain": "sports",
    "source_domain": "www.usatoday.com",
    "location": "national",
    "published": "Sat, 20 Sep 2025 23:47:37 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Sportsnet",
      "Yahoo Sports"
    ],
    "domains": [
      "www.usatoday.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Indiana Fever star Caitlin Clark's recent remarks on social media resulted in her being fined by the WNBA. Here's the latest.",
      "<p>Caitlin Clark said referees couldn’t stop her Indiana Fever. The WNBA made her pay for it.</p>"
    ],
    "image_url": "",
    "titles": [
      "Indiana Fever star Caitlin Clark announces fine for post about referees",
      "Caitlin Clark fined $200 for social media post about referees, Fever star says"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.992,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.66,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Indiana Fever player Caitlin Clark was fined by the WNBA for comments she made on social media, suggesting referees couldn't stop her team. The specific remarks led to the league imposing a financial penalty.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Admin Raises H-1B Visa Fees; Tech Firms Advise Workers to Stay in US",
    "domain": "business",
    "source_domain": "www.businessinsider.com",
    "location": "global",
    "published": "2025-09-20T21:53:57Z",
    "source": "Business Insider",
    "sources": [
      "Business Insider",
      "TechCrunch"
    ],
    "domains": [
      "www.businessinsider.com",
      "techcrunch.com"
    ],
    "snippets": [
      "The Trump administration said Friday it would raise application fees for the H-1B visa, causing companies and lawyers to scramble to advise workers.",
      "Large tech companies have responded to President Donald Trump’s dramatic changes to H-1B visa applications by telling employees with those visas to remain in the United States for now."
    ],
    "image_url": "https://i.insider.com/68cea97357d362d375e8914b?format=jpeg",
    "titles": [
      "Read the memos sent to Amazon, Microsoft, Google, and Goldman Sachs staff about Trump's H-1B fees: 'Stay in the country for now'",
      "Amazon, Google, Microsoft reportedly warn H-1B employees to stay in the US"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.954,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.66,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Trump administration announced an increase in H-1B visa application fees, prompting companies and lawyers to quickly advise affected workers. In response, large tech firms advised employees holding H-1B visas to stay in the U.S. due to the changes.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UK to Recognize Palestinian State Amid Israel Crisis",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 20 Sep 2025 21:30:23 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "A host of countries, including France and Canada, are expected to do the same when world leaders gather at the UN General Assembly next week.",
      "The PM had signalled a shift in policy unless Israel took steps including agreeing to a ceasefire in Gaza.",
      "<p>Keir Starmer expected to confirm move after concluding the situation has worsened significantly in recent weeks</p><p>The UK is expected to <a href=\"https://www.theguardian.com/world/2025/sep/19/what-uk-recognition-palestine-state-will-mean\">recognise a Palestinian state</a> on Sunday after Israe"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/9c9b/live/cd279bf0-965f-11f0-937e-e53bdd730b8c.jpg",
    "titles": [
      "Starmer set to announce UK recognition of Palestinian state on Sunday",
      "Why Starmer decided the time was right to recognise a Palestinian state",
      "UK set to recognise Palestinian state on Sunday"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.926,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.657,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The UK is set to recognize a Palestinian state on Sunday, following a worsening situation in Israel. This decision comes as other countries, including France and Canada, plan similar announcements at the upcoming UN General Assembly. The move was hinted at by the Prime Minister, contingent on Israel not taking steps towards peace, such as agreeing to a ceasefire in Gaza.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "76 Killed in Gaza Airstrikes, 450K Displaced; School Shelter Hit",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sat, 20 Sep 2025 20:53:11 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Global News"
    ],
    "domains": [
      "globalnews.ca",
      "www.aljazeera.com"
    ],
    "snippets": [
      "At least 76 killed in Gaza City alone as 450,000 flee Israeli attacks on the coastal enclave&#039;s main urban centre.",
      "At least four children were killed in an Israeli air strike on a Gaza City school which was being used as a shelter.",
      "14 people have been killed from Israeli airstrikes in Gaza City, according to local health officials, as some countries prepare to recognize  Palestinian statehood."
    ],
    "image_url": "",
    "titles": [
      "Israeli bombing kills over 90 Palestinians as Gaza City faces destruction",
      "Israeli air strike kills at least 4 children at Gaza City school",
      "Israeli strikes kill 14 in Gaza City, health officials say"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.934,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.656,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "At least 76 people were killed in Gaza City due to Israeli airstrikes, with 450,000 fleeing the area. An Israeli air strike on a school used as a shelter in Gaza City resulted in the deaths of four children. Local health officials report a total of 14 people killed in the city's airstrikes. This occurs as some countries consider recognizing Palestinian statehood.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Stanton Hits 450th Career HR, Ranks 41st All-Time in MLB",
    "domain": "sports",
    "source_domain": "www.northjersey.com",
    "location": "national",
    "published": "Sat, 20 Sep 2025 23:47:38 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Sportsnet",
      "Yahoo Sports"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.northjersey.com"
    ],
    "snippets": [
      "Giancarlo Stanton's three-run homer in the first inning at Camden Yards moved him into sole possession of 41st place on MLB's all-time home run list, with No. 450.",
      "<p>Watch as New York Yankees outfielder Giancarlo Stanton hits a three-run homer in the first inning of the team&#8217;s matchup against the Baltimore Orioles, giving him 450 home runs in his career.</p>"
    ],
    "image_url": "",
    "titles": [
      "Yankees' Giancarlo Stanton blasts career home run No. 450",
      "Yankees’ Stanton hits three-run blast for 450th career home run"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.992,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.653,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Giancarlo Stanton hit a three-run homer in the first inning during a game against the Baltimore Orioles at Camden Yards. This home run marked his 450th career homer, placing him in sole possession of 41st place on MLB's all-time home run list.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Bill Parcells Inducted into Patriots Hall of Fame, Ending Feud with Kraft",
    "domain": "sports",
    "source_domain": "sports.yahoo.com",
    "location": "national",
    "published": "Sat, 20 Sep 2025 23:44:02 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Sportsnet",
      "Yahoo Sports"
    ],
    "domains": [
      "sports.yahoo.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Former Patriots coach Bill Parcells was inducted into the franchise Hall of Fame on Saturday, resolving a long-running feud with owner Robert Kraft that boiled over at their only New England Super Bowl appearance together and festered for three decades.  A two-time Super Bowl champion — neither with",
      "<p>Former Patriots coach Bill Parcells was inducted into the franchise Hall of Fame on Saturday, resolving a long-running feud with owner Robert Kraft that boiled over at their only New England Super Bowl appearance together and festered for three decades.</p>"
    ],
    "image_url": "",
    "titles": [
      "Bill Parcells enters Patriots Hall of Fame, ending his long-running feud with owner Robert Kraft",
      "Bill Parcells enters Patriots Hall of Fame, ending his feud with owner Robert Kraft"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.991,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.653,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Former Patriots coach Bill Parcells was inducted into the franchise Hall of Fame, marking the resolution of a decades-long feud with owner Robert Kraft. The conflict, which began at their sole Super Bowl appearance together, lasted for thirty years until this induction.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Man Arrested for Impersonating Officer Near Memorial Service in Phoenix",
    "domain": "general",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Sat, 20 Sep 2025 19:14:58 -0400",
    "source": "ABC News",
    "sources": [
      "ABC News",
      "The Guardian"
    ],
    "domains": [
      "abcnews.go.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "A man has been arrested and charged after he allegedly impersonated a police officer and brought a weapon ahead of a Charlie Kirk memorial service in Arizona.",
      "<p>US Secret Service in Phoenix says man said he was law enforcement and there to provide private security</p><p>A man armed with a gun and a knife was arrested on Saturday after he allegedly pretended to be a member of law enforcement outside State Farm Stadium near Phoenix a day before <a href=\"ht"
    ],
    "image_url": "https://s.abcnews.com/images/US/state-farm-satdium-gty-jt-250920_1758393826740_hpMain_4x3t_384.jpg",
    "titles": [
      "Armed man arrested at stadium ahead of Charlie Kirk memorial: Officials",
      "Man armed with gun and knife arrested at Charlie Kirk memorial service venue"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.981,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.651,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A man was arrested in Phoenix for allegedly impersonating a law enforcement officer and carrying a gun and a knife near State Farm Stadium, ahead of a Charlie Kirk memorial service. The US Secret Service stated the man claimed he was there to provide private security.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "WWE Wrestlepalooza 2025 Debuts on ESPN, Features AJ Lee's Return",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sat, 20 Sep 2025 22:30:41 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Forbes"
    ],
    "domains": [
      "www.cbssports.com",
      "www.forbes.com"
    ],
    "snippets": [
      "All the information you need to watch WWE Wrestlepalooza in Indianapolis",
      "WWE is set for its first PPV event on ESPN later this month",
      "WWE WrestlePalooza 2025 match card, start time and betting odds as AJ Lee returns to the ring and Brock Lesnar faces John Cena."
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/17/47ac7a0a-bdf5-46b4-9444-add1802eec8c/wwe-nowraw1685pre-ntwk.jpg",
    "titles": [
      "WWE Wrestlepalooza 2025 start time, date: Full schedule, matches, card, where to watch live, stream",
      "WWE Wrestlepalooza 2025: Card, date, matches, rumors, start time, location as John Cena headlines debut event",
      "WWE WrestlePalooza 2025 Match Card, Start Time And Odds"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.966,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.648,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "WWE is launching a new era with Wrestlepalooza 2025, featuring AJ Lee's return and a match between Brock Lesnar and John Cena. The event starts on Saturday night in Indiana and will be the first WWE PPV available on ESPN. Fans can stream it with or without a cable provider. Concurrently, AEW All Out 2025 will also take place, presenting a competitive lineup in Toronto, available for streaming on specified platforms.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Seattle's Bryan Woo Day to Day with Pectoral Inflammation",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sat, 20 Sep 2025 22:00:06 +0000",
    "source": "CBS Sports",
    "sources": [
      "Sportsnet",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Seattle is trying to avoid a stint on the injured list ahead of the playoffs",
      "<p>Seattle right-hander Bryan Woo has “minor inflammation” in his pectoral muscle and is listed as day to day, manager Dan Wilson said Saturday.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/20/1e2acc8e-30a3-42af-8c2f-4808c28cc083/bryan-woo-mariners-g.jpg",
    "titles": [
      "Bryan Woo injury update: Mariners starter dealing with pec muscle inflammation after leaving start vs. Astros",
      "Mariners’ Bryan Woo day-to-day with minor pectoral inflammation"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.956,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.646,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Seattle's right-hander Bryan Woo is dealing with \"minor inflammation\" in his pectoral muscle, making him day to day, according to manager Dan Wilson. This situation arises as Seattle aims to keep its players off the injured list before the playoffs.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Administration Approves $14.1B Takeover with \"Golden Share\" Condition",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Sat, 20 Sep 2025 17:43:33 GMT",
    "source": "CNBC",
    "sources": [
      "Fortune",
      "CNBC"
    ],
    "domains": [
      "fortune.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "The intervention marked Trump's first use of so-called \"golden share\" rights, a condition of the $14.1 billion takeover cleared in June.",
      "This marks the latest move by the administration to exert power over private industry."
    ],
    "image_url": "",
    "titles": [
      "Trump wields ‘golden share’ to halt U.S. Steel plant shutdown, WSJ reports",
      "Trump is already wielding his ‘golden share’ authority at U.S. Steel, overriding the company’s plans for an Illinois plant, report says"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.856,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.643,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In June, the administration approved a $14.1 billion takeover, which included a condition allowing the use of \"golden share\" rights. This intervention marks the first time those rights have been utilized by Trump, highlighting the administration's ongoing efforts to exert influence over private industry.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "India Protests US H1-B Visa Fee Hike, Cites Talent and Family Impact",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sat, 20 Sep 2025 13:01:34 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Business Insider",
      "Al Jazeera"
    ],
    "domains": [
      "www.businessinsider.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "India’s Foreign Ministry says Trump administration’s move to increase H1-B visa fees may have humanitarian consequences.",
      "The Indian government said Trump's new H-1B visa fees could hinder talent mobility and impact Indian families.",
      "Trump announced in an executive order on Friday a new $100,000 fee for H-1B visa holders. Here's who the new rules will impact."
    ],
    "image_url": "",
    "titles": [
      "India says Trump’s H1-B visa fee hike could ‘disrupt families’",
      "India says Trump's H-1B visa changes could have 'humanitarian consequences'",
      "White House says Trump's H-1B visa changes will only affect new applicants"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.793,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.614,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "India's Foreign Ministry expressed concerns over the Trump administration's decision to raise H1-B visa fees by $100,000 through an executive order, stating it may affect talent mobility and have humanitarian consequences for Indian families.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Hints for NYT Strands Puzzle and Connections Game Now Online",
    "domain": "business",
    "source_domain": "www.forbes.com",
    "location": "global",
    "published": "Sat, 20 Sep 2025 19:41:42 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes"
    ],
    "domains": [
      "www.forbes.com"
    ],
    "snippets": [
      "Looking for help with today's NYT Strands puzzle? Here's an extra hint to help you uncover the right words, as well as all of today's answers and Spangram.",
      "Looking for some help with today's NYT Connections? Some hints and the answers for today's game are right here."
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/661994c1a11cd45a738c205f/0x0.jpg?width=960",
    "titles": [
      "NYT Strands Today: Hints, Spangram And Answers For Sunday, September 21st — ‘Stand By Me’",
      "Today’s NYT ‘Connections’ Hints And Answers For Sunday, September 21st"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.99,
      "consensus": 0.35,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.476,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Hints and solutions for today's New York Times Strands puzzle and Connections game are available online. These resources offer extra help for players seeking to uncover the right words in Strands and solve the Connections game, providing both hints and complete answers.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: solution",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Shopper Finds Savings at Aldi; Costly Mistakes Ruin Vienna Trip",
    "domain": "business",
    "source_domain": "www.businessinsider.com",
    "location": "global",
    "published": "2025-09-20T12:37:02Z",
    "source": "Business Insider",
    "sources": [
      "Business Insider"
    ],
    "domains": [
      "www.businessinsider.com"
    ],
    "snippets": [
      "My first trip to Aldi in decades surprised me. I loved the savings on groceries like eggs and milk, and it's become my new go-to grocery store.",
      "During my 48-hour trip to Vienna, I made mistakes that cost me time, money, and sleep. It started with an overnight train ride."
    ],
    "image_url": "https://i.insider.com/68c04e1e57d362d375e7ced9?format=jpeg",
    "titles": [
      "I went to Aldi for the first time in 40 years. I was impressed by how far my money could go.",
      "I went to Vienna for the first time. 4 mistakes drained my energy and bank account."
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.786,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.425,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A shopper revisited Aldi after decades and was pleasantly surprised by the savings on groceries, making it their preferred store. Meanwhile, another person's 48-hour trip to Vienna was marred by costly mistakes, including a problematic overnight train ride, leading to lost time, money, and sleep.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]