[
  {
    "title": "EU-US Summit Sparks Talks on Ukraine Security; Trump Rules Out US Troops",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 19 Aug 2025 23:22:36 GMT",
    "source": "BBC",
    "sources": [
      "Axios",
      "BBC",
      "CNBC",
      "Forbes",
      "The Guardian",
      "Financial Times",
      "Deutsche Welle"
    ],
    "domains": [
      "www.ft.com",
      "www.forbes.com",
      "www.dw.com",
      "news.google.com",
      "www.bbc.com",
      "www.theguardian.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "There are inherent contradictions in the idea of the guarantees meant to prevent Russia from attacking Ukraine again.",
      "After the EU-US summit on Russia's war against Ukraine, a debate is underway in Germany about security guarantees and what role Germany should play going forward.",
      "<a href=\"https://news.google.com/rss/articles/CBMiigFBVV95cUxQdGxFQkY4cV9qNEFqU0ZjZ2ZQMV8wUF91cm11S3dBNUJZOGpSanptSVVFWWRfc3B6dElNWXBKUTk5ZVpldV9UdlA1NHAwekNlVXFFVHJ0LW0wUjBFdW1BZVpNa2pYZ1htcEk2TXNwZWtOelhvQk1LaE0wa2FiTEdSb2lVR2NqTVF3cEE?oc=5\" target=\"_blank\">Rubio to lead Ukraine security guarantee",
      "<a href=\"https://news.google.com/rss/articles/CBMihAFBVV95cUxQWVl3WkF0ekN3Sk9Sdk1wNDRwT2pSZC0wVXh6UmN1UFctWnMtVU9pWXJFWUFyZmNMcmlncDRTY1ZPNHhvUmQxb2RKMlVBU1ltdmdDQTJ2TWZUczRoRWhESTF5QUI4di1lRjF0UjhZMmZUYWZEb3VDODhlMF9JcjhSbDItNmU?oc=5\" target=\"_blank\">MAGA isolationists brace for details of Ukraine ",
      "Monday's talks saw Trump say security guarantees for Ukraine would be \"provided\" by European countries with \"coordination with the U.S.\"",
      "President warns Putin will face ‘rough situation’ if Russian leader does not co-operate on a peace deal",
      "<p>US president suggests he may be willing to provide air power to help enforce potential peace deal with Putin</p><p>Donald Trump has ruled out sending US troops to Ukraine to enforce a potential peace deal with Vladimir Putin, tempering a <a href=\"https://www.theguardian.com/world/2025/aug/19/euro",
      "Tinatin Japaridze, an analyst with Eurasia Group, joined \"Forbes Newsroom\" to break down President Trump's separate meetings with Putin and Zelensky."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/ebf2/live/1d685620-7d53-11f0-83cc-c5da98c419b8.jpg",
    "titles": [
      "What 'security guarantees' for Ukraine would actually mean",
      "Ukraine security guarantees: What is Germany's role?",
      "Rubio to lead Ukraine security guarantees talks, with Trump promising air support - Axios",
      "MAGA isolationists brace for details of Ukraine security guarantees - Axios",
      "Trump promised Ukraine 'security guarantees': Here's what they could look like",
      "Trump says US could play role ‘by air’ in Ukraine security guarantee",
      "Trump rules out sending US troops to Ukraine as part of security guarantees",
      "Trump Promised Ukraine Security Guarantees From US And Europe— Here's What That Entails: Analyst"
    ],
    "score_components": {
      "magnitude": 0.96,
      "recency": 0.964,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.829,
    "summary": "After the EU-US summit on Russia's war against Ukraine, discussions are ongoing in Germany regarding its role in providing security guarantees to prevent future Russian aggression against Ukraine. Senator Marco Rubio is set to lead efforts on Ukraine's security guarantees. Amidst these developments, former President Donald Trump has indicated that European countries will provide security guarantees to Ukraine, in coordination with the U.S., but ruled out sending U.S. troops to enforce any potential peace deal with Russia. Trump also warned of a \"rough situation\" for Putin if he does not cooper",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 96 tokens",
    "image": {
      "src": "icons/usa.svg",
      "thumbnail": "icons/usa.svg",
      "alt": "us flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Air Canada Ends Strike with Tentative Deal, Flights to Resume Tuesday",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Tue, 19 Aug 2025 11:25:59 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "CityNews",
      "The Guardian",
      "Washington Post",
      "Al Jazeera",
      "Deutsche Welle"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "www.dw.com",
      "www.aljazeera.com",
      "www.washingtonpost.com",
      "www.theguardian.com",
      "www.npr.org"
    ],
    "snippets": [
      "The flight attendants' union said a new agreement guarantees members will be paid for work performed while planes are on the ground, resolving one of the major issues that drove the strike.",
      "While details of the agreement are not clear, the flight attendant union said that &#039;unpaid work is over&#039;.",
      "Air Canada is set to \"gradually resume service\" after reaching a \"tentative\" agreement to end a flight attendants' strike. Staff had been on strike since Saturday over pay and unpaid work.",
      "<p>Strike over wages and ground work has cancelled travel for 500,000 people worldwide</p><p>Air Canada flight attendants say they have reached a “tentative” deal with the airline to end a strike over wages and ground work that has cancelled travel for half a million people worldwide.</p><p>Roughly ",
      "Air Canada flights will resume Tuesday evening, it said. Details were sparse on the tentative deal between the company and its flight attendants union, CUPE.",
      "Air Canada flights are back in the air after attendants and the airline reached a tentative agreement earlier Tuesday. The union representing Air Canada&#8217;s 10,000 flight attendants confirmed its members would return to work, ending a disruptive strike that grounded thousands of flights and stra"
    ],
    "image_url": "",
    "titles": [
      "Air Canada flights slowly resume after flight attendants agree to end their strike",
      "Air Canada to resume operations after cabin crew strike ends",
      "Air Canada to resume service after 'tentative' agreement",
      "Air Canada flight attendants reach ‘tentative’ deal with airline to end strike",
      "Air Canada to resume flights after making deal to end cabin crew strike",
      "Strike over: Air Canada flights resume after attendants, airline reach tentative agreement"
    ],
    "score_components": {
      "magnitude": 0.94,
      "recency": 0.834,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.821,
    "summary": "Air Canada and its flight attendants' union have reached a tentative agreement, ending a strike that began on Saturday over wages and unpaid ground work. The strike, which affected 500,000 travelers worldwide, led to the grounding of thousands of flights. The new deal ensures that flight attendants will be paid for work performed on the ground, addressing a key grievance. Flights are set to resume Tuesday evening, though specific details of the agreement remain undisclosed.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 76 tokens",
    "image": {
      "src": "icons/canada.svg",
      "thumbnail": "icons/canada.svg",
      "alt": "canada flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Julio César Chávez Jr. Deported to Mexico, Faces Crime Charges",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 19 Aug 2025 19:38:41 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN",
      "LA Times"
    ],
    "domains": [
      "www.cbssports.com",
      "www.espn.com",
      "www.latimes.com"
    ],
    "snippets": [
      "Julio César Chávez Jr., 39, arrested days after his fight with Jake Paul, has been deported to Mexico, where he's wanted for alleged cartel ties, following his detention in the U.S. for allegedly overstaying his visa and lying on a green card application.",
      "Chávez was deported to Mexico on charges of cartel involvement, including arms and drug trafficking",
      "<p>Julio César Chávez Jr., son of the legendary Mexican boxer, has been deported to Mexico, where authorities say he faces charges of organized crime affiliation and arms trafficking.</p>"
    ],
    "image_url": "",
    "titles": [
      "Chávez deported to Mexico for alleged cartel ties",
      "Former champion Julio César Chávez Jr. deported to Mexico, jailed after ICE arrest in Los Angeles",
      "Boxer Julio César Chávez Jr. deported to Mexico"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.99,
      "consensus": 0.897,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.777,
    "summary": "Julio César Chávez Jr., 39, was deported to Mexico after being detained in the U.S. for visa issues and allegedly lying on a green card application. In Mexico, he faces charges related to organized crime, including arms and drug trafficking. This legal action follows shortly after his fight with Jake Paul.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 52 tokens",
    "image": {
      "src": "icons/mexico.svg",
      "thumbnail": "icons/mexico.svg",
      "alt": "mexico flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Trump Proposes Putin-Zelenskyy Meeting; No Clear Path to Peace Emerges",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 19 Aug 2025 20:23:41 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Axios",
      "New York Times"
    ],
    "domains": [
      "news.google.com",
      "www.nytimes.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The US president conceded the war in Ukraine was \"tough to solve\" after several days of high-level talks.",
      "<a href=\"https://news.google.com/rss/articles/CBMieEFVX3lxTE45T2liWjF5Y3hIV3FvcXczbld0ZjlKd29OTUF3amw4bVVSZ2JZdzQ2eUdNQms0dmRGUXQ2RlBqN25OMV81WDlzOTg2cFJZOUp4Q0JmOU1EMWZMSXRHUHEwbHhzMUpSZXFvckcxUEkzOWJaMG5qU0U3VA?oc=5\" target=\"_blank\">What Zelensky, Putin and Trump want out of peace talks</a>&nbsp;&",
      "<a href=\"https://news.google.com/rss/articles/CBMijwFBVV95cUxPUkN1dU14akVZakljcHNYNTA5d09vUDE2M0RDSGUzN3hkYW50RTY5VnJZdVVOZ2NfNEdCUk5aVE9EWGVubE53R2FTN1pQZ1R1dFJWa09jZDNBNDZmdlJtS0NGNHl6OU5JX1phbFZhQk51VDNha1plSHdDUGxNWVpCRUpnazhQR1RycGRVdVlPVQ?oc=5\" target=\"_blank\">Zelensky responds to Trump commen",
      "President Volodymyr Zelensky emerged upbeat, but repeated that Ukraine will not cede land to Russia. There were few tangible signs of progress toward a peace deal."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/1331/live/d2dbeab0-7d32-11f0-b6c9-e1728577c12d.jpg",
    "titles": [
      "Kremlin plays down Zelensky talks as Trump warns Putin may not 'want to make deal'",
      "What Zelensky, Putin and Trump want out of peace talks - Axios",
      "Zelensky responds to Trump comments: \"Russia must end\" war it started ahead of key talks - Axios",
      "Zelensky Says He’s Ready to Meet Putin After Trump Talks"
    ],
    "score_components": {
      "magnitude": 0.82,
      "recency": 0.906,
      "consensus": 0.897,
      "constructiveness": 0.062,
      "proximity": 0.5
    },
    "score": 0.749,
    "summary": "Former President Trump announced plans for a meeting between Russian President Putin and Ukrainian President Zelenskyy to discuss ending the war between their countries. Trump also expressed a desire to halt mail-in voting in the U.S. Despite the announcement, there was little evidence of significant progress toward a peace agreement, and President Zelenskyy maintained that Ukraine would not concede territory to Russia.",
    "constructiveness_score": 0.062,
    "constructiveness_reason": "1 constructive keywords out of 64 tokens",
    "image": {
      "src": "icons/newspaper.svg",
      "thumbnail": "icons/newspaper.svg",
      "alt": "general",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "FDA Warns Against Radioactive Shrimp at Walmart",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Tue, 19 Aug 2025 21:49:38 GMT",
    "source": "Axios",
    "sources": [
      "Business Insider",
      "Axios",
      "Fortune"
    ],
    "domains": [
      "news.google.com",
      "www.businessinsider.com",
      "fortune.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMigAFBVV95cUxONnpYWGhSNEpCYXlnblVRVm9ZWkZCbUFudk1SbU9taEpYLXc4NnhtTlhhREd2SkNGRDdrZHJ0bXhlMkV0VC1semFXazBuT3BaS3dUNjd0QjE4MWJCMzYtaWMxSUZaV0NrSGF2VDFQOHRVVjV3MDFrX1BqZzh2Y3JaSw?oc=5\" target=\"_blank\">FDA warns public about eating radioactive shrimp from",
      "The FDA warns that a shipment of frozen shrimp meant for Walmart tested positive for radioactive poisoning.",
      "Federal officials detected Cesium-137, a radioactive isotope, in shipping containers and a sample of breaded shrimp imported from Indonesia."
    ],
    "image_url": "",
    "titles": [
      "FDA warns public about eating radioactive shrimp from Walmart - Axios",
      "Please let me eat the radioactive shrimp from Walmart",
      "Walmart recalls potentially radioactive frozen shrimp sold in 13 states"
    ],
    "score_components": {
      "magnitude": 0.82,
      "recency": 0.933,
      "consensus": 0.897,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.748,
    "summary": "The FDA has issued a warning against consuming a batch of frozen shrimp sold at Walmart, found to be contaminated with Cesium-137, a radioactive isotope. The contamination was detected in shipping containers and a sample of breaded shrimp imported from Indonesia.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 42 tokens",
    "image": {
      "src": "icons/briefcase.svg",
      "thumbnail": "icons/briefcase.svg",
      "alt": "business",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Raducanu and Alcaraz Exit US Open Mixed Doubles in First Round",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 19 Aug 2025 21:53:29 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Sky Sports",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.skysports.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Emma Raducanu and Carlos Alcaraz might have lost in the revamped US Open mixed doubles - but they win the hearts of the New York crowd.",
      "<p>Starry pairings enjoy magic moments but mixed fortunes while specialists retain pride in ‘reimagined’ doubles</p><p>After many long months of discussion and anticipation, the doubles partnership between Emma Raducanu and Carlos Alcaraz came and went in the blink of an eye in a well‑populated Arth",
      "Jack Draper won the battle of the British No 1s as he and playing partner Jessica Pegula beat Emma Raducanu and Carlos Alcaraz in the first round of the US Open's revamped, star-studded mixed doubles competition."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/6254/live/5d098c00-7d39-11f0-b6c9-e1728577c12d.jpg",
    "titles": [
      "Raducanu & Alcaraz out as polarising US Open event starts",
      "Alcaraz and Raducanu bulldozed by Draper and Pegula in revamped US Open mixed doubles | Tumaini Carayol",
      "Raducanu, Alcaraz lose to Draper, Pegula in new-look US Open mixed doubles"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.935,
      "consensus": 0.897,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.741,
    "summary": "Emma Raducanu and Carlos Alcaraz, despite being a highly anticipated duo, were eliminated in the first round of the US Open's revamped mixed doubles competition. They faced defeat against Jack Draper and Jessica Pegula. However, their participation and the event's star-studded lineup captivated the New York crowd, highlighting the mixed fortunes in the tournament's new format.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 60 tokens",
    "image": {
      "src": "icons/usa.svg",
      "thumbnail": "icons/usa.svg",
      "alt": "us flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Mariners' Robles Suspended 10 Games for Bat Incident, Plans to Appeal",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Tue, 19 Aug 2025 20:13:35 +0000",
    "source": "CBS Sports",
    "sources": [
      "Sportsnet",
      "CBS Sports",
      "Sports Illustrated"
    ],
    "domains": [
      "news.google.com",
      "www.cbssports.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Robles is expected to appeal his 10-game suspension, which must be served at the big-league level",
      "<a href=\"https://news.google.com/rss/articles/CBMimAFBVV95cUxNaEI2cWtyYmNvWmdqaW1QWk55cUVJUW10cVhvN00tUm51RXlBbmJBSmczcDIxUDFtaDVnZFotbUhuc3pMcXFnd21UTW1jTzRuNmJpR3pib0VXa182OTJxeUpNdW5VcXdHeUVKOHV4RTlubUNKaEdpNVZHMU9nM29ROFA0aWNTTTBWckpkQUNXTW9ETERhWWROYw?oc=5\" target=\"_blank\">MLB Suspends Mariners",
      "<p>The Seattle Mariners outfielder was suspended 10 games by MLB on Tuesday for throwing his bat at a pitcher in a triple-A game on Sunday.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/08/18/682adc05-27c6-48e5-973d-8210b9b6266d/victor-robles.png",
    "titles": [
      "Mariners' Victor Robles suspended after throwing bat toward pitcher following near-HBP in rehab game",
      "MLB Suspends Mariners' Victor Robles for Throwing Bat at Pitcher in Wild Ejection - Sports Illustrated",
      "Mariners’ Robles suspended 10 games for throwing bat at pitcher in rehab game"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.922,
      "consensus": 0.897,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.739,
    "summary": "The Seattle Mariners outfielder, Robles, has been suspended for 10 games by Major League Baseball (MLB) for throwing his bat at a pitcher during a triple-A game on Sunday. Robles is expected to appeal the suspension, which is required to be served at the major league level.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 48 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Isak Accuses Newcastle United of Broken Promises, Seeks Exit",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 19 Aug 2025 20:21:56 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian",
      "CBS Sports"
    ],
    "domains": [
      "www.theguardian.com",
      "www.cbssports.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Alexander Isak says promises have been \"broken\" by Newcastle United and \"the relationship can't continue\" as he looks to force through an exit this summer.",
      "The player broke his silence, and his current club swiftly responded",
      "<ul><li><p>‘The relationship cannot continue,’ striker says</p></li><li><p>Attending PFA awards on Tuesday ‘didn’t feel right’</p></li></ul><p>Alexander Isak’s standoff with Newcastle threatened to descend into outright civil war on Tuesday night as the Sweden striker accused his club of breaking pr"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/5dfd/live/7d3e64d0-7d1d-11f0-b8e7-2dc6f436f923.jpg",
    "titles": [
      "'Broken promises' - what's going on with Isak, Newcastle and Liverpool?",
      "Alexander Isak transfer saga: Liverpool target says promises were 'broken' and 'trust is lost' with Newcastle",
      "‘Trust is lost’: Isak accuses Newcastle of broken promises in transfer drama"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.905,
      "consensus": 0.897,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.735,
    "summary": "Alexander Isak has publicly accused Newcastle United of breaking promises, stating that their relationship cannot continue, signaling his desire to leave the club this summer. His comments highlight a significant rift between the player and the club, which has escalated tensions. Newcastle United has responded to Isak's claims, but the details of their response were not specified in the provided content. This dispute came to light as Isak expressed discomfort in attending the PFA awards, underlining the depth of his discontent with the club.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 85 tokens",
    "image": {
      "src": "icons/newspaper.svg",
      "thumbnail": "icons/newspaper.svg",
      "alt": "general",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Salah Wins PFA Player of the Year for Record Third Time; Caldentey Honored",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 19 Aug 2025 20:21:00 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Sky Sports",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.skysports.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Liverpool winger Mohamed Salah wins the Professional Footballers' Association men's player of the year award, with Aston Villa midfielder Morgan Rogers named young player of the year.",
      "Arsenal midfielder Mariona Caldentey is named the Professional Footballers' Association women's player of the year as her new team-mate Olivia Smith wins the young player award.",
      "<ul><li><p>Liverpool forward wins honour for the third time</p></li><li><p>Caldentey award follows stellar season for Arsenal</p></li></ul><p>Liverpool’s Mohamed Salah and Arsenal’s Mariona Caldentey have won the 2025 awards for the Professional Footballers’ Association players’ player of the year.<",
      "Liverpool star Mohamed Salah has won a record third PFA men's Player of the Year award, with Arsenal's Mariona Caldentey collecting the women's accolade."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/0bdd/live/89277270-7d43-11f0-83cc-c5da98c419b8.jpg",
    "titles": [
      "Salah and Rogers scoop PFA player of the year awards",
      "Caldentey and Smith win PFA player of the year awards",
      "Prolific Salah and Caldentey rewarded with PFA player of the year awards",
      "Salah, Caldentey scoop 2024/25 PFA Player of the Year awards"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.905,
      "consensus": 0.897,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.735,
    "summary": "Liverpool's Mohamed Salah won the Professional Footballers' Association men's Player of the Year award for a record third time. Aston Villa's Morgan Rogers was named young player of the year. On the women's side, Arsenal's Mariona Caldentey received the Player of the Year award, with teammate Olivia Smith securing the young player award. These accolades follow exceptional seasons for both Salah and Caldentey with their respective clubs.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 72 tokens",
    "image": {
      "src": "icons/newspaper.svg",
      "thumbnail": "icons/newspaper.svg",
      "alt": "general",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "UK Withdraws Request for Apple Data Access After US Talks",
    "domain": "general",
    "source_domain": "www.washingtonpost.com",
    "location": "global",
    "published": "Tue, 19 Aug 2025 19:21:57 +0000",
    "source": "Washington Post",
    "sources": [
      "The Guardian",
      "Washington Post",
      "TechCrunch"
    ],
    "domains": [
      "www.washingtonpost.com",
      "www.theguardian.com",
      "techcrunch.com"
    ],
    "snippets": [
      "Director of National Intelligence Tulsi Gabbard said the British government order “would have enabled access to the protected encrypted data of American citizens.”",
      "<p>Tulsi Gabbbard says Home Office no longer demanding ‘backdoor’ to encrypted material</p><p>The UK government has dropped its insistence that Apple allows law enforcement officials “backdoor” access to US customer data, Donald Trump’s spy chief, Tulsi Gabbard, says.</p><p>The US director of nation",
      "Tulsi Gabbard said that President Donald Trump and Vice President JD Vance also participated in the negotiations with the U.K. government over its once-secret demand to Apple."
    ],
    "image_url": "",
    "titles": [
      "U.K. drops ‘back door’ demand for Apple user data, U.S. intel chief says",
      "UK has backed down on demand to access US Apple user data, spy chief says",
      "US spy chief says UK has dropped its Apple backdoor demand"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.905,
      "consensus": 0.897,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.735,
    "summary": "The UK government has withdrawn its request for Apple to provide \"backdoor\" access to encrypted data of US users, according to Director of National Intelligence Tulsi Gabbard. This decision, which Gabbard says upholds the privacy of US citizens, came after negotiations involving President Donald Trump and Vice President JD Vance. The initial demand by the UK's Home Office was aimed at allowing law enforcement access to encrypted material, a move now reversed in favor of user privacy.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 78 tokens",
    "image": {
      "src": "icons/usa.svg",
      "thumbnail": "icons/usa.svg",
      "alt": "us flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Canadian Military Probes Soldiers in Video with Nazi Salutes",
    "domain": "general",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Tue, 19 Aug 2025 23:00:38 +0000",
    "source": "Global News",
    "sources": [
      "CityNews",
      "Global News"
    ],
    "domains": [
      "globalnews.ca",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "The commander of the Canadian Army, Lt.-Gen. Michael Wright, called the video's contents disturbing and said that hate and extremism \"have no place\" in the Canadian Armed Forces.",
      "The Canadian Military Police is investigating after a 2023 video emerged that they say shows five serving members at an event where other individuals performed a Nazi salute. The members are Quebec-based. &#8220;On August 6, 2025, I was notified of a video containing hateful conduct involving member"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/08/52c48676150761b508f62b18e6812dfd1fc2db840c73e18ec5dd3bb994c174ba.jpg?quality=65&strip=all",
    "titles": [
      "5 Canadian military members suspended over video showing Nazi salute",
      "Quebec-based Canadian soldiers suspended after 2023 video that shows others making Nazi salute"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.977,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.711,
    "summary": "The Canadian Military Police are investigating a 2023 video showing five Quebec-based Canadian Armed Forces members at an event where Nazi salutes were performed by others. Lt.-Gen. Michael Wright, the commander of the Canadian Army, condemned the video's contents as disturbing and stated that hate and extremism are unacceptable within the forces. The investigation was announced on August 6, 2025, emphasizing the military's stance against such behavior.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 71 tokens",
    "image": {
      "src": "icons/canada.svg",
      "thumbnail": "icons/canada.svg",
      "alt": "canadian flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Saints Extend QB Battle; Colts Name Season Starter",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 19 Aug 2025 19:38:41 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sports Illustrated"
    ],
    "domains": [
      "news.google.com",
      "www.espn.com"
    ],
    "snippets": [
      "The Saints are taking their quarterback decision down to the wire, with coach Kellen Moore saying they want to continue the competition between Tyler Shough and Spencer Rattler through next week.",
      "<a href=\"https://news.google.com/rss/articles/CBMijwFBVV95cUxOVV8yaFFBaHR4R2RHdnlFQ2hZUjl6RGd3V1FiclFOVTlIMGdhQlJDRERVVk9iUjJDeXNUMkluTXprSWtkbjRETlhmVV9DbnRoMkZyWWFZRFJyVjJWX18tMzZBSzByb3JZZ3ViYlF5bGRHYk5YSGtPQXZnblJmMk9wV2hwVHJGbHVHMG1fLWl0TQ?oc=5\" target=\"_blank\">Kellen Moore Relays Important Upd",
      "<a href=\"https://news.google.com/rss/articles/CBMidkFVX3lxTE5EUTJibDAwWjhXdDFsbzAyY2U0bFpJNmpuQ2xqYUNmM3pZWGxPRkJZTERIU2M1dU1LTVlmV3AzNE5XMnJLYkRfYWpJZTJnbkwxd1pYenZSZFctUTljRUZPSHFLYWNxd0NMNF9mcE1OTGJqUHBqd3c?oc=5\" target=\"_blank\">Colts Make Decision on Starting Quarterback for Season Opener</a>&nb"
    ],
    "image_url": "",
    "titles": [
      "Saints QB competition to continue, Moore says",
      "Kellen Moore Relays Important Update in Saints' Quarterback Competition - Sports Illustrated",
      "Colts Make Decision on Starting Quarterback for Season Opener - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.99,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.696,
    "summary": "The New Orleans Saints are prolonging the quarterback competition between Tyler Shough and Spencer Rattler, with coach Kellen Moore aiming to finalize the decision next week. Meanwhile, the Indianapolis Colts have chosen their starting quarterback for the season opener.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 39 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Richardson's Agent Disappointed After Colts Name Jones Starting QB",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 19 Aug 2025 19:38:41 EST",
    "source": "ESPN",
    "sources": [
      "Yahoo Sports",
      "ESPN"
    ],
    "domains": [
      "coltswire.usatoday.com",
      "www.espn.com"
    ],
    "snippets": [
      "Anthony Richardson Sr.'s agent reacted with disappointment with the Colts' decision to name Daniel Jones the starting quarterback and said he's unsure of his client's future with the team.",
      "Anthony Richardson's agent told ESPN that there is &quot;a lot to discuss&quot; with the Colts after their decision at QB."
    ],
    "image_url": "",
    "titles": [
      "Agent unsure of Richardson's future with Colts",
      "Report: Anthony Richardson's agent has 'a lot to discuss' with Colts"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.99,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.688,
    "summary": "Anthony Richardson Sr.'s agent expressed disappointment following the Colts' decision to name Daniel Jones as the starting quarterback. He indicated uncertainty about Richardson's future with the team and mentioned that there is \"a lot to discuss\" with the Colts, as reported to ESPN.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 45 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Sophie Cunningham Out for 2025 WNBA Season with Knee Injury",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 19 Aug 2025 19:38:41 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Sophie Cunningham will miss the remainder of the 2025 WNBA season due to a right knee injury, making her the third Fever guard to go down for the year.",
      "<p>The bad luck of the Indiana Fever continues as their star enforcer is officially down for the count.</p>"
    ],
    "image_url": "",
    "titles": [
      "Fever guard Cunningham to miss rest of season",
      "Fever’s Sophie Cunningham out for remainder of WNBA season"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.99,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.688,
    "summary": "Sophie Cunningham will miss the rest of the 2025 WNBA season due to a right knee injury, becoming the third Indiana Fever guard sidelined this year. This injury adds to the team's challenges, with their key player out for the season.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 42 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Rory McIlroy Buys 1,100 Masters Flags to Celebrate Augusta Win",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 19 Aug 2025 19:38:41 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "Rory McIlroy said he took all 1,100 pin flags from the Masters Shop after winning at Augusta National in April. \"I've waited 17 years to sign that flag in the middle, and I will never complain about doing it.\"",
      "McIlroy said he will 'never get sick' of signing flags to commemorate his Masters win"
    ],
    "image_url": "",
    "titles": [
      "Rory: Took home 1,100 Masters flags after win",
      "Rory McIlroy says he took home 1,100 pin flags from The Masters Shop after completing career grand slam"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.99,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.688,
    "summary": "After winning the Masters at Augusta National in April, Rory McIlroy acquired all 1,100 pin flags from the Masters Shop, expressing his deep appreciation for the victory. He highlighted the significance of the win by stating his eagerness to sign the flags, a task he views as a privilege rather than a burden, despite the large number. McIlroy's comments reflect his fulfillment and pride in achieving a long-awaited milestone in his golfing career.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 76 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Angel Reese Sidelined for Weeks With Back Injury, Future Games Uncertain",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Tue, 19 Aug 2025 23:13:12 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Yahoo Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "sports.yahoo.com"
    ],
    "snippets": [
      "Reese had been dealing with a back injury",
      "Angel Reese hasn't played for the Sky in several weeks while dealing with a back injury."
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/08/13/bcddb3da-a8d2-4823-b505-0d85910e73b8/angel-reese-getty.png",
    "titles": [
      "Angel Reese injury update: Sky star will play Tuesday vs. Storm after missing seven straight games",
      "Sky star Angel Reese available to return from back injury in matchup vs. Storm"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.981,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.669,
    "summary": "Angel Reese has been sidelined for several weeks due to a back injury while playing for the Sky. The injury has kept her out of games recently, impacting her ability to compete. As of now, Reese's status for future games remains uncertain as she continues to recover from the back injury.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 52 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Nvidia Strikes Deal with U.S. to Sell AI Chips in China, Offers Govt 15% Share",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Tue, 19 Aug 2025 20:10:14 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "Nvidia last week struck a deal with the U.S. government to resume selling products in China, in exchange for giving it a 15% cut of the sales.",
      "Nvidia is apparently putting together a new AI chip meant for sale in China that's half as powerful as its flagship B300 Blackwell GPU. The new chip would be more powerful than the H20 GPUs the company is currently allowed to sell in the country."
    ],
    "image_url": "",
    "titles": [
      "Nvidia says it's evaluating a 'variety of products' after report of new AI chip for China",
      "Nvidia said to be developing new, more powerful AI chip for sale in China"
    ],
    "score_components": {
      "magnitude": 0.76,
      "recency": 0.902,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.667,
    "summary": "Nvidia has reached an agreement with the U.S. government to continue its sales in China, offering the government a 15% share of these sales. As part of this deal, Nvidia is developing a new AI chip for the Chinese market, which will be half as powerful as its leading B300 Blackwell GPU but still surpasses the capabilities of the H20 GPUs currently permitted for sale in China.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 68 tokens",
    "image": {
      "src": "icons/usa.svg",
      "thumbnail": "icons/usa.svg",
      "alt": "u s flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Real Madrid Secures Narrow 1-0 Win Over Osasuna in La Liga Opener",
    "domain": "sports",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Tue, 19 Aug 2025 21:53:22 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Sports Illustrated"
    ],
    "domains": [
      "news.google.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Real Madrid open their La Liga season with a nervy 1-0 home win against Osasuna at Santiago Bernabeu.",
      "<a href=\"https://news.google.com/rss/articles/CBMihgFBVV95cUxPYm5KWktnUF81c0RwOUZuZmFITWhBVjBULWVYNkpNQTVxVjRhSHFmaEtadWRHc1U4RUM2VmZwUGQ0dEI4WkhDRm9vX05VcHZaVjFxZU9kYy1sYjBlV2dfTGJmR2hxZ3FFelVPaHdLZkdtbUIxbzd1RTgwNDFPd3VIUkpLYzE3Zw?oc=5\" target=\"_blank\">Real Madrid Player Ratings vs. Osasuna: Kylia",
      "<a href=\"https://news.google.com/rss/articles/CBMilAFBVV95cUxQNmI2RGhxX0pzX0x0R29PQ1Q0SU5TX1Q5YUlXeXRJZ29NeDRRTXBIZnU0bVBfdVBIN1p3Rjg0VkFUdzFqcVdDRWJsWVJOWkF2c0h6TmxPZ0t4SmJtMzh6RVR4WUJESnZGQmhWWWUtbVNyeXFwT0hvNDl4UExwbGJQT1dqYXZaUFZwUjRFSVpMbllIaEFN?oc=5\" target=\"_blank\">Alexander-Arnold Has La Lig",
      "<a href=\"https://news.google.com/rss/articles/CBMijAFBVV95cUxQRWF0N2Q2WmI3NnV5X2Fmc3F3cktXY1F1R1Vyb2l3ZjZkNWtBZGNBMzM2NUllSGdJRW1xM2ZiTll1RlFlOUJLZ1g0dEVrempfMVNtdm1xTDhoMFJha05OUjk0TXdOb1RQcS1XeXVZMG9zcWlHdzFWSGFvRXNFYURQSjJScDJmZjJBQ2ZucQ?oc=5\" target=\"_blank\">How to Watch Real Madrid vs. Osasuna "
    ],
    "image_url": "",
    "titles": [
      "Mbappe leads Real Madrid to narrow win against Osasuna in La Liga",
      "Real Madrid Player Ratings vs. Osasuna: Kylian Mbappe Delivers 1–0 Victory in La Liga Opener - Sports Illustrated",
      "Alexander-Arnold Has La Liga Debut to Forget: Takeaways From Real Madrid 1–0 Osasuna - Sports Illustrated",
      "How to Watch Real Madrid vs. Osasuna on TV, Live Stream - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.954,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.656,
    "summary": "Real Madrid started their La Liga season with a tense 1-0 victory over Osasuna at Santiago Bernabeu. The match saw Real Madrid secure a narrow win in their opening game. Fans can find player ratings and details on how to watch the game online.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 45 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "US Imposes New Tariffs on 407 Products, Effective Immediately",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Tue, 19 Aug 2025 19:00:55 +0000",
    "source": "Al Jazeera",
    "sources": [
      "CNBC",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "The new US tariffs covering 407 products will take effect immediately.",
      "President Donald Trump has often relied on sector-specific tariffs to enact his sprawling trade agenda."
    ],
    "image_url": "",
    "titles": [
      "Trump to raise steel and aluminium tariffs on hundreds of goods",
      "Trump expands 50% steel and aluminum tariffs to include 407 additional product types"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.899,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.652,
    "summary": "The US has implemented new tariffs on 407 products, effective immediately. President Trump frequently uses sector-specific tariffs to advance his trade policies.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 23 tokens",
    "image": {
      "src": "icons/usa.svg",
      "thumbnail": "icons/usa.svg",
      "alt": "us flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Palantir Stock Drops for Fifth Day, Erasing Month's Gains",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Tue, 19 Aug 2025 20:00:38 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Forbes"
    ],
    "domains": [
      "www.forbes.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "Palantir's stock fell for a fifth straight day to continue its pullback from all-time highs.",
      "Palantir shares have fallen around 15% across the last five days of trading, completely erasing gains made near the start of the month."
    ],
    "image_url": "",
    "titles": [
      "Palantir stock slumps 9%, falling for a fifth straight day from record",
      "Palantir Stock Slumps Over 9% As AI Stocks Like NVIDIA And Meta Cool Off"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.899,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.652,
    "summary": "Palantir's stock has dropped for five consecutive days, leading to a 15% decline in share value. This decline has wiped out the gains the company had made earlier in the month. The stock continues to pull back from its all-time highs, reflecting a downward trend in recent trading sessions.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 51 tokens",
    "image": {
      "src": "icons/chart-up.svg",
      "thumbnail": "icons/chart-up.svg",
      "alt": "stock",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "NASA's Webb Telescope Discovers New Moon Around Uranus",
    "domain": "science",
    "source_domain": "www.newscientist.com",
    "location": "global",
    "published": "Tue, 19 Aug 2025 19:20:15 +0100",
    "source": "New Scientist",
    "sources": [
      "New Scientist",
      "Phys.org"
    ],
    "domains": [
      "phys.org",
      "www.newscientist.com"
    ],
    "snippets": [
      "The James Webb Space Telescope has discovered a new moon that is small and dim in orbit around Uranus. The discovery brings the planet's total to 29, and scientists say there are probably more to be found",
      "Using NASA's James Webb Space Telescope, a team led by the Southwest Research Institute (SwRI) has identified a previously unknown moon orbiting Uranus, expanding the planet's known satellite family to 29. The detection was made during a Webb observation on Feb. 2, 2025."
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/08/19180356/SEI_262644933.jpg",
    "titles": [
      "New moon discovered orbiting Uranus is its smallest one",
      "Webb discovers a new moon orbiting Uranus"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.886,
      "consensus": 0.682,
      "constructiveness": 0.078,
      "proximity": 0.5
    },
    "score": 0.651,
    "summary": "NASA's James Webb Space Telescope, operated by a team from the Southwest Research Institute, discovered a new moon orbiting Uranus on February 2, 2025. This discovery increases Uranus's total number of known moons to 29. Scientists believe there may be more moons yet to be found around the planet.",
    "constructiveness_score": 0.078,
    "constructiveness_reason": "1 constructive keywords out of 51 tokens",
    "image": {
      "src": "icons/telescope.svg",
      "thumbnail": "icons/telescope.svg",
      "alt": "nasa",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "LIVE:  ABC News Live",
    "domain": "technology",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Tue, 19 Aug 2025 13:28:30 -0400",
    "source": "ABC News",
    "sources": [
      "ABC News",
      "The Verge"
    ],
    "domains": [
      "www.theverge.com",
      "abcnews.go.com"
    ],
    "snippets": [
      "24/7 coverage of breaking news and live events",
      "While it didn’t feature much of Silksong outside of a brief tease — though there’s plenty more coming very soon — the main event for Gamescom, Opening Night Live, did have plenty to show off during its two hour runtime. Much of it was expected and teased ahead of time, including fresh looks at Call "
    ],
    "image_url": "https://s.abcnews.com/images/Live/abc_news_live-abc-ml-250210_1739199021469_hpMain_4x3t_384.jpg",
    "titles": [
      "LIVE:  ABC News Live",
      "All the news from Gamescom Opening Night Live 2025"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.87,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.64,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 4 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Eight Sleep raises $100 million, preps retail stores - Axios",
    "domain": "technology",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Tue, 19 Aug 2025 14:03:00 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "TechCrunch"
    ],
    "domains": [
      "news.google.com",
      "techcrunch.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMibEFVX3lxTE0xZjNzdjJHRHEteERvZm5adTc3bGtpeDJDd21yRms2aDdPOXZDaTY2ZlBWQUVrdVhvV1dxcFZvcnRaUXJSb25BS1h0OGVhUlBRd2pjRE1QY0FHQk5UZGVoQm1CWFk5eDVsaUNYdQ?oc=5\" target=\"_blank\">Eight Sleep raises $100 million, preps retail stores</a>&nbsp;&nbsp;<font color=\"",
      "The sleep tech company raised  from HSG, Valor Equity Partners, Founders Fund, Y Combinator, and big F1 names like Charles Leclerc and Zak Brown."
    ],
    "image_url": "",
    "titles": [
      "Eight Sleep raises $100 million, preps retail stores - Axios",
      "Eight Sleep raises $100M to expand its AI-powered sleep tech"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.794,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.631,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 9 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Here are the best Apple Watch deals available right now",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-08-19T19:38:41-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "www.theverge.com"
    ],
    "snippets": [
      "In September, Apple launched its latest smartwatch, introducing the Apple Watch Series 10 alongside a black rendition of the Apple Watch Ultra 2. Each wearable has its own pros and cons, as does the second-gen Apple Watch SE, but the introduction of Apple’s newest wearables also means there are now ",
      "We’re in an age where you can realistically delegate tasks to smart hunks of metal, whether it’s a self-driving car or a robot that can clean on your behalf. Most of us probably won’t be able to afford the helpful sentient humanoids being developed in our lifetimes, but robot vacuums are an affordab",
      "While the best iPad deals usually land during major sale events like Black Friday and Amazon Prime Day,&#160;many great iPad deals are available outside of those times. The day-to-day discounts come and go like changing winds, so there’s often some amount to be saved, particularly on Apple’s most af"
    ],
    "image_url": "",
    "titles": [
      "Here are the best Apple Watch deals available right now",
      "Here are the best robot vacuum deals available right now",
      "The best iPad deals you can get right now"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.99,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.573,
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it provides actionable insights to readers who are interested in purchasing an Apple Watch. It can help them make informed decisions about where and when to buy to get the best deal.",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Air Canada Offers New Contract to Pay Flight Attendants for Pre-Flight Work",
    "domain": "business",
    "source_domain": "financialpost.com",
    "location": "national",
    "published": "Tue, 19 Aug 2025 21:58:58 +0000",
    "source": "Financial Post",
    "sources": [
      "Financial Post"
    ],
    "domains": [
      "financialpost.com"
    ],
    "snippets": [
      "Air Canada’s contract offer to its 10,500 flight attendants includes payment for work done before the plane is in motion, a response to a major complaint by employees of the country’s biggest airline."
    ],
    "image_url": "",
    "titles": [
      "Air Canada Cabin Crew Win Breakthrough With Pay for Pre-Flight Work"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.956,
      "consensus": 0.393,
      "constructiveness": 0.095,
      "proximity": 1.0
    },
    "score": 0.546,
    "summary": "Air Canada has proposed a new contract to its 10,500 flight attendants, addressing a significant grievance by agreeing to pay for work performed before the aircraft starts moving. This offer aims to improve conditions for employees at Canada's largest airline.",
    "constructiveness_score": 0.095,
    "constructiveness_reason": "1 constructive keywords out of 42 tokens",
    "image": {
      "src": "icons/canada.svg",
      "thumbnail": "icons/canada.svg",
      "alt": "canada flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Deel scores a lawsuit win, but not against Rippling",
    "domain": "technology",
    "source_domain": "techcrunch.com",
    "location": "global",
    "published": "Tue, 19 Aug 2025 22:47:51 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com"
    ],
    "snippets": [
      "While Deel is calling this a \"Rippling-aligned\" suit, it's not the lawsuit filed by Rippling involving an alleged corporate spy."
    ],
    "image_url": "",
    "titles": [
      "Deel scores a lawsuit win, but not against Rippling"
    ],
    "score_components": {
      "magnitude": 0.44,
      "recency": 0.973,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.497,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 9 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "New Insurance Product Shields Solar, Wind Projects from Weather Risks",
    "domain": "business",
    "source_domain": "financialpost.com",
    "location": "national",
    "published": "Tue, 19 Aug 2025 23:25:08 +0000",
    "source": "Financial Post",
    "sources": [
      "Financial Post"
    ],
    "domains": [
      "financialpost.com"
    ],
    "snippets": [
      "Solar and wind projects are betting on a novel insurance product to help offset losses from erratic weather."
    ],
    "image_url": "",
    "titles": [
      "Renewables Battling Climate Change Now Need to Insure Against It"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.985,
      "consensus": 0.393,
      "constructiveness": 0.087,
      "proximity": 0.5
    },
    "score": 0.494,
    "summary": "Solar and wind energy projects are now utilizing a new insurance product designed to mitigate financial losses caused by unpredictable weather conditions. This innovative solution aims to provide a safety net for renewable energy investments, ensuring more stable financial outcomes despite the variability in weather patterns.",
    "constructiveness_score": 0.087,
    "constructiveness_reason": "1 constructive keywords out of 46 tokens",
    "image": {
      "src": "icons/briefcase.svg",
      "thumbnail": "icons/briefcase.svg",
      "alt": "business",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "New AI Image Generator Wows Users; Creators Possibly Identified",
    "domain": "business",
    "source_domain": "www.businessinsider.com",
    "location": "global",
    "published": "2025-08-19T23:23:54Z",
    "source": "Business Insider",
    "sources": [
      "Business Insider"
    ],
    "domains": [
      "www.businessinsider.com"
    ],
    "snippets": [
      "A new AI image generator has been blowing people's socks off. Who's behind it? We may have cracked the case."
    ],
    "image_url": "https://i.insider.com/68a4fc86a17a8c5b40532055?format=jpeg",
    "titles": [
      "Is Google behind a mysterious new AI image generator? These bananas might confirm it."
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.985,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.492,
    "summary": "A new AI image generator has significantly impressed users, leading to speculation about its creators. Investigations have potentially identified the team behind it, although specific details about the creators or the technology used were not provided in the summary.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 39 tokens",
    "image": {
      "src": "icons/robot.svg",
      "thumbnail": "icons/robot.svg",
      "alt": "ai",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Nexstar Proposes $6.2B Deal for Tegna, Awaits FCC Review",
    "domain": "business",
    "source_domain": "www.marketwatch.com",
    "location": "global",
    "published": "Tue, 19 Aug 2025 23:39:00 GMT",
    "source": "MarketWatch",
    "sources": [
      "MarketWatch"
    ],
    "domains": [
      "www.marketwatch.com"
    ],
    "snippets": [
      "Nextstar is looking to buy Tegna in a $6.2 billion cash deal — but will the FCC allow it despite a conflict with current TV ownership rules?"
    ],
    "image_url": "https://images.mktw.net/im-31184394",
    "titles": [
      "Nexstar-Tegna deal puts Trump move to eliminate broadcast ownership rules to the test"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.97,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.489,
    "summary": "Nexstar has proposed a $6.2 billion cash deal to acquire Tegna, a transaction that is under scrutiny due to potential conflicts with existing TV ownership regulations. The deal's approval is contingent on the Federal Communications Commission's (FCC) review to determine if it aligns with or violates these rules. The current status of the acquisition is pending FCC's decision.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 62 tokens",
    "image": {
      "src": "icons/briefcase.svg",
      "thumbnail": "icons/briefcase.svg",
      "alt": "business",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Study Finds School Menstruation Education Lacks Depth",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Tue, 19 Aug 2025 20:00:01 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "phys.org"
    ],
    "snippets": [
      "Teaching about periods in schools is still too focused on basic biological facts, with insufficient information around how menstruation can affect a woman's mood and well-being, problems associated with menstrual bleeding, and their impact on physical and academic performance, concludes a new study "
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2024/teens-2.jpg",
    "titles": [
      "Boys can help break taboo around periods"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.997,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.488,
    "summary": "A new study concludes that education on menstruation in schools is overly focused on basic biology, lacking comprehensive information on its effects on mood, well-being, and the potential for menstrual problems to impact physical and academic performance.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 38 tokens",
    "image": {
      "src": "icons/beaker.svg",
      "thumbnail": "icons/beaker.svg",
      "alt": "science",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "AI Detects Rare Double-Glow Supernova, Advances Astrophysics Insights",
    "domain": "science",
    "source_domain": "scitechdaily.com",
    "location": "global",
    "published": "Tue, 19 Aug 2025 22:13:06 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "scitechdaily.com"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/ai-captures-once-in-a-lifetime-supernova-that-glowed-twice/\" rel=\"nofollow\" title=\"AI Captures Once-in-a-Lifetime Supernova That Glowed Twice\"><img alt=\"Explosive Interaction Black Hole Nearby Star\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"http"
    ],
    "image_url": "",
    "titles": [
      "AI Captures Once-in-a-Lifetime Supernova That Glowed Twice"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.961,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.487,
    "summary": "An AI system captured a rare astronomical event: a supernova that exhibited a unique double glow. This phenomenon, where a star explosively dies and then brightens again, was identified with the help of artificial intelligence, marking a significant achievement in the field of astrophysics. This discovery provides valuable insights into the life cycle of stars and the dynamics of supernovae.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 60 tokens",
    "image": {
      "src": "icons/robot.svg",
      "thumbnail": "icons/robot.svg",
      "alt": "ai",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Bonobo's Hide-and-Seek Game Shows Apes Can Track Multiple Humans Mentally",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Tue, 19 Aug 2025 19:10:01 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "phys.org"
    ],
    "snippets": [
      "A series of hide-and-seek experiments with a bonobo named Kanzi shows for the first time that apes can mentally keep track of multiple familiar humans at once, even when they are out of sight."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2018/bonobo.jpg",
    "titles": [
      "For apes, out of sight isn't out of mind: Bonobos can mentally track multiple members of their social circle"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.98,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.484,
    "summary": "Hide-and-seek experiments with a bonobo named Kanzi demonstrated that apes have the ability to mentally track the location of multiple familiar humans simultaneously, even when those humans are not visible. This marks the first time such cognitive skills have been observed in apes.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 45 tokens",
    "image": {
      "src": "icons/beaker.svg",
      "thumbnail": "icons/beaker.svg",
      "alt": "science",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "NASA's Space Mission Advances with Successful Data Downlink",
    "domain": "science",
    "source_domain": "science.nasa.gov",
    "location": "global",
    "published": "Tue, 19 Aug 2025 19:22:47 +0000",
    "source": "NASA",
    "sources": [
      "NASA"
    ],
    "domains": [
      "science.nasa.gov"
    ],
    "snippets": [
      "Written by Lucy Thompson, Planetary Scientist and APXS Team Member, University of New Brunswick, Canada Earth Planning Date: Monday, Aug. 18, 2025 The downlink data from our weekend activities arrived on Earth as we started planning this morning. As the APXS payload uplink and downlink lead, I asses",
      "Written by Remington Free, Operations Systems Engineer at NASA’s Jet Propulsion Laboratory Earth planning date: Friday, Aug. 15, 2025 Today we uplinked a three-sol weekend plan with lots of exciting activities — to support both the science and engineering teams!  While usually our science activities"
    ],
    "image_url": "",
    "titles": [
      "Curiosity Blog, Sols 4634-4635: A Waiting Game",
      "Curiosity Blog, Sols 4631-4633: Radiant Ridge Revolution"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.906,
      "consensus": 0.393,
      "constructiveness": 0.141,
      "proximity": 0.5
    },
    "score": 0.484,
    "summary": "On August 15, 2025, NASA's Jet Propulsion Laboratory uplinked a three-sol weekend plan filled with activities aimed at supporting both the science and engineering teams of a space mission. Following this, on August 18, 2025, Lucy Thompson, a Planetary Scientist and APXS Team Member from the University of New Brunswick, Canada, reported the successful arrival of downlink data from these weekend activities. The data arrival marked the beginning of a new planning phase, indicating progress in the mission's operations and research objectives.",
    "constructiveness_score": 0.141,
    "constructiveness_reason": "3 constructive keywords out of 85 tokens",
    "image": {
      "src": "icons/telescope.svg",
      "thumbnail": "icons/telescope.svg",
      "alt": "nasa",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "James Webb Telescope Captures Planet Birthplace in NGC 6357 Nebula",
    "domain": "science",
    "source_domain": "scitechdaily.com",
    "location": "global",
    "published": "Tue, 19 Aug 2025 22:38:36 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "scitechdaily.com"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/james-webb-spots-birthplace-of-planets-in-extreme-ultraviolet-conditions/\" rel=\"nofollow\" title=\"James Webb Spots Birthplace of Planets in Extreme Ultraviolet Conditions\"><img alt=\"Artist’s Impression of a Massive Star Forming Region in the NGC 6357 Nebula\" class=\"w"
    ],
    "image_url": "",
    "titles": [
      "James Webb Spots Birthplace of Planets in Extreme Ultraviolet Conditions"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.969,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.482,
    "summary": "The James Webb Space Telescope has observed the birthplace of planets within the NGC 6357 Nebula, capturing images in extreme ultraviolet conditions. This marks a significant advancement in understanding the conditions and processes that lead to planet formation.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 38 tokens",
    "image": {
      "src": "icons/telescope.svg",
      "thumbnail": "icons/telescope.svg",
      "alt": "telescope",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Top pediatricians buck RFK Jr.’s anti-vaccine meddling on COVID shot guidance",
    "domain": "technology",
    "source_domain": "arstechnica.com",
    "location": "global",
    "published": "Tue, 19 Aug 2025 22:39:36 +0000",
    "source": "Ars Technica",
    "sources": [
      "Ars Technica"
    ],
    "domains": [
      "arstechnica.com"
    ],
    "snippets": [
      "The American Academy of Pediatrics recommends children under age 2 get vaccinated."
    ],
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2021/10/GettyImages-1232871329-1152x648.jpeg",
    "titles": [
      "Top pediatricians buck RFK Jr.’s anti-vaccine meddling on COVID shot guidance"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.97,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.482,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 13 tokens",
    "image": {
      "src": "icons/beaker.svg",
      "thumbnail": "icons/beaker.svg",
      "alt": "vaccine",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Cell Culture Medium: Crucial for Growth in Multiple Industries",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Tue, 19 Aug 2025 15:51:03 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "phys.org"
    ],
    "snippets": [
      "Cell culture is a foundational technology widely used across fields such as pharmaceutical production, regenerative medicine, food science, and materials engineering. A critical component of successful cell culture is the culture medium—a solution containing essential nutrients that support cell gro"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/ai-learns-biological-v.jpg",
    "titles": [
      "AI learns biological variability to develop a high-performance serum-free culture medium"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.915,
      "consensus": 0.393,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.481,
    "summary": "Cell culture, a key technology in pharmaceuticals, regenerative medicine, food science, and materials engineering, relies on a culture medium to grow. This solution provides the essential nutrients needed for cell growth, highlighting its importance in various scientific and industrial applications.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "1 constructive keywords out of 40 tokens",
    "image": {
      "src": "icons/beaker.svg",
      "thumbnail": "icons/beaker.svg",
      "alt": "science",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Fallout S2 teaser brings us to New Vegas",
    "domain": "technology",
    "source_domain": "arstechnica.com",
    "location": "global",
    "published": "Tue, 19 Aug 2025 22:24:05 +0000",
    "source": "Ars Technica",
    "sources": [
      "Ars Technica"
    ],
    "domains": [
      "arstechnica.com"
    ],
    "snippets": [
      "Justin Theroux joins the cast as the villainous Robert House, along with a live-action Deathclaw."
    ],
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/08/fallout3-1152x648-1755636025.jpg",
    "titles": [
      "Fallout S2 teaser brings us to New Vegas"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.965,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.481,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 8 tokens",
    "image": {
      "src": "icons/usa.svg",
      "thumbnail": "icons/usa.svg",
      "alt": "us flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Microsoft employees occupy headquarters in protest of Israel contracts",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-08-19T16:22:39-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "www.theverge.com"
    ],
    "snippets": [
      "On Tuesday, a group of current and former Microsoft employees, as well as community members, took over a plaza at Microsoft's headquarters in Redmond, Washington, as part of a No Azure for Apartheid protest. They declared the area a \"Liberated Zone\" encampment and said they had changed its name from"
    ],
    "image_url": "",
    "titles": [
      "Microsoft employees occupy headquarters in protest of Israel contracts"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.925,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.48,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 9 tokens",
    "image": {
      "src": "icons/israel.svg",
      "thumbnail": "icons/israel.svg",
      "alt": "israel flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "In Xcode 26, Apple shows first signs of offering ChatGPT alternatives",
    "domain": "technology",
    "source_domain": "arstechnica.com",
    "location": "global",
    "published": "Tue, 19 Aug 2025 22:08:55 +0000",
    "source": "Ars Technica",
    "sources": [
      "Ars Technica"
    ],
    "domains": [
      "arstechnica.com"
    ],
    "snippets": [
      "Claude support in Xcode heralds bigger moves across the ecosystem."
    ],
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/05/Claude-4-hero-1152x648.jpg",
    "titles": [
      "In Xcode 26, Apple shows first signs of offering ChatGPT alternatives"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.959,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.48,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 11 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Webb Telescope Discovers Potential Birthplaces of Universe's First Black Holes",
    "domain": "science",
    "source_domain": "scitechdaily.com",
    "location": "global",
    "published": "Tue, 19 Aug 2025 21:48:35 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "scitechdaily.com"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/webbs-mysterious-little-red-dots-may-be-the-cradle-of-the-first-black-holes/\" rel=\"nofollow\" title=\"Webb’s Mysterious “Little Red Dots” May Be the Cradle of the First Black Holes\"><img alt=\"Little Red Dots Cosmology Astrophysics\" class=\"webfeedsFeaturedVisual wp-pos"
    ],
    "image_url": "",
    "titles": [
      "Webb’s Mysterious “Little Red Dots” May Be the Cradle of the First Black Holes"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.953,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.479,
    "summary": "The James Webb Space Telescope has identified mysterious \"little red dots\" in space, which astronomers believe could be the birthplaces of the universe's first black holes. This discovery provides new insights into the origins of black holes and the early universe.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 42 tokens",
    "image": {
      "src": "icons/telescope.svg",
      "thumbnail": "icons/telescope.svg",
      "alt": "telescope",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  }
]