[
  {
    "title": "S&P 500 Falls 2.7% as Trump Plans More Tariffs on China Amid Tensions",
    "domain": "business",
    "source_domain": "npr.org",
    "location": "national",
    "published": "Sat, 11 Oct 2025 03:44:18 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "BBC",
      "Deutsche Welle",
      "Axios",
      "CNBC",
      "Financial Times",
      "The Guardian",
      "New York Times",
      "Ars Technica",
      "ABC News",
      "Bloomberg"
    ],
    "domains": [
      "npr.org",
      "bbc.com",
      "dw.com",
      "news.google.com",
      "cnbc.com",
      "ft.com",
      "theguardian.com",
      "nytimes.com",
      "arstechnica.com",
      "abcnews.go.com"
    ],
    "snippets": [
      "President Trump threatened to place an additional 100% tax on Chinese imports starting on Nov. 1 or sooner, potentially escalating tariff rates close to levels that in April fanned fears of a recession.",
      "The S&P 500 closed down 2.7%, its steepest fall since April, after the US president hit out at China.",
      "The new tariffs on Chinese goods will kick in on November 1. These tariffs are on top of the 30% duties already in place on Chinese imports.",
      "Trump threatens 100% tariff on Chinese goods over over rare earth restrictions Axios",
      "Stock markets dropped on Trump's bellicose Truth Social post that said China is \"becoming very hostile\" in seeking tough export controls on rare earths.",
      "President says measures will include export controls on software and take effect from November 1 ‘or sooner’",
      "President accuses China of ‘very hostile’ moves and says additional tariffs could come on 1 November ‘or sooner’ Donald Trump has threatened to impose additional US tariffs of 100% on China from next month, accusing Beijing of “very hostile” moves to restrict exports of rare earths needed for Americ",
      "The president made the threat after Beijing imposed new global restrictions on the use of rare earth minerals, which are vital supplies for U.S. makers of chips and batteries.",
      "Trump claimed China's export controls on rare earths came \"out of nowhere.\"",
      "China imposed limits on rare earth minerals a day earlier.",
      "President Trump retaliated against China's export controls on rare earths after suggesting he also would cancel a meeting with Chinese President Xi Jinping.",
      "Trump Announces Additional 100% China Tariff, Tech Controls Bloomberg.com"
    ],
    "image_url": "",
    "titles": [
      "Trump threatens tech export limits, new 100% tariff on Chinese imports",
      "Trump threatens to impose additional 100% tariff on China",
      "Trump says he will impose additional 100% tariffs on China",
      "Trump threatens 100% tariff on Chinese goods over over rare earth restrictions - Axios",
      "Trump threatens 'massive' tariff hike on China over rare earths dispute",
      "Donald Trump threatens extra 100% tariff as he retaliates against China",
      "Trump threatens 100% China tariffs as Beijing restricts rare-earth exports",
      "Trump Threatens 100% Tariffs on Chinese Goods",
      "“Extremely angry” Trump threatens “massive” tariff on all Chinese exports",
      "Trump announces new 100% tariff on Chinese imports, after stock market sell-off",
      "Trump puts extra 100% tariff on China imports, adds export controls on 'critical software'",
      "Trump Announces Additional 100% China Tariff, Tech Controls - Bloomberg.com"
    ],
    "url": "https://www.npr.org/2025/10/11/g-s1-93113/trump-threatens-100-tariff-chinese-imports",
    "alternate_urls": [
      "https://www.bbc.com/news/articles/cn4wkd7729po?at_medium=RSS&at_campaign=rss",
      "https://www.dw.com/en/trump-says-he-will-impose-additional-100-tariffs-on-china/a-74315664?maca=en-rss-en-top-1022-rdf",
      "https://news.google.com/rss/articles/CBMidEFVX3lxTE1lcFF0emJhMzc2ZGlPa0VaSmhhc0ZkVGc4c0NsSFZrMVYxSlZnNXJmSzdNZTVac1ItMVRnSVhsNGRIbXdHX2tYTUFwMzB5b1VWTk1OVE9tQUh3VzdzT0x4M1A5b0kzZ1VVeU10Q0dxbU1MVUEy?oc=5",
      "https://www.cnbc.com/2025/10/10/trump-china-tariffs-rare-earths.html",
      "https://www.ft.com/content/328e3195-909a-45fb-b118-9dafbd41262b",
      "https://www.theguardian.com/us-news/2025/oct/10/trump-china-tariffs",
      "https://www.nytimes.com/2025/10/10/us/politics/trump-xi-china-tariffs-rare-earth.html",
      "https://arstechnica.com/tech-policy/2025/10/extremely-angry-trump-threatens-massive-tariff-on-all-chinese-exports/",
      "https://abcnews.go.com/Politics/trump-threatens-massive-tariffs-china-triggering-stock-market/story?id=126405187",
      "https://www.cnbc.com/2025/10/10/trump-trade-tariffs-china-software.html",
      "https://news.google.com/rss/articles/CBMisgFBVV95cUxNTjYtb2VrYzBnbExiSTlsMjJqaGlzWGJiOF8zSzRQajJocWUyeHV1N1B1VXBBNXZTdmFaSC1tOE5KUklSeWJUR3FYSmR2aGJ3N2ZMVkhJZkptNE1XQzR4Nm5ZbWVXWDRDS29JdFNjbGdnYmU5Qm5aMndJRjlxOG0yZlB4ZXJSR1lnVHlxSE5mWV9JVDFJbVVhYUloS3hQWWxrazhKblh0MDRVbFkxampiSTNR?oc=5"
    ],
    "link": "https://www.npr.org/2025/10/11/g-s1-93113/trump-threatens-100-tariff-chinese-imports",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.989,
      "consensus": 1.0,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.883,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The S&P 500 dropped 2.7% after President Trump announced plans to impose an additional 100% tariff on Chinese goods and export controls on software, starting November 1 or sooner. This decision follows China's new restrictions on rare earth mineral exports, essential for U.S. tech manufacturing. These measures add to the existing 30% duties on Chinese imports, escalating tensions between the U.S. and China. Trump criticized China's actions as \"very hostile,\" citing the impact on American industries.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Macron Reappoints Lecornu as PM to Tackle France's Political Crisis",
    "domain": "business",
    "source_domain": "npr.org",
    "location": "national",
    "published": "Fri, 10 Oct 2025 17:23:32 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "BBC",
      "Al Jazeera",
      "Deutsche Welle",
      "Financial Times",
      "The Guardian",
      "Washington Post",
      "New York Times",
      "Bloomberg"
    ],
    "domains": [
      "npr.org",
      "bbc.com",
      "aljazeera.com",
      "dw.com",
      "ft.com",
      "theguardian.com",
      "washingtonpost.com",
      "nytimes.com",
      "news.google.com"
    ],
    "snippets": [
      "French President Emmanuel Macron has reappointed Sébastien Lecornu as prime minister, just days after his resignation, asking him to try again to form a government and produce a budget.",
      "Sébastien Lecornu resigned on Monday after 26 days in the job and he said two days later his \"mission is over\".",
      "Four days after he resigned as prime minister, Lecornu is returning to the post.",
      "Just days after his resignation, Sebastien Lecornu is back in the position he had vacated. Lecornu said it was now time to \"put an end to this political crisis\" as he accepted Macron's nomination.",
      "Premier says he wants to press ahead with efforts to finalise a budget for 2026",
      "Lecornu, who resigned as PM on Monday, is tasked with urgently delivering a budget to parliament The French president, Emmanuel Macron, has reappointed his centrist ally Sébastien Lecornu as prime minister – days after Lecornu dramatically resigned and his new government collapsed after only 14 hour",
      "Sébastien Lecornu resigned as French prime minister this week after less than a month in office, and less than a day after forming a cabinet. Now he’s back.",
      "President Emmanuel Macron is trying to calm the political turmoil that has gripped the country and jeopardized the passage of a budget.",
      "Macron Renames Sebastien Lecornu as France’s New Prime Minister Bloomberg.com"
    ],
    "image_url": "",
    "titles": [
      "Macron puts Lecornu back as France's prime minister just days after he quit",
      "Macron reappoints Lecornu as French PM after days of turmoil",
      "France’s Macron reappoints Sebastien Lecornu as prime minister",
      "France: Macron reappoints Sebastien Lecornu as PM",
      "Macron reappoints Sébastien Lecornu as French prime minister",
      "France’s Macron reappoints prime minister days after he quit",
      "Macron Reappoints Sébastien Lecornu as France’s Prime Minister",
      "Macron Renames Sebastien Lecornu as France’s New Prime Minister - Bloomberg.com"
    ],
    "url": "https://www.npr.org/2025/10/10/g-s1-93066/france-government-prime-minister-lecornu-macron",
    "alternate_urls": [
      "https://www.bbc.com/news/articles/cy4j9zz54ypo?at_medium=RSS&at_campaign=rss",
      "https://www.aljazeera.com/news/2025/10/10/frances-macron-re-appoints-sebastien-lecornu-as-prime-minister?traffic_source=rss",
      "https://www.dw.com/en/france-macron-reappoints-sebastien-lecornu-as-pm/a-74315584?maca=en-rss-en-top-1022-rdf",
      "https://www.ft.com/content/52c7ff7f-362a-4bc6-b4b8-03464fa3daf6",
      "https://www.theguardian.com/world/2025/oct/10/macron-reappoints-sebastien-lecornu-as-french-prime-minister",
      "https://www.washingtonpost.com/world/2025/10/10/macron-lecornu-reappointment-prime-minister-france/",
      "https://www.nytimes.com/2025/10/10/world/europe/france-prime-minister-lecornu-macron.html",
      "https://news.google.com/rss/articles/CBMitAFBVV95cUxOdkxBTjdZTFJkaHU0elozTzFIbWxBZ3dMUWxmY2FyUlo5MXpfUWpYRlBSVl94VjNrdlRVVXpIcFRiRE5LU3RwWkwzRWlBNVpBQTJGcm9SU2xFMHhFZldFN1J3NXZlUzFCTFlpckV5YmRrSjNOX0l0UUIxUHI5SkdJVHhnLUxFSmFiRzd6UFVkV21aOHhQY255NlpvUzFKYk5CWlVFY3JHdEZyMmR5UkgxNjVrNGs?oc=5"
    ],
    "link": "https://www.npr.org/2025/10/10/g-s1-93066/france-government-prime-minister-lecornu-macron",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.797,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.834,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "French President Emmanuel Macron has reappointed Sébastien Lecornu as Prime Minister just days after Lecornu resigned from the position. Lecornu, who had left the role after less than a month and a new government collapse within 14 hours, is tasked with forming a government again and producing a budget for 2026. This move aims to address the political crisis and ensure the passage of a crucial budget.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "AstraZeneca Cuts Drug Costs for Medicaid Under Trump Deal",
    "domain": "business",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Fri, 10 Oct 2025 23:41:19 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Axios",
      "CNBC",
      "The Guardian",
      "Bloomberg"
    ],
    "domains": [
      "aljazeera.com",
      "news.google.com",
      "cnbc.com",
      "theguardian.com"
    ],
    "snippets": [
      "The US president told reporters he didn't think the deal would have been possible without his 100-percent tariff threat.",
      "Trump unveils drug price deal with AstraZeneca Axios",
      "Trump announced the agreement with AstraZeneca on Friday, after striking a similar deal with Pfizer late last month.",
      "Company to sell some medicines at a discount to US’s Medicaid health plan in exchange for tariff relief Donald Trump announced a deal with the British-based drugmaker AstraZeneca for a “most-favored-nation” drug-pricing model aimed at making prescription medicines more affordable and avoiding the ad",
      "Trump Announces AstraZeneca Drug Price Cuts for Tariff Reprieve Bloomberg.com"
    ],
    "image_url": "",
    "titles": [
      "Trump reveals prescription drug deal with pharmaceutical giant AstraZeneca",
      "Trump unveils drug price deal with AstraZeneca - Axios",
      "Trump reaches deal with AstraZeneca to lower U.S. drug prices",
      "AstraZeneca makes deal with Trump to lower drug prices and avoid tariffs",
      "Trump Announces AstraZeneca Drug Price Cuts for Tariff Reprieve - Bloomberg.com"
    ],
    "url": "https://www.aljazeera.com/news/2025/10/10/trump-reveals-prescription-drug-deal-with-pharmaceutical-giant-astrazeneca?traffic_source=rss",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMicEFVX3lxTE5VaW5WTVZESTRmODJmUGo1aUZpMkJXNmhqazlIVUUzRTBxUVRqTE56VE16bTJST1lIOXJiMDFxWEV2WVNlT0dnQklIT2NrUWhNMmZrRUx0dEF2RWFBODJJN3NIcEZhd0NfTjlMRU5FNjk?oc=5",
      "https://www.cnbc.com/2025/10/10/trump-astrazeneca-drug-pricing-deal.html",
      "https://www.theguardian.com/us-news/2025/oct/10/trump-astrazeneca-drug-prices",
      "https://news.google.com/rss/articles/CBMitgFBVV95cUxPUVVPRkNqeGdpU0R1WExVcmFHbVRjUWdDR28zNEFvWmw0TTc1b0N6V0ZYSlRBZTVQRUpFR212cV9KdlVfbk5oR2pFRG9NS2FnNGZhbDdMUWc4OVNvTFM0ODdvb29vLVJuM3p5S2luNnJDY19qTUdMU1B1NmJnRkJTRzRsanM0TzI3M1lpcG9zVE1WMzZYNlBhbldSbjJpbE9iZ2hFX3pkUFlTcC1SanBrMzctbkdlUQ?oc=5"
    ],
    "link": "https://www.aljazeera.com/news/2025/10/10/trump-reveals-prescription-drug-deal-with-pharmaceutical-giant-astrazeneca?traffic_source=rss",
    "score_components": {
      "magnitude": 0.984,
      "recency": 0.836,
      "consensus": 0.975,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.815,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "AstraZeneca, a UK-based drugmaker, has agreed to lower prescription drug costs for Medicaid in the US as part of a deal with the Trump administration. This agreement, aimed at making prescription medicines more affordable, involves selling some medicines at a discount to Medicaid in exchange for tariff relief. This makes AstraZeneca the second company to strike such a deal under Trump's initiative to reduce U.S. drug prices.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: initiative",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Misses Nobel Nomination, Praises 2025 Winner Machado",
    "domain": "business",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Fri, 10 Oct 2025 18:28:13 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Al Jazeera",
      "CNBC",
      "The Guardian",
      "Washington Post",
      "New York Times"
    ],
    "domains": [
      "bbc.com",
      "aljazeera.com",
      "cnbc.com",
      "theguardian.com",
      "washingtonpost.com",
      "nytimes.com"
    ],
    "snippets": [
      "Machado is recognised for \"tireless work promoting democratic rights\" in Venezuela, the Nobel Committee says.",
      "Former Venezuelan opposition leader Maria Corina Machado, who's in hiding, is the 2025 Nobel Peace Prize winner.",
      "Some of Trump's Republican allies have called for him to get the Nobel Peace Prize, though the nomination deadline passed early in his current term.",
      "Opponent of Maduro regime receives award and praise for keeping ‘flame of democracy burning’ The Venezuelan opposition politician María Corina Machado has won the Nobel peace prize for her dogged struggle to rescue the South American country from its fate as “a brutal, authoritarian state”. Machado,",
      "The Nobel Prize Committee honored Machado, who is in hiding, for keeping “the flame of democracy burning.” The White House accused members of “placing politics over peace.”",
      "Ms. Machado galvanized a movement that independent analysts say won last year’s election, only to have it stolen by President Nicolás Maduro.",
      "Ms. Machado built Venezuela’s biggest opposition movement and lives in hiding from President Nicolás Maduro’s authoritarian government."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/2918/live/cfb8d170-a5f2-11f0-b741-177e3e2c2fc7.jpg",
    "titles": [
      "Venezuelan opposition leader María Corina Machado wins Nobel Peace Prize",
      "Who is Nobel Peace Prize winner Maria Corina Machado?",
      "Nobel Peace Prize winner Machado praises Trump after White House criticizes snub",
      "Venezuelan politician María Corina Machado wins Nobel peace prize",
      "María Corina Machado, Venezuelan opposition leader, wins Nobel Peace Prize",
      "María Corina Machado Wins Nobel Peace Prize Despite Trump’s Campaign",
      "Who Is María Corina Machado, the Winner of the 2025 Nobel Peace Prize?"
    ],
    "url": "https://www.bbc.com/news/articles/c70821201ego?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://www.aljazeera.com/video/newsfeed/2025/10/10/who-is-nobel-peace-prize-winner-maria-corina-machado?traffic_source=rss",
      "https://www.cnbc.com/2025/10/10/trump-nobel-peace-prize-machado-cheung.html",
      "https://www.theguardian.com/world/2025/oct/10/venezuelan-politician-maria-corina-machado-wins-nobel-peace-prize",
      "https://www.washingtonpost.com/world/2025/10/10/maria-machado-nobel-peace-prize-venezuela/",
      "https://www.nytimes.com/2025/10/10/world/americas/machado-venezuela-nobel-peace-prize.html",
      "https://www.nytimes.com/2025/10/10/world/americas/maria-corina-machado-nobel-peace-prize-venezuela.html"
    ],
    "link": "https://www.bbc.com/news/articles/c70821201ego?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.735,
      "consensus": 1.0,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.807,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Republican allies have suggested Donald Trump should receive the Nobel Peace Prize, but the nomination deadline for his current term had already passed. Despite this, Trump congratulated the 2025 Nobel Peace Prize winner, Machado, and received praise in return. The next opportunity for Trump to be considered for the prize will be in 2026, as the Nobel Peace Prize, established in 1901, annually recognizes efforts in peace-making.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Qatar to Build Air Force Training Facility in Idaho, US Announces",
    "domain": "business",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Fri, 10 Oct 2025 17:27:47 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Al Jazeera",
      "Axios",
      "CNBC",
      "The Guardian",
      "Washington Post"
    ],
    "domains": [
      "bbc.com",
      "aljazeera.com",
      "news.google.com",
      "cnbc.com",
      "theguardian.com",
      "washingtonpost.com"
    ],
    "snippets": [
      "The facility in Idaho will be used to train Qatari pilots to fly F-15 fighter jets, the US defence secretary says.",
      "US, Qatar sign letter of agreement to bring Qatari F-15 fighter jet contingent to US base, hail increased cooperation.",
      "Qatar to build air force facility on U.S. base in Idaho Axios",
      "Hegseth The Defense secretary made the announcement at a Pentagon press conference with Sheikh Saoud bin Abdulrahman Al Thani, Qatar's defense minister.",
      "Earlier, Pentagon chief shared that location would host ‘contingent of Qatari F-15s and pilots’. This blog is now closed. White House announces federal worker layoffs as government shutdown nears third week As the shutdown enters its 10th day, and both chambers are out of session today, House speake",
      "Defense Secretary Pete Hegseth said Mountain Home Air Force Base in Idaho will host Qatari pilots at the military facility. The base will remain under U.S. jurisdiction."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/d288/live/f71c1d60-a5f9-11f0-928c-71dbb8619e94.jpg",
    "titles": [
      "Qatar to build air force facility in Idaho, US says",
      "Pentagon chief Hegseth announces Qatari Air Force facility at Idaho base",
      "Qatar to build air force facility on U.S. base in Idaho - Axios",
      "Qatar Air Force facility to be built at USAF base in Idaho, Defense Secretary Hegseth says",
      "After uproar, Pete Hegseth clarifies Qatari air force facility in Idaho is not a foreign base – as it happened",
      "Why Qatar is building an air force training facility at a U.S. military base"
    ],
    "url": "https://www.bbc.com/news/articles/c75q2y92090o?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://www.aljazeera.com/news/2025/10/10/pentagon-chief-hegseth-announces-qatari-air-force-facility-at-idaho-base?traffic_source=rss",
      "https://news.google.com/rss/articles/CBMid0FVX3lxTFBJd2VKcU0xaVpkVXBRb0dfQzhBUXNURHZmOUZicXBBLUZxZmIzbHBuaEx0elVLd0UzTzUxa3gwRklUV1JRSkpIc1FGaEQwSVBzYTdTUHd2Y2dFblhwMndvc05zT2JJTEdIdFF6NE5LR1o1cGdSTmVZ?oc=5",
      "https://www.cnbc.com/2025/10/10/us-qatar-air-force-idaho-hegseth-defense.html",
      "https://www.theguardian.com/us-news/live/2025/oct/10/letitia-james-donald-trump-us-politics-live-news-updates",
      "https://www.washingtonpost.com/national-security/2025/10/11/qatar-air-foce-facility-us-idaho/"
    ],
    "link": "https://www.bbc.com/news/articles/c75q2y92090o?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.719,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.794,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The US Defense Secretary announced at a Pentagon press conference with Qatar's Defense Minister, Sheikh Saoud bin Abdulrahman Al Thani, that Qatar will construct an air force facility in Idaho. This facility will be used for training Qatari pilots to operate F-15 fighter jets.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Administration Begins Federal Worker Layoffs Amid Shutdown",
    "domain": "business",
    "source_domain": "dw.com",
    "location": "global",
    "published": "2025-10-11T00:00:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "The Guardian",
      "Forbes",
      "Business Insider"
    ],
    "domains": [
      "dw.com",
      "theguardian.com",
      "forbes.com",
      "businessinsider.com"
    ],
    "snippets": [
      "The White House has begun what it called \"substantial\" mass layoffs, as Republicans and Democrats continue to spar over the state budget. Trump suggested the layoffs were a tool to pressure the Democrats.",
      "AFL-CIO fights issue in court as union leader warns of ‘devastating effects’ for Americans The White House announced layoffs of federal workers on Friday, making good on a threat it had made in response to the US government shutdown , which now appears set to stretch into a third straight week. Russ",
      "The Office Of Management and Budget said the layoffs are “substantial,” multiple outlets reported.",
      "The federal government has begun to fire employees. Thousands remain furloughed or are working without pay."
    ],
    "image_url": "",
    "titles": [
      "US: White House starts mass layoffs amid shutdown impasse",
      "White House announces federal worker layoffs as shutdown nears third week",
      "Trump Begins Threatened Mass Layoffs During Shutdown",
      "The White House has identified more than 4,100 federal workers for layoffs as the shutdown drags on"
    ],
    "url": "https://www.dw.com/en/us-white-house-starts-mass-layoffs-amid-shutdown-impasse/a-74315245?maca=en-rss-en-top-1022-rdf",
    "alternate_urls": [
      "https://www.theguardian.com/us-news/2025/oct/10/federal-workers-pay-government-shutdown",
      "https://www.forbes.com/sites/saradorn/2025/10/10/trump-begins-threatened-mass-layoffs-during-shutdown/",
      "https://www.businessinsider.com/federal-worker-firings-during-government-shutdown-what-we-know-2025-10"
    ],
    "link": "https://www.dw.com/en/us-white-house-starts-mass-layoffs-amid-shutdown-impasse/a-74315245?maca=en-rss-en-top-1022-rdf",
    "score_components": {
      "magnitude": 0.932,
      "recency": 0.842,
      "consensus": 0.908,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.782,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Trump administration has initiated layoffs of federal workers, following through on a threat linked to the US government shutdown. While the exact number of affected employees and agencies remains unspecified, the move has prompted significant concern, with unions like AFL-CIO planning legal action due to the anticipated negative impact on Americans. This development comes as thousands of federal employees continue to be furloughed or work without pay.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Explosion at Tennessee Munitions Plant: Unknown Fatalities, 19 Missing",
    "domain": "business",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Fri, 10 Oct 2025 22:58:15 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Al Jazeera",
      "The Guardian",
      "Forbes"
    ],
    "domains": [
      "bbc.com",
      "aljazeera.com",
      "theguardian.com",
      "forbes.com"
    ],
    "snippets": [
      "\"There's nothing to describe, it's gone,\" says Humphreys County Sheriff Mike Davis, who grew emotional while providing an update about the most devastating incident of his career.",
      "Authorities in the southern US state have called the blast 'devastating', with many of the missing presumed dead.",
      "Police chief calls explosion near Bucksnort, south-west of Nashville, ‘devastating’ and says ‘we have some deceased’ Nineteen people are missing and feared dead following a huge explosion at a military munitions plant in Tennessee. The powerful blast ripped through the explosives manufacturing plant",
      "The early morning blast leveled a building, prompting a joint investigation and search for missing workers."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/e13a/live/96ab36a0-a621-11f0-92db-77261a15b9d2.jpg",
    "titles": [
      "Nineteen missing after explosion at Tennessee munitions factory",
      "Massive explosion at Tennessee munitions factory leaves 19 people missing",
      "Nineteen people feared dead after blast at Tennessee munitions plant",
      "Tennessee Munitions Plant Explosion – What We Know"
    ],
    "url": "https://www.bbc.com/news/articles/c89d4zw8704o?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://www.aljazeera.com/news/2025/10/11/massive-explosion-at-tennessee-munitions-factory-leaves-19-people-missing?traffic_source=rss",
      "https://www.theguardian.com/us-news/2025/oct/10/tennessee-military-explosives-plant-explosion",
      "https://www.forbes.com/sites/martinacastellanos/2025/10/10/tennessee-munitions-plant-explosion--what-we-know/"
    ],
    "link": "https://www.bbc.com/news/articles/c89d4zw8704o?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.807,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.751,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A massive explosion at a military munitions plant in Tennessee resulted in an unknown number of fatalities, with 19 people missing and feared dead. The incident, described as \"devastating\" by local law enforcement, occurred early in the morning, completely destroying a building. Humphreys County Sheriff Mike Davis and the police chief of Bucksnort confirmed the severity of the situation and a joint investigation is underway to search for missing workers and determine the cause.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "US Government Issues Layoff Notices Amid Shutdown, Affecting Thousands",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Fri, 10 Oct 2025 18:34:16 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "CNBC",
      "Bloomberg",
      "Ars Technica"
    ],
    "domains": [
      "news.google.com",
      "cnbc.com",
      "arstechnica.com"
    ],
    "snippets": [
      "Trump officials lay off more HHS employees amid government shutdown Axios",
      "The Trump administration and Republicans have sought to blame Democrats for the government shutdown, and any negative fallout from it.",
      "Trump Fires Federal Workers, Escalating US Shutdown Fight Bloomberg.com",
      "HHS would not say how many are being let go, but union says \"thousands.\""
    ],
    "image_url": "",
    "titles": [
      "Trump officials lay off more HHS employees amid government shutdown - Axios",
      "Trump says 'a lot' of federal workers are being laid off during government shutdown",
      "Trump Fires Federal Workers, Escalating US Shutdown Fight - Bloomberg.com",
      "Trump admin fires more health employees amid government shutdown"
    ],
    "url": "https://news.google.com/rss/articles/CBMihAFBVV95cUxOYlNoVXdMOFhhdWlhQnJEMnNfWjJ3c1lFU2NncjlqSktSbm9wV0NwbkV4cm9PX0FGS1Q4Z2FLMS1HMWhGS2JPTHM4WTAyR2hZY2dMT0o3cnBVdnNZeXZ0YUxudFlKYmR1WThpWWl3QXpOUGxCb1o4N0tyV0k4cDhTX2JGc3E?oc=5",
    "alternate_urls": [
      "https://www.cnbc.com/2025/10/10/trump-russ-vought-layoffs-government-shutdown.html",
      "https://news.google.com/rss/articles/CBMirwFBVV95cUxOWWVsX19pSWNWc1FxOWJVQWRSM1RVaFNmMHAyeDR1aDhJNTQ3QUtnQ1pHUjU1dE1pTGhaeEFVTkxCNnhIUnJ2d1VGLWhWTldBaExiZl8zVWNwaHBLeVNUZDNNRFVoVDJ4SFplYk01ZUh1ZnRpNklaQ002cVk2VXA1MmJuRnhXWHcyYnFFeWV6YU9ZN1QwaDhaVGtwSW44N0FYVy1oSkhralRPbnNvNUNr?oc=5",
      "https://arstechnica.com/health/2025/10/more-federal-health-employees-axed-amid-shutdown-linked-terminations/"
    ],
    "link": "https://news.google.com/rss/articles/CBMihAFBVV95cUxOYlNoVXdMOFhhdWlhQnJEMnNfWjJ3c1lFU2NncjlqSktSbm9wV0NwbkV4cm9PX0FGS1Q4Z2FLMS1HMWhGS2JPTHM4WTAyR2hZY2dMT0o3cnBVdnNZeXZ0YUxudFlKYmR1WThpWWl3QXpOUGxCb1o4N0tyV0k4cDhTX2JGc3E?oc=5",
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.736,
      "consensus": 0.888,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.738,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The US government has issued reduction-in-force notifications to employees in several departments, including the Treasury and Homeland Security, amid a government shutdown. Additionally, Trump administration officials have laid off more employees within the Department of Health and Human Services (HHS), though the exact number has not been disclosed. However, the union representing these workers claims that \"thousands\" are being affected by these layoffs.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Israel Begins Troop Withdrawal from Gaza, Hostage-Prisoner Swap Underway",
    "domain": "general",
    "source_domain": "bbc.co.uk",
    "location": "global",
    "published": "Fri, 10 Oct 2025 15:36:00 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Al Jazeera",
      "Deutsche Welle",
      "Washington Post"
    ],
    "domains": [
      "bbc.co.uk",
      "aljazeera.com",
      "dw.com",
      "washingtonpost.com"
    ],
    "snippets": [
      "Palestinians begin returning to Gaza's north.",
      "Families eager to return to what's left of their homes are walking back to Gaza City as Israel begins its withdrawal.",
      "The UN is preparing to ramp up aid deliveries in Gaza as tens of thousands of displaced Palestinians return home. Many questions remain over the viability of Trump's Gaza peace plan.",
      "Israel began to reposition troops Friday as the clock started on the first phase of an agreement for the release of hostages in exchange for Palestinian prisoners."
    ],
    "image_url": "https://ichef.bbci.co.uk/images/ic/240x135/p0l7jnbt.jpg",
    "titles": [
      "Israel-Gaza: The Ceasefire Is Now \"In Effect\"",
      "Families walk back to Gaza City minutes after ceasefire goes into effect",
      "Thousands of Gaza residents return as ceasefire takes effect",
      "What to know about the Gaza ceasefire deal as it takes effect"
    ],
    "url": "https://www.bbc.co.uk/programmes/p0m7y2cg?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://www.aljazeera.com/video/newsfeed/2025/10/10/families-walk-back-to-gaza-city-minutes-after-ceasefire-goes-into-effect?traffic_source=rss",
      "https://www.dw.com/en/thousands-of-gaza-residents-return-as-ceasefire-takes-effect/a-74317511?maca=en-rss-en-top-1022-rdf",
      "https://www.washingtonpost.com/world/2025/10/10/gaza-ceasefire-trump-israel-hamas/"
    ],
    "link": "https://www.bbc.co.uk/programmes/p0m7y2cg?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.692,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.735,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Palestinians are returning to Gaza City's northern areas as Israel starts withdrawing troops, following the initiation of an agreement that involves the exchange of hostages for Palestinian prisoners. This move marks the beginning of the agreement's first phase, with families heading back to their homes.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "North Korea Displays New Missile at Party's 80th Anniversary Parade",
    "domain": "general",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Sat, 11 Oct 2025 06:27:09 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Deutsche Welle",
      "New York Times"
    ],
    "domains": [
      "aljazeera.com",
      "dw.com",
      "nytimes.com"
    ],
    "snippets": [
      "The Hwasong-20 ICBM was revealed on the 80th anniversary of North Korea's ruling Workers' Party.",
      "Kim Jong Un's leadership delivered a speech as his military showed off a new intercontinental ballistic missile in a massive parade. Kim also held talks with Russia's Dmitry Medvedev.",
      "The parade, held in North Korea’s capital to celebrate the 80th anniversary of the ruling Workers’ Party, ​gave its leader a chance to show off his growing power."
    ],
    "image_url": "",
    "titles": [
      "North Korea unveils ‘most powerful’ missile at 80th anniversary parade",
      "North Korea displays long-range missile at parade",
      "North Korea Flaunts New Missiles ​in Parade With Chinese and Russian Officials"
    ],
    "url": "https://www.aljazeera.com/news/2025/10/11/north-korea-unveils-most-powerful-missile-at-80th-anniversary-parade?traffic_source=rss",
    "alternate_urls": [
      "https://www.dw.com/en/north-korea-displays-long-range-missile-at-parade/a-74317379?maca=en-rss-en-top-1022-rdf",
      "https://www.nytimes.com/2025/10/11/world/asia/north-korea-military-parade-china-russia.html"
    ],
    "link": "https://www.aljazeera.com/news/2025/10/11/north-korea-unveils-most-powerful-missile-at-80th-anniversary-parade?traffic_source=rss",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.963,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.729,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "On the 80th anniversary of North Korea's ruling Workers' Party, a parade in the capital showcased the new Hwasong-20 intercontinental ballistic missile. Leader Kim Jong Un delivered a speech during the event, which also featured discussions with Russia's Dmitry Medvedev, highlighting North Korea's military capabilities and diplomatic connections.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Las Vegas Aces Sweep Mercury for Third WNBA Title in Four Years",
    "domain": "sports",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Sat, 11 Oct 2025 01:39:38 -0400",
    "source": "ABC News",
    "sources": [
      "ABC News",
      "Forbes",
      "Sportsnet"
    ],
    "domains": [
      "abcnews.go.com",
      "forbes.com",
      "sportsnet.ca"
    ],
    "snippets": [
      "A’ja Wilson scored 31 points, Chelsea Gray and Jackie Young both added 18 and the Las Vegas Aces beat the Phoenix Mercury 97-86 in Game 4 of the WNBA Finals, sweeping their way to a third championship in four seasons",
      "Led by A'ja Wilson's 31 points, the Las Vegas Aces won the franchise's third championship to cement modern WNBA dynasty",
      "A’ja Wilson has brought a dynasty to Las Vegas."
    ],
    "image_url": "https://s.abcnews.com/images/Sports/wirestory_84c5472133aecf0d091d380583f4d018_4x3_384.jpg",
    "titles": [
      "Aces win third WNBA title in 4 seasons, beating Mercury 97-86 for 4-game sweep",
      "Aces Win 2025 WNBA Championship With Sweep Over Mercury",
      "WNBA Finals Game 4 Takeaways: Aces sweep Mercury, establish dynasty with third championship"
    ],
    "url": "https://abcnews.go.com/Sports/wireStory/wilson-scores-31-aces-win-wnba-title-4-126422706",
    "alternate_urls": [
      "https://www.forbes.com/sites/roberta-rodrigues/2025/10/11/aces-win-2025-wnba-championship-with-sweep-over-mercury/"
    ],
    "link": "https://abcnews.go.com/Sports/wireStory/wilson-scores-31-aces-win-wnba-title-4-126422706",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.947,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.726,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Las Vegas Aces won their third WNBA championship in four seasons, defeating the Phoenix Mercury 97-86 in Game 4 to complete a sweep of the Finals. A’ja Wilson led the team with 31 points, while Chelsea Gray and Jackie Young each contributed 18 points. The Aces dominated the series, averaging over 90 points per game and showcasing a strong offensive performance throughout.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Knicks, Raptors End Legal Dispute Over Confidential Files",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Sat, 11 Oct 2025 01:25:24 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "espn.com",
      "cbssports.com"
    ],
    "snippets": [
      "The Knicks and Raptors agreed to voluntarily dismiss a 2023 lawsuit involving the alleged theft of thousands of confidential files, according to a court filing Friday that was obtained by ESPN.",
      "The legal battle spanned more than two years after the Knicks filed the lawsuit"
    ],
    "image_url": "",
    "titles": [
      "Knicks, Raptors agree to voluntarily dismiss lawsuit",
      "Knicks, Raptors mutually agree to dismiss lawsuit over alleged theft of confidential files, per report"
    ],
    "url": "https://www.espn.com/nba/story/_/id/46555147/new-york-knicks-toronto-raptors-agree-voluntarily-dismiss-2023-lawsuit",
    "alternate_urls": [
      "https://www.cbssports.com/nba/news/knicks-raptors-mutually-agree-to-dismiss-lawsuit-over-alleged-theft-of-confidential-files-per-report/"
    ],
    "link": "https://www.espn.com/nba/story/_/id/46555147/new-york-knicks-toronto-raptors-agree-voluntarily-dismiss-2023-lawsuit",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.942,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.668,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Knicks and Raptors have mutually agreed to dismiss a lawsuit from 2023, where the Knicks accused the Raptors of stealing thousands of confidential files. This decision, documented in a court filing obtained by ESPN, ends a legal dispute that lasted over two years.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Pujols Talks Angels Manager Role with GM, No Offer Yet",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Sat, 11 Oct 2025 01:25:24 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "espn.com",
      "sportsnet.ca"
    ],
    "snippets": [
      "Albert Pujols met with Angels general manager Perry Minasian about the team's managerial vacancy Thursday night but hasn't been offered the job, a source told ESPN.",
      "Albert Pujols has met with the Los Angeles Angels about returning to their dugout as their next manager, a person with knowledge of the meeting told The Associated Press on Friday."
    ],
    "image_url": "",
    "titles": [
      "Source: Pujols, Angels discuss managerial opening",
      "Report: Albert Pujols has met with Angels about managerial opening"
    ],
    "url": "https://www.espn.com/mlb/story/_/id/46555875/pujols-meets-angels-managerial-opening",
    "alternate_urls": [],
    "link": "https://www.espn.com/mlb/story/_/id/46555875/pujols-meets-angels-managerial-opening",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.942,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.668,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Albert Pujols discussed the Los Angeles Angels' managerial vacancy with General Manager Perry Minasian but has not received a job offer. The meeting, confirmed by sources to ESPN, Sports Illustrated, and The Associated Press, marks Pujols' potential return to the Angels in a new role.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Mariners and Blue Jays Face Off in ALCS for World Series Spot",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Sat, 11 Oct 2025 01:22:47 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "espn.com",
      "sportsnet.ca"
    ],
    "snippets": [
      "It's the AL's top two seeds for a trip to the Fall Classic. Here's your first look at how Seattle and Toronto stack up.",
      "While the Blue Jays prepare for the best-of-seven ALCS, Shi Davidi takes a look at where the key decisions on the roster are and how they shape up."
    ],
    "image_url": "",
    "titles": [
      "The ALCS is set! Odds, X factors and how the Mariners and Blue Jays can reach the World Series",
      "Some factors to consider as Blue Jays debate ALCS roster"
    ],
    "url": "https://www.espn.com/mlb/story/_/id/46532595/mlb-playoffs-2025-first-look-preview-alcs-nlcs-reach-world-series",
    "alternate_urls": [],
    "link": "https://www.espn.com/mlb/story/_/id/46532595/mlb-playoffs-2025-first-look-preview-alcs-nlcs-reach-world-series",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.942,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.668,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Seattle Mariners and Toronto Blue Jays, the top two seeds in the American League, are set to compete in the best-of-seven ALCS for a chance to advance to the World Series. Analyst Shi Davidi reviews the key roster decisions and strengths of both teams ahead of the series.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Israeli Forces Begin Gaza Withdrawal After Ceasefire Ends 6-Month Conflict",
    "domain": "general",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Sat, 11 Oct 2025 07:51:45 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "The Guardian"
    ],
    "domains": [
      "aljazeera.com",
      "theguardian.com"
    ],
    "snippets": [
      "Displaced Palestinians return to the ruins of homes, driven by loss, defiance and the will to rebuild.",
      "US President Donald Trump says Israeli captives held in Gaza will be released on Monday.",
      "Thousands walk north along coastal road after Israel-Hamas agreement puts stop to fighting for first time in six months Tens of thousands of displaced Palestinians in Gaza have begun to return to the ruins of their homes after the ceasefire rapidly negotiated in recent days between Hamas and Israel"
    ],
    "image_url": "",
    "titles": [
      "Palestinians search Gaza rubble for loved ones in ceasefire, return home",
      "LIVE: Palestinians return to northern Gaza as Israel-Hamas ceasefire holds",
      "Palestinians displaced to southern Gaza begin journey home as ceasefire comes into effect"
    ],
    "url": "https://www.aljazeera.com/news/2025/10/11/palestinians-search-gaza-rubble-for-loved-ones-in-ceasefire-return-home?traffic_source=rss",
    "alternate_urls": [
      "https://www.aljazeera.com/news/liveblog/2025/10/11/live-trump-says-captive-swap-due-monday-as-israel-gaza-ceasefire-unfolds?traffic_source=rss",
      "https://www.theguardian.com/world/2025/oct/10/palestinians-displaced-gaza-home-ceasefire-israel-hamas"
    ],
    "link": "https://www.aljazeera.com/news/2025/10/11/palestinians-search-gaza-rubble-for-loved-ones-in-ceasefire-return-home?traffic_source=rss",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.992,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.66,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Israeli forces started withdrawing from key areas in Gaza, following a ceasefire agreement with Hamas, ending six months of fighting. This move came after intense US-led diplomacy. Thousands of displaced Palestinians are returning home as the ceasefire takes effect, marking a significant pause in the conflict.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Nebraska vs. Maryland Football: Watch Details and Game Predictions Released",
    "domain": "sports",
    "source_domain": "cornhuskerswire.usatoday.com",
    "location": "national",
    "published": "Sat, 11 Oct 2025 07:30:23 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports",
      "Sports Illustrated"
    ],
    "domains": [
      "cornhuskerswire.usatoday.com",
      "news.google.com"
    ],
    "snippets": [
      "It's Nebraska football vs Maryland. Here's how to watch, including time, channel, TV schedule and streaming info.",
      "HuskerMax Predictions: Nebraska Football vs. Maryland Sports Illustrated"
    ],
    "image_url": "",
    "titles": [
      "How to watch Nebraska football vs Maryland today: Time, TV channel",
      "HuskerMax Predictions: Nebraska Football vs. Maryland - Sports Illustrated"
    ],
    "url": "https://cornhuskerswire.usatoday.com/story/sports/college/cornhuskers/football/2025/10/11/nebraska-football-maryland-channel-time-tv-streaming/86640128007/",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiywFBVV95cUxNaTVveXppcnFIaXF0aDB3UTZLS2Nta2VOZXNDSUtidW1oOGFCZzY3Q0U1VElsUU5adzJHakxTQzg0cnpXeVJNUW1OS1hBRHNOeDB3RkdEQWFVYXdKaXZBUThWLW5DcnQweUd6d0xkWVM4UHY4SGhpZVhpdUNZTnUtaDRMdDkxeTJ6dG9JQnNfY21RTjEyb1lMeVZuY0xPVjFxSDMzcWNBaTh0YTBDSk9DSzBxVlpNcVBZTlc2Z3VUZ0xneVR2SGtVWnh2MA?oc=5"
    ],
    "link": "https://cornhuskerswire.usatoday.com/story/sports/college/cornhuskers/football/2025/10/11/nebraska-football-maryland-channel-time-tv-streaming/86640128007/",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.984,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.659,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Nebraska football is set to play against Maryland. Details for watching the game, including the time, channel, TV schedule, and streaming information, are available for fans. Additionally, HuskerMax and Sports Illustrated have released predictions for the outcome of the match.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Heavy Rains in Mexico Claim 23 Lives, Damage Thousands of Homes",
    "domain": "general",
    "source_domain": "nytimes.com",
    "location": "global",
    "published": "Sat, 11 Oct 2025 06:37:49 +0000",
    "source": "New York Times",
    "sources": [
      "New York Times",
      "The Guardian"
    ],
    "domains": [
      "nytimes.com",
      "theguardian.com"
    ],
    "snippets": [
      "The downpours also damaged thousands of homes and cut off power to entire towns. More rain was expected this weekend.",
      "Worst-affected areas include Veracruz, Queretaro, Hidalgo and San Luis Potosi, with some people unaccounted for At least 23 people had died in Mexico by the end of a week that brought heavy rains, authorities said. Mexico’s civil defence authorities on Friday reported intense rainfall in 31 of 32 st"
    ],
    "image_url": "https://static01.nyt.com/images/2025/10/11/multimedia/11xp-mexico-jkqz/11xp-mexico-jkqz-mediumSquareAt3X.jpg",
    "titles": [
      "Heavy Rain, Floods and Landslides in Mexico Kill at Least 27",
      "Mexico floods kill at least 23 people as storms head north"
    ],
    "url": "https://www.nytimes.com/2025/10/11/world/americas/mexico-floods-rain.html",
    "alternate_urls": [
      "https://www.theguardian.com/world/2025/oct/11/mexico-floods-kill-at-least-23-people-as-storms-head-north"
    ],
    "link": "https://www.nytimes.com/2025/10/11/world/americas/mexico-floods-rain.html",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.966,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.655,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Heavy rains in Mexico resulted in at least 23 deaths, with intense rainfall reported in 31 of 32 states. The worst-affected areas are Veracruz, Queretaro, Hidalgo, and San Luis Potosi. Thousands of homes were damaged, and power was cut off to entire towns. Some people remain unaccounted for, and more rain is expected.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "A’ja Wilson Wins Second Finals MVP, Joins Elite Group of Six",
    "domain": "sports",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Sat, 11 Oct 2025 07:39:54 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "CBS Sports"
    ],
    "domains": [
      "aljazeera.com",
      "cbssports.com"
    ],
    "snippets": [
      "Wilson becomes the first player to win the regular MVP, Defensive Player of the Year and Finals MVP in the same season.",
      "Wilson is the sixth player to win multiple Finals MVPs",
      "The Aces are one win away from their third title in four seasons"
    ],
    "image_url": "",
    "titles": [
      "MVP A’ja Wilson scores 31 as Aces beat Mercury for third WNBA title",
      "2025 WNBA Finals: A'ja Wilson named Finals MVP after leading Aces to third title in four years",
      "WNBA playoff bracket: Aces complete sweep of Mercury for third title in four years"
    ],
    "url": "https://www.aljazeera.com/sports/2025/10/11/mvp-aja-wilson-scores-31-as-aces-beat-mercury-for-third-wnba-title?traffic_source=rss",
    "alternate_urls": [
      "https://www.cbssports.com/wnba/news/2025-wnba-finals-aja-wilson-named-finals-mvp-after-leading-aces-to-third-title-in-four-years/",
      "https://www.cbssports.com/wnba/news/wnba-playoff-bracket-aces-complete-sweep-of-mercury-for-third-title-in-four-years/"
    ],
    "link": "https://www.aljazeera.com/sports/2025/10/11/mvp-aja-wilson-scores-31-as-aces-beat-mercury-for-third-wnba-title?traffic_source=rss",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.988,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.653,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A’ja Wilson has won her second Finals MVP, making her the sixth player in history to achieve this feat. This accomplishment underscores the Las Vegas Aces' exceptional performance.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Northern Ireland's Bradley Suspended, Misses Germany Match",
    "domain": "sports",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Sat, 11 Oct 2025 07:25:11 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Yahoo Sports"
    ],
    "domains": [
      "bbc.com"
    ],
    "snippets": [
      "Northern Ireland have a gap in defence to fill against Germany on Monday after Liverpool's Conor Bradley was booked against Slovakia, earning him a suspension."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/7638/live/34570b90-a636-11f0-863f-1f567a5b9247.jpg",
    "titles": [
      "'Terrific' Bradley will be big loss in Germany tie"
    ],
    "url": "https://www.bbc.com/sport/football/articles/cd9y1132x79o?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://www.bbc.com/sport/football/articles/cd9y1132x79o?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bsport%5D-%5Bbizdev%5D-%5Bisapi%5D"
    ],
    "link": "https://www.bbc.com/sport/football/articles/cd9y1132x79o?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.962,
      "consensus": 0.571,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.642,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Northern Ireland will face Germany without defender Conor Bradley, who received a booking against Slovakia, leading to a suspension. This leaves a gap in Northern Ireland's defense for the upcoming match on Monday.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Phoenix Mercury Coach Ejected in Game 4 of WNBA Finals",
    "domain": "sports",
    "source_domain": "cbssports.com",
    "location": "national",
    "published": "Sat, 11 Oct 2025 04:47:58 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sportsnet"
    ],
    "domains": [
      "cbssports.com",
      "sportsnet.ca"
    ],
    "snippets": [
      "The ejection happened after he got in the face of a referee and was hit with a double tech",
      "Phoenix Mercury coach Nate Tibbetts was ejected from Game 4 of the WNBA Finals after receiving two quick technical fouls in the third quarter against the Las Vegas Aces on Friday night."
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/10/11/95e941d1-4f61-4ce3-97d7-1623a0e4e719/untitled-design-50.png",
    "titles": [
      "2025 WNBA Finals: Mercury head coach Nate Tibbetts calls ejection 'one of the weakest double technicals ever'",
      "Mercury coach Nate Tibbetts ejected from Game 4 of WNBA Finals"
    ],
    "url": "https://www.cbssports.com/wnba/news/2025-wnba-finals-phoenix-mercury-head-coach-nate-tibbetts-ejected-in-third-quarter-of-must-win-game-4/",
    "alternate_urls": [],
    "link": "https://www.cbssports.com/wnba/news/2025-wnba-finals-phoenix-mercury-head-coach-nate-tibbetts-ejected-in-third-quarter-of-must-win-game-4/",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.93,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.641,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Phoenix Mercury coach Nate Tibbetts was ejected from Game 4 of the WNBA Finals against the Las Vegas Aces after receiving two technical fouls in quick succession for confronting a referee in the third quarter.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Ontario Offers $50K Reward in Robbie Thomson Disappearance Case",
    "domain": "general",
    "source_domain": "ottawacitizen.com",
    "location": "local",
    "published": "Fri, 10 Oct 2025 22:35:51 +0000",
    "source": "Ottawa Citizen",
    "sources": [
      "Ottawa Citizen",
      "CityNews"
    ],
    "domains": [
      "ottawacitizen.com",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "Robbie Thomson was reported missing on Oct. 19, 2023.",
      "The Government of Ontario is now offering a $50,000 reward for information leading to a conviction in the case of a missing Smith Falls man. Robbie Thomson, now 36, was reported missing on Oct. 19, 2023 but is believed to have gone missing sometime between Oct. 12 and Oct. 18. The OPP and Smith Fall"
    ],
    "image_url": "",
    "titles": [
      "$50,000 reward offered in disappearance of Smiths Falls man",
      "Ontario offering $50K reward two years after disappearance of Smith Falls man"
    ],
    "url": "https://ottawacitizen.com/news/50000-reward-offered-in-case-of-smiths-falls-man-missing-for-two-years",
    "alternate_urls": [
      "https://ottawa.citynews.ca/2025/10/10/ontario-offering-50k-reward-two-years-after-disappearance-of-smith-falls-man/"
    ],
    "link": "https://ottawacitizen.com/news/50000-reward-offered-in-case-of-smiths-falls-man-missing-for-two-years",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.818,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.619,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Government of Ontario is offering a $50,000 reward for information leading to a conviction in the disappearance of Robbie Thomson, 36, from Smith Falls. Reported missing on Oct. 19, 2023, it's believed he went missing between Oct. 12 and Oct. 18. The Ontario Provincial Police are investigating.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Acting President Jerí Vows to Tackle Crime After Boluarte's Ouster",
    "domain": "general",
    "source_domain": "washingtonpost.com",
    "location": "global",
    "published": "Fri, 10 Oct 2025 18:56:38 +0000",
    "source": "Washington Post",
    "sources": [
      "Washington Post",
      "New York Times"
    ],
    "domains": [
      "washingtonpost.com",
      "nytimes.com"
    ],
    "snippets": [
      "After Dina Boluarte’s ouster, acting president José Jerí promised a war on crime.",
      "Growing outrage over crime and political scandals eroded support for President Dina Boluarte, the country’s most unpopular leader in recent history."
    ],
    "image_url": "",
    "titles": [
      "Peru’s president removed amid rising crime, corruption allegations",
      "Peru Ousts President Amid Crime Surge"
    ],
    "url": "https://www.washingtonpost.com/world/2025/10/10/peru-president-dina-boluarte-impeached-jose-jeri/",
    "alternate_urls": [
      "https://www.nytimes.com/2025/10/10/world/americas/peru-president-boluarte-impeached.html"
    ],
    "link": "https://www.washingtonpost.com/world/2025/10/10/peru-president-dina-boluarte-impeached-jose-jeri/",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.758,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.617,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Following the removal of President Dina Boluarte, who faced declining support due to rising crime rates and political scandals, acting President José Jerí has pledged to combat crime aggressively. Boluarte had become the most unpopular leader in the country's recent history before her ouster.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Explosion at Tennessee Plant Leaves 18 Missing, Feared Dead",
    "domain": "general",
    "source_domain": "dw.com",
    "location": "global",
    "published": "2025-10-10T19:43:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "CityNews"
    ],
    "domains": [
      "dw.com",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "The Humphreys County sheriff confirmed fatalities but gave no tolls, suggesting those missing might already be dead.",
      "McEWEN, Tenn. (AP) — A blast leveled an explosives plant Friday in rural Tennessee, leaving behind a mass of twisted metal, burned-out shells of cars and at least 18 people missing and feared dead, authorities said. “There’s nothing to describe. It’s gone,” Humphreys County Sheriff Chris Davis said"
    ],
    "image_url": "",
    "titles": [
      "Tennessee: 18 missing after deadly explosives plant blast",
      "Blast at a Tennessee explosives plant leaves 18 missing and feared dead, sheriff says"
    ],
    "url": "https://www.dw.com/en/tennessee-18-missing-after-deadly-explosives-plant-blast/a-74314679?maca=en-rss-en-top-1022-rdf",
    "alternate_urls": [
      "https://ottawa.citynews.ca/2025/10/10/blast-at-a-tennessee-explosives-plant-leaves-multiple-people-dead-and-missing-sheriff-says/"
    ],
    "link": "https://www.dw.com/en/tennessee-18-missing-after-deadly-explosives-plant-blast/a-74314679?maca=en-rss-en-top-1022-rdf",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.77,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.609,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "An explosion at an explosives plant in McEwen, Tennessee, resulted in at least 18 people missing and feared dead, according to authorities. The blast destroyed the facility, leaving only twisted metal and burned vehicles. Humphreys County Sheriff Chris Davis confirmed there were fatalities but did not specify a number, suggesting the missing may be deceased.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Confirms Israel's Commitment to Gaza Ceasefire Amid Press Access Demands",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Fri, 10 Oct 2025 14:55:35 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "The Guardian"
    ],
    "domains": [
      "news.google.com",
      "theguardian.com"
    ],
    "snippets": [
      "Trump promised not to let Israel break Gaza ceasefire to get deal Axios",
      "Foreign Press Association joins long list of global media agencies demanding press freedom in devastated territory International journalists in Israel have called for reporters to be granted immediate access to Gaza after the rapidly negotiated ceasefire came into effect, joining a long list of inte"
    ],
    "image_url": "",
    "titles": [
      "Trump promised not to let Israel break Gaza ceasefire to get deal - Axios",
      "International journalists urge Israel to allow reporters into Gaza after ceasefire deal"
    ],
    "url": "https://news.google.com/rss/articles/CBMif0FVX3lxTE9qZ196bkhqYjdhbkpPeU93WVpOOG0xeHNQeGQyVWlidk83WUxRRndKNGZObWk2YTdVTFBnV3pfbDBNWEliNWQwOFpmUEdRcFZYUnV3RllGdVZBUDRaNmFRTkozcFNMTmVPY19sQU05WE45YVRYbjNCVjZMNVlPSVE?oc=5",
    "alternate_urls": [
      "https://www.theguardian.com/media/2025/oct/11/international-journalists-gaza-israel-press-freedom"
    ],
    "link": "https://news.google.com/rss/articles/CBMif0FVX3lxTE9qZ196bkhqYjdhbkpPeU93WVpOOG0xeHNQeGQyVWlidk83WUxRRndKNGZObWk2YTdVTFBnV3pfbDBNWEliNWQwOFpmUEdRcFZYUnV3RllGdVZBUDRaNmFRTkozcFNMTmVPY19sQU05WE45YVRYbjNCVjZMNVlPSVE?oc=5",
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.682,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.605,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Donald Trump assured that Israel would adhere to the Gaza ceasefire to secure the agreement. Following the ceasefire, international journalists in Israel, backed by the Foreign Press Association and other global media agencies, demanded immediate press access to Gaza, emphasizing the need for press freedom in the affected area.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Boring Co. Violates Environmental Laws 800 Times, Including Unauthorized Digging",
    "domain": "technology",
    "source_domain": "techcrunch.com",
    "location": "global",
    "published": "Fri, 10 Oct 2025 15:44:55 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch",
      "Ars Technica"
    ],
    "domains": [
      "techcrunch.com",
      "arstechnica.com"
    ],
    "snippets": [
      "The Boring Co. violated state environmental regulations nearly 800 times, many of which occurred after signing an agreement saying it would comply.",
      "Violations include digging without permits and dumping wastewater into storm drains."
    ],
    "image_url": "",
    "titles": [
      "Musk’s Boring Co. violated environmental regulations nearly 800 times, Nevada alleges",
      "Boring Company cited for almost 800 environmental violations in Las Vegas"
    ],
    "url": "https://techcrunch.com/2025/10/10/musks-boring-co-violated-environmental-regulations-nearly-800-times-nevada-alleges/",
    "alternate_urls": [
      "https://arstechnica.com/tech-policy/2025/10/boring-company-cited-for-almost-800-environmental-violations-in-las-vegas/"
    ],
    "link": "https://techcrunch.com/2025/10/10/musks-boring-co-violated-environmental-regulations-nearly-800-times-nevada-alleges/",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.709,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.597,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Boring Co. breached state environmental laws almost 800 times, including unauthorized digging and disposing of wastewater in storm drains. These infractions persisted even after the company agreed to follow regulations.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]