[
  {
    "title": "South Korea Protests ICE Raid at Hyundai Plant, 475 Arrested",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Fri, 05 Sep 2025 10:58:37 -0400",
    "source": "NPR",
    "sources": [
      "BBC",
      "Al Jazeera",
      "NPR",
      "Forbes"
    ],
    "domains": [
      "www.npr.org",
      "www.bbc.com",
      "www.forbes.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "\"The business activities of our investors and the rights of our nationals must not be unjustly infringed,\" a foreign ministry spokesman said after about 300 South Koreans were detained.",
      "Many of the 475 arrested were from South Korea, leading the country to call the raid an unjust infringement of people's rights.",
      "Seoul demands protection for nationals, investors as Trump&#039;s immigration crackdown sees hundreds detained in ICE raid.",
      "U.S. immigration authorities detained hundreds a Georgia-based Hyundai plant, a majority of which were South Korean nationals."
    ],
    "image_url": "",
    "titles": [
      "Hundreds of South Koreans are among 475 detained in a Georgia immigration raid",
      "South Koreans detained in immigration raid at Hyundai electric vehicle site in US",
      "South Korea objects as US immigration raids Hyundai plant",
      "Homeland Security Detained 475 People In Immigration Raid At Hyundai Plant—As South Korea Raises Concern"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.975,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.816,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In a recent ICE raid at a Georgia-based Hyundai plant, approximately 475 individuals were arrested, with a significant number being South Korean nationals. This action prompted South Korea to demand protection for its nationals and investors, labeling the raid as an unjust infringement of rights. The foreign ministry emphasized the importance of not unjustly infringing on the business activities and rights of their nationals.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Eagles' Jalen Carter Ejected for Spitting, Eagles Beat Cowboys 24-20",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Fri, 5 Sep 2025 11:23:44 EST",
    "source": "ESPN",
    "sources": [
      "Sky Sports",
      "Sports Illustrated",
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.espn.com",
      "news.google.com",
      "www.sportsnet.ca",
      "www.skysports.com"
    ],
    "snippets": [
      "Eagles defensive tackle Jalen Carter was ejected from Thursday night's season-opening win before the first play from scrimmage for spitting on Cowboys quarterback Dak Prescott.",
      "<a href=\"https://news.google.com/rss/articles/CBMikwFBVV95cUxNWXBtWGdXVXh2ZF9SWHZPUTNpSUdoX3BmOXFDeG1kUDc5RUdpNWh3Y2gwUURaX2c2YVlnTlg0SHBsR2xNYTlueFpDaWVHdzV4aXlqcWNiWU9DXzAtNk9zcUtsdEc5Nkh2aEtsVUkweWQ5aUdQaFN3T1lJbXgwV0V5ZTlZUV9rZ1VROEpqdnlzUnRXcUk?oc=5\" target=\"_blank\">Jalen Carter Getting Ejected",
      "<a href=\"https://news.google.com/rss/articles/CBMigwFBVV95cUxPZzZoNUhReDhRVjRwQnJXemcwRlk1djVIWGYwTzZ0OVhUcWQ5LS1RTW9sSEpKUlAyYnVLcE9hQVdoTC1Yc2EwUktYNGhnUzVsLUFrZWF6ZHByZVdRc0c5RVM5RDRwMkxkdTZxTHlVV1RyY0RxejVqZEVFMWo5eDFGY2xfWQ?oc=5\" target=\"_blank\">Ejecting Jalen Carter Part of the NFL’s Plan to C",
      "<p>Watch as Philadelphia Eagles&#8217; Jalen Carter is ejected before taking his first defensive snap of the season, after spitting on Dallas Cowboys quarterback Dak Prescott during an injury timeout.</p>",
      "<p>Philadelphia Eagles defensive tackle Jalen Carter was ejected moments after a pregame Super Bowl championship celebration for spitting on Dallas quarterback Dak Prescott.</p>",
      "Jalen Carter apologised to his teammates while Dak Prescott pleaded his innocence after the Philadelphia Eagles star was ejected for spitting on the Dallas Cowboys quarterback in Thursday night's NFL season opener.",
      "Philadelphia Eagles defensive tackle Jalen Carter was ejected from the game before the first play against the Dallas Cowboys after spitting on Dak Prescott.",
      "Jalen Hurts rushed for two touchdowns while Jalen Carter was ejected for spitting at Dak Prescott as the Super Bowl champion Philadelphia Eagles&#160;opened the 2025 NFL season with a 24-20 victory over the Dallas Cowboys."
    ],
    "image_url": "",
    "titles": [
      "Carter sorry for spitting on Prescott: 'A mistake'",
      "Jalen Carter Getting Ejected for Spitting on Dak Prescott Sent NFL Fans in a Tizzy - Sports Illustrated",
      "Ejecting Jalen Carter Part of the NFL’s Plan to Clean Up a Filthy Game - Sports Illustrated",
      "Eagles’ Carter ejected on opening drive after spitting on Prescott",
      "Eagles’ Carter apologizes following ejection for spitting on Cowboys’ Prescott",
      "Prescott denies spitting first as Carter apologises after dramatic NFL opener",
      "Eagles' Carter ejected for spitting on first play of NFL season",
      "Carter ejected for spitting after six seconds as Eagles beat Cowboys in NFL opener"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.984,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.811,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Philadelphia Eagles defensive tackle Jalen Carter was ejected before the first play of the NFL season opener for spitting on Dallas Cowboys quarterback Dak Prescott. Despite the incident and a 65-minute weather delay, the Eagles defeated the Cowboys 24-20.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Angela Rayner Resigns After Ethics Breach, Shaking Starmer's Leadership",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 05 Sep 2025 15:51:53 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Financial Times",
      "The Guardian",
      "New York Times"
    ],
    "domains": [
      "www.bbc.com",
      "www.theguardian.com",
      "www.ft.com",
      "www.bbc.co.uk",
      "www.nytimes.com"
    ],
    "snippets": [
      "Her departure comes after the PM's ethics adviser concludes that she breached ministerial rules.",
      "The Prime Minister refuses to say if he’ll sack his deputy, if she broke the rules.",
      "Move plunges Keir Starmer’s administration into turmoil",
      "In a blow to Prime Minister Keir Starmer, Ms. Rayner said she would step down after an ethics adviser found she had breached a code of conduct for government ministers.",
      "<p>Rayner’s departure is deeply damaging to prime minister who had initially stood by her</p><ul><li><p><a href=\"https://www.theguardian.com/politics/live/2025/sep/05/angela-rayner-stamp-duty-labour-starmer-reform-nigel-farage-uk-politics-live-news-updates\">UK politics live – latest updates</a></p><"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/82ab/live/8a7bc150-8a48-11f0-94f4-77b666520245.jpg",
    "titles": [
      "Angela Rayner resigns after underpaying tax on Hove flat",
      "Angela Rayner: The Tax Tangle Continues!",
      "Angela Rayner resigns from UK government over tax affairs scandal",
      "Angela Rayner, UK Deputy Prime Minister, Resigns After Underpaying Tax",
      "Angela Rayner resigns over stamp duty row"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.973,
      "consensus": 0.928,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.799,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Angela Rayner resigned following a breach of ministerial rules, as determined by the Prime Minister's ethics adviser. This decision comes amid Keir Starmer's refusal to discuss her potential dismissal and has led to turmoil within his administration. Rayner's resignation is seen as a significant setback for Starmer, who had previously supported her.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Israeli Forces Seize 40% of Gaza City, Escalate Crisis with Tower Demolition",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 05 Sep 2025 14:25:09 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Axios",
      "Al Jazeera",
      "New York Times"
    ],
    "domains": [
      "news.google.com",
      "www.bbc.com",
      "www.nytimes.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "The images come as the Israeli military says it has established control over 40% of Gaza City.",
      "The &#039;gates of hell are opening&#039; in Gaza, says Israeli defence minister as attacks cause panic and fear among civilians.",
      "Israeli forces attacked and destroyed the 12-storey Mushtaha tower in Gaza City on Friday.",
      "<a href=\"https://news.google.com/rss/articles/CBMifkFVX3lxTE15bUQwZHI3YmlpNTZ3UXpXQ3JIR2dBUVpEbWlIVkx2Q2lvZHdKYzV1S1NFSk9BUVhkU0dMM0FzTVVaSVlfQ0l6Q3NIRDUybTZIa2x1UHBTVlRXRS12VnhfcXZjMU5lRlN3NGZUaWxZRW4wQXBXa3YxTE0wZzRHQQ?oc=5\" target=\"_blank\">Israel bombs high-rise buildings in Gaza City ahead of ma",
      "The Israeli military destroyed a landmark building after saying it had taken control of almost half of the city, where hundreds of thousands of civilians are sheltering amid a worsening humanitarian crisis."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/7a08/live/1e4b6310-8a4c-11f0-b391-6936825093bd.jpg",
    "titles": [
      "Israel destroys dozens of buildings in Gaza City as new offensive intensifies",
      "Israel bombs high-rise towers as brutal Gaza City assault intensifies",
      "Israel destroys one of Gaza City’s biggest buildings",
      "Israel bombs high-rise buildings in Gaza City ahead of massive offensive - Axios",
      "Israel Steps Up Attacks on Gaza City Ahead of a Planned Wider Offensive"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.944,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.785,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Israeli military has taken control of approximately 40% of Gaza City, escalating tensions and causing widespread panic among civilians. The Israeli Defence Minister described the situation as \"the gates of hell are opening\" in Gaza. In a significant move, Israeli forces demolished the 12-storey Mushtaha tower in Gaza City. This action is part of a broader offensive that has seen the destruction of key infrastructure, leading to a severe humanitarian crisis for the city's residents.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "16 Killed in Lisbon Funicular Derailment; Mechanical Fault Suspected",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 05 Sep 2025 11:03:40 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian",
      "CityNews",
      "New York Times"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com",
      "ottawa.citynews.ca",
      "www.nytimes.com"
    ],
    "snippets": [
      "Authorities have confirmed three Brits are among 16 people who were killed in Wednesday's accident.",
      "<p>Portuguese investigators find no evidence of sabotage, with mechanical or maintenance issues among possible causes</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/sep/04/someone-needs-to-answer-for-what-happened-lisbon-reacts-to-streetcar-crash-that-killed-16\">‘Someone needs to answ",
      "Images of recovery efforts in the accident, which killed 16 people on Wednesday, appeared to show damage to a cable connecting the funicular’s two cars.",
      "Police say two Canadians are among the 16 dead in Lisbon after a funicular derailed in the Portuguese capital on Wednesday, The Associated Press reports. The dead also included five Portuguese nationals, three British citizens, two South Koreans, one American, one French, one Swiss and one Ukrainian"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/5855/live/ae84b1f0-8a3f-11f0-a107-b1e54fc8eabd.jpg",
    "titles": [
      "Three British nationals among 16 killed in Lisbon crash",
      "Three Britons among 16 people killed in Lisbon funicular crash, police confirm",
      "Questions Focus on Cable in Lisbon Funicular Crash",
      "Portuguese police confirm two Canadians dead in Lisbon funicular crash"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.88,
      "consensus": 0.908,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.782,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Sixteen people, including three Brits, two Canadians, five Portuguese, two South Koreans, one American, one French, one Swiss, and one Ukrainian, were killed in a funicular derailment in Lisbon. Portuguese investigators have ruled out sabotage, focusing on mechanical or maintenance issues as the likely cause. Recovery efforts have highlighted damage to a cable connecting the funicular's cars.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump to Sign Order Renaming Defense Department to Department of War",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 05 Sep 2025 08:59:03 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Axios",
      "Deutsche Welle",
      "Forbes"
    ],
    "domains": [
      "news.google.com",
      "www.bbc.com",
      "www.forbes.com",
      "www.dw.com"
    ],
    "snippets": [
      "The US president has sought to refocus the department on \"warfighting\" and a \"warrior ethos\".",
      "US President Donald Trump is set to sign an executive order to change the name of the Department of Defense to the \"Department of War.\" This would revive a name that was abandoned over seven decades ago.",
      "<a href=\"https://news.google.com/rss/articles/CBMid0FVX3lxTE5ENDJYTUxaT3Y3VXNfdWxGXzM0VlF0dnlubDdzbGtXTi1VWlVSdmtKYl9TV3o3WGpXc0JUOXozV2c4VWFZbDhYY3pUeHYyYW01Z3RzeUVMNk04MkJ3Ni1obkhGOWtCS3ZCekpZVEdwd0U3XzZTQVIw?oc=5\" target=\"_blank\">Trump seeks to rename Department of Defense to Department of War</a",
      "The White House will install the Department of War as a “secondary name” to get around Trump’s inability to actually rename the agency."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/4328/live/9f063d00-8a23-11f0-84c8-99de564f0440.jpg",
    "titles": [
      "Trump seeks to rebrand Department of Defense as Department of War",
      "US: Trump to relabel Pentagon as 'Department of War'",
      "Trump seeks to rename Department of Defense to Department of War - Axios",
      "Trump Will Rename Defense Department To ‘Department Of War’ Today—Is It Legal? Here’s What To Know."
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.843,
      "consensus": 0.908,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.775,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "President Trump plans to sign an executive order renaming the Department of Defense to the Department of War, emphasizing a focus on \"warfighting\" and a \"warrior ethos.\" The change, which can be used in official correspondence and ceremonial contexts, requires Congressional approval for full implementation.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Russia Threatens Western Troops in Ukraine as \"Legitimate Targets\"",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 05 Sep 2025 09:32:21 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian",
      "Deutsche Welle",
      "New York Times"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com",
      "www.dw.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "The Russian leader's refusal comes after 26 countries pledged to deploy troops to Ukraine in the event of a ceasefire.",
      "The Kremlin views any Western military deployment in Ukraine as a threat and would regard them as \"legitimate targets for destruction.\" Meanwhile, Ukraine has struck a Russian oil refinery overnight. DW has more.",
      "<p>Russian president’s threat follows French proposal for post-war support for Kyiv that includes presence of Nato countries’ forces</p><p>Vladimir Putin has said any western troops placed in Ukraine would be “legitimate targets” for Russian strikes, upping the stakes as Kyiv’s allies scramble to co",
      "<p>Macron says 26 nations have offered security guarantees for Ukraine as Zelenskyy meets Slovakia’s Fico amid tension over Russian energy supplies</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/sep/04/european-leaders-pressure-trump-to-reveal-how-much-support-us-will-give-ukraine\">Ma",
      "The Russian leader made the threat a day after European leaders said they were willing to deploy forces on the ground to secure an agreement to end the war."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/f69c/live/b4477700-8a29-11f0-b917-03bcebef22ec.jpg",
    "titles": [
      "Putin rejects Western security in Ukraine, warning troops would be target",
      "Putin: Western troops in Ukraine are 'legitimate targets'",
      "Western troops in Ukraine would be ‘legitimate targets’, Putin says",
      "Putin says western troops in Ukraine would be ‘legitimate targets’ as European countries pledge security support – Europe live",
      "Western Troops in Ukraine Before a Peace Deal Would Be ‘Targets’, Putin Says"
    ],
    "score_components": {
      "magnitude": 0.932,
      "recency": 0.853,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.774,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Russian president has declared that any Western troops deployed in Ukraine, following a proposal involving 26 nations offering security guarantees to Kyiv, would be considered \"legitimate targets\" by Russia. This statement escalates tensions as it comes after European leaders expressed willingness to send forces to Ukraine to help secure a ceasefire. Concurrently, Ukraine has conducted an attack on a Russian oil refinery.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "U.S. Job Growth Slows in August, Unemployment Rises to 4.3%",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Fri, 05 Sep 2025 08:51:43 -0400",
    "source": "NPR",
    "sources": [
      "Axios",
      "Financial Times",
      "NPR"
    ],
    "domains": [
      "news.google.com",
      "www.npr.org",
      "www.ft.com"
    ],
    "snippets": [
      "The U.S. job market showed more signs of weakness Friday, as the Labor Department reported just 22,000 jobs added in August. Revised figures show the economy lost jobs in June, and the unemployment rate inched up to 4.3%.",
      "<a href=\"https://news.google.com/rss/articles/CBMic0FVX3lxTE1tb3RGZkFOVTFlTlVwTVM3U09GT1RiRk9oWEhGSjFSdERrRGpWTDk0VDc1aFhqY3BvQ2RnVDVXLVZFSE9OLU9oczVRUDZlN01KdGdUQzZjZi1XN3NfbV9sTmdMcGZSNlpSOExMQ3lWenJQVHM?oc=5\" target=\"_blank\">U.S. economy adds only 22,000 jobs as labor market stalls</a>&nbsp;&nbsp",
      "Lower than expected figure opens door to aggressive Federal Reserve rate cuts"
    ],
    "image_url": "",
    "titles": [
      "The U.S. added only 22,000 jobs last month, showing cracks in the labor market",
      "U.S. economy adds only 22,000 jobs as labor market stalls - Axios",
      "US adds just 22,000 jobs in August as labour market sputters"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.933,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.758,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In August, the U.S. job market showed signs of weakening, with only 22,000 jobs added, below expectations. The Labor Department also revised June's figures, indicating job losses, and reported the unemployment rate rose to 4.3%. This development may lead to more aggressive Federal Reserve rate cuts.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Anisimova to Face Sabalenka in US Open Final After Defeating Osaka",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Fri, 5 Sep 2025 11:23:44 EST",
    "source": "ESPN",
    "sources": [
      "Sky Sports",
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.espn.com",
      "www.sportsnet.ca",
      "www.skysports.com"
    ],
    "snippets": [
      "Defending champion Aryna Sabalenka will face Amanda Anisimova in the U.S. Open women's final.",
      "Amanda Anisimova made it through to consecutive Grand Slam finals and a shot at ultimate redemption with a showdown against defending US Open champion Aryna Sabalenka.",
      "<p>Defending champion Aryna Sabalenka was simply too good for Jessica Pegula yet again, winning their U.S. Open semifinal 4-6, 6-3, 6-4 on Thursday night in a rematch of last year&#8217;s final.</p>"
    ],
    "image_url": "",
    "titles": [
      "Anisimova wins, sets up Open final vs. Sabalenka",
      "Anisimova sets up US Open final against defending champion Sabalenka",
      "Defending champion Aryna Sabalenka to face Amada Anisimova in US Open final"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.984,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.758,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Amanda Anisimova defeated Naomi Osaka in a tense, three-set match to reach the U.S. Open women's final, where she will face defending champion Aryna Sabalenka. Sabalenka secured her spot in the final by beating Jessica Pegula. Both Anisimova and Sabalenka have shown strong performances after taking mental health breaks, with Anisimova aiming for her first US Open title against the reigning champion.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Tyson vs. Mayweather Exhibition Match Set for Early 2026",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Fri, 5 Sep 2025 11:23:45 EST",
    "source": "ESPN",
    "sources": [
      "Sky Sports",
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.espn.com",
      "www.sportsnet.ca",
      "www.skysports.com"
    ],
    "snippets": [
      "Boxing legends Mike Tyson and Floyd Mayweather Jr. agreed to compete in an exhibition boxing match next spring, with details to be determined at a later date.",
      "Former world champions Mike Tyson and Floyd Mayweather intend to meet in the ring in 2026.",
      "<p>Mike Tyson and Floyd Mayweather Jr. are set to meet in an early 2026 matchup of boxing Hall of Famers.</p>"
    ],
    "image_url": "",
    "titles": [
      "Tyson, Mayweather Jr. to compete in exhibition",
      "Tyson and Mayweather announce exhibition",
      "Mike Tyson, Floyd Mayweather Jr. set to meet in exhibition boxing match in 2026"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.984,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.758,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Mike Tyson and Floyd Mayweather Jr. have agreed to fight in an exhibition match scheduled for early 2026. Details regarding the date and location of the match have not yet been announced.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "NFL Week 1: Saints Debut Gold Uniforms, Chiefs-Chargers Predictions Released",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Fri, 5 Sep 2025 07:45:59 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN",
      "Yahoo Sports"
    ],
    "domains": [
      "www.espn.com",
      "chiefswire.usatoday.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Here's a look at the Week 1 uniforms for all 32 NFL teams, led by the Saints debuting their gold uniforms.",
      "The SportsLine Projection Model has locked in its top anytime touchdown picks for Chiefs vs. Chargers in Week 1",
      "Check out our predictions for the Kansas City Chiefs' Week 1 matchup against the Los Angeles Chargers in São Paulo, Brazil."
    ],
    "image_url": "",
    "titles": [
      "Chargers powder blue, Chiefs' traditional look in Brazil top NFL Week 1 threads",
      "Chargers vs. Chiefs anytime TD props, odds, predictions: Back Ladd McConkey to score in Brazil for NFL Week 1",
      "Predictions for Kansas City Chiefs' Week 1 matchup vs. Los Angeles Chargers in Brazil"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.912,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.751,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The NFL Week 1 features all 32 teams showcasing their uniforms, with the Saints debuting new gold uniforms. The SportsLine Projection Model has released its top touchdown picks for the Chiefs vs. Chargers game. Additionally, predictions are available for the Chiefs' Week 1 game against the Chargers, which will take place in São Paulo, Brazil.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Tesla Unveils $1T Potential Compensation Plan for Musk, Targets $8.5T Valuation",
    "domain": "business",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Fri, 05 Sep 2025 14:15:22 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "TechCrunch",
      "Business Insider"
    ],
    "domains": [
      "techcrunch.com",
      "www.theguardian.com",
      "www.businessinsider.com"
    ],
    "snippets": [
      "<p>CEO will have to increase the value of his electric car company from just over $1tn to $8.5tn over 10 years</p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/sep/05/ons-crisis-retail-sales-error-uk-house-prices-record-high-us-jobs-report-business-live-news-updates\">Business li",
      "The pay package is unprecedented in both its size and the scale at which Tesla would have to grow for Elon Musk to achieve it.",
      "Tesla has proposed a new 10-year compensation plan for CEO Elon Musk that could be worth as much as $1 trillion even as the EV maker's car business stumbles and it sets its sights on humanoid robotics and AI."
    ],
    "image_url": "https://i.guim.co.uk/img/media/54bfb717b97817479c873e1ecc2090b04ba5c55f/400_0_2917_2333/master/2917.jpg?width=140&quality=85&auto=format&fit=max&s=45e168d1cc1e58092f6732a6cef4d0bf",
    "titles": [
      "Tesla offers Elon Musk a trillion-dollar pay package",
      "5 major takeaways from Tesla's $1 trillion pay package proposal for Elon Musk",
      "Tesla proposes new pay package for Elon Musk worth up to $1T"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.941,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.735,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Tesla has introduced a new 10-year compensation plan for CEO Elon Musk, potentially worth up to $1 trillion. This plan requires Musk to increase Tesla's value from just over $1tn to $8.5tn. The proposal is notable for its ambitious growth target and the significant potential payout, amidst Tesla's focus on expanding into humanoid robotics and AI, despite challenges in its electric vehicle business.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Dolphins Season Predictions: Final Record, MVP, Best Rookie Picks",
    "domain": "sports",
    "source_domain": "dolphinswire.usatoday.com",
    "location": "national",
    "published": "Fri, 05 Sep 2025 15:38:16 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Sports Illustrated",
      "Bleacher Report",
      "Yahoo Sports"
    ],
    "domains": [
      "news.google.com",
      "dolphinswire.usatoday.com"
    ],
    "snippets": [
      "What will be the Dolphins' record? Who will be their MVP? Their best rookie? Our staff made their picks.",
      "<a href=\"https://news.google.com/rss/articles/CBMilwFBVV95cUxNUFJjQXRiamVSRl9BWEVLdTJ0OTZhNnZnMVlXUmNCYU9TZFBDZFR2ZUZYcGlPN25HQzJQOVhMTzg4bkVxSWZwdXByVHk0LUl5NXdGYy1MTWlQVWJyYVJBSVlWUDZsOF9JNHAybTI5bjJCeEdTM3hGYVpDVm1ZZXpqQXJ2VjhLVHRiemVOLWhxU29Mc2xiLUxn?oc=5\" target=\"_blank\">MLB Predictions for Str",
      "<a href=\"https://news.google.com/rss/articles/CBMikwFBVV95cUxOQktIV0J3NDRjUzJEeHRXdkhMeVkzNVM2bkRQamJHSF96anJLX1daQTY0Z01CYURkQ2ZWbXo1U0FydWlSUjV0b1FqM2NUcmFvNnVWZkROamFWZVlZOEczZHhhX201TDFGaFN5TEM3V2JndHRvVmpTaE1sWDlaUUhfd0FjZ3N0RVVqZ05JelI2NVhVb2M?oc=5\" target=\"_blank\">Bold Predictions for Atlanta"
    ],
    "image_url": "",
    "titles": [
      "Dolphins Wire staff predictions for the 2025 season",
      "MLB Predictions for Stretch Run of 2025 Regular Season - Bleacher Report",
      "Bold Predictions for Atlanta Falcons' 2025 Season - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.989,
      "consensus": 0.769,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.73,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The article discusses predictions for the Dolphins' upcoming season, including their final record, MVP, and best rookie, based on picks made by the staff. However, specific predictions or outcomes were not provided in the summary content.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "US Unemployment Rises to 4.3%, Job Growth Slows Amid Trade War",
    "domain": "business",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Fri, 05 Sep 2025 14:12:28 +0000",
    "source": "Global News",
    "sources": [
      "Business Insider",
      "Global News"
    ],
    "domains": [
      "globalnews.ca",
      "www.businessinsider.com"
    ],
    "snippets": [
      "The job market in the United States showed another sign of cooling amid the ongoing trade war as unemployment ticked up in August to 4.3 per cent.",
      "The US added far fewer jobs in August than the expected gain of 75,000, while unemployment increased to 4.3%."
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2024/04/2024040500040-660f77a22ec093b7736e6113jpeg_d09c13.jpg?quality=65&strip=all",
    "titles": [
      "The U.S. job market stalled in August with unemployment ticking up to 4.3%",
      "Job growth badly missed expectations in August, and unemployment ticked up"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.96,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 1.0
    },
    "score": 0.707,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In August, the US job market displayed signs of slowing, with unemployment rising to 4.3% and job additions falling below the expected 75,000. This development occurs amidst an ongoing trade war.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Elon Musk Eyes $1 Trillion Payout if Tesla Grows by $7.5 Trillion in 10 Years",
    "domain": "business",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Fri, 05 Sep 2025 14:47:34 +0000",
    "source": "Global News",
    "sources": [
      "MarketWatch",
      "Global News"
    ],
    "domains": [
      "www.marketwatch.com",
      "globalnews.ca"
    ],
    "snippets": [
      "Elon Musk, already the world's richest person, is in line for a payout of US$1 trillion if his electric car company meets a series of targets over the next 10 years.",
      "Tesla proposes a $1 trillion pay package for Elon Musk, if can stay focused on adding $7.5 trillion to the company’s value."
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/elon-musk-trillionare.jpg?quality=65&strip=all",
    "titles": [
      "Elon Musk may become the world’s 1st trillionaire",
      "Here’s what Elon Musk must do to become a Tesla trillionaire"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.971,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.699,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Elon Musk could receive a $1 trillion payout from Tesla if the company's value increases by $7.5 trillion over the next 10 years. This proposed pay package is contingent on Musk meeting specific targets aimed at significantly boosting Tesla's market value.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Caitlin Clark Out for WNBA Season Due to Groin Injury",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Fri, 5 Sep 2025 11:23:44 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.espn.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Fever star Caitlin Clark, who has been limited to 13 games because of injuries and hasn't played since July 15, will miss the remainder of the WNBA season.",
      "<p>Caitlin Clark will miss the rest of the Indiana Fever’s season because of a right groin injury.</p>"
    ],
    "image_url": "",
    "titles": [
      "'Disappointed' Clark to miss rest of Fever season",
      "Fever’s Caitlin Clark ruled out for rest of WNBA season"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.984,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.684,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Caitlin Clark, a player for the Indiana Fever, will not participate in the rest of the WNBA season due to a right groin injury. Clark, limited to 13 games this season because of injuries, has been out since July 15.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Fever's Playoff Hopes Dampened as Caitlin Clark Sidelined for Season",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Fri, 5 Sep 2025 08:16:40 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "The Fever continue their playoff chase without Caitlin Clark, who was ruled out for the rest of the season Thursday.",
      "The massive audience that Clark commands was left disappointed in 2025"
    ],
    "image_url": "",
    "titles": [
      "Caitlin Clark’s season is over: What comes next for the Fever star?",
      "Caitlin Clark's injury-plagued sophomore season was a disaster for the WNBA, the Fever and herself"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.922,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.681,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Fever will proceed with their playoff ambitions minus Caitlin Clark, who, as of Thursday, is sidelined for the remainder of the season. This development has notably disappointed her substantial fanbase in 2025.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "NFL Opener: Player Ejected for Spitting, Game Delayed by Weather",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Fri, 5 Sep 2025 11:43:35 EST",
    "source": "ESPN",
    "sources": [
      "Sky Sports",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.skysports.com"
    ],
    "snippets": [
      "An ejection for spitting and a lengthy weather delay made for an unusual NFL season opener.",
      "Highlights from the Dallas Cowboys at the Philadelphia Eagles in Week One of the NFL season."
    ],
    "image_url": "",
    "titles": [
      "Banner day for Eagles as champs hold off Cowboys in wild one",
      "Super Bowl champ Eagles hold off rival Cowboys to kick off NFL season"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.99,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.678,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The NFL season opener between the Dallas Cowboys and the Philadelphia Eagles was marked by an unusual incident where a player was ejected for spitting, and the game experienced a lengthy weather delay.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "EU Fines Google €2.95 Billion for Ad Service Bias, Google to Appeal",
    "domain": "business",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-09-05T15:38:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "Financial Post"
    ],
    "domains": [
      "www.dw.com",
      "financialpost.com"
    ],
    "snippets": [
      "The search engine giant was slapped a €2.95 billion fine over favoring its own advertising services. Google said it will appeal.",
      "LONDON (AP) &#8212; European Union regulators on Friday hit Google with a 2.95 billion euro ($3.5 billion) fine for breaching the bloc&#8217;s competition rules by favoring its own digital advertising services, marking the fourth such antitrust penalty for the company as well as a retreat from previ"
    ],
    "image_url": "",
    "titles": [
      "European Commission fines Google in ad-tech antitrust case",
      "Google hit with $3.5 billion fine from European Union in ad-tech antitrust case"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.989,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.663,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The European Union fined Google €2.95 billion for favoring its own advertising services, violating competition rules. This marks Google's fourth antitrust penalty from the EU. Google plans to appeal the decision.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Tesla Proposes Pay Package for Musk, Aiming for Trillionaire Status",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Fri, 05 Sep 2025 15:36:41 GMT",
    "source": "CNBC",
    "sources": [
      "The Verge",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "www.theverge.com"
    ],
    "snippets": [
      "Tesla will also ask shareholders to vote on whether the automaker should invest in Musk's artificial intelligence company, xAI.",
      "Elon Musk could become the world’s first trillionaire if Tesla shareholders approve a new pay package that was just put forward by the company’s board. Musk would need to meet certain milestones in order to receive that eye-popping compensation, such as producing 1 million robotaxis and 1 million hu"
    ],
    "image_url": "",
    "titles": [
      "Tesla's nearly $1 trillion new pay plan for Musk would expand his voting power",
      "Tesla offers $1 trillion to Elon Musk to unleash his army of robots"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.968,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.656,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Tesla's board proposed a new pay package for Elon Musk, which could make him the world's first trillionaire if shareholders approve. The package requires Musk to achieve milestones like producing 1 million robotaxis and 1 million homes. Additionally, shareholders will vote on Tesla investing in Musk's AI company, xAI.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Eagles Win Week 1 Amid \"Spitgate\" Controversy",
    "domain": "business",
    "source_domain": "www.forbes.com",
    "location": "global",
    "published": "Fri, 05 Sep 2025 10:58:34 -0400",
    "source": "Forbes",
    "sources": [
      "Sportsnet",
      "Forbes"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.forbes.com"
    ],
    "snippets": [
      "A pre-snap spit fest between Dak Prescott and Jalen Carter was one of the biggest highlights to a rain delay slugfest between the Dallas Cowboys and Philadelphia Eagles",
      "<p>The NFL got off to a spitting start &#8230; yes, literally. With the eyes of the sports world on the opening game of the NFL season, many took to social media to share their account of &#8220;spitgate.&#8221; Here are some of the best responses.</p>"
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/68baf63cc94d3867134adf08/0x0.jpg?width=960",
    "titles": [
      "Spitgate Highlights A Rain Delay Slugfest Between The Cowboys And Eagles",
      "The two sides of ‘spitgate’ in Eagles vs. Cowboys"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.975,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.65,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Philadelphia Eagles secured a win in their Week 1 game, marking a positive start to their quest for a repeat season. The game, which caught significant attention, was also marred by an incident widely discussed on social media, referred to as \"spitgate.\"",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Actor John Alford Found Guilty of Assaulting Two Teen Girls",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 05 Sep 2025 15:40:03 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The jury returns its verdict on the London's Burning actor.",
      "<p>One of the victims said she felt ‘absolutely sick’ after the assault and later had a ‘mental breakdown’</p><p>John Alford, the actor who appeared in TV series including London’s Burning and Grange Hill, has been found guilty of sexually assaulting girls aged 14 and 15.</p><p>The 53-year-old, who "
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/5916/live/000dc530-87dd-11f0-b391-6936825093bd.jpg",
    "titles": [
      "London's Burning star John Alford guilty of sexually assaulting girls",
      "Former Grange Hill actor John Alford found guilty of sexually assaulting teenage girls"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.969,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.649,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "John Alford, a 53-year-old actor known for his roles in \"London's Burning\" and \"Grange Hill,\" has been found guilty of sexually assaulting two girls, aged 14 and 15. One victim reported feeling 'absolutely sick' after the assault, leading to a 'mental breakdown.'",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "CEO's Huge Pay Tied to Company's Market Goals",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 05 Sep 2025 15:06:00 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Financial Times"
    ],
    "domains": [
      "www.bbc.com",
      "www.ft.com"
    ],
    "snippets": [
      "The car firm boss's enormous pay package depends on him hitting sky-high targets.",
      "Billionaire would need to hit a series of market value and profit goals to earn payout"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/f4d8/live/97d39570-8a53-11f0-94f4-77b666520245.jpg",
    "titles": [
      "Tesla proposes $1tn award for Musk if he hits targets",
      "Tesla seeks to award Musk $1tn if carmaker hits formidable targets"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.957,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.646,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The car company's CEO's large compensation package is contingent on achieving ambitious market value and profit objectives. The billionaire must meet specific targets to receive the payout.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UN: Wildfires Impact Air Quality Globally, Link to Climate Change",
    "domain": "science",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-09-05T07:02:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "Phys.org"
    ],
    "domains": [
      "phys.org",
      "www.dw.com"
    ],
    "snippets": [
      "Wildfires are releasing a risky mix of pollutants that can end up damaging air quality, according to a report from the UN weather agency. It said that air quality and climate change are closely connected.",
      "Wildfires are releasing a \"witches' brew\" of pollutants that can end up wrecking air quality a continent away from the blaze, the UN's weather and climate agency said Friday."
    ],
    "image_url": "",
    "titles": [
      "Wildfires fuel air pollution, says UN report",
      "Wildfires producing 'witches' brew' of air pollution: UN"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.826,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.627,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Wildfires emit a dangerous mix of pollutants, affecting air quality far beyond their origin, as reported by the UN weather agency. This contributes to the linkage between air quality and climate change, highlighting the global impact of such fires.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Attorney Mark S. Zuckerberg Loses Business Over Facebook Profile Issues",
    "domain": "technology",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Fri, 05 Sep 2025 05:16:22 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "TechCrunch"
    ],
    "domains": [
      "news.google.com",
      "techcrunch.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMiigFBVV95cUxNR3JNeXFNTkJma3A1OTZ6R19pSUk0RFVwWk85QUlkc3o1Z0pMZ3I1WkxpQ2F6ZjVJT1Jwbl9pYnlTeDNPckhLdlRRUVhUYkdGZlU4a1diYUdrSlFoSXhaMEdGa2c2UVZFNmtyc3hzM0VGVlctTUJYaVpJMWFDMFRoZG1OS3J4OHZUZEE?oc=5\" target=\"_blank\">Mark Zuckerberg vs. Mark Zuckerberg: Ind",
      "Mark S. Zuckerberg, an attorney, says that he's losing business because his Facebook business profile keeps getting disabled."
    ],
    "image_url": "",
    "titles": [
      "Mark Zuckerberg vs. Mark Zuckerberg: Indiana lawyer sues Meta - Axios",
      "Mark Zuckerberg sues Mark Zuckerberg"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.78,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.611,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Mark S. Zuckerberg, an attorney not affiliated with Meta, reports losing business due to his Facebook profile being repeatedly disabled, likely due to confusion with Meta's CEO. Meanwhile, former Meta executive Nick Clegg shared a memory of an MMA session with Meta's CEO, Zuckerberg, at a management offsite, highlighting a personal anecdote unrelated to the attorney's issue.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Waymo Expands to Austin and Atlanta, Adds California Airport Rides",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Thu, 04 Sep 2025 21:29:18 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "Waymo has launched commercial operations in Austin, Texas, as well as Atlanta, San Francisco, Phoenix and Los Angeles.",
      "It's the first airport in California that Waymo will offer rides to and from. The company's been active at the Phoenix airport for nearly two years."
    ],
    "image_url": "",
    "titles": [
      "Waymo to begin testing at San Jose airport this fall",
      "Waymo cleared to offer robotaxi rides at San Jose airport"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.663,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.595,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Waymo has expanded its commercial operations to Austin, Texas, and Atlanta, joining San Francisco, Phoenix, and Los Angeles. This includes offering rides to and from the first airport in California, building on nearly two years of operations at the Phoenix airport.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]