[
  {
    "title": "Former Colombian President Uribe Convicted of Witness Tampering",
    "domain": "general",
    "location": "national",
    "published": "Tue, 29 Jul 2025 00:16:39 -0400",
    "source": "NPR",
    "sources": [
      "The Guardian",
      "BBC",
      "Washington Post",
      "NPR"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "Former Colombian President Álvaro Uribe was convicted of witness tampering and bribery in a historic trial that gripped the country and threatened to tarnish the conservative strongman's legacy.",
      "The 73-year-old has become the first Colombian president to be convicted of a crime.",
      "<p>Ex-leader convicted over efforts to sway testimony in case tied to country’s armed conflict</p><p>A Colombian court has found the country’s former president Álvaro Uribe guilty of witness tampering.</p><p>The 73-year-old, who served as president from 2002 to 2010, was convicted on Monday of tryin",
      "The influential and controversial Uribe was found guilty in a witness tampering case and is the country’s first former president to be convicted in a criminal trial."
    ],
    "image_url": "",
    "titles": [
      "Former Colombian President Uribe found guilty in bribery trial",
      "Ex-Colombian president Álvaro Uribe guilty of witness-tampering",
      "Colombia’s former president Álvaro Uribe found guilty of witness tampering",
      "Álvaro Uribe, Colombia’s former president, found guilty in bribery trial"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.922,
      "consensus": 0.935,
      "constructiveness": 0.5,
      "proximity": 0.75
    },
    "score": 0.823,
    "summary": "Álvaro Uribe, a former Colombian president, was convicted of witness tampering by a Colombian court. This marks the first time a former head of state in Colombia has been found guilty of a crime. Uribe, who led the country from 2002 to 2010, faces up to 12 years in prison. The conviction is related to his efforts to influence testimony connected to the country’s armed conflict.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness about a significant event in Colombian politics. However, it lacks deeper insight into the implications of this conviction or the broader context of the country's armed conflict.",
    "image": {
      "src": "https://live.staticflickr.com/7752/17697249224_fd62af2a38_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/53beea45-b4ea-45e3-82f7-bc4a27f0c937/thumb/",
      "alt": "Sanborn Motel Postcard",
      "credit": "Phillip Pessar / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Thailand, Cambodia Agree to Ceasefire After Talks in Malaysia",
    "domain": "general",
    "location": "global",
    "published": "Tue, 29 Jul 2025 07:41:11 GMT",
    "source": "BBC",
    "sources": [
      "Al Jazeera",
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "Cambodia says there have been \"no armed clashes\" between the two sides since the midnight ceasefire.",
      "Thai troops have retaliated &#039;appropriately&#039; and in &#039;self-defence&#039;, Major-General Winthai Suvaree said in a statement.",
      "<p>Malaysian PM says countries have reached ‘common understanding’ to halt the   worst fighting in a decade</p><p>Thailand and Cambodia have agreed to an “immediate and unconditional” ceasefire after talks in Malaysia that aimed to halt the worst fighting between the neighbouring countries in more t"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/b92f/live/29faf8c0-6c37-11f0-9453-d5f74ab08fdc.jpg",
    "titles": [
      "Thailand accuses Cambodia of violating hours-old ceasefire",
      "Thailand accuses Cambodia of ceasefire violations but truce still holding",
      "Thailand and Cambodia agree to ‘immediate and unconditional’ ceasefire"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.99,
      "consensus": 0.847,
      "constructiveness": 1.0,
      "proximity": 0.5
    },
    "score": 0.812,
    "summary": "Thailand and Cambodia have agreed to an immediate and unconditional ceasefire following five days of deadly border clashes. The agreement was announced by Malaysian Prime Minister Anwar Ibrahim after talks in Malaysia aimed at halting the hostilities, marking the end of the worst fighting between the two countries in over a decade. The ceasefire is set to begin at midnight. This resolution comes after US President Donald Trump threatened to pause tariff negotiations until the fighting ceased.",
    "constructiveness_score": 1.0,
    "constructiveness_reason": "This story is highly constructive as it reports on a significant progress - a ceasefire agreement between Thailand and Cambodia. This provides readers with actionable insights and a deeper understanding of the conflict and its resolution.",
    "image": {
      "src": "https://live.staticflickr.com/8524/8673912663_c18e4f0d16_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/4171d071-f855-496c-be9d-26640f69ca1d/thumb/",
      "alt": "Pattaya Thailand",
      "credit": "newhotelus / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Man Opens Fire in NYC Skyscraper, Killing 4 Including Off-Duty Officer",
    "domain": "general",
    "location": "global",
    "published": "Tue, 29 Jul 2025 06:07:59 GMT",
    "source": "BBC",
    "sources": [
      "Al Jazeera",
      "CityNews",
      "BBC",
      "Financial Times"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "Authorities say Shane Devon Tamura travelled across the country from Las Vegas to open fire inside the skyscraper.",
      "The attacker was armed with an M4 rifle when he opened fire inside a skyscraper at 345 Park Avenue, Manhattan.",
      "Police investigating attack on Midtown Manhattan skyscraper that is also home to NFL and KPMG",
      "NEW YORK (AP) — A man carrying a rifle killed four people at a New York City office tower Monday, including an off-duty New York City police officer, and wounded a fifth before taking his own life, officials said. The officer who was killed was Didarul Islam, 36, an immigrant from Bangladesh who had"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/9a97/live/601de200-6c50-11f0-8dbd-f3d32ebd3327.png",
    "titles": [
      "Police officer among four dead in shooting at New York City office building",
      "Five dead in New York City shooting, including police officer, suspect",
      "Five dead after shooting at New York tower housing Blackstone offices",
      "Gunman kills 4, including police officer, in shooting at New York City office tower"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.958,
      "consensus": 0.985,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.798,
    "summary": "Shane Devon Tamura traveled from Las Vegas to New York City, where he opened fire inside a skyscraper at 345 Park Avenue, Manhattan, with an M4 rifle. The attack resulted in the deaths of four individuals, including an off-duty NYPD officer, Didarul Islam, 36, an immigrant from Bangladesh, and wounded a fifth. The assailant then committed suicide. The building is known to house NFL and KPMG offices. Authorities are currently investigating the incident.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness of a tragic event but doesn't offer much depth or insight. It does not provide actionable insights for the reader, nor does it report on solutions or improvements. The story does not increase clarity around systems, causes, or trends that matter.",
    "image": {
      "src": "https://live.staticflickr.com/3478/4018734638_872927c18f_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/681d7705-7160-4156-8f9a-8faa33523cca/thumb/",
      "alt": "Natural Fire 10 Opens, U.S. Army Africa, Kitgum, Uganda 091016",
      "credit": "US Army Africa / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Trump Pressures Putin on Ukraine War, Threatens Sanctions and Tariffs",
    "domain": "general",
    "location": "global",
    "published": "2025-07-28T14:50:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "New York Times",
      "The Guardian",
      "Deutsche Welle"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "US President Donald Trump escalated pressure on his Russian counterpart, Vladimir Putin, for Russia to make progress toward ending the war in Ukraine or face consequences.",
      "<p>US president expresses frustration with Putin after meeting with UK PM amid pressure on Russia for ceasefire</p><p><a href=\"https://www.theguardian.com/us-news/donaldtrump\">Donald Trump</a>’s timeline for a peace deal between <a href=\"https://www.theguardian.com/world/russia\">Russia</a> and <a hr",
      "President Trump, meeting with Britain’s prime minister in Scotland, called on Russia to stop its attacks in Ukraine in less than two weeks or face new sanctions and tariffs."
    ],
    "image_url": "",
    "titles": [
      "Putin has 10-12 day deadline to reach Ukraine deal — Trump",
      "Trump cuts deadline for Putin to reach Ukraine peace deal to ‘10 or 12 days’",
      "Trump Moves Up Deadline for Putin to End Ukraine War"
    ],
    "score_components": {
      "magnitude": 0.78,
      "recency": 0.697,
      "consensus": 0.847,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.754,
    "summary": "US President Donald Trump has intensified pressure on Russian President Vladimir Putin to halt the war in Ukraine, warning of consequences such as new sanctions and tariffs if Russia does not cease its attacks within two weeks. This stance was emphasized during Trump's meeting with the UK Prime Minister in Scotland, highlighting frustration with Putin's lack of progress towards a ceasefire.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story informs and contextualizes a significant geopolitical issue. It provides useful information about the current state of international relations and potential consequences of continued conflict. However, it doesn't clearly highlight progress or solutions, rather it reports on attempts to solve a problem.",
    "image": {
      "src": "https://live.staticflickr.com/65535/52085391109_b5836cf479_m.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/6f4ddadc-2ed5-4947-8881-801b5a10215d/thumb/",
      "alt": "Heather Cox Richardson",
      "credit": "nordique / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Warner Bros. Discovery to Split into Two Entities by 2026",
    "domain": "general",
    "location": "national",
    "published": "Mon, 28 Jul 2025 18:04:13 GMT",
    "source": "Axios",
    "sources": [
      "The Verge",
      "Axios",
      "CNBC"
    ],
    "domains": [
      "technology",
      "general",
      "business"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMihAFBVV95cUxPZXhGNEt0WkJyZXQtZ3NMZkJ0bTZxSHVEUnBYRGo5cEt6T3k4QTlHWFEzcFBsc3ByUE1zLUFGa1JYUlAwbUJ0NnBzQU4ySkhGWXg4R0pkYUVKWi1fd2FTdGlYTVFRSkhDY2JZVXhVNkNUU0FyT2NqcFU0ZERzQXZZNklEVW8?oc=5\" target=\"_blank\">Warner Bros. Discovery will now be two companies",
      "Warner Bros. Discovery announced the corporate names and leadership teams of its two companies for when the company separates in mid-2026.",
      "This time next year, the corporate entity known as Warner Bros. Discovery will be no more, and the two companies it&#8217;s splitting into have some very inspired names. Today, Warner Bros. Discovery announced that &#8220;Warner Bros.&#8221; and &#8220;Discovery Global&#8221; are the names of the tw"
    ],
    "image_url": "",
    "titles": [
      "Warner Bros. Discovery will now be two companies — Warner Bros. and Discovery - Axios",
      "Warner Bros. Discovery announces post-split companies will be 'Warner Bros.' and 'Discovery Global'",
      "Warner Bros. Discovery will be Warner Bros. and Discovery after they break up"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.745,
      "consensus": 0.897,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.748,
    "summary": "Warner Bros. Discovery has announced it will split into two separate entities, named \"Warner Bros.\" and \"Discovery Global,\" by mid-2026. The company also revealed the leadership teams for each of the new companies. This decision marks the end of the combined corporate entity currently known as Warner Bros. Discovery.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful information about a significant change in the media industry, giving readers a deeper understanding of corporate decisions and their potential impact on the industry. However, it does not offer solutions or progress towards solving a problem, nor does it increase clarity around systems or trends.",
    "image": {
      "src": "https://live.staticflickr.com/5199/6947211830_4ba6106004_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/ef966090-4adb-4724-972b-9803a542b16c/thumb/",
      "alt": "Hogwarts Great Hall: Harry Potter Tour Warner Bros Studios Leavesden London",
      "credit": "Tips For Travellers / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Hall of Fame Second Baseman Ryne Sandberg Dies at 65",
    "domain": "general",
    "location": "national",
    "published": "Tue, 29 Jul 2025 02:03:28 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "Sportsnet"
    ],
    "domains": [
      "general",
      "sports"
    ],
    "snippets": [
      "Ryne Sandberg, a Hall of Fame second baseman who became one of baseball's best all-around players while starring for the Chicago Cubs, has died. He was 65.",
      "<p>Ryne Sandberg, a Hall of Fame second baseman who became one of baseball’s best all-around players while starring for the Chicago Cubs, has died. He was 65.</p>"
    ],
    "image_url": "",
    "titles": [
      "Hall of Fame second baseman Ryne Sandberg has died after battling cancer",
      "Hall of Fame second baseman Ryne Sandberg has died after battling cancer"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.957,
      "consensus": 0.682,
      "constructiveness": 0.5,
      "proximity": 0.75
    },
    "score": 0.697,
    "summary": "Hall of Fame second baseman Ryne Sandberg, known for his stellar career with the Chicago Cubs, has passed away at the age of 65. Sandberg was widely regarded as one of baseball's top players and leaves behind a legacy of excellence on the field.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness of a notable event in the sports world. It gives a brief overview of Ryne Sandberg's legacy but does not delve into depth or provide actionable insights for the reader. It does not report on solutions, improvements, or innovations, nor does it increase clarity around systems, causes, trends, or impacts that matter.",
    "image": {
      "src": "https://live.staticflickr.com/1293/1042898105_d29ce42e89_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/cc0cd4ed-d874-4ba9-911c-04a7f4319fa3/thumb/",
      "alt": "City Hall",
      "credit": "kevin dooley / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Deion Sanders Undergoes Surgery for Bladder Cancer, Declared Cancer-Free",
    "domain": "sports",
    "location": "national",
    "published": "Tue, 29 Jul 2025 01:36:25 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Colorado coach Deion Sanders said he recently had surgery to remove his bladder after doctors found a tumor there, and he declared that he has been cancer-free since the operation.",
      "<p>Colorado coach Deion Sanders disclosed Monday that he was diagnosed with an aggressive form of bladder cancer, but after surgery, his oncologist has considered him cured, so he plans to coach this season.</p>"
    ],
    "image_url": "",
    "titles": [
      "Deion says he's cancer-free after bladder removal",
      "Deion Sanders says he’s cured of cancer after having bladder removed"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.948,
      "consensus": 0.632,
      "constructiveness": 0.6,
      "proximity": 0.75
    },
    "score": 0.693,
    "summary": "Deion Sanders, the Colorado football coach, revealed he underwent surgery to remove his bladder due to a tumor. Following the operation, Sanders has been declared cancer-free by his oncologist. Despite the aggressive form of bladder cancer, he announced plans to continue coaching this season.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs readers about Deion Sanders' health situation and his determination to continue coaching despite his health challenges. It provides some insight into the personal struggles of a public figure, which could potentially inspire others facing similar situations. However, it does not provide a deeper understanding of bladder cancer or its impacts.",
    "image": {
      "src": "https://live.staticflickr.com/7674/16715252174_375ab2a110_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/f8607ca8-43b9-40b9-bd2b-9460489ce6ed/thumb/",
      "alt": "Bladder Cancer",
      "credit": "davis.steve32 / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Sportsnet Launches Trade Tracker for Major League Roster Updates",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 28 Jul 2025 17:33:10 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "You know the major leaguers on the move -- but what about the potential stars of tomorrow headed the other way in those deals?",
      "<p>With contending teams ready to bolster their rosters for the post-season push, you can stay up to date with every trade made before the deadline in Sportsnet&#8217;s trade tracker below.</p>"
    ],
    "image_url": "",
    "titles": [
      "Ranking every prospect dealt before the 2025 MLB trade deadline",
      "2025 MLB Trade Deadline Tracker: Every move made"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.801,
      "consensus": 0.632,
      "constructiveness": 0.9,
      "proximity": 0.75
    },
    "score": 0.693,
    "summary": "Sportsnet's trade tracker offers updates on all major league trades before the deadline, focusing not only on current stars but also on potential future talents moving between teams. This tool is designed to keep fans informed about roster changes as contending teams strengthen their lineups for the post-season.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive as it introduces a new tool for fans to stay informed about roster changes in Major League Baseball. It empowers the reader with actionable insights and a deeper understanding of the dynamics of player trades. It also highlights an innovation in the way sports news is reported."
  },
  {
    "title": "Hall of Fame Second Baseman Ryne Sandberg Dies from Cancer",
    "domain": "sports",
    "location": "national",
    "published": "Tue, 29 Jul 2025 01:36:25 EST",
    "source": "ESPN",
    "sources": [
      "Sports Illustrated",
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Ryne Sandberg, a Hall of Fame second baseman who spent nearly all of his playing career with the Cubs, died Monday after a recurrence of cancer.",
      "<a href=\"https://news.google.com/rss/articles/CBMilgFBVV95cUxPelFvemxNMHNFTUF3NmVEU2ZJM1pQWHRGcURoc2VDZW5WVDd3OHZIVVh0M0NpUFRGS2cwX0x2VnZvY1VmOWhOMURPVDU2NHUzNVp2UnpNVXFydGlLbXN2cGgySEhIV2ozZXg1NFUzOHBjS3V6X3lPTEoxRHlZQ2xfdFpXS1JWTV9FQkR6ZC1qeDg3Y19ka3c?oc=5\" target=\"_blank\">Ryne Sandberg, Hall of F"
    ],
    "image_url": "",
    "titles": [
      "Cubs Hall of Famer Sandberg dies at age 65",
      "Ryne Sandberg, Hall of Famer Who Helped Restore Cubs' Glory, Dies at 65 - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.948,
      "consensus": 0.632,
      "constructiveness": 0.5,
      "proximity": 0.75
    },
    "score": 0.683,
    "summary": "Hall of Fame second baseman Ryne Sandberg, known for his career with the Cubs, passed away on Monday due to a cancer recurrence. Sandberg's death marks the end of a legendary baseball career that spanned decades, leaving behind a lasting legacy in the sports world.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about the death of Ryne Sandberg, but it does not offer any depth or insight into his life, career, or the impact of his death on the sports world. It does not provide actionable insights or deeper understanding for the reader.",
    "image": {
      "src": "https://live.staticflickr.com/1293/1042898105_d29ce42e89_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/cc0cd4ed-d874-4ba9-911c-04a7f4319fa3/thumb/",
      "alt": "City Hall",
      "credit": "kevin dooley / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Waymo Partners with Avis for Robotaxi Fleet in Dallas, Plans Expansion",
    "domain": "business",
    "location": "national",
    "published": "Tue, 29 Jul 2025 00:25:44 GMT",
    "source": "CNBC",
    "sources": [
      "Forbes",
      "CNBC"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Waymo is partnering with rental car company Avis for robotaxi fleet management in Dallas.",
      "Alphabet Inc.'s self-driving tech company plans to begin its service in the Texas city next year, when it’s also expanding to Miami and Washington, DC."
    ],
    "image_url": "",
    "titles": [
      "Waymo plans to bring its robotaxi service to Dallas in 2026",
      "Waymo Plans To Widen Robotaxi Lead Over Tesla With 2026 Dallas Launch"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.851,
      "consensus": 0.632,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.678,
    "summary": "Alphabet Inc.'s Waymo is teaming up with Avis to manage its robotaxi fleet in Dallas, with plans to launch the service there next year. This expansion will also include Miami and Washington, DC, marking significant growth for the self-driving tech company.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it reports on an innovative solution in the transportation sector. It provides actionable insights for investors and anyone interested in self-driving technology, and it also increases awareness about the growth and expansion of this technology.",
    "image": {
      "src": "https://live.staticflickr.com/8123/8631140549_3509589552.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/d2001e29-859c-44ec-9880-ee07c8b6c832/thumb/",
      "alt": "Avis medical.....",
      "credit": "Seth Capitulo / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Beijing Floods: 34 Dead, Over 80,000 Relocated",
    "domain": "general",
    "location": "national",
    "published": "Tue, 29 Jul 2025 01:12:49 -0400",
    "source": "NPR",
    "sources": [
      "New York Times",
      "NPR"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "Heavy rains and flooding killed 30 people in Beijing, bringing the death toll from the storms in the region to at least 34. More than 80,000 people have been relocated in Beijing.",
      "The rains set off flooding and landslides, forcing tens of thousands of people to flee their homes in the capital and neighboring Hebei Province."
    ],
    "image_url": "",
    "titles": [
      "Heavy rains and flooding kill at least 34 people in and near Beijing",
      "Heavy Rain and Flooding in China Kill at Least 30"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.94,
      "consensus": 0.632,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.661,
    "summary": "Heavy rains and flooding in Beijing and neighboring Hebei Province resulted in at least 34 deaths, with 30 fatalities in Beijing alone. The severe weather caused flooding and landslides, leading to the relocation of over 80,000 people in the capital.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about the floods in Beijing, but it does not offer any depth or insight into the causes, impacts, or potential solutions to the problem. It does not provide actionable insights or deeper understanding for the reader.",
    "image": {
      "src": "https://upload.wikimedia.org/wikipedia/commons/1/17/2023%E5%B9%B4%E5%8C%97%E4%BA%AC%E6%9A%B4%E9%9B%A8_Beijing_flood_20230801.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/75669035-4655-4a3d-a799-164acc54993f/thumb/",
      "alt": "2023年北京暴雨 Beijing flood 20230801",
      "credit": "China News Service / CC BY 3.0",
      "license": "by",
      "license_version": "3.0",
      "license_url": "https://creativecommons.org/licenses/by/3.0/",
      "provider": "wikimedia",
      "source": "Openverse"
    }
  },
  {
    "title": "Colts Extend Raimann for $100M Over 4 Years, $60M Guaranteed",
    "domain": "sports",
    "location": "national",
    "published": "Tue, 29 Jul 2025 02:46:59 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sportsnet"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Raimann's deal includes $60 million guaranteed",
      "<p>The Indianapolis Colts have locked down their left tackle.</p>\n<p>Bernhard Raimann and the team agreed to a four-year, $100-million extension with $60 million guaranteed, according to multiple reports.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/07/29/8ad58f3a-cf72-48fb-a9f6-0d297161f6e8/raimann-getty.png",
    "titles": [
      "Colts, LT Bernhard Raimann agree to four-year, $100 million contract extension, per report",
      "Reports: Colts, left tackle Bernhard Raimann agree to four-year, $100-million extension"
    ],
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.894,
      "consensus": 0.632,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.654,
    "summary": "The Indianapolis Colts have extended left tackle Bernhard Raimann's contract for four years at a total value of $100 million, with $60 million of that amount guaranteed. This agreement secures Raimann's position with the team, as reported by various sources.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about a new contract for a player in the Indianapolis Colts. It doesn't provide any deeper insights or actionable information for the reader, nor does it report on any solutions, improvements, or innovations. It does not increase clarity around systems, causes, trends, or impacts that matter.",
    "image": {
      "src": "https://live.staticflickr.com/5065/5677341825_3fac0448b4_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/9cd63a92-3290-48d7-bd9c-7f69fe33b4f8/thumb/",
      "alt": "sun setting over the ottawa river",
      "credit": "iglooo101 / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "London Event to Begin on The Mall, End at Buckingham Palace",
    "domain": "general",
    "location": "global",
    "published": "Tue, 29 Jul 2025 06:58:01 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Yahoo Sports"
    ],
    "domains": [
      "general",
      "sports"
    ],
    "snippets": [
      "The event in London will begin along The Mall and end with a ceremony in front of  Buckingham Palace.",
      "The event in London will begin along The Mall and end with a ceremony in front of  Buckingham Palace.",
      "The event in London will begin along The Mall and end with a ceremony in front of Buckingham Palace."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/3ca4/live/4f2f5d20-6c46-11f0-89ea-4d6f9851f623.jpg",
    "titles": [
      "London to celebrate victorious Lionesses with open-top bus parade",
      "London to celebrate Lionesses with open-top bus parade",
      "London to celebrate Lionesses with open-top bus parade"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.975,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.626,
    "summary": "An event in London is set to start along The Mall and conclude with a ceremony at Buckingham Palace. The event's details and purpose are not specified in the provided information.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "This story lacks any meaningful information or context. It does not inform the reader about the purpose of the event, who is involved, or why it is significant. It does not contribute to the reader's understanding or decision-making.",
    "image": {
      "src": "https://live.staticflickr.com/48/159137112_dc96d3bdbd.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/2b9d91fe-a034-417a-b2aa-4c1221fd656c/thumb/",
      "alt": "flickr london events",
      "credit": "_sarchi / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Jayden Struble Signs Two-Year, $2.825M Contract with Team",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 28 Jul 2025 13:04:18 GMT",
    "source": "NHL",
    "sources": [
      "Sportsnet",
      "NHL"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMijAFBVV95cUxNT3pWcVlBQ0U5YWRRWmYwOGFKNEZhVXktanB4VHRsb25wR3l5ODVBWmU3WFZsRkgzVlNKb0dnRGJsa3NPeGJ2YmRLUWJyUEwxMmVNeXBNRTh0cjM2MURhN2VkeklRVndhZ0hSYkVoLUlCOWxqZEd0ZUlmNUhxdTMycFA0bWlXcm5OSXpCTg?oc=5\" target=\"_blank\">Two-year contract for Jayden Struble ",
      "<p>Defenceman Jayden Struble has signed a two-year, one-way contract worth $2.825-million ($1.4125 million in average annual value), the team announced Monday. </p>"
    ],
    "image_url": "",
    "titles": [
      "Two-year contract for Jayden Struble | Montréal Canadiens - NHL.com",
      "Canadiens sign D Jayden Struble to two-year, $2.825-million contract"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.672,
      "consensus": 0.632,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.612,
    "summary": "Defenceman Jayden Struble has signed a two-year, one-way contract with a value of $2.825 million. The contract has an average annual value of $1.4125 million. The announcement was made by the team on Monday.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information about a player's new contract, which could impact the reader's understanding of the player's value and the team's investment strategy. However, it lacks context about the player's past performance, the team's current needs, or the potential impact of this contract on the team's future performance.",
    "image": {
      "src": "https://live.staticflickr.com/7073/7350058078_8d28aedce0_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/f62f1d55-abeb-401e-ac1f-7bace1931d44/thumb/",
      "alt": "Teacher of the Year",
      "credit": "USAG-Humphreys / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Denver Broncos Extend Courtland Sutton's Contract for Four Years",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 28 Jul 2025 19:31:03 +0000",
    "source": "CBS Sports",
    "sources": [
      "Sports Illustrated",
      "CBS Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Sutton was entering the final year of his contract after posting career-high 81 catches in 2024",
      "<a href=\"https://news.google.com/rss/articles/CBMikwFBVV95cUxQTHhWYVMtbDV3UXhpb3UtVTNyV3MxaXFYa1U1YUxFeWNJTHRrSzg2anZfaW1NNnVLeFZscFlwQXEzLUNNNHRBOEFvMW9tMldUOHprRS1lbElXVzk1M0t5OFNSQnk0RTRIa25VQkt1ZmhJRm50dmpuUmp5ZjhDVER1MTdhQ3BtbndITU10bE5SNktlRTA?oc=5\" target=\"_blank\">Report: Broncos Sign WR Cour"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/07/28/0073ee6d-4a46-4651-b43b-70d810f14460/sutton.jpg",
    "titles": [
      "Broncos, WR Courtland Sutton agree to four-year, $92 million extension",
      "Report: Broncos Sign WR Courtland Sutton to $92M Extension - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.768,
      "consensus": 0.632,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.602,
    "summary": "The Denver Broncos and wide receiver Courtland Sutton have agreed to a four-year contract extension, ensuring their No. 1 receiver remains with the team beyond his final contract year. This deal comes after Sutton posted a career-high 81 catches in 2024.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic information about a contract extension between the Denver Broncos and Courtland Sutton. It does not offer much in terms of actionable insights, deeper understanding, or progress. It's mainly useful for fans or those following the team or player.",
    "image": {
      "src": "https://live.staticflickr.com/3203/2940360814_7542be783f_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/9781b686-6c40-4018-9c05-b0bf237ece20/thumb/",
      "alt": "contract to sell page 3 of 3",
      "credit": "calicoan.villas / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Yet another Pixel 6A caught fire",
    "domain": "technology",
    "location": "global",
    "published": "2025-07-28T16:23:32-04:00",
    "source": "The Verge",
    "sources": [
      "Ars Technica",
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Another user has reported their Pixel 6A catching fire — but this time, it appears to have occurred after applying Google’s recent battery performance update that was intended to prevent overheating issues, as spotted by Android Authority. In a post on Reddit, a Pixel 6A user says they awoke to a “h",
      "Google's Battery Performance Program update was supposed to stop this."
    ],
    "image_url": "",
    "titles": [
      "Yet another Pixel 6A caught fire",
      "Another Google Pixel 6a catches fire after battery-nerfing update"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.782,
      "consensus": 0.632,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.574,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "The story lacks any context, detail, or insight. It seems sensational and fear-based, offering no actionable insights or deeper understanding to the reader. It neither reports on solutions or improvements nor increases clarity around systems, causes, trends, or impacts.",
    "image": {
      "src": "https://live.staticflickr.com/4146/5082779364_2c5cb449e4_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/e2fb0227-ab2e-4732-985e-3df7085bc762/thumb/",
      "alt": "The End - And Yet - The Beginning",
      "credit": "Ian Sane / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Manchester United Eyes New Striker Amid Discounted Price Offer",
    "domain": "sports",
    "location": "national",
    "published": "Tue, 29 Jul 2025 07:17:01 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Manchester United could sign another striker this summer after reports claim discounted price offered."
    ],
    "image_url": "",
    "titles": [
      "Man Utd eye cut-price striker as Marcus Rashford replacement"
    ],
    "score_components": {
      "magnitude": 0.289,
      "recency": 0.982,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.496,
    "summary": "Manchester United is considering signing another striker this summer following reports of a discounted price being offered. The club is exploring options to strengthen its attacking lineup. The outcome of this potential transfer remains uncertain as negotiations and player evaluations continue.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about Manchester United's interest in a new player. However, it doesn't provide any deeper insights or actionable information for the reader, nor does it report on any solutions, improvements, or innovations. It does not increase clarity around systems, causes, trends, or impacts that matter."
  },
  {
    "title": "Lawsuit Challenges \"Filming Not a First Amendment Right\" Claim",
    "domain": "business",
    "location": "global",
    "published": "Mon, 28 Jul 2025 21:39:19 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Another officer in the lawsuit claimed that “one person is not a protest” and “filming is not a First Amendment right.”"
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/68880d00a1383aabda85f823/0x0.jpg?width=960",
    "titles": [
      "Cop Who Tried To Run Over Protestor Faces First Amendment Lawsuit"
    ],
    "score_components": {
      "magnitude": 0.189,
      "recency": 0.873,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.449,
    "summary": "A lawsuit involves an officer's claim that \"one person is not a protest\" and that \"filming is not a First Amendment right.\" This statement is part of a broader legal dispute over the rights to protest and record police activity, highlighting a contention over First Amendment protections.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful context and awareness about an ongoing legal dispute related to First Amendment rights. However, it doesn't provide actionable insights or report on solutions or progress in the issue, hence the score.",
    "image": {
      "src": "https://live.staticflickr.com/3060/2987611025_b9a279bba1_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/d63453fc-b78e-42d3-9b99-1feee7c1b345/thumb/",
      "alt": "my neighborhood",
      "credit": "woodleywonderworks / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Study: Daily Fast Walking Lowers Death Risk in Low-Income, Black Americans",
    "domain": "science",
    "location": "global",
    "published": "Tue, 29 Jul 2025 02:36:54 EDT",
    "source": "ScienceDaily",
    "sources": [
      "ScienceDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Fast walking, even just 15 minutes a day, can dramatically reduce the risk of death, especially from heart disease, according to a large study involving nearly 80,000 low-income and predominantly Black Americans in the South. The findings not only affirm the well-known health benefits of walking but"
    ],
    "image_url": "",
    "titles": [
      "Walk faster, live longer: How just 15 minutes a day can boost lifespan"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.968,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.443,
    "summary": "A study involving nearly 80,000 low-income, predominantly Black Americans in the South found that fast walking for at least 15 minutes daily can significantly lower the risk of death, particularly from heart disease. This research reinforces the established health benefits of walking.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it provides actionable insights for readers, particularly low-income, Black Americans, about the health benefits of daily fast walking. It increases awareness about the impact of simple physical activity on health, contributing to a deeper understanding of preventative health measures.",
    "image": {
      "src": "https://live.staticflickr.com/8144/7653312938_e77f116d69_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/c3f2ab41-2760-4250-8193-636c43f9018b/thumb/",
      "alt": "Medical Study",
      "credit": "born1945 / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Cambridge Study Links Gut Hormone INSL5 to Chronic Diarrhea Causes",
    "domain": "science",
    "location": "global",
    "published": "Tue, 29 Jul 2025 01:33:52 EDT",
    "source": "ScienceDaily",
    "sources": [
      "ScienceDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "A mysterious gut hormone may be behind many cases of chronic diarrhea, especially in people with undiagnosed bile acid malabsorption, a condition often mistaken for irritable bowel syndrome. Researchers from the University of Cambridge identified that the hormone INSL5 spikes when bile acid reaches "
    ],
    "image_url": "",
    "titles": [
      "This gut hormone could explain 40% of IBS-D cases—and lead to a cure"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.947,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.441,
    "summary": "Researchers at the University of Cambridge discovered a gut hormone, INSL5, may cause chronic diarrhea in individuals with undiagnosed bile acid malabsorption, commonly confused with irritable bowel syndrome. INSL5 levels increase in response to bile acid, suggesting a potential target for new treatments.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it provides useful information about a new discovery related to chronic diarrhea, a common health issue. It reports on an innovation in understanding the causes of this condition and suggests a potential target for new treatments, contributing to progress in medical research.",
    "image": {
      "src": "https://live.staticflickr.com/5464/9282148023_04049332ec_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/52d0bf0c-2d74-488c-b37a-c0d2cdafb944/thumb/",
      "alt": "Nanjing University",
      "credit": "kevin dooley / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Phillips Shares Jump 14% After Uplifting Earnings Forecast",
    "domain": "business",
    "location": "global",
    "published": "Tue, 29 Jul 2025 07:46:00 GMT",
    "source": "MarketWatch",
    "sources": [
      "MarketWatch"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Shares of health device maker Phillips rallied as much as 14% on Tuesday as the company lifted its earnings guidance despite a hefty hit from tariffs."
    ],
    "image_url": "https://images.mktw.net/im-85185847",
    "titles": [
      "Philips lifts profit outlook on tariff mitigation as Stellantis flags $1.7 billion hit from levies"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.992,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.44,
    "summary": "Phillips, a health device maker, saw its shares surge by 14% after raising its earnings outlook, despite facing significant losses due to tariffs. The company's stock rallied on Tuesday following the positive guidance update.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story offers useful information for investors and provides a deeper understanding of the company's financial position. However, it doesn't highlight any innovative solutions or progress beyond the company's positive earnings outlook.",
    "image": {
      "src": "https://live.staticflickr.com/3402/3421605499_97b990b992_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/60592de6-84c9-4895-8ead-f4272213233c/thumb/",
      "alt": "Happy Tuesday",
      "credit": "Identity Photogr@phy / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Stellantis Expects €1.2B Tariff Impact in H2 After EU-US Trade Deal",
    "domain": "business",
    "location": "national",
    "published": "Tue, 29 Jul 2025 07:43:59 +0000",
    "source": "Financial Post",
    "sources": [
      "Financial Post"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Stellantis NV expects to take a hit of around €1.2 billion ($1.4 billion) from tariffs in the second half of this year as the maker of Jeep sport utility vehicles and Fiat cars reinstates financial guidance following the European Union’s trade deal with the US."
    ],
    "image_url": "",
    "titles": [
      "Stellantis Sees €1.2 Billion Tariff Hit in Second Half"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.991,
      "consensus": 0.393,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.437,
    "summary": "Stellantis NV, the automotive company behind Jeep and Fiat, anticipates a €1.2 billion ($1.4 billion) impact from tariffs in the latter half of the year. This forecast comes as the company resumes financial projections after the European Union and the US reached a trade agreement.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful information for readers interested in the automotive industry, international trade, or both. It provides insight into the potential financial impact of tariffs on a major automotive company, which could influence decision-making for investors, employees, and others. However, it does not report on solutions or improvements, nor does it offer a deep understanding of the systems or causes involved.",
    "image": {
      "src": "https://live.staticflickr.com/850/43969571141_b0000ce4d5_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/77da6407-4a05-422a-b1b9-10e1ef9a07f2/thumb/",
      "alt": "Tariff Impact",
      "credit": "",
      "license": "cc0",
      "license_version": "1.0",
      "license_url": "https://creativecommons.org/publicdomain/zero/1.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Fungus Found to Naturally Boost Bread's Nutritional Quality",
    "domain": "science",
    "location": "global",
    "published": "Tue, 29 Jul 2025 04:31:38 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/no-gmos-no-chemicals-just-a-fungus-making-bread-better-for-you/\" rel=\"nofollow\" title=\"No GMOs, No Chemicals – Just a Fungus Making Bread Better for You\"><img alt=\"Assortment of Nutritious Bread and Rolls\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" sr"
    ],
    "image_url": "",
    "titles": [
      "No GMOs, No Chemicals – Just a Fungus Making Bread Better for You"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.927,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.437,
    "summary": "A new study found that a fungus called Rhizopus oligosporus can improve the nutritional quality of bread without the need for GMOs or chemicals. This fungus enhances the bread's protein content and amino acid profile, making it a healthier option. Researchers believe this natural approach could lead to the development of better-for-you bread products. The study highlights the potential of using fungi to enhance the nutritional value of food products.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive because it reports on an innovation that can improve the nutritional quality of bread. It offers actionable insights for readers interested in healthier food options and provides a deeper understanding of how natural methods can be used to enhance food quality.",
    "image": {
      "src": "https://live.staticflickr.com/8002/7305535058_ab96b5f389.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/4913343d-efc5-4f6e-a356-811d3b3cf902/thumb/",
      "alt": "A fungus found among the live oaks in our yard.",
      "credit": "Amy Windsor / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Experts Suggest Creatine Supplements for All, Citing Health Benefits",
    "domain": "science",
    "location": "global",
    "published": "Tue, 29 Jul 2025 03:41:56 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/why-experts-say-you-should-be-taking-creatine-even-if-you-dont-work-out/\" rel=\"nofollow\" title=\"Why Experts Say You Should Be Taking Creatine – Even if You Don’t Work Out\"><img alt=\"Human Health Boost Strength Longevity\" class=\"webfeedsFeaturedVisual wp-post-image\" "
    ],
    "image_url": "",
    "titles": [
      "Why Experts Say You Should Be Taking Creatine – Even if You Don’t Work Out"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.911,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.434,
    "summary": "Experts recommend taking creatine supplements not only for those who work out but also for the general population, due to its benefits in boosting strength, enhancing longevity, and improving overall human health. This recommendation is based on research highlighting creatine's positive effects beyond muscle building, including potential cognitive and health benefits.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it provides actionable insights (taking creatine supplements) and deeper understanding (benefits of creatine beyond muscle building). It also reports on potential improvements in human health, contributing to the reader's decision-making.",
    "image": {
      "src": "https://live.staticflickr.com/4116/4906048881_a3c6055901_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/79cacafe-ca90-4a8b-80dc-24e76dce49f6/thumb/",
      "alt": "All Carbon",
      "credit": "jurvetson / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "New Diabetes Subtype Identified in Africa, Suggests Need for Tailored Care",
    "domain": "science",
    "location": "global",
    "published": "Tue, 29 Jul 2025 04:06:24 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/new-diabetes-subtype-discovered-in-africa-challenges-global-assumptions/\" rel=\"nofollow\" title=\"New Diabetes Subtype Discovered in Africa Challenges Global Assumptions\"><img alt=\"Diabetes Warning\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"583\" src=\"https:"
    ],
    "image_url": "",
    "titles": [
      "New Diabetes Subtype Discovered in Africa Challenges Global Assumptions"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.919,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.433,
    "summary": "Scientists have identified a new subtype of diabetes in Africa, challenging prevailing global assumptions about the disease. This discovery, highlighted in a recent study, suggests that the characteristics and treatment needs of diabetes patients in Africa might differ significantly from those in other parts of the world, indicating a need for region-specific approaches to diabetes care and management.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it increases awareness about a new subtype of diabetes and the need for tailored care. It provides useful information for healthcare professionals and patients, and highlights the importance of region-specific approaches to disease management.",
    "image": {
      "src": "https://live.staticflickr.com/5515/10677199886_146792d40f_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/1c3e1808-c1ee-4539-9ab3-7575b37fad63/thumb/",
      "alt": "Satellite Captures Eclipse Passing Over Africa",
      "credit": "NASA Goddard Photo and Video / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Study Suggests Tree Climbing Influenced Early Human Bipedalism",
    "domain": "science",
    "location": "global",
    "published": "Tue, 29 Jul 2025 01:17:01 EDT",
    "source": "ScienceDaily",
    "sources": [
      "ScienceDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "In the quest to understand how and why early humans started walking on two legs, scientists are now looking to chimpanzees living in dry, open savannah-like environments for clues. A new study reveals that these chimpanzees, despite the open terrain, still frequently climb trees to gather fruit and "
    ],
    "image_url": "",
    "titles": [
      "Did humans learn to walk in trees?"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.942,
      "consensus": 0.393,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.42,
    "summary": "Scientists are investigating why early humans began walking on two legs by studying chimpanzees in savannah-like environments. A recent study found that, although living in open areas, these chimpanzees often climb trees to collect fruit, suggesting tree climbing could have influenced the development of bipedalism.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story is constructive as it provides a deeper understanding of early human evolution, a topic of interest to many readers. It reports on a new study that offers a different perspective on why early humans began walking on two legs, contributing to the ongoing academic discussion on human evolution."
  },
  {
    "title": "Waymo taps Avis to manage robotaxi fleet in Dallas",
    "domain": "technology",
    "location": "global",
    "published": "Mon, 28 Jul 2025 23:42:19 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Avis will handle general depot operations, including charging and maintaining the vehicles. Users will be able to hail a robotaxi through the Waymo app."
    ],
    "image_url": "",
    "titles": [
      "Waymo taps Avis to manage robotaxi fleet in Dallas"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.838,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.419,
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story clearly highlights progress and innovation in the field of autonomous vehicles, specifically in the management of robotaxi fleets. It also provides useful information about the partnership between Waymo and Avis, which could influence decision-making for stakeholders.",
    "image": {
      "src": "https://upload.wikimedia.org/wikipedia/commons/7/75/Waymo_Jaguar_I-Pace_in_San_Francisco_2023_dllu.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/1fdd164b-57f3-4fc5-8d67-04c09ba5a8b1/thumb/",
      "alt": "Waymo Jaguar I-Pace in San Francisco 2023 dllu",
      "credit": "Dllu / CC BY 4.0",
      "license": "by",
      "license_version": "4.0",
      "license_url": "https://creativecommons.org/licenses/by/4.0/",
      "provider": "wikimedia",
      "source": "Openverse"
    }
  },
  {
    "title": "India-Made Smartphones Comprise 44% of US Imports, Up from 13%",
    "domain": "business",
    "location": "national",
    "published": "Tue, 29 Jul 2025 06:45:30 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Smartphones assembled in India accounted for 44% of U.S. imports in the second quarter, a significant increase from just 13% in the same period last year."
    ],
    "image_url": "",
    "titles": [
      "India overtakes China in smartphone exports to the U.S. as manufacturing jumps 240%, report shows"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.971,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.416,
    "summary": "In the second quarter, smartphones assembled in India made up 44% of U.S. imports, marking a substantial rise from 13% in the corresponding period the previous year. This indicates a significant shift in the sourcing of smartphones imported into the U.S.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful data about a significant trend in the sourcing of smartphones imported into the U.S. This information could be useful to investors, businesses, and policymakers. However, it does not provide much depth or insight into the reasons for this shift or its potential impacts.",
    "image": {
      "src": "https://live.staticflickr.com/3851/14550194826_d8d71cbf19_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/86f94368-cc7c-4fa0-9ba4-5410d1262344/thumb/",
      "alt": "Rajasthan India",
      "credit": "Nick Kenrick.. / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Stellantis Optimistic About Slow Recovery in Coming Months",
    "domain": "business",
    "location": "national",
    "published": "Tue, 29 Jul 2025 07:54:57 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Auto giant Stellantis has touted a gradual recovery over the coming months."
    ],
    "image_url": "",
    "titles": [
      "Jeep maker Stellantis reinstates financial guidance but flags 'tough decisions' ahead"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.995,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.411,
    "summary": "Auto company Stellantis has expressed optimism for a slow recovery in the upcoming months. The company anticipates a positive trajectory in its operations and financial performance.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness about the company's outlook, but it lacks depth or insight. It does not provide detailed information about why the company is optimistic, what specific actions it is taking, or what challenges it might face. Therefore, it has limited usefulness for readers.",
    "image": {
      "src": "https://live.staticflickr.com/5176/5396203869_2d1f032d3d_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/45f94d1c-fe6b-4a94-8cea-414c21bfca00/thumb/",
      "alt": "Pumpkin Spice",
      "credit": "Brian Rinker Creative / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Crypto Market Surges as Firms Mimic MicroStrategy's Digital Asset Investments",
    "domain": "business",
    "location": "national",
    "published": "Mon, 28 Jul 2025 20:39:14 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "The crypto market's bullishness may be tipping into speculative frenzy, if the latest MicroStrategy-style copycat is any indication."
    ],
    "image_url": "",
    "titles": [
      "MicroStrategy copycats are getting out of control as Canadian vape company joins fray"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.787,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.409,
    "summary": "The crypto market is showing signs of a speculative frenzy as more companies follow MicroStrategy's lead in investing in cryptocurrencies. This trend suggests a growing interest in digital assets beyond traditional investors.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story clearly highlights progress and provides empowering knowledge about the growing interest in digital assets among companies. It gives the reader actionable insights and a deeper understanding of the current trends in the crypto market. It also increases clarity around the impacts of MicroStrategy's investment strategy.",
    "image": {
      "src": "https://live.staticflickr.com/7368/9252380895_f765d64bd4_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/9340ae91-3285-4bdc-a0b8-c778a483dc97/thumb/",
      "alt": "Cisco Presentation – MicroStrategy World 2013 Barcelona – Mobile",
      "credit": "microstrategy / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Atalanta Eyes Everton's Beto to Boost Attack After Europa Win",
    "domain": "sports",
    "location": "national",
    "published": "Tue, 29 Jul 2025 07:22:00 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Everton striker Beto is a target for Serie A side Atalanta as they look to bolster their attack ahead of next season, per La Gazzetta dello Sport (via TuttoMercatoWeb).The 2023/24 Europa League winner..."
    ],
    "image_url": "",
    "titles": [
      "Atalanta eye move for Everton striker Beto"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.983,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.408,
    "summary": "Atalanta, a Serie A team, is interested in signing Everton striker Beto to strengthen their attack for the upcoming season. The move comes after Atalanta won the 2023/24 Europa League. The current status of the potential transfer remains uncertain.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about Atalanta's interest in a new player to strengthen their team. However, it doesn't provide any deeper insights or actionable information for the reader, nor does it report on any solutions, improvements, or innovations. It does not increase clarity around systems, causes, trends, or impacts that matter.",
    "image": {
      "src": "https://live.staticflickr.com/65535/46819886975_bc080d6652_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/52880942-fe2b-43bb-a656-6f57b97a5ec5/thumb/",
      "alt": "Beto O'Rourke speaks at campaign rally",
      "credit": "jdlasica / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Climate Change Linked to Early Hominins' Shift to Bipedalism",
    "domain": "science",
    "location": "global",
    "published": "Tue, 29 Jul 2025 00:00:01 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "It's hard to tell when—and why—our ancestors got down from trees and started walking on two legs. Many early hominins capable of bipedal walking were also well-adapted for climbing, and we lack fossil evidence from a key period when climate change turned forests into open, dry woodland called savann"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/how-much-time-did-our.jpg",
    "titles": [
      "How much time did our ancestors spend up trees? Savanna-living chimpanzees might help us find out"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.917,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.405,
    "summary": "Scientists are studying the transition of early hominins from tree-dwelling to bipedal walking, a shift believed to be influenced by climate change that transformed forests into savannas. This period lacks sufficient fossil evidence, making it challenging to pinpoint the exact timing and reasons for this evolutionary change. Researchers note that many early hominins were adapted for both climbing and walking on two legs, indicating a gradual adaptation to new environments.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story is constructive as it provides a deeper understanding of the potential impacts of climate change on human evolution. However, it does not offer actionable insights or report on solutions or improvements, which limits its score.",
    "image": {
      "src": "https://live.staticflickr.com/8445/7999697331_322ca0c223_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/05163215-aa42-4007-8ab8-d1d7afe42554/thumb/",
      "alt": "Ban Fracking and shale gas in Europe before it is too late!",
      "credit": "greensefa / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Harmonic, the Robinhood CEO’s AI math startup, launches an AI chatbot app",
    "domain": "technology",
    "location": "global",
    "published": "Mon, 28 Jul 2025 22:27:18 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "The chatbot app, which is available in beta on iOS and Android, lets users access its AI model, Aristotle."
    ],
    "image_url": "",
    "titles": [
      "Harmonic, the Robinhood CEO’s AI math startup, launches an AI chatbot app"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.817,
      "consensus": 0.393,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.402,
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story informs readers about a new AI chatbot app, providing useful information about a new product in the tech industry. However, it doesn't highlight any specific progress or solutions related to the app, or provide a deeper understanding of how the app could impact users or the industry as a whole.",
    "image": {
      "src": "https://live.staticflickr.com/8044/8138991770_007d101bd7_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/8b01faf1-bbb4-47bf-9ff5-605cfebf0ef2/thumb/",
      "alt": "Harmon Yard on MNR's Hudson Line 8:45 am",
      "credit": "MTAPhotos / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Canada Sees 82% Surge in Hate Crimes Against Jews in 2023",
    "domain": "science",
    "location": "global",
    "published": "Mon, 28 Jul 2025 20:50:01 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "According to Statistics Canada, police-reported hate crimes against Jews rose by 82% in 2023."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2022/antisemitism.jpg",
    "titles": [
      "How to improve university EDI policies so they address Jewish identity and antisemitism"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.858,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.4,
    "summary": "Statistics Canada reported an 82% increase in police-reported hate crimes against Jews in 2023. The rise in incidents highlights a concerning trend of growing anti-Semitic behavior. Efforts to address and combat hate crimes are crucial to ensure the safety and well-being of affected communities.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "While the story highlights a negative trend (increase in hate crimes), it does increase awareness about a serious issue and emphasizes the need for solutions (combating hate crimes). However, it lacks specific details on what those solutions might be or how they are being implemented.",
    "image": {
      "src": "https://live.staticflickr.com/3661/3359196778_1f5f782af8_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/a87fe7ec-7308-4f67-81be-0b9a63c56bf3/thumb/",
      "alt": "niagara9",
      "credit": "MATAVI@ / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Meta pirated and seeded porn for years to train AI, lawsuit says",
    "domain": "technology",
    "location": "global",
    "published": "Mon, 28 Jul 2025 16:32:38 +0000",
    "source": "Ars Technica",
    "sources": [
      "Ars Technica"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Lawsuit: Meta may have seeded porn to minors while hiding piracy for AI training."
    ],
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/07/GettyImages-1264284948-1152x648.jpg",
    "titles": [
      "Meta pirated and seeded porn for years to train AI, lawsuit says"
    ],
    "score_components": {
      "magnitude": 0.189,
      "recency": 0.722,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.389,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about a lawsuit against Meta, but it lacks depth or insight into the implications of the lawsuit or the ethical issues surrounding the use of pirated content to train AI. It doesn't report on any solutions or attempts to address the problem.",
    "image": {
      "src": "https://live.staticflickr.com/2839/11798601374_b55a5b89e8_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/6519e89a-2e88-4ce4-918c-ea7ed901497b/thumb/",
      "alt": "Meta Photo",
      "credit": "dhaun / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Trump caving on Nvidia H20 export curbs may disrupt his bigger trade war",
    "domain": "technology",
    "location": "global",
    "published": "Mon, 28 Jul 2025 21:04:07 +0000",
    "source": "Ars Technica",
    "sources": [
      "Ars Technica"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "China’s frontier AI will be fueled by Nvidia H20 chips, experts warn Trump."
    ],
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/07/GettyImages-2212801534-1024x648.jpg",
    "titles": [
      "Trump caving on Nvidia H20 export curbs may disrupt his bigger trade war"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.793,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.388,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the potential impact of a specific policy decision on a broader trade war. However, without more context or analysis, it doesn't fully clarify the systems, causes, or impacts involved, nor does it report on solutions or improvements.",
    "image": {
      "src": "https://live.staticflickr.com/815/40567174204_f340b664a7_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/193cb26a-47b0-4ceb-90ff-c10ce8c0ee1c/thumb/",
      "alt": "trump",
      "credit": "Book Catalog / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "The controversial legal tactic The Trump Organization is using to take down fake merch",
    "domain": "technology",
    "location": "global",
    "published": "2025-07-28T18:17:05-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Unauthorized merch promoting Donald Trump - from hats and mugs to signs and T-shirts - is everywhere online. Go to a Trump rally or other MAGA political event and you're bound to find people hawking their DIY Trump wares. The Trump Organization apparently isn't too pleased. A lawsuit filed last week"
    ],
    "image_url": "",
    "titles": [
      "The controversial legal tactic The Trump Organization is using to take down fake merch"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.814,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.382,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about the legal tactics used by The Trump Organization. However, it does not provide much depth or insight into the implications, nor does it offer actionable insights or solutions.",
    "image": {
      "src": "https://live.staticflickr.com/7891/46408079285_2c69615d87.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/8653d6bf-9e1e-48c7-b924-14826c7b4b27/thumb/",
      "alt": "cohen demanda a trump..., la Trump Organization se negó a pagarle una vez conoció que el exabogado iba a cooperar con la investigación del fiscal especial Robert Mueller sobre los vínculos del presidente con Rusia.",
      "credit": "",
      "license": "cc0",
      "license_version": "1.0",
      "license_url": "https://creativecommons.org/publicdomain/zero/1.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Asian Stocks Decline, Specific Causes and Impacts Unclear",
    "domain": "business",
    "location": "global",
    "published": "Tue, 29 Jul 2025 07:19:19 GMT",
    "source": "Bloomberg",
    "sources": [
      "Bloomberg"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMilAFBVV95cUxOMUVEbU16cnd0dkZkUkUwM3kyYldwN1dKTE0tTWlDTEx3YVBIZmlOaDdFcEdRdDFLQkFMOVVfalFCakpfSi1MOGJQVWRuWDU4Vlc5V3lFSTEtOFJOMG1WUkxHdmE4azQzcDBENlpvanJ4RmRYMUcyWDhybHRKa21MMHJyUEg2OW5oQkUyVWhGTzlvRTRH?oc=5\" target=\"_blank\">Asian Stocks Seen Lower as "
    ],
    "image_url": "",
    "titles": [
      "Asian Stocks Seen Lower as Tariff Sentiment Cools: Markets Wrap - Bloomberg"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.982,
      "consensus": 0.393,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.378,
    "summary": "Asian stocks were observed to decline, as indicated by the provided financial news link. The current status or outcome of this trend was not detailed in the provided content, leaving the specific reasons for the downturn or its potential impact on global markets unaddressed.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "This story provides minimal awareness about a decline in Asian stocks but does not offer any deeper understanding or insight. It does not explain the causes of the decline, its potential impacts, or any attempts to address the issue.",
    "image": {
      "src": "https://live.staticflickr.com/4027/4426610518_3c086ff470_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/7ee0223c-d012-4c0e-abd7-fa0696d29a85/thumb/",
      "alt": "police trooper writing a ticket",
      "credit": "woodleywonderworks / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "AI data analyst startup Julius nabs $10M seed round",
    "domain": "technology",
    "location": "global",
    "published": "Tue, 29 Jul 2025 00:42:48 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Julius is designed to act like a data scientist by analyzing and visualizing extensive datasets and then performing predictive modeling from natural language prompts."
    ],
    "image_url": "",
    "titles": [
      "AI data analyst startup Julius nabs $10M seed round"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.856,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.37,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "The story provides basic awareness about a funding event for a startup, but without a summary or additional context, it offers minimal depth or insight into the implications or significance of this event.",
    "image": {
      "src": "https://live.staticflickr.com/7594/28799579322_f9e3ce8511_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/b52e7dfb-5b36-417b-8387-f8d7fd8c07e3/thumb/",
      "alt": "Intelligence Inside: the future of AI and computation",
      "credit": "jurvetson / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  },
  {
    "title": "Sony calls Tencent game &#8216;slavish clone&#8217; of Horizon in new lawsuit",
    "domain": "technology",
    "location": "global",
    "published": "2025-07-28T17:26:31-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Sony is suing Tencent to attempt to stop the release of Light of Motiram, which Sony describes as a “slavish clone” of its Horizon series of games, as reported by Reuters. Light of Motiram was announced last year with a trailer featuring an aesthetic that’s quite similar to the Horizon franchise — i"
    ],
    "image_url": "",
    "titles": [
      "Sony calls Tencent game &#8216;slavish clone&#8217; of Horizon in new lawsuit"
    ],
    "score_components": {
      "magnitude": 0.169,
      "recency": 0.8,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.367,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "",
    "image": {
      "src": "https://live.staticflickr.com/8534/8676824305_1ebcf5a959_b.jpg",
      "thumbnail": "https://api.openverse.org/v1/images/1cb7453d-1993-47b9-a790-430c7a46bde9/thumb/",
      "alt": "Sony RX1 20",
      "credit": "Janitors / CC BY 2.0",
      "license": "by",
      "license_version": "2.0",
      "license_url": "https://creativecommons.org/licenses/by/2.0/",
      "provider": "flickr",
      "source": "Openverse"
    }
  }
]