[
  {
    "title": "'Mass casualty incident' as car driven into Vancouver street festival",
    "domain": "general",
    "location": "global",
    "published": "Sun, 27 Apr 2025 07:38:58 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A number of people have been killed and injured in an incident at a street festival in Vancouver, police say."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/8f07/live/a4ac6810-2330-11f0-9540-bb15794d6274.jpg",
    "titles": [
      "'Mass casualty incident' as car driven into Vancouver street festival"
    ],
    "summary": "Several individuals were killed and others injured during an incident at a street festival in Vancouver, according to police statements. Authorities are currently investigating the situation; however, specific details about the cause of the incident and the exact number of casualties have not been disclosed yet.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story raises awareness about a tragic incident, but it doesn't offer much depth or insight into the cause, the context, or the implications. It also doesn't provide actionable insights or report on solutions or improvements.",
    "score_components": {
      "magnitude": 0.05,
      "recency": 0.995,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.444,
    "normalized_score": 6.17
  },
  {
    "title": "Machado Garry defeats Prates in UFC Fight Night welterweight bout",
    "domain": "general",
    "location": "global",
    "published": "Sun, 27 Apr 2025 07:25:27 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Ian Machado Garry beat Carlos Prates in a highly anticipated UFC welterweight main event in Kansas City."
    ],
    "image_url": "",
    "titles": [
      "Machado Garry defeats Prates in UFC Fight Night welterweight bout"
    ],
    "summary": "Ian Machado Garry won against Carlos Prates in the UFC welterweight main event held in Kansas City. This victory in the highly anticipated match adds to Garry's successes in the UFC welterweight division.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "While this story informs readers about the outcome of a specific sporting event, it doesn't provide much depth or insight beyond that. It doesn't contribute to the reader's understanding or decision-making, nor does it report on improvements, innovations, or attempts to solve problems.",
    "score_components": {
      "magnitude": 0.05,
      "recency": 0.991,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.443,
    "normalized_score": 6.1
  },
  {
    "title": "Huge blast at key Iranian port kills 25 and injures 800",
    "domain": "general",
    "location": "global",
    "published": "Sun, 27 Apr 2025 07:18:30 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "One maritime risk firm says it believes the affected containers held solid fuel for use in ballistic missiles."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/1955/live/72ae71d0-2292-11f0-9060-674316cb3a1f.png",
    "titles": [
      "Huge blast at key Iranian port kills 25 and injures 800"
    ],
    "summary": "A maritime risk firm has reported that the containers involved in a recent incident were carrying solid fuel intended for ballistic missiles. This information highlights the nature of the cargo and its potential application in missile technology.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful context about the nature of the cargo involved in the incident, which contributes to the reader's understanding of the potential implications. However, it doesn't report on solutions, improvements, or attempts to solve the problem, and it doesn't provide actionable insights.",
    "score_components": {
      "magnitude": 0.05,
      "recency": 0.99,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.472,
    "normalized_score": 7.99
  },
  {
    "title": "Week in Pictures: From Pope Francis funeral to ‘massive’ blast in Iran",
    "domain": "general",
    "location": "global",
    "published": "Sun, 27 Apr 2025 07:12:55 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A roundup of some of last week’s major events."
    ],
    "image_url": "",
    "titles": [
      "Week in Pictures: From Pope Francis funeral to ‘massive’ blast in Iran"
    ],
    "summary": "Last week's major events included significant global occurrences. Specific details on the events were not provided, making it impossible to summarize specific outcomes or statuses. For accurate and informative summaries, please provide details or topics of the events in question.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers basic awareness of global events but lacks depth or insight. Without specific details on the events, readers cannot gain a deeper understanding or actionable insights.",
    "score_components": {
      "magnitude": 0.05,
      "recency": 0.989,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.442,
    "normalized_score": 6.04
  },
  {
    "title": "Curry, Warriors defeat Rockets in Game 3 with injured Butler on sidelines",
    "domain": "general",
    "location": "global",
    "published": "Sun, 27 Apr 2025 06:18:26 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Stephen Curry explodes for 36 points with Jimmy Butler sidelined as Warriors take 2-1 series lead over Houston Rockets."
    ],
    "image_url": "",
    "titles": [
      "Curry, Warriors defeat Rockets in Game 3 with injured Butler on sidelines"
    ],
    "summary": "Stephen Curry scored 36 points in a game where Jimmy Butler was absent, leading the Golden State Warriors to a victory over the Houston Rockets. This win gives the Warriors a 2-1 lead in the series.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "While this story provides an update on a sports event, it doesn't offer much in terms of usefulness or progress. It does not provide insights that could help readers understand the game or its implications better. However, it does provide basic awareness of the event.",
    "score_components": {
      "magnitude": 0.05,
      "recency": 0.976,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.459,
    "normalized_score": 7.14
  },
  {
    "title": "See it: New Commanders CB Trey Amos celebrates being picked in the NFL draft",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 27 Apr 2025 07:50:17 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Watch Ole Miss CB Trey Amos celebrate with family after the Washington Commanders picked him in the NFL draft."
    ],
    "image_url": "",
    "titles": [
      "See it: New Commanders CB Trey Amos celebrates being picked in the NFL draft"
    ],
    "summary": "Ole Miss cornerback Trey Amos was selected by the Washington Commanders in the NFL draft. Following his selection, Amos celebrated the significant milestone with his family. The event was captured on video, showcasing the joy and excitement of Amos and his loved ones upon receiving the news of his draft pick.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about a specific event in the NFL draft. It gives readers a glimpse into the personal experience of a player being drafted, which can enhance understanding of the process. However, it doesn't report on solutions, improvements, or innovations, nor does it increase clarity around systems, causes, trends, or impacts that matter.",
    "score_components": {
      "magnitude": 0.0,
      "recency": 0.997,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.379,
    "normalized_score": 1.95
  },
  {
    "title": "Celtic latest & Ferguson warning to Rangers - gossip",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 27 Apr 2025 07:48:46 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Reaction to Celtic's title win at Tannadice as Rangers interim head coach warns his players."
    ],
    "image_url": "",
    "titles": [
      "Celtic latest & Ferguson warning to Rangers - gossip"
    ],
    "summary": "Celtic secured a title win at Tannadice, leading to various reactions. Following this victory, Rangers' interim head coach issued a warning to his players, emphasizing the need for improvement. This event marks a significant moment in the season, highlighting Celtic's achievement and prompting reflection within the Rangers team.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story provides basic awareness of the recent developments in the Celtic team and the Rangers' response. However, it lacks depth and insight into the implications of these developments for the teams and the sport overall.",
    "score_components": {
      "magnitude": 0.0,
      "recency": 0.997,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.369,
    "normalized_score": 1.3
  },
  {
    "title": "Patriots draft hulking tackle in Round 7 with impressive 40-yard dash time",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 27 Apr 2025 07:46:19 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Patriots drafted another tackle in the seventh round."
    ],
    "image_url": "",
    "titles": [
      "Patriots draft hulking tackle in Round 7 with impressive 40-yard dash time"
    ],
    "summary": "The New England Patriots have added to their roster by selecting a tackle in the seventh round of the draft. This move aims to strengthen their offensive line.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "The story offers basic awareness of the Patriots' decision to draft a new player. However, it doesn't provide any insights into the player's potential impact on the team or the reasoning behind the Patriots' decision.",
    "score_components": {
      "magnitude": 0.0,
      "recency": 0.996,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.349,
    "normalized_score": 0.0
  },
  {
    "title": "Boston Red Sox’ Alex Cora: Tanner Houck pitched ‘really good’ after first inning",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 27 Apr 2025 07:46:19 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Tanner Houck blew a 3-0 lead in the first inning but manager Alex Cora said &quot;There were a lot of positives.&quot;"
    ],
    "image_url": "",
    "titles": [
      "Boston Red Sox’ Alex Cora: Tanner Houck pitched ‘really good’ after first inning"
    ],
    "summary": "Tanner Houck, a pitcher, surrendered a 3-0 lead during the first inning of a game. Despite this setback, his manager, Alex Cora, highlighted that there were numerous positive aspects to Houck's performance.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful context about Tanner Houck's performance, highlighting the positive aspects despite an initial setback. However, it doesn't provide insights into how this performance might affect future games or strategies.",
    "score_components": {
      "magnitude": 0.0,
      "recency": 0.996,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.379,
    "normalized_score": 1.95
  },
  {
    "title": "Boston Celtics injury report: 2 starters added for Game 4 vs. Magic Sunday",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 27 Apr 2025 07:46:19 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Celtics will be without at least one starter for Sunday's game against the Magic."
    ],
    "image_url": "",
    "titles": [
      "Boston Celtics injury report: 2 starters added for Game 4 vs. Magic Sunday"
    ],
    "summary": "The Boston Celtics have announced that they will be missing at least one of their starting players for the upcoming game against the Orlando Magic on Sunday. The specific player or reason for the absence has not been disclosed.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about the absence of some players in the upcoming game. However, it doesn't provide deeper insights or context, such as the potential impact on the team's performance, strategies they might employ, or the implications for fans and bettors.",
    "score_components": {
      "magnitude": 0.0,
      "recency": 0.996,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.349,
    "normalized_score": 0.0
  },
  {
    "title": "Trade war hits foreign companies in China with double tariffs",
    "domain": "business",
    "location": "global",
    "published": "Sun, 27 Apr 2025 04:00:03 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Many manufacturers are exposed to paying duties on imports as well as exports"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F6a09f752-0bf1-4714-b715-50ec72f5c35b.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Trade war hits foreign companies in China with double tariffs"
    ],
    "summary": "Manufacturers around the globe are facing financial pressures due to duties imposed on both their imported materials and exported goods. This situation affects their cost structures and international competitiveness.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The story informs readers about the financial pressures faced by manufacturers due to trade wars. It provides useful context about the impact on cost structures and international competitiveness. However, it doesn't report on any solutions or attempts to mitigate these challenges.",
    "score_components": {
      "magnitude": 0.09,
      "recency": 0.944,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.493,
    "normalized_score": 9.35
  },
  {
    "title": "Vanguard rules out China in big international push",
    "domain": "business",
    "location": "global",
    "published": "Sun, 27 Apr 2025 04:00:03 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Second-largest asset manager has its sights set on UK, Europe, Canada, Latin America and Australia instead"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Fe9e9edea-0dc0-41c4-8ec8-5511ae243f5e.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Vanguard rules out China in big international push"
    ],
    "summary": "The second-largest asset manager has decided to expand its operations into the UK, Europe, Canada, Latin America, and Australia. This strategic move indicates the company's focus on international growth and diversification of its portfolio.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story clearly outlines Vanguard's strategic decision to expand into various international markets, providing useful insights for investors. It also indirectly highlights the company's solution to diversify its portfolio and enhance its growth, which can be empowering knowledge for readers.",
    "score_components": {
      "magnitude": 0.07,
      "recency": 0.944,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.497,
    "normalized_score": 9.61
  },
  {
    "title": "Europe’s far right at odds over Trump tariffs",
    "domain": "business",
    "location": "global",
    "published": "Sun, 27 Apr 2025 04:00:03 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Leaders of Alternative for Germany and other nationalist parties are split in their response to US protectionism"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F67acd892-6bd4-48e9-a42e-5879842347f2.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Europe’s far right at odds over Trump tariffs"
    ],
    "summary": "Leaders of the Alternative for Germany (AfD) and other nationalist parties have shown differing opinions on the US's protectionist policies. The split reflects varying viewpoints within these groups on how to respond to the United States' economic stance.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides a deeper understanding of the differing opinions within Europe's far-right parties regarding the US's protectionist policies. However, it does not offer actionable insights or report on solutions to the issue.",
    "score_components": {
      "magnitude": 0.09,
      "recency": 0.944,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.473,
    "normalized_score": 8.05
  },
  {
    "title": "Broken Justice: how Europe let its courts decay",
    "domain": "business",
    "location": "global",
    "published": "Sun, 27 Apr 2025 04:00:03 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Underfunding of the continent’s justice systems is a threat to democracy, senior lawyers warn"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Fca79606b-55d7-4caf-baf4-27d4299e2683.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Broken Justice: how Europe let its courts decay"
    ],
    "summary": "Senior lawyers have issued a warning that the underfunding of justice systems across the continent poses a significant threat to democracy. They argue that insufficient financial resources undermine the ability of these systems to function effectively, potentially compromising the rule of law and democratic principles.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story raises awareness about the underfunding of justice systems across Europe and its potential threat to democracy. However, it does not provide a clear path towards improvement or solutions to the problem.",
    "score_components": {
      "magnitude": 0.05,
      "recency": 0.944,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.451,
    "normalized_score": 6.62
  },
  {
    "title": "Clean energy will be critical to winning the AI race with China",
    "domain": "business",
    "location": "global",
    "published": "Sun, 27 Apr 2025 04:00:03 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Rather than choosing one energy source over another, the US must quickly create the conditions for a mix to meet demand"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F3c6c29b9-dc81-4574-ba8e-108ab3fbd623.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Clean energy will be critical to winning the AI race with China"
    ],
    "summary": "The US is urged to expedite the development of a diverse energy portfolio to satisfy demand. This approach emphasizes the importance of not relying on a single energy source but instead fostering an environment that supports a variety of energy sources to ensure a stable and sufficient supply.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it not only highlights the importance of diversifying energy sources for the US but also suggests a solution to the problem. It empowers readers with the knowledge of the role clean energy can play in the AI race with China.",
    "score_components": {
      "magnitude": 0.09,
      "recency": 0.944,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.503,
    "normalized_score": 10.0
  }
]