[
  {
    "title": "Lancashire v Derbyshire, Somerset v Sussex and more: county cricket – live",
    "domain": "general",
    "location": "global",
    "published": "Sun, 18 May 2025 15:52:01 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "snippets": [
      "<ul><li>Updates from day three of the latest round of matches</li><li><a href=\"mailto:tanya.aldred.freelance@theguardian.com\">Email Tanya</a> or comment BTL | <a href=\"https://viewer.gutools.co.uk/sport/2016/aug/18/sign-up-to-the-spin\">Sign up for The Spin</a></li></ul><p><strong>At Chester-le-Street,</strong> Durham are quickly catching-up Notts at a game which which surely come to an end tomorrow with handshakes at 5pm. Durham 353-4, Emilio Gay 85 not out.</p><p>It’s the turn of Jordan Clark and Nathan Smith to smite Yorkshire around The Oval, <strong>Surrey 419-7, a lead of 164.</strong></p> <a href=\"https://www.theguardian.com/sport/live/2025/may/18/lancashire-v-derbyshire-somerset-v-sussex-and-more-county-cricket-live\">Continue reading...</a>"
    ],
    "image_url": "https://i.guim.co.uk/img/media/d5844505be2417abac937c33472630a2344ff48a/323_0_6880_5504/master/6880.jpg?width=140&quality=85&auto=format&fit=max&s=cadb3a0a98e6a2b0c38799e056975905",
    "titles": [
      "Lancashire v Derbyshire, Somerset v Sussex and more: county cricket – live"
    ],
    "summary": "On day three of the latest cricket matches, Durham is nearing Nottinghamshire's score, with expectations of the game concluding with handshakes at 5pm tomorrow. Durham's score stands at 353-4, with Emilio Gay not out at 85. Meanwhile, Surrey has built a lead of 164 runs over Yorkshire at The Oval, reaching 419-7, thanks to performances by Jordan Clark and Nathan Smith.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about the ongoing cricket matches but does not offer much depth or insight. It does not contribute to the reader's understanding or decision-making, nor does it increase clarity around systems, causes, trends, or impacts that matter.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.997,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.545,
    "normalized_score": 4.19
  },
  {
    "title": "‘Beyond the crash’: TV series on paralyzed Humboldt Bronco player set to air",
    "domain": "general",
    "location": "national",
    "published": "Sun, 18 May 2025 15:50:44 +0000",
    "source": "Global News",
    "sources": [
      "Global News"
    ],
    "snippets": [
      "A film crew with Regina-based Prairie Cat Productions followed Straschnitzki for eight months and created a six-part series called \"We Were Broncos.\""
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/05/fcb4cd4f79c3aae7d5d5a03a8400cb6a976413b22691fd2e0a3a51ffa01c85ec.jpg?quality=85&strip=all",
    "titles": [
      "‘Beyond the crash’: TV series on paralyzed Humboldt Bronco player set to air"
    ],
    "summary": "A Regina-based film crew from Prairie Cat Productions documented the journey of Straschnitzki over eight months, resulting in a six-part series titled \"We Were Broncos.\" The series provides an in-depth look into Straschnitzki's experiences, showcasing the challenges and triumphs faced.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story clearly highlights progress and personal triumph in the face of adversity. It provides an in-depth look into the experiences of a paralyzed player, which could inspire and empower readers. It also increases awareness about the challenges faced by people with disabilities.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.997,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.593,
    "normalized_score": 9.77
  },
  {
    "title": "Arsenal v Newcastle: Premier League – live",
    "domain": "general",
    "location": "global",
    "published": "Sun, 18 May 2025 15:49:03 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "snippets": [
      "<ul><li>All the action from the 4.30pm kick-off at the Emirates</li><li><a href=\"https://www.theguardian.com/football/live\">Live scores</a> | <a href=\"https://www.theguardian.com/football/live/2025/may/18/west-ham-united-v-nottingham-forest-premier-league-live\">West Ham v Nottm Forest – live</a></li></ul><p><strong>2 min </strong>Newcastle have already beaten Arsenal three times this season: 1-0 in the league at St James’, 2-0 in both legs of the Carabao Cup semi-final.</p><p><strong>1 min </strong>Newcastle kick off from right to left as we watch. This could be lots of fun.</p> <a href=\"https://www.theguardian.com/football/live/2025/may/18/arsenal-v-newcastle-premier-league-live\">Continue reading...</a>"
    ],
    "image_url": "https://i.guim.co.uk/img/media/4e1311332c91c79c8f1b1afb13b6c020cd298b91/386_172_4206_3365/master/4206.jpg?width=140&quality=85&auto=format&fit=max&s=8ae671cff85cc5494dafe8be266765c3",
    "titles": [
      "Arsenal v Newcastle: Premier League – live"
    ],
    "summary": "Newcastle United has defeated Arsenal three times this season, with victories of 1-0 in the Premier League at St. James' Park and 2-0 in both legs of the Carabao Cup semi-final. The latest match between the two teams kicked off at 4.30pm at the Emirates Stadium, with Newcastle starting the game from right to left. Live updates and scores for this match, along with others, are available through provided links.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about the Premier League match between Arsenal and Newcastle. However, it lacks depth or insight and does not contribute to the reader's understanding or decision-making. It does not report on solutions, improvements, innovations, or attempts to solve problems.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.996,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.544,
    "normalized_score": 4.07
  },
  {
    "title": "Amid Cease-Fire Talks, Israel Says It Has Expanded Ground Operations in Gaza",
    "domain": "general",
    "location": "global",
    "published": "Sun, 18 May 2025 15:44:20 +0000",
    "source": "New York Times",
    "sources": [
      "New York Times"
    ],
    "snippets": [
      "This new stage of the war is aimed at pressuring Hamas into releasing hostages and ultimately destroying the group or forcing it to surrender."
    ],
    "image_url": "https://static01.nyt.com/images/2025/05/18/multimedia/18int-gaza-wlzc/18int-gaza-wlzc-mediumSquareAt3X.jpg",
    "titles": [
      "Amid Cease-Fire Talks, Israel Says It Has Expanded Ground Operations in Gaza"
    ],
    "summary": "A new phase in the conflict targets Hamas with the goals of compelling the release of hostages and either dismantling the group or compelling its surrender. This strategy marks a significant escalation aimed at decisively addressing the ongoing hostilities.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful context about the ongoing conflict and Israel's strategy, but it doesn't offer any solutions or highlight any progress towards peace. It does, however, increase awareness about the situation.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.995,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.562,
    "normalized_score": 6.16
  },
  {
    "title": "Verstappen beats Norris, Piastri in F1 Emilia-Romagna GP at Imola",
    "domain": "general",
    "location": "global",
    "published": "Sun, 18 May 2025 15:39:14 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera"
    ],
    "snippets": [
      "Reigning world champion wins for the fourth straight time at Imola, defeating McLaren&#039;s Lando Norris and Oscar Piastri."
    ],
    "image_url": "",
    "titles": [
      "Verstappen beats Norris, Piastri in F1 Emilia-Romagna GP at Imola"
    ],
    "summary": "The reigning world champion secured their fourth consecutive victory at Imola, outperforming McLaren drivers Lando Norris and Oscar Piastri. This win reinforces the champion's dominance in the series, showcasing their skill and consistency on the track.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "While the story provides basic awareness about the outcome of the race and the performance of the drivers, it doesn't provide deeper insights or actionable information. The story doesn't report on any innovations or attempts to solve problems.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.994,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.544,
    "normalized_score": 4.07
  },
  {
    "title": "Vardy signs off in style as Leicester see off Ipswich",
    "domain": "sports",
    "location": "global",
    "published": "Sun, 18 May 2025 16:55:00 BST",
    "source": "Sky Sports",
    "sources": [
      "Sky Sports"
    ],
    "snippets": [
      "Jamie Vardy marked his 500th and final Leicester appearance with his 200th Foxes goal as his side beat Ipswich 2-0 at the King Power Stadium."
    ],
    "image_url": "https://e1.365dm.com/25/05/1920x1080/skysports-premier-league-jamie-vardy_6920434.jpg?20250518154318",
    "titles": [
      "Vardy signs off in style as Leicester see off Ipswich"
    ],
    "summary": "Jamie Vardy celebrated his 500th and last game for Leicester City by scoring his 200th goal for the club, contributing to a 2-0 victory over Ipswich at the King Power Stadium. This landmark match marks the end of Vardy's tenure with the Foxes.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "The story offers basic awareness about the match and Vardy's landmark achievement, but it doesn't provide deeper insights or actionable information for the reader. It doesn't report on any improvements, innovations, or attempts to solve problems.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 1.012,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.509,
    "normalized_score": 0.0
  },
  {
    "title": "Rangers confirm Ferguson will not be head coach",
    "domain": "sports",
    "location": "global",
    "published": "Sun, 18 May 2025 16:40:00 BST",
    "source": "Sky Sports",
    "sources": [
      "Sky Sports"
    ],
    "snippets": [
      "Rangers have confirmed Barry Ferguson will not be the club's head coach."
    ],
    "image_url": "https://e2.365dm.com/22/10/1920x1080/skysports-breaking-news-story_5927130.jpg?20221010162109",
    "titles": [
      "Rangers confirm Ferguson will not be head coach"
    ],
    "summary": "Rangers Football Club has officially announced that Barry Ferguson will not be taking the position of head coach for the team. This decision is now confirmed, marking the end of speculation regarding Ferguson's potential appointment to this role.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story provides basic awareness about the staffing decision made by Rangers Football Club. However, it doesn't provide deeper insights into why this decision was made or what it might mean for the team's future strategies or performance.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 1.008,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.528,
    "normalized_score": 2.21
  },
  {
    "title": "Forest hold on to edge West Ham and keep CL dreams alive",
    "domain": "sports",
    "location": "global",
    "published": "Sun, 18 May 2025 16:15:00 BST",
    "source": "Sky Sports",
    "sources": [
      "Sky Sports"
    ],
    "snippets": [
      "Nottingham Forest kept alive their dreams of Champions League football next season after goals in each half from Morgan Gibbs-White and Nikola Milenkovic saw them win 2-1 at West Ham United."
    ],
    "image_url": "https://e2.365dm.com/25/05/1920x1080/skysports-premier-league-west-ham_6920316.jpg?20250518144939",
    "titles": [
      "Forest hold on to edge West Ham and keep CL dreams alive"
    ],
    "summary": "Nottingham Forest secured a 2-1 victory over West Ham United, with goals from Morgan Gibbs-White and Nikola Milenkovic. This win keeps their hopes for Champions League football next season alive.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs readers about the outcome of a specific football match and its implications for Nottingham Forest's hopes for Champions League qualification. It provides useful context but lacks a broader analysis of the team's performance or strategies.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 1.002,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.536,
    "normalized_score": 3.14
  },
  {
    "title": "How many games will Florida football win in 2025? Here's what The Athletic projects",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 18 May 2025 15:52:58 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "snippets": [
      "The Athletic believes that Florida football has a chance to match or even exceed its win totals from last season during the 2025 campaign."
    ],
    "image_url": "",
    "titles": [
      "How many games will Florida football win in 2025? Here's what The Athletic projects"
    ],
    "summary": "The Athletic forecasts that the Florida football team could potentially match or surpass their previous season's win totals in the 2025 season, indicating a positive outlook for the team's performance in the upcoming years.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The story provides useful information about The Athletic's projections for the Florida football team's performance in 2025. This could help readers understand the team's potential for success in the upcoming years. However, it could be more constructive if it also analyzed the factors contributing to this positive outlook.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.997,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.555,
    "normalized_score": 5.35
  },
  {
    "title": "Punjab resumes IPL campaign with 10-run win over Rajasthan ahead of Delhi-Gujarat showdown",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 18 May 2025 15:52:52 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "snippets": [
      "Nehal Wadhera hit 70 off 37 balls to lead Punjab Kings to a 10-run win over Rajasthan Royals as they resumed their Indian Premier League campaign.  Wadhera smashed five sixes and five fours in his second half-century of the season in Punjab's 219-5 in 20 overs on Sunday.  Shashank Singh’s 59 not out off 30 balls also helped the Kings cross the 200-mark."
    ],
    "image_url": "",
    "titles": [
      "Punjab resumes IPL campaign with 10-run win over Rajasthan ahead of Delhi-Gujarat showdown"
    ],
    "summary": "Nehal Wadhera scored 70 from 37 balls, including five sixes and five fours, guiding Punjab Kings to a 10-run victory over Rajasthan Royals in the Indian Premier League. This performance marked his second half-century of the season. Punjab Kings posted a total of 219-5 in 20 overs, aided by Shashank Singh's unbeaten 59 from 30 balls, pushing the team past the 200-run threshold. The match took place on Sunday.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about the outcome of a cricket match in the Indian Premier League. It does not provide deeper understanding, actionable insights, or report on solutions or improvements. It is mainly relevant to cricket fans.",
    "score_components": {
      "magnitude": 0.359,
      "recency": 0.997,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.513,
    "normalized_score": 0.47
  },
  {
    "title": "House Speaker Mike Johnson stresses importance of Memorial Day deadline as 'historic' budget bill heads for revote",
    "domain": "business",
    "location": "national",
    "published": "Sun, 18 May 2025 15:43:42 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "snippets": [
      "Speaker Mike Johnson expressed optimism that the budget bill would reach the House floor before Memorial Day as lawmakers prepare to vote at 10 p.m. Sunday."
    ],
    "image_url": "",
    "titles": [
      "House Speaker Mike Johnson stresses importance of Memorial Day deadline as 'historic' budget bill heads for revote"
    ],
    "summary": "Speaker Mike Johnson is optimistic about the budget bill reaching the House floor before Memorial Day. Lawmakers are scheduled to vote on the bill at 10 p.m. on Sunday.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story informs readers about the upcoming vote on a significant budget bill and highlights the importance of the Memorial Day deadline. It provides some context, but doesn't delve into the contents of the bill or its potential impacts, limiting its usefulness.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.995,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.554,
    "normalized_score": 5.23
  },
  {
    "title": "The market just gave investors a gift. Here's how not to blow it, according to investing experts",
    "domain": "business",
    "location": "national",
    "published": "Sun, 18 May 2025 15:19:38 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "snippets": [
      "With the market recovering all its recent losses, investors over-concentrated in U.S. stocks have a big decision to make about going international."
    ],
    "image_url": "",
    "titles": [
      "The market just gave investors a gift. Here's how not to blow it, according to investing experts"
    ],
    "summary": "As the market rebounds, recovering all its recent losses, investors with a heavy focus on U.S. stocks face a critical choice regarding diversifying their portfolios internationally. This situation underscores the importance of evaluating global investment opportunities.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive as it provides actionable insights for investors regarding diversifying their portfolios. It increases awareness about the importance of considering global investment opportunities and contributes to the reader's decision-making process.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.99,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.583,
    "normalized_score": 8.6
  },
  {
    "title": "Former VP Mike Pence calls the $400 million Qatari jet gift 'a bad idea' that Trump should turn down",
    "domain": "business",
    "location": "national",
    "published": "Sun, 18 May 2025 14:51:40 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "snippets": [
      "Trump's plan to accept the lavish Qatari jumbo jet, a Boeing 747-8, and convert it to be used as Air Force One has sparked fierce controversy."
    ],
    "image_url": "",
    "titles": [
      "Former VP Mike Pence calls the $400 million Qatari jet gift 'a bad idea' that Trump should turn down"
    ],
    "summary": "Donald Trump's proposal to accept and transform a luxurious Qatari Boeing 747-8 into Air Force One has ignited widespread controversy. Critics and supporters alike have voiced strong opinions on the matter, highlighting the debate over the appropriateness and implications of such an acquisition.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about a controversial issue but lacks depth and insight. It does not offer actionable insights or deeper understanding for the reader. It also does not report on solutions, improvements, innovations, or attempts to solve problems.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.983,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.529,
    "normalized_score": 2.33
  },
  {
    "title": "The suspect in an attack on a California fertility clinic believed the world shouldn’t be populated",
    "domain": "business",
    "location": "global",
    "published": "Sun, 18 May 2025 14:30:08 +0000",
    "source": "Fortune",
    "sources": [
      "Fortune"
    ],
    "snippets": [
      "“Make no mistake: This is an intentional act of terrorism,” Akil Davis, the head of the FBI’s Los Angeles field office, told an evening news conference."
    ],
    "image_url": "https://fortune.com/img-assets/wp-content/uploads/2025/05/AP25138068634456-e1747578102186.jpg?w=2048",
    "titles": [
      "The suspect in an attack on a California fertility clinic believed the world shouldn’t be populated"
    ],
    "summary": "The FBI's Los Angeles field office head, Akil Davis, declared at a news conference that a recent incident was a deliberate act of terrorism. This statement indicates that the authorities have identified the event as an intentional attack aimed at causing terror.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "Although the topic is negative, the story provides useful information about a significant event and its potential implications. However, it does not provide a clear sense of progress or solutions, nor does it significantly increase clarity around systems, causes, trends, or impacts.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.978,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.549,
    "normalized_score": 4.65
  },
  {
    "title": "FDA approves Novavax COVID-19 shot but with unusual restrictions",
    "domain": "business",
    "location": "global",
    "published": "Sun, 18 May 2025 14:18:51 +0000",
    "source": "Fortune",
    "sources": [
      "Fortune"
    ],
    "snippets": [
      "The FDA granted approval for use in adults 65 and older – or those 12 to 64 who have at least one health problem that puts them at increased risk from COVID-19."
    ],
    "image_url": "https://fortune.com/img-assets/wp-content/uploads/2025/05/AP25129710166448-e1747577564517.jpg?w=2048",
    "titles": [
      "FDA approves Novavax COVID-19 shot but with unusual restrictions"
    ],
    "summary": "The FDA approved a new COVID-19 treatment for adults aged 65 and older, as well as individuals aged 12 to 64 who have at least one health condition that increases their risk from COVID-19. This approval expands access to additional protective measures for high-risk populations.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive as it provides actionable insights for readers, especially those who are in the high-risk category. It reports on a solution (the approval of a new COVID-19 treatment) and increases awareness about the measures being taken to protect vulnerable populations from the virus.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.976,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.578,
    "normalized_score": 8.02
  },
  {
    "title": "Breakthrough Proton Therapy Wipes Out Rare Cancer With No Side Effects",
    "domain": "science",
    "location": "global",
    "published": "Sun, 18 May 2025 15:52:55 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/breakthrough-proton-therapy-wipes-out-rare-cancer-with-no-side-effects/\" rel=\"nofollow\" title=\"Breakthrough Proton Therapy Wipes Out Rare Cancer With No Side Effects\"><img alt=\"Cancer Cell Biology Illustration\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Cancer-Cell-Biology-Illustration-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>The latest treatment is highly effective at eliminating hard-to-treat cancers while causing minimal side effects. Radiation side effects can be severe for many cancer patients. However, a new approach to delivering radiation has shown promising results in treating a difficult-to-target cancer, with the only reported side effect being mild skin discoloration, even nine months after [...]"
    ],
    "image_url": "",
    "titles": [
      "Breakthrough Proton Therapy Wipes Out Rare Cancer With No Side Effects"
    ],
    "summary": "A new proton therapy has shown high effectiveness in treating rare, hard-to-treat cancers with minimal side effects, according to recent findings. Unlike traditional radiation treatments, which can cause severe side effects, this innovative approach has only led to mild skin discoloration as a reported side effect, even nine months post-treatment. This breakthrough could offer a safer alternative for cancer patients.",
    "constructiveness_score": 1.0,
    "constructiveness_reason": "This story is highly constructive as it reports on a significant medical innovation that could greatly benefit cancer patients. It provides useful information about a new treatment option, and highlights progress in the field of cancer research.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.997,
      "consensus": 0.2,
      "constructiveness": 1.0
    },
    "score": 0.595,
    "normalized_score": 10.0
  },
  {
    "title": "First successful demonstration of quantum error correction of qudits for quantum computers",
    "domain": "science",
    "location": "global",
    "published": "Sun, 18 May 2025 12:00:01 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "snippets": [
      "In the world of quantum computing, the Hilbert space dimension—the measure of the number of quantum states that a quantum computer can access—is a prized possession. Having a larger Hilbert space allows for more complex quantum operations and plays a crucial role in enabling quantum error correction (QEC), essential for protecting quantum information from noise and errors."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/first-successful-exper.jpg",
    "titles": [
      "First successful demonstration of quantum error correction of qudits for quantum computers"
    ],
    "summary": "In quantum computing, the size of the Hilbert space, which indicates the number of quantum states a computer can access, is critical for performing complex operations and crucial for quantum error correction (QEC). QEC is vital for safeguarding quantum information against noise and errors, enhancing the computer's reliability and performance.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides some useful insights into the field of quantum computing, particularly around the concept of quantum error correction. However, it may not be as constructive for readers without a background in this field, as it lacks a broader context or explanation of how this development could impact everyday life.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.943,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.558,
    "normalized_score": 5.7
  },
  {
    "title": "Eco-Friendly Alchemy: Turning Waste Into Silver Using Everyday Oils",
    "domain": "science",
    "location": "global",
    "published": "Sun, 18 May 2025 11:39:18 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/eco-friendly-alchemy-turning-waste-into-silver-using-everyday-oils/\" rel=\"nofollow\" title=\"Eco-Friendly Alchemy: Turning Waste Into Silver Using Everyday Oils\"><img alt=\"Anže Zupanc\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"486\" src=\"https://scitechdaily.com/images/Anze-Zupanc-777x486.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>Silver is becoming harder to mine, but researchers in Finland have found a creative and eco-friendly way to recover it from waste using common fatty acids and hydrogen peroxide. These mild, green solvents not only dissolve silver efficiently but also allow for easy recycling of the acids themselves. The Urgent Need for Silver Recycling Recycling [...]"
    ],
    "image_url": "",
    "titles": [
      "Eco-Friendly Alchemy: Turning Waste Into Silver Using Everyday Oils"
    ],
    "summary": "Researchers in Finland have developed an eco-friendly method to recover silver from waste using common fatty acids and hydrogen peroxide. This innovative technique, which addresses the increasing difficulty of mining silver, efficiently dissolves silver for recovery while allowing for the recycling of the acids used in the process.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it highlights an innovative solution to a significant environmental issue - waste management. It provides useful information about a novel method for silver recovery, and increases awareness about the potential for eco-friendly practices in the mining industry.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.939,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.567,
    "normalized_score": 6.74
  },
  {
    "title": "Researchers Discover “Unusually Well-Preserved” Mummy in Church Crypt",
    "domain": "science",
    "location": "global",
    "published": "Sun, 18 May 2025 11:14:23 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/researchers-discover-unusually-well-preserved-mummy-in-church-crypt/\" rel=\"nofollow\" title=\"Researchers Discover “Unusually Well-Preserved” Mummy in Church Crypt\"><img alt=\"The ‘Air Dried Chaplain’\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"437\" src=\"https://scitechdaily.com/images/The-‘Air-Dried-Chaplain-777x437.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>Researchers discovered a centuries-old mummy in Austria that was exceptionally well preserved, likely due to a previously undocumented embalming technique involving wood chips, twigs, fabric, and zinc chloride. For centuries, cultures around the world have practiced embalming, often for religious purposes. While embalming methods vary widely, not all have been equally studied. In a first-of-its-kind [...]"
    ],
    "image_url": "",
    "titles": [
      "Researchers Discover “Unusually Well-Preserved” Mummy in Church Crypt"
    ],
    "summary": "Researchers in Austria found a centuries-old, unusually well-preserved mummy in a church crypt, attributed to a unique embalming technique using wood chips, twigs, fabric, and zinc chloride. This discovery offers new insights into historical embalming practices, highlighting a method not previously documented. This find contributes to the understanding of cultural embalming traditions worldwide.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "The story provides useful insights into historical embalming practices, contributing to the reader's understanding of cultural traditions. However, it doesn't report on solutions, improvements, or innovations, nor does it increase clarity around systems, causes, trends, or impacts that matter.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.933,
      "consensus": 0.2,
      "constructiveness": 0.7
    },
    "score": 0.545,
    "normalized_score": 4.19
  },
  {
    "title": "Earth’s Secret Hydrogen Jackpot: Enough Clean Power for 170,000 Years",
    "domain": "science",
    "location": "global",
    "published": "Sun, 18 May 2025 10:49:58 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/earths-secret-hydrogen-jackpot-enough-clean-power-for-170000-years/\" rel=\"nofollow\" title=\"Earth’s Secret Hydrogen Jackpot: Enough Clean Power for 170,000 Years\"><img alt=\"Hydrogen Energy Clean Energy\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"438\" src=\"https://scitechdaily.com/images/Hydrogen-Energy-Clean-Energy-777x438.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>Natural hydrogen trapped in the Earth’s crust could power humanity for millennia, and without emissions. A new strategy maps out how to find it. Scientists from the University of Oxford, Durham University, and the University of Toronto have identified the key geological ingredients needed to find natural clean hydrogen beneath the Earth’s surface. This natural [...]"
    ],
    "image_url": "",
    "titles": [
      "Earth’s Secret Hydrogen Jackpot: Enough Clean Power for 170,000 Years"
    ],
    "summary": "Scientists from the University of Oxford, Durham University, and the University of Toronto have discovered that natural hydrogen trapped in the Earth's crust could potentially provide clean power for humanity for 170,000 years. They have developed a new strategy for locating this clean hydrogen, identifying the essential geological components necessary for its presence. This breakthrough could lead to a significant source of emission-free energy.",
    "constructiveness_score": 1.0,
    "constructiveness_reason": "This news story is highly constructive. It informs readers about a significant scientific discovery and its potential impact on clean energy solutions. It provides actionable insights (a new strategy for locating clean hydrogen), reports on innovation (a breakthrough in emission-free energy), and increases awareness about a potentially transformative trend in energy production.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.927,
      "consensus": 0.2,
      "constructiveness": 1.0
    },
    "score": 0.574,
    "normalized_score": 7.56
  }
]