[
  {
    "title": "U.S. Government Acquires 10% Stake in Intel Amid CEO Resignation Demand",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Fri, 22 Aug 2025 16:17:14 -0400",
    "source": "NPR",
    "sources": [
      "The Verge",
      "Fortune",
      "TechCrunch",
      "Al Jazeera",
      "CNBC",
      "NPR",
      "Business Insider",
      "MarketWatch",
      "Axios"
    ],
    "domains": [
      "www.theverge.com",
      "www.cnbc.com",
      "www.businessinsider.com",
      "www.npr.org",
      "news.google.com",
      "www.marketwatch.com",
      "fortune.com",
      "www.aljazeera.com",
      "techcrunch.com"
    ],
    "snippets": [
      "The president's highly unusual announcement underscores the Trump administration's desire to take control over U.S. businesses.",
      "The extraordinary development follows a meeting between CEO Lip-Bu Tan and Trump after he called for Tan&#039;s removal.",
      "<a href=\"https://news.google.com/rss/articles/CBMibkFVX3lxTE81Snd4SUZzUnZJdG1yMGpOb2hueS0zeGJsV0NjRmZNQlg1eGVUOWFPRkJUQk5jemJ3U25BakxBYWxibXZXUWpkMjJpTzJ2RjZPVVVjTUhNc3ZJZnVTdjFUeTE2MG9hZVVZZ0lYNkp3?oc=5\" target=\"_blank\">Trump: Intel agreed to sell 10% stake to U.S. government</a>&nbsp;&nbsp;<font c",
      "Commerce Secretary Howard Lutnick said that the U.S. government has taken a 10% stake in chipmaker Intel.",
      "The US investment in Intel is a rare example of the government taking a stake in a private company. INTC closed up on Friday but dipped after hours.",
      "The US is investing $8.9 billion into Intel, but most of the funds come from money that the government was supposed to pay the embattled chipmaker anyway. In an announcement on Friday, Intel said the federal government will fund its investment using the remaining $5.7 billion in grants it hasn’t yet",
      "Intel has agreed to the U.S. government taking a stake in it, President Donald Trump and the company announced Friday, capping an extraordinary chapter between the White House and the computer-chip maker.",
      "Such federal government ownership of a major corporation would mark a dramatic departure from long-standing U.S. policy.",
      "Commerce Secretary Howard Lutnick previously said the U.S. government should receive equity in return for the CHIPS Act cash grants Intel has received."
    ],
    "image_url": "",
    "titles": [
      "Intel will give the U.S. government a 10% stake, Trump says",
      "Trump says US to take 10 percent stake in Intel",
      "Trump: Intel agreed to sell 10% stake to U.S. government - Axios",
      "U.S. government takes 10% stake in Intel, as Trump expands control over private sector",
      "It's official: The US government is taking a nearly 10% stake in Intel",
      "US government takes 10 percent stake in Intel in exchange for money it was already on the hook for",
      "Intel agrees to 10% U.S. government stake. It may not be the last chip company to do so.",
      "US government plans to take a 10% stake in Intel",
      "Trump says Intel agreed to give the government 10% of the chipmaker. ‘We do a lot of deals like that. I’ll do more of them’"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.781,
      "consensus": 1.0,
      "constructiveness": 0.2,
      "proximity": 0.75
    },
    "score": 0.851,
    "summary": "The U.S. government has taken an unprecedented 10% stake in chipmaker Intel, a move announced by President Trump and confirmed by both parties. This decision follows Trump's demand for Intel CEO Lip-Bu Tan to resign due to his connections with Chinese firms. The investment, totaling $8.9 billion, is part of a broader strategy to support the struggling chipmaker and is financed largely through previously allocated government grants. This development marks a significant shift in U.S. policy, as it is rare for the government to take ownership in private corporations. The deal was finalized after ",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: development, support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Lyle Menendez Denied Parole in First Hearing After 1989 Parents' Murder",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 23 Aug 2025 03:45:09 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "ABC News",
      "The Guardian",
      "LA Times",
      "Deutsche Welle"
    ],
    "domains": [
      "www.bbc.com",
      "www.dw.com",
      "www.theguardian.com",
      "www.latimes.com",
      "abcnews.go.com"
    ],
    "snippets": [
      "The hearing stretched for more than 10 hours and examined his violations in prison and the 1989 killings of his parents in their Beverly Hills mansion.",
      "The Menendez brothers were convicted and jailed in the 1989 for murdering their parents in Los Angeles.",
      "Lyle Menendez was denied parole during his first-ever parole hearing on Friday.",
      "<p>Parole board rules against elder Menendez brother, convicted over killing parents in Los Angeles in 1989</p><p>Lyle Menendez was denied parole for his role in the 1989 killings of his parents on Friday, just a day after the California parole board <a href=\"https://www.theguardian.com/us-news/2025",
      "<p>A day after denying release for his younger brother, Erik, a California Parole Board ruled that Lyle Menendez should also remain in prison for gunning down his parents with a shotgun in 1989.</p>"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/1a35/live/afe8a570-7fd0-11f0-893d-33949e3f20bd.jpg",
    "titles": [
      "Lyle Menendez joins brother in being denied parole in parents' LA murder",
      "Lyle Menendez denied parole a day after brother Erik",
      "Lyle Menendez also denied parole, will stay in prison with Erik Menendez",
      "Lyle Menendez denied parole a day after brother Erik’s bid rejected",
      "Lyle Menendez denied parole, will remain in prison along with younger brother Erik"
    ],
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.893,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.808,
    "summary": "Lyle Menendez was denied parole at his first-ever hearing on Friday, following a decision a day prior against his brother, Erik. Both were convicted for the 1989 murder of their parents in their Beverly Hills mansion. The parole board's decision comes after examining Lyle's prison violations and the details of the case during a hearing that lasted over 10 hours.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Canada Exempts Most U.S. Goods from Tariffs, Keeps 25% on Key Metals, Autos",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Fri, 22 Aug 2025 18:14:29 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Financial Times",
      "Al Jazeera",
      "CNBC",
      "Washington Post",
      "New York Times"
    ],
    "domains": [
      "www.cnbc.com",
      "www.washingtonpost.com",
      "www.nytimes.com",
      "www.aljazeera.com",
      "www.ft.com"
    ],
    "snippets": [
      "Prime Minister Mark Carney says most Canadian goods will be exempted from US tariffs while some sectoral duties remain.",
      "Canada announced Friday it was dropping many of its retaliatory tariffs on U.S. goods, though the 25% counter-tariff on autos, steel and aluminum remains.",
      "Prime Minister Mark Carney announces removal of 25% levy on many goods from neighbour",
      "Prime Minister Mark Carney said Canada will lift its tariffs on U.S. goods that comply with a free trade pact but keep tariffs on U.S. steel, aluminum and autos.",
      "Canada’s leader said he would follow the United States in dropping tariffs against American goods covered by the existing free trade agreement."
    ],
    "image_url": "",
    "titles": [
      "Canada to ease most retaliatory tariffs against United States",
      "Canada drops many of its retaliatory tariffs on the U.S.",
      "Canada to drop retaliatory tariffs on billions of dollars’ worth of US products",
      "Canada drops some retaliatory tariffs in bid to restart trade talks",
      "Canada To Drop Some Retaliatory Tariffs on U.S. Products, Carney Says"
    ],
    "score_components": {
      "magnitude": 0.964,
      "recency": 0.748,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.786,
    "summary": "Canada, under Prime Minister Mark Carney, will exempt most U.S. goods from tariffs, aligning with the Canada-United States-Mexico Agreement. However, Canada will maintain a 25% tariff on U.S. steel, aluminum, and autos. This decision follows Canada's move to drop many retaliatory tariffs on U.S. products, while the U.S. grants tariff exemptions for Canadian goods covered by the trade pact.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "I'm sorry, but I didn't receive a summary from you. Could you please provide one",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 22 Aug 2025 19:27:21 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "ABC News",
      "CNBC",
      "Axios",
      "Deutsche Welle"
    ],
    "domains": [
      "www.cnbc.com",
      "news.google.com",
      "www.dw.com",
      "abcnews.go.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Bolton served in Trump's first administration but has since become a fierce critic of the president.",
      "John Bolton, a former security adviser to Donald Trump, has become a vocal critic of the US president. Reports indicate that the search is linked to Bolton's handling of classified documents.",
      "<a href=\"https://news.google.com/rss/articles/CBMijgFBVV95cUxOOFNfbzZXa19VV3cyUVR0UFFQR0JpcEVFTERWeWhLMmRvQmU2cC1sU2pGZWh0SXJnYWtjazYwTFRWRmQteV9nbkU1MVZWeE5ZMk9Yekl6R0pJcUUtNTFfTVhIX2cwSG5rS3JTNVA4MEN3UFlhYTlVUVhkc2tLWm9Id0hCY0JqdUZScXdzZlVn?oc=5\" target=\"_blank\">FBI raids former National Security ",
      "ABC News’ Katherine Faulders says the search stems from federal prosecutors’ belief that Bolton could have classified information in his possession..",
      "FBI Director Kash Patel tweeted “NO ONE is above the law… @FBI agents on mission\" as agents searched the home of ex-Trump advisor John Bolton in Maryland."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/479c/live/a2a12e30-7f87-11f0-9ae6-2781a6562cc1.jpg",
    "titles": [
      "FBI searches home of Trump adviser-turned-critic John Bolton",
      "US: FBI searches home of John Bolton — reports",
      "FBI raids former National Security Adviser John Bolton's home: Reports - Axios",
      "WATCH:  FBI searches home of former Trump admin. national security adviser John Bolton",
      "FBI raids home, office of John Bolton, former Trump national security advisor"
    ],
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.752,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.78,
    "summary": "",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Man Wrongly Deported to El Salvador Returns to U.S. for Trial",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Fri, 22 Aug 2025 16:08:11 -0400",
    "source": "NPR",
    "sources": [
      "Al Jazeera",
      "ABC News",
      "NPR",
      "Forbes"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.npr.org",
      "abcnews.go.com",
      "www.forbes.com"
    ],
    "snippets": [
      "The case of Abrego Garcia, a Maryland man originally from El Salvador, raised basic questions of due process in Trump's crackdown on undocumented immigrants after he was arrested and sent to a maximum security prison in El Salvador, violating a U.S. immigration judge's 2019 order prohibiting his dep",
      "Abrego Garcia will return to family as he awaits trial over alleged human smuggling brought by Trump administration.",
      "The Salvadoran native has been in criminal custody since the federal government brought him back to the U.S. in June to face human smuggling charges.",
      "Abrego Garcia was mistakenly deported in March to El Salvador, triggering a months-long legal battle between his lawyers and the federal government."
    ],
    "image_url": "",
    "titles": [
      "Kilmar Abrego Garcia released from federal custody pending criminal trial",
      "Wrongfully deported Kilmar Abrego Garcia released from Tennessee jail",
      "WATCH:  Kilmar Abrego Garcia released from criminal custody in Tennessee",
      "Kilmar Abrego Garcia Released From Criminal Custody As DHS Reportedly Threatens Deportation"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.778,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.77,
    "summary": "Kilmar Abrego Garcia, originally from El Salvador and living in Maryland, was mistakenly deported to El Salvador in March, despite a U.S. immigration judge's 2019 order against his deportation. After a legal battle, he was brought back to the U.S. in June to face charges of human smuggling, a case brought by the Trump administration. Garcia was released from criminal custody in Tennessee on Friday and will return to his family in Maryland as he awaits trial.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "NBA's Malik Beasley Cleared in Federal Gambling Probe",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sat, 23 Aug 2025 02:07:20 +0000",
    "source": "CBS Sports",
    "sources": [
      "Sportsnet",
      "Sports Illustrated",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "news.google.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Beasley was the latest NBA player investigated for irregular activity on prop bets",
      "<a href=\"https://news.google.com/rss/articles/CBMilwFBVV95cUxQNlJ1WF9UakJuYnFaVmgtNlhrXzN6bTliSlRlUGt6ekdqTmR2U3Q4c3E0cEdlOVlucEpNSXB1UGtlSHlHN2xRVWpJU014SDRwdjRicVB2Q09qS0FlaXpGOV9hRWF5RHVhRHUxVjZISndrckRFS2d0QWg1ZlNXMi1QczE1QWpJS0xNdTZjNzU0T3NTYXcxZ2hr?oc=5\" target=\"_blank\">NBA Free Agent Malik Be",
      "<p>Federal investigators no longer consider NBA free agent Malik Beasley a target in their gambling probe, Beasley&#8217;s attorneys told ESPN.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/08/22/373dbc7e-7341-455e-a003-91ae3ca84e44/beasley.jpg",
    "titles": [
      "Malik Beasley's attorneys say he's no longer target of federal gambling investigation and not charged",
      "NBA Free Agent Malik Beasley Not a Target in Federal Gambling Probe, Attorneys Say - Sports Illustrated",
      "Report: NBA free agent Malik Beasley no longer under investigation for gambling"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.882,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.723,
    "summary": "Malik Beasley, an NBA free agent, is no longer under investigation by the Eastern District of New York for federal gambling, as confirmed by his attorneys to ESPN. This development clears him from the probe into irregular prop bet activities and potentially revitalizes his opportunities in free agency.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Tour Bus Crash in New York Kills 5, Injures Over 40",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sat, 23 Aug 2025 03:45:33 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "The Guardian",
      "Deutsche Welle"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.theguardian.com",
      "www.dw.com"
    ],
    "snippets": [
      "Passengers from China, India, Philippines, the Middle East and US were on board the bus when it crashed at full speed.",
      "The bus rolled over while returning from Niagara Falls. Many of the passengers were Indian, Chinese and Filipino, with police saying some were thrown from the bus.",
      "<p>More than 40 passengers evaluated or treated at hospitals with injuries ranging from head trauma to broken arms and legs</p><p>At least five people, including a child, were killed after a tour bus carrying 51 people crashed in upstate <a href=\"https://www.theguardian.com/us-news/new-york\">New Yor"
    ],
    "image_url": "",
    "titles": [
      "Foreign nationals among 5 killed in New York state tour bus crash",
      "US: 5 killed after New York-bound tourist bus crash",
      "Five people killed, including one child, in New York bus crash"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.912,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.719,
    "summary": "A tour bus carrying 51 passengers from China, India, the Philippines, the Middle East, and the US crashed in upstate New York while returning from Niagara Falls, resulting in at least five fatalities, including a child. Over 40 passengers were evaluated or treated for injuries varying from head trauma to broken limbs. The bus rolled over at full speed, with some passengers being ejected during the incident.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Commanders Trade Brian Robinson Jr. to 49ers for 2026 Sixth-Round Pick",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Fri, 22 Aug 2025 15:22:51 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "www.espn.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Reaction to all of the latest fantasy football news, including the impact of the Robinson trade.",
      "Christian McCaffrey has a new handcuff to draft and stash",
      "<p>The Washington Commanders have traded Brian Robinson Jr., a 2022 third-round pick, to the 49ers in exchange for a 2026 sixth-round pick, ESPN&#8217;s Adam Schefter reported Friday. </p>"
    ],
    "image_url": "",
    "titles": [
      "Fantasy buzz: How does the Commanders' backfield shape up after Robinson trade?",
      "Fantasy Football fallout: Commanders trade Brian Robinson Jr. to the 49ers; here's what to know before drafts",
      "Report: Commanders trade RB Brian Robinson to 49ers"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.766,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.715,
    "summary": "The Washington Commanders have traded running back Brian Robinson Jr. to the San Francisco 49ers. In return, the Commanders will receive a sixth-round pick in the 2026 NFL Draft. This move was reported by ESPN's Adam Schefter. Robinson, who was selected in the third round of the 2022 Draft, will now serve as a backup option for the 49ers, complementing their current running back lineup.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "South Korean Soldiers Fire Warning Shots at North Korean Troops",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sat, 23 Aug 2025 01:21:18 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "The Guardian",
      "Deutsche Welle"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.theguardian.com",
      "www.dw.com"
    ],
    "snippets": [
      "South Korean acknowledges that its soldiers fired warning shots after North Korean troops briefly crossed the border.",
      "Pyongyang has accused Seoul forces of provocation after troops fired during a tense incident along the demarcation line. The claim coincides with joint South Korean-US military drills.",
      "<p>Seoul says military fired warning shots on Tuesday after troops from the North briefly crossed border</p><p>South Korea fired warning shots at North Korean soldiers who briefly crossed the heavily fortified border earlier this week, Seoul said on Saturday, after Pyongyang accused it of a “deliber"
    ],
    "image_url": "",
    "titles": [
      "North Korea accuses South Korean troops of firing warning shots near border",
      "North Korea protests warning shots at border with South",
      "North Korea accuses South Korea of ‘deliberate provocation’ after warning shots fired at soldiers on border"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.868,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.71,
    "summary": "South Korean soldiers fired warning shots at North Korean troops who briefly crossed the heavily fortified border, Seoul confirmed. This incident occurred during a period of joint South Korean-US military drills, leading Pyongyang to accuse Seoul of provocation. The confrontation underscores the ongoing tension along the demarcation line separating the two Koreas.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Announces Tariff Probe on Imported Furniture, Stocks Dip",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Fri, 22 Aug 2025 21:25:57 GMT",
    "source": "Axios",
    "sources": [
      "CNBC",
      "Financial Post",
      "Axios"
    ],
    "domains": [
      "financialpost.com",
      "www.cnbc.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMidkFVX3lxTFAxUDJGRE9TSzhNM25tSXhEck5wTWNySEhhOHp3dVNjbUFTOVM4UnIyTGVjQ2RYcHdhUDZpVklhNlBmRlUwZU5xaE5mTzBhb0E2RHRoY29pelUzSlZEYk93aGZJUVNDTmFmY2ozOGVocklFUmtURHc?oc=5\" target=\"_blank\">Trump threatens heavy furniture tariffs in coming months</a>&nbsp;&n",
      "Stocks for some furniture and home goods companies, including Wayfair, RH and Williams-Sonoma, tumbled after the market close, following Trump's post.",
      "President Donald Trump said the US is conducting a “major Tariff Investigation  on Furniture coming into the United States,” setting the stage for industry-specific levies."
    ],
    "image_url": "",
    "titles": [
      "Trump threatens heavy furniture tariffs in coming months - Axios",
      "Trump says furniture tariffs are coming later this year",
      "Trump Announces Furniture Imports Probe, Setting Up Tariffs"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.783,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.707,
    "summary": "President Donald Trump announced a \"major Tariff Investigation on Furniture coming into the United States,\" indicating potential future tariffs on imported furniture. Following his announcement, stocks for furniture and home goods companies such as Wayfair, RH, and Williams-Sonoma experienced a decline after the market closed. This move by Trump suggests upcoming industry-specific levies that could impact the furniture sector.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Edmonton Elks Beat Ottawa Redblacks 30-20 for Third Straight Win",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sat, 23 Aug 2025 04:16:29 +0000",
    "source": "Global News",
    "sources": [
      "Sportsnet",
      "Global News"
    ],
    "domains": [
      "www.sportsnet.ca",
      "globalnews.ca"
    ],
    "snippets": [
      "The Edmonton Elks rolled to their third straight win, taking advantage of yet another sluggish start by the Ottawa Redblacks, to leave the nation’s capital with a 30-20 victory Friday night. With Ottawa (3-8) mounting a comeback, Edmonton quarterback Cody Fajardo, who finished 22-for-28 for 270 yard",
      "<p>The Edmonton Elks rolled to their third straight win, taking advantage of yet another sluggish start by the Ottawa Redblacks, to leave the nation’s capital with a 30-20 victory Friday night.</p>"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/08/Elks-Aug-22.jpg?quality=65&strip=all",
    "titles": [
      "Visiting Elks win third straight with 30-20 victory over Redblacks",
      "Visiting Elks defeat Redblacks to earn third straight with"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.922,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.696,
    "summary": "The Edmonton Elks secured their third consecutive win with a 30-20 victory over the Ottawa Redblacks. Despite a late comeback attempt by Ottawa, Edmonton's quarterback Cody Fajardo led his team to victory, completing 22 of 28 passes for 270 yards. This match highlighted Ottawa's sluggish start, contributing to their 3-8 record.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Stocks Surge as Fed Chair Powell Signals Rate Cuts Amid Economic Risks",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Fri, 22 Aug 2025 15:41:48 GMT",
    "source": "Axios",
    "sources": [
      "ABC News",
      "CNBC",
      "Axios"
    ],
    "domains": [
      "www.cnbc.com",
      "news.google.com",
      "abcnews.go.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMic0FVX3lxTFAxVFhycW9tekgwRjRFTEtwbjlYbE1RTTluTk16TjNzRWFySVFCNHd3R0tlT29ndkZDVnZQa3NjRTVwUWgxeml4YjJjdUdaU2ZQRDV6elZWNjRZR1dFYVlrS1ZESHpEMTBld2gycnZHSDNOaUE?oc=5\" target=\"_blank\">Stocks surge after Powell signals rate cuts ahead</a>&nbsp;&nbsp;<font c",
      "ABC News' Alexis Christoforous discusses how Federal Reserve Chair Jerome Powell's statements affected the market.",
      "Home Depot is soaring more than 4%. Caterpillar is surging too."
    ],
    "image_url": "",
    "titles": [
      "Stocks surge after Powell signals rate cuts ahead - Axios",
      "WATCH:  Stocks rally as Fed Chair Jerome Powell signals rate cut",
      "Fed's Powell signals rate cuts are coming, and the stocks that need them the most are flying"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.695,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.683,
    "summary": "Stocks surged following Federal Reserve Chair Powell's signal of impending interest rate cuts. Powell, despite being urged by Trump to resign, discussed the economic risks posed by tariffs and other challenges. The Federal Reserve is preparing to lower interest rates to address these issues.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UN Declares Famine in Northern Gaza Amid Ongoing Conflict",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 22 Aug 2025 16:56:49 GMT",
    "source": "BBC",
    "sources": [
      "Washington Post",
      "BBC",
      "New York Times"
    ],
    "domains": [
      "www.nytimes.com",
      "www.bbc.com",
      "www.washingtonpost.com"
    ],
    "snippets": [
      "A UN-backed body confirms famine in Gaza City and surrounding areas, and says half a million are facing \"catastrophic\" conditions.",
      "More than half a million people in and around Gaza City are facing catastrophic conditions “characterized by starvation, destitution and death,” the IPC said.",
      "At least half a million people in the enclave were facing the most severe conditions measured by U.N.-backed international experts: starvation, acute malnutrition and death."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/4735/live/b138f6a0-7f35-11f0-b7ed-0b17109072b5.jpg",
    "titles": [
      "Famine in Gaza City is 'failure of humanity', UN chief says",
      "Famine confirmed in Gaza City region, global hunger monitor says",
      "Gaza City and Surrounding Areas Officially Hit by Famine, Global Group Says"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.713,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.679,
    "summary": "The U.N.-backed Integrated Food Security Phase Classification (IPC) has officially declared a famine in northern Gaza, marking the first confirmation of famine in the Middle East. This crisis comes after 22 months of conflict between Israel and the Palestinian territory. UN Secretary-General Antonio Guterres described the situation as a 'man-made disaster' and called for immediate action. The IPC reports that over half a million people in and around Gaza City are experiencing catastrophic conditions, including starvation, destitution, and death.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Pirates' Bubba Chandler Shines in MLB Debut with Four Scoreless Innings",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sat, 23 Aug 2025 02:12:52 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "Pirates rookie Bubba Chandler, considered the top pitching prospect in baseball, became the first pitcher to throw four scoreless innings and record a save in his major league debut.",
      "<p>Bubba Chandler didn&#8217;t disappoint in his major league debut for the Pittsburgh Pirates.</p>"
    ],
    "image_url": "",
    "titles": [
      "Top prospect Chandler debuts with 4-inning save",
      "Top pitching prospect Bubba Chandler shines in Pirates debut vs. Rockies"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.96,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.672,
    "summary": "Pirates rookie Bubba Chandler, a highly regarded pitching prospect, made an impressive major league debut by pitching four scoreless innings and securing a save. Chandler's performance for the Pittsburgh Pirates was notable, marking a successful start to his career in the MLB.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Experts Share Predictions for UFC Fight Night: Walker vs. Zhang",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sat, 23 Aug 2025 00:41:34 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "Who has the edge at UFC Fight Night? An MMA coach and a betting insider make their picks.",
      "SportsLine's Daniel Vithlani reveals his picks for the UFC Fight Night: Walker vs. Zhang fight card from the Shanghai Indoor Stadium in Xuhui District, China, on Saturday"
    ],
    "image_url": "",
    "titles": [
      "UFC Fight Night: Expert picks, best bets for Johnny Walker vs. Zhang Mingyang",
      "UFC Fight Night odds, props, predictions, fight card: Walker vs. Zhang picks, best bets by proven MMA insider"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.93,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.666,
    "summary": "At UFC Fight Night in Shanghai, China, SportsLine's Daniel Vithlani and an MMA coach shared their predictions for the Walker vs. Zhang fight card. Their insights were provided ahead of the event, offering perspectives on who might have the competitive edge in the matchups.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Kira Chathli Rises in The Hundred Rankings with Unique Training Regimen",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 23 Aug 2025 07:04:17 GMT",
    "source": "BBC",
    "sources": [
      "Yahoo Sports",
      "BBC"
    ],
    "domains": [
      "www.bbc.com"
    ],
    "snippets": [
      "Kira Chathli is a surprising name near the top of The Hundred run-scoring charts and says rock climbing, boxing and chess are behind her improvements.",
      "Kira Chathli is a surprising name near the top of The Hundred run-scoring charts and says rock climbing, boxing and chess are behind her improvements."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/6982/live/0b1acc10-7e7e-11f0-9e05-3dbec5559644.jpg",
    "titles": [
      "How chess, climbing & boxing help The Hundred's unlikely run-scorer",
      "How chess, climbing & boxing help The Hundred's unlikely run-scorer"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.957,
      "consensus": 0.571,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.648,
    "summary": "Kira Chathli has emerged as a notable figure in The Hundred run-scoring rankings, attributing her success to activities like rock climbing, boxing, and chess. Her unconventional training methods have led to improved performance, placing her near the top of the charts.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Meta Partners with Midjourney for AI Image Tech Licensing",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-08-22T17:07:04-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge",
      "TechCrunch"
    ],
    "domains": [
      "www.theverge.com",
      "techcrunch.com"
    ],
    "snippets": [
      "Meta is partnering with Midjourney to “license their aesthetic technology” for use in its own models and products, Meta’s new chief AI officer, Alexandr Wang, announced on Friday. The partnership involves a “technical collaboration between our research teams,” Wang said, suggesting the deal involves",
      "Meta's chief AI officer said that the company is partnering with Midjourney to license its AI image and video model technology."
    ],
    "image_url": "",
    "titles": [
      "Meta is going to stuff Midjourney AI images into your feed",
      "Meta partners with Midjourney on AI image and video models"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.794,
      "consensus": 0.591,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.641,
    "summary": "Meta has entered into a partnership with Midjourney to license the latter's AI image and video model technology. Announced by Meta's new Chief AI Officer, Alexandr Wang, the collaboration will include a technical exchange between the companies' research teams, aiming to integrate Midjourney's aesthetic technology into Meta's products and models.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: collaboration, research",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "NFL Preseason Deals: 49ers, Commanders, Saints Trade Evaluations",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Fri, 22 Aug 2025 15:22:51 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sports Illustrated"
    ],
    "domains": [
      "news.google.com",
      "www.espn.com"
    ],
    "snippets": [
      "Who won the 49ers-Commanders trade? Why did the Saints give up so much for a 27-year-old wide receiver? We sized up preseason NFL deals.",
      "<a href=\"https://news.google.com/rss/articles/CBMimgFBVV95cUxQU09uQXR0WUI2dEV2NjVEdzBpeDhNemx6My1JM1ViQzNyWlR4QjBfb092NTIwZzBsV2dsTTBiM0dBRnJVRU1pcjlhR0ZndFJuYUpDWlNzN1I1R05aaG1fUjRkM2tkR3ZXV3AzV21FV1UyX0ZwNm0wUGNyTTY0bWs3T25rYVd1b1RyRXlqUi0zSlVtRk1FVU5tZTd3?oc=5\" target=\"_blank\">One Part of the 49e"
    ],
    "image_url": "",
    "titles": [
      "Brian Robinson Jr. to the 49ers, Devaughn Vele to the Saints",
      "One Part of the 49ers Acquiring Brian Robinson Jr. No one is Talking About (yet) - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.766,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.64,
    "summary": "The summary of the preseason NFL deals includes evaluations of trades involving the 49ers and Commanders, and the Saints' acquisition of a 27-year-old wide receiver. The analysis aims to determine which teams benefited most from their transactions. However, the specific outcomes or consensus on who \"won\" these trades were not provided in the content snippet. The focus is on assessing the value and impact of these deals on the teams involved.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "U.S. Government Acquires 10% Stake in Intel Amid CEO Resignation Demand",
    "domain": "business",
    "source_domain": "www.ft.com",
    "location": "global",
    "published": "Fri, 22 Aug 2025 22:39:44 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times",
      "Ars Technica"
    ],
    "domains": [
      "www.ft.com",
      "arstechnica.com"
    ],
    "snippets": [
      "Equity investment of $8.9bn marks the Trump administration’s latest corporate intervention",
      "Intel deal could pave the way for the US to profit off CHIPS Act funding."
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F416f6a1f-0785-44de-9411-d37a19091070.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "US to take 10% stake in troubled chipmaker Intel",
      "Trump says US will take 10% stake in Intel because CEO wants to “keep his job”"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.804,
      "consensus": 0.591,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.636,
    "summary": "The U.S. government has taken an unprecedented 10% stake in chipmaker Intel, a move announced by President Trump and confirmed by both parties. This decision follows Trump's demand for Intel CEO Lip-Bu Tan to resign due to his connections with Chinese firms. The investment, totaling $8.9 billion, is part of a broader strategy to support the struggling chipmaker and is financed largely through previously allocated government grants. This development marks a significant shift in U.S. policy, as it is rare for the government to take ownership in private corporations. The deal was finalized after ",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: development, support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "McBride Scores 29, Shepard Hits Triple-Double in Lynx 95-90 Win Over Fever",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sat, 23 Aug 2025 02:56:03 +0000",
    "source": "CBS Sports",
    "sources": [
      "Sportsnet",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Shepard achieved a triple-double with 8:03 remaining in the third quarter",
      "<p>Kayla McBride scored 29 points, Jessica Shepard got the second triple-double in franchise history, and the Minnesota Lynx beat the Indiana Fever 95-90 on Friday night.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/08/23/2305db4c-1c5b-4dc2-ae03-cb6cb8dd415d/untitled-design-2025-08-22t195010-407.png",
    "titles": [
      "Jessica Shepard records fastest, most efficient triple-double in WNBA history as Lynx close in on No. 1 seed",
      "Jessica Shepard records fastest triple-double in WNBA history as Lynx beat Fever"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.897,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.634,
    "summary": "In a game against the Indiana Fever, Kayla McBride led the Minnesota Lynx with 29 points, while Jessica Shepard achieved a triple-double with 8:03 left in the third quarter. This marked the second triple-double in franchise history. The Lynx secured a 95-90 victory.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Administration Halts New England Offshore Wind Farm Construction",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Fri, 22 Aug 2025 23:29:33 GMT",
    "source": "Axios",
    "sources": [
      "Financial Post",
      "Axios"
    ],
    "domains": [
      "financialpost.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMic0FVX3lxTE5UZTNVZFVTNnJHZFFLbkw2SjRNZXlIU3VfWlZUUkFLVTFXTFBGVE5IS1Q4eFU5dmZEbjlXelhuYWhnMW5DQVU5dmRMSDZKNFU5NV9oMWV0SExNeVpreVQ0WHJPNTBJMGozMktUbVJ0VVVCdW8?oc=5\" target=\"_blank\">Trump administration halts work on New England offshore wind project</a>",
      "The Trump administration has halted work on an offshore wind farm being constructed off the coast of Rhode Island by Denmark’s Orsted A/S."
    ],
    "image_url": "",
    "titles": [
      "Trump administration halts work on New England offshore wind project - Axios",
      "Trump Halts Orsted Wind Project in Another Blow to Industry"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.818,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.626,
    "summary": "The Trump administration has stopped the construction of an offshore wind farm in New England by Orsted A/S. The project, off the coast of Rhode Island, has been put on hold.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Apple in Talks for AI Deal Amid Siri Overhaul Efforts",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Fri, 22 Aug 2025 21:56:52 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "TechCrunch"
    ],
    "domains": [
      "www.cnbc.com",
      "techcrunch.com"
    ],
    "snippets": [
      "The reported talks have been for a potential AI deal between the two giants.",
      "Apple promised a major revamp to Siri, but the company's AI capabilities have lagged behind competitors."
    ],
    "image_url": "",
    "titles": [
      "Google shares rise on report of Apple using Gemini for Siri",
      "Apple is in talks to use Google’s Gemini for Siri revamp, report says"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.792,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.62,
    "summary": "Apple is reportedly in talks for a potential AI deal with another major company. Despite promising a significant overhaul to Siri, Apple's AI technology has fallen behind its rivals. The outcome of the talks and any potential agreement remain uncertain.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Seeks Removal of Fed's Cook Over Dual Residence Allegations",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Fri, 22 Aug 2025 21:23:57 GMT",
    "source": "Axios",
    "sources": [
      "CNBC",
      "Axios"
    ],
    "domains": [
      "www.cnbc.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMib0FVX3lxTE1ESFZRV3lsaU83RWJZZ1gyQnZUTmJBR0Z0YkZUWmZsVXV0WjZ4VzhDcmlwN0RGQ0tCOTM2S0VEQTRiNXJPUjVzNTRXejIwb3JnckhWNER0SnVNSVlFMnZHYzNNWUNiSVd1S3pUZGRNUQ?oc=5\" target=\"_blank\">Trump says he'll fire Fed governor Cook if she doesn't resign</a>&nbsp;&nbsp;",
      "President Donald Trump said Friday he will fire Federal Reserve Governor Lisa Cook if she does not resign from her position."
    ],
    "image_url": "",
    "titles": [
      "Trump says he'll fire Fed governor Cook if she doesn't resign - Axios",
      "Trump says he'll fire Fed Governor Lisa Cook 'if she doesn't resign'"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.783,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.619,
    "summary": "President Donald Trump announced he will attempt to remove Federal Reserve Governor Lisa Cook from her position if she does not resign. This statement follows accusations by Federal Housing Finance Agency Director Bill Pulte, who alleged Cook committed mortgage fraud by claiming two properties as her primary residence. Trump's demand intensifies his administration's pressure on Cook.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "2026 World Cup Draw Set for Dec 5 at Kennedy Center, Shifts from Vegas",
    "domain": "business",
    "source_domain": "www.forbes.com",
    "location": "global",
    "published": "Fri, 22 Aug 2025 18:21:29 -0400",
    "source": "Forbes",
    "sources": [
      "Sportsnet",
      "Forbes"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.forbes.com"
    ],
    "snippets": [
      "The 2026 World Cup draw will be held at the Kennedy Center, and not in Las Vegas. It opened up questions about more political football between Trump and Infantino.",
      "<p>President Donald Trump said Friday that the draw for the 2026 World Cup will take place on Dec. 5 at the Kennedy Center in Washington.</p>"
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/68a8e6110db5aa380ad88596/0x0.jpg?width=960",
    "titles": [
      "Some More Political Football: World Cup Draw Is Set For Kennedy Center",
      "2026 World Cup draw will be held at Washington’s Kennedy Center"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.815,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.618,
    "summary": "The 2026 World Cup draw is scheduled for December 5 at the Kennedy Center in Washington, D.C., as announced by President Donald Trump. This decision marks a location change from the previously speculated venue in Las Vegas, sparking discussions on potential political implications involving Trump and FIFA President Gianni Infantino.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Bluesky Blocks Mississippi Access Over New Age Verification Law",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-08-22T17:09:14-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge",
      "TechCrunch"
    ],
    "domains": [
      "www.theverge.com",
      "techcrunch.com"
    ],
    "snippets": [
      "Bluesky will block access from Mississippi IP addresses in response to a new state law requiring age verification and parental consent for underage users. The decision, outlined in a blog post, will stand until courts decide the fate of the law. “Mississippi&#8217;s approach would fundamentally chan",
      "In a blog post published on Friday, the company explains that, as a small team, it doesn't have the resources to make the substantial technical changes this type of law would require, and it raised concerns about the law's broad scope and privacy implications."
    ],
    "image_url": "",
    "titles": [
      "Bluesky blocks Mississippi under new age verification law",
      "Bluesky blocks service in Mississippi over age assurance law"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.795,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.614,
    "summary": "Bluesky announced it will block access from Mississippi due to a new law requiring age verification and parental consent for underage users. The company, citing limited resources and concerns over privacy and the law's broad scope, stated the block will remain until the law's fate is decided by courts. This decision was shared in a blog post, highlighting the challenges small teams face in adapting to such legal requirements.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Study: Oil and Gas Pollution Causes 91,000 US Deaths Annually, Minorities Most A",
    "domain": "science",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Fri, 22 Aug 2025 18:00:38 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "Phys.org"
    ],
    "domains": [
      "phys.org",
      "www.theguardian.com"
    ],
    "snippets": [
      "<p>Study analyzed health impacts of fossil fuels from exploration to end use, and found communities of color bear brunt of harm</p><p><a href=\"https://www.theguardian.com/environment/air-pollution\">Air pollution</a> from oil and gas causes more than 90,000 premature deaths and sickens hundreds of th",
      "Air pollution from oil and gas is causing 91,000 premature deaths and hundreds of thousands of health issues across the United States annually, with Black, Asian, Native American and Hispanic groups consistently the most affected, finds a major new study led by researchers at UCL and the Stockholm E"
    ],
    "image_url": "https://i.guim.co.uk/img/media/a507531a55ca882affdb1c4315f9729cb9bf85d6/562_0_5624_4504/master/5624.jpg?width=140&quality=85&auto=format&fit=max&s=7afc990aef0af104c1140ea6c1c62130",
    "titles": [
      "Air pollution from oil and gas causes 90,000 premature US deaths each year, says new study",
      "Oil and gas air pollution linked to 91,000 early deaths in the US each year"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.729,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.611,
    "summary": "A study by UCL and the Stockholm Environment Institute found that air pollution from oil and gas results in 91,000 premature deaths annually in the US, disproportionately affecting communities of color. States like California, Texas, New York, Pennsylvania, and New Jersey are the most impacted. The research highlights the significant health burdens borne by Black, Asian, Native American, and Hispanic populations due to fossil fuel pollution.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: research",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Elon Musk's Brother Defends $56B Pay in Court, Calls Tesla an AI Firm",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Fri, 22 Aug 2025 17:38:26 GMT",
    "source": "CNBC",
    "sources": [
      "Business Insider",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "www.businessinsider.com"
    ],
    "snippets": [
      "The electric carmaker has been locked in a legal battle over Elon Musk's $56 billion pay package from 2018.",
      "The younger Musk brother said the Tesla CEO \"deserves to be paid\" and calls Tesla an AI company."
    ],
    "image_url": "",
    "titles": [
      "Kimbal Musk on Elon's Tesla pay package: 'My brother deserves to be paid'",
      "Tesla board member Kimbal Musk weighs in on his brother's pay package and the idea of Tesla investing in xAI"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.724,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.607,
    "summary": "Tesla has been embroiled in a lawsuit regarding Elon Musk's $56 billion compensation package from 2018. During the legal proceedings, Musk's younger brother testified, asserting that the Tesla CEO merits the payment and described Tesla as an AI company.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Developer Convicted for Planting \"Kill Switch\" in Servers",
    "domain": "technology",
    "source_domain": "techcrunch.com",
    "location": "global",
    "published": "Fri, 22 Aug 2025 14:26:34 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch",
      "Ars Technica"
    ],
    "domains": [
      "techcrunch.com",
      "arstechnica.com"
    ],
    "snippets": [
      "The ex-developer was convicted of planting malicious code designed to crash its servers in the event that he was fired.",
      "Disgruntled developer was caught after naming the \"kill switch\" after himself."
    ],
    "image_url": "",
    "titles": [
      "Developer gets prison time for sabotaging former employer’s network with a ‘kill switch’",
      "Developer gets 4 years for activating network “kill switch” to avenge his firing"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.691,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.593,
    "summary": "A former developer was found guilty of inserting harmful code into servers to crash them if he was terminated. The disgruntled employee was identified when the \"kill switch\" was traced back to him. The outcome is that the developer has been convicted for the malicious act.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]