[
  {
    "title": "Trump Proposes 20-Point Gaza Peace Plan, Threatens Hamas with Consequences",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Fri, 03 Oct 2025 12:26:36 -0400",
    "source": "NPR",
    "sources": [
      "Al Jazeera",
      "NPR",
      "Financial Times",
      "Forbes",
      "Axios",
      "BBC",
      "New York Times"
    ],
    "domains": [
      "news.google.com",
      "www.nytimes.com",
      "www.ft.com",
      "www.aljazeera.com",
      "www.npr.org",
      "www.bbc.com",
      "www.forbes.com"
    ],
    "snippets": [
      "President Trump said that if Hamas does not agree to the 20-point plan, as presented by Israel and the U.S., then \"all HELL, like no one has ever seen before, will break out against Hamas.\"",
      "The 20-point proposal seeks to end the fighting immediately in return for the release of hostages and detained Gazans.",
      "US president has pushed a 20-point plan to &#039;redevelop&#039; Gaza that critics say fails to support Palestinian sovereignty.",
      "<a href=\"https://news.google.com/rss/articles/CBMieEFVX3lxTE4yS2JEQU1ySW5fRXd3Tkxsc0hsYWVSb2Z0SW1xWFY3dTF5RUlPd0pYWFRKMFYweEs3emJ4NWpsR2FieU1MLW1zei1ZTi1wQjczYmxNVWRKVFRnU20wcGo2VmhfVnZpeW1ldkJWWVZIdG1tcDhvYUROYQ?oc=5\" target=\"_blank\">Trump says Hamas must accept Gaza peace deal by Sunday, or war es",
      "US president warns militant group that ‘all HELL . . . will break out’ if it does not sign up to his deal",
      "President Trump said Hamas would be “extinguished” if it did not agree to a cease-fire proposed by the United States.",
      "Trump’s proposal would place Gaza under the temporary control of a “Board of Peace” with himself as chairman."
    ],
    "image_url": "",
    "titles": [
      "Trump gives Hamas a 'last chance' deadline to agree to a peace plan with Israel",
      "Trump gives Hamas Sunday deadline to accept Gaza peace plan",
      "Trump issues Sunday ultimatum for Hamas to accept Gaza plan",
      "Trump says Hamas must accept Gaza peace deal by Sunday, or war escalates - Axios",
      "Trump gives Hamas deadline of Sunday to agree to Gaza peace plan",
      "Trump Sets Sunday Deadline for Hamas to Agree to Cease-fire Plan With Israel",
      "Trump Gives Hamas Sunday Deadline To Accept Peace Deal Or Face ‘All HELL’"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.925,
      "consensus": 1.0,
      "constructiveness": 0.2,
      "proximity": 0.75
    },
    "score": 0.88,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "President Trump has proposed a 20-point plan aimed at ending the conflict in Gaza, which includes an immediate ceasefire, the release of hostages and detained Gazans, and the temporary control of Gaza by a \"Board of Peace\" chaired by himself. Critics argue the plan does not support Palestinian sovereignty. Trump warned that failure to accept the deal by Sunday would lead to severe consequences against Hamas, which is currently divided on the response. Egypt and Qatar are attempting to persuade Hamas to agree to the ultimatum.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: plan, support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Sarah Mullally Appointed First Female Archbishop of Canterbury",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 12:47:22 GMT",
    "source": "BBC",
    "sources": [
      "CityNews",
      "Al Jazeera",
      "Washington Post",
      "Deutsche Welle",
      "The Guardian",
      "BBC",
      "New York Times"
    ],
    "domains": [
      "www.nytimes.com",
      "www.aljazeera.com",
      "www.theguardian.com",
      "ottawa.citynews.ca",
      "www.washingtonpost.com",
      "www.bbc.com",
      "www.dw.com"
    ],
    "snippets": [
      "She becomes the first female leader of the Church of England, replacing Justin Welby who resigned over his handling of a safeguarding scandal.",
      "Announcement draws criticism from Anglican churches that oppose female bishops.",
      "Sarah Mullally will become the first female leader when she officially takes charge of the church in March 2026. A group of conservative Anglican churches across Africa and Asia criticized the appointment.",
      "Sarah Mullally, previously the bishop of London, is the first woman to serve as spiritual leader of the Church of England in its nearly 500-year history.",
      "Sarah Mullally, the bishop of London, has been appointed archbishop of Canterbury. She has been a vocal supporter of the rights of women in the church.",
      "<p>Former chief nursing officer for England will legally assume role at Canterbury Cathedral ceremony in January</p><p>Dame Sarah Mullally has been named as the first female leader in the history of the Church of England as Downing Street announced the 106th archbishop of Canterbury nearly a year on",
      "LONDON (AP) — Bishop of London Sarah Mullally shattered a stained-glass ceiling Friday when she was announced as the next Archbishop of Canterbury, the first time a woman has been chosen as the Church of England&#8217;s spiritual leader. Mullally, 63, a former cancer nurse who became England&#8217;s"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/0d05/live/54230290-a04a-11f0-92db-77261a15b9d2.jpg",
    "titles": [
      "'Hatred and racism cannot tear us apart,' first woman Archbishop of Canterbury says",
      "Church of England names first female archbishop of Canterbury",
      "First female Archbishop appointed to lead Church of England",
      "First woman is named archbishop of Canterbury, leader of Church of England",
      "Sarah Mullally Is Named as First Female Archbishop of Canterbury",
      "Sarah Mullally is named as first female archbishop of Canterbury",
      "Sarah Mullally named the first female Archbishop of Canterbury in history of Church of England"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.839,
      "consensus": 1.0,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.828,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Sarah Mullally has been appointed as the new Archbishop of Canterbury, marking the first time a woman will lead the Church of England and its 85 million Anglicans globally. Previously the Bishop of London and a former chief nursing officer, Mullally's historic appointment follows Justin Welby's resignation last year. She is recognized for her support of women's rights within the church. Mullally will officially assume her role in a ceremony at Canterbury Cathedral in January, becoming the 106th archbishop in the Church's history.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "U.S. Strike Kills 4 on Suspected Drug Boat in Caribbean",
    "domain": "business",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-10-03T18:02:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Washington Post",
      "Deutsche Welle",
      "Forbes",
      "The Guardian",
      "New York Times"
    ],
    "domains": [
      "www.nytimes.com",
      "www.theguardian.com",
      "www.washingtonpost.com",
      "www.dw.com",
      "www.forbes.com"
    ],
    "snippets": [
      "The US said it carried out another strike on a small boat in the Caribbean Sea, killing four people on board. Pentagon chief Pete Hegseth said \"narco-terrorists\" were the target.",
      "<p>Pentagon chief says strike – fourth by US military in recent weeks – targeted boat with ‘substantial amounts’ of drugs</p><p>The United States carried out a strike against an alleged drug-trafficking boat on Friday that killed four people, US defense secretary <a href=\"https://www.theguardian.com",
      "The U.S. strike near Venezuela is the latest in the Trump administration’s legally nebulous campaign targeting Latin American drug cartels.",
      "It was the fourth strike in the Trump administration’s legally disputed campaign targeting suspected drug runners in the Caribbean Sea.",
      "The U.S. military has struck four boats in the Caribbean over the past month the Trump administration claims were carrying drugs."
    ],
    "image_url": "",
    "titles": [
      "US strikes drug alleged boat near Venezuelan waters",
      "Hegseth says four killed in US strike on alleged drug boat off Venezuelan coast",
      "U.S. kills 4 alleged drug smugglers near Venezuela, Hegseth says",
      "U.S. Military Attacked Boat Off Venezuela, Killing Four Men, Hegseth Says",
      "Trump Announces Another Strike On Alleged Drug Boat From Venezuela, Four Killed"
    ],
    "score_components": {
      "magnitude": 0.964,
      "recency": 0.956,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.827,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The U.S. conducted a strike in the Caribbean Sea, killing four individuals on a boat suspected of drug trafficking. This action, confirmed by Pentagon Chief Pete Hegseth, marks the fourth similar strike by the U.S. military under the Trump administration's campaign against Latin American drug cartels. The operation is part of a series targeting vessels believed to be carrying substantial amounts of drugs.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Taylor Swift Drops 12th Album, Eyes 1M First-Week Sales",
    "domain": "business",
    "source_domain": "www.forbes.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 13:39:20 -0400",
    "source": "Forbes",
    "sources": [
      "Ottawa Citizen",
      "Business Insider",
      "Forbes",
      "CityNews"
    ],
    "domains": [
      "www.forbes.com",
      "ottawa.citynews.ca",
      "www.businessinsider.com",
      "ottawacitizen.com"
    ],
    "snippets": [
      "Swift’s latest release smashed pre-save records as the billionaire singer referenced her fiancé Travis Kelce.",
      "Taylor Swift's new album, \"The Life of a Showgirl,\" features 12 new songs, a duet with Sabrina Carpenter, and a theatrical \"release party\" event.",
      "The University of Ottawa GeeGees and Carleton Ravens face off for 55th time Sunday afternoon.",
      "Who is Taylor Swift’s heir apparent? Her 12th album, “The Life of a Showgirl,” offers an answer. It’s Taylor Swift. Her last album, “The Tortured Poets Department,” ended with the cautionary “Clara Bow,” an allegory that seemed to suggest her tenure atop the cultural mainstream was inherited from st"
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/68e009450de5e6f08df5d01e/0x0.jpg?width=960&precrop=2760%2C1554%2Cx0%2Cy43",
    "titles": [
      "Taylor Swift’s ‘Life Of A Showgirl’ Hits Number 1 On Apple—As Album Hints At Travis Kelce And More",
      "Taylor Swift's new album 'The Life of a Showgirl' has arrived. Here's everything you need to know.",
      "Everything you need to know about the Panda Game",
      "On Taylor Swift’s ‘The Life of a Showgirl,’ love and reputation are on the line"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.949,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.779,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Taylor Swift released her 12th album, \"The Life of a Showgirl,\" featuring a mix of pop and country music, along with themes of love, rivalry, and fame. The album, celebrated for its joyful pop records, has been uniquely promoted with global releases and exclusive cinema events for fans. It is anticipated to sell over 1 million copies in its first week, a milestone Swift has achieved before. The release underscores Swift's continued dominance in the music industry.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Blue Jays to Battle Yankees in First Postseason Matchup",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Fri, 03 Oct 2025 17:13:29 +0000",
    "source": "CBS Sports",
    "sources": [
      "Global News",
      "Sports Illustrated",
      "CBS Sports",
      "Sportsnet"
    ],
    "domains": [
      "news.google.com",
      "www.cbssports.com",
      "www.sportsnet.ca",
      "globalnews.ca"
    ],
    "snippets": [
      "The best-of-five series begins Saturday in Toronto",
      "The Toronto Blue Jays and New York Yankees have battled all year. Now the two division rivals will settle the score in the post-season — for the first time.",
      "<a href=\"https://news.google.com/rss/articles/CBMinAFBVV95cUxPdy1iRmwxNlJBWTJLaFhWaGx2NllaaFZkQ25fVkxySEs5Q1FIWjRxMWYzeUd6Q3FCOGtYQkZ5d0xMYTdoaDNObFZlMXY5M21YU1dZbWRxN2JSU2phQVJSMkxHb2FmXzVJc2x5RWVtdkZwNzlaS1p3UGZGZllNUnVZWDhCVE02V0VVc1h3ZE5HT3R4LTdqcjR2U3NBUWI?oc=5\" target=\"_blank\">Blue Jays Name S",
      "<p>The Toronto Blue Jays’ most consistent pitcher this year will get the ball for Game 1 of the American League Division Series.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/10/03/ddb73370-7345-4cbc-90ee-dbf8fecdef5e/stanton-getty.png",
    "titles": [
      "Blue Jays vs. Yankees predictions: ALDS expert picks as division rivals square off",
      "How the Blue Jays and Yankees match up in ALDS",
      "Blue Jays Name Starting Pitcher for Game 1 of ALDS Against the Yankees - Sports Illustrated",
      "Blue Jays’ Kevin Gausman to start Game 1 of ALDS vs. Yankees"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.94,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.777,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Toronto Blue Jays and New York Yankees will face off in the American League Division Series, marking their first postseason encounter. The best-of-five series kicks off Saturday in Toronto, with the Blue Jays' top pitcher starting Game 1.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Apple Pulls ICEBlock App Over Safety Concerns, Following DOJ Demands",
    "domain": "business",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-10-03T06:17:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Axios",
      "TechCrunch",
      "CNBC",
      "Deutsche Welle"
    ],
    "domains": [
      "news.google.com",
      "www.cnbc.com",
      "techcrunch.com",
      "www.dw.com"
    ],
    "snippets": [
      "The Justice Department reportedly reached out to Apple to take down ICEBlock and similar apps, citing security risks to immigration enforcement officers.",
      "<a href=\"https://news.google.com/rss/articles/CBMib0FVX3lxTE9Eb3BJYnU3dk5GR1lkQjdRaGNTR0Jub3lkeXloUFJrUVdqU2VGNU84RHFBQVRhVlIxZ29BOW1CMS1uNjRrOUV0QzItNnp4OEZCU3h5NXRBQlhFNGFBQUZocVo0b29zN2FVQU91S1FSdw?oc=5\" target=\"_blank\">Apple drops ICE tracking apps from its store after Trump DOJ demand</a>&nbsp;",
      "Joshua Aaron has said he created ICEBlock after seeing the Trump administration's deportation efforts, which he said evoked events in Nazi Germany.",
      "The app, which went viral earlier this year, allowed users to lawfully share information about where they've seen ICE agents within a 5-mile radius of their location, and also share details of the clothing agents are wearing."
    ],
    "image_url": "",
    "titles": [
      "Apple pulls ICE tracking apps after Trump admin request",
      "Apple drops ICE tracking apps from its store after Trump DOJ demand - Axios",
      "Google, Apple drop ICE agent tracking apps from stores after Trump admin complaints",
      "Apple removes ICEBlock and similar tracking apps from the App Store"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.748,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.739,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Apple removed the ICEBlock app, designed to track immigration enforcement activities, from its App Store, citing safety concerns. This action follows demands from the Trump-era Department of Justice. The app's creator, Joshua Aaron, developed ICEBlock in response to the Trump administration's deportation policies, which he compared to events in Nazi Germany.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Yom Kippur Attack at Synagogue Kills 2; Israel Detains Activists, Starbucks Cuts",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 18:19:13 GMT",
    "source": "BBC",
    "sources": [
      "New York Times",
      "BBC",
      "Financial Times"
    ],
    "domains": [
      "www.nytimes.com",
      "www.bbc.com",
      "www.ft.com"
    ],
    "snippets": [
      "Two Jewish people were killed in a car and stabbing attack at Heaton Park Hebrew Congregation Synagogue in Manchester on the holiest day in the Jewish religious calendar.",
      "BBC Verify analyses footage circulating online showing the moment police opened fire on a suspect at a Manchester synagogue.",
      "UK deputy prime minister booed at vigil. Attacker revealed to be under investigation for alleged rape",
      "Shocked family condemns atrocity as ‘heinous act’",
      "A congregant in Manchester, England, described how fellow worshipers, including the rabbi, used their bodies to barricade the entrance as the assailant tried to force his way in.",
      "In the hours after an attack, a blanket of fear and grief fell over synagogues and Jewish community centers across the country.",
      "Two people were killed on Yom Kippur after a driver rammed a vehicle into people in Manchester and stabbed others. One man who died was accidentally shot by the police, who also killed the attacker."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/4d22/live/aa332190-a079-11f0-b741-177e3e2c2fc7.jpg",
    "titles": [
      "What we know about the attack",
      "What do we know about the Manchester synagogue attacker?",
      "Victim killed in Manchester synagogue attack was shot by police",
      "What we know about Manchester synagogue attacker Jihad Al-Shamie",
      "How an Attack on a Synagogue in Manchester Unfolded",
      "Manchester Synagogue Attack Fuels Fears of Antisemitism in Britain",
      "Synagogue Attack on Yom Kippur in Manchester, UK: What We Know"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.942,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.739,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Two individuals were killed in a car and stabbing attack at Heaton Park Hebrew Congregation Synagogue during Yom Kippur, with the assailant also deceased. Meanwhile, Israeli forces detained activists from several aid boats in international waters, amidst criticism of international inaction on the situation in Gaza. Additionally, Starbucks announced the closure of 1% of its North American stores, though specific locations were not disclosed.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Jihad Al-Shamie Attacks Synagogue, Was on Bail for Prior Alleged Crime",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 17:35:01 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC",
      "New York Times"
    ],
    "domains": [
      "www.theguardian.com",
      "www.nytimes.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Jihad Al-Shamie was a weightlifting enthusiast who rarely spoke to his neighbours, one resident said.",
      "<p>Exclusive: Jihad al-Shamie had been under investigation over alleged sexual attack earlier this year, sources say</p><ul><li><p><a href=\"https://www.theguardian.com/uk-news/live/2025/oct/03/manchester-synagogue-attack-victims-adrian-daulby-melvin-cravitz-attacker-jihad-al-shamie-latest-news-updat",
      "The man who attacked people at the Heaton Park Congregation synagogue in northwestern England had been released on bail, a police official said."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/48d0/live/1d2b58d0-a060-11f0-b741-177e3e2c2fc7.jpg",
    "titles": [
      "Synagogue attacker was on bail after rape arrest",
      "Manchester synagogue terrorist was on bail for alleged rape",
      "Manchester Synagogue Terrorist Was Under Investigation for Rape"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.928,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.729,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Jihad Al-Shamie, who attacked individuals at the Heaton Park Congregation synagogue in northwestern England, had previously been under investigation for an alleged sexual attack. He was known as a weightlifting enthusiast who kept to himself. Despite the ongoing investigation, he was released on bail prior to the synagogue attack.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Panthers' Hubbard Likely Out vs. Dolphins Due to Calf Injury",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Fri, 03 Oct 2025 16:42:51 +0000",
    "source": "CBS Sports",
    "sources": [
      "Yahoo Sports",
      "CBS Sports",
      "Sportsnet"
    ],
    "domains": [
      "www.cbssports.com",
      "www.thephinsider.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Hubbard has been dealing with a nagging calf injury for a couple of weeks",
      "Will you be able to watch Sunday’s Dolphins at Panthers game on FOX?",
      "<p>One of Canada&#8217;s most productive NFLers likely will be sidelined Sunday. Carolina Panthers running back Chuba Hubbard is expected to miss his team&#8217;s game against the Miami Dolphins because of a calf injury, NFL Network&#8217;s Ian Rapoport reported Friday.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/10/03/5a5ac609-9e1f-42bc-b902-eee70c2dcdd4/gettyimages-2237324061-2.jpg",
    "titles": [
      "Chuba Hubbard injury update: Panthers RB to miss Week 5 game vs. Dolphins due to calf issue",
      "Dolphins vs. Panthers Week 5: Where can I watch?",
      "Panthers RB Chuba Hubbard out vs. Miami with calf injury, Dowdle to start"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.93,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.723,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Carolina Panthers running back Chuba Hubbard is likely to miss Sunday's game against the Miami Dolphins due to a calf injury, as reported by NFL Network's Ian Rapoport. This injury has been troubling Hubbard for a few weeks.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Fire at Chevron Refinery in LA County Risks Fuel Supply, Prices",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Fri, 03 Oct 2025 13:51:32 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Forbes",
      "Financial Post"
    ],
    "domains": [
      "www.cnbc.com",
      "www.forbes.com",
      "financialpost.com"
    ],
    "snippets": [
      "Emergency services are actively responding to a fire at Chevron’s El Segundo plant in California.",
      "A major fire at Chevron’s El Segundo refinery threatens California’s gasoline supply, exposing the state’s fuel vulnerabilities and likely driving pump prices higher.",
      "Chevron Corp.’s El Segundo refinery in Los Angeles County has shut multiple units as it continues battling a fire that broke out last night, the latest threat to fuel supplies in a state that’s already bracing for shortfalls."
    ],
    "image_url": "",
    "titles": [
      "Massive fire breaks out at Chevron oil refinery in California",
      "Chevron Refinery Fire Threatens California’s Fragile Fuel Supply",
      "Fire Shuts Chevron Refinery Units Near LA as Fuel Crunch Looms"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.858,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.718,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A fire at Chevron's El Segundo refinery in Los Angeles County has led to the shutdown of multiple units. Emergency services are responding to the blaze, which poses a significant threat to California's gasoline supply, potentially increasing fuel prices. The situation is ongoing as efforts to control the fire continue.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "England Crushes South Africa in Women's World Cup Opener",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 12:54:16 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC",
      "Sky Sports"
    ],
    "domains": [
      "www.theguardian.com",
      "www.skysports.com",
      "www.bbc.com"
    ],
    "snippets": [
      "England get their World Cup campaign off to the perfect start as they ease past South Africa in their opening match, bowling their opponents out for 69 before reaching their winning target inside 15 overs, without losing a wicket.",
      "<ul><li><p><a href=\"https://www.theguardian.com/sport/cricket/match/2025-10-03/england-women-cricket-team\">England, 73-0, beat South Africa, 69, by 10 wickets</a></p></li><li><p>Beaumont-Jones partnership makes short work of chase</p></li></ul><p>England romped home with a 10-wicket win in their Wor",
      "Highlights of the Women's Cricket World Cup match between England and South Africa.",
      "Spinner Linsey Smith starred as England kicked off their Women's Cricket World Cup campaign with an emphatic 10-wicket demolition of South Africa in Guwahati."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/692d/live/6676a040-a055-11f0-928c-71dbb8619e94.jpg",
    "titles": [
      "England start World Cup in style with dominant win against South Africa",
      "England off to Cricket World Cup flyer with 10-wicket demolition of South Africa",
      "England begin Cricket World Cup in style with dominant win over South Africa",
      "England thrash South Africa by 10 wickets in World Cup opener"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.841,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.705,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "England defeated South Africa by 10 wickets in their opening match of the Women's Cricket World Cup in Guwahati. Bowling South Africa out for 69 runs, England achieved their winning target in less than 15 overs without losing any wickets, with Linsey Smith delivering a standout performance as a spinner.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Canada Post Proposes New Contract, Cuts Bonus and Suggests Workforce Reduction",
    "domain": "business",
    "source_domain": "financialpost.com",
    "location": "national",
    "published": "Fri, 03 Oct 2025 19:51:16 +0000",
    "source": "Financial Post",
    "sources": [
      "CityNews",
      "Financial Post"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "financialpost.com"
    ],
    "snippets": [
      "Canada Post&#8217;s latest contract offers to striking postal workers has many of the same terms as its &#8220;final offers&#8221; in May, but removes a signing bonus and now has provisions related to job cuts expected ahead. The offers presented Friday come a little over a week after the federal go",
      "Canada Post has presented a new set of contract offers to the Canadian Union of Postal Workers (CUPW), pledging wage increases and benefit protections while stressing the need to modernize its operations and address mounting financial pressures. The corporation stated that the proposals maintain pro"
    ],
    "image_url": "",
    "titles": [
      "Canada Post tables new offers to union that include job cut provisions",
      "Canada Post tables new offer to thousands of postal workers amid labour dispute"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.993,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.704,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Canada Post proposed new contract offers to the Canadian Union of Postal Workers, including wage increases and benefit protections. However, these offers remove a previously offered signing bonus and suggest reducing the workforce and the number of post offices protected from closure. The changes aim to modernize operations and tackle financial challenges.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "US Government Halts $2.1bn Chicago Funding Amid Shutdown, Diversity Dispute",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Fri, 03 Oct 2025 19:43:40 GMT",
    "source": "CNBC",
    "sources": [
      "The Guardian",
      "CNBC"
    ],
    "domains": [
      "www.theguardian.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "The move came on the third day of the federal government shutdown, which President Donald Trump has blamed on Democrats in Congress.",
      "<p>OMB director Russ Vought presented the pause as a move against diversity efforts in latest jab to Democratic-led city</p><p>The US government has put $2.1bn in funding for infrastructure projects in Chicago on hold, <a href=\"https://www.theguardian.com/us-news/2025/oct/02/trump-russ-vought-govern"
    ],
    "image_url": "",
    "titles": [
      "Trump admin freezes $2.1 billion for Chicago projects, blames Democrats for shutdown holdup",
      "Trump administration freezes $2.1bn in funds for Chicago transit projects"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.97,
      "consensus": 0.591,
      "constructiveness": 0.2,
      "proximity": 0.75
    },
    "score": 0.701,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "On the third day of the federal government shutdown, the US government, directed by OMB director Russ Vought, paused $2.1bn in infrastructure funding for Chicago, citing opposition to diversity efforts. This action, attributed by President Donald Trump to Democrats in Congress, represents a significant halt in financial support for the city's projects amidst ongoing political disputes.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: effort, support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Admin Claims \"Armed Conflict\" Justifies Strikes on Venezuelan Drug Boats",
    "domain": "general",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 00:05:23 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "New York Times",
      "Washington Post"
    ],
    "domains": [
      "www.theguardian.com",
      "www.nytimes.com",
      "www.washingtonpost.com"
    ],
    "snippets": [
      "<p>Administration attempts to justify strikes on alleged Venezuelan drug boats by claiming US under ‘armed attack’</p><p>The Trump administration is trying to justify strikes on alleged Venezuelan drug boats by advancing a novel legal theory that the US is now in a “non-international armed conflict”",
      "President Donald Trump has determined the U.S. is in “armed conflict” with drug cartels who are distributing narcotics, according to a notification to Congress.",
      "A notice calls the people the U.S. military recently killed on suspicion of drug smuggling in the Caribbean Sea “unlawful combatants.”"
    ],
    "image_url": "https://i.guim.co.uk/img/media/b6e16c1c91aa3f917c815100914be1bb254c6530/418_0_4164_3333/master/4164.jpg?width=140&quality=85&auto=format&fit=max&s=90dcff67bc88d491bbace822388cfa86",
    "titles": [
      "Trump officials push claim that US in ‘armed conflict’ with drug cartels",
      "U.S. in ‘armed conflict’ with drug cartels, Trump tells Congress",
      "Trump ‘Determined’ the U.S. Is Now in a War With Drug Cartels, Congress Is Told"
    ],
    "score_components": {
      "magnitude": 0.887,
      "recency": 0.644,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.687,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Trump administration has attempted to justify strikes on alleged Venezuelan drug boats by claiming the U.S. is in a \"non-international armed conflict\" with drug cartels, based on a novel legal theory. This justification, aimed at allowing military action against narcotics distributors, has been reported by US media and critiqued by experts as likely illegal. President Trump has notified Congress of this determination, framing it as a response to an \"armed attack\" by drug cartels on the United States.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Statue of Trump and Epstein Removed for Permit Violation",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Fri, 03 Oct 2025 14:12:28 -0400",
    "source": "NPR",
    "sources": [
      "Axios",
      "NPR"
    ],
    "domains": [
      "news.google.com",
      "www.npr.org"
    ],
    "snippets": [
      "The statue honors Trump's \"long-lasting bond\" with Epstein, which the president denies. The National Park Service took down the statue after one day last week, saying it didn't comply with its permit.",
      "<a href=\"https://news.google.com/rss/articles/CBMigAFBVV95cUxQMEM1YXJuSjl6Y2QxTDdFVzlkNm1meFVZRVVoYms3LXhqX2ZJMm1EUEVucnp4UGdqNFJ5NXhiUWNZclBMMDBNbDg4M1d2QWZEYTJ1OWRXWERfR3prbXJtdFNjYmJQNDh6cEd2UGhzdkRNaWdjOXBBaDVJcHNxUHUxWQ?oc=5\" target=\"_blank\">Statue of Trump and Epstein holding hands is back on "
    ],
    "image_url": "",
    "titles": [
      "The Trump-Epstein statue is back on the National Mall, days after its abrupt removal",
      "Statue of Trump and Epstein holding hands is back on D.C.'s National Mall - Axios"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.96,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.679,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A statue depicting Donald Trump holding hands with Jeffrey Epstein was removed by the National Park Service one day after its installation due to non-compliance with its permit. The statue, which aimed to highlight Trump's alleged ties with Epstein, was taken down last week. Trump has denied any significant relationship with Epstein.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Tarleton State University Puts Coach Gillispie on Leave Amid Investigation",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Fri, 3 Oct 2025 15:44:15 EST",
    "source": "ESPN",
    "sources": [
      "Yahoo Sports",
      "ESPN"
    ],
    "domains": [
      "www.nbcsports.com",
      "www.espn.com"
    ],
    "snippets": [
      "Tarleton State coach Billy Gillispie has been placed on temporary administrative leave as the university investigates an anonymous complaint.",
      "The former Kentucky coach who also led the programs at Texas A&amp;M and Texas Tech has been at Tarleton State for five seasons. Gillispie faced allegations of player mistreatment at Texas Tech, where he spent one season."
    ],
    "image_url": "",
    "titles": [
      "Tarleton State coach Gillispie under investigation",
      "Tarleton State places Billy Gillispie on leave after getting anonymous complaint"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.991,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.678,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Tarleton State University has placed coach Billy Gillispie on temporary administrative leave to investigate an anonymous complaint against him. Gillispie, who has a history of controversies and health issues, is under review, but the specific nature of the complaint has not been disclosed.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Mets Overhaul Staff, Bench Coach Gibbons Exits Amid Changes",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Fri, 3 Oct 2025 15:44:15 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "After missing the playoffs despite the highest payroll in the MLB, the New York Mets are engaging in a large staffing overhaul.",
      "<p>A popular Toronto baseball man will be looking for a new job. John Gibbons told the New York Mets he is leaving his role as bench coach as part of a large overhaul of the team&#8217;s coaching staff, the team announced Friday.</p>"
    ],
    "image_url": "",
    "titles": [
      "Mets begin staff overhaul after missing playoffs",
      "John Gibbons out as bench coach as Mets overhaul coaching staff"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.991,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.678,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The New York Mets, after not making the playoffs despite having the MLB's highest payroll, are overhauling their staff. John Gibbons, the bench coach, announced his departure from the team as part of this major shake-up.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Vikings QB McCarthy Out for 3rd Game, Wentz to Start Amid O-Line Woes",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Fri, 3 Oct 2025 15:44:15 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "Vikings quarterback J.J. McCarthy will miss his third consecutive start because of a high right ankle sprain, turning once again to Carson Wentz behind an offensive line missing multiple starters.",
      "<p>Minnesota Vikings quarterback J.J. McCarthy will miss his third straight game because of a right ankle sprain.</p>"
    ],
    "image_url": "",
    "titles": [
      "QB McCarthy out; Wentz starts with battered OL",
      "Vikings QB J.J. McCarthy out vs. Browns, Carson Wentz to start"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.991,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.678,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Minnesota Vikings quarterback J.J. McCarthy will be sidelined for his third consecutive game due to a high right ankle sprain. In his absence, Carson Wentz will take over quarterback duties again, amid challenges posed by an offensive line weakened by the absence of several starters.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Drone Kills Journalist in Ukraine, a First: European Federation",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-10-03T19:38:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "New York Times"
    ],
    "domains": [
      "www.nytimes.com",
      "www.dw.com"
    ],
    "snippets": [
      "The European Federation of Journalists said Antoni Lallican's death marks the first time a journalist had been killed by a drone in the Ukraine conflict.",
      "Antoni Lallican, a Paris-based photographer, is the first working journalist to be killed by a remotely piloted drone during the war, according to press associations."
    ],
    "image_url": "",
    "titles": [
      "Ukraine: French photojournalist killed by Russian drone",
      "French Photojournalist Killed in Drone Attack in Ukraine"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.988,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.667,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Antoni Lallican, a Paris-based photographer, became the first journalist to be killed by a drone in the Ukraine conflict, as confirmed by the European Federation of Journalists. This incident marks a tragic milestone in the war, highlighting the dangers journalists face while reporting.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Hamas Open to Negotiating Gaza Conflict, Seeks Changes to Trump's Proposal",
    "domain": "general",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 19:52:12 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "New York Times"
    ],
    "domains": [
      "www.theguardian.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "<p>Group says it ‘affirms its readiness to engage through negotiators’ as it hands over response to president’s plan for Gaza</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/oct/02/hamas-likely-to-accept-trump-peace-plan-with-key-revisions-experts-say\">Hamas could ask for revisions to ",
      "The militant group responded to a proposal by President Trump to end the war in Gaza."
    ],
    "image_url": "https://i.guim.co.uk/img/media/9b4205aea3f4fabc735b6ffe16d553a37b6532ec/580_0_5802_4644/master/5802.jpg?width=140&quality=85&auto=format&fit=max&s=55d90b2fe64c29222876063698d0f35b",
    "titles": [
      "Hamas agrees to release all Israeli hostages, dead and alive, under Trump’s Gaza plan – live",
      "Hamas Says It Agrees to Release All Hostages in Gaza"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.973,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.667,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Hamas has indicated its willingness to negotiate, handing over a response to President Trump's proposal aimed at ending the Gaza conflict. While open to discussions, the group is expected to request key revisions to the plan.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Data Disruption Amid Uncertainty Delays Policy, Federal Funding Vote Friday",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 18:21:40 +0000",
    "source": "Al Jazeera",
    "sources": [
      "ABC News",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "abcnews.go.com"
    ],
    "snippets": [
      "Data interruption comes at a particularly uncertain time as policymakers need more data now than less.",
      "The next vote on bills that could get federal money flowing again is not scheduled until Friday, as thousands of workers remain furloughed and many government services are at a standstill."
    ],
    "image_url": "",
    "titles": [
      "Lack of data on government shutdown blurs US economy insights",
      "WATCH:  Government shutdown enters day 2"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.963,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.655,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A data interruption has occurred during a period of uncertainty, complicating policy decisions. The next vote to potentially resolve the issue and resume federal funding is set for Friday. Meanwhile, thousands of workers are furloughed, and numerous government services have halted.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Diddy Sentenced for Prostitution Transportation Charges",
    "domain": "general",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Fri, 03 Oct 2025 15:59:26 -0400",
    "source": "ABC News",
    "sources": [
      "The Guardian",
      "ABC News"
    ],
    "domains": [
      "www.theguardian.com",
      "abcnews.go.com"
    ],
    "snippets": [
      "Sean \"Diddy\" Combs will be sentenced on Friday after being found guilty of transportation to engage in prostitution.",
      "Sean \"Diddy\" Combs returned to a Manhattan courtroom on Friday to be sentenced on two counts of transportation for the purposes of prostitution.",
      "<p>Combs, who could face lengthy prison sentence after being convicted of prostitution charges in July, is expected to address the court</p><ul><li><p><a href=\"https://www.theguardian.com/music/2025/oct/03/sean-diddy-combs-criminal-sentencing\">Sean ‘Diddy’ Combs expected to speak in court</a></p></l",
      "<p>Prospect of light sentence for disgraced hip-hop mogul dims as judge says Combs has not fully expressed remorse</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/live/2025/oct/03/sean-diddy-combs-sentencing-trial-conviction-latest-updates\">Sean ‘Diddy’ Combs sentencing – latest updates</"
    ],
    "image_url": "https://s.abcnews.com/images/GMA/diddy-sketch-04-rt-jef-251003_1759514696803_hpMain_4x3t_384.jpg",
    "titles": [
      "Sean 'Diddy' Combs sentencing live updates: Combs set to address the court",
      "WATCH:  Sentencing day for Sean 'Diddy' Combs",
      "Sean ‘Diddy’ Combs sentencing live: mogul’s children say he is ‘changed man’; prosecutor says he is casting himself as ‘victim’",
      "Sean ‘Diddy’ Combs set to speak in court as prosecution witness backs out"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.996,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.654,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Sean \"Diddy\" Combs was sentenced on Friday after being found guilty of two counts of transportation for the purposes of prostitution. The music mogul, convicted in July, appeared in a Manhattan courtroom where he requested a second chance from the judge. The specifics of his sentence, including the length, were not provided in the summary content.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Colts' Pittman, Franklin Cleared to Play Against Raiders in Week 5",
    "domain": "sports",
    "source_domain": "coltswire.usatoday.com",
    "location": "national",
    "published": "Fri, 03 Oct 2025 19:48:52 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "coltswire.usatoday.com"
    ],
    "snippets": [
      "Will Colts' WR Michael Pittman play in Week 5 vs. the Raiders? Here's the latest injury update.",
      "Will Colts' LB Zaire Franklin play in Week 5 vs. Raiders? Here's the latest injury update."
    ],
    "image_url": "",
    "titles": [
      "Michael Pittman injury update: Will Colts WR play in Week 5 vs. Raiders?",
      "Zaire Franklin injury update: Will Colts LB play in Week 5 vs. Raiders?"
    ],
    "score_components": {
      "magnitude": 0.393,
      "recency": 0.992,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.473,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Colts' WR Michael Pittman and LB Zaire Franklin's playing status for Week 5 against the Raiders was uncertain due to injuries. However, the latest updates confirm that both players have been cleared to participate in the upcoming game.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UFC 320: Experts Pick Ankalaev vs. Pereira Winner, Betting Tips Highlighted",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Fri, 03 Oct 2025 19:00:44 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com"
    ],
    "snippets": [
      "Check out who the experts at CBS Sports are taking in the light heavyweight title bout in Las Vegas on Saturday",
      "SportsLine's Daniel Vithlani reveals his picks for the UFC 320: Ankalaev vs. Pereira fight card from T-Mobile Arena in Las Vegas on Saturday",
      "This weekend offers plenty of options to place a wager or two with UFC in Chicago"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/10/03/39256ac3-63b8-4dd2-b9a0-3147fe4ea509/ankalaev-pereira-2-presser.jpg",
    "titles": [
      "UFC 320 fight predictions -- Magomed Ankalaev vs. Alex Pereira 2: Expert picks for each main card bout",
      "UFC 320 odds, props, predictions, fight card: Ankalaev vs. Pereira picks, best bets by proven MMA insider",
      "UFC 320 best bets: Target props in Magomed Ankalaev vs. Alex Pereira, Merab Dvalishvili vs. Cory Sandhagen"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.976,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.463,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Experts at CBS Sports and SportsLine's Daniel Vithlani have made their picks for the UFC 320: Ankalaev vs. Pereira light heavyweight title fight at T-Mobile Arena in Las Vegas. Additionally, the event presents various betting opportunities for viewers this weekend in Chicago.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]