[
  {
    "title": "Trump Deploys National Guard to LA; Critics Call It a Diversion Tactic",
    "domain": "general",
    "location": "national",
    "published": "Mon, 9 Jun 2025 22:37:30 GMT",
    "source": "LA Times",
    "sources": [
      "LA Times"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "<p>President Trump's dispatch of National Guard troops to L.A. is straight from his political playbook. It may serve his interests by distracting and deflecting but abdicates presidential responsibility.</p>"
    ],
    "image_url": "https://ca-times.brightspotcdn.com/dims4/default/719aa6a/2147483647/strip/false/crop/8192x5464+0+0/resize/1500x1000!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fed%2F0c%2Fd07fb71742dbb60d50d2f70f35dc%2F1509557-me-ice-immigration-protest-jja-0006.jpg",
    "titles": [
      "Barabak: Putting the bully in bully pulpit, Trump escalates in L.A. rather than seeking calm"
    ],
    "summary": "President Trump ordered National Guard troops to Los Angeles, a move critics argue is a tactic to divert attention and shirk presidential duties. This action is seen as consistent with his political strategy.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness of the situation, but it lacks depth or insight. It does not provide any actionable insights or deeper understanding for the reader, nor does it report on solutions or improvements. It also does not increase clarity around systems, causes, trends, or impacts.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.969,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.413
  },
  {
    "title": "Mexico's President Urges Calm Among Mexicans in LA Amid Violence",
    "domain": "general",
    "location": "national",
    "published": "Mon, 9 Jun 2025 20:53:26 GMT",
    "source": "LA Times",
    "sources": [
      "LA Times"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "<p>Mexico's president condemned violence in L.A. but stopped short of directly criticizing Trump administration and called for calm among Mexican citizens in California. </p>"
    ],
    "image_url": "https://ca-times.brightspotcdn.com/dims4/default/93b58f0/2147483647/strip/false/crop/5976x3986+0+0/resize/1500x1001!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fd1%2Fe8%2F3eaaf6d443f09c142699c5b1ace6%2F1509557-me-ice-immigration-protest-jja-0081.jpg",
    "titles": [
      "Mexican president condemns L.A. violence, calls on Mexicans to act peacefully"
    ],
    "summary": "Mexico's President condemned the violence occurring in Los Angeles, urging Mexican citizens in California to remain calm. However, he did not directly criticize the Trump administration in his statements.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information to a specific audience (Mexican citizens in LA) and contextualizes the situation for them. However, it does not report on any solutions or improvements, and it only provides minimal insight into the causes or impacts of the violence.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.935,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.409
  },
  {
    "title": "Trump Deploys National Guard to Curb Violence, White House Says",
    "domain": "general",
    "location": "national",
    "published": "Mon, 9 Jun 2025 18:28:52 GMT",
    "source": "LA Times",
    "sources": [
      "LA Times"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "<p>White House press secretary Karoline Leavitt said President Trump called in the National Guard with the expectation that it would 'hopefully prevent and deter some of this violence.'</p>"
    ],
    "image_url": "",
    "titles": [
      "Breakdown between Trump and Newsom fueling Los Angeles crisis"
    ],
    "summary": "President Trump deployed the National Guard, aiming to mitigate violence, as stated by White House press secretary Karoline Leavitt. The decision reflects an effort to prevent and deter violent incidents.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful information and context about the decision to deploy the National Guard. It reports on an attempt to solve a problem (violence), but it does not provide a thorough analysis of the effectiveness of this solution or its potential impacts.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.889,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.427
  },
  {
    "title": "Colombian Mercenaries Recruited by Mexican Drug Cartels",
    "domain": "general",
    "location": "national",
    "published": "Mon, 9 Jun 2025 10:00:00 GMT",
    "source": "LA Times",
    "sources": [
      "LA Times"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "<p>Colombian mercenaries are being lured to Mexico to fight for powerful drug trafficking groups such as the Jalisco New Generation cartel. </p>"
    ],
    "image_url": "",
    "titles": [
      "A dangerous new element in Mexico's cartel wars: Colombian mercenaries"
    ],
    "summary": "Colombian mercenaries are being recruited to join the ranks of major drug trafficking organizations in Mexico, including the Jalisco New Generation cartel. These individuals are drawn to Mexico for the purpose of engaging in conflicts on behalf of these powerful groups.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story provides basic awareness about the recruitment of Colombian mercenaries by Mexican drug cartels. However, it lacks depth and insight into the reasons behind this recruitment, the implications for the region, or potential solutions to this issue.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.745,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.361
  },
  {
    "title": "Esports World Cup Preparations Underway with $70M Prize Pool",
    "domain": "general",
    "location": "national",
    "published": "Mon, 9 Jun 2025 10:00:00 GMT",
    "source": "LA Times",
    "sources": [
      "LA Times"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "<p>With the Esports World Cup quickly approaching, the office of the foundation organizing the tournament was buzzing with employees running qualifying matches and finalizing the opening ceremony of the competition with a $70-million prize pool. </p>"
    ],
    "image_url": "",
    "titles": [
      "From fatwas to 'Fortnite': Saudi Arabia's $38-billion play to rule esports"
    ],
    "summary": "The Esports World Cup is nearing, and the organizing foundation's office is actively preparing by running qualifying matches and planning the opening ceremony. The tournament features a $70-million prize pool, indicating a significant event in the esports industry.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The story is useful in informing readers about the upcoming Esports World Cup and its significance in the esports industry, indicated by the large prize pool. However, it doesn't explicitly highlight any progress, solutions, or empowering knowledge.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.745,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.391
  },
  {
    "title": "Public Disorder in Ballymena After Protest Over Alleged Assault",
    "domain": "general",
    "location": "global",
    "published": "Mon, 09 Jun 2025 23:55:06 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "<p>Police in Northern Ireland say a number of missiles had been thrown towards officers and damage to properties had been reported</p><p>Public disorder broke out in Ballymena in Northern Ireland, with police saying a number of missiles had been thrown towards officers after crowds gathered near the site of an alleged sexual assault in the town.</p><p>The unrest follows a protest in the area, about 30 minutes’s drive from the capital city of Belfast, earlier on Monday evening, the police statement said, adding damage had been reported to a number of properties.</p> <a..."
    ],
    "image_url": "https://i.guim.co.uk/img/media/6f1f8874c30b64b0ef6bfea1fb2235d94cee41b2/0_0_5000_4000/master/5000.jpg?width=140&quality=85&auto=format&fit=max&s=a7a68e91b873d04771d97b01b69054b1",
    "titles": [
      "Public disorder breaks out in Northern Ireland town Ballymena after alleged sexual assault"
    ],
    "summary": "In Ballymena, Northern Ireland, public disorder erupted following a protest related to an alleged sexual assault. Police reported that missiles were thrown at officers and several properties were damaged during the unrest. The incident occurred approximately 30 minutes from Belfast.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "The story offers basic awareness about a public disorder incident in Ballymena. However, it lacks depth, insight, or context about the underlying issues leading to the protest, the response from authorities, or potential solutions to prevent such incidents in the future.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.996,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.391
  },
  {
    "title": "Protester Injured by Rubber Bullet in LA; Sussan Ley to Speak at Press Club",
    "domain": "general",
    "location": "global",
    "published": "Mon, 09 Jun 2025 23:48:43 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "<p>Lauren Tomasi has described her experience at the immigration protest in LA yesterday, saying a rubber bullet had left quite the mark on her leg. Follow today’s news live</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p><strong>Sussan Ley to be first opposition leader since 2022 to address National Press Club later this month</strong></p><p>The..."
    ],
    "image_url": "https://i.guim.co.uk/img/media/072c79f055013c47d1c1ef6cdcc0509d6db2a7f9/243_0_2700_2160/master/2700.jpg?width=140&quality=85&auto=format&fit=max&s=aa08bb8ba569358684374f30d34639bf",
    "titles": [
      "Australia news live: Nine reporter shot by rubber bullet says she has ‘big old bruise’"
    ],
    "summary": "At an immigration protest in Los Angeles, Lauren Tomasi reported being hit by a rubber bullet, resulting in a significant mark on her leg. This incident was part of the larger events covered in yesterday's news. Additionally, Sussan Ley is set to become the first opposition leader since 2022 to address the National Press Club later this month, indicating a noteworthy political event on the horizon.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story provides basic awareness about the situation at the immigration protest in Los Angeles and the political event involving Sussan Ley. However, it lacks depth or insight into the causes, impacts, or potential solutions to the issues presented.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.994,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.411
  },
  {
    "title": "700 Marines Deployed to LA Amid Immigration Protests, Challenges Noted",
    "domain": "general",
    "location": "global",
    "published": "Mon, 09 Jun 2025 23:44:02 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "<p>US military’s Northern Command confirms 700 marines to be sent to the city but LAPD chief Jom McDonnell says this presents ‘significant’ challenges </p><ul><li><p><a href=\"https://www.theguardian.com/us-news/2025/jun/09/marines-los-angeles-trump\">Pentagon deploys 700 US marines to LA amid immigration protests</a></p></li><li><p><a href=\"https://www.theguardian.com/us-news/2025/jun/09/los-angeles-immigration-raids-detained\">‘Kidnapped’: families and lawyers desperate to contact the detained</a></p></li></ul><p><strong>About 300 Guard troops have been deployed to LA so..."
    ],
    "image_url": "https://i.guim.co.uk/img/media/4d94e20c35deedb3a61d005fc998064e90c0fb84/496_0_4958_3966/master/4958.jpg?width=140&quality=85&auto=format&fit=max&s=a1e60224e699c1f1f6c35c39e93ef7a0",
    "titles": [
      "Los Angeles police chief says deployment of marines a surprise that could make policing protests harder – live"
    ],
    "summary": "The US Northern Command has confirmed the deployment of 700 Marines to Los Angeles in response to immigration protests. LAPD Chief Jom McDonnell highlighted that this move poses 'significant' challenges. The deployment is part of a larger response that also includes about 300 National Guard troops. This action comes amid heightened tensions and concerns from families and lawyers struggling to contact those detained during immigration raids in the city.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the response to the immigration protests in Los Angeles, including the deployment of Marines and National Guard troops. It also highlights the challenges associated with this response. However, it does not provide solutions or progress towards resolving the situation.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.992,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.42
  },
  {
    "title": "Lewandowski Feels Betrayed by Coach, Steps Back from Poland Team",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 9 Jun 2025 19:54:59 EST",
    "source": "ESPN",
    "sources": [
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Robert Lewandowski says he feels betrayed by coach Michał Probierz and that it will be difficult to forget the events which led to him stepping away from Poland."
    ],
    "image_url": "",
    "titles": [
      "Lewandowski: Poland boss 'betrayed my trust'"
    ],
    "summary": "Robert Lewandowski has expressed feelings of betrayal by coach Michał Probierz, leading to his decision to step away from playing for Poland. He stated that the events surrounding this situation are difficult for him to forget, indicating a significant strain in their relationship.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about Robert Lewandowski's decision to step away from the Poland team due to a strained relationship with the coach. However, it lacks depth, actionable insights, or a broader context about the implications of this decision for the team or the sport.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.996,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.416
  },
  {
    "title": "Tottenham Spurs Eye Thomas Frank as New Head Coach: ESPN",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 9 Jun 2025 19:54:59 EST",
    "source": "ESPN",
    "sources": [
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Tottenham Hotspur are increasingly hopeful of appointing Thomas Frank as their new head coach, sources have told ESPN."
    ],
    "image_url": "",
    "titles": [
      "Sources: Spurs hopeful of naming Frank as coach"
    ],
    "summary": "Tottenham Hotspur is reportedly optimistic about hiring Thomas Frank as their new head coach, according to sources cited by ESPN.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about a potential change in Tottenham Hotspur's management but doesn't offer deep insights or actionable information for the reader.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.996,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.416
  },
  {
    "title": "Manchester City Signs Wolves' Left-Back Rayan Aït-Nouri",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 9 Jun 2025 19:54:59 EST",
    "source": "ESPN",
    "sources": [
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Manchester City have completed the signing of Wolves' left-back Rayan Aït-Nouri, the club have announced."
    ],
    "image_url": "",
    "titles": [
      "Man City complete $42.2M deal for LB Aït-Nouri"
    ],
    "summary": "Manchester City has officially signed Wolves' left-back Rayan Aït-Nouri, as confirmed by the club.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "The story informs about a new signing in Manchester City but lacks depth or insight into the potential impact of this signing on the team's performance or tactics.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.996,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.416
  },
  {
    "title": "Manchester City Nears Deal to Sign Lyon Forward Rayan Cherki: ESPN",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 9 Jun 2025 19:54:59 EST",
    "source": "ESPN",
    "sources": [
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Manchester City expect to clinch a deal to sign Lyon forward Rayan Cherki, sources have told ESPN."
    ],
    "image_url": "",
    "titles": [
      "Sources: City closing on $45.6M deal for Cherki"
    ],
    "summary": "Manchester City is anticipated to finalize a deal to sign Rayan Cherki, a forward from Lyon, according to sources reported by ESPN.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic information about a potential signing by Manchester City. However, it doesn't delve into the implications of this signing or provide actionable insights for the reader.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.996,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.416
  },
  {
    "title": "Premier League Champions Eye Eintracht Frankfurt's Hugo Ekitike",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 9 Jun 2025 19:45:16 EST",
    "source": "ESPN",
    "sources": [
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "The reigning Premier League champions are eyeing a move for Eintracht Frankfurt striker Hugo Ekitike. Transfer Talk has the latest news, gossip and rumors."
    ],
    "image_url": "",
    "titles": [
      "Transfer rumors, news: Liverpool join race to sign Ekitike"
    ],
    "summary": "The current Premier League champions are reportedly interested in signing Eintracht Frankfurt striker Hugo Ekitike, according to Transfer Talk. This development is part of the latest news, gossip, and rumors surrounding football transfers.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers basic awareness of the potential transfer of a player, but it doesn't provide any depth or insight into why this transfer is significant or what impact it could have on the teams involved.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.993,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.416
  },
  {
    "title": "Cristiano Ronaldo Confirms Stay at Al Nassr, Ends Exit Rumors",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 9 Jun 2025 19:41:00 EST",
    "source": "ESPN",
    "sources": [
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Cristiano Ronaldo has ended speculation regarding his future by confirming he will remain at Al Nassr."
    ],
    "image_url": "",
    "titles": [
      "Ronaldo to stay at Al Nassr? 'Nothing will change'"
    ],
    "summary": "Cristiano Ronaldo has confirmed he will stay with Al Nassr, ending speculation about his future. This announcement puts to rest any rumors about him leaving the club.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about Cristiano Ronaldo's decision to stay with his current club, but it doesn't provide any additional context or analysis about why this decision is important or what it means for the player or the club.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.991,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.415
  },
  {
    "title": "Packers Release Pro Bowl CB Jaire Alexander Amid Contract Talks",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 9 Jun 2025 19:36:27 EST",
    "source": "ESPN",
    "sources": [
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "The Packers have released two-time Pro Bowl cornerback Jaire Alexander after the sides couldn't come to an agreement on a revised contract."
    ],
    "image_url": "",
    "titles": [
      "Packers cut CB Alexander after contract impasse"
    ],
    "summary": "The Green Bay Packers have released Jaire Alexander, a two-time Pro Bowl cornerback, due to unsuccessful negotiations on a revised contract.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information about the release of a player due to unsuccessful contract negotiations. However, it lacks further context or analysis about the implications of this decision for the team or the player's career.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.99,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.75
    },
    "score": 0.452
  },
  {
    "title": "Mark Pulisic Defends Son Against Donovan's Criticism Over Gold Cup Absence",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 9 Jun 2025 19:36:27 EST",
    "source": "ESPN",
    "sources": [
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Christian Pulisic's dad, Mark, hit back at Landon Donovan on Monday after the U.S. soccer great appeared to criticize the midfielder for his decision to sit out the upcoming Gold Cup to rest after wrapping up his season with AC Milan."
    ],
    "image_url": "",
    "titles": [
      "Pulisic likes dad's response to Donovan criticism"
    ],
    "summary": "Mark Pulisic defended his son, Christian Pulisic, against criticism from Landon Donovan regarding Christian's decision to skip the Gold Cup for rest after his season with AC Milan. Donovan, a U.S. soccer legend, had publicly questioned Christian's commitment, leading to Mark's rebuttal. This disagreement highlights differing views on player rest and commitment within the soccer community.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness about a disagreement within the soccer community. However, it lacks depth or insight into the broader implications of this disagreement, such as the impact on player health or team dynamics.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.99,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.75
    },
    "score": 0.442
  },
  {
    "title": "Newsom Criticizes Trump's Proposal to Federalize National Guard as \"Unhinged\"",
    "domain": "business",
    "location": "national",
    "published": "Mon, 09 Jun 2025 23:52:54 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "President Donald Trump is \"unhinged right now,\" said Gov. Gavin Newsom said, arguing that federalizing National Guard troops for the protests was illegal."
    ],
    "image_url": "",
    "titles": [
      "Trump plans to deploy 2,000 more National Guard troops to LA, Newsom says"
    ],
    "summary": "Governor Gavin Newsom criticized President Donald Trump, describing him as \"unhinged\" in response to Trump's proposal to federalize National Guard troops to manage protests. Newsom argued that such an action would be illegal, highlighting a disagreement on the approach to handling the demonstrations.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "The story provides a surface-level understanding of a political disagreement but does not delve into the legal or societal implications of the proposed action. It is more reactive and sensational, focusing on the use of the term 'unhinged' rather than providing actionable insights or a deeper understanding of the issue.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.995,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.398
  },
  {
    "title": "Initiative Proposes $1,000 Investment Accounts for Every Newborn in U.S.",
    "domain": "business",
    "location": "global",
    "published": "Mon, 09 Jun 2025 23:11:31 +0000",
    "source": "Fortune",
    "sources": [
      "Fortune"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "A new proposal would create tax-deferred investment accounts for babies born in the U.S. over the next four years, starting them each with $1,000."
    ],
    "image_url": "https://fortune.com/img-assets/wp-content/uploads/2025/06/GettyImages-2219359251.jpg?w=2048",
    "titles": [
      "Trump wants $1,000 investment accounts to help newborn Americans get a ‘big jump on life.’ Critics say poor families have more immediate needs"
    ],
    "summary": "A proposed initiative aims to establish tax-deferred investment accounts for every child born in the U.S. within a four-year period, providing an initial deposit of $1,000 for each account.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story clearly highlights a proposed solution to a societal problem, potentially contributing to financial security for future generations. It provides useful information about the initiative and could empower readers to support or oppose it based on their understanding of its implications.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.981,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.448
  },
  {
    "title": "Chipotle Targets 7,000 North American Locations in Expansion Plan",
    "domain": "business",
    "location": "global",
    "published": "Mon, 09 Jun 2025 23:09:53 +0000",
    "source": "Fortune",
    "sources": [
      "Fortune"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Chipotle has plans to operate 7,000 locations in North America."
    ],
    "image_url": "https://fortune.com/img-assets/wp-content/uploads/2025/06/54579001115_a8761f0cf0_6k-e1749509740517.jpg?w=2048",
    "titles": [
      "Chipotle CEO says they will open a new restaurant almost every 24 hours this year, thanks to AI"
    ],
    "summary": "Chipotle announced its ambition to expand its presence in North America by operating 7,000 locations. This plan marks a significant increase from its current number of restaurants, aiming to bolster its footprint across the continent.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about Chipotle's expansion plans, but it doesn't provide deeper insights or actionable information for the reader. It does not mention how this expansion might affect consumers, employees, or the restaurant industry as a whole.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.98,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.408
  },
  {
    "title": "Power Station Site Funding Hits £17.8 Billion in Taxpayer Investment",
    "domain": "business",
    "location": "global",
    "published": "Mon, 09 Jun 2025 23:01:50 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Latest money increases the total taxpayer investment in the power station site to £17.8bn"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F7faab7ca-0ea9-441e-8ef6-46c0480ccbc5.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "UK pledges £11.5bn of new state funding for Sizewell C nuclear plant"
    ],
    "summary": "The latest funding for the power station site has elevated the total taxpayer investment to £17.8 billion.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "The story informs about an increase in taxpayer investment in a power station site, but it lacks depth and context. It doesn't explain what the power station is for, why it needs so much funding, or what the implications of this investment might be for taxpayers.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.978,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.388
  },
  {
    "title": "Eco-Friendly Destinations Target Corporate Travelers Seeking Sustainable Options",
    "domain": "business",
    "location": "global",
    "published": "Mon, 09 Jun 2025 23:01:22 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Destinations chosen to draw corporate customers looking for alternatives to air travel"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F9d30fba4-2cf3-4384-8fa2-cbffa91e2dc7.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Eurostar plans services to Frankfurt and Geneva to tap demand for greener travel"
    ],
    "summary": "Several destinations have been selected specifically to attract corporate customers seeking alternatives to traditional air travel. These locations are being marketed as convenient, eco-friendly options for business travel, aiming to meet the growing demand for sustainable and efficient transportation solutions among corporate clients.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story offers useful information about a trend in corporate travel towards more sustainable options. It provides awareness about the growing demand for eco-friendly travel solutions and how some destinations are responding to this trend. However, it doesn't highlight specific solutions or progress in making corporate travel more sustainable.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.978,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.445
  },
  {
    "title": "Jim Cramer Analyzes Circle Internet's Market Debut Impact",
    "domain": "business",
    "location": "national",
    "published": "Mon, 09 Jun 2025 23:00:17 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "CNBC's Jim Cramer on Monday examined Circle Internet, a stablecoin issuer that made a splash during its market debut last week."
    ],
    "image_url": "",
    "titles": [
      "Jim Cramer says Circle Internet stock is 'too hot' to buy up here"
    ],
    "summary": "Jim Cramer, a CNBC commentator, discussed Circle Internet, a company that issues stablecoins, focusing on its significant impact during its initial market appearance last week.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful information about Circle Internet's market debut, which can help readers understand the company's performance and its potential impact on the market. However, it doesn't report on solutions, improvements, or attempts to solve problems, and doesn't provide enough context to increase clarity around systems, causes, trends, or impacts.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.977,
      "consensus": 0.393,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.427
  },
  {
    "title": "Marines Mobilize Towards Los Angeles from Twentynine Palms Base",
    "domain": "business",
    "location": "global",
    "published": "Mon, 09 Jun 2025 22:48:39 +0000",
    "source": "Fortune",
    "sources": [
      "Fortune"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "The Marines were moving toward LA from their base at Twentynine Palms in the Southern California desert."
    ],
    "image_url": "https://fortune.com/img-assets/wp-content/uploads/2025/06/GettyImages-2218832060-e1749508749471.jpg?w=2048",
    "titles": [
      "700 Marines will be deployed to LA to help the National Guard respond to protests as California sues Trump over troops"
    ],
    "summary": "A group of Marines was reported to be moving towards Los Angeles from their base at Twentynine Palms in the Southern California desert. The current status or purpose of this movement was not provided in the information available.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "The story offers basic awareness about the movement of Marines, but it lacks depth and insight as it doesn't provide the reason or purpose behind this movement. This lack of context makes it less useful for readers' understanding or decision-making.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.973,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.387
  },
  {
    "title": "Waymo Halts Service in Downtown LA Amid Protests for Safety",
    "domain": "business",
    "location": "global",
    "published": "Mon, 09 Jun 2025 22:45:49 +0000",
    "source": "Fortune",
    "sources": [
      "Fortune"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Waymo halted service in the downtown Los Angeles area on Monday as the demonstrations continued."
    ],
    "image_url": "https://fortune.com/img-assets/wp-content/uploads/2025/06/GettyImages-2218782242.jpg?w=2048",
    "titles": [
      "At least 6 Waymo autonomous vehicles have been vandalized amid anti-ICE protests in Los Angeles"
    ],
    "summary": "Waymo temporarily suspended its service in downtown Los Angeles on Monday due to ongoing demonstrations in the area. The company took this measure to ensure safety amid the protests.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs readers about Waymo's decision to suspend its service due to protests, providing a useful context about the company's response to a crisis situation. However, it doesn't report on any solutions or improvements, nor does it provide enough information to increase clarity around the system, causes, trends, or impacts of the protests.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.972,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.416
  },
  {
    "title": "ETH Zurich Unravels Mystery of Earth's Deep D' Layer Seismic Phenomenon",
    "domain": "science",
    "location": "global",
    "published": "Sun, 08 Jun 2025 22:21:55 EDT",
    "source": "ScienceDaily",
    "sources": [
      "ScienceDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Beneath Earth s surface, nearly 3,000 kilometers down, lies a mysterious layer where seismic waves speed up inexplicably. For decades, scientists puzzled over this D' layer. Now, groundbreaking experiments by ETH Zurich have finally revealed that solid rock flows at extreme depths, acting like liquid in motion. This horizontal mantle flow aligns mineral crystals called post-perovskite in a single direction, explaining the seismic behavior. It s a stunning leap in understanding Earth s deep inner mechanics, transforming a long-standing mystery into a vivid map of subterranean currents that..."
    ],
    "image_url": "",
    "titles": [
      "Earth's core mystery solved: How solid rock flows 3,000 kilometers beneath us"
    ],
    "summary": "ETH Zurich scientists have discovered that the mysterious D' layer, located nearly 3,000 kilometers beneath Earth's surface, where seismic waves inexplicably speed up, is due to solid rock flowing like liquid at extreme depths. This flow aligns post-perovskite mineral crystals in a single direction, which accounts for the observed seismic behavior. This breakthrough provides a significant advance in understanding Earth's inner mechanics, transforming a decades-old mystery into a clear depiction of subterranean currents.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive as it provides a deep understanding of a previously unexplained natural phenomenon. It highlights the progress made in the field of Earth Science and offers valuable insights into Earth's inner mechanics, which could contribute to future research and innovations.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.636,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.379
  },
  {
    "title": "Quantum Computers Boost Machine Learning with New Circuit, Cut Energy Use",
    "domain": "science",
    "location": "global",
    "published": "Sun, 08 Jun 2025 22:20:02 EDT",
    "source": "ScienceDaily",
    "sources": [
      "ScienceDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "A team of researchers has shown that even small-scale quantum computers can enhance machine learning performance, using a novel photonic quantum circuit. Their findings suggest that today s quantum technology isn t just experimental it can already outperform classical systems in specific tasks. Notably, this photonic approach could also drastically reduce energy consumption, offering a sustainable path forward as machine learning s power needs soar."
    ],
    "image_url": "",
    "titles": [
      "Photonic quantum chips are making AI smarter and greener"
    ],
    "summary": "Researchers have demonstrated that small-scale quantum computers can improve machine learning by using a new photonic quantum circuit. This advancement shows that current quantum technology can surpass classical systems in certain tasks and significantly lower energy consumption, providing a sustainable solution for the increasing power demands of machine learning.",
    "constructiveness_score": 1.0,
    "constructiveness_reason": "This news piece is very constructive. It reports on a significant innovation in the field of quantum computing and its potential to improve machine learning. It also highlights the solution to a major challenge - the increasing power demands of machine learning. This information can be useful for decision-making in the tech industry.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.635,
      "consensus": 0.393,
      "constructiveness": 1.0,
      "proximity": 0.5
    },
    "score": 0.389
  },
  {
    "title": "Underwater Drone Finds 18th-Century San José Galleon in Colombian Caribbean",
    "domain": "science",
    "location": "global",
    "published": "Mon, 09 Jun 2025 19:00:03 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Researchers have used an unmanned underwater vehicle to carry out a non-intrusive investigation of an 18th-century AD shipwreck in the Colombian Caribbean, revealing it is likely the San José Galleon, the lost flagship of one of the most-important cargo fleets of the Hispanic Monarchy. The study is published in Antiquity."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/what-the-coins-of-the-1.jpg",
    "titles": [
      "What the coins of the San José Galleon shipwreck reveal"
    ],
    "summary": "Researchers utilized an unmanned underwater vehicle to explore an 18th-century shipwreck in the Colombian Caribbean, identifying it as the likely San José Galleon, a significant flagship of the Hispanic Monarchy's cargo fleet. This non-intrusive investigation's findings were published in the journal Antiquity, providing valuable insights into the historical shipwreck.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it provides useful information about the application of modern technology (underwater drones) in historical research. It increases awareness about the potential of such technology in non-intrusive investigations. However, it could have provided more insights into the implications of the findings or the historical context of the shipwreck.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.977,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.437
  },
  {
    "title": "SpaceX Starlink Satellites Disrupt Astronomical Research with Radio Interference",
    "domain": "science",
    "location": "global",
    "published": "Mon, 09 Jun 2025 18:00:55 +0100",
    "source": "New Scientist",
    "sources": [
      "New Scientist"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Our ability to study faint radio signals from when the first stars began to form is being threatened by SpaceX's Starlink satellites, which seem to be unintentionally leaking radio signals that overpower astronomers' telescopes"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/06/09134308/SEI_254524859.jpg",
    "titles": [
      "Starlink satellites are leaking radio signals that may ruin astronomy"
    ],
    "summary": "SpaceX's Starlink satellites are inadvertently emitting radio signals that interfere with astronomers' telescopes, hindering the study of faint radio signals from the universe's early stars. This issue threatens ongoing research into the cosmos' formative periods.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story is constructive in that it brings awareness to the unintended side effects of technological advancements, specifically SpaceX's Starlink satellites. However, it does not provide actionable insights or discuss potential solutions to the problem, limiting its usefulness and progress score.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.863,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.394
  },
  {
    "title": "Global Study Highlights Benefits of Walking, Cycling Policies in Cities",
    "domain": "science",
    "location": "global",
    "published": "Mon, 09 Jun 2025 17:21:04 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "A new study published in the Proceedings of the National Academy of Sciences reveals the transformative potential of walking- and cycling-friendly policies in cities around the world. Conducted by researchers from UCLA and Google, the study analyzed travel data from more than 11,500 cities across 121 countries, making it the most comprehensive global assessment to date of active transportation, or the potential for walking or biking."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/active-travel-study-id.jpg",
    "titles": [
      "'Active travel' study identifies pathways for designing walking- and cycling-friendly cities"
    ],
    "summary": "A study published in the Proceedings of the National Academy of Sciences, conducted by UCLA and Google researchers, assessed travel data from over 11,500 cities in 121 countries. It is the largest global analysis of active transportation to date, focusing on the potential benefits of walking and cycling-friendly policies. The study highlights the transformative impact such policies could have on cities worldwide, promoting healthier and more sustainable urban environments.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive. It provides useful insights from a large-scale study, highlighting the benefits of walking and cycling-friendly policies. It reports on potential solutions for healthier and more sustainable urban environments, thus contributing to the reader's understanding and decision-making.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.944,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.441
  },
  {
    "title": "Michigan State Astrophysicists Aim to Solve Cosmic Ray Mystery",
    "domain": "science",
    "location": "global",
    "published": "Mon, 09 Jun 2025 17:06:04 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "New research published by Michigan State University astrophysicists could help scientists answer a century-old question: Where did galactic cosmic rays come from?"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/where-did-cosmic-rays.jpg",
    "titles": [
      "Where did cosmic rays come from? Astrophysicists are closer to finding out"
    ],
    "summary": "Michigan State University astrophysicists have published new research that could assist in solving a century-old mystery regarding the origins of galactic cosmic rays. This study aims to provide insights into the source of these high-energy particles that travel through space, potentially advancing our understanding of cosmic phenomena.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it reports on the progress in understanding cosmic phenomena, specifically the origins of galactic cosmic rays. However, it lacks actionable insights for the reader, and the impact of this research on broader systems or trends is not clearly discussed, limiting its score.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.939,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.437
  },
  {
    "title": "Tumors Use Nervous System to Thrive; New Treatments Emerge",
    "domain": "science",
    "location": "global",
    "published": "Mon, 09 Jun 2025 17:00:03 +0100",
    "source": "New Scientist",
    "sources": [
      "New Scientist"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "A new understanding of how tumours exploit our nervous system is leading to new ways to treat cancer using familiar drugs like Botox and beta blockers"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/05/29114711/SEI_252606890.jpg",
    "titles": [
      "The chilling discovery that nerve cells help cancers grow and spread"
    ],
    "summary": "Research has revealed that tumors can manipulate the nervous system to their advantage, prompting innovative cancer treatment methods. By utilizing well-known medications such as Botox and beta blockers, scientists are developing strategies to counteract this manipulation. This approach marks a significant advancement in cancer therapy, offering potential new avenues for treatment.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it provides useful information about a new approach in cancer treatment. It also reports on progress in the field of cancer research, highlighting the innovative use of existing medications to counteract tumor manipulation of the nervous system. The story empowers readers with knowledge about advancements in cancer therapy.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.845,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.421
  },
  {
    "title": "First Sauropod Fossil with Stomach Contents Found, Reveals Diet Insights",
    "domain": "science",
    "location": "global",
    "published": "Mon, 09 Jun 2025 17:00:01 +0100",
    "source": "New Scientist",
    "sources": [
      "New Scientist"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "A sauropod dinosaur fossil has been found with preserved stomach contents for the first time, providing insights into what they ate and how"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/06/05160216/SEI_254368813.jpg",
    "titles": [
      "Sauropod dinosaur's last meal reveals that it didn't bother to chew"
    ],
    "summary": "For the first time, a sauropod dinosaur fossil with preserved stomach contents has been discovered, offering unprecedented insights into the diet and feeding habits of these ancient creatures. This finding allows scientists to understand more about the types of plants these dinosaurs consumed and their ecological role during their era.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is informative and provides a deeper understanding of the diet and feeding habits of sauropod dinosaurs. While it does not necessarily offer actionable insights for the reader, it does increase awareness about the ecological role of these dinosaurs during their era. However, it falls short of reporting on solutions or improvements, hence the score.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.845,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.411
  }
]