[
  {
    "title": "Trump Proposes 20-Point Gaza Peace Plan, Threatens Hamas with Consequences",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 15:57:37 GMT",
    "source": "BBC",
    "sources": [
      "Financial Times",
      "Al Jazeera",
      "The Guardian",
      "New York Times",
      "Forbes",
      "Le Monde",
      "BBC",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "www.bbc.com",
      "www.aljazeera.com",
      "www.ft.com",
      "www.theguardian.com",
      "www.forbes.com",
      "www.nytimes.com",
      "www.lemonde.fr"
    ],
    "snippets": [
      "The 20-point proposal seeks to end the fighting immediately in return for the release of hostages and detained Gazans.",
      "US president has pushed a 20-point plan to &#039;redevelop&#039; Gaza that critics say fails to support Palestinian sovereignty.",
      "« Si cet accord de la dernière chance n’est pas trouvé, l’enfer se déchaînera comme jamais contre le Hamas », a écrit le président américain, peu après que le mouvement islamiste palestinien eut indiqué avoir besoin de plus de temps pour étudier la proposition américaine.",
      "<a href=\"https://news.google.com/rss/articles/CBMieEFVX3lxTE4yS2JEQU1ySW5fRXd3Tkxsc0hsYWVSb2Z0SW1xWFY3dTF5RUlPd0pYWFRKMFYweEs3emJ4NWpsR2FieU1MLW1zei1ZTi1wQjczYmxNVWRKVFRnU20wcGo2VmhfVnZpeW1ldkJWWVZIdG1tcDhvYUROYQ?oc=5\" target=\"_blank\">Trump says Hamas must accept Gaza peace deal by Sunday, or war es",
      "US president warns militant group that ‘all HELL . . . will break out’ if it does not sign up to his deal",
      "President Trump said Hamas would be “extinguished” if it did not agree to a cease-fire proposed by the United States.",
      "Trump’s proposal would place Gaza under the temporary control of a “Board of Peace” with himself as chairman.",
      "<p>Hamas reportedly split on response to deal as US president sets Sunday deadline for militant group to reply</p><p>Egypt and Qatar are working to convince Hamas to accept Donald Trump’s ultimatum to end the war in Gaza, Egypt’s foreign minister has said, as Trump gave a Sunday deadline to reply.</"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/a46e/live/6323eda0-a067-11f0-b2f9-dd258cdb2dcd.png",
    "titles": [
      "Trump gives Hamas Sunday deadline to accept Gaza peace plan",
      "Trump issues Sunday ultimatum for Hamas to accept Gaza plan",
      "EN DIRECT, Gaza : Donald Trump fixe un nouvel ultimatum au Hamas pour accepter son plan de paix, avant dimanche soir",
      "Trump says Hamas must accept Gaza peace deal by Sunday, or war escalates - Axios",
      "Trump gives Hamas deadline of Sunday to agree to Gaza peace plan",
      "Trump Sets Sunday Deadline for Hamas to Agree to Cease-fire Plan With Israel",
      "Trump Gives Hamas Sunday Deadline To Accept Peace Deal Or Face ‘All HELL’",
      "Egypt foreign minister urges Hamas to accept Trump Gaza plan and disarm"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.975,
      "consensus": 1.0,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.865,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "President Trump has proposed a 20-point plan aimed at ending the conflict in Gaza, which includes an immediate ceasefire, the release of hostages and detained Gazans, and the temporary control of Gaza by a \"Board of Peace\" chaired by himself. Critics argue the plan does not support Palestinian sovereignty. Trump warned that failure to accept the deal by Sunday would lead to severe consequences against Hamas, which is currently divided on the response. Egypt and Qatar are attempting to persuade Hamas to agree to the ultimatum.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: plan, support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Sarah Mullally Appointed First Female Archbishop of Canterbury",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Fri, 03 Oct 2025 05:48:38 -0400",
    "source": "NPR",
    "sources": [
      "The Guardian",
      "BBC",
      "New York Times",
      "CityNews",
      "NPR",
      "Washington Post"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "www.washingtonpost.com",
      "www.bbc.com",
      "www.theguardian.com",
      "www.npr.org",
      "www.nytimes.com"
    ],
    "snippets": [
      "Sarah Mullally has been named as the new Archbishop of Canterbury, becoming the first woman to be chosen to lead the world's 85 million Anglicans.",
      "She becomes the first female leader of the Church of England, replacing Justin Welby who resigned over his handling of a safeguarding scandal.",
      "Sarah Mullally, previously the bishop of London, is the first woman to serve as spiritual leader of the Church of England in its nearly 500-year history.",
      "Sarah Mullally, the bishop of London, has been appointed archbishop of Canterbury. She has been a vocal supporter of the rights of women in the church.",
      "<p>Former chief nursing officer for England will legally assume role at Canterbury Cathedral ceremony in January</p><p>Dame Sarah Mullally has been named as the first female leader in the history of the Church of England as Downing Street announced the 106th archbishop of Canterbury nearly a year on",
      "LONDON (AP) — Bishop of London Sarah Mullally shattered a stained-glass ceiling Friday when she was announced as the next Archbishop of Canterbury, the first time a woman has been chosen as the Church of England&#8217;s spiritual leader. Mullally, 63, a former cancer nurse who became England&#8217;s"
    ],
    "image_url": "",
    "titles": [
      "Sarah Mullally named first woman Archbishop of Canterbury",
      "'Hatred and racism cannot tear us apart,' first woman Archbishop of Canterbury says",
      "First woman is named archbishop of Canterbury, leader of Church of England",
      "Sarah Mullally Is Named as First Female Archbishop of Canterbury",
      "Sarah Mullally is named as first female archbishop of Canterbury",
      "Sarah Mullally named the first female Archbishop of Canterbury in history of Church of England"
    ],
    "score_components": {
      "magnitude": 0.986,
      "recency": 0.876,
      "consensus": 1.0,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.855,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Sarah Mullally has been appointed as the new Archbishop of Canterbury, marking the first time a woman will lead the Church of England and its 85 million Anglicans globally. Previously the Bishop of London and a former chief nursing officer, Mullally's historic appointment follows Justin Welby's resignation last year. She is recognized for her support of women's rights within the church. Mullally will officially assume her role in a ceremony at Canterbury Cathedral in January, becoming the 106th archbishop in the Church's history.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Yom Kippur Attack at Synagogue Kills 2; Israel Detains Activists, Starbucks Cuts",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Fri, 03 Oct 2025 05:03:46 -0400",
    "source": "NPR",
    "sources": [
      "Financial Times",
      "The Guardian",
      "Washington Post",
      "New York Times",
      "NPR",
      "BBC"
    ],
    "domains": [
      "www.bbc.co.uk",
      "www.washingtonpost.com",
      "www.bbc.com",
      "www.ft.com",
      "www.theguardian.com",
      "www.npr.org",
      "www.nytimes.com"
    ],
    "snippets": [
      "Greater Manchester Police named Adrian Daulby, 53, and Melvin Cravitz, 66 as the victims of Thursday's attack. Three more remain hospitalized in serious condition.",
      "Jihad Al-Shamie was a weightlifting enthusiast who rarely spoke to his neighbours, one resident said.",
      "Two Jewish people were killed in a car and stabbing attack at Heaton Park Hebrew Congregation Synagogue in Manchester on the holiest day in the Jewish religious calendar.",
      "Keir Starmer says Britain must defeat rising antisemitic hatred.",
      "UK deputy prime minister booed at vigil",
      "Shocked family condemns atrocity as ‘heinous act’",
      "A congregant in Manchester, England, described how fellow worshipers, including the rabbi, used their bodies to barricade the entrance as the assailant tried to force his way in.",
      "In the hours after an attack, a blanket of fear and grief fell over synagogues and Jewish community centers across the country.",
      "Two people were killed on Yom Kippur after a driver rammed a vehicle into people in Manchester and stabbed others. One man who died was accidentally shot by police, who also killed the attacker.",
      "<ul><li><p><a href=\"https://guardianprintshop.com/collections/ben-jennings\"><strong>Discover and buy more of Ben’s cartoons here</strong></a></p></li><li><p><a href=\"https://guardianprintshop.com/collections/ben-jennings/products/3rd-october-2025\"><strong>Order your own print of this cartoon from th",
      "<p>Justice secretary faces calls of ‘shame on you’ as crowd gathers to remember victims of terror attack</p><ul><li><p><a href=\"https://www.theguardian.com/uk-news/2025/oct/02/six-minutes-of-terror-how-manchester-synagogue-attack-unfolded\">Six minutes of terror: how the Manchester synagogue attack u",
      "The police identified two people killed in an attack at a synagogue in Manchester, England, and said they were still trying to learn more about the assailant’s motives.",
      "Officers fatally shot a man who had rammed a car into some people and stabbed others outside the Heaton Park Hebrew Congregation, police said.",
      "Officials said one of the men killed at the Heaton Park Congregation synagogue in northwestern England had been hit by police gunfire."
    ],
    "image_url": "",
    "titles": [
      "One of 2 victims in Manchester synagogue attack was accidentally shot by police",
      "Who was the Manchester synagogue attacker?",
      "What we know about Manchester synagogue attack",
      "Manchester Synagogue Attack: What We Know So Far",
      "Victim killed in Manchester synagogue attack was shot by police",
      "What we know about Manchester synagogue attacker Jihad Al-Shamie",
      "How an Attack on a Synagogue in Manchester Unfolded",
      "Manchester Synagogue Attack Fuels Fears of Antisemitism in Britain",
      "Synagogue Attack on Yom Kippur in Manchester, UK: What We Know",
      "Ben Jennings on the Manchester synagogue attack – cartoon",
      "Manchester synagogue victim died after being shot by police, as Lammy heckled at vigil – latest",
      "One victim in Yom Kippur synagogue attack in England was shot dead by police",
      "Two killed in attack at synagogue on Yom Kippur in England",
      "Police Accidentally Shot and Killed a Victim During Manchester Terrorist Attack"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.862,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.847,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Two individuals were killed in a car and stabbing attack at Heaton Park Hebrew Congregation Synagogue during Yom Kippur, with the assailant also deceased. Meanwhile, Israeli forces detained activists from several aid boats in international waters, amidst criticism of international inaction on the situation in Gaza. Additionally, Starbucks announced the closure of 1% of its North American stores, though specific locations were not disclosed.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Apple Pulls ICEBlock App Over Safety Concerns, Following DOJ Demands",
    "domain": "business",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-10-03T06:17:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "TechCrunch",
      "CNBC",
      "Axios",
      "Deutsche Welle"
    ],
    "domains": [
      "www.cnbc.com",
      "news.google.com",
      "www.dw.com",
      "techcrunch.com"
    ],
    "snippets": [
      "The Justice Department reportedly reached out to Apple to take down ICEBlock and similar apps, citing security risks to immigration enforcement officers.",
      "<a href=\"https://news.google.com/rss/articles/CBMib0FVX3lxTE9Eb3BJYnU3dk5GR1lkQjdRaGNTR0Jub3lkeXloUFJrUVdqU2VGNU84RHFBQVRhVlIxZ29BOW1CMS1uNjRrOUV0QzItNnp4OEZCU3h5NXRBQlhFNGFBQUZocVo0b29zN2FVQU91S1FSdw?oc=5\" target=\"_blank\">Apple drops ICE tracking apps from its store after Trump DOJ demand</a>&nbsp;",
      "Joshua Aaron has said he created ICEBlock after seeing the Trump administration's deportation efforts, which he said evoked events in Nazi Germany.",
      "Apple has removed ICEBlock and other apps from its App Store that allow users to anonymously report sightings of U.S. Immigration and Customs Enforcement (ICE) agents, following pressure from the Trump administration."
    ],
    "image_url": "",
    "titles": [
      "Apple pulls ICE tracking apps after Trump admin request",
      "Apple drops ICE tracking apps from its store after Trump DOJ demand - Axios",
      "Google, Apple drop ICE agent tracking apps from stores after Trump admin complaints",
      "Apple removes ICEBlock and similar tracking apps from the App Store"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.813,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.752,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Apple removed the ICEBlock app, designed to track immigration enforcement activities, from its App Store, citing safety concerns. This action follows demands from the Trump-era Department of Justice. The app's creator, Joshua Aaron, developed ICEBlock in response to the Trump administration's deportation policies, which he compared to events in Nazi Germany.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Munich Airport Halts Flights Amid Drone Sightings, Affects Oktoberfest",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-10-03T13:18:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "The Guardian",
      "New York Times",
      "Deutsche Welle"
    ],
    "domains": [
      "www.nytimes.com",
      "www.dw.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "The disruption comes as Munich hosts its world-famous Oktoberfest beer festival, which runs until Sunday. Last week, Denmark and Norway closed airports due to drones.",
      "<p>Travel disrupted for thousands on eve of national holiday in latest drone incident to hit European aviation</p><p>Munich airport has reopened after drone sightings over the facility on Thursday evening forced air traffic control to suspend operations, leading to the cancellation of 17 flights and",
      "The airport in Germany was the latest in Europe to shut because of drone sightings. Officials have blamed Russia, which has denied being behind the drone incursions."
    ],
    "image_url": "",
    "titles": [
      "Germany: Drone sightings disrupt Munich Airport",
      "Munich airport reopens after halting flights because of drone sightings",
      "Flights Are Briefly Halted at Munich Airport After Drone Sightings"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.942,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.732,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Munich airport suspended operations due to drone sightings on Thursday evening, affecting the Oktoberfest beer festival. This led to 17 flight cancellations and disrupted nearly 3,000 travelers. This incident is part of a series of drone disruptions in European aviation, with officials blaming Russia, which has denied the accusations.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "England Crushes South Africa in Women's World Cup Opener",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 12:54:16 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "Sky Sports",
      "BBC"
    ],
    "domains": [
      "www.skysports.com",
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "England get their World Cup campaign off to the perfect start as they ease past South Africa in their opening match, bowling their opponents out for 69 before reaching their winning target inside 15 overs, without losing a wicket.",
      "<ul><li><p><a href=\"https://www.theguardian.com/sport/cricket/match/2025-10-03/england-women-cricket-team\">England, 73-0, beat South Africa, 69, by 10 wickets</a></p></li><li><p>Beaumont-Jones partnership makes short work of chase</p></li></ul><p>England romped home with a 10-wicket win in their Wor",
      "Highlights of the Women's Cricket World Cup match between England and South Africa.",
      "Spinner Linsey Smith starred as England kicked off their Women's Cricket World Cup campaign with an emphatic 10-wicket demolition of South Africa in Guwahati."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/692d/live/6676a040-a055-11f0-928c-71dbb8619e94.jpg",
    "titles": [
      "England start World Cup in style with dominant win against South Africa",
      "England off to Cricket World Cup flyer with 10-wicket demolition of South Africa",
      "England begin Cricket World Cup in style with dominant win over South Africa",
      "England thrash South Africa by 10 WICKETS in World Cup opener"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.915,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.72,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "England defeated South Africa by 10 wickets in their opening match of the Women's Cricket World Cup in Guwahati. Bowling South Africa out for 69 runs, England achieved their winning target in less than 15 overs without losing any wickets, with Linsey Smith delivering a standout performance as a spinner.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Taylor Swift Drops 12th Album, Eyes 1M First-Week Sales",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Fri, 03 Oct 2025 11:55:22 GMT",
    "source": "CNBC",
    "sources": [
      "MarketWatch",
      "CNBC",
      "CityNews"
    ],
    "domains": [
      "www.marketwatch.com",
      "ottawa.citynews.ca",
      "www.cnbc.com"
    ],
    "snippets": [
      "Vinyl records, CDs and cassettes escape U.S. tariffs thanks to a Cold War-era exemption, keeping prices stable for fans.",
      "Swift’s new album represents an epic event for the music business, with sales of her music driving the fortunes of the entire industry.",
      "Who is Taylor Swift’s heir apparent? Her 12th album, “The Life of a Showgirl,” offers an answer. It’s Taylor Swift. Her last album, “The Tortured Poets Department,” ended with the cautionary “Clara Bow,” an allegory that seemed to suggest her tenure atop the cultural mainstream was inherited from st"
    ],
    "image_url": "",
    "titles": [
      "Why vinyl records like Taylor Swift's 'The Life of a Showgirl' are protected from tariffs",
      "The release of Taylor Swift’s ‘The Life of a Showgirl’ is like Super Bowl Sunday for the music industry",
      "On Taylor Swift’s ‘The Life of a Showgirl,’ love and reputation are on the line"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.896,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.716,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Taylor Swift released her 12th album, \"The Life of a Showgirl,\" featuring a mix of pop and country music, along with themes of love, rivalry, and fame. The album, celebrated for its joyful pop records, has been uniquely promoted with global releases and exclusive cinema events for fans. It is anticipated to sell over 1 million copies in its first week, a milestone Swift has achieved before. The release underscores Swift's continued dominance in the music industry.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Canadian PM Carney to Meet Trump on Tariffs, Oct 7",
    "domain": "business",
    "source_domain": "financialpost.com",
    "location": "national",
    "published": "Fri, 03 Oct 2025 15:21:06 +0000",
    "source": "Financial Post",
    "sources": [
      "Financial Post",
      "CityNews"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "financialpost.com"
    ],
    "snippets": [
      "U.S. tariffs on steel, aluminum, autos and lumber — all major export industries for Canada — currently remain in place",
      "Prime Minister Mark Carney will travel to Washington, D.C., early next week for a working visit with U.S. President Donald Trump, his office confirmed Friday. Carney is expected to arrive in Washington on Monday evening, setting up a face-to-face meeting with the president on Tuesday, Oct. 7. The me"
    ],
    "image_url": "",
    "titles": [
      "Carney, Trump to meet in Washington as trade fight drags on",
      "Prime Minister Carney to meet President Trump in Washington next week"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.983,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.716,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Canadian Prime Minister Mark Carney is scheduled to visit Washington, D.C., for a meeting with U.S. President Donald Trump on October 7. The visit aims to discuss the ongoing U.S. tariffs on major Canadian exports such as steel, aluminum, autos, and lumber. These tariffs are currently in effect.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UK Home Secretary Criticizes Pro-Palestinian Protests, Urges Rally Cancellation",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 11:31:43 GMT",
    "source": "BBC",
    "sources": [
      "Financial Times",
      "Al Jazeera",
      "BBC"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.ft.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The home secretary told BBC Breakfast she was disappointed pro-Palestinian protests went ahead.",
      "Protest group Defend Our Juries has said in response a planned demonstration for this weekend will still take place.",
      "Shabana Mahmood calls on Defend Our Juries to call off London rally in wake of Thursday’s terrorist incident"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/9f66/live/1d9f81c0-a03c-11f0-b741-177e3e2c2fc7.jpg",
    "titles": [
      "Pro-Palestinian protests 'un-British' after Manchester attack, Mahmood says",
      "UK police urge cancellation of Palestine protest after Manchester attack",
      "Home secretary urges activists to cancel Palestine Action protest after Manchester attack"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.889,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.715,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The UK Home Secretary expressed disappointment on BBC Breakfast over the continuation of pro-Palestinian protests. Additionally, Shabana Mahmood urged the group Defend Our Juries to cancel a planned rally in London following a terrorist incident on Thursday.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "U.S. Government Shuts Down as Congress Misses Funding Deadline",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 06:53:22 +0000",
    "source": "Al Jazeera",
    "sources": [
      "The Guardian",
      "Al Jazeera",
      "ABC News"
    ],
    "domains": [
      "www.aljazeera.com",
      "abcnews.go.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "White House says it plans to cut &#039;thousands&#039; of federal jobs as it freezes funding to Democratic states.",
      "The next vote on bills that could get federal money flowing again is not scheduled until Friday, as thousands of workers remain furloughed and many government services are at a standstill.",
      "ABC News' senior White House correspondent Selina Wang answers the most searched questions on the first day of the government shutdown.",
      "<p>Senate will convene today to vote on dueling party proposals for continuing funding over the coming weeks</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/live/2025/oct/03/shutdown-congress-trump-senate-latest-updates\">US politics live – latest updates</a></p></li></ul><p>The <a href=\"h"
    ],
    "image_url": "",
    "titles": [
      "US government shutdown enters third day, expected to last past weekend",
      "WATCH:  Government shutdown enters day 2",
      "WATCH:  What does the government shutdown mean for you and your family?",
      "US government shutdown day three: Republicans and Democrats make little progress on deal"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.824,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.702,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The U.S. government officially shut down on Oct. 1 after Congress failed to reach a funding agreement. ABC News' Selina Wang, as the senior White House correspondent, addressed the most searched questions regarding the shutdown on its first day.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Canada Post Proposes New Contract, Cuts Bonus and Suggests Workforce Reduction",
    "domain": "general",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Fri, 03 Oct 2025 15:24:38 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "CityNews"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "globalnews.ca"
    ],
    "snippets": [
      "The offers take away a previously-offered signing bonus and proposes efforts to reduce both the company's workforce and number of post offices that are 'off limits' from closure.",
      "Canada Post has presented a new set of contract offers to the Canadian Union of Postal Workers (CUPW), pledging wage increases and benefit protections while stressing the need to modernize its operations and address mounting financial pressures. The corporation stated that the proposals maintain pro"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/43415e694ad9ce46e6c930dc39ae2fbae3c101eed49fce75935d3522f88530a1.jpg?quality=65&strip=all",
    "titles": [
      "Canada Post presents new offers to union in bid to end postal strike",
      "Canada Post tables new offer to thousands of postal workers amid labour dispute"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.984,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.702,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Canada Post proposed new contract offers to the Canadian Union of Postal Workers, including wage increases and benefit protections. However, these offers remove a previously offered signing bonus and suggest reducing the workforce and the number of post offices protected from closure. The changes aim to modernize operations and tackle financial challenges.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Admin Claims \"Armed Conflict\" Justifies Strikes on Venezuelan Drug Boats",
    "domain": "general",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 00:05:23 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "New York Times",
      "Washington Post"
    ],
    "domains": [
      "www.washingtonpost.com",
      "www.nytimes.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "<p>Administration attempts to justify strikes on alleged Venezuelan drug boats by claiming US under ‘armed attack’</p><p>The Trump administration is trying to justify strikes on alleged Venezuelan drug boats by advancing a novel legal theory that the US is now in a “non-international armed conflict”",
      "President Donald Trump has determined the U.S. is in “armed conflict” with drug cartels who are distributing narcotics, according to a notification to Congress.",
      "A notice calls the people the U.S. military recently killed on suspicion of drug smuggling in the Caribbean Sea “unlawful combatants.”"
    ],
    "image_url": "https://i.guim.co.uk/img/media/b6e16c1c91aa3f917c815100914be1bb254c6530/418_0_4164_3333/master/4164.jpg?width=140&quality=85&auto=format&fit=max&s=90dcff67bc88d491bbace822388cfa86",
    "titles": [
      "Trump officials push claim that US in ‘armed conflict’ with drug cartels",
      "U.S. in ‘armed conflict’ with drug cartels, Trump tells Congress",
      "Trump ‘Determined’ the U.S. Is Now in a War With Drug Cartels, Congress Is Told"
    ],
    "score_components": {
      "magnitude": 0.887,
      "recency": 0.7,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.698,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Trump administration has attempted to justify strikes on alleged Venezuelan drug boats by claiming the U.S. is in a \"non-international armed conflict\" with drug cartels, based on a novel legal theory. This justification, aimed at allowing military action against narcotics distributors, has been reported by US media and critiqued by experts as likely illegal. President Trump has notified Congress of this determination, framing it as a response to an \"armed attack\" by drug cartels on the United States.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Tarleton State University Puts Coach Gillispie on Leave Amid Investigation",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Fri, 3 Oct 2025 11:26:40 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Tarleton State coach Billy Gillispie has been placed on temporary administrative leave as the university investigates an anonymous complaint.",
      "The veteran coach has a long history of controversies and health issues"
    ],
    "image_url": "",
    "titles": [
      "Tarleton State coach Gillispie under investigation",
      "Billy Gillispie placed on leave: Tarleton State coach being investigated after complaint, per report"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.985,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.677,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Tarleton State University has placed coach Billy Gillispie on temporary administrative leave to investigate an anonymous complaint against him. Gillispie, who has a history of controversies and health issues, is under review, but the specific nature of the complaint has not been disclosed.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Vikings QB McCarthy Out for 3rd Game, Wentz to Start Amid O-Line Woes",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Fri, 3 Oct 2025 11:26:40 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Vikings quarterback J.J. McCarthy will miss his third consecutive start because of a high right ankle sprain, turning once again to Carson Wentz behind an offensive line missing multiple starters.",
      "<p>Minnesota Vikings quarterback J.J. McCarthy will miss his third straight game because of a right ankle sprain.</p>"
    ],
    "image_url": "",
    "titles": [
      "QB McCarthy out; Wentz starts with battered OL",
      "Vikings QB J.J. McCarthy out vs. Browns, Carson Wentz to start"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.985,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.677,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Minnesota Vikings quarterback J.J. McCarthy will be sidelined for his third consecutive game due to a high right ankle sprain. In his absence, Carson Wentz will take over quarterback duties again, amid challenges posed by an offensive line weakened by the absence of several starters.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Panthers' Chuba Hubbard Likely Out Sunday vs. Dolphins Due to Injury",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Fri, 3 Oct 2025 11:26:40 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Panthers running back Chuba Hubbard is not expected to play in Sunday's game against the Dolphins due to a calf injury that has kept him out of practice the past two days, a league source confirmed Friday.",
      "<p>One of Canada&#8217;s most productive NFLers likely will be sidelined Sunday. Carolina Panthers running back Chuba Hubbard is expected to miss his team&#8217;s game against the Miami Dolphins because of a calf injury, NFL Network&#8217;s Ian Rapoport reported Friday.</p>"
    ],
    "image_url": "",
    "titles": [
      "Source: Panthers' Hubbard not expected to play",
      "Report: Panthers RB Chuba Hubbard expected to be out vs. Dolphins"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.985,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.677,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Carolina Panthers running back Chuba Hubbard is likely to miss Sunday's game against the Miami Dolphins due to a calf injury. Hubbard has not practiced for the past two days, and his absence was confirmed by a league source and reported by NFL Network's Ian Rapoport on Friday.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Government Shutdown Delays Jobs Report Amid White House Pressure on Colleges",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Fri, 03 Oct 2025 07:16:06 -0400",
    "source": "NPR",
    "sources": [
      "Forbes",
      "NPR"
    ],
    "domains": [
      "www.npr.org",
      "www.forbes.com"
    ],
    "snippets": [
      "The government shutdown has delayed the monthly jobs report. And, the White House pressures colleges to sign a 'compact' aligning with Trump's agenda.",
      "The government shut down began at midnight on Wednesday as Democrats and Republicans appeared to be nowhere close to reaching a funding deal."
    ],
    "image_url": "",
    "titles": [
      "Shutdown postpones monthly jobs report. And, Trump dangles a carrot to colleges",
      "Government Shutdown Day 3: Jobs Report On Hold, Trump Pauses $2.1 Billion For Chicago"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.903,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.668,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The government shutdown, starting at midnight on Wednesday due to a lack of a funding deal between Democrats and Republicans, has led to the delay of the monthly jobs report. Concurrently, the White House is pressuring colleges to sign a compact that aligns with Trump's agenda.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Babiš Campaigns on Welfare, Ukraine Aid Cut as Czech Polls Favor ANO Victory",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 13:16:00 +0000",
    "source": "Al Jazeera",
    "sources": [
      "The Guardian",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Self-described &#039;Trumpist&#039; Andrej Babis has campaigned on pledges of welfare and halting military aid to Ukraine.",
      "<p>Billionaire Andrej Babiš hands out doughnuts on first day of voting as polls predict his ANO party will win</p><p>Czechs have begun voting in an election likely to oust their centre-right government, with polls favouring the <a href=\"https://www.theguardian.com/world/2025/oct/02/east-or-west-czec"
    ],
    "image_url": "",
    "titles": [
      "Czechs vote in elections that could usher in populist billionaire",
      "Czechs begin voting in election that could return populist to power"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.941,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.657,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Andrej Babiš, a billionaire and self-described 'Trumpist,' campaigned on increasing welfare and stopping military aid to Ukraine. On the first day of voting, he distributed doughnuts, with polls predicting his ANO party will win. The Czech election is expected to unseat the current centre-right government, favoring Babiš's policies.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Christian Horner Seeks F1 Return, Contacts Team Owners: Aston Martin CEO",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 14:55:41 GMT",
    "source": "BBC",
    "sources": [
      "Sky Sports",
      "BBC"
    ],
    "domains": [
      "www.skysports.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Christian Horner is \"ringing up pretty much every team owner\" as he seeks a route back into F1, says Aston Martin CEO Andy Cowell.",
      "Andy Cowell, Steve Nielsen and James Vowles all respond to questions concerning Christian Horner joining their team."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/1177/live/2a108940-a050-11f0-b687-23a5afa8b42e.jpg",
    "titles": [
      "Horner 'ringing up pretty much every team owner'",
      "'He's ringing up every team owner!' | F1 teams respond to Horner rumours"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.954,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.656,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Christian Horner is actively seeking re-entry into Formula 1 by contacting nearly every team owner, according to Aston Martin CEO Andy Cowell. In response to inquiries about the possibility of Horner joining their teams, industry figures Andy Cowell, Steve Nielsen, and James Vowles have all provided comments, indicating a broad level of engagement with Horner's efforts.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Diddy Sentenced for Prostitution Transportation Charges",
    "domain": "general",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Fri, 03 Oct 2025 11:59:34 -0400",
    "source": "ABC News",
    "sources": [
      "The Guardian",
      "ABC News"
    ],
    "domains": [
      "abcnews.go.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Sean \"Diddy\" Combs will be sentenced on Friday after being found guilty of transportation to engage in prostitution.",
      "Sean \"Diddy\" Combs returned to a Manhattan courtroom on Friday to be sentenced on two counts of transportation for the purposes of prostitution.",
      "<p>Music mogul, who could face lengthy prison sentence after being convicted of prostitution charges in July, pleaded with judge for a ‘second chance’ </p><ul><li><p><a href=\"https://www.theguardian.com/music/2025/oct/03/sean-diddy-combs-sentencing\">Sean ‘Diddy’ Combs sentencing: what to know</a></p"
    ],
    "image_url": "https://s.abcnews.com/images/US/diddy-2-rt-gmh-250930_1759245094571_hpMain_4x3t_384.jpg",
    "titles": [
      "Sean 'Diddy' Combs sentencing live updates: Judge says Combs not remorseful",
      "WATCH:  Sentencing day for Sean 'Diddy' Combs",
      "Sean ‘Diddy’ Combs in court as sentencing hearing gets under way – live updates"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.996,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.654,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Sean \"Diddy\" Combs was sentenced on Friday after being found guilty of two counts of transportation for the purposes of prostitution. The music mogul, convicted in July, appeared in a Manhattan courtroom where he requested a second chance from the judge. The specifics of his sentence, including the length, were not provided in the summary content.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Week 5 Fantasy Football Tips: Top Picks and Matchups from Allen, Koh",
    "domain": "sports",
    "source_domain": "sports.yahoo.com",
    "location": "national",
    "published": "Fri, 03 Oct 2025 15:56:25 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Forbes",
      "Yahoo Sports"
    ],
    "domains": [
      "www.forbes.com",
      "sports.yahoo.com"
    ],
    "snippets": [
      "Chris Allen gives you one player to watch on each team in every game for Week 5 for fantasy football.",
      "James Koh takes you through matchups to exploit for fantasy football, revealing his top players and deep sleepers for Week 5.",
      "Best Week 5 fantasy football matchups position by position. It's a bye week what quarterback has the best matchup and who are you going to avoid?"
    ],
    "image_url": "",
    "titles": [
      "Fantasy Football: Key players to watch in every Week 5 game",
      "Fantasy Football Matchups to Exploit: Players in great spots for Week 5, plus deep sleepers to consider",
      "NFL 2025 Week 5 Fantasy Football Best/Worst Matchups By Position"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.995,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.654,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Chris Allen and James Koh provide fantasy football advice for Week 5, highlighting key players to watch on each team and matchups to exploit. The guidance includes top picks, deep sleepers, and the best positional matchups, specifically noting considerations for quarterback choices during the bye week.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "2026 Women's Hockey World Championship Set for November in Denmark",
    "domain": "sports",
    "source_domain": "sports.yahoo.com",
    "location": "national",
    "published": "Fri, 03 Oct 2025 15:43:48 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Sportsnet",
      "Yahoo Sports"
    ],
    "domains": [
      "www.sportsnet.ca",
      "sports.yahoo.com"
    ],
    "snippets": [
      "The 2026 women’s hockey world championship will take place in November in Denmark, the sport's governing body announced Friday.  The shift from spring to fall beginning next year comes after the International Ice Hockey Federation was in talks with the Professional Women’s Hockey League about schedu",
      "<p>The 2026 women’s hockey world championship will take place in November in Denmark, the sport&#8217;s governing body announced Friday.</p>"
    ],
    "image_url": "",
    "titles": [
      "IIHF moves the women's world hockey championship to November in 2026",
      "IIHF moves the women’s world hockey championship to November in 2026"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.99,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.653,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The 2026 Women's Hockey World Championship will be held in November in Denmark, as announced by the sport's governing body. This marks a change from its traditional spring schedule, following discussions with the Professional Women’s Hockey League.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Taylor Swift Releases Dance-Inspired 12th Album, References Real Madrid",
    "domain": "business",
    "source_domain": "www.lemonde.fr",
    "location": "global",
    "published": "Fri, 03 Oct 2025 16:41:57 +0200",
    "source": "Le Monde",
    "sources": [
      "Forbes",
      "Le Monde"
    ],
    "domains": [
      "www.forbes.com",
      "www.lemonde.fr"
    ],
    "snippets": [
      "Après une série d’albums plus acoustiques, la chanteuse livre un album efficace et dansant, aux textes empreints de romantisme.",
      "Real Madrid earned a surprise inclusion in the lyrics of a track on Taylor Swift's twelfth studio album, featuring the Spanish soccer giants in one of her songs."
    ],
    "image_url": "https://img.lemde.fr/2025/10/03/961/0/5003/2501/644/322/60/0/bc199a9_upload-1-dppcfbg6cetf-7-feathers.jpg",
    "titles": [
      "Taylor Swift renoue avec la pop et avec Cupidon dans « The Life of a Showgirl »",
      "Taylor Swift Mention Real Madrid On ‘The Life Of A Showgirl’"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.969,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.649,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A singer has released a new album marked by a shift towards more danceable tunes, contrasting with her previous acoustic works, and featuring lyrics rich in romantic themes. Additionally, Taylor Swift's twelfth studio album has garnered attention for including a mention of Real Madrid, surprising fans by referencing the Spanish soccer team in one of her songs.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Piastri Tops Singapore GP Practice; Norris-Leclerc Pit Collision",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 15:42:37 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Yahoo Sports"
    ],
    "domains": [
      "www.bbc.com"
    ],
    "snippets": [
      "Oscar Piastri is fastest in Singapore Grand Prix practice after McLaren team-mate Lando Norris collides with Charles Leclerc in the pits.",
      "Oscar Piastri is fastest in Singapore Grand Prix practice after McLaren team-mate Lando Norris collides with Charles Leclerc in the pits."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/65ec/live/920e42e0-a063-11f0-8c3b-297dfedf4956.jpg",
    "titles": [
      "Norris 'not doing very good job' as Piastri fastest",
      "Norris 'not doing very good job' as Piastri fastest"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.97,
      "consensus": 0.571,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.644,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Oscar Piastri recorded the fastest time in Singapore Grand Prix practice, overshadowing an incident where his McLaren teammate, Lando Norris, collided with Charles Leclerc in the pits.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Patricia Routledge, Beloved British Actress, Passes Away",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 12:21:39 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "She also starred in Alan Bennett's TV monologues and played the BBC's amateur sleuth Hetty Wainthropp.",
      "<p>Formidable and versatile actor best known for her comic turn as the snobbish Hyacinth Bucket in the BBC sitcom Keeping Up Appearances</p><p>There were times when you felt that Patricia Routledge, the popular and formidable actor, who has died aged 96, embodied the true voice of middle England wit"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/96ca/live/298a4240-a050-11f0-928c-71dbb8619e94.jpg",
    "titles": [
      "Keeping Up Appearances star Patricia Routledge dies at 96",
      "Dame Patricia Routledge obituary"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.904,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.636,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Patricia Routledge, celebrated for her role as Hyacinth Bucket in the sitcom and as the lead in Hetty Wainthropp Investigates, passed away. Her career was marked by her versatile portrayals of characters, from the pretentious Hyacinth to various roles in Alan Bennett's TV monologues, showcasing her wide-ranging talent in bringing eccentric characters to life with humanity and depth.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Administration Cancels 300+ Clean Energy Awards, Targets Democrat States",
    "domain": "technology",
    "source_domain": "www.nytimes.com",
    "location": "global",
    "published": "Thu, 02 Oct 2025 18:38:11 +0000",
    "source": "New York Times",
    "sources": [
      "New York Times",
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "The cuts largely affect Democratic-led states as the two parties fight over the shutdown of the federal government.",
      "The Trump administration canceled over 300 awards related to clean energy on October 1. The states most affected by the cuts voted for Democrat presidential candidate Kamala Harris."
    ],
    "image_url": "https://static01.nyt.com/images/2025/10/02/multimedia/02cli-clean-energy-cuts-fjkz/02cli-clean-energy-cuts-fjkz-mediumSquareAt3X.jpg",
    "titles": [
      "Energy Dept. Cancels $7.5 Billion for Hundreds of Projects, Mostly in Blue States",
      "Department of Energy cancels $7.5B of clean energy projects in mostly blue states"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.638,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.6,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "On October 1, the Trump administration canceled more than 300 clean energy awards, predominantly impacting Democratic-led states. This action comes amid a broader political conflict between the two parties regarding the federal government shutdown. The states most affected by these cancellations had supported Democratic presidential candidate Kamala Harris.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  }
]