[
  {
    "title": "Pentagon Probes Lawmakers Over Video Urging Troops to Refuse Unlawful Orders",
    "domain": "business",
    "source_domain": "npr.org",
    "location": "national",
    "published": "Mon, 24 Nov 2025 13:39:22 -0500",
    "source": "NPR",
    "sources": [
      "NPR",
      "The Guardian",
      "CBC News",
      "Bloomberg",
      "Forbes",
      "Associated Press"
    ],
    "domains": [
      "npr.org",
      "theguardian.com",
      "cbc.ca",
      "news.google.com",
      "forbes.com"
    ],
    "snippets": [
      "The Pentagon says it's opening an investigation into Arizona Sen. Mark Kelly in the wake of a video of Democratic lawmakers urging servicemembers not to comply with \"illegal orders.\"",
      "Investigation of Mark Kelly comes after Trump accused the Democrats in the video of ‘seditious behavior, punishable by death’ The Pentagon says it is investigating Arizona senator Mark Kelly for possible breaches of military law after the federal lawmaker joined a handful of other Democrats in a vid",
      "The Pentagon says that it is investigating Democratic Sen. Mark Kelly of Arizona for possible breaches of military law after Kelly joined a handful of other lawmakers in a video that called for U.S. troops to refuse unlawful orders.",
      "Pentagon Probes Democratic Senator After Video to Troops Bloomberg.com",
      "Kelly was one of six lawmakers who appeared in a video urging military members to refuse illegal orders, accusing Trump of pitting the military against American citizens.",
      "Pentagon says it's investigating Sen. Mark Kelly for video urging troops to defy 'illegal orders' AP News"
    ],
    "image_url": "",
    "titles": [
      "Pentagon investigates Democratic senator for telling troops to refuse 'illegal orders'",
      "Pentagon says it is investigating US senator over video urging troops to refuse illegal orders",
      "U.S. Pentagon investigating Democrat senator for video urging troops to defy ‘illegal orders’",
      "Pentagon Probes Democratic Senator After Video to Troops - Bloomberg.com",
      "Pentagon Investigating Sen. Mark Kelly Over Video Telling Troops To Refuse Illegal Orders",
      "Pentagon says it's investigating Sen. Mark Kelly for video urging troops to defy 'illegal orders' - AP News"
    ],
    "url": "https://www.npr.org/2025/11/24/nx-s1-5619314/pentagon-mark-kelly-trump-hegseth-military",
    "alternate_urls": [
      "https://www.theguardian.com/us-news/2025/nov/24/pentagon-investigation-mark-kelly-arizona",
      "https://www.cbc.ca/news/world/pentagon-investigating-senator-defy-illegal-orders-9.6990412?cmp=rss",
      "https://news.google.com/rss/articles/CBMisgFBVV95cUxQd0pYTHNRMmRVb0tvbDJCZE9GeFBvdS14Z3Z5ZEJtb3YxU2l5Wk9HNDVVdHlsQm1IajJVXzE0YnZrOS1DbG1QVFJTbXVVd21oWjdYakV1N3N5U01pa19DVGdsem9Cd2d1VkItaVU3c3pyNHgtV3ZnRERZX0RvTkU2WUFRd05QMnhvNlFJQktrM183V2NKOVQtc2cyTmtkd3BoOG9sWDhmQVpjeWh2MENwcTRn?oc=5",
      "https://www.forbes.com/sites/antoniopequenoiv/2025/11/24/pentagon-investigating-sen-mark-kelly-over-video-telling-troops-to-refuse-illegal-orders/",
      "https://news.google.com/rss/articles/CBMioAFBVV95cUxQNkFWd2U0OXc2bjBST2lYOWtWRGFHemtWSGlfY00tV0g4V0ZWdHJSV2Y4eWtLa1ZrOExNc0lYaGVwSGZCaGtCWHMzVkFmeUpaSjlMSVhyZF9fTWNHTXpzX0NJODduTG53QVcxZjFpRG5XTWU3T2xHMGxNZWF5S1E1dnhUVEJldnl2Szg2Sl9FV19TdUR4aTNPbWtzSV80NWNW?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.npr.org/2025/11/24/nx-s1-5619314/pentagon-mark-kelly-trump-hegseth-military",
    "score_components": {
      "magnitude": 0.986,
      "recency": 0.968,
      "consensus": 1.0,
      "constructiveness": 0.7,
      "proximity": 0.75
    },
    "score": 0.934,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Pentagon has launched an investigation into Arizona Senator Mark Kelly and five other Democratic lawmakers after they appeared in a video urging U.S. military personnel to refuse unlawful orders. The inquiry follows criticism from former President Trump, who accused the lawmakers of seditious behavior. The investigation is ongoing, and no charges have been filed.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story informs readers about a significant ongoing investigation involving lawmakers and the military. It provides useful context about the situation and the potential implications. However, it does not highlight any progress, solutions, or empowering knowledge.",
    "constructiveness_source": "gpt",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "Judge Dismisses Cases Against Comey, Letitia James Over Prosecutor's Appointment",
    "domain": "business",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Mon, 24 Nov 2025 19:29:18 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Axios",
      "ABC News",
      "CNBC",
      "Financial Times",
      "The Guardian",
      "Bloomberg",
      "Forbes",
      "NPR",
      "Reuters",
      "Associated Press"
    ],
    "domains": [
      "aljazeera.com",
      "news.google.com",
      "abcnews.go.com",
      "cnbc.com",
      "ft.com",
      "theguardian.com",
      "forbes.com",
      "npr.org"
    ],
    "snippets": [
      "The court found that lawyer Lindsey Halligan had been illegally appointed to her role as acting US attorney under Trump.",
      "James Comey, Letitia James prosecutions dismissed Axios",
      "A federal judge has dismissed the criminal cases against former FBI Director James Comey and New York Attorney General Letitia James.",
      "Senior U.S. District Judge Cameron Currie ruled that Lindsey Halligan, the interim U.S. attorney who brought both indictments, was invalidly appointed.",
      "Ruling found the appointment of Donald Trump ally Lindsey Halligan as interim US attorney was unconstitutional",
      "District judge Cameron McGowan Currie rules that Lindsey Halligan had ‘no lawful authority’ to present indictments to both Comey and James The president was online early today, and fired off a Truth Social post at 5:38am touting the economic impact that his sweeping tariffs will soon have on the cou",
      "Judge says interim US attorney for eastern district of Virginia had ‘no lawful authority’ to indict former FBI director and New York attorney general US politics live – latest updates A federal judge threw out the criminal cases against James Comey and Letitia James on Monday, concluding that the pr",
      "James Comey, Letitia James Charges Dismissed by US Judge Bloomberg.com",
      "A federal judge invalidated the indictments because U.S. Attorney Lindsey Halligan was improperly appointed.",
      "The judge's decision on the appointment of Lindsey Halligan marks a significant setback to efforts to go after the president's perceived political enemies.",
      "US judge tosses cases against ex-FBI chief Comey, New York AG James Reuters",
      "Judge dismisses Comey, James indictments after finding that prosecutor was illegally appointed AP News"
    ],
    "image_url": "",
    "titles": [
      "US judge dismisses criminal charges against James Comey, Letitia James",
      "James Comey, Letitia James prosecutions dismissed - Axios",
      "Judge tosses indictments against James Comey and Letitia James",
      "Judge dismisses James Comey and Letitia James cases over 'unlawful' prosecutor appointment",
      "US judge dismisses charges against James Comey and Letitia James",
      "Judge rebukes Trump’s prosecutor over James Comey and Letitia James charges – live",
      "US judge throws out criminal cases against James Comey and Letitia James",
      "James Comey, Letitia James Charges Dismissed by US Judge - Bloomberg.com",
      "Trump’s Cases Against James Comey And Letitia James Dismissed",
      "Judge tosses Comey, James cases after finding prosecutor unlawfully appointed",
      "US judge tosses cases against ex-FBI chief Comey, New York AG James - Reuters",
      "Judge dismisses Comey, James indictments after finding that prosecutor was illegally appointed - AP News"
    ],
    "url": "https://www.aljazeera.com/news/2025/11/24/us-judge-dismisses-criminal-charges-against-james-comey-letitia-james?traffic_source=rss",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMifkFVX3lxTFAxX3pjZGwyeTFnWGJnbDR5V3luX2dnak5yS2FZX1JybHRDeDhoS0IxTms5cXFqOUR5bVZDUVMtMEkxeG9vY0lCNU1nWkZtT1B1b1pBSFVBRENFbG9wNWwxLWdNRnQ2UmoxYk54bEZTMXU0Rmw4d0NhN1dtTG1wZw?oc=5",
      "https://abcnews.go.com/US/judge-dismisses-criminal-cases-comey-james/story?id=127732668",
      "https://www.cnbc.com/2025/11/24/trump-comey-james-indictments-halligan.html",
      "https://www.ft.com/content/62f53191-72d2-43e8-8341-034bcacedb8b",
      "https://www.theguardian.com/us-news/live/2025/nov/24/us-politics-trump-venezuela-marjorie-tayor-greene-latest-updates",
      "https://www.theguardian.com/us-news/2025/nov/24/james-comey-letitia-james-charges-case-dismissed",
      "https://news.google.com/rss/articles/CBMisAFBVV95cUxQS3Q0U0VtOWtkbkkxa19xOGhlVThzOUNTb25ZeV83c2NpWEQtUDV4UnEzZUYyYnUtWW9uc2dUMzktbWY5SWJjYV9XY1NRZmZic193Zno1U3gtY0RiQS1JckdGTG9oWGQ4TnpnYzFibVlibDVhNTZhX253UXNuM2cwV0J2eE1YNEhwSWxqQnhrN3k1aU1CN00tVkNURDZpWW5JODVhNWRyS2txUGg5SmdSdw?oc=5",
      "https://www.forbes.com/sites/alisondurkee/2025/11/24/case-against-james-comey-dismissed-as-judge-invalidates-trump-prosecutors-appointment/",
      "https://www.npr.org/2025/11/24/g-s1-98612/trump-us-attorney-lindsey-halligan",
      "https://news.google.com/rss/articles/CBMitgFBVV95cUxQTnMxRDdacHJ0WmtKXzF3TEJBel83OWo3VVgtRFltYXdxQ3Q2MXc0aFFZektzVkZQVFc4dWpvMnNTazlsQWtjV0RJS2hyb2JVbFFacFgxaE9fSlB1TG1tai13Y0VXTDNka1pqVFI1RVVMVUptOW1DX1U1M2wwbE5rdFpLMjlpbnV6TGNJMnBIcXhXMDBnNEpMVjNGWkxuclRPWUJHMmNYT0RYcXBNanNiZjZiLWo3Zw?oc=5",
      "https://news.google.com/rss/articles/CBMilAFBVV95cUxPUHBneEhfMk9ZcDg4ZklpU0tiemhhM1lfdElsQlIwLXJaT1hDbXR6eWUxYzM1elBGZEloUHEzV1E0Y3JtM04zV1hTSkdzY1RFM2ZVUWhIU0VzeGZORkVvWV9HRGRUX1NEYW9uYVNUSXJobE5YVGZHWHFXNkdDY2hqN0dlVHkwekJpZkdlSENwMHlwSTZa?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2025/11/24/us-judge-dismisses-criminal-charges-against-james-comey-letitia-james?traffic_source=rss",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.985,
      "consensus": 1.0,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.927,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A federal judge has dismissed the criminal cases against former FBI Director James Comey and New York Attorney General Letitia James. The court found that Lindsey Halligan, the acting U.S. attorney who brought the indictments under Trump, was illegally and unconstitutionally appointed. As a result, the indictments were invalidated and both cases have been thrown out.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful information about a legal decision and its implications, contributing to a deeper understanding of the justice system. However, while it reports on the resolution of a problem, it does not clearly highlight progress or solutions.",
    "constructiveness_source": "gpt",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "US and Ukraine Unveil Revised Peace Framework Amid Ongoing War Talks",
    "domain": "business",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Mon, 24 Nov 2025 13:11:32 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Washington Post",
      "New York Times",
      "Deutsche Welle",
      "Reuters",
      "Financial Times"
    ],
    "domains": [
      "aljazeera.com",
      "washingtonpost.com",
      "nytimes.com",
      "dw.com",
      "news.google.com",
      "ft.com"
    ],
    "snippets": [
      "After talks in Geneva, US and Ukrainian officials agreed any deal should “fully uphold” Ukraine’s sovereignty.",
      "The document, which Ukraine said was too favorable to Russia, has been substantially changed, officials say.",
      "Negotiators had been working off an early proposal that bipartisan lawmakers say would further destabilize global security and reward Russia after its 2022 invasion.",
      "Washington and Kyiv said that “highly productive” discussions over a proposal to end the war between Russia and Ukraine, would continue, but the details remained unclear.",
      "President Trump lashed out at Ukraine even as the talks on his peace proposal were still taking place, accusing the country’s leadership of being ungrateful for American support.",
      "Germany's top diplomat says talks in Geneva on a peace plan for Ukraine have put the EU's stance more in focus. DW has more.",
      "Kyiv's allies are working on revisions to Washington's peace plan as US and European officials meet in Geneva. US Secretary of State Marco Rubio has hailed the talks as \"the best so far.\"",
      "Live: Ukraine regroups after Geneva peace plan talks with US, Russia says European proposals don't work Reuters",
      "The most politically sensitive elements are left for Trump and Zelenskyy to discuss"
    ],
    "image_url": "",
    "titles": [
      "US and Ukraine announce revised peace plan: this is what we know",
      "U.S., Ukraine move closer together on peace plan after lengthy talks",
      "U.S., Ukraine agree to change draft of peace plan that Russia favored",
      "U.S. and Ukraine Hail Progress on Peace Plan to End War With Russia",
      "Ukraine, U.S. Meet About Trump’s Peace Plan to End War With Russia",
      "Ukraine: Wadephul hails Geneva talks as European success",
      "Ukraine: Europeans push back on US plan during Geneva talks",
      "Live: Ukraine regroups after Geneva peace plan talks with US, Russia says European proposals don't work - Reuters",
      "US and Ukraine draft new 19-point peace plan but defer biggest decisions"
    ],
    "url": "https://www.aljazeera.com/video/newsfeed/2025/11/24/us-and-ukraine-announce-revised-peace-plan-this-is-what-we-know?traffic_source=rss",
    "alternate_urls": [
      "https://www.washingtonpost.com/world/2025/11/24/ukraine-peace-plan-europe-russia/",
      "https://www.washingtonpost.com/world/2025/11/23/ukraine-peace-plan-russian-wish-list/",
      "https://www.nytimes.com/2025/11/24/world/europe/ukraine-zelensky-rubio-russia-peace-plan.html",
      "https://www.nytimes.com/2025/11/23/world/europe/ukraine-switzerland-russia-peace-talks.html",
      "https://www.dw.com/en/ukraine-wadephul-hails-geneva-talks-as-european-success/live-74857513?maca=en-rss-en-top-1022-rdf",
      "https://www.dw.com/en/ukraine-europeans-push-back-on-us-plan-during-geneva-talks/live-74850575?maca=en-rss-en-top-1022-rdf",
      "https://news.google.com/rss/articles/CBMiqAFBVV95cUxPR3JCTm5UeHU0eVh0R0w3cWlNZld3SXVmeDBubFJDVmZFZU80ZEEzTTN0UjM3ZzgyRjBsdE9sQ0lRdGZ0dWR0Y3VtZzNsM0lPU1dDWThGNVllR2RBOV9JMWYwRklqeWRTTWJRbjItQUllRzNadHBUYnBTNVVtVmgwTnF6b19ESFR5RHRNcEZ3cjB4UVJsM2VqZEZXblNYeVRqOW9IY254VWo?oc=5",
      "https://www.ft.com/content/883e5a47-430c-4fc2-85ee-cd6af9bb599d"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/video/newsfeed/2025/11/24/us-and-ukraine-announce-revised-peace-plan-this-is-what-we-know?traffic_source=rss",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.864,
      "consensus": 1.0,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.903,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The US and Ukraine announced they have developed an “updated and refined” peace framework aimed at ending the war with Russia. This follows European countries presenting their own alternative proposal. Negotiations have been challenging, with concerns that earlier US proposals could destabilize security and benefit Russia. Talks will continue as parties seek a plan acceptable to Ukraine and its allies.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful information about the ongoing war talks between the US, Ukraine, and Russia. It reports on an attempt to solve a significant problem, which is the war with Russia. However, it does not provide enough detail about the proposed peace framework to fully empower the reader's understanding or decision-making.",
    "constructiveness_source": "gpt",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "Reggae Legend Jimmy Cliff Dies at 81",
    "domain": "general",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Mon, 24 Nov 2025 14:08:48 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Deutsche Welle",
      "BBC",
      "ABC News",
      "Reuters",
      "The Guardian"
    ],
    "domains": [
      "aljazeera.com",
      "dw.com",
      "bbc.com",
      "abcnews.go.com",
      "news.google.com",
      "theguardian.com"
    ],
    "snippets": [
      "The singer recorded more than 30 albums and won two Grammys during his six-decade career.",
      "From racism and black resistance in Jamaica, to Vietnam, the Arab Spring and refugee crises, Jimmy Cliff used the sound of reggae to address social injustice around the world for half a century.",
      "The musician was known for hits like You Can Get It If You Really Want and I Can See Clearly Now.",
      "Grammy Award-winning singer and actor Jimmy Cliff, who helped Jamaican reggae music find its place within global pop culture, has died at 81.",
      "Jimmy Cliff, reggae music pioneer, dies at 81 Reuters",
      "Star of The Harder They Come had hits including You Can Get It If You Really Want and I Can See Clearly Now Jimmy Cliff, the singer and actor whose mellifluous voice helped to turn reggae into a global phenomenon, has died aged 81. A message from his wife Latifa Chambers on Instagram reads: “It’s wi"
    ],
    "image_url": "",
    "titles": [
      "Jimmy Cliff, Jamaican reggae music pioneer, dies at 81",
      "Jamaica: Reggae superstar Jimmy Cliff dies aged 81",
      "Jimmy Cliff, reggae singer with a run of hits spanning decades, dies aged 81",
      "WATCH:  Jamaican reggae legend Jimmy Cliff dies at 81",
      "Jimmy Cliff, reggae music pioneer, dies at 81 - Reuters",
      "Jimmy Cliff, Jamaican reggae singer, actor and cultural icon, dies aged 81"
    ],
    "url": "https://www.aljazeera.com/news/2025/11/24/jimmy-cliff-jamaican-reggae-music-pioneer-dies-at-81?traffic_source=rss",
    "alternate_urls": [
      "https://www.dw.com/en/jamaica-reggae-superstar-jimmy-cliff-dies-aged-81/a-74869592?maca=en-rss-en-top-1022-rdf",
      "https://www.bbc.com/news/articles/cj4qdren425o?at_medium=RSS&at_campaign=rss",
      "https://abcnews.go.com/Entertainment/video/jamaican-reggae-legend-jimmy-cliff-dies-81-127834399",
      "https://news.google.com/rss/articles/CBMirAFBVV95cUxNVjVTZjJTcUdGdVNfZEFNOG1ZdUgwNG9tWTZNd3dyVUdacks3VmFFUk0tS2d3dGZQNWdINmlJZ3JzbjczdmVUaldDdk1uUmtrSThuR0wwQnVHTV9lRWxYOVNqM1pqbmhvdHZBeE1VSTVISkdyZkg0dXZoSTRvN0lUbzBIaVFiMlhIVFBIX082YTU4dHRkWXpwMkxqV1BXdWZlYmJ2V09aVDlTaTRB?oc=5",
      "https://www.theguardian.com/music/2025/nov/24/jimmy-cliff-jamaican-reggae-singer-actor-and-cultural-icon-dies-aged-81"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2025/11/24/jimmy-cliff-jamaican-reggae-music-pioneer-dies-at-81?traffic_source=rss",
    "score_components": {
      "magnitude": 0.986,
      "recency": 0.881,
      "consensus": 1.0,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.871,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Grammy-winning Jamaican singer and actor Jimmy Cliff, known for hits like \"You Can Get It If You Really Want\" and \"I Can See Clearly Now,\" has died at age 81. Over a six-decade career, he recorded more than 30 albums and used reggae music to address global social issues. Cliff was influential in bringing reggae to international audiences.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story provides basic awareness about the life and career of Jimmy Cliff, but it doesn't offer deeper insights or actionable information for the reader. It doesn't report on progress or solutions, nor does it increase clarity around systems, causes, trends, or impacts.",
    "constructiveness_source": "gpt",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "Bollywood Legend Dharmendra Dies at 89",
    "domain": "general",
    "source_domain": "dw.com",
    "location": "global",
    "published": "2025-11-24T16:00:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "BBC",
      "Reuters",
      "New York Times",
      "The Guardian"
    ],
    "domains": [
      "dw.com",
      "bbc.com",
      "news.google.com",
      "nytimes.com",
      "theguardian.com"
    ],
    "snippets": [
      "Over a career spanning six decades, Dharmendra acted in more than 300 films, becoming one of the most iconic and recognizable faces in Bollywood.",
      "Best known for the iconic role of Veeru in the all-time great Sholay, Dharmendra was India's \"most handsome actor\".",
      "Bollywood actor Dharmendra Deol dies at 89 Reuters",
      "In a career spanning nearly seven decades and more than 300 productions, the actor became one of India’s best known and most versatile screen stars.",
      "India’s prime minister among those paying tribute to celebrated actor whose career spanned six decades Dharmendra, one of the most enduring stars of India’s Bollywood cinema, has died at the age of 89. Born Dharam Singh Deol, but later known as Dharmendra, he rose to fame in the 1960s and became one"
    ],
    "image_url": "",
    "titles": [
      "India: Bollywood star Dharmendra dies aged 89",
      "Bollywood legend Dharmendra, one of the biggest stars of Indian cinema, dies aged 89",
      "Bollywood actor Dharmendra Deol dies at 89 - Reuters",
      "Dharmendra, Bollywood Leading Man, Dies at 89",
      "Dharmendra, Bollywood’s ‘He Man’ and one of its most enduring stars, dies at 89"
    ],
    "url": "https://www.dw.com/en/india-bollywood-star-dharmendra-dies-aged-89/a-74868124?maca=en-rss-en-top-1022-rdf",
    "alternate_urls": [
      "https://www.bbc.com/news/articles/cg66lv566kyo?at_medium=RSS&at_campaign=rss",
      "https://news.google.com/rss/articles/CBMikAFBVV95cUxNcm9qSTJPZzU5VnNGRWlKbWxxVHBSMUt3R2JHMGhSX0lsNzEwME1mUEtzZEtRN0xrcXU5Q2tRWFN6U1dYNTdYcXVZYWlGeXp0MmlHU2dhMlNNTmNiUDhlRU9mNnhmdDZIY2NSS2t2WkRlbVQ1QS1ZdzZPckpQNVFrQVlzZGdicjNZaURReUtwZVY?oc=5",
      "https://www.nytimes.com/2025/11/24/world/asia/india-bollywood-dharmendra-dead.html",
      "https://www.theguardian.com/world/2025/nov/24/dharmendra-bollywood-he-man-enduring-star-dies"
    ],
    "location_scope": "global",
    "link": "https://www.dw.com/en/india-bollywood-star-dharmendra-dies-aged-89/a-74868124?maca=en-rss-en-top-1022-rdf",
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.916,
      "consensus": 0.995,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.862,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Bollywood actor Dharmendra, born Dharam Singh Deol, has died at the age of 89. Over a career spanning nearly seven decades, he appeared in more than 300 films and became one of India's most recognized and versatile actors, best known for his role as Veeru in \"Sholay.\" Tributes have been paid by public figures, including India's prime minister.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness about the life and career of Dharmendra, but it doesn't provide deeper understanding or actionable insights. It doesn't report on progress or solutions, nor does it increase clarity around systems, causes, trends, or impacts.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Ukraine Probes 178,000 War Crimes as U.S.-Backed Peace Talks Advance",
    "domain": "business",
    "source_domain": "npr.org",
    "location": "national",
    "published": "Mon, 24 Nov 2025 07:10:06 -0500",
    "source": "NPR",
    "sources": [
      "NPR",
      "Washington Post",
      "New York Times",
      "Axios",
      "Financial Times",
      "The Guardian"
    ],
    "domains": [
      "npr.org",
      "washingtonpost.com",
      "nytimes.com",
      "news.google.com",
      "ft.com",
      "theguardian.com"
    ],
    "snippets": [
      "European leaders are skeptical of President Trump's peace plan for Ukraine. And, what led Marjorie Taylor Greene to announce she will resign from Congress next year.",
      "The Trump White House has grown impatient to end the war in Ukraine. Critics say it is playing into Russia’s hands.",
      "President Trump is pressing Kyiv to accept an outcome that yields to President Vladimir V. Putin’s demands.",
      "How Trump's 28-point plan for Ukraine shocked the world Axios",
      "Ukraine says it's investigating over 178,000 war crimes amid Trump peace plan talks Axios",
      "U.S., Ukraine say they made \"meaningful progress\" on Trump's peace plan Axios",
      "Washington’s mixed signals and shifting proposals unsettle allies as negotiations near a critical phase",
      "Following criticism, the president accused Ukraine of ingratitude but also added the plan was ‘not my final offer’. Which parts of it will survive? The US president, Donald Trump, has said “something good just may be happening” at the talks in Switzerland intended to end the war in Ukraine. European"
    ],
    "image_url": "",
    "titles": [
      "Trump's peace plan for Ukraine. And, why Marjorie Taylor Greene is resigning",
      "The case against — and for — Trump’s Ukraine plan",
      "What Is Trump’s 28-Point Plan to End Russia’s War in Ukraine?",
      "How Trump's 28-point plan for Ukraine shocked the world - Axios",
      "Ukraine says it's investigating over 178,000 war crimes amid Trump peace plan talks - Axios",
      "U.S., Ukraine say they made \"meaningful progress\" on Trump's peace plan - Axios",
      "The Trump team’s tortured path to a Ukraine peace plan",
      "Trump’s ‘peace plan’ was a pro-Kremlin abomination whose failure is a glimmer of hope for Ukraine | Rajan Menon"
    ],
    "url": "https://www.npr.org/2025/11/24/g-s1-99036/up-first-newsletter-ukraine-russia-marjorie-taylor-greene-israel-hamas",
    "alternate_urls": [
      "https://www.washingtonpost.com/world/2025/11/24/trump-ukraine-deal-criticism/",
      "https://www.nytimes.com/2025/11/22/world/europe/trump-russia-ukraine-peace-plan.html",
      "https://news.google.com/rss/articles/CBMifEFVX3lxTE9TeG5tN3plUl84SlBwdFNBQ3JmaGlSbUFRNE1Ia2lJOVctUE9xRjR2aEZWSnUzM1QxMG5Fdm9vMWV0ZUxMd2MyZUNWeXJyZTJSUXROZDVPZ1otUEFLNmJuUklWTnZic2Z6TUVMeDg0TW9QQ09ETVFNLVhPdDE?oc=5",
      "https://news.google.com/rss/articles/CBMimgFBVV95cUxPaHBUa2tQdjJoOHQwanNZUlZRZmxrUHJoSzhqRVYxblpPcXI4ZHZOSWhfd0g0d3dBallxbVJlV3Z2TnliWmhIOEdManBmaHRUOTdRR3dSZjV3Qnk4ZmhtZ2t2Nkd1NnE2ZzlNQ1Y0RjRyMjRWWUgzdkZ6bFZoWk9MMDUxbVV1Q3YyMnQ0VUlnUS1aQ184Q1czc3BR?oc=5",
      "https://news.google.com/rss/articles/CBMieEFVX3lxTE1rdFdvTzNOa0k3bzMyYkJ1OENjSDdadXdHaDdWb2hhVVFhV2k4aHlXdnhUOGhlbE90cmNjcDFhcktiREZvZDkyZFdicFg5TWZuaVhQUGpjSzBidzBEOU9SV0hZdjNGYVR5dVUtWVlNTnYybjM3aTBJOA?oc=5",
      "https://www.ft.com/content/b37b94ec-8b3d-4449-b466-b346af7622cc",
      "https://www.theguardian.com/commentisfree/2025/nov/24/donald-trump-peace-plan-kremlin-ukraine"
    ],
    "location_scope": "national",
    "link": "https://www.npr.org/2025/11/24/g-s1-99036/up-first-newsletter-ukraine-russia-marjorie-taylor-greene-israel-hamas",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.846,
      "consensus": 1.0,
      "constructiveness": 0.053,
      "proximity": 0.75
    },
    "score": 0.849,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Ukraine is investigating over 178,000 alleged war crimes as talks continue on a U.S.-backed peace plan to end the conflict with Russia. U.S. and Ukrainian officials reported \"meaningful progress\" in recent Geneva meetings, but no final agreement or security guarantees have been reached. Discussions are ongoing, with few details released, and negotiations are entering a critical phase.",
    "constructiveness_score": 0.053,
    "constructiveness_reason": "keywords (1): plan; semantic: pos_sim=0.10, neg_sim=0.07; semantic_boost=0.00",
    "constructiveness_source": "heuristic",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Blazers Coach Chauncey Billups Pleads Not Guilty in Mafia Poker Case",
    "domain": "sports",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Mon, 24 Nov 2025 17:29:47 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "ESPN",
      "CBS Sports",
      "The Guardian"
    ],
    "domains": [
      "news.google.com",
      "espn.com",
      "cbssports.com",
      "theguardian.com"
    ],
    "snippets": [
      "NBA's Chauncey Billups pleads not guilty in rigged poker games case Reuters",
      "Trail Blazers coach and basketball Hall of Famer Chauncey Billups pleaded not guilty, on Monday, to charges tied to his alleged role in rigged poker games involving Mafia figures. He was released on $5 million bond.",
      "Billups, Rozier and Jones were among the current and former NBA players charged in the FBI's investigation into illegal gambling",
      "NBA champion accused of playing in rigged games Could face decades in prison if found guilty Portland Trail Blazers coach and basketball Hall of Famer Chauncey Billups pleaded not guilty on Monday to charges he profited from rigged poker games involving several mafia figures and at least one other f"
    ],
    "image_url": "",
    "titles": [
      "NBA's Chauncey Billups pleads not guilty in rigged poker games case - Reuters",
      "Blazers' Billups pleads not guilty in poker case",
      "Chauncey Billups pleads not guilty to conspiracy charges: Where Terry Rozier, Damon Jones stand after arrests",
      "Basketball Hall of Famer Chauncey Billups pleads not guilty to mafia poker charges"
    ],
    "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxPZml3ZVNrZTJ6S2Y4MEFiaXFpU1I0QmNxNUJBVXpoVFFfX2JIcDE1bVVVZ1hDZmpmZHUxaUxtemV1S1JUWEJQWUVrSnk1eF9LWlJpOHc4aFBjWjN0bXNoS21vUUFPY2RWY2ZZTm9Nc3NQVHFjQVpkd252MWd4TzVNcExZdjhhemloUWFPUUUzdWVadndSX0h3bTJWOUFabkgtR2VHUHJjUV8wTjNHMFE?oc=5",
    "alternate_urls": [
      "https://www.espn.com/nba/story/_/id/47085562/chauncey-billups-pleads-not-guilty-mafia-tied-poker-scheme",
      "https://www.cbssports.com/nba/news/chauncey-billups-conspiracy-charges-terry-rozier-damon-jones-arrests/",
      "https://www.theguardian.com/sport/2025/nov/24/basketball-hall-of-famer-chauncey-billups-pleads-not-guilty-to-mafia-poker-charges"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMirgFBVV95cUxPZml3ZVNrZTJ6S2Y4MEFiaXFpU1I0QmNxNUJBVXpoVFFfX2JIcDE1bVVVZ1hDZmpmZHUxaUxtemV1S1JUWEJQWUVrSnk1eF9LWlJpOHc4aFBjWjN0bXNoS21vUUFPY2RWY2ZZTm9Nc3NQVHFjQVpkd252MWd4TzVNcExZdjhhemloUWFPUUUzdWVadndSX0h3bTJWOUFabkgtR2VHUHJjUV8wTjNHMFE?oc=5",
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.945,
      "consensus": 0.908,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.838,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Portland Trail Blazers coach and Hall of Famer Chauncey Billups pleaded not guilty to charges related to participating in and profiting from rigged poker games involving Mafia figures. He was released on $5 million bond. Billups, along with other current and former NBA players, was charged following an FBI investigation into illegal gambling. The case is ongoing.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs about an ongoing legal case involving a high-profile basketball coach, providing useful context about the charges and the FBI investigation. However, it doesn't delve into broader implications, such as the impact on the NBA or potential measures to prevent similar incidents in the future.",
    "constructiveness_source": "gpt",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "Caitlin Clark to Attend First USA Basketball Senior Camp at Duke Next Month",
    "domain": "sports",
    "source_domain": "cbssports.com",
    "location": "national",
    "published": "Mon, 24 Nov 2025 18:16:19 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Bleacher Report",
      "Sportsnet"
    ],
    "domains": [
      "cbssports.com",
      "news.google.com",
      "sportsnet.ca"
    ],
    "snippets": [
      "Clark has not suited up for game action since July due to a groin injury",
      "Caitlin Clark, Angel Reese, Paige Bueckers Among Players to Make USA Camp Debuts Bleacher Report",
      "Caitlin Clark will make her USA Basketball senior national team camp debut when the Americans get together at Duke next month. The Indiana Fever all-star, who missed the second half of the WNBA season with a groin injury, had been invited to a few camps while she was in college at Iowa, but the timing didn’t work out. She’ll be there alongside first-timers Angel Reese, Paige Bueckers, Cameron Brink, Sonia Citron, Veronica Burton, Kiki Iriafen and Rickea Jackson. College players Lauren Betts of UCLA and JuJu Watkins of Southern California are also invited. Watkins is out for the season while..."
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/11/24/e376bf05-9da2-4ff8-9c3e-8cc2e816d5b5/gettyimages-2225172185-1.jpg",
    "titles": [
      "Caitlin Clark to make USA Basketball senior national team camp debut; Paige Bueckers, Angel Reese also invited",
      "Caitlin Clark, Angel Reese, Paige Bueckers Among Players to Make USA Camp Debuts - Bleacher Report",
      "Caitlin Clark set for U.S. national team camp debut"
    ],
    "url": "https://www.cbssports.com/wnba/news/caitlin-clark-usa-basketball-team-camp-paige-bueckers-angel-reese/",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMivAFBVV95cUxNZEVoS01QN3ZMeDF3bTBnR2p0M1RCcDFoWERGbmpBYm5hR203UHZUNFpiemhCVDlFUUpQb2tYZktYbGpXck5WRmRvR3A3MUJGRXp6WTUxRy1DQXY4M1FfelNFbERBbWpnS3B5Sk9scFVPaXVXbEpNTTVhVlU5emZmREVqb2NCamUxOFhaN1BpTEo3YkRJQUwzclNJMnUzUm5jN0J1VlVGS082N0x0NU9Vd2UtTkNBejBDeEcyWg?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.cbssports.com/wnba/news/caitlin-clark-usa-basketball-team-camp-paige-bueckers-angel-reese/",
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.96,
      "consensus": 0.789,
      "constructiveness": 0.5,
      "proximity": 0.75
    },
    "score": 0.811,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Caitlin Clark will participate in her first USA Basketball senior national team camp at Duke next month, after missing the second half of the WNBA season with a groin injury. She joins other first-time invitees, including Angel Reese and Paige Bueckers. Several college players, such as Lauren Betts and JuJu Watkins, are also invited, though Watkins is sidelined for the season.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness about the upcoming USA Basketball senior national team camp and the players who will be participating. However, it doesn't provide deeper insights or understanding about the significance of this camp, the selection process, or the impact on the players' careers.",
    "constructiveness_source": "gpt",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "Amazon Pledges $50B for AI and Supercomputing Expansion for US Government",
    "domain": "business",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Mon, 24 Nov 2025 18:22:47 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Reuters",
      "CNBC",
      "Bloomberg"
    ],
    "domains": [
      "aljazeera.com",
      "news.google.com",
      "cnbc.com"
    ],
    "snippets": [
      "The US federal government seeks to develop tailored AI solutions and drive significant cost savings.",
      "Amazon pledges up to $50 billion to expand AI, supercomputing for US government Reuters",
      "The project will add 1.3 gigawatts of capacity across new data centers, with Amazon expected to break ground in 2026.",
      "Amazon to Spend $50 Billion to Expand AI Services to US Agencies Bloomberg.com"
    ],
    "image_url": "",
    "titles": [
      "Amazon to invest $50bn in AI for US government customers",
      "Amazon pledges up to $50 billion to expand AI, supercomputing for US government - Reuters",
      "Amazon to spend up to $50 billion on AI infrastructure for U.S. government",
      "Amazon to Spend $50 Billion to Expand AI Services to US Agencies - Bloomberg.com"
    ],
    "url": "https://www.aljazeera.com/economy/2025/11/24/amazon-to-invest-50bn-in-ai-for-us-government-customers?traffic_source=rss",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiygFBVV95cUxPMmszc1dPLUZaYnNvdGlfUGcwWGRjbmlPT2xpVklaM0pDYnc2RnZpbHRDME1RSDF1SlVzckxKNEhjVlNvdFgwcndMUEQ3RnJPRzhCS3NXcXBjOXl3eV9RbXE2MUlWalNiUTRSeHRGd2M1RVZ4aXUzNV9xYWRPbGlZMDFyZl9YNndfLVMwY2Q2LWFhT0M5V25oaHpBRklGLTFUWFlJb1FVaU9ZWUkzcTVzdTVEU0djRm5QR3lnMVFORUR6aVcyUDVTdU5n?oc=5",
      "https://www.cnbc.com/2025/11/24/amazon-to-spend-up-to-50-billion-on-ai-services-for-us-government.html",
      "https://news.google.com/rss/articles/CBMitAFBVV95cUxPRnRpa0xDSlhINWVxd1JGWXpYbkdhQWxwM3pDXzBrQ0lkTDFESVpQXzJEVXotSHlUWVV2bWplV1d2MGExQU5UZVE4MFBWQVREVGhselFzXzdTS2RpMGlBQnlPTmRBZ04xYTVnZjNIRXBraDBrM2ZKdEFQckl3eGJ5VjR6VFlkbGJZbWk0cy1lRFlNcVZoWDIwWWFIM3JqRE54NW9VOU9Lc2NOZUN1Z0puME1BNUs?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/economy/2025/11/24/amazon-to-invest-50bn-in-ai-for-us-government-customers?traffic_source=rss",
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.963,
      "consensus": 0.888,
      "constructiveness": 0.216,
      "proximity": 0.5
    },
    "score": 0.805,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Amazon has pledged up to $50 billion to expand artificial intelligence and supercomputing services for the US federal government. The investment will add 1.3 gigawatts of capacity through new data centers, with construction expected to begin in 2026. The initiative aims to provide tailored AI solutions and generate significant cost savings for US agencies.",
    "constructiveness_score": 0.216,
    "constructiveness_reason": "keywords (4): expand, initiative, investment, solution; semantic: pos_sim=0.15, neg_sim=0.07; semantic_boost=0.02",
    "constructiveness_source": "heuristic",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "Shedeur Sanders Named Browns Starting QB vs. 49ers, Keeps Job Over Gabriel",
    "domain": "sports",
    "source_domain": "cbssports.com",
    "location": "national",
    "published": "Mon, 24 Nov 2025 18:53:59 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Yahoo Sports",
      "Bleacher Report"
    ],
    "domains": [
      "cbssports.com",
      "sports.yahoo.com",
      "news.google.com"
    ],
    "snippets": [
      "Sanders seeks to remain unbeaten as a starter after defeating the Raiders",
      "The Browns liked what they saw from Shedeur Sanders on Sunday, and he'll be getting the reins of the offense from here on out.",
      "Sanders proved he could limit drive-killing mistakes. That was enough to earn him a second-straight start, even with Dillon Gabriel healthy.",
      "Shedeur Sanders will make his second NFL start on Sunday when the Cleveland Browns host the San Francisco 49ers. Coach Kevin Stefanski made the announcement Monday that Sanders would get another week under center. The rookie fifth-round pick completed 11 of 20 passes for 209 yards with a touchdown a",
      "Will Shedeur Sanders or Dillon Gabriel Start vs. 49ers? Browns HC Names QB1 After Win Bleacher Report",
      "Will Shedeur Sanders Start for Browns vs. 49ers After 1st NFL Win? HC Weighs In Bleacher Report",
      "His debut wasn't perfect, but it offered hope -- and Cleveland has to find out what it has before drafting yet another QB in the spring"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/11/24/7f9f6a9e-26a5-4877-a55f-fd863d34870d/shedeur-sanders-browns-raiders-postgame-win.jpg",
    "titles": [
      "Shedeur Sanders to start against 49ers: Browns QB gets second consecutive nod after victory in debut",
      "Shedeur Sanders earns Browns' starting QB job after win in debut start",
      "Why Shedeur Sanders, not Dillon Gabriel, is Browns starting QB again?",
      "Shedeur Sanders to make 2nd NFL start for Browns against 49ers",
      "Will Shedeur Sanders or Dillon Gabriel Start vs. 49ers? Browns HC Names QB1 After Win - Bleacher Report",
      "Will Shedeur Sanders Start for Browns vs. 49ers After 1st NFL Win? HC Weighs In - Bleacher Report",
      "What are the Browns doing if Shedeur Sanders isn't starting the rest of the season?"
    ],
    "url": "https://www.cbssports.com/nfl/news/browns-starting-qb-shedeur-sanders-dillon-gabriel-kevin-stefanski-week-13/",
    "alternate_urls": [
      "https://sports.yahoo.com/articles/shedeur-sanders-earns-browns-starting-194729213.html",
      "https://sports.yahoo.com/articles/why-shedeur-sanders-not-dillon-194241582.html",
      "https://sports.yahoo.com/articles/shedeur-sanders-2nd-nfl-start-193907482.html",
      "https://news.google.com/rss/articles/CBMixwFBVV95cUxNWVZxd18wVWZlR09KVGM2OHZZX2ZXMGZqUkQyaHk5a0ttSjRSNG5Sc3VaQ0Jud0dZT00tQTRrd3ZwRzIyQzJmb2NwdnJPejRjNjFUbzAxdUZfbTJVZzlXZ1VWRWYzdkdmTjFYUWJWdWlrSFAyNFhZMDc1TUswT2RudXpaazUySmRJYy1ZNmNubG95Y3FZN213bzMyTWR1cW5XbGZEV1B6djAwMnpCWTBuVjhERjIzU1VKUW9zblRoTERWVXg5ZzVN?oc=5",
      "https://news.google.com/rss/articles/CBMitgFBVV95cUxOaDd2eGtuVlRlQlBtMkNEcUs4WUp5V2xZVUdHV3dIT2dsa3ptdkJQQTV2aUNxbEtVRjlDRnRBREpCajhzMy16em1hdGFIN3VtWXNfTmVjNVE4LTFfa2tvZjhMM0NndllDNnR0WjhUZDJxaWZYamlZMXdTTVFrVzNseERCMjJKM1gwMEpSR3l0cUVNOTB6RVhGYlRzZHc5OFJIQ21iYm5MM01zS1VPU1FGcWRsdVJIUQ?oc=5",
      "https://www.cbssports.com/nfl/news/what-are-the-browns-doing-if-shedeur-sanders-isnt-starting-the-rest-of-the-season/"
    ],
    "location_scope": "national",
    "link": "https://www.cbssports.com/nfl/news/browns-starting-qb-shedeur-sanders-dillon-gabriel-kevin-stefanski-week-13/",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.973,
      "consensus": 0.789,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.781,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Shedeur Sanders will start at quarterback for the Cleveland Browns against the San Francisco 49ers, as announced by coach Kevin Stefanski. Sanders, a rookie fifth-round pick, earned his second consecutive start after leading the Browns to a win over the Raiders, completing 11 of 20 passes for 209 yards and a touchdown. He remains the starter despite Dillon Gabriel being healthy.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about the decision of the Cleveland Browns to start Shedeur Sanders as quarterback, but it does not offer actionable insights, solutions, or a deeper understanding of the situation.",
    "constructiveness_source": "gpt",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "Pauline Hanson Sparks Outrage by Wearing Burqa in Parliament to Call for Ban",
    "domain": "general",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Mon, 24 Nov 2025 13:34:33 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian",
      "Reuters"
    ],
    "domains": [
      "bbc.com",
      "theguardian.com",
      "news.google.com"
    ],
    "snippets": [
      "Pauline Hanson donned a black burka as she sought to push for a ban on the garment.",
      "There was outrage after the Australian far-right senator Pauline Hanson wore a burqa to parliament, the second time she has used the head garment worn by some Muslim women as a political prop to push for a national ban during her career. Hanson wore the garment shortly after she was denied permissio",
      "Australian far-right senator wears burqa to parliament, sparking outrage Reuters"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/930d/live/45c0c8f0-c934-11f0-a892-01d657345866.jpg",
    "titles": [
      "Australia senator condemned for burka stunt in parliament",
      "Outrage at Australian far-right senator wearing burqa to parliament – video",
      "Australian far-right senator wears burqa to parliament, sparking outrage - Reuters"
    ],
    "url": "https://www.bbc.com/news/articles/cz94pdkzqvwo?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://www.theguardian.com/global/video/2025/nov/24/australian-far-right-senator-pauline-hanson-wears-burqa-parliament-video",
      "https://news.google.com/rss/articles/CBMiwAFBVV95cUxPX2h1eHJOY0FySW5DMExkT055bktvZE8zRllGUmJGVkliWGJHRUtCNVdnaVdoMkxWXzVfV3FmcVZzc2ItZk5rNC1ldWZSTzNFNTIyc1pvRm81UnItMXdtY1FHVkVhYVBYLVh5VTRVejdLT0Y5MUV1MnUybjJ6YlRBcEdZYkIyM1kweEFSYTlLeFJWMTNUT3NsUVo3RzQwUWdCdThXcHlOZFM3cGlSbXdqelZKRFFlQUx4MVFHazVTQjk?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/news/articles/cz94pdkzqvwo?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.871,
      "consensus": 0.789,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.771,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Australian far-right senator Pauline Hanson wore a black burqa to parliament, prompting widespread outrage. Hanson used the garment as a political statement to advocate for a national ban on the burqa. This is the second time she has used the burqa in this way. The incident has drawn criticism from politicians and community groups. There is currently no national ban on the burqa in Australia.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs about a controversial political incident in Australia, providing some context and insight into the actions of Pauline Hanson. However, it doesn't report on solutions or improvements, and while it increases awareness about the incident, it doesn't offer a deep understanding of the broader issues at play.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Anthropic Launches Claude Opus 4.5 AI Model With Chrome and Excel Integration",
    "domain": "business",
    "source_domain": "cnbc.com",
    "location": "national",
    "published": "Mon, 24 Nov 2025 19:00:01 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Business Insider",
      "TechCrunch"
    ],
    "domains": [
      "cnbc.com",
      "businessinsider.com",
      "techcrunch.com"
    ],
    "snippets": [
      "Anthropic says its new Claude Opus 4.5 excels at coding, using computers and assisting users with complex enterprise tasks.",
      "Anthropic debuts Claude Opus 4.5, which it says is its smartest AI model yet, enhancing workplace productivity and code generation.",
      "Anthropic has launched Opus 4.5, the latest version of its flagship model, with new integrations into Chrome and Excel."
    ],
    "image_url": "",
    "titles": [
      "Anthropic unveils Claude Opus 4.5, its latest AI model following $350 billion valuation",
      "Anthropic unveils new Claude Opus 4.5, its 'most intelligent' model",
      "Anthropic releases Opus 4.5 with new Chrome and Excel integrations"
    ],
    "url": "https://www.cnbc.com/2025/11/24/anthropic-unveils-claude-opus-4point5-its-latest-ai-model.html",
    "alternate_urls": [
      "https://www.businessinsider.com/claude-opus-4-5-ai-model-anthropic-debut-advanced-features-2025-11",
      "https://techcrunch.com/2025/11/24/anthropic-releases-opus-4-5-with-new-chrome-and-excel-integrations/"
    ],
    "location_scope": "national",
    "link": "https://www.cnbc.com/2025/11/24/anthropic-unveils-claude-opus-4point5-its-latest-ai-model.html",
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.975,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.749,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Anthropic has launched Claude Opus 4.5, its latest and most advanced AI model. The company says Opus 4.5 offers improved coding abilities, better computer use, and enhanced support for complex business tasks. The model now features integrations with Chrome and Excel to boost workplace productivity.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords (2): launch, support; semantic: pos_sim=0.06, neg_sim=0.07",
    "constructiveness_source": "heuristic",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "Novo Nordisk Alzheimer's Drug Trial Fails, Shares Drop Sharply",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Mon, 24 Nov 2025 17:35:53 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "CNBC",
      "Fortune"
    ],
    "domains": [
      "news.google.com",
      "cnbc.com",
      "fortune.com"
    ],
    "snippets": [
      "Novo Nordisk Alzheimer's drug trials fail in blow to weight-loss giant Reuters",
      "Shares of Novo Nordisk plunged after the Danish pharmaceutical company said a highly anticipated trial for Alzheimer's disease failed to meet its main goal.",
      "The stock of the Wegovy and Ozempic maker is down nearly 50% year to date."
    ],
    "image_url": "",
    "titles": [
      "Novo Nordisk Alzheimer's drug trials fail in blow to weight-loss giant - Reuters",
      "Novo Nordisk shares plunge after Alzheimer's drug trial fails to hit key target",
      "Novo Nordisk stock trades at 4-year-low on the back of disappointing Alzheimer’s trial"
    ],
    "url": "https://news.google.com/rss/articles/CBMizAFBVV95cUxPZ3RnX281ZVFlckJFQURmalZFNlJicDJqQjZHNF93MDdjZjdoOHlSekZtYzlwaWJXR0tlWnFMWE1rX2pHNHB0MEVlZ2hwNDdTNVpWUzJMQW9sOUJzQkVPVm9BR2ljX2tweDJ6TjRCTFJOS19Wc0tuNEU1MlF5RUN1SVF1VXZfWGN5OTBZbTMzVFNQbkhfbU5CUlZBT2dqVjZrUTV6MFhtTk1jRFB1MW1NVVRFMU1QcVR1Q1dfbmhEaVVsdGVaUnUwN0JYQm4?oc=5",
    "alternate_urls": [
      "https://www.cnbc.com/2025/11/24/novo-nordisk-shares-plunge-after-alzheimers-drug-trial-fails-to-hit-key-target.html",
      "https://fortune.com/2025/11/24/why-novo-nordisk-stock-falling-alzheiemers-trial-semaglutide/"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMizAFBVV95cUxPZ3RnX281ZVFlckJFQURmalZFNlJicDJqQjZHNF93MDdjZjdoOHlSekZtYzlwaWJXR0tlWnFMWE1rX2pHNHB0MEVlZ2hwNDdTNVpWUzJMQW9sOUJzQkVPVm9BR2ljX2tweDJ6TjRCTFJOS19Wc0tuNEU1MlF5RUN1SVF1VXZfWGN5OTBZbTMzVFNQbkhfbU5CUlZBT2dqVjZrUTV6MFhtTk1jRFB1MW1NVVRFMU1QcVR1Q1dfbmhEaVVsdGVaUnUwN0JYQm4?oc=5",
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.947,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.743,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Novo Nordisk announced that its Alzheimer's drug trial did not meet its primary goal, leading to a significant drop in its share price. The company, known for weight-loss drugs Wegovy and Ozempic, has seen its stock fall nearly 50% this year. The trial's failure is a setback for Novo Nordisk's efforts to expand beyond its core products.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords (2): effort, expand; semantic: pos_sim=0.00, neg_sim=0.00",
    "constructiveness_source": "heuristic",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "Vikings QB J.J. McCarthy Enters Concussion Protocol After Packers Game",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Mon, 24 Nov 2025 13:58:53 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "espn.com",
      "sportsnet.ca"
    ],
    "snippets": [
      "Vikings quarterback J.J. McCarthy has entered the concussion protocol after reporting symptoms on the flight home Sunday night, coach Kevin O'Connell said.",
      "Head coach Kevin O’Connell told reporters on Monday that starter J.J. McCarthy has entered concussion protocol after he felt symptoms after Sunday’s game against the Green Bay Packers."
    ],
    "image_url": "",
    "titles": [
      "Vikings place struggling QB McCarthy in protocol",
      "Vikings QB J.J. McCarthy in concussion protocol, not ruled out vs. Seahawks"
    ],
    "url": "https://www.espn.com/nfl/story/_/id/47086594/vikings-put-struggling-jj-mccarthy-concussion-protocol",
    "alternate_urls": [],
    "location_scope": "national",
    "link": "https://www.espn.com/nfl/story/_/id/47086594/vikings-put-struggling-jj-mccarthy-concussion-protocol",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.975,
      "consensus": 0.591,
      "constructiveness": 0.6,
      "proximity": 0.75
    },
    "score": 0.735,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Minnesota Vikings quarterback J.J. McCarthy has entered the NFL's concussion protocol after experiencing symptoms following Sunday's game against the Green Bay Packers. Head coach Kevin O'Connell confirmed that McCarthy reported the symptoms during the flight home. McCarthy's status for upcoming games will depend on his recovery and clearance from the protocol.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story informs readers about the health status of J.J. McCarthy and the NFL's concussion protocol. It provides useful context about player safety in the NFL, but does not report on solutions or improvements.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Malaysia to Ban Social Media for Under-16s Starting in 2026",
    "domain": "technology",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Mon, 24 Nov 2025 02:36:00 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "New York Times",
      "TechCrunch"
    ],
    "domains": [
      "news.google.com",
      "nytimes.com",
      "techcrunch.com"
    ],
    "snippets": [
      "Malaysia says it plans to ban social media for under-16s from 2026 Reuters",
      "The announcement on Sunday, which was light on details, came weeks before a similar action takes effect in Australia.",
      "The country's communications minister Fahmi Fadzil said the administration is considering systems for implementing age restrictions on social media sites."
    ],
    "image_url": "",
    "titles": [
      "Malaysia says it plans to ban social media for under-16s from 2026 - Reuters",
      "Malaysia to Ban Children Under 16 From Social Media, Echoing Australia",
      "Malaysia may ban users under 16 from social media starting next year"
    ],
    "url": "https://news.google.com/rss/articles/CBMirgFBVV95cUxQdV92M0lRN1o5cVN5NjRyTEItS0p1My1rUlRqOTB6U081ZUVXQ2hRSUpCSDVjUE1nZk1wazl4a1JtZVltdjFmRGlPNUdRTGlsSWRHUVR3bmdmMXhsNE56V19mQ1hwUW5PMVM5allLc1dkOEdyWVdIcXVKMENnNHctTDhwbEZoMDFaTjlYSVpwamhnUnVvck9zY1NuSDM0WlpDemthX3FJUk1KTmdMdEE?oc=5",
    "alternate_urls": [
      "https://www.nytimes.com/2025/11/24/world/asia/malaysia-social-media-ban.html",
      "https://techcrunch.com/2025/11/24/malaysia-may-ban-users-under-16-from-social-media-starting-next-year/"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMirgFBVV95cUxQdV92M0lRN1o5cVN5NjRyTEItS0p1My1rUlRqOTB6U081ZUVXQ2hRSUpCSDVjUE1nZk1wazl4a1JtZVltdjFmRGlPNUdRTGlsSWRHUVR3bmdmMXhsNE56V19mQ1hwUW5PMVM5allLc1dkOEdyWVdIcXVKMENnNHctTDhwbEZoMDFaTjlYSVpwamhnUnVvck9zY1NuSDM0WlpDemthX3FJUk1KTmdMdEE?oc=5",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.693,
      "consensus": 0.789,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.735,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Malaysia has announced plans to ban social media access for individuals under 16 starting in 2026. The move follows similar measures in other countries, including an upcoming restriction in Australia. Details about the implementation have not been released. The government says the ban aims to protect children from online risks.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information about a new policy in Malaysia, contributing to readers' awareness of global trends in internet regulation. However, it lacks depth and actionable insights, as it doesn't explain the reasons behind the decision or its potential impacts.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Israeli Airstrike in Beirut Kills Hezbollah Chief of Staff, Escalates Tensions",
    "domain": "general",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Mon, 24 Nov 2025 18:19:30 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "New York Times"
    ],
    "domains": [
      "aljazeera.com",
      "nytimes.com"
    ],
    "snippets": [
      "Thousands gathered in Beirut at the funeral of Hezbollah commander Haytham Ali Tabatabai, a day after Israel killed him.",
      "Escalating its attacks on the Iran-backed militant group in Lebanon, Israel killed Hezbollah’s military chief of staff in an airstrike on an apartment building."
    ],
    "image_url": "",
    "titles": [
      "Thousands mourn Hezbollah commander killed by Israel",
      "Israel Says It Assassinated Top Hezbollah Commander in Lebanon"
    ],
    "url": "https://www.aljazeera.com/video/newsfeed/2025/11/24/thousands-mourn-hezbollah-commander-killed-by-israel?traffic_source=rss",
    "alternate_urls": [
      "https://www.nytimes.com/2025/11/23/world/middleeast/israel-hezbollah-dahiya-airstrike.html"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/video/newsfeed/2025/11/24/thousands-mourn-hezbollah-commander-killed-by-israel?traffic_source=rss",
    "score_components": {
      "magnitude": 0.795,
      "recency": 0.961,
      "consensus": 0.591,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.728,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Israel conducted an airstrike on a southern suburb of Beirut, killing Hezbollah’s chief of staff, Haytham Tabtabai, along with at least four others. This marks the first Israeli strike on Beirut since June and follows a year-old ceasefire. The attack significantly escalates tensions between Israel and Hezbollah, raising concerns about renewed hostilities in the region.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story informs about a significant event and its potential implications. It provides context about the ongoing conflict and tension between Israel and Hezbollah. However, it does not offer solutions or ways to deescalate the situation.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Dallas Wings Win 2026 WNBA Draft Lottery, Secure No. 1 Pick for Second Year",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Mon, 24 Nov 2025 12:37:05 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Bleacher Report"
    ],
    "domains": [
      "espn.com",
      "news.google.com"
    ],
    "snippets": [
      "Azzi Fudd is the new projected No. 1 pick after Dallas won the draft lottery for the second consecutive year.",
      "WNBA Draft Lottery 2026 Full Selection Order as Wings Win Lauren Betts Sweepstakes Bleacher Report",
      "WNBA Mock Draft 2026 and Predictions for Lauren Betts, Full 1st Round After Lottery Bleacher Report"
    ],
    "image_url": "",
    "titles": [
      "WNBA mock draft: UConn's Fudd is new No. 1 as Wings win lottery",
      "WNBA Draft Lottery 2026 Full Selection Order as Wings Win Lauren Betts Sweepstakes - Bleacher Report",
      "WNBA Mock Draft 2026 and Predictions for Lauren Betts, Full 1st Round After Lottery - Bleacher Report"
    ],
    "url": "https://www.espn.com/wnba/story/_/id/47077823/wnba-mock-draft-2026-lottery-dallas-wings-no-1-pick-awa-fam-betts-miles-latson-johnson-fudd",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiwgFBVV95cUxNcHl4ZDdSNEpibERmNmc3YWFEbmtrNDE3YmpwcFVKTXh2cG5tQUNDMEVJRzczZk5ncTFaWnU4SDU3b1dNbUpnOURwNVhqd1doN0FBQXNVZE9IOTNqRFRyM1hjZ3BmQWlfODgxQm44WW1xUlZfd2poTUt1UFljbEZCa1l1VFZsMVFoRW8zMUQzQnAxZ2FLSFBnY1d1VzczVnJYOXNTcjlYWGtqaVZ0b3g4YmNzRG1kZWlkTlBCYlIwRGt0UQ?oc=5",
      "https://news.google.com/rss/articles/CBMiwAFBVV95cUxQNEhYNklfR2RINTB1VC1JWnVVZ2U2Rlh2dTFsTG1XRzVDdHRCV3B6cUptRFZscE5oTE9WNFZJNHUyc0t6Z3BiMnZvS0pQWENoaGdBallWRTVsY2hzaWg0SkF3aHRCNHBSNFdyRmhQTUJMRlNvT2w3aXRMYlVLNG0weW1VQS1PRkRnOUQxZzR6UFR5dFRDbkdMUloxLXQxaDZFemcwalBQcDJiNTdvVlRqLWhSRlhwWE1xNTJCT2FiM2s?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/wnba/story/_/id/47077823/wnba-mock-draft-2026-lottery-dallas-wings-no-1-pick-awa-fam-betts-miles-latson-johnson-fudd",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.947,
      "consensus": 0.591,
      "constructiveness": 0.5,
      "proximity": 0.75
    },
    "score": 0.719,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Dallas Wings won the 2026 WNBA Draft Lottery for the second year in a row, securing the No. 1 overall pick. Azzi Fudd is now projected as the top selection, while Lauren Betts is also a leading prospect. The Wings will have the first choice in the draft, giving them the opportunity to select from the top college players.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story provides basic awareness about the Dallas Wings winning the 2026 WNBA Draft Lottery. However, it does not provide a deeper understanding or actionable insights about the implications of this event.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "US to End Temporary Protected Status for 10,000 Myanmar Nationals",
    "domain": "general",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Mon, 24 Nov 2025 19:18:21 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "The Guardian"
    ],
    "domains": [
      "aljazeera.com",
      "theguardian.com"
    ],
    "snippets": [
      "Myanmar faces an ongoing civil war that has caused widespread displacement, leading the US to warn against travel there.",
      "Homeland security claims country being ruled by military dictatorship ‘no longer continues to meet conditions’ for Temporary Protected Status US politics live – latest updates The Trump administration announced it will cancel temporary asylum for about 10,000 Myanmar nationals living in the US, desp"
    ],
    "image_url": "",
    "titles": [
      "Trump administration ends temporary immigration status for Myanmar citizens",
      "Trump administration cancels temporary asylum for Myanmar nationals living in US"
    ],
    "url": "https://www.aljazeera.com/news/2025/11/24/trump-administration-ends-temporary-immigration-status-for-myanmar-citizens?traffic_source=rss",
    "alternate_urls": [
      "https://www.theguardian.com/us-news/2025/nov/24/trump-cancels-asylum-myanmar"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2025/11/24/trump-administration-ends-temporary-immigration-status-for-myanmar-citizens?traffic_source=rss",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.981,
      "consensus": 0.591,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.711,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The US government has announced it will end Temporary Protected Status (TPS) for about 10,000 Myanmar nationals living in the US, citing that Myanmar no longer meets the conditions for the program. This comes as Myanmar faces an ongoing civil war and military rule, which has caused widespread displacement. The US has also issued travel warnings for Myanmar due to the conflict.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about a policy change that will affect many individuals, and it also provides some context about the situation in Myanmar. However, it doesn't provide a deep understanding of the implications or potential solutions for those affected.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Alabama Leads Playoff Projections as College Football Enters Final Week",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Mon, 24 Nov 2025 14:45:31 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sports Illustrated"
    ],
    "domains": [
      "espn.com",
      "news.google.com"
    ],
    "snippets": [
      "We assess how the committee could stack the top teams in the country.",
      "College Football Playoff and Bowl Projections After Week 13: Alabama Holds Power Sports Illustrated",
      "‘College GameDay’ Announces Destination for Week 14 Sports Illustrated",
      "Forde: College Football Playoff Projected Bracket After Week 13 Sports Illustrated"
    ],
    "image_url": "",
    "titles": [
      "Projecting the College Football Playoff top 12 after Week 13",
      "College Football Playoff and Bowl Projections After Week 13: Alabama Holds Power - Sports Illustrated",
      "‘College GameDay’ Announces Destination for Week 14 - Sports Illustrated",
      "Forde: College Football Playoff Projected Bracket After Week 13 - Sports Illustrated"
    ],
    "url": "https://www.espn.com/college-football/story/_/id/47060756/projecting-college-football-playoff-top-12-week-13",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMitgFBVV95cUxNNFkxeHpZYm1JaVhBeDJCMkg1ZzR3UXBESmFoS3U0YVNGZ1BDa3dIT3A5UnktWXAzOHdKWkVLaUtIM1VnUVdsT0owUFVOVFRyRlBRRDlBMmZQZ21uODFIVEg0b1NsOGhuUVJscVhtYjNmMzFIaWdvcDlvZmtKdTFXakQzQ0RVaDFkd0s1a1NjendJOUg2aWNsYllUQWhKUVRMYnRKVU5Cc053VGEzOHZmRGJGSFVnQQ?oc=5",
      "https://news.google.com/rss/articles/CBMijgFBVV95cUxOQU8tZnN2aXJURTNsaDlac2h6TWZDeUYxbHp1YVU1S0xqWXRWMWUxVjN3cFVOazdLLXFpUWpPRXUxcDRGZ0FyQy13aGRWbEpwcFdXWUtXeWd1NE9kRHI1ZGtkTkFmYWFFZU0wejk3UVNKM3YwY1J1V21rNkNLc2I5a2hja3BKRkRVYzg2SE13?oc=5",
      "https://news.google.com/rss/articles/CBMiiAFBVV95cUxOTDh3RTlnUzRXQ0VEYVh5ZThWbFl0U0hDN1VUSkYzOXkyS180YjJ0NWV3RWlFc3o3WmJHZzI1bzhDU0FrX2VqMk10ZFk5T19ialBhVkNtY2toMFd3WjNiRUNybmF6S0VNY3BQb3otczRoM29iZGVXTV8yRF9YRnljaHlwR1E5dk93?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/college-football/story/_/id/47060756/projecting-college-football-playoff-top-12-week-13",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.991,
      "consensus": 0.591,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.708,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "After Week 13 of the college football season, Alabama remains a leading team in playoff projections. The College Football Playoff committee is set to evaluate top teams for postseason rankings. Additionally, ESPN's \"College GameDay\" has announced its Week 14 broadcast location, highlighting key matchups as the regular season concludes.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers basic awareness about the current state of college football rankings and upcoming games. However, it doesn't provide deeper insights or understanding, nor does it report on solutions, improvements, or innovations.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Brazil’s Supreme Court Votes to Keep Bolsonaro in Custody Over Ankle Monitor",
    "domain": "general",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Mon, 24 Nov 2025 17:08:32 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Reuters"
    ],
    "domains": [
      "aljazeera.com",
      "news.google.com"
    ],
    "snippets": [
      "Four justices voted to keep the former right-wing president in police custody after his ankle monitor was damaged.",
      "Brazil top court votes to keep Bolsonaro in police custody Reuters"
    ],
    "image_url": "",
    "titles": [
      "Brazil’s Supreme Court panel votes to keep Bolsonaro in police custody",
      "Brazil top court votes to keep Bolsonaro in police custody - Reuters"
    ],
    "url": "https://www.aljazeera.com/news/2025/11/24/brazils-supreme-court-panel-votes-to-keep-bolsonaro-in-police-custody?traffic_source=rss",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMitgFBVV95cUxQeF85VmN1TmJiclZMMVJ4NGlrbEZzY3ZaNWs5OXZKSGZPT0pjSFdzdWxDWm10YU9hamRCLTljU3M5RTVYWWRMUzlWNC10MDdaNzVUNHRvVk56MExFQ0QwTnhqUUFHUmRGcGc2RU1fWm1hWWY3ZXhPS0RNajA1S05IX1Q3aWZqeUNDSkRrRy1uajcyLVYyU3p4M0xNaWlwMHZfZW82dkVvdXZNVklLZ3Ric09wWldfdw?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2025/11/24/brazils-supreme-court-panel-votes-to-keep-bolsonaro-in-police-custody?traffic_source=rss",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.938,
      "consensus": 0.591,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.703,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Brazil’s Supreme Court has voted 4-0 to keep former President Jair Bolsonaro in police custody after his court-ordered ankle monitor was found damaged. The decision follows concerns over compliance with monitoring conditions. Bolsonaro remains detained as the investigation continues.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs readers about a significant event in Brazil's political landscape, which could be useful for those interested in global politics. However, it doesn't provide much depth or insight into the broader implications of this event.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Vikings QB J.J. McCarthy's Status Uncertain After Head Injury vs. Packers",
    "domain": "sports",
    "source_domain": "cbssports.com",
    "location": "national",
    "published": "Mon, 24 Nov 2025 19:16:26 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Yahoo Sports"
    ],
    "domains": [
      "cbssports.com",
      "sports.yahoo.com"
    ],
    "snippets": [
      "McCarthy's status moving forward is in question after he suffered an apparent head injury against the Packers",
      "The ailing Vikings probably regret letting Sam Darnold walk out the door"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/11/24/861802c7-2e7a-4df8-b744-327f6c30bac6/adobe-express-file-99.jpg",
    "titles": [
      "J.J. McCarthy in concussion protocol: Minnesota Vikings quarterback could miss Week 13 game against Seahawks",
      "Vikings quarterback situation uncertain for Week 13 vs Seahawks"
    ],
    "url": "https://www.cbssports.com/nfl/news/jj-mccarthy-concussion-minnesota-vikings-qb-week-13-status/",
    "alternate_urls": [
      "https://sports.yahoo.com/articles/vikings-quarterback-situation-uncertain-week-194011214.html"
    ],
    "location_scope": "national",
    "link": "https://www.cbssports.com/nfl/news/jj-mccarthy-concussion-minnesota-vikings-qb-week-13-status/",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.981,
      "consensus": 0.591,
      "constructiveness": 0.4,
      "proximity": 0.5
    },
    "score": 0.698,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Vikings quarterback J.J. McCarthy's status is uncertain after he sustained a head injury during the game against the Packers. With McCarthy sidelined, the team's quarterback situation is further complicated by the earlier departure of Sam Darnold. The Vikings have not yet provided an update on McCarthy's condition or their plans moving forward.",
    "constructiveness_score": 0.4,
    "constructiveness_reason": "This story provides basic awareness of an event that occurred during a sports game, but it does not offer any deeper understanding or actionable insights. It does not report on solutions, improvements, or attempts to solve a problem.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Buccaneers' Baker Mayfield to Undergo MRI After Shoulder Injury vs. Rams",
    "domain": "sports",
    "source_domain": "cbssports.com",
    "location": "national",
    "published": "Mon, 24 Nov 2025 18:24:15 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sportsnet"
    ],
    "domains": [
      "cbssports.com",
      "sportsnet.ca"
    ],
    "snippets": [
      "Mayfield left Sunday night's loss in the second quarter and did not return",
      "INGLEWOOD, Calif. — Everything that could go wrong for the Tampa Bay Buccaneers did in the first half of their 34-7 loss to the Los Angeles Rams on Sunday night, including an injury to quarterback Baker Mayfield. Mayfield did not play in the second half after spraining his left shoulder and will undergo an MRI on Monday, coach Todd Bowles said. Mayfield was replaced by backup Teddy Bridgewater on the first possession of the third quarter with the Buccaneers trailing 31-7. “Well, Teddy will play if he’s out for some time,” Bowles said. “Very confident in what Teddy can do with a full week of..."
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/11/24/f7675b7d-bc78-4e34-9932-da8d234ee770/mayfield.png",
    "titles": [
      "Buccaneers' playoff hopes rest on Baker Mayfield's ailing shoulder after injury against Rams",
      "Buccaneers QB Baker Mayfield suffers sprained left shoulder in loss to Rams"
    ],
    "url": "https://www.cbssports.com/nfl/news/baker-mayfield-injury-updates-buccaneers-qb-mri-shoulder/",
    "alternate_urls": [],
    "location_scope": "national",
    "link": "https://www.cbssports.com/nfl/news/baker-mayfield-injury-updates-buccaneers-qb-mri-shoulder/",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.963,
      "consensus": 0.591,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.698,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Tampa Bay Buccaneers quarterback Baker Mayfield sprained his non-throwing (left) shoulder during a 34-7 loss to the Los Angeles Rams and did not play in the second half. He will undergo an MRI on Monday to assess the injury. Backup quarterback Teddy Bridgewater replaced Mayfield in the third quarter. The Buccaneers' current status regarding Mayfield’s availability will depend on MRI results.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story offers basic awareness about Baker Mayfield's injury and the potential implications for the Buccaneers. However, it lacks depth and doesn't provide much insight beyond the immediate situation.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "White House Bars AP After Refusal to Use \"Gulf of America\" Terminology",
    "domain": "general",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Mon, 24 Nov 2025 17:56:40 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Reuters"
    ],
    "domains": [
      "aljazeera.com",
      "news.google.com"
    ],
    "snippets": [
      "White House barred AP when it declined to refer to the 'Gulf of Mexico' as the 'Gulf of America' after Trump renamed it.",
      "Justice Department defends Trump ban on Associated Press Oval Office access Reuters"
    ],
    "image_url": "",
    "titles": [
      "Associated Press, Trump argue Oval Office access in federal appeals court",
      "Justice Department defends Trump ban on Associated Press Oval Office access - Reuters"
    ],
    "url": "https://www.aljazeera.com/economy/2025/11/24/associated-press-trump-argue-oval-office-access-in-federal-appeals-court?traffic_source=rss",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiqgFBVV95cUxPVGhSQmNWTm5xeV8tOGp3Z2tCcGpGeTNoV2tlVk1ZcmxFTWhiaXB1MHU0b19ncUtEV09xUzBwZDlwMGtEaHRFN2hWclZMTHhLMzV6eENhaFRObHQxc1FTOHhVWDBYNFlXeExOZUNhelN1ZTFoQVhDVU14NkI3dVBWWDYxRlVJWVMzb1I0MzBVaWx3RkRWWGEyVmpVdmhMcGQ3N0VHMk9EMkRCdw?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/economy/2025/11/24/associated-press-trump-argue-oval-office-access-in-federal-appeals-court?traffic_source=rss",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.954,
      "consensus": 0.591,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.696,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The White House barred the Associated Press from Oval Office access after the news agency refused to use the term \"Gulf of America\" instead of \"Gulf of Mexico,\" following a renaming directive by President Trump. The Justice Department has defended the ban, stating it was within the administration's rights. The Associated Press has not changed its terminology.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story offers basic awareness of a conflict between the White House and the Associated Press, but it doesn't delve into the implications of this conflict or provide insights into the broader context of media-government relations.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Poland Summons Israeli Ambassador Over Yad Vashem Social Media Post",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Mon, 24 Nov 2025 16:11:22 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "Al Arabiya"
    ],
    "domains": [
      "news.google.com"
    ],
    "snippets": [
      "Poland summons Israeli ambassador over Yad Vashem post Reuters",
      "Poland summons Israeli ambassador over Yad Vashem post, minister says Al Arabiya English"
    ],
    "image_url": "",
    "titles": [
      "Poland summons Israeli ambassador over Yad Vashem post - Reuters",
      "Poland summons Israeli ambassador over Yad Vashem post, minister says - Al Arabiya English"
    ],
    "url": "https://news.google.com/rss/articles/CBMivwFBVV95cUxNZ2lqb01YcDg4UVdqZWhYOUgwR0ZvM2JoV09tMW1URnJwbFRqSGhUeWJfaHFtWFpSVE92ZTQ4SW5YRkNxUTM2eE5YZGpYTUNQdU5jYjBvX1BoUFZvQV9YUnRuV0JGWTNDUzd3em82RzhJWkJXTTNFS3pldzFHTlJYZjRhZ25PZXlaVUE4aENoV0ROcDJjaUpCM2EtZV9tOG5VeldNTS1kb2lxSFRnYmJVOFp5dGduZEltWnFacWhJYw?oc=5",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMivAFBVV95cUxPNDN3TzVTYWJySV9JSEJUQmNyYkIyUEc1NG1ZVzR4d0NmaWtFOXhsSU1sRlI4MFlla2xpQ0otYWpZT1RWbTRadFktTmN3X2V3cDlVQWRlYldpbVQ3Z3VDWC1jY2ZTT0R3VVNFVEk4RUpJV3UxQTBCdUU3RF8xQjA0YjNEclNoeWRMR05MRTZBOW1lZ093REoxa1lvaTZRb21KOHRvekUwaTFpMF9JdWtVS2oyUVV2LUhrMXJpQdIBwgFBVV95cUxQckNDZ2tSakt1ZXN4ZFVtZU13SU1KRS1FdFNCeVhHVlhNNHA1Q3hlQVY3Vm8tZi10dWptenJtVkQ0dF9ISWhiRDBwV2JRRjQ2WlJpWm9WdGJXdVVlckwtWFFjd2Vya1htZmNIU1Y3ajdrMFJsRXE3V2pzdmI4ejB0VHR2elN4cmFEWWFvNFpEMzJ5eGZWRFVsODBlbnFldDBYWG9fbkF1N1BjQzZrOGpLSTl2ZXpZcFZ1SlJ3OTlGd0RpUQ?oc=5"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMivwFBVV95cUxNZ2lqb01YcDg4UVdqZWhYOUgwR0ZvM2JoV09tMW1URnJwbFRqSGhUeWJfaHFtWFpSVE92ZTQ4SW5YRkNxUTM2eE5YZGpYTUNQdU5jYjBvX1BoUFZvQV9YUnRuV0JGWTNDUzd3em82RzhJWkJXTTNFS3pldzFHTlJYZjRhZ25PZXlaVUE4aENoV0ROcDJjaUpCM2EtZV9tOG5VeldNTS1kb2lxSFRnYmJVOFp5dGduZEltWnFacWhJYw?oc=5",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.92,
      "consensus": 0.571,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.691,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Poland has summoned the Israeli ambassador in response to a social media post by Israel's Yad Vashem Holocaust memorial. The post reportedly criticized recent remarks by a Polish official. The Polish foreign ministry called the ambassador for clarification. The incident has added to existing tensions between the two countries over historical issues.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about the ongoing diplomatic tensions between Poland and Israel over historical issues, with the recent social media post controversy serving as the latest development. However, it doesn't provide deeper insights or understanding into the root causes of these tensions, or potential solutions to address them.",
    "constructiveness_source": "gpt",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "RBC Denies Gender Bias Allegations Amid Ongoing Lawsuit by Former Employee",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Mon, 24 Nov 2025 18:02:23 GMT",
    "source": "Bloomberg",
    "sources": [
      "Bloomberg",
      "Financial Post"
    ],
    "domains": [
      "news.google.com",
      "financialpost.com"
    ],
    "snippets": [
      "RBC Denies Claims of ‘Boys Club’ Culture, Bias Against Women Bloomberg.com",
      "Caruso-Jones’ suit said two other female managing directors had complained about the “boys’ club” environment"
    ],
    "image_url": "",
    "titles": [
      "RBC Denies Claims of ‘Boys Club’ Culture, Bias Against Women - Bloomberg.com",
      "RBC denies claims of ‘boys club’ culture, bias against women"
    ],
    "url": "https://news.google.com/rss/articles/CBMirAFBVV95cUxQeld1VTl4V1VrWXNtM0p5cU5XVnlZWURzQUxDQTI4VWtiSzBWUWNBaDBKZmJxSkFmdng2XzhUTHpOdVRGd0pOMUJkN3dKNnhmMnFvWVZwS04tbzh0Z0lzd1VhTVRWY3k5Z0w5dzRWN3BuMlJsOER3eFJBRjltRWwyRkg1Y1NNaWpZdE5sM3Rjdk9QZDFhbUJxTTl4dHJfaV9CNTRZRk10SHNjNENm?oc=5",
    "alternate_urls": [
      "https://financialpost.com/news/rbc-denies-claims-of-boys-club-culture-bias-against-women"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMirAFBVV95cUxQeld1VTl4V1VrWXNtM0p5cU5XVnlZWURzQUxDQTI4VWtiSzBWUWNBaDBKZmJxSkFmdng2XzhUTHpOdVRGd0pOMUJkN3dKNnhmMnFvWVZwS04tbzh0Z0lzd1VhTVRWY3k5Z0w5dzRWN3BuMlJsOER3eFJBRjltRWwyRkg1Y1NNaWpZdE5sM3Rjdk9QZDFhbUJxTTl4dHJfaV9CNTRZRk10SHNjNENm?oc=5",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.956,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.653,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "RBC has denied allegations of a \"boys' club\" culture and gender bias following a lawsuit by former employee Caruso-Jones. The suit claims that two other female managing directors also raised concerns about the workplace environment. RBC stated it is committed to diversity and inclusion. The case is ongoing.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "negative_penalty=0.08 (keywords: lawsuit); semantic: pos_sim=0.00, neg_sim=0.00",
    "constructiveness_source": "heuristic",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "JAXA Astronaut Captures Southern Europe’s City Lights from Space Station",
    "domain": "environment",
    "source_domain": "nasa.gov",
    "location": "global",
    "published": "Mon, 24 Nov 2025 17:13 GMT",
    "source": "NASA EO",
    "sources": [
      "NASA EO",
      "NASA"
    ],
    "domains": [
      "nasa.gov"
    ],
    "snippets": [
      "The atmospheric glow blankets southern Europe and the northwestern Mediterranean coast, outlined by city lights. At left, the Po Valley urban corridor in Italy shines with the metropolitan areas of Milan and Turin and their surrounding suburbs.",
      "JAXA (Japan Aerospace Exploration Agency) astronaut Kimiya Yui captured this photo of southern Europe and the northwestern Mediterranean coast from the International Space Station as it orbited 261 miles above Earth on Aug. 30, 2025. At left, the Po Valley urban corridor in Italy shines with the met"
    ],
    "image_url": "https://www.nasa.gov/wp-content/uploads/2025/11/54811765168-6fe43916d5-o.jpg",
    "titles": [
      "City Lights and Atmospheric Glow"
    ],
    "url": "https://www.nasa.gov/image-detail/gmt242_23_56_for-jaxa_kimiya-yui_timelaps-europe/",
    "alternate_urls": [
      "https://www.nasa.gov/image-article/city-lights-and-atmospheric-glow/"
    ],
    "location_scope": "global",
    "link": "https://www.nasa.gov/image-detail/gmt242_23_56_for-jaxa_kimiya-yui_timelaps-europe/",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.94,
      "consensus": 0.571,
      "constructiveness": 0.005,
      "proximity": 0.5
    },
    "score": 0.638,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "JAXA astronaut Kimiya Yui photographed southern Europe and the northwestern Mediterranean coast from the International Space Station on August 30, 2025. The image, taken from 261 miles above Earth, shows city lights outlining the region, with the Po Valley urban corridor in Italy—featuring Milan and Turin—clearly visible. The photo highlights the extent of urbanization in this part of Europe.",
    "constructiveness_score": 0.005,
    "constructiveness_reason": "semantic: pos_sim=0.08, neg_sim=0.05; semantic_boost=0.01",
    "constructiveness_source": "heuristic",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Early Black Friday 2025 Deals Launch, Featuring Discounts on AirPods Pro 3",
    "domain": "technology",
    "source_domain": "theverge.com",
    "location": "global",
    "published": "2025-11-24T14:45:23-05:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "theverge.com"
    ],
    "snippets": [
      "Black Friday is the most anticipated day of the year for bargain hunters. Although we still have a few days to go before November 28th, we’ve already found a healthy selection of early discounts, allowing you to get a jump on your holiday shopping. Right now, for instance, the new AirPods Pro 3 are",
      "If you’re thinking of ways to spend time with (or avoid) your family during Thanksgiving or Christmas, you can currently sign up for a year of HBO Max with ads for $2.99 a month ($8 off). The ongoing Black Friday promo is available to both new and returning subscribers, runs until December 1st, and"
    ],
    "image_url": "",
    "titles": [
      "The absolute best Black Friday deals we’ve found (so far)",
      "HBO Max is offering one of the best Black Friday deals we’ve seen this year"
    ],
    "url": "https://www.theverge.com/tech/814345/black-friday-best-early-deals-2025",
    "alternate_urls": [
      "https://www.theverge.com/gadgets/827608/hbo-max-black-friday-deal-streaming-sale-2025"
    ],
    "location_scope": "global",
    "link": "https://www.theverge.com/tech/814345/black-friday-best-early-deals-2025",
    "score_components": {
      "magnitude": 0.393,
      "recency": 0.991,
      "consensus": 0.35,
      "constructiveness": 0.019,
      "proximity": 0.5
    },
    "score": 0.475,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Early Black Friday 2025 deals are already available across categories like skincare, hair care, makeup, and electronics. Notable discounts include offers on popular products such as the new AirPods Pro 3. Shoppers can access these early sales ahead of the official Black Friday date on November 28, allowing for advanced holiday shopping and savings.",
    "constructiveness_score": 0.019,
    "constructiveness_reason": "semantic: pos_sim=0.14, neg_sim=0.06; semantic_boost=0.02",
    "constructiveness_source": "heuristic",
    "is_trending": false,
    "trending_score": 0.25
  }
]