[
  {
    "title": "Trump Orders Airstrikes on Iranian Nuclear Sites; Ceasefire Questioned",
    "domain": "general",
    "location": "national",
    "published": "Wed, 25 Jun 2025 10:21:37 -0400",
    "source": "NPR",
    "sources": [
      "Axios",
      "BBC",
      "Forbes",
      "New York Times",
      "Bloomberg",
      "Deutsche Welle",
      "The Guardian",
      "Financial Times",
      "LA Times",
      "CBC News",
      "ESPN",
      "ABC News",
      "NPR",
      "Fortune",
      "Al Jazeera",
      "Washington Post",
      "CityNews",
      "CNBC"
    ],
    "domains": [
      "sports",
      "general",
      "business"
    ],
    "snippets": [
      "Israeli Prime Minister Benjamin Netanyahu wanted to attack Iran for decades, but the U.S. and his own security chiefs deterred him. Now he's basking in the moment.",
      "President Trump had been eager to celebrate the U.S. strikes on Iran, but a new report indicates the attack set back Iran’s nuclear program by only a few months.",
      "Trump has long questioned the value of U.S. membership in NATO, an alliance he’s cast as a drain on American resources.",
      "Trump ordered U.S. strikes on Iranian nuclear sites as part of its support for Israel, then days later announced a ceasefire agreement between the countries.",
      "WASHINGTON (AP) — President Donald Trump insisted Wednesday that U.S. strikes delivered a crushing blow to Iran’s nuclear program despite a preliminary American intelligence assessment suggesting that the assault inflicted only a marginal setback. “This was a devastating attack, and it knocked them ",
      "Despite President Trump’s dismay over Israel’s continued bombing, Israelis say American intervention has put bilateral relations back on track.",
      "Lawmakers will be looking for answers and evidence from the administration.",
      "<a href=\"https://news.google.com/rss/articles/CBMie0FVX3lxTE9kZ3NhQXdJLVRvWGtLNmZzYkRqTElpY1MwbDZrdkxMeTNfV1pVUUZneXhXcHBNOGRTNFYtSjRLTEJmNEVjWWtSdDJCeWllYW1vNmtyZ3VhZkZpajJEYnhaWGF6b0o4dEw0dE1XUmtJQ1djUDEzVlRrU0N1Zw?oc=5\" target=\"_blank\">Trump claims U.S. and Iran will hold meeting next week</a>&nb",
      "The president suggested U.S. strikes helped stop the Israel-Iran war, as he drew parallels with the bombing of Hiroshima and Nagasaki in World War II.",
      "“This was a devastating attack, and it knocked them for a loop,” Trump said, claiming Iran’s nuclear program was “completely and fully obliterated.”",
      "<a href=\"https://news.google.com/rss/articles/CBMiiAFBVV95cUxOMEtwa0NEa0FhMjRZR3gzaThZWHNpdlBqRTMxNGc1akVWNktab2lEdjl2ODNUOXd2TkhmbFBnY2NYZkM5NjZiMHNJSkpXcjBiOFVBOWlrdzZldmh2SWxlWGVtV0tDSGhCUDhQclVLc1l3TU81RU43UzMtbjF0eXpMeUUzR0FqOUtj?oc=5\" target=\"_blank\">Trump Says US to Meet Iran Next Week, Putin",
      "US President Donald Trump said attacking Iran caused \"great progress\" in negotiations regarding Gaza, and insisted Tehran \"won't be building nuclear weapons for a long time.\" DW has more.",
      "The truce went into effect after pressure from President Trump and Qatar. Israel said its forces were now shifting their attention back to Gaza.",
      "In public, Qatar was insisting on the right to defend itself after Iran attacked a U.S. military site in the emirate. Behind the scenes, it was already mediating a truce between Israel and Iran.",
      "The period after President Trump announced the cease-fire was muddied by time zone differences, unclear wording in statements and continuing strikes.",
      "President Trump said the truce was holding after lashing out at both countries for seemingly violating the agreement.",
      "Large flames illuminated the night sky as airstrikes pummeled the Iranian capital, residents said. Later on Tuesday morning, state television said a cease-fire had been agreed to with Israel.",
      "The Iranian government has raised the prospect that inspectors from the International Atomic Energy Agency may be ejected from the country.",
      "Formula 1 heads into round 11 in Spielberg as McLaren's Oscar Piastri remains championship leader - will the Austrian Grand Prix provide any upsets?",
      "Iran official says the US &#039;torpedoed diplomacy&#039; as Tehran moves to suspend IAEA ties following war with Israel.",
      "<p>Move makes it harder to verify degree of damage inflicted on Iran’s three key  nuclear sites by joint US and Israeli bombing</p><p>Iran’s parliament has unanimously agreed to suspend all cooperation with the UN nuclear inspectorate the IAEA, making it harder for an independent expert assessment t",
      "The truce promised to bring an end to a 12-day conflict that saw the U.S. strike Iranian nuclear facilities, and ballistic missiles fired at Israeli cities.",
      "Iranian and Israeli officials said they would respect the terms of the ceasefire if the other side did too.",
      "Indications from an early intelligence assessment on the impact of the strikes began to emerge.",
      "Secretary of State Marco Rubio said U.S. strikes had destroyed a facility that is key to producing a nuclear weapon. He railed against a less optimistic U.S. intelligence report.",
      "<p>President calls intelligence ‘inconclusive’, while defence secretary describes harm to facilities as ‘moderate to severe’</p><p>Donald Trump and the US defence secretary, Pete Hegseth, have admitted to some doubt over the scale of the damage inflicted on Iran’s nuclear sites by <a href=\"https://w",
      "Core components of Iran’s nuclear effort were damaged but not destroyed by U.S. airstrikes on three key facilities, say people familiar with a Defense Intelligence Agency initial assessment.",
      "<img alt=\"A security guard stands on a street in the Iranian capital of Tehran.\" height=\"349\" src=\"https://i.cbc.ca/1.7569891.1750801957!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_620/security-guard-standing-on-a-street-in-tehran-iran.JPG\" title=\"A security guard stands on a street, during ",
      "The assertion comes as questions swirl about how effective the U.S. and Israeli strikes were.",
      "<a href=\"https://news.google.com/rss/articles/CBMihwFBVV95cUxQUnA5Ty1ldk1xVmhUdFk3Nk9pcDNjUnU5TFp2aHBsWXNmY0FMUnR2Q1dYNGRNV241UHowandwckZWSHgtaVlGRGREQTY1UTVMMUZoRlN0TnVaUnZDUzEwZzB6OTBTMHE2YkR0cG1GSlNKM2JXZVRpbzNETGVhRXR6TWwyVjdtYmc?oc=5\" target=\"_blank\">Israeli officials see \"significant\" damage t",
      "<img alt=\"A balding man with a beard and mustache wearing glasses and a suit \" height=\"349\" src=\"https://i.cbc.ca/1.7570166.1750838517!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_620/iran-nuclear-parliament-iaea.JPG\" title=\"FILE PHOTO: Iranian Parliament Speaker Mohammad Baqer Qalibaf looks ",
      "US President Trump doubles down on his assertion that Iranian nuclear programme has been set back by decades.",
      "Fordo is probably the most spied-on place on the planet - and work to understand what is happening there is set to intensify further.",
      "An early assessment by the Defense Intelligence Agency believes the damage to Iran's most important nuclear site was limited. And, Trump will meet with NATO allies today to discuss a spending increase.",
      "The latest imagery shows further damage following Israel's follow-up strikes on key facilities.",
      "A leaked intelligence report has cast doubt on Trump and Netanyahu’s claims about destroying Iran&#039;s nuclear programme.",
      "Trump’s message to Israel and Iran on the way to the Nato summit.",
      "<p>From a frustrated Australian prime minister to ‘the most unparliamentary of language’ in Irish politics</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/jun/25/australia-news-live-richard-marles-nato-israel-iran-trump-anthony-albanese-lattouf-abc-labor-coalition-ntwnfb\"",
      "The US president's erratic trade policy is unnerving investors in the US, while at the same time opening up opportunities for European businesses to capture their attention. Will they seize the moment?",
      "<a href=\"https://news.google.com/rss/articles/CBMid0FVX3lxTE1GYVFEQXpXY0pvaUc0LU1MbV9hVXpTaGdkY1JqclZVejRGYl9oVUR3ck9KdE14UDBhRlJ0X2E2Vm1jYlVyZjNuNFc1VVB5anhaSXhMbEIycENhS0Z6bEZkM3psOExEUFNCcXdUX0g0UmRnYXo5MnFV?oc=5\" target=\"_blank\">Iran-Israel ceasefire reignites MAGA push for a Trump Nobel Peace P",
      "US leader Trump scolded Israel for continuing to strike Iran after he declared a ceasefire. Can the fragile truce hold?",
      "Medical sources say at least 14 Palestinians have been killed by Israeli forces near aid distribution centres in Gaza.",
      "President Trump announced the talks as the cease-fire between Israel and Iran entered a second day. It was unclear what format the discussions would take, or if they would lead to limits on Iran’s nuclear program.",
      "<p>Pakistani government had credited US president with ‘pivotal leadership’ in its ceasefire negotiations with India</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/jun/25/israel-iran-war-live-iranian-nuclear-program-could-restart-in-months-pentagon-finds-as-fragile-ceasefire-hold",
      "President dismissed intelligence leak suggesting impact of American strikes on key facilities was limited",
      "Will America’s pre-emptive strike discourage other countries from pursuing a weapon — or just the opposite?",
      "The decision means that Britain’s air force will have a nuclear role for the first time since the end of the Cold War.",
      "The mayor of Greater Manchester calls on the government to act while the remaining survivors of the UK's 1950s nuclear tests are still alive.",
      "“Iran is willing to engage diplomatically, but what we’ve not seen is any good faith from the United States.”",
      "<p>Following U.S. strikes on three nuclear facilities in Iran, the chances of North Korea returning to the bargaining table have become even slimmer.</p>",
      "President Trump spoke at the conclusion of the summit in the Netherlands — as the world watches to see whether a ceasefire between Israel and Iran will endure.",
      "Credited with confronting Israel&#039;s greatest foe, PM Netanyahu finds ceasefire does little to solve his other challenges.",
      "Making sense of the &#039;12-day war&#039; between Israel and Iran"
    ],
    "image_url": "",
    "titles": [
      "Israel was once deterred from striking Iran. Now Netanyahu takes a victory lap",
      "Intel Report on Iran Upends Victory Lap Trump Was Hoping for at NATO",
      "Trump gets a NATO victory lap, but U.S. leadership is on shaky ground",
      "Trump downplays U.S. intelligence report on Iran strikes at NATO presser",
      "Trump defends US strikes on Iran as intel assessment stirs debate",
      "Trump’s strikes on Iran reinvigorate U.S.-Israel ties after being tested",
      "Some senators see initial Iran strike assessment, but won't share details",
      "Trump claims U.S. and Iran will hold meeting next week - Axios",
      "Trump Says U.S.-Iran Talks Will Resume Next Week (Live Updates)",
      "Trump defends U.S. ‘devastating attack’ on Iran days after an intelligence assessment called it only a mild setback",
      "Trump Says US to Meet Iran Next Week, Putin Talks Ahead - Bloomberg",
      "Trump says 'great progress' made on Gaza ceasefire talks",
      "Israel-Iran Cease-Fire Takes Hold After Trump Rebuke",
      "How Qatar Helped Broker the Israel-Iran Cease-Fire",
      "Timeline: Did Iran or Israel Violate the Cease-Fire With Strikes?",
      "What to Know About the Cease-Fire Between Israel and Iran",
      "Iran’s Capital Tehran Endures Intense Attacks Before Cease-Fire With Israel",
      "Tensions Grow Between Iran and the U.N. Nuclear Watchdog",
      "What to know ahead of the Austrian Grand Prix",
      "Iran passes bill to halt IAEA cooperation as fragile Israel ceasefire holds",
      "Iran’s parliament approves bill to suspend cooperation with IAEA",
      "Israel-Iran ceasefire holds as region urges new round of diplomacy",
      "Israel-Iran ceasefire appears to hold as Trump heads to NATO summit",
      "Israel-Iran live updates: Trump again claims 'obliteration' of Iran nuclear sites",
      "Rubio Fleshes Out Trump’s Case That Iran Nuclear Capacity Was Eliminated",
      "Trump and Hegseth admit doubts about level of damage to Iran nuclear sites",
      "U.S. initial damage report: Iran nuclear program set back by months, not obliterated",
      "U.S. airstrikes set back Iran's nuclear program by just months, report says",
      "The Israeli atomic energy commission says the war set back Iran’s nuclear program by ‘many years.’",
      "Israeli officials see \"significant\" damage to Iran's nuclear facilities - Axios",
      "Nuclear facilities 'badly damaged,' Iran's foreign ministry says",
      "US didn’t destroy Iran’s nuclear programme: Here’s what new intel says",
      "Damaged or destroyed - how much does leaked US report on Iran's nuclear sites tell us?",
      "Iran's nuclear program set back 'a few months.' And, Trump to meet with NATO allies",
      "Satellite images reveal new signs of damage at Iranian nuclear sites",
      "Did the US and Israel really obliterate Iran’s nuclear facilities?",
      "Expletives and Diplomacy: Donald Trump Heads to Nato",
      "Donald Trump is not the first politician to swear in public. Here are six more infamous expletives",
      "Is Donald Trump making Europe great again?",
      "Iran-Israel ceasefire reignites MAGA push for a Trump Nobel Peace Prize - Axios",
      "Will Trump’s Israel-Iran ceasefire really hold?",
      "Israeli attacks kill at least 64 as Trump signals progress in Gaza talks",
      "Live Updates: Trump Says U.S. Will Meet With Iran Next Week",
      "Pakistan debates Trump Nobel peace prize nomination after US strikes on Iran",
      "Trump says US will speak to Iran next week and ‘may’ sign a nuclear deal",
      "The Bombing of Iran May Teach an Unwelcome Lesson on Nuclear Weapons",
      "U.K. Says It’s Buying 12 Jets That Can Carry Nuclear Weapons",
      "Truth about UK nuclear veterans 'covered up', says Andy Burnham",
      "Trump is using “diplomacy as a ruse” to strike Iran",
      "Trump's attack on Iran pushed diplomacy with Kim Jong Un further out of reach",
      "Trump doubles down on damage U.S. strikes caused to Iran's nuclear sites",
      "Israel thinks Netanyahu is victorious against Iran – what will he do next?",
      "Israel (& the US) vs Iran – what just happened? | Start Here Q&A"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.93,
      "consensus": 1.0,
      "constructiveness": 0.6,
      "proximity": 0.75
    },
    "score": 0.921,
    "summary": "US President Donald Trump ordered airstrikes on Iranian nuclear sites, aiming to support Israel and deter Iran's nuclear program. Despite Trump's claims of a \"devastating attack\" that greatly set back Iran's nuclear capabilities, preliminary American intelligence assessments suggest the impact was marginal, causing only a few months' delay. Amidst continued Israeli bombing, Trump announced a ceasefire agreement between Israel and Iran, which went into effect after mediation by Qatar. However, the ceasefire's effectiveness was questioned due to ongoing strikes and unclear communication. Trump i",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful context about the geopolitical dynamics between the US, Israel, and Iran. It informs readers about the recent airstrikes and their impact, and introduces the concept of a questionable ceasefire. However, it lacks a deeper analysis of the causes, implications, or potential solutions to the conflict."
  },
  {
    "title": "NATO Leaders Commit to 5% GDP Defense Spending by 2035 at The Hague Summit",
    "domain": "general",
    "location": "global",
    "published": "Wed, 25 Jun 2025 17:04:26 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Axios",
      "Financial Times",
      "Deutsche Welle",
      "New York Times",
      "The Guardian",
      "CBC",
      "ABC News",
      "Al Jazeera",
      "CityNews",
      "CNBC"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "Nato leaders meeting in The Hague say they have an \"ironclad commitment to collective defence\".",
      "Canada and its NATO allies have agreed to substantially hike their defence spending target to five per cent of annual GDP by 2035, Prime Minister Mark Carney said Wednesday. Carney warned the country can no longer rely on its geography for protection as new weapons and threats emerge, and argued the",
      "<img alt=\"Prime Minister Mark Carney shown sitting at a long table with other NATO leaders. \" height=\"349\" src=\"https://i.cbc.ca/1.7570193.1750867529!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_620/carney-europe-20250625.JPG\" title=\"Prime Minister Mark Carney, middle, takes part in a meeting",
      "US President Donald Trump hailed the agreed spending hike as a \"monumental\" victory. NATO member states also expressed \"enduring\" support for Ukraine. DW has the latest.",
      "THE HAGUE, Netherlands (AP) — President Donald Trump met with Ukrainian leader Volodymyr Zelenskyy on the sidelines of the NATO summit Wednesday and suggested that increased spending by the trans-Atlantic alliance could help prevent future Russian aggression against its neighbors. NATO members agree",
      "<p>US president appears relaxed and reaffirms commitment to military alliance – though Spain criticised</p><p>A relaxed Donald Trump said Nato’s decision to increase defence spending to 5% of GDP was a “big win” for western civilisation in a digressive press conference at a summit in The Hague where",
      "<p>New defence spending target will be realised by 2035, Nato countries say</p><p>Asked about his commitment to Nato’s Article 5, Trump says:</p><p><em>We are with them all the way.</em></p> <a href=\"https://www.theguardian.com/world/live/2025/jun/25/nato-donald-trump-mark-rutte-europe-latest-live-n",
      "<p>This blog is now closed, you can read more on this story <a href=\"https://www.theguardian.com/world/2025/jun/25/trump-praises-nato-states-as-summit-prepares-to-lift-defence-spending-target\">here</a></p><p>Asked about his commitment to Nato’s Article 5, Trump says:</p><p><em>We are with them all t",
      "President had sparked alarm when he previously said US commitment to Article 5 ‘depends on your definition’",
      "Thirty-two allies ‘reaffirm our ironclad commitment to collective defence’ at summit in The Hague",
      "President Donald Trump's pressure comes as the bill still faces an uphill climb ahead of Republicans' self-imposed July 4 deadline.",
      "President Trump tells Senate Republicans to lock themselves in a room if necessary to work out differences and pass the megabill that will fund his second-term agenda.",
      "<a href=\"https://news.google.com/rss/articles/CBMifEFVX3lxTFBEZGV6ZnUydTQwNmpfN2kxbjJEVng0U3BISHRjNkg4MklfTk44SmllNVotTTNzSVB5VmhOVnZ0YmtMcHpsa1J5TjgwTjIyX2lYU1czcjUxcXExT2ZQQjA5bUw1X0RHeG1BMTgtVWw3bGQySDhGMGxkZElPUFA?oc=5\" target=\"_blank\">Trump assails Spain over NATO defense spending target</a>&nb",
      "President Trump has pressed allies to spend more on defense. Leaders agreed that “allies” — but not “all allies” — would meet the objective.",
      "At the NATO summit US President Trump claimed Iran’s nuclear sites were “obliterated,” contradicting a leaked",
      "In a political win for US President Donald Trump, NATO member states have endorsed a big new defence spending target.",
      "The bloc agrees to boost spending to 5% of GDP, but Spain, Belgium and Slovakia say they will struggle to meet target."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/6e84/live/719162a0-51b1-11f0-b52c-c776a241c026.jpg",
    "titles": [
      "Trump says Nato's new 5% defence spending pledge a 'big win'",
      "Carney says Canada will spend 5% of its GDP on defence by 2035",
      "Canada promises to spend 5% of GDP on defence by 2035 in pact with NATO leaders",
      "NATO summit: Allies agree to spend 5% of GDP on defense",
      "Trump meets with Zelenskyy and says higher NATO defense spending may deter future Russian aggression",
      "Trump hails ‘big win’ as Nato states agree to raise defence spending to 5% of GDP",
      "Nato leaders confirm defence spending will rise to 5% of GDP and say support for members is ‘ironclad’ – Europe live",
      "Nato leaders confirm defence spending will rise to 5% of GDP and say support for members is ‘ironclad’ – as it happened",
      "Trump with Nato ‘all the way’ after questioning mutual defence pact",
      "Nato members agree 5% defence spending target",
      "Trump to Congress: 'NO ONE GOES ON VACATION' until spending bill passes",
      "Trump says no vacations until Congress passes his megabill",
      "Trump assails Spain over NATO defense spending target - Axios",
      "NATO Agrees to Boost Military Spending as Trump Praises Allies, but Criticizes Spain",
      "Iran attacks overshadow NATO summit on new defence spending deal",
      "Why is NATO boosting defence spending and can Europe afford it?",
      "NATO commits to major defence spending hike sought by Trump"
    ],
    "score_components": {
      "magnitude": 0.82,
      "recency": 0.984,
      "consensus": 1.0,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.864,
    "summary": "At the NATO summit in The Hague, NATO leaders, including US President Donald Trump and Canadian Prime Minister Mark Carney, have committed to increasing their defense spending to five percent of GDP by 2035. This decision is described as a response to evolving threats and the necessity of reinforcing collective defense. Trump hailed the agreement as a significant victory and reaffirmed the US's commitment to NATO's Article 5, which mandates collective defense. The summit also expressed strong support for Ukraine amidst concerns over Russian aggression. However, some member states, such as Spai",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it provides information about the decisions made at the NATO summit, offering readers a deeper understanding of current geopolitical relationships. It also reports on an attempt to solve problems (increasing defense spending in response to evolving threats). However, it could have provided more insight into the implications of this decision and the potential impacts on member states."
  },
  {
    "title": "Shell and BP Discuss Potential £60bn Merger, Stocks React",
    "domain": "business",
    "location": "national",
    "published": "Wed, 25 Jun 2025 17:21:43 GMT",
    "source": "CNBC",
    "sources": [
      "Investopedia",
      "Financial Times",
      "The Guardian",
      "CNBC",
      "MarketWatch"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "It is unlikely Shell would purchase the entirety of BP, people familiar with the matter told CNBC's Brian Sullivan.",
      "Chief executive Wael Sawan has been focused on improving Shell’s financial performance and share buybacks",
      "<p>Reported megamerger between supermajors would create British oil company worth more than £200bn</p><p><a href=\"https://www.theguardian.com/business/royaldutchshell\">Shell</a> is in early talks with <a href=\"https://www.theguardian.com/business/bp\">BP</a> over a historic £60bn deal that could crea",
      "<figure><img alt=\"Artur Widak / NurPhoto via Getty Images A deal between Shell and BP would combine two massive UK oil companies.\" src=\"https://www.investopedia.com/thmb/qmayuFRfDT-C5St7CwhqlbL2Zf8=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2206612037-2657c710addd4b",
      "BP’s stock rallied on Wednesday, and shares of Shell fell, after the Wall Street Journal reported the two companies were holding merger talks."
    ],
    "image_url": "",
    "titles": [
      "BP shares rise on takeover speculation; Shell denies",
      "Shell denies takeover talks with UK rival BP",
      "Shell in early talks to buy rival BP to create oil giant – reports",
      "BP Stock Jumps After Report That It's in Merger Talks With Shell",
      "BP’s stock jumps on Wall Street Journal report of Shell deal talks. Here’s how the deal could work."
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.99,
      "consensus": 1.0,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.838,
    "summary": "Shell is in preliminary discussions with BP regarding a potential £60bn merger, which would unite two of the UK's largest oil companies, creating a firm worth over £200bn. Despite the speculation, sources close to the situation believe it's unlikely Shell will buy BP in its entirety. Shell's CEO, Wael Sawan, is currently concentrating on enhancing the company's financial health and continuing share buybacks. Following the news, BP's stock price increased, while Shell's shares experienced a decline.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about potential changes in the oil industry and the stock market's reaction. However, it doesn't report on solutions, improvements, or innovations, and it doesn't significantly deepen understanding of the industry's systems or trends."
  },
  {
    "title": "Indiana Fever Waives DeWanna Bonner After Extended Absence",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 25 Jun 2025 13:22:34 EST",
    "source": "ESPN",
    "sources": [
      "Yahoo Sports",
      "Sportsnet",
      "CBS Sports",
      "ESPN",
      "Sports Illustrated"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "The Indiana Fever have waived guard/forward DeWanna Bonner, one of their key free agent acquisitions in the offseason, after she had missed five games due to what was termed personal reasons.",
      "<p>The Indiana Fever are moving on from DeWanna Bonner.</p>",
      "<a href=\"https://news.google.com/rss/articles/CBMia0FVX3lxTE85UkRsbjNUM2Q5Y2I2WVJDLVhLWm5ld1o1aTFRUVdtc2N5ak1UenBoc3pWREtsRHo0SWdOZzZuZE5HR3o4bnFhWnF6UnhwWEZ2U1dvN25TLW80ZGZUWWI1d21nbmRXMzRWUzhN?oc=5\" target=\"_blank\">Indiana Fever Make Decision on DeWanna Bonner's Future With Team</a>&nbsp;&nbsp;<fo",
      "<a href=\"https://news.google.com/rss/articles/CBMikAFBVV95cUxOY0RqUG41dURscUc2Rl9EbXAtY3J4dWpIQnZ4WFhPaDNnSUJnZ0NqX0dmVC1vQjRGcnhob1JXVWR3TG5xR2pZSGdSN3NDRzJEZUxoSkYzT0hmazlqeXYxTnRBVW5DOEhCQnM0TFNmMUJJRGszenNIT3lZYnlIQmdaZlpPZUV4bEJ0Z2NHZzdkZmE?oc=5\" target=\"_blank\">Arsenal ‘Make Bid’ For Premier L",
      "<a href=\"https://news.google.com/rss/articles/CBMilwFBVV95cUxQTUZxQnhPTHhMTjJoQ1FfdjRSNmpacXhvUEYxOGtRQUxMQU9pZVprRmJnOElaT1JUaVFsZHpOaEVNb25JRWdxUVdXZHY0QU13Zk1Ra0o0MFhQY0pOUmpEUm9CY29STnFBbWVSeXNWbTI4YTFQN1M5VWF6Q1REWkMtbzNvY3BYb1o1RVczcC15Si05QkR3eEFJ?oc=5\" target=\"_blank\">Barcelona 2025–26 Pre-S",
      "<a href=\"https://news.google.com/rss/articles/CBMihwFBVV95cUxQd2FXeV9oY0dneF9Od1R6ZllkcVZYb1FRaC1JYTF6MlJIZk1zWFZod3NIQ1NYUTlUS0pjY0pxOG4ta2g4U0pQMVdteUVrZU5qWjFORzJNeEhZbFJXUW1QQmEtbEU0MDg4ZzgydEZaZ0JSa3gyV3BsZXNKUDVjbU1XdGdYaFJiQm8?oc=5\" target=\"_blank\">Celtics Trade Kristaps Porzingis to Hawks in",
      "<p>The Boston Celtics continued the teardown of their roster on Tuesday.</p>",
      "<p>Irving is set to decline his $43 million player option and intends to sign a three-year, $119 million contract with the Mavericks, ESPN&#8217;s Shams Charania reported Tuesday night. The deal includes a player option for the 2027-28 season.</p>",
      "<a href=\"https://news.google.com/rss/articles/CBMikAFBVV95cUxPMnF0bmZ2SkFNeFhnRTdwcVM2allzaW9YWklWNEhyejY4SmFyTXlOSFRuaFgwOWw0NVEyTmpfZG5HOEZDU21kRUJWcEUzTUZhWWw3bVk3WUdfWG9kTWhvUEgxZEw4RDFFQWo3VEd5Y1NqbHJ1NHc0ZVNYODN4UkNpMVBIZ0NPNHVKcFNPZGxmejg?oc=5\" target=\"_blank\">George Kittle Has Strange List o",
      "<a href=\"https://news.google.com/rss/articles/CBMif0FVX3lxTE1YUUNIX2poRnpUbmVBRHFmbUZDLUdibDJEZ3RvR1ZucTZzQTZFd1R3V0FxR1pHQWd5VTZxWFZRczJaeE85dHdDOURWWWF2bll5a1Vic1BJYzVFZ2tQbmZIOXVQWjhVZUNPbDJjSk9ReWtvdmhMRlIwY195M1IxSFU?oc=5\" target=\"_blank\">NBA Analyst Says Thunder Could Be Looking to Trade Up in",
      "<a href=\"https://news.google.com/rss/articles/CBMie0FVX3lxTFBhb1hkdjBMZlNQQTllUGtGRXRVQjB2VFFpXzdoVjNDMXpiUWt5VkUwV2xjeTRSQ0ozSFp4Q05VQzBDNnJkc2xMb1ZrVkcybEo3WWlFcXlJMVpnTDJ2STZWT0R5cEFnTXRnSHgwMG9SS2c1MDFMdUJCZDdsTQ?oc=5\" target=\"_blank\">NFL Players Who Could Have Played in the NBA</a>&nbsp;&nbsp;<",
      "<a href=\"https://news.google.com/rss/articles/CBMie0FVX3lxTFBwYXNXVnE0aW1sbkFjOXVSR3hHamI4Q0hPZngtWFE5ZVZVNHBXZjd0anpETTNyc1ZMYmViVGdIQWVENnpsOGpSRVE5bUtoY3BuNnNSNWZkYXYzOUN0WVQ3d1VUOERaQmozZVZYY1RNZnNVbWFZYms4TUdrOA?oc=5\" target=\"_blank\">NFL Mailbag: Teams Most Likely to Go Worst-to-First in 2025</",
      "<a href=\"https://news.google.com/rss/articles/CBMilwFBVV95cUxQVnhlX3d1aUxvMHJIRkxhdTBZVDJXbW9NQTFIOEFqSlNiOVVwb01tTll6V2V6T24zT09weDV4Zk5sMzkxdTFUNm9FNUxtYzl2QTB2RnMxZ0U1UDNud05hNnZHYjBDcmhZMnhKTndZTm5BRjZRZ0Nvb3Z1S0dlUXIxYXYwOWU3U0VUaHY0bXNseGt4WUhPWnkw?oc=5\" target=\"_blank\">Pacers Coach Rick Carli",
      "<a href=\"https://news.google.com/rss/articles/CBMie0FVX3lxTE1BbXp3RGlxTmw1QTlJaWZwSmg5VUdTMXM1UlRSRjZ1SkFXSmF0ZzJSQ0Z2SG42WlJrU1VjRzhiWTdjOUhqaG9zTWpfdXd1ZERqUV9qZlh1ajRjOER6MEVoSlR0Z1NBeWFSOV9hSlhQVG8tUi1SeUJQRkdoQQ?oc=5\" target=\"_blank\">‘Lot of Desire’—Luka Modric’s Next Move Confirmed by Club Chi",
      "<a href=\"https://news.google.com/rss/articles/CBMikgFBVV95cUxNdGFxaWRzYUxxWm5FTm9MNGVFbjBuVE1RLUVMUkQwTlpJdFJNYzBRU0F0bTFtVEU1QnZUOE5wZE5LNUhwLTJ4TGcwd3I5Q0xuWFI3cVdiT2hUcnlNR0hNYzZuZ3BKZlFXSll1Q0lsTlk4UjV6OGh5R0xWZm04cVZITFZiOHJ2VXYyR01qWVVuTHVqQQ?oc=5\" target=\"_blank\">Documents Reveal NFL Encourag",
      "<a href=\"https://news.google.com/rss/articles/CBMijAFBVV95cUxNMzFBNjZRMEFtZVVTTXJtS2ZlQUxrVXJBclFmVkNzcUxrMmY2S3dUT2Nkc0pzdXhEQ1F6eHVEYktudGk0WjRnUmt4QkRuSTNHMzFRcEFkYmUxTHNsSk96dDdDYklsZ1JwcEdiWHNzLTd2cWthSVVfblNVcjZ4bi1XM0x5RE1McHViOVU4Mw?oc=5\" target=\"_blank\">Braves' Austin Riley Named 'High-Pric",
      "<a href=\"https://news.google.com/rss/articles/CBMihgFBVV95cUxPX0ZIMlJXZl9KRkYyODh3VnhTcU1xc1Q0MHZOdldab1p1T1N3NDV2bE5PS1JRSF9jZ2VLT2J0OERZTWdra2dfSUMzY2ZPanhaWWRtakZCNDctMGJtUEtKM3F5dUNncF9FRnBpSFhWQUZTWndoeEdrdFF3UnFBdmExREw1eE55UQ?oc=5\" target=\"_blank\">Why LeBron James Believes Cooper Flagg Will B",
      "<a href=\"https://news.google.com/rss/articles/CBMikAFBVV95cUxNM3ZkczJxZDZsNHRPZ3dxVXlPdE1rZ3Y3eUpRUEdZZEMtTXZxX1NZLVg4U1ZZV2VBWGpEelhLWTlLdExMZkFGTU55ekpfaDVMS2lXbENQNjlRSWFCRV9teklKeG5RR0g3aDJsTW4tMnFaWE00WDhMSXNKQmVnZXZ0UWZubnRYdjJwbXRIOVJvQmo?oc=5\" target=\"_blank\">Taylor Swift Attends Tight End U",
      "Over the last two days, with mandatory minicamps wrapped up across the league, it was the perfect time for tight ends Travis Kelce, George Kittle, and fellow co-founder Greg Olsen to host their annual \"Tight End University\" event in Nashville — a tradition they launched together in 2021.  The purpos",
      "<a href=\"https://news.google.com/rss/articles/CBMilwFBVV95cUxQUE4yUnFQTHVuOFlqNC1PNXlWOWowcVRJNkNYOVdBRVRTMFdaOXhhdU45V2lTS2RLa2xUc1hSR1ZuNjRRaWlRWWhLSnFIbnNIMTV1Z3l2TksyZUhva0RPLXhHcUV0elVkd0YxMi10VHVxRFZsbGVnd293ZHNFcXJ4d1V0WG5McE0xcWJ2OVpUR2JUM3c2bmw4?oc=5\" target=\"_blank\">Pelicans, Wizards Swap ",
      "<a href=\"https://news.google.com/rss/articles/CBMimgFBVV95cUxPbGNzUzFGeE1IR1R5SGNrXzBIdHd6ZnJOeVcxSUF4b1VrZW1UUmhfcHo4R2pINFM2ZGd3U3Zla25kSlFxTHZjWlN0UC10dnNndG9VZHhTRk91TmFfUnZVRU1qbVFJMFR1UVNYVXducy01WnliaDM2dGczUDFPTXhHS3oxWXBkQUNHSjVjWURLSU1ITnBCRTlnUWpn?oc=5\" target=\"_blank\">NBA Insider Identif",
      "<a href=\"https://news.google.com/rss/articles/CBMigwFBVV95cUxQMEVVQmRtVHVwbEpYX0RvamFTZ1J3REFsejlYQjdXM0FacGdRMlVneUdNYzdzYXQ5UHB0U3QzalozeFYzVS0xZjBUS2tVQkw0WWwxaXJSM0NwVmdWTlNER3N2c3pVUEp5QnNxRmdsTU00SXduMnViZ0V4bFRiUGhrdGdRMA?oc=5\" target=\"_blank\">D. Wayne Lukas Didn’t Just Train Horses—He Change",
      "<a href=\"https://news.google.com/rss/articles/CBMimAFBVV95cUxNYW5DWFQwakNYX2JxbW8xa2M1UTNya0RDZVIyeEw2UHhGZ1N2eTY3d21Td1p6Z0JtSHpfSDM1aXA5NGNtdHYtak1WOTRTT1lOVmo5aEtoZHEwd25pcUZVYzBkcUFJUzFDNkJPa0FVV3A2Rm1peHJrME5IWDRLa0dMM29PdWpUdmZaZWFvNlNoU2dTeE8zX19lRw?oc=5\" target=\"_blank\">Celtics Salary Cap Si",
      "Maxime Raynaud should be available when the Boston Celtics are on the board with the 28th pick",
      "The 6-foot-4 guard out of Tennessee will likely be on the draft board when the Celtics are on the clock",
      "Danny Wolf could slot straight into Joe Mazzulla's center rotation",
      "Kam Jones should be available when the Boston Celtics are on the clock with either the 28th or 32nd pick",
      "The injured Boston star hated to see his point guard and 'big fellas' leave the franchise",
      "The Celtics have kicked off the summer with two major moves",
      "Deals are already getting done ahead of the NBA draft. Catch up on the latest trade grades.",
      "<a href=\"https://news.google.com/rss/articles/CBMigwFBVV95cUxOMVRTU3dqdEdWWFNCZjNOcUozYlFDbC1JbEhxT2czTmhfNE15TVJsQUhuQ3VDcTJSaXo0YmhFVW5obW4yb3FLZVE2ZHNGZmdsMml4MDZ1MGdWdXpreHdLak81TWpCQ0o4R1c2ZkNRV0lWQmp3U3RIYzQ2REFkOTR2ZEZVdw?oc=5\" target=\"_blank\">Premier League 2025–26 Preseason: Full List of Fi",
      "<a href=\"https://news.google.com/rss/articles/CBMiiwFBVV95cUxNRlptTDNlODBNZ3FuaERfZEVWQ1lTb0tlWDVhUTBBZVA4M3BHcFBHaWpTSldkMXNUQWo5dHVlN0NmRGtnTEhvTGhIak1acEwtSUxELTZ0SVEyUVl1NkpJajRFc2NUX3UwMEg4NFEyQ1ktaklEOXVMbkhfdzJxZFJmbEtYdmRDRG1GNlhZ?oc=5\" target=\"_blank\">Brentford ‘Set New Bryan Mbeumo Asking ",
      "<a href=\"https://news.google.com/rss/articles/CBMilAFBVV95cUxPZEg5cEk5WXNHQXRSWldfMmdWNWRPSTg3eU9Gb282empSNW1WMFJ3NlhBeEM3aXJPTXlZd1kxQS1TZHVmNkN3eGFSRWR2VlZ1YjZoWUZWZklGT3VjOHlIcVd5a1hiLVhwV1htNGRXZXlET0QwSk5pN0VNbm5IT3BITW1ldlE4c2NXajVkWm5laDQ4U3dq?oc=5\" target=\"_blank\">NBA Officially Approves $1.",
      "<a href=\"https://news.google.com/rss/articles/CBMiakFVX3lxTFBOUDc3b1JYZWdSUnZZdFI2UWt4Z2NOLUs3ekw3NTBJQ2tnWTdJR19YX0lNLWJnZ3ZGdDNQS0k5cVBnYzlaLW5CaUx6cVZoUHlVZHF0QmJsTzV2bFg0SXJDQW1qODNlTDhaOXc?oc=5\" target=\"_blank\">DeWanna Bonner Shares Special Message During Fever’s Win Over Storm</a>&nbsp;&nbsp;<",
      "<a href=\"https://news.google.com/rss/articles/CBMiiAFBVV95cUxOOV96NUpjaE1jVWpBeDYzU1RXS0Uyd2JwMTdGNUNuZ2llX0hmelpNSXN2Rkg4eE5BQ1JKVm5lRGZKa1VTTUMzcXRjNTZYSW82MzFwcWROVUQzRHZYcXBaRV91bXBxOGlwVWRPc3ZCSFRvN1h3MDhTLUJuRW9rdGlKdmJ5UUZtR2Vm?oc=5\" target=\"_blank\">Report: Premier League Club Agrees to Deal ",
      "<a href=\"https://news.google.com/rss/articles/CBMihwFBVV95cUxQVHBhVTV2ckxKZzgtNXdDTk5mTHhqeWxFUkNnQTd2VnNqUkh5T0sxN0NTWkVGc3l5eXJLZEJKNjhraWNtZzEwSHF6cUhoUnFvQWp0RmxmZnpMTVdjYU9xSmVDRDh0MDNvT29aVTJqNThaeE1pS2JlcXM5SUhVNS1SODVxeUVLdHc?oc=5\" target=\"_blank\">DeWanna Bonner Expected to Part Ways With Fe",
      "<a href=\"https://news.google.com/rss/articles/CBMihwFBVV95cUxNcmk2SlVqa3djZnA1MGJ6ZFh1VFFseW5uV2ZuUzNCOW9iWmZUbkhjN2d4eGNUYV8tSkhYRy15WVN4S2FSa1NOWjlUMV8weGFVdmNXeVBPTENFeWlRRVFSTWlXRFNLQlNxVHJFd3UxMkNESER0dGdpZWY3eHlsN18yRzN4cGNOdzA?oc=5\" target=\"_blank\">What Bob Devaney Saw in Tom Osborne</a>&nbsp",
      "Bonner, a big offseason addition for the Fever, had not played since June 10 for personal reasons",
      "Bonner has not appeared in a game for the Fever since June 10"
    ],
    "image_url": "",
    "titles": [
      "Fever waive Bonner, who says fit 'did not work'",
      "Indiana Fever waive six-time all-star DeWanna Bonner",
      "Indiana Fever Make Decision on DeWanna Bonner's Future With Team - Sports Illustrated",
      "Arsenal ‘Make Bid’ For Premier League Captain, Thomas Partey Heading for Exit - Sports Illustrated",
      "Barcelona 2025–26 Pre-Season Fixtures: Dates, Opponents, How to Watch - Sports Illustrated",
      "Celtics Trade Kristaps Porzingis to Hawks in Three-Team Deal - Sports Illustrated",
      "AP Source: Celtics finalizing deal to send Porzingis to Hawks in three-team trade",
      "AP Source: Irving to decline player option, sign three-year deal with Mavericks",
      "George Kittle Has Strange List of Things He'd Sacrifice to Win a 49ers Super Bowl - Sports Illustrated",
      "NBA Analyst Says Thunder Could Be Looking to Trade Up in Draft - Sports Illustrated",
      "NFL Players Who Could Have Played in the NBA - Sports Illustrated",
      "NFL Mailbag: Teams Most Likely to Go Worst-to-First in 2025 - Sports Illustrated",
      "Pacers Coach Rick Carlisle Names Team's 'No. 1 Priority' for Offseason After NBA Finals Loss - Sports Illustrated",
      "‘Lot of Desire’—Luka Modric’s Next Move Confirmed by Club Chief - Sports Illustrated",
      "Documents Reveal NFL Encouraged Owners to Reduce Contract Guarantees - Sports Illustrated",
      "Braves' Austin Riley Named 'High-Priced' Candidate for Wild Trade Scenario - Sports Illustrated",
      "Why LeBron James Believes Cooper Flagg Will Be 'Amazing' With Mavericks - Sports Illustrated",
      "Taylor Swift Attends Tight End University Alongside Travis Kelce - Sports Illustrated",
      "NFL Reacts to Taylor Swift’s Surprise Appearance With Travis Kelce at Major Event",
      "Pelicans, Wizards Swap Guards CJ McCollum, Jordan Poole in Pre-Draft Trade - Sports Illustrated",
      "NBA Insider Identifies Pair of Teams Interested in Celtics' Kristaps Porzingis - Sports Illustrated",
      "D. Wayne Lukas Didn’t Just Train Horses—He Changed the Game - Sports Illustrated",
      "Celtics Salary Cap Situation After Trading Kristaps Porzingis to Hawks - Sports Illustrated",
      "Maxime Raynaud could soften the blow of the Boston Celtics Kristaps Porzingis trade",
      "What could Chaz Lanier add to the Boston Celtics?",
      "Is Danny Wolf the Boston Celtics next big man?",
      "Exploring Kam Jones' potential fit with the Boston Celtics",
      "Jayson Tatum sends messages to Jrue Holiday, Kristaps Porziņģis after Celtics pre-NBA Draft trades",
      "Why Celtics are trading away key players: Money not the only reason for Jrue Holiday, Kristaps Porziņģis deals",
      "Grading the Celtics' flurry of trades, plus every deal so far",
      "Premier League 2025–26 Preseason: Full List of Fixtures, Results As Giants Clash - Sports Illustrated",
      "Brentford ‘Set New Bryan Mbeumo Asking Price’ After Fresh Man Utd Bid - Sports Illustrated",
      "NBA Officially Approves $1.5 Billion Sale of Minnesota Timberwolves, Lynx - Sports Illustrated",
      "DeWanna Bonner Shares Special Message During Fever’s Win Over Storm - Sports Illustrated",
      "Report: Premier League Club Agrees to Deal for USMNT, Juventus’s Tim Weah - Sports Illustrated",
      "DeWanna Bonner Expected to Part Ways With Fever After Just Nine Games - Sports Illustrated",
      "What Bob Devaney Saw in Tom Osborne - Sports Illustrated",
      "DeWanna Bonner waived by Fever: What to know as veteran All-Star looks for new team after stint with Indiana",
      "Indiana Fever waive DeWanna Bonner after trade talks fall through between WNBA All-Star and team"
    ],
    "score_components": {
      "magnitude": 0.82,
      "recency": 0.99,
      "consensus": 0.988,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.837,
    "summary": "The Indiana Fever have decided to waive guard/forward DeWanna Bonner, who had not participated in a game since June 10 due to personal reasons. This move comes after Bonner, a significant free agent pickup in the offseason, missed five consecutive games. The team is moving forward without her as they adjust their roster for the season.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "The story offers basic awareness about a roster change in the Indiana Fever team, but it doesn't provide in-depth insight or actionable information for the reader. It also doesn't report on solutions or progress related to the player's extended absence."
  },
  {
    "title": "Zohran Mamdani Wins NYC Mayoral Democratic Primary Over Andrew Cuomo",
    "domain": "general",
    "location": "global",
    "published": "Wed, 25 Jun 2025 08:26:54 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Axios",
      "Forbes",
      "Deutsche Welle",
      "The Guardian",
      "CBC News",
      "Business Insider",
      "ABC News",
      "Al Jazeera"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "He is set to be the Democratic candidate for New York City Mayor in a race that could have implications for the party nationally.",
      "<p>‘Tonight is his night,’ says ex-governor as progressive state representative tells supporters ‘we made history’</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/live/2025/jun/25/new-york-donald-trump-zohran-mamdani-andrew-cuomo-latest-us-politics-news\">‘We made history’: Mamdani celebra",
      "Mamdani had received 43.5% of votes counted by the time former Gov. Andrew Cuomo, the second-place candidate in the Democratic primary, conceded the race Tuesday.",
      "Fix the City, an outside group that backed Cuomo, received nearly $25 million in contributions. $8.3 million of that sum came from Michael Bloomberg.",
      "Wall Street is struggling with the potential reality that Democratic socialist Zohran Mamdani is one step closer to leading New York.",
      "<img alt=\"Two men are shown in a composite photo.\" height=\"349\" src=\"https://i.cbc.ca/1.7569390.1750785016!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/us-election-2025-nyc-mayor.jpg\" title=\"FILE- This combination photo shows on left, Democratic mayoral candidate Andrew Cuomo speaking dur",
      "<img alt=\"A man with a beard wearing a suit stands behind a podium with right hand over his heart.\" height=\"349\" src=\"https://i.cbc.ca/1.7570154.1750827787!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/election-2025-nyc-mayor.jpg\" title=\"Democratic mayoral candidate Zohran Mamdani takes th",
      "After a strong showing by state Assemblymember Zohran Mamdani, former Gov. Andrew Cuomo said he is conceding the Democratic primary.",
      "<a href=\"https://news.google.com/rss/articles/CBMimAFBVV95cUxOdWtpeW8zbURBRjZtWl96UTFtY1N3VHhXSUpOT1ZjMnhXQXFXNVl4UVJOXzF5ME9vV18zNkZoazhHSHo5NGtraVZjaFBkcEZPS3Blb3g4ampuTG9mNDIydXRIdGRyakFWT1hiSkl2OTVhWGNvWUNvQ3lJM3JIUDVtZXJ1cEdaSnJHaEc0RXpza1hZR05RRVpqLQ?oc=5\" target=\"_blank\">Andrew Cuomo concedes",
      "<a href=\"https://news.google.com/rss/articles/CBMia0FVX3lxTE00dkhRS1pha3lRb1F4V3FaenpsbDlRN25DZ3JfQ3hCaUE5eTNNZzNtYUZLRWVCN1lEUW04ZUtzc3Z6ZGVDNU9YT3dUaGJpX04xOTJMVEFkR1JrcFNYVHdrUUZWUl95VndzT0w4?oc=5\" target=\"_blank\">Zohran Mamdani has NYC's business community \"terrified\"</a>&nbsp;&nbsp;<font color=",
      "<p>Now the New York mayoral candidate he needs to ensure an electoral win that translates into tangible improvements in people’s lives<br /></p><p>Zohran Mamdani’s triumph in New York City’s Democratic primary represents more than just an electoral upset. It’s a confirmation that progressive politic",
      "<a href=\"https://news.google.com/rss/articles/CBMif0FVX3lxTE9wRWtFVTA1Mnc5cHFqdUU3c1V3RVJ2Zmw5XzlzNktaWmd3U2l5M3Bhc1VaX3hQWTFyZV8wU213N0gybGdZdTRFcVN3d1dJb0ZjVEFnZXZ5cWdvYzZqTnJfMUNKVDU4RUxWOGVIeHd5Qy1qVGcydWhSV1QtcjZ3SHM?oc=5\" target=\"_blank\">Who is Zohran Mamdani, NYC's Democratic mayoral candidat",
      "Zohran Mamdani, the 33-year-old democratic socialist, has claimed victory over Andrew Cuomo in the New York City Democratic mayoral primary.",
      "His NYC Democratic primary win reflects growing, immigrant-led politics rooted in global resistance.",
      "Mamdani is on course to win the Democratic primary after Tuesday&#039;s election, beating predictions."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/74aa/live/0e02ee30-5197-11f0-a2ff-17a82c2e8bc4.jpg",
    "titles": [
      "Who is Zohran Mamdani, the Democrat aiming to be New York's next mayor?",
      "Zohran Mamdani declares historic victory in New York City mayoral primary after Cuomo concedes",
      "Billionaires Ackman And Musk Blast Zohran Mamdani’s Win In NYC Mayoral Primary",
      "The billionaires who bet big on the NYC mayoral primary &mdash; and lost",
      "The finance worker is meme-ing its way through Mamdani's expected NYC primary win",
      "For New York City mayoral candidates, the future could hinge on ranked ballots",
      "Upstart Mamdani declares victory with stunning upset in NYC Democratic mayoral primary",
      "New York City Democratic mayoral primary: Mamdani declares victory, Cuomo concedes",
      "Andrew Cuomo concedes to Zohran Mamdani in NYC mayoral primary - Axios",
      "Zohran Mamdani has NYC's business community \"terrified\" - Axios",
      "Zohran Mamdani offered New Yorkers a political revolution – and won | Bhaskar Sunkara",
      "Who is Zohran Mamdani, NYC's Democratic mayoral candidate - Axios",
      "Mamdani declares victory in NYC Democratic primary for mayor",
      "Mamdani’s victory marks the rise of a new American Left",
      "Who is Zohran Mamdani, New York’s likely next mayor?"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.822,
      "consensus": 1.0,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.824,
    "summary": "Zohran Mamdani, a 33-year-old democratic socialist and state Assemblymember, has won the Democratic primary for New York City Mayor, defeating former Governor Andrew Cuomo. Mamdani, celebrated for making history with his victory, received 43.5% of the votes. His win signals a shift towards progressive politics in the city, rooted in immigrant-led global resistance movements. Cuomo conceded the race, marking Mamdani's victory as a significant moment for both the city and the Democratic party. This outcome has stirred reactions from various quarters, including Wall Street and the business commun",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful context about the shift towards progressive politics in New York City, and the implications of Zohran Mamdani's victory on the Democratic party. However, it doesn't offer specific solutions or innovations, nor does it deeply explore the systems or causes behind this shift."
  },
  {
    "title": "Fred VanVleet Re-Signs with Rockets on $50M Deal, Option for 2026-27",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 25 Jun 2025 13:22:34 EST",
    "source": "ESPN",
    "sources": [
      "Yahoo Sports",
      "Sportsnet",
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Rockets guard Fred VanVleet intends to sign a two-year, $50 million contract to stay with the franchise, with a player option in 2026-27, sources told ESPN.",
      "<p>Fred VanVleet is set to extend his time with the Houston Rockets.</p>",
      "The Rockets previously declined their team option with the intention to ink a new deal",
      "The Rockets will not pick up the final year of Fred VanVleet's contract, but he plans to sign a two-year, $50 million deal to stay with the team.",
      "VanVleet was the glue with a young roster and will be back next season with another veteran, Kevin Durant.",
      "Chelsea are edging closer to a deal with Borussia Dortmund for winger Jamie Gittens after representatives from the two teams held discussions in the United States during the Club World Cup, sources have told ESPN.",
      "Atlético Madrid have reached a verbal agreement with Betis to sign USMNT midfielder Johnny Cardoso, sources have told ESPN.",
      "Alex Bregman, who can opt out and become a free agent after his first season with the Red Sox, is open \"to any conversation\" about a new deal, his agent said."
    ],
    "image_url": "",
    "titles": [
      "Sources: VanVleet to sign new deal with Rockets",
      "Report: Fred VanVleet intends to sign two-year contract to stay with Rockets",
      "Fred VanVleet contract: Rockets guard to re-sign as team makes offseason moves around Kevin Durant, per report",
      "Fred VanVleet plans to re-sign with Rockets on two-year, $50 million deal",
      "Rockets, Fred VanVleet agree to new two-year, $50 million team-friendly contract",
      "Sources: Chelsea near deal for Dortmund's Gittens",
      "Sources: Atlético reach deal for USMNT's Cardoso",
      "Bregman open to new Red Sox deal, agent says"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.99,
      "consensus": 0.935,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.817,
    "summary": "Fred VanVleet is set to re-sign with the Houston Rockets on a two-year, $50 million contract, with a player option for the 2026-27 season. This decision comes after the Rockets chose not to pick up the final year of his existing contract, aiming for a new agreement. VanVleet, a key player for the Rockets alongside veteran Kevin Durant, will continue to support the team's young roster. In other sports news, Chelsea is nearing a deal for Borussia Dortmund's Jamie Gittens, Atlético Madrid has a verbal agreement to sign Johnny Cardoso from Betis, and Alex Bregman of the Red Sox is open to discussi",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about Fred VanVleet's re-signing with the Houston Rockets. However, it lacks depth or insight into the implications of this decision for the team or the player."
  },
  {
    "title": "Slow Matches, Heat Concerns Mar Club World Cup; Chelsea Advances",
    "domain": "general",
    "location": "global",
    "published": "2025-06-25T14:59:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "NHL",
      "Sky Sports",
      "Deutsche Welle",
      "ESPN"
    ],
    "domains": [
      "sports",
      "general"
    ],
    "snippets": [
      "Slow-paced matches, sweltering players and complaints about the heat have been the themes of the Club World Cup in the USA. Organizers FIFA say they take reasonable precautions but many see a major safety concern.",
      "<a href=\"https://news.google.com/rss/articles/CBMihgFBVV95cUxQdzBrbzMtelVZUE93SUFvQkxtcXhQWUcwWDN1dGhRV2dvYjFvdXJBZ05EYTIwWnA1QzR5M09jSHBZZnpRS2tvMEhJbWZLS0RvcWc2Y3QySnBIUklvZXZZY25PRUFDZEF0Zi1ZOGRxSG9wVjVXenRRVEtKNXhySFJwNHBPeU05Zw?oc=5\" target=\"_blank\">Panthers bring Stanley Cup to FIFA Club World",
      "Here's what you need to know from Tuesday's action.",
      "Liam Delap scored his first Chelsea goal as the Premier League side reached the last 16 of the Club World Cup with a 3-0 win over Esperance Tunis."
    ],
    "image_url": "",
    "titles": [
      "Club World Cup: Extreme heat poses questions for FIFA",
      "Panthers bring Stanley Cup to FIFA Club World Cup match - NHL.com",
      "Club World Cup Daily: Liam Delap scores first Chelsea goal, Blues qualify to last 16",
      "Delap scores first Chelsea goal as Blues progress to last 16"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.942,
      "consensus": 0.985,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.815,
    "summary": "The Club World Cup in the USA has been marked by slow-paced matches and player complaints about excessive heat, raising safety concerns. Despite FIFA's assurances of taking reasonable precautions, there's widespread worry about player well-being. In related news, Chelsea advanced to the last 16 of the tournament with a 3-0 victory over Esperance Tunis, featuring Liam Delap's first goal for the team.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness about the ongoing Club World Cup and the challenges faced due to slow matches and heat concerns. It also includes information about Chelsea's progress in the tournament. However, it lacks depth or insight into the causes of these problems, potential solutions, or the broader impacts on the sport."
  },
  {
    "title": "Kenya Sees Protests Against Ruto's Rule Amid Economic Strife, Police Crackdown",
    "domain": "general",
    "location": "global",
    "published": "Wed, 25 Jun 2025 12:18:53 +0000",
    "source": "Al Jazeera",
    "sources": [
      "The Guardian",
      "New York Times",
      "Deutsche Welle",
      "Al Jazeera"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "Thousands protest in Kenya a year after deadly unrest as anger at police brutality and Ruto’s government persists.",
      "The police fired tear gas at demonstrators who were expressing anger at the government over growing economic hardship and a lack of accountability for killings at earlier rallies.",
      "<p>Nationwide marches planned in honour of those killed during anti-government protests</p><p>Kenyans plan to march countrywide on Wednesday, the first anniversary of the historic storming of parliament by protesters, to honour those killed during last year’s anti-government protests, but there are ",
      "Security forces fortified Kenya's government buildings with razor wire ahead of a march marking one year since anti-Ruto protesters stormed the parliament. Broadcasters have been ordered to stop showing live coverage."
    ],
    "image_url": "",
    "titles": [
      "Kenyans take to the streets for protest anniversary",
      "Kenyans Return to the Streets a Year After Deadly Tax Protests",
      "Fears of unrest as Kenyans mark first anniversary of storming of parliament",
      "Kenya: Thousands rally on anniversary of deadly protest"
    ],
    "score_components": {
      "magnitude": 0.82,
      "recency": 0.891,
      "consensus": 0.935,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.799,
    "summary": "In Kenya, thousands protested against police brutality and economic hardship under President Ruto's government, marking one year since deadly unrest. Police responded with tear gas. The protests aimed to honor those killed in last year's anti-government demonstrations. Security was heightened around government buildings, and broadcasters were restricted from airing live coverage.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story provides basic awareness about the ongoing protests in Kenya, the government's response, and the issues of police brutality and economic hardship, but it doesn't offer much depth or insight into the causes, potential solutions, or the broader implications of these issues."
  },
  {
    "title": "Kennedy's New Vaccine Committee, Including Skeptics, Convenes in Atlanta",
    "domain": "general",
    "location": "national",
    "published": "Wed, 25 Jun 2025 05:00:53 -0400",
    "source": "NPR",
    "sources": [
      "The Guardian",
      "CNBC",
      "NPR"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "For the first time since Health Secretary Robert F. Kennedy Jr. replaced all the members of the vaccine committee, it is meeting in Atlanta.",
      "<p>Health secretary unilaterally appointed ACIP’s eight new members, several of which are critical of immunizations</p><p>The first meeting of a critical federal vaccine panel remade by health secretary and vaccine skeptic Robert F Kennedy Jr began amid controversy – not only about the <a href=\"http",
      "It is unclear how Kennedy's new members, including Dr. Robert Malone, will affect the panel's vaccine recommendations."
    ],
    "image_url": "",
    "titles": [
      "RFK Jr.'s picks for CDC vaccine advisers meet this week amid controversy",
      "RFK Jr’s new CDC vaccine panel holds first meeting amid controversy",
      "CDC vaccine panel holds first meeting since RFK Jr. put immunization critics in place"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.832,
      "consensus": 0.897,
      "constructiveness": 0.8,
      "proximity": 0.75
    },
    "score": 0.791,
    "summary": "For the first time since Health Secretary Robert F. Kennedy Jr., known for his vaccine skepticism, overhauled the vaccine committee by replacing all its members, the panel convened in Atlanta. Kennedy appointed eight new members to the Advisory Committee on Immunization Practices (ACIP), some of whom have expressed critical views on vaccines. The meeting marks a significant shift in the committee's composition and has sparked controversy regarding the future of vaccine recommendations. The impact of these changes, including the influence of appointees like Dr. Robert Malone, remains uncertain.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful information about a significant shift in the composition of the vaccine committee, increasing reader's awareness about the potential impact on future vaccine recommendations. However, it doesn't clearly highlight solutions or progress, leaving the outcome uncertain."
  },
  {
    "title": "Evander Kane Traded to Canucks for 2025 Pick, Oilers Clear Cap Space",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 25 Jun 2025 13:22:34 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "NHL",
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Evander Kane, who returned for the Oilers in the playoffs after missing the entire regular season after multiple surgeries, was traded to his hometown Canucks on Wednesday, clearing cap space before free agency.",
      "<p>The FAN Hockey Show hosts Matt Marchese and Mike Futa discuss the Edmonton Oilers trading Evander Kane to the Vancouver Canucks for a 2025 fourth-round pick and what makes the deal so unique.</p>",
      "<p>The Edmonton Oilers are closing in on a deal that will send veteran forward Evander Kane to the Vancouver Canucks, Sportsnet&#8217;s Elliotte Friedman reports. </p>",
      "<a href=\"https://news.google.com/rss/articles/CBMiiAFBVV95cUxNVzhZbTFUdTUtUmk0aV9BUmtMVDNBTXhXeF9zeVA3NEFObURuSmR3TnhwTlg3V2dyMU5FWm1LUlhibEstLUJEOFpaajJkd2hQaXNPVmQtTGFPSmJtN2xZMEU0OGtXUHlGV0E0WnhadlNBNXZMMmR5RWVJSXZjTXVlLU1HMjByT2VM?oc=5\" target=\"_blank\">RELEASE: Oilers acquire pick from Canucks f",
      "<a href=\"https://news.google.com/rss/articles/CBMif0FVX3lxTE5zUnU2amtSc29Gc0x0MXdOdjE2VVV3elBFS0lYWUpGYzlYN0txWV9iTC1Iak1sZ1JNWnpITEFQRFBydGg3NmJwYjZmQ1hpZVppNkQycFA0ekg2NzBNWDBsT09ObzFXNi1WaHFjSkZlbWx4T0QwZ2hELThkMmtJa0k?oc=5\" target=\"_blank\">Blues release updated jerseys for upcoming season</a>&nb"
    ],
    "image_url": "",
    "titles": [
      "Oilers trade Evander Kane to hometown Canucks",
      "What to make of Kane’s trade from Oilers to Canucks",
      "Oilers trade Evander Kane to Canucks for fourth-round draft pick",
      "RELEASE: Oilers acquire pick from Canucks for Kane - NHL.com",
      "Blues release updated jerseys for upcoming season - NHL.com"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.99,
      "consensus": 0.847,
      "constructiveness": 0.5,
      "proximity": 0.75
    },
    "score": 0.78,
    "summary": "Evander Kane was traded from the Edmonton Oilers to the Vancouver Canucks for a 2025 fourth-round pick. This move, reported by Sportsnet's Elliotte Friedman and discussed on The FAN Hockey Show, allows the Oilers to clear cap space ahead of free agency. Kane, who missed the entire regular season due to multiple surgeries, made his return during the playoffs before the trade to his hometown team.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story offers basic awareness about the trade of Evander Kane to the Canucks and the Oilers' strategy to clear cap space. However, it doesn't provide a deeper understanding of the potential impacts of this trade on the teams or players involved."
  },
  {
    "title": "Israel Conducts 35,000 Attacks; US Identifies Iran as Key Threat",
    "domain": "general",
    "location": "global",
    "published": "Wed, 25 Jun 2025 15:36:48 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Business Insider",
      "Financial Times",
      "Al Jazeera"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "Israel has launched nearly 35,000 attacks across five countries over the past 20 months.",
      "Trump should champion diplomatic efforts if he wants peace to endure",
      "Vice Adm. Brad Cooper said Iran remains a \"considerable\" threat to US forces in the Middle East, which must be \"ready to go every single day\"."
    ],
    "image_url": "",
    "titles": [
      "Mapping Israel’s expanding battlefronts across the Middle East",
      "A fragile truce in the Middle East",
      "Iran has been hurt but is still a 'considerable' threat to US forces in the Middle East, says US admiral"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.955,
      "consensus": 0.897,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.777,
    "summary": "Over the past 20 months, Israel has conducted approximately 35,000 attacks in five different countries. Meanwhile, Vice Admiral Brad Cooper has identified Iran as a significant threat to US forces in the Middle East, emphasizing the need for readiness every day. Additionally, there's a suggestion that former President Trump should prioritize diplomatic efforts to ensure lasting peace in the region.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful context about the ongoing tensions in the Middle East, and the US's perspective on these issues. However, while it mentions the need for diplomatic efforts, it doesn't delve into potential solutions or strategies for achieving peace in the region."
  },
  {
    "title": "Bezos Moves Venice Wedding Party Amid Protests and Local Backlash",
    "domain": "general",
    "location": "global",
    "published": "2025-06-25T00:04:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "New York Times",
      "Deutsche Welle",
      "The Guardian",
      "Business Insider",
      "Washington Post"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "Jeff Bezos and Lauren Sanchez's Venice wedding party venue was moved out of Venice's city center. Many have protested against the lavish ceremonies because they see it as yet another example of exploitation of the city.",
      "The billionaire Amazon founder Jeff Bezos is marrying Lauren Sánchez in Venice. They arrived in the city on Wednesday amid protests of their nuptials.",
      "Ivanka Trump, Diane von Furstenberg, and Jared Kushner have arrived in Venice for the multiday wedding of Jeff Bezos and Lauren Sánchez.",
      "<p>People power forced a change of venue, proving that a man worth £223bn can still fall foul of ordinary folk with pool floats</p><p>There are so many questions swirling around the forthcoming wedding of Jeff Bezos to Lauren Sánchez this weekend – for instance, who in their right mind books Venice ",
      "The celebration of Jeff Bezos and Lauren Sánchez has divided a city that centuries ago set the standard for opulence.",
      "In Venice, a romantic backdrop of weddings for centuries, the marriage of Jeff Bezos and Lauren Sánchez is providing an economic windfall and stirring protest.",
      "<p>Nuptials of Amazon founder and former TV journalist to kick off on Thursday as activists continue to protest against event</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/jun/24/tell-us-are-you-getting-married-in-venice-this-weekend-italy-jeff-bezos-lauren-sanchez\">Tell us: are you "
    ],
    "image_url": "",
    "titles": [
      "Bezos' Venice wedding party venue moved following protests",
      "Photos show Jeff Bezos and Lauren Sánchez arriving in Venice for their wedding",
      "Jeff Bezos and Lauren Sánchez's wedding guest list: A-listers arrive in Italy to celebrate",
      "Congrats to Jeff Bezos and Lauren Sánchez on the wedding – and to Venice for running them out of town | Emma Brockes",
      "With Bezos Wedding, Venice Braces for Love in the Time of Tech Billionaires",
      "Venice, prime wedding spot, braces for a Bezos marital extravaganza",
      "Jeff Bezos and Lauren Sánchez arrive in Venice for divisive wedding"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.691,
      "consensus": 1.0,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.768,
    "summary": "Jeff Bezos and Lauren Sánchez moved their Venice wedding party venue from the city center due to protests. Critics argue the event exemplifies the exploitation of Venice. The wedding, attracting high-profile guests like Ivanka Trump and Diane von Furstenberg, has sparked debate between its economic benefits and the backlash from locals. Despite the controversy, preparations continue, highlighting the impact of public opinion on the plans of even the wealthiest individuals.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story provides basic awareness about the event and its impact on the local community, but it doesn't offer deep insights or actionable information. The story doesn't report on solutions, improvements, or attempts to solve the problem of exploitation of Venice."
  },
  {
    "title": "2025 NBA Draft Set for Wednesday at Barclays Center",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 25 Jun 2025 15:15:32 +0000",
    "source": "CBS Sports",
    "sources": [
      "NHL",
      "Sportsnet",
      "CBS Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "The first round of the 2025 NBA Draft is set for Wednesday at the Barclays Center in Brooklyn",
      "The 2025 NBA Draft kicks off Wednesday night in Brooklyn",
      "<p>After what has already been a bustling off-season in the PWHL, the 2025 Draft has finally arrived. </p>",
      "<a href=\"https://news.google.com/rss/articles/CBMiigFBVV95cUxPMlpsNGstMy1aQ25jWmxOMFUtbnU3T0FPaGJpcE9RRkhIYVZuU01hdEViZy15T1c5dFFqczFDNTF5V2ZkSjBUMml3dXlFZE50cXJGaThybWVJZnJYZHhKdWI2bk1qeFRQRDRNOUFEZ0dKaFV5VUNsc3FIaGdfZE8ycXVnT2ROWm80Vnc?oc=5\" target=\"_blank\">Final Mock 2025 NHL Draft: Intrigue foll",
      "The NBA trade market has heated up this week"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/06/25/db3b7063-aa5f-4bef-8360-8ab07682ff4f/gettyimages-2159402717-1.jpg",
    "titles": [
      "2025 NBA Draft where to watch: Round 1 time, TV channel, stream, draft order, Cooper Flagg set to go No. 1",
      "2025 NBA Draft order: Complete list of picks from 1-59 with Mavericks set to take Cooper Flagg at No. 1",
      "2025 PWHL Draft tracker: All the picks",
      "Final Mock 2025 NHL Draft: Intrigue following 1st 4 picks - NHL.com",
      "2025 NBA Draft trade tracker: Latest deals, news as Celtics, Nets, others swap picks and star players"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.948,
      "consensus": 0.847,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.726,
    "summary": "The 2025 NBA Draft is scheduled to take place on Wednesday at the Barclays Center in Brooklyn, marking a significant event following a busy off-season. This event is part of a broader sports landscape that has seen considerable activity, including in the NHL, where the draft has also garnered attention.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic information about the scheduling of the 2025 NBA Draft. However, it lacks depth or insight into the potential impacts of this event on the teams, players, or the broader sports landscape."
  },
  {
    "title": "Rubrik Buys Predibase to Boost AI Capabilities for Customers",
    "domain": "business",
    "location": "national",
    "published": "Wed, 25 Jun 2025 16:28:12 GMT",
    "source": "CNBC",
    "sources": [
      "TechCrunch",
      "CNBC"
    ],
    "domains": [
      "technology",
      "business"
    ],
    "snippets": [
      "Rubrik is seeking to bolster its artificial intelligence capabilities through acquisition.",
      "Predibase helps companies train and fine-tune open source AI models which will help Rubrik customers deploy AI agents faster."
    ],
    "image_url": "",
    "titles": [
      "Rubrik agrees to buy AI startup Predibase for over $100 million",
      "Rubrik acquires Predibase to accelerate adoption of AI agents"
    ],
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.972,
      "consensus": 0.682,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.722,
    "summary": "Rubrik, aiming to enhance its artificial intelligence (AI) features, has acquired Predibase, a company specializing in helping businesses train and refine open source AI models. This acquisition is set to enable Rubrik customers to deploy AI agents more swiftly, improving efficiency and effectiveness in their operations.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story clearly highlights progress and solutions, reporting on an acquisition intended to improve AI capabilities for customers. It provides useful information for readers interested in AI and business, and it increases understanding of trends in the tech industry."
  },
  {
    "title": "Jay Bilas Spotlights 8 Key Prospects for 2025 NBA Draft, Including Sorber",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 25 Jun 2025 13:00:06 EST",
    "source": "ESPN",
    "sources": [
      "Yahoo Sports",
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "From the no-brainer to the wild cards to those in between, here are eight prospects who caught Jay Bilas' eye.",
      "Here's what to know of Georgetown forward Thomas Sorber ahead of the 2025 NBA Draft, including the latest mock draft projections."
    ],
    "image_url": "",
    "titles": [
      "Bilas: Eight prospects who stand out in this year's NBA draft class",
      "NBA draft prospects: Meet Thomas Sorber, rising NBA draft prospect from Georgetown"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.983,
      "consensus": 0.632,
      "constructiveness": 0.8,
      "proximity": 0.75
    },
    "score": 0.72,
    "summary": "Jay Bilas highlighted eight basketball prospects, including Georgetown forward Thomas Sorber, as notable players ahead of the 2025 NBA Draft. Sorber, in particular, has gained attention in recent mock draft projections, indicating his potential as a strong candidate for the draft. This coverage categorizes the prospects from obvious choices to unexpected picks, showcasing a range of talent to watch for in the upcoming draft.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful information to readers interested in the NBA Draft, giving them insights into key prospects. It doesn't necessarily highlight progress or solutions, but it does increase awareness and understanding of the topic."
  },
  {
    "title": "Isar Aerospace Raises €150M; Lux Aeterna Secures $4M for Reusable Satellite",
    "domain": "science",
    "location": "global",
    "published": "Wed, 25 Jun 2025 11:20:03 EDT",
    "source": "Phys.org",
    "sources": [
      "TechCrunch",
      "Phys.org"
    ],
    "domains": [
      "technology",
      "science"
    ],
    "snippets": [
      "German space startup Isar Aerospace said Wednesday it had secured 150 million euros ($174 million) in funding from a US investment firm, several months after its first test flight of an orbital rocket.",
      "Lux Aeterna, a Denver-based startup, is working on a reusable satellite that has attracted $4 million in pre-seeding funding from investors."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2020/3-space.jpg",
    "titles": [
      "German space startup secures new funding",
      "New space startup Lux Aeterna wants to make satellites reusable"
    ],
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.949,
      "consensus": 0.682,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.717,
    "summary": "Isar Aerospace, a German space startup, has raised 150 million euros ($174 million) from a US investment firm, following its initial test flight of an orbital rocket. In related news, Lux Aeterna, a startup based in Denver, is developing a reusable satellite and has secured $4 million in pre-seed funding from investors.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it reports on progress and innovation in the space industry. It provides actionable insights for readers interested in space startups and their funding. It also increases awareness about the advancements in reusable satellites."
  },
  {
    "title": "Julie Bornstein Launches AI Fashion Shopping Bot 'Daydream'",
    "domain": "business",
    "location": "global",
    "published": "Wed, 25 Jun 2025 13:29:19 +0000",
    "source": "Fortune",
    "sources": [
      "TechCrunch",
      "Fortune"
    ],
    "domains": [
      "technology",
      "business"
    ],
    "snippets": [
      "\"This is very much the culmination of everything I've seen and done,\" Bornstein said. \"I've just been waiting for the technology to catch up.\"",
      "E-commerce veteran Julie Bornstein's startup Daydream is releasing its AI-powered chatbot for shopping with a focus on fashion."
    ],
    "image_url": "https://fortune.com/img-assets/wp-content/uploads/2025/06/Julie-Bornstein-Headshot-Credit_-Daydream-Cristopher-Wu--e1750831325179.jpg?w=2048",
    "titles": [
      "Top e-commerce veteran Julie Bornstein unveils Daydream—an AI-powered shopping agent that’s 25 years in the making",
      "Julie Bornstein’s Daydream is releasing an AI-powered chatbot for fashion-related shopping"
    ],
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.913,
      "consensus": 0.682,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.71,
    "summary": "E-commerce expert Julie Bornstein has launched Daydream, a startup introducing an AI-powered chatbot designed for fashion shopping. Bornstein, drawing on her extensive experience in the field, developed the technology to enhance the online shopping experience. This launch marks a significant milestone in her career, as she has been anticipating the advancement of technology to realize this project.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it reports on an innovation in the e-commerce sector. It gives the reader a deeper understanding of how AI can enhance the online shopping experience. However, it could be more constructive if it provided more details on how the AI-powered chatbot works and its potential impact on the industry."
  },
  {
    "title": "Google unveils Gemini CLI, an open-source AI tool for terminals",
    "domain": "technology",
    "location": "global",
    "published": "Wed, 25 Jun 2025 13:00:00 +0000",
    "source": "TechCrunch",
    "sources": [
      "Ars Technica",
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Google is launching a new agentic AI tool that will put its Gemini AI models closer to where developers are already coding. The company announced on Wednesday the launch of Gemini CLI, an agentic AI tool designed to run locally from your terminal. The new tool connects Google&#8217;s Gemini AI model",
      "Now, devs who prefer the terminal can get AI assistance, too."
    ],
    "image_url": "",
    "titles": [
      "Google unveils Gemini CLI, an open-source AI tool for terminals",
      "Gemini CLI is a free, open source coding agent that brings AI to your terminal"
    ],
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.904,
      "consensus": 0.632,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.696,
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it reports on an innovation in the field of AI. It provides actionable insights for readers interested in AI and open-source tools, and potentially empowers them with new knowledge about the technology."
  },
  {
    "title": "Paul Cole Retires After 38 Years in Horse Racing and Baseball",
    "domain": "sports",
    "location": "national",
    "published": "Tue, 24 Jun 2025 21:34:22 GMT",
    "source": "Sports Illustrated",
    "sources": [
      "Sports Illustrated",
      "Sportsnet",
      "Sky Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMimgFBVV95cUxPVWh0ZkR1NVNKWFhwZFlXZnV3MEFLd1gzMTJ0VTltUGJNY3IyTVRudTBzc0VvN0pncnZRUHRyOFB3SzlrVEdmc01xcDJrczhPQ3g0c0FnMFJjVlFuVm5td0VUWW9GRkt1bnc5SjNLQXlWMnZNVmxNbHdHTmxBZTlCbHh1M1ZIZkotQ1ljNlZ0dlZHZnZQMFZ0TTFB?oc=5\" target=\"_blank\">Whit Merrifield Apo",
      "<p>A former Blue Jays All-Star has decided the time has come to hang up his cleats.</p>",
      "Paul Cole, perhaps best known for saddling brilliant 1991 Derby winner Generous, has announced he is to retire following 38 years in the training ranks."
    ],
    "image_url": "",
    "titles": [
      "Whit Merrifield Apologizes to Phillies During Retirement Announcement: 'Sorry I Stunk' - Sports Illustrated",
      "Former Blue Jay Whit Merrifield announces retirement from MLB",
      "Derby-winning trainer Cole announces retirement"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.656,
      "consensus": 0.847,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.688,
    "summary": "Former Blue Jays All-Star and renowned horse trainer, Paul Cole, has announced his retirement after a distinguished 38-year career. Cole is celebrated for his exceptional achievement in saddling the 1991 Derby winner, Generous. His decision marks the end of a significant era in his professional life.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness about Paul Cole's retirement but doesn't provide any deeper insights or understanding. It doesn't report on any solutions, improvements, or attempts to solve problems, nor does it increase clarity around systems, causes, trends, or impacts that matter."
  },
  {
    "title": "Tesla's EU Sales Dip Amid CEO Controversies, Despite EV Market Growth",
    "domain": "business",
    "location": "national",
    "published": "Wed, 25 Jun 2025 15:05:02 GMT",
    "source": "CNBC",
    "sources": [
      "Investopedia",
      "CNBC"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "The U.S. EV maker has sustained brand and reputational damage in part due to CEO Elon Musk's incendiary rhetoric and political activity.",
      "<figure><img alt=\"Sean Gallup / Getty Images Tesla's EU sales declines continued in May even though overall battery-electric vehicle registrations in the bloc surged 25% year-over-year.\" src=\"https://www.investopedia.com/thmb/nEwUdpK8g2GzIJl9r-c7SXE5m5E=/filters:no_upscale():max_bytes(150000):strip_"
    ],
    "image_url": "",
    "titles": [
      "Tesla's European car sales nosedive for fifth month as customers switch to Chinese EVs",
      "Tesla EU Sales Tumble for Fifth Straight Month"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.944,
      "consensus": 0.632,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.687,
    "summary": "The U.S. electric vehicle manufacturer has experienced a decline in brand reputation, attributed to CEO Elon Musk's controversial statements and political engagements. Despite a 25% increase in overall battery-electric vehicle registrations in the European Union, Tesla's sales in the EU continued to fall as of May. This situation indicates a negative impact on Tesla's market performance in the region, contrasting with the broader growth trend in the electric vehicle sector.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The story provides useful information about Tesla's market performance in the EU and the broader growth trend in the electric vehicle sector. It increases clarity around the impact of the CEO's controversial actions on the company's brand reputation. However, it doesn't highlight any solutions or attempts to address the issue."
  },
  {
    "title": "Bumble Lays Off 30% of Workforce, Affecting 240 Employees",
    "domain": "business",
    "location": "national",
    "published": "Wed, 25 Jun 2025 15:23:50 GMT",
    "source": "CNBC",
    "sources": [
      "TechCrunch",
      "CNBC"
    ],
    "domains": [
      "technology",
      "business"
    ],
    "snippets": [
      "Founder Whitney Wolfe Herd, who stepped down as CEO at the beginning of 2024, returned to the role earlier this year.",
      "Dating app Bumble announced on Wednesday that it's laying off 30% of its workforce, impacting around 240 positions."
    ],
    "image_url": "",
    "titles": [
      "Bumble jumps 26% as dating company plans to axe 30% of workforce",
      "Bumble to lay off 30% of its workforce"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.95,
      "consensus": 0.682,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.681,
    "summary": "Whitney Wolfe Herd, the founder of Bumble, resumed her position as CEO earlier this year after stepping down at the start of 2024. Recently, Bumble announced it is laying off 30% of its workforce, affecting approximately 240 employees. This decision marks a significant change in the company's staffing.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "While the story does provide useful information about a significant change in Bumble's workforce, it lacks depth and insight into the reasons behind the layoffs or potential solutions. It does not offer actionable insights or deeper understanding for the reader, nor does it report on improvements or attempts to solve the problem."
  },
  {
    "title": "Pirates' Oneil Cruz Benched for Not Running Out Play in Loss to Brewers",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 25 Jun 2025 13:22:34 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Pittsburgh Pirates veteran outfielder Oneil Cruz, 26, said he lost track of the outs in the seventh inning, when he didn't run out a double-play grounder, a move that led to his removal in his club's 9-3 loss to the Milwaukee Brewers on Tuesday night.",
      "Cruz was removed from Tuesday's game after failing to run out a groundball double play"
    ],
    "image_url": "",
    "titles": [
      "Pirates remove Cruz after he loses track of outs",
      "Pirates' Oneil Cruz benched over 'energy and effort' after forgetting how many outs there were"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.99,
      "consensus": 0.632,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.671,
    "summary": "Oneil Cruz, a 26-year-old outfielder for the Pittsburgh Pirates, was removed from a game against the Milwaukee Brewers after not running out a double-play grounder. This incident occurred in the seventh inning of Tuesday's game, which ended in a 9-3 loss for the Pirates. Cruz admitted to losing track of the outs during the play.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about a specific incident in a baseball game, but it doesn't offer any deeper insight or understanding. It doesn't report on any solutions, improvements, or attempts to solve problems, nor does it increase clarity around systems, causes, trends, or impacts that matter."
  },
  {
    "title": "Texans Relocate Training Camp for Cooler Conditions; Panthers Announce 2025-26 S",
    "domain": "sports",
    "location": "national",
    "published": "Wed, 25 Jun 2025 16:56:13 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports",
      "NHL"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "For a few days in training camp, the Texans will try to beat the Houston heat by holding practice away from home.",
      "<a href=\"https://news.google.com/rss/articles/CBMijwFBVV95cUxQRHE2RGtjdXdZcTR5VElBLUFvTlRpT1N0a0VfOENybmFuanBldWwxYnpteEpTUU96Z3BEdnZYZS1Td3ltX3VPWlhuUl8zNk54Rk9xcWNxSHpsZE1UcVRuTVB1bkFqZG9Pc0hiQTZyN05KeVRVWXRVTjR4WENaeFRZcVZJanB4NVB5T3dCU0JoNA?oc=5\" target=\"_blank\">Florida Panthers Announce 2025-26"
    ],
    "image_url": "",
    "titles": [
      "Texans announce 2025 camp schedule, will spend time at The Greenbrier",
      "Florida Panthers Announce 2025-26 Preseason Schedule - NHL.com"
    ],
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.981,
      "consensus": 0.632,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.671,
    "summary": "The Houston Texans have decided to temporarily relocate their training camp sessions to combat the intense local heat. This move is aimed at providing a cooler environment for the players to practice in. Meanwhile, in a separate development, the Florida Panthers have announced their schedule for the 2025-26 season, marking an advance planning move by the team.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about the strategic decisions of two sports teams. However, it doesn't offer deep insights or actionable information for the reader, nor does it highlight a solution or innovation. It doesn't increase understanding of broader systems or trends."
  },
  {
    "title": "Apple’s sports app now shows tennis scores",
    "domain": "technology",
    "location": "global",
    "published": "2025-06-25T12:39:45-04:00",
    "source": "The Verge",
    "sources": [
      "TechCrunch",
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Apple Sports, the company’s sports app for iPhone, now shows scores for tennis matches. “Tennis fans can access live scores for Grand Slam and 1000-level tournaments, and can track every point across all men’s and women’s singles matches, beginning with Wimbledon,” Apple says in a press release. The",
      "Users will now be able to access live tennis scores for Grand Slam and 1000-level tournaments and can track every point across all men’s and women’s singles matches. And Apple says the revamped home screen experience makes it easier for fans to follow their favorite teams and leagues."
    ],
    "image_url": "",
    "titles": [
      "Apple’s sports app now shows tennis scores",
      "Apple Sports app adds live tennis scores and a redesigned home screen"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.976,
      "consensus": 0.632,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.643,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers basic awareness about a new feature in Apple's sports app but lacks depth or insight. It does not provide any actionable insights or highlight any progress or solutions."
  },
  {
    "title": "TikTok Campaign Fights \"Gay\" Insult; NYT Examines Iran's Isolation Impact",
    "domain": "business",
    "location": "national",
    "published": "Tue, 24 Jun 2025 18:27:11 GMT",
    "source": "CNBC",
    "sources": [
      "New York Times",
      "CNBC"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "TikTok videos, social media posts, and celebrities are referencing Duff's ad, which discourages people from using the word \"gay\" as an insult.",
      "Christina Goldbaum, a New York Times reporter, and Katrin Bennhold, a senior writer on the international desk, discuss how the power dynamics in the Middle East could change as Iran has become more isolated."
    ],
    "image_url": "",
    "titles": [
      "How the gay anti-bullying ad with Hilary Duff became a cult classic",
      "How Iran Became Isolated"
    ],
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.614,
      "consensus": 0.682,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.63,
    "summary": "TikTok videos, social media posts, and celebrities are promoting an advertisement led by Duff, which aims to discourage the use of the word \"gay\" as an insult. Meanwhile, New York Times reporters Christina Goldbaum and Katrin Bennhold analyze the potential shift in Middle East power dynamics due to Iran's increasing isolation.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides actionable insights on how social media and celebrities can be used to discourage harmful language, promoting awareness about the issue. Additionally, it offers a deeper understanding of Middle East power dynamics. However, it doesn't clearly highlight solutions or progress in these issues."
  },
  {
    "title": "Baby Toy Preferences Linked to Future IQ, Study Finds",
    "domain": "science",
    "location": "global",
    "published": "Tue, 24 Jun 2025 21:49:24 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily",
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/your-babys-favorite-toy-could-hint-at-their-future-iq/\" rel=\"nofollow\" title=\"Your Baby’s Favorite Toy Could Hint at Their Future IQ\"><img alt=\"Baby Plastic Toy\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"777\" src=\"https://scitechdaily.com/images/Baby-Plas",
      "If you've ever shared your home with more than one cat, you'll know how different their personalities can be. One might chirp for food, purr loudly on your lap and greet visitors at the door. Another might prefer quiet observation from a distance."
    ],
    "image_url": "",
    "titles": [
      "Your Baby’s Favorite Toy Could Hint at Their Future IQ",
      "Is your cat vocal or quiet? The explanation could be in their genes"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.659,
      "consensus": 0.632,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.63,
    "summary": "A study suggests that a baby's preference for certain toys might be indicative of their future IQ, highlighting the potential early signs of cognitive abilities. Similarly, the distinct personalities and behaviors of cats in a household exemplify the diversity in animal temperaments and interactions. Both instances underscore the importance of early indicators and personality traits in understanding development and behavior.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The story offers useful insights into early cognitive development and how it might be indicated by a baby's toy preferences. It also provides a deeper understanding of animal behavior. However, it does not discuss solutions or improvements, hence the score is not the highest."
  },
  {
    "title": "How to safely maintain, use, and dispose of your power banks",
    "domain": "technology",
    "location": "global",
    "published": "2025-06-25T12:25:33-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "The lithium-ion battery inside your power bank isn't designed to run forever. After years of use and hundreds of charges, its performance and capacity will decline, while the risk of more severe issues increases. There are things you can do to prolong your power bank's lifespan, while also ensuring "
    ],
    "image_url": "",
    "titles": [
      "How to safely maintain, use, and dispose of your power banks"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.971,
      "consensus": 0.393,
      "constructiveness": 1.0,
      "proximity": 0.5
    },
    "score": 0.463,
    "constructiveness_score": 1.0,
    "constructiveness_reason": "This story is highly constructive as it provides actionable insights on how to properly use, maintain, and dispose of power banks. It contributes to the reader's understanding and decision-making regarding the safe and efficient use of their devices."
  },
  {
    "title": "Better Auth, an authentication tool by a self-taught Ethiopian dev, raises $5M from Peak XV, YC",
    "domain": "technology",
    "location": "global",
    "published": "Wed, 25 Jun 2025 16:00:16 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Better Auth offers an open source framework that promises to simplify how developers manage user authentication, and it’s caught the attention of some big name investors. It recently raised about $5 million in seed funding from Peak XV."
    ],
    "image_url": "",
    "titles": [
      "Better Auth, an authentication tool by a self-taught Ethiopian dev, raises $5M from Peak XV, YC"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.963,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.452,
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it reports on progress and innovation in the tech industry, specifically in the area of authentication tools. It also provides useful insights into the startup ecosystem and venture capital investments. Furthermore, it highlights the achievement of a self-taught developer from Ethiopia, which can inspire and empower readers."
  },
  {
    "title": "Cornell Study: Burying Wood Debris Can Slow Global Warming",
    "domain": "science",
    "location": "global",
    "published": "Wed, 25 Jun 2025 13:25:22 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Taking carbon out of the atmosphere is essential for slowing global warming—and a team of Cornell University researchers has estimated \"huge\" potential for carbon capture using a method that is low-tech, sustainable and relatively simple: burying wood, especially the debris from managed forests."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/low-cost-carbon-captur-1.jpg",
    "titles": [
      "Low-cost carbon capture? Bury wood debris in managed forests"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.991,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.45,
    "summary": "Cornell University researchers have identified a low-tech, sustainable method to significantly reduce atmospheric carbon and slow global warming: burying wood debris from managed forests. This approach presents a \"huge\" potential for carbon capture, offering a relatively simple solution to a complex environmental challenge.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it reports on a solution to a global problem, providing readers with a deeper understanding of a potential method to combat climate change. It highlights progress in the field of environmental science and offers actionable insights on sustainable practices."
  },
  {
    "title": "New Microfluidic System Detects Antibiotic-Resistant Bacteria Quickly",
    "domain": "science",
    "location": "global",
    "published": "Wed, 25 Jun 2025 12:56:03 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Scientists at National Taiwan University have developed a new microfluidic system that can detect subtle chemical fingerprints from bacteria—helping to identify even antibiotic-resistant strains. This technology could help physicians quickly and accurately diagnose infections in hospitals. The study"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/a-tiny-droplet-a-giant.jpg",
    "titles": [
      "Microfluidic system can quickly and accurately identify bacteria, including antibiotic-resistant strains"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.981,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.448,
    "summary": "Scientists at National Taiwan University have created a microfluidic system capable of identifying bacterial chemical fingerprints, including those of antibiotic-resistant strains. This advancement promises to enable doctors to diagnose infections swiftly and accurately in hospital settings.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive as it reports on an innovation that has the potential to solve a significant problem in the medical field — the quick and accurate diagnosis of antibiotic-resistant infections. It provides useful information for medical professionals and increases awareness about the capabilities of microfluidic systems."
  },
  {
    "title": "Getty drops key copyright claims against Stability AI, but UK lawsuit continues",
    "domain": "technology",
    "location": "global",
    "published": "Wed, 25 Jun 2025 16:34:35 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Getty Images dropped its primary claims of copyright infringement against Stability AI on Wednesday at London’s High Court, narrowing one of the most closely watched legal fights over how AI companies use copyrighted content to train their models."
    ],
    "image_url": "",
    "titles": [
      "Getty drops key copyright claims against Stability AI, but UK lawsuit continues"
    ],
    "score_components": {
      "magnitude": 0.129,
      "recency": 0.974,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.448,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful context about an ongoing legal issue involving copyright claims in the tech industry. However, it doesn't seem to offer solutions or progress, and its usefulness may be limited to those specifically interested in this case."
  },
  {
    "title": "The photographer using AI to reconstruct stories lost to censorship",
    "domain": "technology",
    "location": "global",
    "published": "2025-06-25T13:00:00-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Video screens glow softly from the floor, looping footage of salt lakes, steppe villages, and decaying nuclear test sites. Suspended above them is a large handwoven textile map, crafted by artisans in Kazakhstan. The tapestry maps 12 significant sites across Kazakhstan and the surrounding region, ea"
    ],
    "image_url": "",
    "titles": [
      "The photographer using AI to reconstruct stories lost to censorship"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.983,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.446,
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story increases awareness about the use of AI in a unique context - reconstructing censored stories. It offers a deeper understanding of how technology can be used to counter censorship, contributing to the reader's sense of agency."
  },
  {
    "title": "Bernie Sanders says that if AI makes us so productive, we should get a 4-day work week",
    "domain": "technology",
    "location": "global",
    "published": "Wed, 25 Jun 2025 16:18:28 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "\"Let's use technology to benefit workers,\" Sanders said."
    ],
    "image_url": "",
    "titles": [
      "Bernie Sanders says that if AI makes us so productive, we should get a 4-day work week"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.969,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.443,
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The story provides useful context about the potential societal impacts of AI and productivity. It also promotes awareness about the ongoing discussions regarding work-life balance and the future of work. However, it doesn't provide a clear solution or progress towards the issue."
  },
  {
    "title": "Mark Minervini Shares Trading Strategies for Today's Market Conditions",
    "domain": "business",
    "location": "global",
    "published": "Wed, 25 Jun 2025 15:05:00 GMT",
    "source": "MarketWatch",
    "sources": [
      "MarketWatch"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Mark Minervini shares what’s worked for him over his long trading career and talks about how to invest in the stock market now."
    ],
    "image_url": "https://images.mktw.net/im-417920",
    "titles": [
      "Why this famous trader is 100% invested in the S&P 500 right now — even after the U.S. strike on Iran"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.944,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.441,
    "summary": "Mark Minervini, a seasoned trader, shared insights from his extensive career in trading, focusing on effective strategies for investing in the current stock market. He emphasized approaches that have contributed to his success, offering guidance for investors looking to navigate market conditions today.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive as it provides actionable insights for readers interested in trading. It offers a deeper understanding of the stock market and presents strategies that can be used to navigate current market conditions, empowering readers with knowledge to make informed decisions."
  },
  {
    "title": "Research Suggests Dinosaur Speed Estimates May Be Inaccurate",
    "domain": "science",
    "location": "global",
    "published": "Wed, 25 Jun 2025 13:25:08 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "An international team has found that equations to determine the speed of a moving dinosaur based on prints in trackways may be inaccurate. In their study published in the journal Biology Letters, the group urged test guineafowl to walk or run across a muddy course and then used standard equations to"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/timing-guineafowl-runn.jpg",
    "titles": [
      "Observing guineafowl running on soft mud shows math used to calculate dinosaur speed may be inaccurate"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.991,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.44,
    "summary": "An international research team published findings in Biology Letters, revealing that standard equations used to estimate dinosaur speeds from trackways might be inaccurate. This conclusion was reached after observing guineafowl walking and running across a muddy course and applying these equations to their tracks. The study suggests a need for reevaluation of how dinosaur movement speeds are calculated from fossilized footprints.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is informative and provides a deeper understanding of how scientists estimate dinosaur speeds. It also highlights the need for reevaluation and improvement in the current methods, suggesting progress in the field of paleontology."
  },
  {
    "title": "Physicists Probe Universe's Structure Through Particle Interactions",
    "domain": "science",
    "location": "global",
    "published": "Wed, 25 Jun 2025 12:50:01 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Solving life's great mysteries often requires detective work, using observed outcomes to determine their cause. For instance, nuclear physicists at the U.S. Department of Energy's Thomas Jefferson National Accelerator Facility analyze the aftermath of particle interactions to understand the structur"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/its-elementary-problem.jpg",
    "titles": [
      "It's elementary: Problem-solving AI approach tackles inverse problems used in nuclear physics and beyond"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.979,
      "consensus": 0.393,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.428,
    "summary": "Nuclear physicists at the U.S. Department of Energy's Thomas Jefferson National Accelerator Facility are investigating the structure of the universe by analyzing the aftermath of particle interactions. This research involves observing outcomes to determine their causes, aiming to solve complex mysteries about how the universe is built.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story is constructive as it provides insight into ongoing research aimed at understanding the structure of the universe. While it does not offer actionable insights for the general reader, it does contribute to a deeper understanding of the universe and the methods scientists are using to investigate it."
  },
  {
    "title": "iPhone users on Google Fi will now get all their voicemails in the Phone app",
    "domain": "technology",
    "location": "global",
    "published": "2025-06-25T12:02:27-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Google is making a big change to how Fi users on iPhone access their voicemails: instead of getting voicemails from a dedicated tab in the Fi app, iPhone users will be able to get them right from the native iOS Phone app instead. The change started rolling out on Tuesday and will be fully rolled [&#"
    ],
    "image_url": "",
    "titles": [
      "iPhone users on Google Fi will now get all their voicemails in the Phone app"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.963,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.421,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs iPhone users on Google Fi about a new feature that could improve their user experience. However, it doesn't provide deeper understanding or highlight progress beyond the specific feature update."
  },
  {
    "title": "Satellites Struggle to Measure Coastal Sea Levels Accurately",
    "domain": "science",
    "location": "global",
    "published": "Wed, 25 Jun 2025 13:27:02 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "While satellites have revolutionized our ability to measure sea level with remarkable precision, their data becomes less reliable near coasts—where accurate information is most urgently needed."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/first-sea-level-record.jpg",
    "titles": [
      "First sea-level records for coastal community protection"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.992,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.42,
    "summary": "Satellites have significantly improved our capability to measure sea levels accurately. However, their effectiveness diminishes near coastal areas, precisely where precise data is crucially needed. This limitation highlights a gap in our ability to monitor sea level changes where it matters most.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story is somewhat constructive as it increases awareness about the limitations of satellite technology in measuring coastal sea levels. However, it does not provide solutions or actionable insights, nor does it significantly deepen the reader's understanding of the issue beyond stating the problem."
  },
  {
    "title": "Porter Airlines Begins Nonstop Flights to Nassau, Expanding Canadian Travel Opti",
    "domain": "business",
    "location": "national",
    "published": "Wed, 25 Jun 2025 17:15:49 +0000",
    "source": "Financial Post",
    "sources": [
      "Financial Post"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Nassau, The Bahamas, June 25, 2025 (GLOBE NEWSWIRE) &#8212; There will be more ways for Canadians to escape to The Bahamas with the launch of Porter Airlines nonstop flights to Nassau. The announcement was made today by the Bahamas Ministry of Tourism, Investments &#38; Aviation. The new nonstop ser"
    ],
    "image_url": "",
    "titles": [
      "The Bahamas Ministry of Tourism, Investment and Aviation announces New Airlift from Canadian Cities with Expansion of Porter Airlines into Nassau"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.988,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.416,
    "summary": "Porter Airlines has announced the launch of nonstop flights to Nassau, The Bahamas, expanding travel options for Canadians. This initiative, revealed by the Bahamas Ministry of Tourism, Investments & Aviation on June 25, 2025, aims to facilitate easier access for Canadian tourists to the island destination.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": ""
  },
  {
    "title": "New Bat Viruses Similar to Nipah Found, Pose Human Risk",
    "domain": "science",
    "location": "global",
    "published": "Wed, 25 Jun 2025 10:47:25 EDT",
    "source": "ScienceDaily",
    "sources": [
      "ScienceDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Two newly discovered viruses lurking in bats are dangerously similar to Nipah and Hendra, both of which have caused deadly outbreaks in humans. Found in fruit bats near villages, these viruses may spread through urine-contaminated fruit, raising serious concerns. And that’s just the start—scientists"
    ],
    "image_url": "",
    "titles": [
      "New viruses discovered in bats in China could be the next pandemic threat"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.938,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.409,
    "summary": "Scientists have identified two new viruses in fruit bats that closely resemble the deadly Nipah and Hendra viruses, which have previously caused fatal outbreaks in humans. These viruses, discovered near human villages, pose a risk of spreading to humans through fruit contaminated with bat urine. This finding raises significant health concerns regarding potential future outbreaks.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story increases awareness about potential health risks from newly discovered bat viruses. It provides useful information about the potential for future outbreaks. However, it does not offer actionable insights or discuss any solutions to the problem, making it less constructive."
  }
]