[
  {
    "title": "Israel-Iran Strikes Escalate; Deaths Rise, Threats of More Action",
    "domain": "general",
    "location": "global",
    "published": "Sun, 15 Jun 2025 23:44:27 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "<p>Death toll mounts in Israel and Iran as both countries threaten further response after trading strikes overnight</p><p><strong>Israeli forces have opened fire on people at several aid distribution sites in Gaza, killing at least five civilians, according to Palestinian media.</strong></p><p>The news agency Wafa reports three people were killed and others injured at the former Netzarim corridor in central Gaza, according to medical sources and eyewitnesses.</p> <a..."
    ],
    "image_url": "https://i.guim.co.uk/img/media/99710537f767833789093ee6d3acf7ae9f00ac31/674_0_6830_5464/master/6830.jpg?width=140&quality=85&auto=format&fit=max&s=8ad325956d775446da60807f46e92900",
    "titles": [
      "Missiles hit several sites in Israel as Revolutionary Guards intelligence chief reportedly killed – live updates"
    ],
    "summary": "The death toll has risen in Israel and Iran following overnight strikes, with both nations threatening additional actions. Israeli forces reportedly killed at least five civilians at aid distribution sites in Gaza, as per Palestinian media. Wafa news agency detailed that three of these deaths occurred at the former Netzarim corridor in central Gaza, citing medical sources and eyewitness accounts.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness of the escalating conflict between Israel and Iran but lacks depth or insight. It doesn't provide any actionable insights or deeper understanding for the reader, nor does it report on solutions or attempts to solve the problem.",
    "score_components": {
      "magnitude": 0.109,
      "recency": 0.992,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.415
  },
  {
    "title": "U.S. President Seeks to Cut Overseas Military Role, Sparks Trade Conflict",
    "domain": "general",
    "location": "global",
    "published": "Sun, 15 Jun 2025 23:08:19 +0000",
    "source": "New York Times",
    "sources": [
      "New York Times"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "In 2018, the president called for the group to embrace Russia and stormed out of the summit. Now he is seeking to shrink America’s military role abroad and embarking on a more expansive trade war."
    ],
    "image_url": "https://static01.nyt.com/images/2025/06/15/multimedia/15dc-trump-g7-02-zvwb/15dc-trump-g7-02-zvwb-mediumSquareAt3X.jpg",
    "titles": [
      "As Trump Returns to G7, Rift With Allies Is Even Deeper"
    ],
    "summary": "In 2018, the U.S. President urged for Russia's inclusion in a group summit and exited the meeting abruptly. Currently, he is aiming to reduce the United States' military involvement overseas and is initiating a broader trade conflict.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story provides some awareness about the U.S. President's intentions to reduce overseas military involvement and the ensuing trade conflict. However, it lacks depth and does not provide actionable insights or deeper understanding of the implications of these actions.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.98,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.408
  },
  {
    "title": "MPs Slam Thames Water Over £3bn Loans Misuse, Urge Non-Profit Model Shift",
    "domain": "general",
    "location": "global",
    "published": "Sun, 15 Jun 2025 23:01:30 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "<p>Report says billpayer funds are being used irresponsibly, after news that Thames Water paid bonuses from £3bn loan</p><p>Bonuses and dividends for water company bosses and shareholders should be approved by the regulator before they are paid, as billpayer funds are being used irresponsibly, MPs have said.</p><p>They also recommended that the government consider ending the profit-driven water company model and making English companies non-profit, similar to how the system works in Wales, in the report by the Environment, Food and Rural Affairs (Efra) select committee.</p> <a..."
    ],
    "image_url": "https://i.guim.co.uk/img/media/d7250bc437765a6ce403a8d87495b4639492e382/673_0_3743_2995/master/3743.jpg?width=140&quality=85&auto=format&fit=max&s=5e1d9e5b6788aae671954205667277d7",
    "titles": [
      "Ofwat should have to approve water firms’ bonuses and dividends, say MPs"
    ],
    "summary": "A report by the Environment, Food and Rural Affairs (Efra) select committee criticized Thames Water for irresponsibly using £3bn in loans for bonuses. MPs are calling for regulator approval before water company bosses and shareholders receive bonuses and dividends. They also suggest the government should explore transitioning English water companies to a non-profit model, akin to Wales, to prevent misuse of billpayer funds.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story clearly highlights a problem (misuse of loans by Thames Water), reports on a proposed solution (transition to a non-profit model), and increases clarity around a system (water companies in England). It provides actionable insights and deeper understanding of the issue, making it highly constructive.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.977,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.447
  },
  {
    "title": "Netflix Doc Explores Grenfell Tower Disaster as Preventable Tragedy",
    "domain": "general",
    "location": "global",
    "published": "Sun, 15 Jun 2025 23:01:29 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "<p>The maker of Netflix documentary about the fire reflects on a very avoidable tragedy and the injustices attested to by former PM, Theresa May</p><p>Over the course of 100 minutes, a new documentary on the Grenfell Tower disaster splices footage from the night and the subsequent public inquiry with testimony from survivors and the bereaved.</p><p>And at its heart is a universal story: classism, the prioritisation of individual profit over public safety, and a lack of accountability for the decision-makers behind it.</p> <a..."
    ],
    "image_url": "https://i.guim.co.uk/img/media/d0edf18f4bdd339fd4cb8db77a392e2148fe333a/2666_0_10000_8000/master/10000.jpg?width=140&quality=85&auto=format&fit=max&s=8b710e4b5b6cacb26b191843c85cbd87",
    "titles": [
      "‘Grenfell should make us all uncomfortable’: Olaide Sadiq on making Grenfell: Uncovered"
    ],
    "summary": "A new Netflix documentary delves into the Grenfell Tower disaster, combining footage from the tragic night and the following public inquiry with survivor and bereaved testimonies. The film, reflecting on comments by former PM Theresa May, portrays the event as a preventable tragedy rooted in classism, profit prioritization over public safety, and a lack of accountability among decision-makers. This 100-minute documentary aims to shed light on the injustices surrounding the disaster.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive as it provides a deep understanding of the Grenfell Tower disaster, highlighting the systemic issues that led to the tragedy. It raises awareness about the role of classism, profit prioritization, and lack of accountability in such incidents. It also empowers the reader with knowledge about the disaster and its preventability, which could influence future decision-making and actions.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.977,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.447
  },
  {
    "title": "Search Teams Fail to Find Person Missing After Vehicle Incident",
    "domain": "general",
    "location": "national",
    "published": "Sun, 15 Jun 2025 22:54:07 +0000",
    "source": "Global News",
    "sources": [
      "Global News"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "Officers, firefighters and search-and-rescue crews tried to locate both the vehicle and the missing person, but failed. Three other occupants were able to get to safety."
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/05/74eead2db3f8ee6c3cfac2fb59c4a0b7b0bcdb7cb9e7b446d7b6ba2cdea61c5e_0ec517.jpg?quality=85&strip=all",
    "titles": [
      "Person still missing after vehicle crashes into Squamish River: B.C. RCMP"
    ],
    "summary": "After an incident involving a vehicle, officers, firefighters, and search-and-rescue teams were deployed to find a missing person related to the event. Despite their efforts, they were unable to locate the individual. Three other occupants of the vehicle managed to reach safety. The current status of the missing person remains unresolved.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about a missing person incident but offers minimal depth or insight. It does not provide actionable insights or a deeper understanding of the situation, nor does it report on solutions or improvements. The lack of information about the cause of the incident or efforts to prevent similar events in the future also limits its constructiveness.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.975,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 1.0
    },
    "score": 0.444
  },
  {
    "title": "Washington Post Probes Cyberattack on Journalists' Emails",
    "domain": "general",
    "location": "global",
    "published": "Sun, 15 Jun 2025 22:05:35 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMirwFBVV95cUxOQ1MwQ2MxMGlJQzh2ZjZqUXNnR0VWMEdsZkpLZzVSZFJKaUdndkhoaXZoNXRKTDNweFQyakRQdmYtd2ZSbGhVa2hCVldiZDdDQXp3MGNGRlAtSUY2OWtya0NaVU9vRE1TNVd1SXVWc0ZjenBrTDhtZEJ4SEstTEFBSGU0OG5pRGY2R0ZxY2hzbU54QnJLcGgyQ1BkRzJSMmtxQ1haV3lhanFwT1NtLXdJ?oc=5\" target=\"_blank\">Washington Post investigating cyberattack on journalists' email accounts, source says</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Reuters</font>"
    ],
    "image_url": "",
    "titles": [
      "Washington Post investigating cyberattack on journalists' email accounts, source says - Reuters"
    ],
    "summary": "The Washington Post is currently investigating a cyberattack targeted at the email accounts of its journalists, according to a source. This incident has prompted an internal examination to understand the extent and impact of the breach. The outcome or the specifics regarding who is responsible for the attack have not been disclosed yet.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story is somewhat constructive as it informs readers about a cyberattack on journalists, which is a matter of public interest. It provides some context about the incident, prompting readers to think about the security of their own digital communications. However, without information on the outcome of the investigation, potential solutions to prevent such attacks, or the broader implications of the incident, its constructiveness is limited.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.959,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.421
  },
  {
    "title": "USGS Reports 5.6 Magnitude Earthquake",
    "domain": "general",
    "location": "global",
    "published": "Sun, 15 Jun 2025 21:52:40 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "The ​​United States Geological Survey (USGS) says the earthquake registers a 5.6 magnitude."
    ],
    "image_url": "",
    "titles": [
      "At least one person killed, several injured, after earthquake hits Peru"
    ],
    "summary": "The United States Geological Survey (USGS) has reported that an earthquake with a magnitude of 5.6 occurred. This information provides a specific measurement of the earthquake's strength according to the USGS's monitoring and reporting systems.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about an earthquake event, but it does not offer any deep insights, context, or actionable information for the reader. It does not discuss the impacts, potential safety measures, or any efforts to mitigate the effects of such events.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.954,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.383
  },
  {
    "title": "Starmer Launches Inquiry into Grooming Gangs, NCA to Reopen Cases",
    "domain": "general",
    "location": "global",
    "published": "Sun, 15 Jun 2025 21:30:57 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "<p>New probe and statutory public inquiry will be a means to get ‘truth and justice’, home secretary says</p><p>Keir Starmer has launched a sweeping national operation to investigate grooming gangs and a statutory inquiry into institutional failure, marking a significant reversal after months of pressure on Labour to act.</p><p>The National Crime Agency (NCA), the UK’s top investigative body, has been tasked with leading a coordinated national push to reopen historic group-based child sexual abuse cases and identify offenders who slipped through the cracks of previous police efforts.</p> <a...",
      "<p>PM forced to cave in to clamour for statutory inquiry despite earlier dismissing them as amplifying far right demands</p><p>The news emerged in a notably low-key way: a speculative question to Keir Starmer during his Q&amp;A with reporters on the way to the G7 summit in Canada. Yes, he said, speaking carefully while wedged in the aisle of the cramped jet, there would be <a href=\"https://www.theguardian.com/politics/2025/jun/14/keir-starmer-national-inquiry-grooming-gangs\">a full statutory inquiry into grooming gangs</a>.</p><p>This was, it should be remembered, not just one of the most..."
    ],
    "image_url": "https://i.guim.co.uk/img/media/59625ad8831a5fbfdb307d6e10134b2de190be34/448_0_4478_3583/master/4478.jpg?width=140&quality=85&auto=format&fit=max&s=fafbd137b9671df56449ab4c0d80c0e3",
    "titles": [
      "Keir Starmer bows to pressure to launch new grooming gangs investigation",
      "Keir Starmer makes deft U-turn mid-air over grooming gangs inquiry"
    ],
    "summary": "Keir Starmer has initiated a national operation to investigate grooming gangs and a statutory inquiry into institutional failures, responding to pressure on Labour. The National Crime Agency (NCA) is tasked with reopening historic cases of group-based child sexual abuse. This move marks a significant policy shift and aims to address offenders who were previously overlooked. The decision for a statutory inquiry, which was initially resisted, came after public demand and was confirmed by Starmer en route to the G7 summit in Canada.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is very constructive. It informs readers about a significant policy shift and a proactive approach to address a serious social issue. It highlights the progress made in response to public demand and provides an understanding of the institutional changes being made to address the problem.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.947,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.441
  },
  {
    "title": "Greek Guard Neoklis Avdalas Withdraws from 2025 NBA Draft",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 15 Jun 2025 23:52:40 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Greek guard Neoklis Avdalas reportedly withdrew from the 2025 NBA draft ahead of the deadline on Sunday at 5 p.m. EDT."
    ],
    "image_url": "",
    "titles": [
      "Greek guard Neoklis Avdalas makes decision on 2025 NBA draft before deadline"
    ],
    "summary": "Greek guard Neoklis Avdalas withdrew from the 2025 NBA draft before the deadline on Sunday at 5 p.m. EDT. This decision means Avdalas will not be entering the NBA through the draft process this year.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about a specific event in the sports world, but it lacks depth or insight. It does not provide any context about the implications of this decision for the player or the NBA, nor does it offer any understanding of the draft process or how it impacts the sport.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.995,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.391
  },
  {
    "title": "Bills Unlikely to Pay James Cook Top RB Salary Despite Potential Milestone",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 15 Jun 2025 23:46:17 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "James Cook may be a 1,000-yard runner, but there's one key reason why the Buffalo Bills won't pay him among the best at his position."
    ],
    "image_url": "",
    "titles": [
      "Bills May Have One Key Reason to Not Pay Disgruntled James Cook"
    ],
    "summary": "James Cook, despite potentially achieving a 1,000-yard running season, is not expected to be paid among the top players in his position by the Buffalo Bills. This decision is attributed to a specific, undisclosed reason related to team strategy or financial considerations.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the Buffalo Bills' decision not to pay James Cook a top salary, even though he may reach a significant milestone. However, it lacks depth as it doesn't provide the specific reason behind this decision, which could have added more value to the reader's understanding.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.993,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.42
  },
  {
    "title": "Rising Stars Kaluma in NBA, Desnoyers in NHL Draw Pre-Draft Buzz",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 15 Jun 2025 23:45:22 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "NHL",
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "As NBA teams begin to finalize their draft boards, Arthur Kaluma is becoming a popular name.",
      "<a href=\"https://news.google.com/rss/articles/CBMiqAFBVV95cUxNaUdIQnUybFZQOWNlSVNkSE9vNXU1RnZUdW1LbHcwYWVQUkk5TDllRXNDbWdQLWVOMmVRVzlPWFRfX3hZS0xXQWFQVlhwRk9tWjk2Z3lWQ1hzU1pXRlFmWWoydTBhVHJtVERqdXY3SnhtUndudVdhQWVsZks4UkViYzdRLUFndE9UN2pROFNDZ3NWcXRPQkVneU4ya3lYNENrdDZ2Um1Kcmg?oc=5\" target=\"_blank\">Desnoyers drawing comparisons to Bergeron, Toews ahead of 2025 NHL Draft</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">NHL.com</font>",
      "<a href=\"https://news.google.com/rss/articles/CBMiaEFVX3lxTE0xWmo1YVRTTVdnODJVQ255ekVpcFBHREVVRTVVSWZuQjVyTkhfNVF4aXdhX2VYSGh4eUQwdWpRYTVCYV85MXJfYnBvWDlEaEtPcHZYMFYzck5JdnFyUHJjZ3V4TjEteFVq?oc=5\" target=\"_blank\">2025 NHL Draft: Top 10 centers</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">NHL.com</font>",
      "<a href=\"https://news.google.com/rss/articles/CBMiggFBVV95cUxPQ1MwNUJTS3RNMVFVSzhtMktsRV9jX3JpOUlMZTVfWkhXdnc4c0RVZmNIU0pSeTZ4TFRzMXRwQTZLbVFpdWtoUzl5WDViVC0zSW8zVEhjSjZnUC1VY19YaTJWTW90MThycnBYLTd4VEgyT0F2UFd4TFZiRy1jMVhzRDNB?oc=5\" target=\"_blank\">Martin preparing for 2025 NHL Draft, later career on family’s dairy farm</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">NHL.com</font>"
    ],
    "image_url": "",
    "titles": [
      "Former Longhorn Arthur Kaluma drawing interest ahead of the NBA Draft",
      "Desnoyers drawing comparisons to Bergeron, Toews ahead of 2025 NHL Draft - NHL.com",
      "2025 NHL Draft: Top 10 centers - NHL.com",
      "Martin preparing for 2025 NHL Draft, later career on family’s dairy farm - NHL.com"
    ],
    "summary": "As NBA teams finalize their draft boards, Arthur Kaluma is gaining attention. Meanwhile, in NHL news, Desnoyers is being compared to Bergeron and Toews as the 2025 NHL Draft approaches. NHL.com also highlights the top 10 centers for the 2025 NHL Draft and shares the story of Martin, who is preparing for his draft and future career on his family's dairy farm. These developments indicate a growing interest and analysis in upcoming talents in both the NBA and NHL arenas.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story clearly highlights progress in the careers of Arthur Kaluma and Desnoyers, providing the reader with empowering knowledge about these rising stars. It also provides useful context about the upcoming NBA and NHL drafts, contributing to the reader's understanding of these events.",
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.992,
      "consensus": 0.632,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.706
  },
  {
    "title": "Mayfield's Career Falls Short of Hall of Fame Expectations Since NFL Draft",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 15 Jun 2025 23:45:04 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Tampa Bay Buccaneers quarterback Baker Mayfield hasn't had the Hall of Fame career that he had hoped for a a Heisman Trophy winner and first overall draft pick in the NFL."
    ],
    "image_url": "",
    "titles": [
      "Buccaneers QB Baker Mayfield Victim of Most Dropped Passes"
    ],
    "summary": "Baker Mayfield, the Tampa Bay Buccaneers quarterback and former Heisman Trophy winner, has not achieved the Hall of Fame career expected of him since being the first overall pick in the NFL draft.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "While the story provides basic awareness about Baker Mayfield's career trajectory, it lacks depth and insight. It doesn't offer any reasons or analysis for why Mayfield's career has not met expectations, nor does it provide any actionable insights for the reader.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.992,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.41
  },
  {
    "title": "Hamilton's Race in Canadian Grand Prix Affected by Groundhog Collision",
    "domain": "sports",
    "location": "global",
    "published": "Sun, 15 Jun 2025 23:45:00 BST",
    "source": "Sky Sports",
    "sources": [
      "Sky Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Lewis Hamilton has revealed he hit a groundhog during the Canadian Grand Prix which affected his performance."
    ],
    "image_url": "https://e0.365dm.com/25/06/1920x1080/skysports-f1-lewis-hamilton_6943155.jpg?20250615232626",
    "titles": [
      "'Devastated' Hamilton reveals he hit groundhog during Canadian GP"
    ],
    "summary": "Lewis Hamilton disclosed that his performance in the Canadian Grand Prix was impacted after colliding with a groundhog during the race. This incident had a direct effect on his outcome in the competition.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "The story provides basic awareness about an event that occurred during the Canadian Grand Prix. However, it does not offer much depth or insight into how the event could be prevented in the future or the broader implications of wildlife on racing tracks.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.992,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.39
  },
  {
    "title": "Chargers Wrap Up Mandatory Minicamp After Three Days of Practice",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 15 Jun 2025 23:44:13 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Mandatory minicamp concluded, and there are several things to note from the three days of practice for the Chargers."
    ],
    "image_url": "",
    "titles": [
      "5 takeaways from Chargers mandatory minicamp"
    ],
    "summary": "The Chargers completed their mandatory minicamp, marking the end of three days of practice sessions. While the summary doesn't specify particular details, outcomes, or notable events from the minicamp, it indicates that there were several points of interest or developments during this period. The team has now moved past this phase of their preseason preparations.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers minimal depth or insight. It informs readers that the Chargers have completed their mandatory minicamp, but it lacks details about the outcomes, learnings, or any improvements made during the camp, which could have been useful to the readers.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.992,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.39
  },
  {
    "title": "Joe Mazzulla Recognized During NBA Finals",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 15 Jun 2025 23:39:08 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Boston Celtics head coach Joe Mazzulla was shouted out during the NBA Finals."
    ],
    "image_url": "",
    "titles": [
      "Celtics’ Joe Mazzulla Named in Report During NBA Finals"
    ],
    "summary": "Boston Celtics head coach Joe Mazzulla received a shout-out during the NBA Finals, highlighting his recognition in the league. This event underscores Mazzulla's visibility and significance within the basketball community, especially during such a crucial series in the sport.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story provides basic awareness about Joe Mazzulla's recognition during the NBA Finals. However, it does not provide much depth or insight into his contributions or the significance of this recognition, which could have been empowering knowledge for the readers.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.99,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.41
  },
  {
    "title": "Ernie Els Surprises Adam Scott at Oakmont, Boosts Spirits",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 15 Jun 2025 23:38:23 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Unexpected Els visit energizes Scott at Oakmont."
    ],
    "image_url": "",
    "titles": [
      "Adam Scott’s Special Guest at US Open Grabs Attention"
    ],
    "summary": "Ernie Els made a surprise visit to Oakmont, which significantly boosted Adam Scott's spirits. This unexpected encounter occurred during a significant event, although the specific details of the event were not provided. Els's presence at Oakmont is notable, considering his stature in the golfing world. The outcome of this visit was a positive impact on Adam Scott, highlighting the importance of camaraderie and support among professional golfers.",
    "constructiveness_score": 0.4,
    "constructiveness_reason": "This story provides basic awareness about an event in the golfing world. However, it lacks depth and actionable insights. It does not provide any significant understanding, decision-making help, or sense of agency to the reader.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.99,
      "consensus": 0.393,
      "constructiveness": 0.4,
      "proximity": 0.5
    },
    "score": 0.4
  },
  {
    "title": "China's Consumer Spending Stalls Amid Economic Uncertainties",
    "domain": "business",
    "location": "national",
    "published": "Sun, 15 Jun 2025 23:17:13 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "China's consumer spending shows little sign of picking up soon, given uncertainty about future wealth, changing preferences and lack of a social safety net."
    ],
    "image_url": "",
    "titles": [
      "Why aren’t Chinese consumers spending enough"
    ],
    "summary": "China's consumer spending is unlikely to increase in the near future due to concerns over future wealth, shifting consumer preferences, and the absence of a comprehensive social safety net. This indicates a cautious attitude among Chinese consumers towards spending amidst economic uncertainties.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful information about China's economic situation and consumer behavior, which can be important for decision-making in related fields. However, it does not report on solutions or improvements, limiting its score.",
    "score_components": {
      "magnitude": 0.079,
      "recency": 0.983,
      "consensus": 0.393,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.443
  },
  {
    "title": "Infrastructure Repair Program Targets Bridges, Tunnels for Enhanced Safety",
    "domain": "business",
    "location": "global",
    "published": "Sun, 15 Jun 2025 23:01:10 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Strategy will start with programme to repair crumbling bridges, flyovers and tunnels"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Fff5b043e-3a8e-4b63-a117-aa392aaa7be5.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Reeves to set out 10-year UK infrastructure plan"
    ],
    "summary": "The strategy focuses on initiating a program dedicated to the repair of deteriorating infrastructure, specifically targeting bridges, flyovers, and tunnels. This approach marks the beginning of efforts to enhance and secure critical transport routes.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story clearly highlights a solution to a problem, which is the deterioration of infrastructure. It provides useful information about the new program, which can contribute to the reader's understanding and decision-making, especially for those involved in related fields.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.977,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.454
  },
  {
    "title": "NHS App Expansion Part of 10-Year Health Service Plan",
    "domain": "business",
    "location": "global",
    "published": "Sun, 15 Jun 2025 23:01:10 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Expansion of NHS app comes as part of government’s 10-year plan for health service"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Fa52cd3e6-ab83-4eb2-9ab5-dd37c7f1f5ae.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "UK patients to gain direct access to clinical trials, says Streeting"
    ],
    "summary": "The NHS app is set to expand as part of the government's 10-year plan for the health service. This development aims to enhance healthcare accessibility and efficiency, aligning with long-term goals to improve patient care and service delivery within the NHS framework.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it provides useful information about a long-term plan to improve healthcare service delivery. It highlights progress and innovation in the health sector, which can empower readers with knowledge about future changes in healthcare accessibility.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.977,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.447
  },
  {
    "title": "Israeli PM Suggests Regime Change in Tehran as Possible Outcome",
    "domain": "business",
    "location": "global",
    "published": "Sun, 15 Jun 2025 21:54:43 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Israeli premier said regime change in Tehran could “certainly be the result” of Israel’s attacks"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F82a504a0-fe76-456d-96bf-fdd1d9d9ada6.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Netanyahu says ‘we’ll do what we need to do’ with Iran’s leader"
    ],
    "summary": "The Israeli Prime Minister stated that regime change in Tehran might be a potential outcome following Israel's military actions. This comment highlights the possible strategic implications of Israel's operations in the region.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story offers a deeper understanding of the potential political implications of Israel's military actions. However, it doesn't provide actionable insights or report on solutions, but it does increase clarity around a significant geopolitical issue.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.955,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.42
  },
  {
    "title": "Topuria to Fight Oliveira for UFC Lightweight Title at UFC 317",
    "domain": "business",
    "location": "global",
    "published": "Sun, 15 Jun 2025 19:02:01 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "We look at the history of the beef between Ilia Topuria and Paddy Pimblett. Topuria fights Charles Oliveira in the main event of UFC 317 for the UFC lightweight title"
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/683b889312aff49e44cb566b/0x0.jpg?width=960",
    "titles": [
      "Ilia Topuria Wants To Fight Paddy Pimblett: “I Hate Him”"
    ],
    "summary": "Ilia Topuria and Paddy Pimblett have a notable rivalry in the UFC, stemming from their history in the sport. Currently, Topuria is set to fight Charles Oliveira in the main event of UFC 317 for the UFC lightweight title. This matchup highlights Topuria's advancement in the UFC, moving beyond his beef with Pimblett to compete for a championship.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about an upcoming sports event. It doesn't offer much depth or insight beyond the event itself, nor does it highlight progress or solutions in a broader context. However, it may be useful for UFC fans planning to follow the event.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.978,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.407
  },
  {
    "title": "Commentator Stranded in Israel Amid War With Iran, Reports Explosions",
    "domain": "business",
    "location": "global",
    "published": "Sun, 15 Jun 2025 18:52:14 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "The conservative commentator describes being stranded in Israel as war erupts with Iran. \"Booming in distance. Right above me.\""
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/684f488b07cba904691b70be/0x0.jpg?width=960",
    "titles": [
      "CNN’s Scott Jennings Shares Tense Firsthand Account From Israel"
    ],
    "summary": "A conservative commentator reported being stranded in Israel amid the outbreak of war with Iran, sharing experiences of hearing explosions. The situation underscores the immediate impacts of the conflict on individuals in the affected areas.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "While this story provides basic awareness of the conflict between Israel and Iran, it lacks depth and insight. It does not provide actionable insights or deeper understanding of the situation, nor does it report on any solutions or attempts to solve the problem. The story is primarily reactive and sensational.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.974,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.394
  },
  {
    "title": "Today's NYT Mini Crossword Hints and Answers Released",
    "domain": "business",
    "location": "global",
    "published": "Sun, 15 Jun 2025 18:28:54 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Looking for help with today's NYT Mini Crossword puzzle? Here are some hints and answers for the puzzle."
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/66ad93159698a3280d18584c/0x0.jpg?width=960",
    "titles": [
      "Today’s NYT Mini Crossword Clues And Answers For Monday, June 16th"
    ],
    "summary": "Hints and answers for today's New York Times Mini Crossword puzzle have been made available for those seeking assistance. This resource aims to guide players through the challenges of the puzzle, offering them the opportunity to complete it with the provided clues and solutions.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story is useful for readers who are interested in the NYT Mini Crossword, providing actionable insights and assistance. However, it does not report on progress, solutions, improvements, or innovations, nor does it increase clarity around systems, causes, trends, or impacts that matter.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.966,
      "consensus": 0.393,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.425
  },
  {
    "title": "Carrie-Anne Moss Compares Schwarzenegger and Reeves in Film Dedication",
    "domain": "business",
    "location": "global",
    "published": "Sun, 15 Jun 2025 18:14:03 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Netflix’s \"FUBAR\" Season 2 and \"The Matrix\" star Carrie-Anne Moss discusses how Arnold Schwarzenegger and Keanu Reeves are similar."
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/684f3d20974b610adfd9a374/0x0.jpg?width=960",
    "titles": [
      "Carrie-Anne Moss: How Arnold Schwarzenegger, Keanu Reeves Are Alike"
    ],
    "summary": "Carrie-Anne Moss, known for her role in \"The Matrix,\" discussed the similarities between Arnold Schwarzenegger and Keanu Reeves in the context of Netflix's \"FUBAR\" Season 2. She highlighted their professional dedication and impactful presence in the film industry. Moss' insights were shared amid her involvement in the Netflix series, illustrating the respect and admiration she holds for both actors.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides some insight into the professional dedication of two well-known actors, potentially deepening readers' understanding of their work in the film industry. However, it does not provide actionable insights, report on progress or solutions, or increase clarity around systems, causes, trends, or impacts that matter.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.961,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.404
  },
  {
    "title": "New Material Shifts From Insulator to Semiconductor, Innovates Electronics",
    "domain": "science",
    "location": "global",
    "published": "Sun, 15 Jun 2025 21:40:14 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/new-material-breaks-the-rules-scientists-turn-insulator-into-a-semiconductor/\" rel=\"nofollow\" title=\"New Material Breaks the Rules: Scientists Turn Insulator Into a Semiconductor\"><img alt=\"Silicone Copolymers Tubes\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"488\" src=\"https://scitechdaily.com/images/Silicone-Copolymers-Tubes-777x488.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>Once considered merely insulating, a change in the angle between silicon and oxygen atoms opens a pathway for electrical charge to flow. A..."
    ],
    "image_url": "",
    "titles": [
      "New Material Breaks the Rules: Scientists Turn Insulator Into a Semiconductor"
    ],
    "summary": "Scientists have developed a new material that transitions from an insulator to a semiconductor. By altering the angle between silicon and oxygen atoms within the material, they enabled a pathway for electrical charge to flow, challenging previous understandings of the material's properties. This breakthrough could have significant implications for electronic device manufacturing and material science.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it reports on a significant innovation in material science and electronics. It provides a deeper understanding of the material's properties and its potential implications for electronic device manufacturing, thereby offering actionable insights for those in the field.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.95,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.442
  },
  {
    "title": "AI and Radiocarbon Dating Show Dead Sea Scrolls Older Than Thought",
    "domain": "science",
    "location": "global",
    "published": "Sun, 15 Jun 2025 21:15:11 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/new-ai-model-reveals-biblical-dead-sea-scrolls-are-far-older-than-we-thought/\" rel=\"nofollow\" title=\"New AI Model Reveals Biblical Dead Sea Scrolls Are Far Older Than We Thought\"><img alt=\"Dead Sea Scroll Number 28a\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"648\" src=\"https://scitechdaily.com/images/Dead-Sea-Scroll-Number-28a-777x648.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>Using artificial intelligence and radiocarbon dating to determine the age of ancient manuscripts. Since their discovery, the Dead Sea..."
    ],
    "image_url": "",
    "titles": [
      "New AI Model Reveals Biblical Dead Sea Scrolls Are Far Older Than We Thought"
    ],
    "summary": "A new AI model, combined with radiocarbon dating, has revealed that the Dead Sea Scrolls, ancient biblical manuscripts discovered in the mid-20th century, are significantly older than previously thought. This breakthrough in research provides a deeper understanding of the scrolls' historical context and origins.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it uses AI and radiocarbon dating to provide a deeper understanding of the historical context and origins of the Dead Sea Scrolls. However, while it increases awareness, it does not clearly highlight solutions or empowering knowledge, hence the score is not 1.0.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.942,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.437
  },
  {
    "title": "Australian Fossil Tracks May Rewrite History of Land Life Evolution",
    "domain": "science",
    "location": "global",
    "published": "Sun, 15 Jun 2025 20:50:31 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/shocking-scientists-ancient-fossil-tracks-could-rewrite-the-history-of-life-on-land/\" rel=\"nofollow\" title=\"Shocking Scientists: Ancient Fossil Tracks Could Rewrite the History of Life on Land\"><img alt=\"Annotated Fossil Slab From Australia Showing Two Trackways With Labeled Manus and Pes Prints and Interpreted Movement Paths\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"728\" src=\"https://scitechdaily.com/images/Annotated-Fossil-Slab-From-Australia-Showing-Two-Trackways-With-Labeled-Manus-and-Pes-Prints-and-Interpreted-Movement-Paths-777x728.jpg\"..."
    ],
    "image_url": "",
    "titles": [
      "Shocking Scientists: Ancient Fossil Tracks Could Rewrite the History of Life on Land"
    ],
    "summary": "Scientists have discovered ancient fossil tracks in Australia that may significantly alter our understanding of the history of life on land. These tracks, which include detailed footprints of both hands (manus) and feet (pes), suggest that complex, multi-limbed organisms were moving across land much earlier than previously believed. This finding challenges existing theories about the timeline of life's evolution on Earth and could lead to a revision of the scientific narrative regarding the emergence of terrestrial life forms.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive as it reports on a discovery that could significantly alter our understanding of the history of life on land. It provides a deeper understanding of the timeline of life's evolution on Earth and potentially leads to a revision of the scientific narrative regarding the emergence of terrestrial life forms. This contributes meaningfully to the reader’s understanding and decision-making in the field of paleontology.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.934,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.439
  },
  {
    "title": "NASA's PUNCH Mission Captures 3D Solar Storm with Four Satellites",
    "domain": "science",
    "location": "global",
    "published": "Sun, 15 Jun 2025 15:58:14 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/watch-a-massive-solar-storm-unfold-in-3d-captured-by-nasas-punch-mission/\" rel=\"nofollow\" title=\"Watch a Massive Solar Storm Unfold in 3D – Captured by NASA’s PUNCH Mission\"><img alt=\"Solar Activity PUNCH Narrow Field Imager\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"583\" src=\"https://scitechdaily.com/images/Solar-Activity-PUNCH-Narrow-Field-Imager-777x583.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>NASA&#8217;s PUNCH mission, unveiled at an astronomical meeting, uses a four-satellite system to deliver stunning..."
    ],
    "image_url": "",
    "titles": [
      "Watch a Massive Solar Storm Unfold in 3D – Captured by NASA’s PUNCH Mission"
    ],
    "summary": "NASA's PUNCH mission has successfully captured a massive solar storm in 3D using a four-satellite system. This technological feat, unveiled at an astronomical meeting, provides unprecedented views of solar activities, enhancing our understanding of solar storms and their impact on space weather forecasting.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it reports on a significant technological achievement by NASA that enhances our understanding of solar storms and their impacts. This knowledge could potentially be useful in improving space weather forecasting, thereby contributing to the reader's understanding and awareness of the topic.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.844,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.421
  },
  {
    "title": "Astronomers Discover 11 Billion-Year-Old Black Hole Jet",
    "domain": "science",
    "location": "global",
    "published": "Sun, 15 Jun 2025 15:33:10 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/nasa-detects-11-billion-year-old-black-hole-jet-lit-by-the-big-bang/\" rel=\"nofollow\" title=\"NASA Detects 11-Billion-Year-Old Black Hole Jet Lit by the Big Bang\"><img alt=\"Strong Black Hole Jet\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Strong-Black-Hole-Jet-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>Astronomers have found a remarkably powerful jet shooting out from a black hole that formed just 3 billion years after the Big Bang. This jet is so distant that it..."
    ],
    "image_url": "",
    "titles": [
      "NASA Detects 11-Billion-Year-Old Black Hole Jet Lit by the Big Bang"
    ],
    "summary": "Astronomers have discovered a powerful jet emanating from a black hole that was formed approximately 3 billion years after the Big Bang, making it around 11 billion years old. This significant finding helps scientists understand more about the early universe and the behavior of black holes soon after the Big Bang.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The story provides useful information about a significant discovery related to black holes and the early universe. It contributes to the reader's understanding of these complex astronomical phenomena. However, it does not explicitly report on solutions or improvements, which prevents it from scoring higher.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.836,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.409
  },
  {
    "title": "Nice Hosts Global Ocean Science and Policy Summit",
    "domain": "science",
    "location": "global",
    "published": "Sun, 15 Jun 2025 15:20:01 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "For the past fortnight, the city of Nice in France has been the global epicenter of ocean science and politics."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/new-zealand-shoreline.jpg",
    "titles": [
      "NZ has a vast sea territory but lags behind other nations in protecting the ocean"
    ],
    "summary": "Over the past two weeks, Nice, France, has served as the worldwide focal point for discussions and developments in ocean science and politics. This gathering has brought together leading experts and policymakers to address crucial marine issues.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it raises awareness about a global event focused on important marine issues. It provides useful information about the summit and its purpose, contributing to the reader's understanding of current developments in ocean science and politics. However, it lacks specific details about the solutions or innovations discussed at the summit, which prevents it from scoring higher.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.905,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.423
  },
  {
    "title": "Hubble Finds Uranus Moons Unusually Dark on One Side, Puzzling Astronomers",
    "domain": "science",
    "location": "global",
    "published": "Sun, 15 Jun 2025 15:08:11 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/hubbles-dusty-surprise-why-uranus-moons-are-darker-on-the-wrong-side/\" rel=\"nofollow\" title=\"Hubble’s Dusty Surprise: Why Uranus’ Moons Are Darker on the “Wrong” Side\"><img alt=\"Two Faces of Uranus (Hubble)\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"437\" src=\"https://scitechdaily.com/images/Two-Faces-of-Uranus-Hubble-777x437.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>New surface data from largest Uranian moons are contrary to expectations. Astronomers using NASA’s Hubble Space Telescope set out to study how..."
    ],
    "image_url": "",
    "titles": [
      "Hubble’s Dusty Surprise: Why Uranus’ Moons Are Darker on the “Wrong” Side"
    ],
    "summary": "Astronomers using NASA's Hubble Space Telescope discovered that the largest moons of Uranus are darker on one side, a finding that contradicts previous expectations. This observation suggests that the moons' surfaces are being affected by a process not fully understood, challenging existing theories about their composition and the environment surrounding Uranus.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story raises awareness about a new discovery related to the moons of Uranus, contributing to the reader's understanding of the topic. However, it does not provide actionable insights or report on solutions to the puzzle. It mainly presents a new question in the field of astronomy, rather than providing answers or progress towards them.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.829,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.388
  },
  {
    "title": "UCLA Engineers Develop Universal Framework for 3D Optical Imaging Enhancement",
    "domain": "science",
    "location": "global",
    "published": "Sun, 15 Jun 2025 11:40:08 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Engineers at the UCLA Samueli School of Engineering have introduced a universal framework for point spread function (PSF) engineering, enabling the synthesis of arbitrary, spatially varying 3D PSFs using diffractive optical processors. The research is published in the journal Light: Science & Applications."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/universal-programming.jpg",
    "titles": [
      "Universal framework enables custom 3D point spread functions for advanced imaging"
    ],
    "summary": "Engineers at UCLA Samueli School of Engineering developed a universal framework for engineering point spread functions (PSFs), allowing for the creation of arbitrary 3D PSFs with spatial variation through diffractive optical processors. This advancement, detailed in the journal Light: Science & Applications, could significantly impact various optical imaging applications by improving the manipulation and customization of light propagation.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive as it reports on an innovative solution developed by engineers that could improve various optical imaging applications. It provides useful insight into the advancement of 3D optical imaging technology, highlighting progress and innovation.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.838,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.419
  }
]