[
  {
    "title": "White House Memo: Furloughed Workers May Need New Law for Back Pay",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Tue, 07 Oct 2025 13:16:25 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "The Guardian",
      "Forbes",
      "Axios",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "www.forbes.com",
      "www.npr.org",
      "news.google.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "A new draft White House memo suggests a 2019 law signed by President Trump that guarantees federal employees get paid after a shutdown ends would not apply to furloughed workers.",
      "<a href=\"https://news.google.com/rss/articles/CBMihAFBVV95cUxQeTdNcElLQ2hOX1pDXzdzZktyX2t2M2lheUM5YlMxZ0sxODRybHJWMXpaeW1OU3EzbWp4ZFRhYjcwV0lYY1lsTkhDdEtpeGx3Z2FTM3RJMUpPRUJ0MTZsYVlJMUtxU2pucWlLbXBtY1NPRWNDODZjNDlkdXZjd1hxUWRYRjQ?oc=5\" target=\"_blank\">Scoop: White House memo says furloughed federal ",
      "<a href=\"https://news.google.com/rss/articles/CBMiiAFBVV95cUxPUS1lYl9GYkRZTWZLaTRhZ0dCMjg1SGJXUUpzdVpoUzdCTjB6VFpuUmpEX2lLMF82N0xtdURXZFY1aUtnZmZQN2FhWUc4ZjY1UWRsNldxaDJ3ZW9VZHJyU2xOeHFVUHliZXJ3OE1zY00tOVRjY1J5cnp6aWRObXhXakY3RFhwQktj?oc=5\" target=\"_blank\">Congress erupts over \"lawless\" Trump threat",
      "<p>OMB argues an amendment to a 2019 act would not guarantee furloughed workers post-shutdown pay</p><p>The White House’s office of management and budget (OMB) is arguing that federal workers who are furloughed amid the ongoing government shutdown are not entitled to back pay.</p><p>In a draft memo ",
      "The government shutdown began at midnight on Wednesday as Democrats and Republicans appeared to be nowhere close to reaching a funding deal.",
      "As the federal shutdown stretches on, furloughed federal workers face the threat of not receiving back pay, despite a 2019 law that requires it."
    ],
    "image_url": "",
    "titles": [
      "White House floats no back pay for some furloughed federal workers despite 2019 law",
      "Scoop: White House memo says furloughed federal workers aren't entitled to back pay - Axios",
      "Congress erupts over \"lawless\" Trump threat not to pay back furloughed federal workers - Axios",
      "White House says furloughed federal workers not entitled to back pay amid shutdown",
      "Government Shutdown: White House Considers Not Paying Furloughed Federal Workers Once Government Reopens",
      "Furloughed federal workers face threat of no back pay from shutdown, despite 2019 law requiring it"
    ],
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.939,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.842,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A draft memo from the White House indicates that furloughed federal employees may not automatically receive back pay for the period they were not working. It suggests that new legislation from Congress would be required to authorize such payments.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Bengals Trade for QB Joe Flacco from Browns to Boost Offense",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 7 Oct 2025 15:48:03 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet",
      "Sports Illustrated",
      "CBS Sports"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com",
      "www.sportsnet.ca",
      "news.google.com"
    ],
    "snippets": [
      "The Bengals turned to their division rivals for a much-needed solution at quarterback, acquiring Joe Flacco in a trade with the Browns.",
      "Cleveland's deal with Cincinnati impacts the rookie quarterback in a few ways",
      "The Bengals are hoping to inject life into what's been an inept offense",
      "<a href=\"https://news.google.com/rss/articles/CBMihAFBVV95cUxQWE9GRl93d3E1ZjFtVnUwQ1JDS2t3cnBOSk5MX2V5Z0cxUGlXYThHcnBVYktzT2phRzJLTml1THlldXdrc2c0UFktcWhEeldleEFLWG13RWtoU1FlY0RFOFdvNUthX19QdFNQVFFFZ1VGeDdpX2lyRDR1S2JFUUJWUXA2YlQ?oc=5\" target=\"_blank\">Browns to Trade Joe Flacco to Quarterback-Needy ",
      "<p>The Cincinnati Bengals are adding a veteran option at quarterback.</p>"
    ],
    "image_url": "",
    "titles": [
      "QB-needy Bengals land Flacco in Browns trade",
      "How Browns' Joe Flacco trade to Bengals impacts Shedeur Sanders",
      "Browns trade Joe Flacco to Bengals: Cincinnati acquires veteran QB from division rival in late-round pick swap",
      "Browns to Trade Joe Flacco to Quarterback-Needy Bengals - Sports Illustrated",
      "Bengals acquire QB Joe Flacco in trade with Browns"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.99,
      "consensus": 0.908,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.822,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Cincinnati Bengals have traded with the Cleveland Browns to acquire veteran quarterback Joe Flacco, aiming to improve their struggling offense. This move is expected to impact the team's rookie quarterback and brings a seasoned player into the Bengals' lineup.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: improve",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "2025 Nobel Prize in Physics Awarded for Quantum Tech Advances",
    "domain": "science",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Tue, 07 Oct 2025 06:17:37 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "Deutsche Welle",
      "BBC",
      "New Scientist"
    ],
    "domains": [
      "www.dw.com",
      "www.npr.org",
      "www.bbc.com",
      "www.newscientist.com"
    ],
    "snippets": [
      "The Nobel committee said that the laureates' work provides opportunities to develop \"the next generation of quantum technology, including quantum cryptography, quantum computers, and quantum sensors.\"",
      "The announcement was made by the Royal Swedish Academy of Sciences in Stockholm.",
      "John Clarke, Michel Devoret and John Martinis have won the 2025 physics Nobel Prize for their work in quantum mechanics. It is the second Nobel Prize to be awarded this year.",
      "The 2025 Nobel prize in physics has gone to John Clarke, Michel Devoret and John Martinis, whose work has led to the development of today's quantum computers"
    ],
    "image_url": "",
    "titles": [
      "The Nobel Prize for physics is awarded for discoveries in quantum mechanical tunneling",
      "Physics Nobel awarded to three scientists for work on quantum computing",
      "Nobel Prize in physics goes to US-based trio for discoveries in quantum mechanics",
      "Nobel prize for physics goes to trio behind quantum computing chips"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.812,
      "consensus": 0.908,
      "constructiveness": 0.2,
      "proximity": 0.75
    },
    "score": 0.797,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "John Clarke, Michel Devoret, and John Martinis were awarded the 2025 Nobel Prize in Physics for their pioneering work in quantum mechanics, specifically advancing the development of quantum technology, including quantum computers, cryptography, and sensors. Their research has been crucial in demonstrating how quantum mechanics' properties can have practical applications in technology. The Royal Swedish Academy of Sciences in Stockholm announced the award, highlighting the trio's contributions as foundational to digital technology's future.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: development, research",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "McGregor Ineligible for UFC Till March 2026 After Missing Drug Tests",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Tue, 07 Oct 2025 19:27:46 +0000",
    "source": "CBS Sports",
    "sources": [
      "Yahoo Sports",
      "Sportsnet",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "www.independent.co.uk",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "McGregor's suspension ends before the UFC White House card next summer",
      "McGregor missed three drug tests in 2024 – on 13 June, 19 September, and 20 September",
      "<p>Conor McGregor will be ineligible to compete in any UFC event until March 2026.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/10/07/ff9d22ad-2969-4120-b359-f17f9897d8fb/conor-mcgregor-ufc-264-weigh-in-dustin-poirier-white-house-suspension-mma-news-today-cbs-sports-oct-7-2025.jpg",
    "titles": [
      "Conor McGregor suspended 18 months for UFC anti-doping violation",
      "Conor McGregor hit with 18-month UFC doping ban after whereabouts failures",
      "McGregor accepts 18-month UFC sanction for anti-doping violation"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.983,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.733,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Conor McGregor, after missing three drug tests in 2024 on June 13, September 19, and September 20, will be ineligible to compete in UFC events until March 2026, despite his suspension ending before the UFC White House card next summer.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Tesla Launches Cheaper Model Y and 3, Prices Start at $36,990",
    "domain": "business",
    "source_domain": "www.forbes.com",
    "location": "global",
    "published": "Tue, 07 Oct 2025 14:53:17 -0400",
    "source": "Forbes",
    "sources": [
      "MarketWatch",
      "TechCrunch",
      "Forbes"
    ],
    "domains": [
      "www.forbes.com",
      "techcrunch.com",
      "www.marketwatch.com"
    ],
    "snippets": [
      "Elon Musk has said his automaker would sell an affordable Model Y, as “people don’t have enough money in the bank account to buy it” despite high demand.",
      "Newly announced trims still hover closer to $40,000 than $30,000 — a price that many investors view as putting the vehicle within mass-market reach.",
      "The long-awaited cheaper Model 3 and Model Y are finally here, but they start at $36,990 and $39,990, respectively -- just a few thousand dollars less than Tesla's current offerings."
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/68e5615fc65d662612da386d/0x0.jpg?width=960&precrop=2343%2C1317%2Cx391%2Cy336",
    "titles": [
      "Tesla Unveils Cheaper Model Y And Model 3—Countering Tax Credit Loss",
      "Tesla just unveiled a cheaper Model Y and Model 3. Why the stock is falling.",
      "Tesla reveals slightly cheaper ‘standard’ versions of the Model 3 and Model Y"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.972,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.731,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Elon Musk announced Tesla will sell more affordable versions of the Model Y to meet high demand, acknowledging the current price is too high for many consumers. The cheaper trims of the Model Y and Model 3 are now available, starting at $39,990 and $36,990, respectively. These prices, while lower, remain closer to $40,000, slightly missing the mass-market target price of under $30,000 that investors hoped for.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Supreme Court Reviews State Power on Conversion Therapy Bans",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Tue, 07 Oct 2025 17:49:44 GMT",
    "source": "Axios",
    "sources": [
      "Forbes",
      "LA Times",
      "Axios"
    ],
    "domains": [
      "www.forbes.com",
      "www.latimes.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMie0FVX3lxTE9pUDdzNk1lRmdZU1J0bEZxU0thZXo5ZHh6Z0VsMHd0bU5feU9sTEtLN0RXRHRKSlFUTE9kU3lpb28tajRnQVlMZ3haVTJWOHIzZFE3T3NJUFpOaV9tcFY1SW9QTjIyb1pqV2JFZmpaQS1SV0wwZmFCcjJFYw?oc=5\" target=\"_blank\">Supreme Court seems skeptical of conversion therapy ban</a>&n",
      "<a href=\"https://news.google.com/rss/articles/CBMihwFBVV95cUxOeFV5Q0JvZFFfYmdGV1hpd0VWdTBhTXpQU3gwaVZyMWxVQ1A4ejVHc21fbFhnTVR3OFE1ZlVUOTcxakRVWHdqOVBlUnMzMUhBZzRoVzJEa1paWUhsRnRFa1BTMmtPXzZIbEprQ1M1WjdmYUVXZHBtakFWaG5zQTVRVDA1cE9mSHc?oc=5\" target=\"_blank\">Supreme Court weighs case on conversion ther",
      "<p>California and 20 other states that forbid licensed counselors to practice 'conversion therapy' face a free-speech challenge.</p>",
      "Justices expressed skepticism of Colorado's argument that it's allowed to regulate how therapists counsel their patients about their sexuality or gender identity."
    ],
    "image_url": "",
    "titles": [
      "Supreme Court seems skeptical of conversion therapy ban - Axios",
      "Supreme Court weighs case on conversion therapy for youth - Axios",
      "Supreme Court sees a free-speech problem with laws that ban 'conversion therapy' for minors",
      "Supreme Court Suggests It Could Limit Bans On LGBTQ Conversion Therapy—What To Know"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.931,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.723,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Supreme Court is reviewing a case that examines if states have the authority to regulate conversations between counselors and clients, specifically focusing on the legality of conversion therapy bans. This case has ignited a conflict between conservative Christian groups and the LGBTQ+ community, with significant implications for both freedom of speech and the rights of LGBTQ+ individuals. The outcome is pending.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Connor McDavid Signs $25M, 2-Year Deal with Oilers, Prioritizes Team Success",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Tue, 07 Oct 2025 19:55:01 +0000",
    "source": "Global News",
    "sources": [
      "Sportsnet",
      "Global News"
    ],
    "domains": [
      "globalnews.ca",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Connor McDavid says his new two-year, US$25 million contract extension with the Edmonton Oilers reflects his commitment to winning — not chasing top dollar.",
      "<p>NHL insider Elliotte Friedman joins Sportsnet&#8217;s Faizal Khamisa to discuss how the hockey world reacted to Connor McDavid&#8217;s two-year extension with the Edmonton Oilers.</p>"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/10/bf922094a1582139de958144026afe4fe7f92f62315046c506c978b352451b59.jpg?quality=65&strip=all",
    "titles": [
      "McDavid says new deal shows commitment to winning",
      "Friedman: McDavid’s ‘Crosby-esque’ discount shows commitment to winning"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.993,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.704,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Connor McDavid has signed a two-year, US$25 million contract extension with the Edmonton Oilers, emphasizing his dedication to pursuing team success over maximum salary. The hockey community's response to this decision was analyzed by NHL insider Elliotte Friedman on Sportsnet.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Warns of Job Losses Amid Shutdown; Back Pay Uncertain for Federal Workers",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Tue, 07 Oct 2025 17:39:58 GMT",
    "source": "CNBC",
    "sources": [
      "The Guardian",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Trump also said at the White House that if the shutdown drags on several days longer, a \"substantial\" number of jobs \"will never come back.\"",
      "<p>White House memo reported by several US media outlets reveals plan to not guarantee back pay for federal workers who are working through the shutdown</p><p>Before we turn our attention to Capitol Hill, we’re also keeping an eye on Illinois today. On Monday, a federal judge did not immediately blo"
    ],
    "image_url": "",
    "titles": [
      "Trump suggests not all furloughed workers will get back pay: 'It depends'",
      "Furloughed government workers may not be entitled to back pay, reports say, as Trump claims some jobs ‘will never come back’ – live"
    ],
    "score_components": {
      "magnitude": 0.795,
      "recency": 0.928,
      "consensus": 0.591,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.682,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Former President Trump warned that a prolonged government shutdown could result in a significant number of jobs not returning. Additionally, a White House memo, covered by multiple US media outlets, indicated plans to not guarantee back pay for federal workers laboring through the shutdown. Meanwhile, a federal judge in Illinois has yet to block these measures, leaving the situation unresolved as attention shifts to Capitol Hill for further developments.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: development, plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Bengals Acquire QB Joe Flacco from Browns to Boost Playoff Hopes",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 7 Oct 2025 15:58:24 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Yahoo Sports"
    ],
    "domains": [
      "www.espn.com",
      "www.sportingnews.com"
    ],
    "snippets": [
      "What Cincinnati's move for a 40-year-old QB means for its playoff hopes; how does Cleveland's QB chart change?",
      "The Bengals made a rare interdivision trade for former Browns and Ravens rival QB Joe Flacco. Here's what it means for the teams and other quarterbacks in the league."
    ],
    "image_url": "",
    "titles": [
      "Can Joe Flacco stop Bengals' slide? How does trade impact Dillon Gabriel, Shedeur Sanders?",
      "Joe Flacco trade winners and losers: Ja'Marr Chase, Shedeur Sanders headline impact of bizarre Browns-Bengals deal"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.994,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.679,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Cincinnati Bengals acquired 40-year-old quarterback Joe Flacco in an interdivision trade from the Browns, impacting both teams' quarterback rosters. This move is aimed at bolstering the Bengals' playoff aspirations by adding veteran experience to their lineup.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Rain Delays Game 3 of AL Division Series in Detroit; Naylor Returns",
    "domain": "sports",
    "source_domain": "www.sportingnews.com",
    "location": "national",
    "published": "Tue, 07 Oct 2025 19:40:00 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports",
      "Sportsnet"
    ],
    "domains": [
      "sports.yahoo.com",
      "www.sportingnews.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "With rain in the area, the pivotal Game 3 has been delayed.",
      "Game 3 of the AL Division Series between the Seattle Mariners and Detroit Tigers has been delayed by rain.  Detroit was set to host Seattle with a late-afternoon start Tuesday, but the infield was covered within an hour of the scheduled first pitch.  The Tigers and Mariners split the first two games",
      "<p>Seattle Mariners first baseman Josh Naylor is in the lineup for Game 3 of the AL Division Series against the Detroit Tigers after dealing with a personal matter.</p>"
    ],
    "image_url": "",
    "titles": [
      "Mariners vs. Tigers weather updates: Latest news on ALDS Game 3 rain delay",
      "Tigers-Mariners ALDS Game 3 delayed by rain",
      "Mariners’ Josh Naylor in lineup for Game 3 of ALDS vs. Tigers"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.988,
      "consensus": 0.611,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.665,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Game 3 of the AL Division Series between the Seattle Mariners and Detroit Tigers was delayed due to rain in Detroit. The teams, having split the first two games, were set for a late-afternoon start. Despite the delay, Seattle Mariners first baseman Josh Naylor is confirmed to be in the lineup for Game 3 after dealing with a personal matter.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "AltStore PAL Expands to Japan, Brazil, Australia; UK Launch Set for 2026",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-10-07T15:57:15-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge",
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com",
      "www.theverge.com"
    ],
    "snippets": [
      "AltStore PAL, which launched as one of the first alternative iOS app stores in the EU last year, is coming to more countries, developer Riley Testut announced today. “Specifically, we plan to launch in Japan, Brazil, and Australia before the end of the year, with the UK to follow in 2026,” Testut sa",
      "The alternative app marketplace AltStore has raised $6 million and launched a Mastodon server."
    ],
    "image_url": "",
    "titles": [
      "AltStore&#8217;s alternative iPhone app store is coming to more countries",
      "Alternative app store AltStore raises $6M, connects with the fediverse"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.993,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.664,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "AltStore PAL, an alternative iOS app store initially launched in the EU, is expanding to Japan, Brazil, and Australia by year's end, with a UK launch planned for 2026, as announced by developer Riley Testut. Additionally, AltStore has raised $6 million and launched a Mastodon server to support its growth.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "EU Plans to Double UK Steel Tariff, Matching Trump's Rates",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 07 Oct 2025 17:09:40 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "www.bbc.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "The EU is the destination for 78% of steel products made in the UK for overseas markets.",
      "<p>Starmer says UK in discussions with EU over Brussels plan to double import tariff to 50%, which unions warn could kill UK steel industry</p><p>The EU has announced it will match Donald Trump’s steel tariffs, doubling levies on imports to 50% in a decision condemned as “an existential threat” to t"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/6663/live/eca51250-a38e-11f0-96cf-a52f331e209a.jpg",
    "titles": [
      "EU steel tariff hike threatens 'biggest ever crisis' for UK industry",
      "EU plan to match Trump steel tariffs spurs ‘existential threat’ to UK steel industry"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.918,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.663,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The EU, receiving 78% of the UK's overseas steel exports, plans to double its import tariff to 50%, matching former US President Trump's rates. UK's Labour leader, Starmer, confirms discussions with the EU about this increase, which unions fear could devastate the UK steel industry.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump: Talks with Democrats Post-Shutdown; Asserts Authority in Portland Crackdo",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Tue, 07 Oct 2025 19:09:01 GMT",
    "source": "Axios",
    "sources": [
      "LA Times",
      "Axios"
    ],
    "domains": [
      "www.latimes.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMif0FVX3lxTFA2R0dDcjJMOFg1Mmk1bUl3V2ludFd5SUdadGNLYUJHc0JKSkZSM1dINmkxOEVJZ240RDU0aG9UOUhEdE42M0FfU01NOFVfMnFINGJxblA1NjVzc3dZZ0xlclg2T2pwQ0FnZEVkb3dUd0NYWEh4TkM1TlRCeVhyQ2c?oc=5\" target=\"_blank\">\"Insurrectionists\": Trump blasts Democrats over shutdown",
      "<p>Miller's rhetoric comes amid a federal crackdown on Portland, Ore., where he says the president has unchecked authority to protect federal lives and property.</p>"
    ],
    "image_url": "",
    "titles": [
      "\"Insurrectionists\": Trump blasts Democrats over shutdown, immigration - Axios",
      "Trump advisors amp up extreme rhetoric against Democrats during government shutdown, immigration raids"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.957,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.66,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "US President Donald Trump stated that discussions with Democrats would only begin after the shutdown ends, amidst a six-day gridlock. Concurrently, amid a federal crackdown in Portland, Oregon, Miller emphasized the president's authority to safeguard federal lives and property.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Mastodon Launches \"Packs\" for Easier User Discovery at FediForum",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-10-07T14:31:20-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge",
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com",
      "www.theverge.com"
    ],
    "snippets": [
      "Mastodon is introducing “Packs” to help you quickly find accounts to follow and fill up your feed. The decentralized social network announced the feature as part of the FediForum event on Tuesday. It will work similarly to Starter Packs on Bluesky, which offer curated lists of accounts you can follo",
      "Mastodon is planning to make it easier for newcomers to discover curated collections of users to follow by launching a new starter packs feature."
    ],
    "image_url": "",
    "titles": [
      "Mastodon snags Bluesky&#8217;s starter packs feature and includes the ability to opt out",
      "Mastodon is taking cues from Bluesky with plans for its own starter ‘Packs’"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.964,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.658,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Mastodon announced a new feature called \"Packs\" to simplify user discovery by offering curated collections of accounts to follow. This initiative, revealed at the FediForum event, aims to enhance the experience for newcomers, mirroring a similar approach by Bluesky with its Starter Packs.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: initiative",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Australia Intervenes, Secures Release of Seven Detained Sumud Flotilla Activists",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Tue, 07 Oct 2025 18:41:25 +0000",
    "source": "Al Jazeera",
    "sources": [
      "The Guardian",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "David Adler says Sumud Flotilla activists were &#039;kidnapped, stripped, zip-tied, blindfolded&#039; and sent to prison camp.",
      "<p>The group of seven held since Friday are released following Australian government representations</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/oct/08/australia-politics-live-gaza-rally-parliament-anthony-albanese-sussan-ley-question-time-andrew-hastie-ntwnfb\">Follow"
    ],
    "image_url": "",
    "titles": [
      "US activist from Gaza flotilla alleges ‘psychological torture’ by Israel",
      "Israel deports Australian Gaza flotilla activists to Jordan"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.968,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.656,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Seven Sumud Flotilla activists, detained since Friday and allegedly mistreated, were released after the Australian government intervened. David Adler claimed they were kidnapped, stripped, zip-tied, blindfolded, and sent to a prison camp before their release.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Amazon's Prime Big Deal Days Sale Offers Discounts on Top Tech",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-10-07T15:54:11-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge",
      "Ars Technica"
    ],
    "domains": [
      "arstechnica.com",
      "www.theverge.com"
    ],
    "snippets": [
      "Amazon’s October Prime Day sale (aka Prime Big Deal Days) is finally here, and we’ve collected the best deals we could find on everything from noise-canceling headphones and robot vacuums to 4K OLED TVs. The majority of our recommendations have been thoroughly tested by&#160;Verge&#160;writers and e",
      "The lead-up to Black Friday happens earlier each year, and nothing illustrates that trend more than the return of Amazon’s Prime Big Deal Days, which is well underway. The two-day event gives Prime members plenty of time to save on numerous products before it concludes Thursday, October 9th at 3AM E",
      "The second Amazon Prime Day sales event of the year is here, and once again it offers discounts on MacBooks, Windows laptops, and various PC accessories. Like previous Amazon Prime Big Deal Days, this sale runs for two days and requires a Prime membership to qualify for most discounts. Some sale pri",
      "We've got deals on keyboards, laptops, accessories, and all kinds of stuff!"
    ],
    "image_url": "",
    "titles": [
      "The 185 best October Prime Day deals",
      "The Verge&#8217;s Guide to Amazon&#8217;s October Prime Day Event 2025",
      "The best laptop deals you can get for Amazon’s October Prime Day",
      "It’s Prime Day 2025 part two, and here are the best deals we could find"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.992,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.653,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Amazon's Prime Big Deal Days sale is currently underway, offering significant discounts on a wide range of products, including noise-canceling headphones, robot vacuums, 4K OLED TVs, laptops, keyboards, and various accessories. Many items on sale have been tested and recommended by Verge writers, ensuring quality picks for consumers looking to upgrade their tech and home theater setups.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Jerry Jones Considers Appealing Fine for Accidental Obscene Gesture",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Tue, 07 Oct 2025 19:25:23 +0000",
    "source": "CBS Sports",
    "sources": [
      "Sportsnet",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "The Cowboys' owner may appeal the fine",
      "<p>Dallas owner Jerry Jones says his obscene gesture toward fans at MetLife Stadium late in a 37-22 victory over the New York Jets was inadvertent and that he intended a “thumbs up” for celebrating Cowboys fans.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/10/07/c1f3c12c-f4f6-49fb-8531-11e936c1f605/jerry-jones.jpg",
    "titles": [
      "Jerry Jones fined $250,000 for 'unfortunate gesture' to Jets fans during Cowboys' Week 5 win",
      "NFL fines Jerry Jones $250,000 for obscene gesture toward fans he says was inadvertent"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.983,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.652,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Dallas Cowboys owner Jerry Jones stated his obscene gesture towards fans at MetLife Stadium was accidental, intending a \"thumbs up\" during a 37-22 win over the New York Jets. Jones may appeal the fine imposed for the incident.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Heather Knight Leads England to Victory Against Bangladesh in World Cup",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 07 Oct 2025 19:21:07 GMT",
    "source": "BBC",
    "sources": [
      "Yahoo Sports",
      "BBC"
    ],
    "domains": [
      "www.bbc.com"
    ],
    "snippets": [
      "Heather Knight may no longer being England captain, but her match-winning knock against Bangladesh in the World Cup showed they need her in the side more than ever.",
      "Heather Knight may no longer being England captain, but her match-winning knock against Bangladesh in the World Cup showed they need her in the side more than ever."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/7b9b/live/2562f0c0-a3b3-11f0-928c-71dbb8619e94.jpg",
    "titles": [
      "'Captain no more, but England need Knight more than ever'",
      "'Captain no more, but England need Knight more than ever'"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.961,
      "consensus": 0.571,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.649,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Heather Knight, no longer England's cricket captain, demonstrated her value to the team with a match-winning performance against Bangladesh in the World Cup, underscoring her importance to the side.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Tesla Launches More Affordable Model Y and Model 3 Variants",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Tue, 07 Oct 2025 19:35:29 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Business Insider"
    ],
    "domains": [
      "www.cnbc.com",
      "www.businessinsider.com"
    ],
    "snippets": [
      "Tesla's Model Y standard SUV is priced just under $40,000 and Model 3 standard sedan around $37,000.",
      "On Tuesday, the EV giant unveiled the long-awaited budget-friendly version of the Model Y, along with a cheaper Model 3."
    ],
    "image_url": "",
    "titles": [
      "Tesla prices Model Y standard below $40,000, debuting more affordable vehicle",
      "Tesla reveals its long-awaited more affordable models: the $36,990 Model 3 Standard and $39,990 Model Y Standard"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.966,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.648,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Tesla introduced a more affordable version of the Model Y SUV, priced just under $40,000, and a cheaper Model 3 sedan at approximately $37,000. These budget-friendly options were unveiled on Tuesday, expanding Tesla's electric vehicle offerings to a wider market.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Phillies Down 0-2 to Dodgers in NLDS, Eye Comeback in Game 3",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Tue, 07 Oct 2025 18:24:49 +0000",
    "source": "CBS Sports",
    "sources": [
      "Yahoo Sports",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "ftw.usatoday.com"
    ],
    "snippets": [
      "Down 2-0 in the NLDS, the Phillies visit the Dodgers for Game 3 on Wednesday",
      "The Philadelphia Phillies have not had the start to the playoffs they may have hoped, losing both of their first two games to the Los Angeles Dodgers."
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/10/07/f36f8e04-b636-4036-ba8e-415a683dceeb/nick-castellanos-phillies-g.jpg",
    "titles": [
      "Nick Castellanos pushes back on Phillies fans after boos in Game 2 loss: 'The environment can be against us'",
      "Nick Castellanos blasts Phillies fans for booing team while down 0-2"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.962,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.647,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Philadelphia Phillies are trailing 0-2 against the Los Angeles Dodgers in the National League Division Series (NLDS). The team is set to play Game 3 at the Dodgers' home on Wednesday, aiming to recover from their initial losses in the playoffs.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Victims of October 7 Attacks Remembered; Peace Talks Underway in Egypt",
    "domain": "general",
    "source_domain": "www.washingtonpost.com",
    "location": "global",
    "published": "Tue, 07 Oct 2025 15:21:46 +0000",
    "source": "Washington Post",
    "sources": [
      "New York Times",
      "Washington Post"
    ],
    "domains": [
      "www.washingtonpost.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "Israelis commemorated the second anniversary of the Hamas-led attacks on southern Israel as fighting continued. Ceasefire negotiations are ongoing in Egypt.",
      "The somber milestone comes with peace talks underway, hostages from the Hamas-led attack still in Gaza, more than 67,000 Palestinians dead and Israel more isolated than ever."
    ],
    "image_url": "",
    "titles": [
      "‘Enough’: Israel marks 2 years since Oct. 7, with sounds of war from Gaza",
      "Israel Marks Two-Year Anniversary of Oct. 7 in Subdued Fashion"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.903,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.646,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "On the second anniversary of the October 7 attacks, friends and relatives commemorated victims at the Nova music festival site. Concurrently, peace talks related to Trump's 20-point plan are happening in Egypt, amidst a backdrop of ongoing hostage situations in Gaza, over 67,000 Palestinian deaths, and increased isolation for Israel.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Global Trade Surges in H1 2025 Amid Tariff Concerns",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Tue, 07 Oct 2025 16:46:27 GMT",
    "source": "CNBC",
    "sources": [
      "New York Times",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "Global trade volumes rose sharply in the first half of 2025 as businesses front-loaded imports ahead of higher tariffs.",
      "The World Trade Organization said trade growth had proved more resilient in 2025 than expected, but would slow next year as result of President Trump’s tariffs."
    ],
    "image_url": "",
    "titles": [
      "WTO hikes global trade forecast for 2025 — but next year doesn't look so good",
      "Global Trade Growth to Slow Sharply Next Year, W.T.O. Says"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.911,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.644,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In the first half of 2025, global trade volumes increased significantly as businesses accelerated imports in anticipation of higher tariffs. The World Trade Organization noted that trade growth in 2025 was more resilient than anticipated. However, it is expected to decelerate in the following year due to the implementation of tariffs by President Trump.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Filmmaker Says Late Father Would Disapprove of \"TikTok Slop\" AI Content",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 07 Oct 2025 15:51:39 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Global News"
    ],
    "domains": [
      "globalnews.ca",
      "www.bbc.com"
    ],
    "snippets": [
      "The filmmaker said it is not what her dad, who died in 2014, would have wanted.",
      "'TikTok slop' is a term used to describe low-quality content generated using artificial intelligence that is often circulated on social media."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/6ba0/live/e26fba40-a38b-11f0-9d41-9dadd041fb76.jpg",
    "titles": [
      "Robin Williams' daughter pleads for people to stop sending AI videos of her dad",
      "Robin Williams’ daughter slams those ‘puppeteering’ him with AI online"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.893,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.641,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A filmmaker commented that her father, who passed away in 2014, would not have approved of \"TikTok slop,\" a term referring to low-quality content produced by artificial intelligence and widely shared on social media platforms.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "SDF Integration Talks Stall Amid Syria Tensions",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Tue, 07 Oct 2025 16:06:00 +0000",
    "source": "Al Jazeera",
    "sources": [
      "New York Times",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "A landmark deal to integrate the SDF with state institutions has stalled as both sides accuse each other of violence.",
      "Tensions have been building over government attempts to bring the Kurdish-led region in northeastern Syria under its authority. Kurdish leaders have so far resisted."
    ],
    "image_url": "",
    "titles": [
      "Ceasefire declared between Syrian forces, Kurdish fighters after one killed",
      "Deadly Clashes Erupt Between Syrian Government Forces and Kurdish Fighters"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.917,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.638,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A landmark agreement aimed at integrating the Syrian Democratic Forces (SDF) with state institutions in Syria has stalled. The delay is due to mutual accusations of violence between the parties involved. Tensions have escalated as the government attempts to assert control over the Kurdish-led northeastern region of Syria, which Kurdish leaders are resisting.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Suggests Insurrection Act to Deploy National Guard Amid Opposition",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Tue, 07 Oct 2025 14:00:44 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Axios"
    ],
    "domains": [
      "www.aljazeera.com",
      "news.google.com"
    ],
    "snippets": [
      "Threat to invoke the Act comes amid protests in Portland and legal challenges against his anti-immigration crackdown.",
      "<a href=\"https://news.google.com/rss/articles/CBMikAFBVV95cUxQblJ2dkp2eDViUXhhUVdPeU9pZV85bkwzYUNFeGRiVlhLRERYekdENTExV2RuLVJqNE9Hb05kZ0dsM2wyaGljQ3NGR1hhT0wwZjJqclBKMnRpN3FvOGwwRVhjVkg1RkYwZzNubGlLMWxnWWpISGFodHBUV2xHSnVnN2xoc05YaDlhcGxYVWtsQW4?oc=5\" target=\"_blank\">How Trump could use the Insurrec",
      "<a href=\"https://news.google.com/rss/articles/CBMikgFBVV95cUxPaTloMElYeEl6RXlMdEtxOGNKMVJzNWdqczg1bWdTcFpaZFZNTmZEeEV3Y3JEYkd5VTF0Wm5yZUNHR3Q2bDRiY2lFdU1Cbl9IZWd5OGxUQTRtaGtOZTZ3RXFNN3NxdEkwRm95THVyNHBVQkFxVUFESzFOdU44VE02R3BiOWpxdTBDLUxuZGU3QWNXUQ?oc=5\" target=\"_blank\">Trump floats Insurrection Act"
    ],
    "image_url": "",
    "titles": [
      "What is Insurrection Act, could it help Trump deploy troops to US cities?",
      "How Trump could use the Insurrection Act to send troops to American cities - Axios",
      "Trump floats Insurrection Act use amid National Guard standoff with states - Axios"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.878,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.638,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "President Trump suggested using the Insurrection Act to deploy the National Guard in cities like Portland and Chicago, despite legal challenges and opposition from local leaders. This follows a federal judge's temporary block on the deployment in Portland. Illinois Governor JB Pritzker criticized the move as a \"military-style invasion\" of Chicago. The situation highlights Trump's intent to override local authorities amid legal setbacks.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Lenders to Pay £8.2 Billion in Major Compensation Scheme",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 07 Oct 2025 16:46:25 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Financial Times"
    ],
    "domains": [
      "www.ft.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Lenders could pay out £8.2bn in compensation, which is less than the FCA had previously estimated.",
      "Lower than expected FCA figure is still set to be one of the industry’s biggest compensation schemes"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/c2e9/live/20610b80-a399-11f0-b741-177e3e2c2fc7.jpg",
    "titles": [
      "Millions of drivers could receive £700 payout over car finance mis-selling scandal",
      "Banks to pay out £11bn for UK car finance mis-selling scandal, says regulator"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.911,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.637,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Lenders are expected to pay out £8.2 billion in compensation, a figure lower than the Financial Conduct Authority's (FCA) initial estimate. Despite this reduction, it remains one of the largest compensation schemes in the industry's history.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Ottawa Man Charged for Injuring Cyclist in Stittsville Collision",
    "domain": "general",
    "source_domain": "ottawacitizen.com",
    "location": "local",
    "published": "Tue, 07 Oct 2025 15:35:52 +0000",
    "source": "Ottawa Citizen",
    "sources": [
      "CityNews",
      "Ottawa Citizen"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "ottawacitizen.com"
    ],
    "snippets": [
      "The 47-year-old driver is facing charges of dangerous operation causing bodily harm and various other Highway Traffic Act offences.",
      "A driver who collided with a cyclist in a quiet Stittsville community was charged by Ottawa police. In a press release, officials said they laid offences against Daniel Hoffmann, 47, for dangerous operation cause bodily harm, along with other Highway Traffic Act offences. The incident happened July "
    ],
    "image_url": "",
    "titles": [
      "Driver charged in collision with cyclist in Stittsville",
      "Driver charged after Stittsville crash left cyclist with life-altering injuries"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.907,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.636,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In Ottawa, 47-year-old Daniel Hoffmann was charged by police for dangerous operation causing bodily harm and additional Highway Traffic Act offences after colliding with a cyclist in Stittsville. This incident occurred in July.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Intercontinental Invests $2B in Polymarket, Stock Rises 3% in Premarket",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Tue, 07 Oct 2025 14:38:00 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Forbes"
    ],
    "domains": [
      "www.cnbc.com",
      "www.forbes.com"
    ],
    "snippets": [
      "Intercontinental Exchange rose more than 3% in the premarket after the company announced it took a $2 billion stake in prediction markets platform Polymarket.",
      "Once fined and barred from the U.S., the crypto-based prediction market is now being embraced by Wall Street."
    ],
    "image_url": "",
    "titles": [
      "NYSE-owner Intercontinental Exchange rises after it takes $2 billion stake in Polymarket",
      "New York Stock Exchange Owner Bets $2 Billion On Polymarket Comeback"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.871,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.629,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Intercontinental Exchange announced a $2 billion investment in Polymarket, a prediction markets platform founded by Shayne Coplan. Following the announcement, Intercontinental's stock rose over 3% in premarket trading.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]