[
  {
    "title": "Jen Pawol Makes History as First Female MLB Umpire in Regular-Season Game",
    "domain": "sports",
    "location": "national",
    "published": "Sat, 9 Aug 2025 19:32:47 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "Sportsnet",
      "Global News",
      "ESPN"
    ],
    "domains": [
      "general",
      "sports"
    ],
    "snippets": [
      "Jen Pawol made history when she became the first woman to umpire an MLB regular-season game.",
      "Pawol worked Saturday's doubleheader between the Braves and Marlins at Truist Park and is expected to be behind the plate for Sunday's game",
      "Jen Pawol's much-anticipated debut came as the first base umpire for Saturday's first game of a split doubleheader between the Atlanta Braves and Miami Marlins.",
      "<p>Jen Pawol has made history as the first female umpire to work a regular-season game in the major leagues.</p>"
    ],
    "image_url": "",
    "titles": [
      "'Amazing': Pawol 1st woman to umpire MLB game",
      "WATCH: Jen Pawol makes MLB history as first female umpire to work a regular-season game",
      "Jen Pawol breaks MLB’s gender barrier as 1st female umpire to work a regular-season game",
      "Jen Pawol breaks gender barrier as first woman to umpire regular-season game"
    ],
    "score_components": {
      "magnitude": 0.9,
      "recency": 0.988,
      "consensus": 0.985,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.834,
    "summary": "Jen Pawol became the first female umpire in Major League Baseball (MLB) history to officiate a regular-season game. She made her historic debut during a doubleheader between the Atlanta Braves and Miami Marlins at Truist Park, serving as the first base umpire for the first game on Saturday. Pawol is also slated to be behind the plate for Sunday's game, marking a significant milestone in MLB history.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 69 tokens"
  },
  {
    "title": "Canadian Firms Oppose Billionaire's Bid for Hudson's Bay Leases",
    "domain": "business",
    "location": "national",
    "published": "Sat, 09 Aug 2025 19:59:24 +0000",
    "source": "Global News",
    "sources": [
      "Financial Post",
      "CityNews",
      "Global News"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "The mall owner also says Liu, who owns three B.C. shopping centres herself, has no brand, experienced staff or track record in retail.",
      "TORONTO &#8212; Several of Canada&#8217;s most prominent real estate companies are slamming an attempt from a B.C. billionaire to take over 25 former Hudson&#8217;s Bay leases, saying her plan for their spaces &#8220;defies commercial common sense&#8221; and is &#8220;entirely unrealistic.&#8221; Th",
      "TORONTO &#8212; Cadillac Fairview says a plan from a B.C. billionaire hoping to take over 25 former Hudson&#8217;s Bay leases &#8220;defies commercial common sense&#8221; and thus, she should not be allowed to move in. In filings made with the Ontario Superior Court on Saturday, Cadillac Fairview sa",
      "TORONTO — Several of Canada&#8217;s most prominent real estate companies are slamming an attempt from a B.C. billionaire to take over 25 former Hudson&#8217;s Bay leases, saying her plan for their spaces “defies commercial common sense” and is &#8220;entirely unrealistic.&#8221; The landlords, inclu"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/07/4bd6cde4ee8b3efa3730459bd77d8e25c1276abae07d244edbb7b798c6acdd61_caa0fd.jpg?quality=65&strip=all",
    "titles": [
      "Landlord says B.C. billionaire’s plan for Bay properties ‘defies commercial common sense’",
      "Landlords say Ruby Liu’s plan for Bay properties ‘defies commercial common sense’",
      "Landlord says Ruby Liu’s plan for Bay properties ‘defies commercial common sense’",
      "Landlords say Ruby Liu’s plan for Bay properties ‘defies commercial common sense’"
    ],
    "score_components": {
      "magnitude": 0.82,
      "recency": 0.918,
      "consensus": 0.897,
      "constructiveness": 0.057,
      "proximity": 1.0
    },
    "score": 0.801,
    "summary": "Several leading Canadian real estate firms, including Cadillac Fairview, are opposing a B.C. billionaire's bid to acquire 25 former Hudson's Bay leases. They argue her proposal lacks commercial viability and realism, highlighting her absence of a retail brand, experienced staff, or a proven track record in the sector. The opposition has been formally presented to the Ontario Superior Court, emphasizing the plan's departure from commercial norms.",
    "constructiveness_score": 0.057,
    "constructiveness_reason": "1 constructive keywords out of 70 tokens"
  },
  {
    "title": "Israel's Gaza Control Plan Faces Global Condemnation, UK Boosts Aid",
    "domain": "general",
    "location": "global",
    "published": "2025-08-09T19:38:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "New York Times",
      "CityNews",
      "Deutsche Welle",
      "Global News"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "Some 20 countries called Israel's plan to seize Gaza City a \"dangerous escalation.\" Meanwhile, the UK pledged millions more in relief supplies, saying it wants the Palestinian territory \"flooded with aid.\" DW has more.",
      "Prime Minister Benjamin Netanyahu faced opposition at home and abroad on Friday as his office said that the Israeli military would take control of Gaza City. Adam Rasgon, a reporter for The New York Times in Jerusalem covering Israeli and Palestinian affairs, describes what’s happening.",
      "'The plans that the Government of Israel has announced risk violating international law,' said a joint statement from Canada, Australia, France, Germany and the United Kingdom.",
      "Canada is joining international partners Saturday in panning Israel&#8217;s plan to take control of Gaza City approved this week. In a joint statement, foreign ministers from several countries including Canada, Australia, France, Germany and the United Kingdom said they reject a decision taken by th"
    ],
    "image_url": "",
    "titles": [
      "Middle East: Arab nations decry Israel's new Gaza City plan",
      "Israel’s New Plan to Take Gaza City",
      "Canada joins international partners condemning Israel’s plan to take over Gaza City",
      "Canada joins international partners to condemn Israel plan to take over Gaza City"
    ],
    "score_components": {
      "magnitude": 0.94,
      "recency": 0.911,
      "consensus": 0.935,
      "constructiveness": 0.047,
      "proximity": 0.5
    },
    "score": 0.8,
    "summary": "Israel's plan to seize control of Gaza City has drawn international criticism and concerns of a \"dangerous escalation,\" with 20 countries, including Canada, Australia, France, Germany, and the United Kingdom, condemning the move as potentially violating international law. In response to the crisis, the UK has committed to sending millions more in relief supplies to the Palestinian territory. Prime Minister Benjamin Netanyahu faces significant opposition both domestically and internationally over the decision, as global leaders call for the area to be \"flooded with aid.\"",
    "constructiveness_score": 0.047,
    "constructiveness_reason": "1 constructive keywords out of 85 tokens"
  },
  {
    "title": "365 Arrested in London at Banned Pro-Palestine Rally",
    "domain": "general",
    "location": "global",
    "published": "Sat, 09 Aug 2025 21:11:36 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "Al Jazeera",
      "Financial Times",
      "CityNews",
      "BBC"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "The Metropolitan Police said the number of arrests was the largest made by the force on a single day in the last decade.",
      "Critics say ban on activist group stifles freedom of speech and assembly and aims to curb pro-Palestine demonstrations.",
      "Protesters defy government ban and rally in Parliament Square",
      "<p>Number of arrests was highest recorded in relation to single operation in at least past decade, according to Met police</p><p>More than 450 people have been arrested in central London at the largest demonstration relating to Palestine Action since the group was proscribed as a terrorist organisat",
      "LONDON (AP) — British police said they arrested 365 people in central London on Saturday as supporters of a recently banned pro-Palestinian group intentionally flouted the law as part of their effort to force the government to reconsider the ban. Parliament in early July passed a law banning Palesti"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/cc2a/live/974bb300-7566-11f0-a975-cb151ca452f4.jpg",
    "titles": [
      "Police arrest 474 people at Palestine Action ban protest",
      "UK police arrest at least 466 people at Palestine Action protest in London",
      "Police arrest hundreds of Palestine Action supporters under anti-terror law",
      "Police arrest 474 people at protest over Palestine Action ban in London",
      "London police arrest 365 people as pro-Palestinian protesters defy new law"
    ],
    "score_components": {
      "magnitude": 0.9,
      "recency": 0.922,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.799,
    "summary": "In central London, British police arrested 365 people during a demonstration by supporters of Palestine Action, a pro-Palestinian group recently banned by Parliament. This event marks the largest number of arrests in a single day by the Metropolitan Police in the past decade. Critics argue that the ban on the activist group restricts freedom of speech and assembly, particularly targeting pro-Palestine protests. Despite the government ban, protesters rallied in Parliament Square, leading to the significant police response.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 79 tokens"
  },
  {
    "title": "Experts Pick Winners for UFC Fight Night at Apex",
    "domain": "sports",
    "location": "national",
    "published": "Sat, 9 Aug 2025 19:01:22 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Din Thomas picks Dolidze vs. Hernandez and a betting insider finds value bets on this weekend's cards.",
      "The middleweight division takes center stage between UFC Fight Night and UFC 319",
      "SportsLine's Daniel Vithlani reveals his picks for the UFC Fight Night fight card from the UFC Apex in Las Vegas on Saturday",
      "<p>Anthony Hernandez goes for his ninth straight win as he takes on Roman Dolidze in the main event of UFC Fight Night on Saturday in Las Vegas. Live coverage of the main card begins on Sportsnet 360 and Sportsnet+ at 7 p.m. ET / 4 p.m. PT.</p>",
      "<p>Romand Dolidze meets Anthony Hernandez in a middleweight bout for the main event at UFC Fight Night on Saturday in Las Vegas.</p>"
    ],
    "image_url": "",
    "titles": [
      "UFC Fight Night: Expert picks, best bets for Dolidze vs. Hernandez",
      "UFC Fight Night prediction -- Roman Dolidze vs. Anthony Hernandez: Fight card, start time, odds, live stream",
      "UFC Fight Night odds, props, predictions, fight card: Dolidze vs. Hernandez picks, bets from proven MMA expert",
      "UFC Fight Night on Sportsnet: Dolidze vs. Hernandez",
      "UFC Fight Night on Sportsnet: Dolidze vs. Hernandez official results"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.978,
      "consensus": 0.847,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.762,
    "summary": "MMA expert Din Thomas and SportsLine's Daniel Vithlani have made their picks for the upcoming UFC Fight Night at the UFC Apex in Las Vegas. Thomas selected fighters for the Dolidze vs. Hernandez bout, while Vithlani revealed his choices for the entire fight card, highlighting value bets for the weekend's MMA matches.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 54 tokens"
  },
  {
    "title": "Mexico Warns US Military Strikes on Cartels Violate Sovereignty",
    "domain": "general",
    "location": "global",
    "published": "2025-08-09T07:12:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Washington Post",
      "Deutsche Welle",
      "The Guardian"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "President Donald Trump has vowed to \"wage war\" on drug cartels, accusing them of flooding the US with drugs such as fentanyl. Mexico has ruled out any US military action on its soil.",
      "<p>Mexico’s president says ‘there will be no invasion … it’s absolutely off the table’ after news reports of order</p><p>Mexico’s president, Claudia Sheinbaum, has rejected the idea that the US might invade Mexico after news reports suggested Donald Trump had authorized the use of military force tar",
      "The Pentagon has been deliberating since early this year about naval and drone strikes against Mexican cartels. But U.S. boots on the ground are not being considered, officials say."
    ],
    "image_url": "",
    "titles": [
      "US: Trump eyes military action against cartels — reports",
      "Sheinbaum rejects US ‘invasion’ after Trump orders military to target Mexico cartels",
      "Trump administration weighs military actions against drug cartels"
    ],
    "score_components": {
      "magnitude": 0.82,
      "recency": 0.703,
      "consensus": 0.847,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.759,
    "summary": "Mexican officials have cautioned that US military action against criminal groups in Mexico would breach their country's sovereignty. The Pentagon has been considering naval and drone strikes against cartels since early this year, without plans for ground troops. The US president has directed the armed forces to undertake tasks traditionally handled by law enforcement.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful information about the tensions between the US and Mexico over the handling of criminal groups. It increases awareness about the sovereignty issues and the potential implications of military action against cartels. However, it does not report on any solutions or progress towards resolving the situation, which limits its constructiveness."
  },
  {
    "title": "Masked Thieves Steal $7,000 Worth of Labubu Dolls in LA County",
    "domain": "general",
    "location": "national",
    "published": "Sat, 09 Aug 2025 17:56:06 -0400",
    "source": "ABC News",
    "sources": [
      "ABC News",
      "Fortune",
      "CityNews"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "The Sheriff's Department said the suspects used a stolen Toyota in the incident.",
      "Police say video shows approximately $7,000 worth of Labubu dolls being stolen from a store in La Puente. The popular stuffed toy costs around $30 each, but often sell for more on secondary markets.",
      "The incident took place early Wednesday morning, and about $7,000 worth of Labubu dolls were stolen.",
      "LOS ANGELES (AP) — A group of masked thieves stole about $7,000 worth of Labubu dolls from a Los Angeles-area store this week, authorities said. The incident took place early Wednesday morning at a store in La Puente, a city about 18 miles (29 kilometers) east of Los Angeles, the LA County Sheriff&#"
    ],
    "image_url": "https://s.abcnews.com/images/Weird/wirestory_0cc03766bef5dc0e76db0ee441e8398c_4x3_384.jpg",
    "titles": [
      "$7K worth of Labubu dolls stolen from Los Angeles store, authorities say",
      "WATCH:  Labubu dolls totaling $7,000 stolen from California store, authorities say",
      "Masked thieves stole all the Labubu dolls from a Los Angeles-area store. ‘We are still in shock’",
      "$7K worth of Labubu dolls stolen from Los Angeles store, authorities say"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.956,
      "consensus": 0.897,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.745,
    "summary": "A group of masked thieves, using a stolen Toyota, stole approximately $7,000 worth of Labubu dolls from a store in La Puente, Los Angeles County, early Wednesday morning. The popular toys, which can sell for more than their $30 retail price on secondary markets, were captured being taken on video, according to the Sheriff's Department.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 57 tokens"
  },
  {
    "title": "Salah Criticizes UEFA for Omitting Details of Palestinian Player's Death",
    "domain": "general",
    "location": "global",
    "published": "Sat, 09 Aug 2025 21:25:26 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian",
      "Al Jazeera"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "Mohamed Salah calls out Uefa over a tribute to Palestinian footballer Suleiman al-Obeid it posted on social media which failed to refer to the circumstances surrounding his death.",
      "Former Palestinian international player Suleiman Al-Obeid killed by Israeli attack on aid seekers in Gaza on Wednesday.",
      "<p>Footballer Suleiman al-Obeid was killed in an Israeli attack in southern Gaza last week, according to Palestine Football Association</p><p>Mohamed Salah has criticised Uefa for failing to state how a footballer known as the “Palestinian Pelé” died in a tribute it posted.</p><p>Suleiman al-Obeid, "
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/68d5/live/96debd30-7562-11f0-836e-33040dd99c19.jpg",
    "titles": [
      "Salah calls out Uefa over wording of Palestinian player tribute",
      "Salah criticises UEFA tribute to ‘Palestinian Pele’",
      "‘Can you tell us how he died?’: Mohamed Salah criticises Uefa over tribute to ‘Palestinian Pelé’"
    ],
    "score_components": {
      "magnitude": 0.82,
      "recency": 0.926,
      "consensus": 0.847,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.734,
    "summary": "Mohamed Salah criticized UEFA for not mentioning that Suleiman al-Obeid, a former Palestinian international footballer, was killed in an Israeli attack in Gaza. The Palestine Football Association confirmed al-Obeid's death occurred while aiding seekers in southern Gaza. Salah's critique focused on UEFA's tribute, which omitted the circumstances of al-Obeid's death.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 57 tokens"
  },
  {
    "title": "Landmine Injures 3 Thai Soldiers Near Cambodia Border Amid Ceasefire",
    "domain": "general",
    "location": "global",
    "published": "Sat, 09 Aug 2025 11:15:04 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Deutsche Welle",
      "The Guardian",
      "Al Jazeera"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "It is the third incident in a few weeks in which Thai soldiers have been injured by mines around the border.",
      "The incident occured only days after an agreement to extend a ceasefire that ended the recent deadly conflict between the Southeast Asian neighbors.",
      "<p>Thai military accuses neighbouring country of planting concealed weapons in violation of international law</p><p>Three Thai soldiers were injured on Saturday after one tripped a landmine in territory along its frontier with Cambodia, Thailand’s army has said as it accused the neighbouring country"
    ],
    "image_url": "",
    "titles": [
      "Thai soldiers injured by landmine near Cambodia amid fragile truce",
      "Three Thai soldiers injured by landmine on Cambodian border",
      "Three Thai soldiers injured by landmine on border with Cambodia, army says"
    ],
    "score_components": {
      "magnitude": 0.82,
      "recency": 0.765,
      "consensus": 0.847,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.702,
    "summary": "Three Thai soldiers were injured by a landmine along the Thailand-Cambodia border, marking the third such incident in recent weeks. This occurred shortly after both nations agreed to extend a ceasefire following a deadly conflict. Thailand's army accuses Cambodia of planting the mines, claiming it violates international law.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 50 tokens"
  },
  {
    "title": "Site C Dam in British Columbia Fully Operational, Boosts Clean Energy Output",
    "domain": "business",
    "location": "national",
    "published": "Sat, 09 Aug 2025 18:59:21 +0000",
    "source": "Global News",
    "sources": [
      "Financial Post",
      "Global News"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "“The commission of Site C’s final generating unit is another step forward to securing B.C.’s clean energy future,” Adrian Dix, Minister of Energy and Climate Solutions said.",
      "VICTORIA &#8212; B.C.&#8217;s minister of energy and climate solutions said Site C won&#8217;t be the last major energy project in the province after becoming fully operational ahead of schedule. The dam in northern B.C. is now able to generate 1,100 megawatts of electricity &#8212; enough to power "
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/08/cf212670c6431b907efaf1f535d9e6f33bcbd722f6deba6c6e87d2c52601853f.jpg?quality=65&strip=all",
    "titles": [
      "B.C.’s Site C Dam project now fully online and operational",
      "BC Hydro says Site C dam near Fort St. John now fully operational"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.899,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.695,
    "summary": "The Site C dam in northern British Columbia has become fully operational ahead of schedule, according to the province's Minister of Energy and Climate Solutions, Adrian Dix. This final generating unit commission marks a significant step towards securing B.C.'s clean energy future. The dam is now capable of generating 1,100 megawatts of electricity, sufficient to power homes and businesses across the region. Additionally, Dix indicated that Site C will not be the last major energy project in the province.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 83 tokens"
  },
  {
    "title": "Clemens Returns for Yankees' 2000 Reunion, Bat-Throw Incident Recalled",
    "domain": "sports",
    "location": "national",
    "published": "Sat, 9 Aug 2025 19:32:47 EST",
    "source": "ESPN",
    "sources": [
      "Yahoo Sports",
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Roger Clemens came back to Yankee Stadium on Saturday, and so did the questions about his bat-throwing incident with Mike Piazza in the World Series 25 years earlier.",
      "NEW YORK — No conversation about the 2000 World Series is complete without mention of the Yankees’ Roger Clemens throwing a broken bat in the direction of the Mets’ Mike Piazza. So when the Yankees celebrated their 2000 championship team during Saturday afternoon’s Old-Timers’ Day in the Bronx, the "
    ],
    "image_url": "",
    "titles": [
      "At Old-Timers' game, Clemens talks Piazza toss",
      "Yankees’ Rogers Clemens attends Old-Timers’ Day for first time, reflects on Mike Piazza incident in 2000 World Series"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.988,
      "consensus": 0.632,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.683,
    "summary": "Roger Clemens returned to Yankee Stadium for the Yankees' 2000 championship team celebration during Old-Timers' Day. The event reignited discussions about Clemens' controversial action 25 years ago, when he threw a broken bat towards Mike Piazza of the Mets during the 2000 World Series. This incident remains a notable topic when recalling that series.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 55 tokens"
  },
  {
    "title": "Mariano Rivera Injures Achilles at Old-Timers' Day, Surgery Needed",
    "domain": "sports",
    "location": "national",
    "published": "Sat, 9 Aug 2025 19:32:47 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Mariano Rivera tore an Achilles tendon while going after a fly ball at the New York Yankees' Old-Timers' Day game on Saturday and needs surgery.",
      "The Hall-of-Fame closer will have to undergo surgery at 55 to repair the ligament"
    ],
    "image_url": "",
    "titles": [
      "Rivera tears Achilles during Old-Timers' game",
      "Mariano Rivera suffers torn Achilles tendon during Yankees Old-Timers' Day game"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.988,
      "consensus": 0.632,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.676,
    "summary": "Former New York Yankees pitcher Mariano Rivera, a Hall-of-Fame closer, tore his Achilles tendon while chasing a fly ball during the Old-Timers' Day game. The 55-year-old will require surgery to repair the ligament.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 38 tokens"
  },
  {
    "title": "Trump Proposes Ukraine-Russia Territory Swap, Faces Criticism from Ukraine",
    "domain": "general",
    "location": "global",
    "published": "Sat, 09 Aug 2025 20:30:11 +0000",
    "source": "Washington Post",
    "sources": [
      "Washington Post",
      "New York Times"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "President Donald Trump, who is due to meet President Vladimir Putin in Alaska on Friday, suggested Ukraine and Russia could swap some territory to achieve peace.",
      "The Ukrainian leader’s blunt comments risk angering President Trump, who has made a peace deal between Ukraine and Russia one of his signature foreign policy goals."
    ],
    "image_url": "",
    "titles": [
      "Zelensky rejects Trump’s suggestion that Ukraine cede territory to Russia",
      "Zelensky Rejects Ceding Territory to Russia After Trump Suggests a Land Swap"
    ],
    "score_components": {
      "magnitude": 0.76,
      "recency": 0.928,
      "consensus": 0.632,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.66,
    "summary": "President Donald Trump is scheduled to meet with President Vladimir Putin in Alaska on Friday, where he has proposed that Ukraine and Russia consider a territory swap as a means to achieve peace. This suggestion comes as part of Trump's broader goal to broker a peace deal between the two nations. However, the idea has elicited sharp criticism from the Ukrainian leadership, potentially straining relations with President Trump, who views the peace agreement as a key objective of his foreign policy.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 82 tokens"
  },
  {
    "title": "Darwin Nunez Moves to Al Hilal for $62M from Liverpool",
    "domain": "sports",
    "location": "global",
    "published": "Sat, 09 Aug 2025 22:53:41 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Sportsnet",
      "Al Jazeera"
    ],
    "domains": [
      "sports",
      "general"
    ],
    "snippets": [
      "Uruguay striker Darwin Nunez completes $62m move from Premier League champions Liverpool to Saudi Arabia&#039;s Al Hilal.",
      "<p>The Saudi Arabian soccer league has secured its latest marquee signing after Darwin Nunez completed a move from Liverpool to Al-Hilal on Saturday.</p>"
    ],
    "image_url": "",
    "titles": [
      "Al Hilal sign Darwin Nunez from Liverpool",
      "Darwin Nunez leaves Liverpool for Saudi Arabia’s Al-Hilal"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.975,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.66,
    "summary": "Uruguay striker Darwin Nunez has finalized a $62 million transfer from Liverpool to Al Hilal in Saudi Arabia. This move marks a significant acquisition for the Saudi Arabian soccer league, securing Nunez as their latest marquee signing.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 37 tokens"
  },
  {
    "title": "NASA's 10th Commercial Crew Capsule Splashes Down in Pacific",
    "domain": "science",
    "location": "national",
    "published": "Sat, 09 Aug 2025 11:34:35 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "NASA"
    ],
    "domains": [
      "science",
      "general"
    ],
    "snippets": [
      "It took the capsule 17 hours to make the trip home, experiencing re-entry temperatures of around 3,000 degrees Fahrenheit as it punched through the atmosphere following Friday's ISS undocking.",
      "Editor&#8217;s Note: This release was edited Aug. 9, 2025, to update the International Space Station docking port for the Crew-10 mission. The first crew to splash down in the Pacific Ocean off the coast of California as part of NASA’s Commercial Crew Program completed the agency’s 10th commercial c"
    ],
    "image_url": "",
    "titles": [
      "4 people and 5 months in space, NASA's Crew-10 mission safely returns to Earth",
      "NASA’s SpaceX Crew-10 Mission Returns, Splashes Down Off California"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.837,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.658,
    "summary": "A capsule returned to Earth after a 17-hour journey from the International Space Station (ISS), enduring re-entry temperatures of about 3,000 degrees Fahrenheit. It successfully splashed down in the Pacific Ocean off the coast of California, marking NASA's 10th commercial crew mission. This event was also notable as the first crew to complete a splashdown in the Pacific Ocean under NASA’s Commercial Crew Program. The editor's note clarifies an update regarding the docking port for the Crew-10 mission, made on August 9, 2025.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 90 tokens"
  },
  {
    "title": "Minnesota Vikings' Rondale Moore Suffers Major Injury, Coach Says",
    "domain": "sports",
    "location": "national",
    "published": "Sat, 09 Aug 2025 23:40:38 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Coach Kevin O'Connell described the injury as 'heartbreaking'",
      "The news for Vikings receiver and punt returner Rondale Moore is not expected to be good."
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/08/09/ab9ec708-6697-4084-8471-8b6a01d5d266/rondale-moore-injury.jpg",
    "titles": [
      "Vikings' Rondale Moore suffers 'pretty significant' left knee injury in preseason matchup vs. Texans",
      "Kevin O'Connell: Vikings WR Rondale Moore has &quot;pretty significant&quot; left knee injury"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.991,
      "consensus": 0.632,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.651,
    "summary": "Minnesota Vikings receiver and punt returner Rondale Moore suffered an injury described as \"heartbreaking\" by Coach Kevin O'Connell. The prognosis for Moore's condition is anticipated to be unfavorable, indicating a significant impact on the team and the player's career.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 42 tokens"
  },
  {
    "title": "England Women's Rugby Triumphs Over France 40-6 Before World Cup",
    "domain": "general",
    "location": "global",
    "published": "Sat, 09 Aug 2025 21:09:47 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Sky Sports"
    ],
    "domains": [
      "sports",
      "general"
    ],
    "snippets": [
      "England's forward supremacy tells as they power to victory away to France in their final warm-up match before the 2025 Women's Rugby World Cup.",
      "Watch highlights as England thrash France 40-6 in their final warm-up game before the 2025 Women's Rugby World Cup.",
      "England ran in six tries as they completed their preparations for the Women's Rugby World Cup with a 40-6 win over France in Mont-de-Marsan."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/390b/live/d7f00660-755f-11f0-a975-cb151ca452f4.jpg",
    "titles": [
      "England thrash France in final World Cup warm-up",
      "England dominate France in final World Cup warm-up match",
      "Red Roses cruise to win over France in final World Cup warm-up"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.921,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.65,
    "summary": "In their final warm-up match before the 2025 Women's Rugby World Cup, England's women's rugby team secured a dominant victory over France, winning 40-6 in Mont-de-Marsan. Demonstrating their forward supremacy, England scored six tries, completing their preparations for the tournament with a strong performance.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 51 tokens"
  },
  {
    "title": "College Football Programs Ranked in Tiers for 2025 Season by David Hale",
    "domain": "sports",
    "location": "national",
    "published": "Sat, 9 Aug 2025 12:25:31 EST",
    "source": "ESPN",
    "sources": [
      "Bleacher Report",
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "From Tier 1 to Tier 20, David Hale ranks all 136 college football program into tiers ahead of the 2025 season.",
      "<a href=\"https://news.google.com/rss/articles/CBMikwFBVV95cUxPQlZVYTZyNFdxeHJTcHo1ejk0UExQbVFldGtDT0VqU3czcVpETzRzV0hQQzRwRU03V1FwdmtSNU1BS0lPc3VLT2UwUkF5OXM0NEpMTThBX0xPbHl1eXhnbEtPMFZra0pBTS1WaGd5OEt4YWtwNlVpQ3UtdVhkTWhhcnZjTW9VcGZvLWdVTm9xSFcxdkU?oc=5\" target=\"_blank\">Ranking the Best Big 3s Ahea"
    ],
    "image_url": "",
    "titles": [
      "🏈 Ranking all 136 FBS teams ahead of the season",
      "Ranking the Best Big 3s Ahead of 2025-26 NBA Season - Bleacher Report"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.852,
      "consensus": 0.632,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.648,
    "summary": "David Hale has categorized all 136 college football programs into tiers, ranging from Tier 1 to Tier 20, in anticipation of the 2025 season. This comprehensive ranking aims to provide insight into the comparative strength and potential of each program leading up to that year. The details of these rankings, including the criteria used for classification, are available through the provided link, but the summary does not specify the outcomes or positions of specific teams.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 75 tokens"
  },
  {
    "title": "Trump Criticizes D.C. Crime Rates After Ex-Official's Carjacking Attempt",
    "domain": "business",
    "location": "national",
    "published": "Sat, 09 Aug 2025 15:54:19 GMT",
    "source": "CNBC",
    "sources": [
      "Forbes",
      "CNBC"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "President Donald Trump ramped up his rhetoric about crime in Washington, D.C., after a former member of DOGE was assaulted in an attempted carjacking.",
      "The president claimed Washington, D.C., had become “one of the most dangerous cities anywhere in the world,” despite federal data indicating crime fell to historic lows."
    ],
    "image_url": "",
    "titles": [
      "Trump to speak at White House on violent crime in D.C. amid federal crackdown",
      "Trump Announces White House Press Conference To ‘Stop Violent Crime’ In Washington, D.C.—Despite Historically Low Rates"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.825,
      "consensus": 0.632,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.625,
    "summary": "President Donald Trump criticized crime levels in Washington, D.C., following an attempted carjacking involving a former member of the Department of General Services. The incident sparked concerns about public safety in the city.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 34 tokens"
  },
  {
    "title": "FP Video Analyzes Trump's Trade War Effects, Toronto Housing Market Trends",
    "domain": "business",
    "location": "national",
    "published": "Sat, 09 Aug 2025 11:00:41 +0000",
    "source": "Financial Post",
    "sources": [
      "Financial Post"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Watch FP Video for updates on Donald Trump's trade war and Toronto's housing market"
    ],
    "image_url": "",
    "titles": [
      "Canada faring ‘pretty good’ in Trump’s tariff war, except for this sector"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.761,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.497,
    "summary": "The FP Video provides updates on Donald Trump's trade war, highlighting its impacts and current developments. Additionally, it covers the state of Toronto's housing market, detailing changes and trends. This summary encapsulates the key information from the video, focusing on the effects of the trade war and the condition of the housing market in Toronto without speculating on future outcomes.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 62 tokens"
  },
  {
    "title": "High-Stakes Competition Underway, Outcome Uncertain",
    "domain": "business",
    "location": "global",
    "published": "Sat, 09 Aug 2025 23:19:56 +0000",
    "source": "Fortune",
    "sources": [
      "Fortune"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "\"I'm not I'm not totally sure what's gonna happen, but it is a crazy intense comp for a very small number of people right now.\""
    ],
    "image_url": "https://fortune.com/img-assets/wp-content/uploads/2025/08/GettyImages-2223572220-e1754781390427.jpg?w=2048",
    "titles": [
      "Sam Altman says the AI talent war is a bet that a ‘medium-sized handful of people’ will make superintelligence breakthroughs"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.984,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.492,
    "summary": "A highly competitive event involving a small group of participants is currently underway, with uncertainty surrounding the outcome.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 18 tokens"
  },
  {
    "title": "Zelenskyy Seeks Global Support Ahead of US-Russia Summit",
    "domain": "business",
    "location": "global",
    "published": "Sat, 09 Aug 2025 22:45:38 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Zelenskyy shores up international support ahead of meeting between US president and Putin next week"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Fe7405b60-23a9-4988-9385-f16bd527bb72.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "European allies back Ukraine’s borders after Trump floats Russia land swap"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.952,
      "consensus": 0.393,
      "constructiveness": 0.093,
      "proximity": 0.5
    },
    "score": 0.488,
    "summary": "Ukrainian President Volodymyr Zelenskyy is actively seeking international backing before an upcoming meeting between the US President and Russian President Vladimir Putin. This effort aims to strengthen Ukraine's position and ensure its interests are considered in discussions that could impact its future.",
    "constructiveness_score": 0.093,
    "constructiveness_reason": "1 constructive keywords out of 43 tokens"
  },
  {
    "title": "Space Discovery: Prebiotic Molecule May Illuminate Origins of Life",
    "domain": "science",
    "location": "global",
    "published": "Sat, 09 Aug 2025 22:23:01 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/explosive-prebiotic-molecule-could-reveal-clues-to-life-in-space/\" rel=\"nofollow\" title=\"Explosive Prebiotic Molecule Could Reveal Clues to Life in Space\"><img alt=\"Cosmic Chemistry Explosion Art Concept\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src"
    ],
    "image_url": "",
    "titles": [
      "Explosive Prebiotic Molecule Could Reveal Clues to Life in Space"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.965,
      "consensus": 0.393,
      "constructiveness": 0.066,
      "proximity": 0.5
    },
    "score": 0.488,
    "summary": "Researchers have identified an explosive prebiotic molecule in space, which might provide insights into the origins of life. This discovery, highlighted through a conceptual art piece, suggests that the molecules necessary for life could be more widespread in the universe than previously thought. The current status of this research opens new avenues for understanding how life might develop in extraterrestrial environments.",
    "constructiveness_score": 0.066,
    "constructiveness_reason": "1 constructive keywords out of 61 tokens"
  },
  {
    "title": "Astronomers Uncover Star's Violent Merger History, Challenging Old Views",
    "domain": "science",
    "location": "global",
    "published": "Sat, 09 Aug 2025 23:33:05 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/this-seemingly-normal-star-was-hiding-a-violent-past/\" rel=\"nofollow\" title=\"This Seemingly Normal Star Was Hiding a Violent Past\"><img alt=\"Hot White Dwarf Merger\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"623\" src=\"https://scitechdaily.com/images/Hot-Wh"
    ],
    "image_url": "",
    "titles": [
      "This Seemingly Normal Star Was Hiding a Violent Past"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.988,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.486,
    "summary": "Astronomers have discovered that a star, initially thought to be normal, has a violent history of merging with another star. This conclusion was reached after observing its unusual characteristics and applying advanced models. The star, now a hot white dwarf, provides insights into stellar evolution and the outcomes of star mergers. This finding challenges previous understandings and highlights the complex nature of star life cycles.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 65 tokens"
  },
  {
    "title": "Astronomers Discover Starry \"Ghostly Bridge\" Between Galaxy Clusters",
    "domain": "science",
    "location": "global",
    "published": "Sat, 09 Aug 2025 22:58:02 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/a-ghostly-bridge-of-stolen-stars-reveals-galactic-tug-of-war/\" rel=\"nofollow\" title=\"A Ghostly Bridge of Stolen Stars Reveals Galactic Tug-of-War\"><img alt=\"DECam Deep View Abell 3667\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"777\" src=\"https://scitechdai"
    ],
    "image_url": "",
    "titles": [
      "A Ghostly Bridge of Stolen Stars Reveals Galactic Tug-of-War"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.976,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.483,
    "summary": "Astronomers have discovered a \"ghostly bridge\" made of stars between two galaxy clusters, Abell 3667, revealing a cosmic tug-of-war. This phenomenon, captured using the DECam Deep View, indicates a massive gravitational interaction, where stars are being pulled from their galaxies. This finding provides new insights into the dynamics of galaxy clusters and the gravitational forces at play in the universe.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 62 tokens"
  },
  {
    "title": "US Consumers Face Slight Inflation Rise from Higher Import Duties in July",
    "domain": "business",
    "location": "national",
    "published": "Sat, 09 Aug 2025 20:17:26 +0000",
    "source": "Financial Post",
    "sources": [
      "Financial Post"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "US consumers probably experienced a slight pickup in underlying inflation in July as retailers gradually raised prices on a variety of items subject to higher import duties."
    ],
    "image_url": "",
    "titles": [
      "US Inflation to Rise as Higher Tariffs Feed Through"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.923,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.48,
    "summary": "In July, US consumers likely saw a small increase in underlying inflation due to retailers raising prices on goods affected by higher import duties. This indicates a gradual rise in prices for various items.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 34 tokens"
  },
  {
    "title": "Virus Identified as Culprit in Pacific Sea Star Die-Off",
    "domain": "science",
    "location": "global",
    "published": "Sat, 09 Aug 2025 14:40:02 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Scientists say they have at last solved the mystery of what killed more than 5 billion sea stars off the Pacific coast of North America in a decade-long epidemic."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/scientists-say-they-ha.jpg",
    "titles": [
      "Scientists say they have solved the mystery of what killed more than 5 billion sea stars"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.893,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.467,
    "summary": "Scientists have identified a virus as the cause of a decade-long epidemic that killed over 5 billion sea stars along the Pacific coast of North America. The virus, known as sea star-associated densovirus, is believed to have played a significant role in the mass die-off. This discovery sheds light on the mysterious decline of sea star populations in the region.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 63 tokens"
  },
  {
    "title": "Auger-Aliassime, Diallo Advance to Cincinnati Open Third Round; Fernandez Out",
    "domain": "sports",
    "location": "national",
    "published": "Sat, 09 Aug 2025 14:30:05 EDT",
    "source": "Sportsnet",
    "sources": [
      "Sportsnet"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "<p>Canada&#8217;s Felix Auger-Aliassime and Gabriel Diallo advanced to the Cincinnati Open&#8217;s third round in men&#8217;s singles, while Leylah Fernandez exited the women&#8217;s draw on Saturday.</p>"
    ],
    "image_url": "https://www.sportsnet.ca/wp-content/uploads/2099/12/auger-aliassime_felix1280.jpg",
    "titles": [
      "Canada’s Auger-Aliassime, Diallo earn second-round win at Cincinnati Open"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.89,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.466,
    "summary": "Canadian tennis players Felix Auger-Aliassime and Gabriel Diallo progressed to the third round of the Cincinnati Open in men's singles. However, Leylah Fernandez was eliminated from the women's draw. The outcome of the matches was determined on Saturday.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 41 tokens"
  },
  {
    "title": "Texas Floods Expose Gaps in Extreme Weather Prediction",
    "domain": "science",
    "location": "global",
    "published": "Sat, 09 Aug 2025 13:50:01 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Our ability to predict extreme weather from thunderstorms, like the recent catastrophic flash floods in Texas, is unsettlingly poor, even in the hours leading up to the event. Improvements in understanding, detecting and predicting extreme thunderstorms—and increasing community resilience to them—ar"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2024/flash-flood.jpg",
    "titles": [
      "It's challenging to predict extreme thunderstorms—improving this will help reduce their deadly and costly impacts"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.877,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.464,
    "summary": "The recent catastrophic flash floods in Texas highlighted a significant gap in our ability to accurately predict extreme weather events, such as thunderstorms, even shortly before they occur. This has underscored the urgent need for advancements in the understanding, detection, and prediction of such extreme weather phenomena to enhance community resilience against future incidents.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 54 tokens"
  },
  {
    "title": "1998 Great Lakes Changes Impact Ecology and Climate, Future Challenges Loom",
    "domain": "science",
    "location": "global",
    "published": "Sat, 09 Aug 2025 16:43:46 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/the-great-lakes-changed-forever-in-1998-are-we-ready-for-whats-next/\" rel=\"nofollow\" title=\"The Great Lakes Changed Forever in 1998. Are We Ready for What’s Next?\"><img alt=\"Lake Superior Stormy Skies\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"470\" src=\"h"
    ],
    "image_url": "",
    "titles": [
      "The Great Lakes Changed Forever in 1998. Are We Ready for What’s Next?"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.857,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.46,
    "summary": "In 1998, the Great Lakes experienced significant ecological changes due to a combination of natural phenomena and human activities. These changes have had lasting impacts on the region's water levels, biodiversity, and climate patterns. The article raises concerns about future challenges and the preparedness of surrounding communities and ecosystems to adapt to ongoing and potential environmental shifts. It emphasizes the importance of readiness and adaptive strategies in facing the consequences of these transformations.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 74 tokens"
  },
  {
    "title": "New Orleans' $15B Floodwalls Sinking, Maps Show",
    "domain": "science",
    "location": "global",
    "published": "Sat, 09 Aug 2025 15:53:30 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/15-billion-floodwalls-are-sinking-satellite-maps-show-new-orleans-silent-collapse/\" rel=\"nofollow\" title=\"$15 Billion Floodwalls Are Sinking. Satellite Maps Show New Orleans’ Silent Collapse\"><img alt=\"New Orleans Louisiana\" class=\"webfeedsFeaturedVisual wp-post-ima"
    ],
    "image_url": "",
    "titles": [
      "$15 Billion Floodwalls Are Sinking. Satellite Maps Show New Orleans’ Silent Collapse"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.843,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.457,
    "summary": "Satellite maps have revealed that the $15 billion floodwalls built to protect New Orleans are sinking. This discovery highlights a concerning issue of infrastructure vulnerability in the city, known as New Orleans' \"silent collapse.\" The situation underscores the challenges faced in safeguarding the area against floods.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 46 tokens"
  },
  {
    "title": "Why Donald Trump’s environmental data purge is so much worse this time",
    "domain": "technology",
    "location": "global",
    "published": "2025-08-09T09:00:00-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Now that we're about halfway into the first year of President Donald Trump's second term, we can take stock of his administration's destruction of online environmental resources. It's worse than last time. It's also, seemingly, just the beginning - paving the way forward for the president's pollutin"
    ],
    "image_url": "",
    "titles": [
      "Why Donald Trump’s environmental data purge is so much worse this time"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.793,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.454,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 13 tokens"
  },
  {
    "title": "RFK Jr. wants a wearable on every American — that future’s not as healthy as he thinks",
    "domain": "technology",
    "location": "global",
    "published": "2025-08-09T10:00:00-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "I keep hearing the same sentence repeating in my head. \"My vision is that every American is wearing a wearable within four years.\" RFK Jr., our current secretary of the Department of Health and Human Services, said this at a congressional hearing at the end of June. Wearables, he said, are key to th"
    ],
    "image_url": "",
    "titles": [
      "RFK Jr. wants a wearable on every American — that future’s not as healthy as he thinks"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.81,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.45,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 17 tokens"
  },
  {
    "title": "Aura’s Aspen impressive digital frame is the most affordable it’s been",
    "domain": "technology",
    "location": "global",
    "published": "2025-08-09T09:35:26-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Returning to work or school from summer vacation is never easy, but the Aura Aspen could help you hold onto your favorite memories by putting them front and center. And right now, you can pick up the digital photo frame for around $199 ($30 off) from Amazon, Best Buy, and Aura, which is a new [&#823"
    ],
    "image_url": "",
    "titles": [
      "Aura’s Aspen impressive digital frame is the most affordable it’s been"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.803,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.449,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 13 tokens"
  },
  {
    "title": "Is This Seat Taken? makes seating fussy people fun",
    "domain": "technology",
    "location": "global",
    "published": "2025-08-09T09:00:00-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Creating seating arrangements can be pretty stressful; the empath part of me strives to find the perfect seat for every person even if it's a nearly impossible task. If it's for a big, meaningful event, I get even more anxious. When you find the right place for everyone, though, it's even more satis"
    ],
    "image_url": "",
    "titles": [
      "Is This Seat Taken? makes seating fussy people fun"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.793,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.447,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 9 tokens"
  },
  {
    "title": "I went camping in a heat dome, and these five gadgets saved my vacation",
    "domain": "technology",
    "location": "global",
    "published": "2025-08-09T09:00:00-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "I recently returned from a family camping trip to Cades Cove in the Great Smoky Mountains National Park. I live in South Carolina, so in mid-July, a trip to the mountains is usually an excellent way to seek out cooler temperatures. Not this year. Thanks to this summer's heat dome, I was facing a wee"
    ],
    "image_url": "",
    "titles": [
      "I went camping in a heat dome, and these five gadgets saved my vacation"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.793,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.447,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 14 tokens"
  },
  {
    "title": "Tiny Particles in Organs May Cause Serious Health Issues",
    "domain": "business",
    "location": "national",
    "published": "Sat, 09 Aug 2025 12:46:41 +0000",
    "source": "Financial Post",
    "sources": [
      "Financial Post"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Small particles can get lodged in crevices of organs from lungs to arteries, causing inflammation and other health issues."
    ],
    "image_url": "",
    "titles": [
      "How Canadian Wildfire Smoke Is Jeopardizing Health Across North America"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.79,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.446,
    "summary": "Tiny particles can become stuck in organ crevices like lungs and arteries, leading to inflammation and health problems. This can impact overall well-being and potentially cause serious health issues. It is crucial to understand and address the risks associated with these particles to maintain good health.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 47 tokens"
  },
  {
    "title": "What&#8217;s a smut peddler to do these days?",
    "domain": "technology",
    "location": "global",
    "published": "2025-08-09T08:00:00-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "In the aftermath of itch.io pulling the sale of over 20,000 pages of adult content, the creators of that work are left feeling betrayed, exhausted, and fearful. The number of platforms that permit the sale of adult material is shrinking, and there's no guarantee the ones that remain will still permi"
    ],
    "image_url": "",
    "titles": [
      "What&#8217;s a smut peddler to do these days?"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.777,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.444,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 10 tokens"
  },
  {
    "title": "Encryption made for police and military radios may be easily cracked",
    "domain": "technology",
    "location": "global",
    "published": "Sat, 09 Aug 2025 11:18:47 +0000",
    "source": "Ars Technica",
    "sources": [
      "Ars Technica"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "An encryption algorithm can have weaknesses that could allow an attacker to listen in."
    ],
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/08/Screenshot-2025-08-08-at-15-37-31-Encryption-Made-for-Police-and-Military-Radios-May-Be-Easily-Cracked-WIRED-1045x648.png",
    "titles": [
      "Encryption made for police and military radios may be easily cracked"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.766,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.441,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 11 tokens"
  },
  {
    "title": "New adhesive surface modeled on a remora works underwater",
    "domain": "technology",
    "location": "global",
    "published": "Sat, 09 Aug 2025 11:08:48 +0000",
    "source": "Ars Technica",
    "sources": [
      "Ars Technica"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "It was tested for its ability to adhere to the inside of the digestive tract."
    ],
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/08/GettyImages-1142897466-1152x648.jpg",
    "titles": [
      "New adhesive surface modeled on a remora works underwater"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.763,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.441,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 9 tokens"
  }
]