[
  {
    "title": "\"ABC Suspends 'Jimmy Kimmel Live' After Host's Controversial Remarks\"",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 17 Sep 2025 23:48:52 GMT",
    "source": "BBC",
    "sources": [
      "Forbes",
      "MarketWatch",
      "The Verge",
      "Business Insider",
      "CNBC",
      "BBC",
      "Global News",
      "CityNews",
      "Deutsche Welle",
      "The Guardian",
      "Axios"
    ],
    "domains": [
      "globalnews.ca",
      "news.google.com",
      "www.businessinsider.com",
      "www.theverge.com",
      "ottawa.citynews.ca",
      "www.marketwatch.com",
      "www.dw.com",
      "www.theguardian.com",
      "www.forbes.com",
      "www.bbc.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "The late-night host said on Monday that Trump's allies were \"doing everything they can to score political points from\" Kirk's death.",
      "ABC network is taking \"Jimmy Kimmel Live\" off the air indefinitely in response to comments the late-night host made about the killing of conservative activist Charlie Kirk.",
      "<a href=\"https://news.google.com/rss/articles/CBMib0FVX3lxTE1UUENQRkYxZGt6M1MyX1YxaVVHVGlvUEtEYWJ5RjNaMXVDV2I4dVJUbllIOHBSX0FreHhMa2NybTQ1U1pjdFRNN0kxVnFnaE1GZDdETkhCZ09NeDFCMm1ubVBrSWN4aTdpUFUwTnVHZw?oc=5\" target=\"_blank\">ABC pulls Jimmy Kimmel after Charlie Kirk comments</a>&nbsp;&nbsp;<font color",
      "Jimmy Kimmel suggested that Tyler Robinson, the man accused of killing Charlie Kirk, was aligned with President Donald Trump's MAGA movement.",
      "<p>Network says show will be off-air ‘indefinitely’ following complaints about host’s comments on killing of Charlie Kirk</p><p><strong>Donald Trump has claimed his administration has reached a deal with China to keep TikTok operating in the US, amid uncertainty over what shape the final agreement w",
      "<p>ABC says late night show will not air for foreseeable future after Kimmel accused Republicans of ‘doing everything they can to score political points’ from Kirk’s killing</p><ul><li><p><a href=\"https://www.theguardian.com/culture/2025/sep/17/jimmy-kimmel-republicans-charlie-kirk\">Watch what Jimmy",
      "The move came after U.S. media company Nexstar announced its television stations affiliated with ABC would pre-empt “Jimmy Kimmel Live!” indefinitely over his comments.",
      "The talk show will be replaced immediately by another ABC program.",
      "ABC pulled Jimmy Kimmel off the air indefinitely after saying in his monologue that Charlie Kirk's alleged shooter Tyler Robinson supported Trump.",
      "Disney and ABC have pulled Jimmy Kimmel Live! off air “indefinitely” after FCC chairman Brendan Carr threatened to pull the broadcast licenses of any station that aired his show over comments Kimmel made about the man charged with killing Charlie Kirk.  The decision, according to Variety, was made a",
      "A vocal Trump critic, Kimmel had come under fire from the administration, leading affiliate owner Nexstar, which is in the midst of a merger requiring an FCC rule change, to pull the plug on his show and force the network’s hand.",
      "ABC has suspended Jimmy Kimmel’s late-night show indefinitely following comments he made about Charlie Kirk’s killing. The network’s decision came Nexstar announced its ABC affiliates would pre-empt “Jimmy Kimmel Live!” indefinitely over his comments. “Mr. Kimmel’s comments about the death of Mr. Ki"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/63f6/live/3e5c43e0-941a-11f0-9cf6-cbf3e73ce2b9.jpg",
    "titles": [
      "Jimmy Kimmel taken off air over Charlie Kirk comments",
      "'Jimmy Kimmel Live' pulled off air over Charlie Kirk comment",
      "ABC pulls Jimmy Kimmel after Charlie Kirk comments - Axios",
      "ABC pulls 'Jimmy Kimmel Live' off air 'indefinitely' over Charlie Kirk comments",
      "ABC pulls Jimmy Kimmel’s late-night show over Charlie Kirk comments after FCC threats – live",
      "Jimmy Kimmel Live! suspended indefinitely after host’s Charlie Kirk comments",
      "ABC suspends Jimmy Kimmel’s show indefinitely over Charlie Kirk death monologue",
      "ABC Pulls Jimmy Kimmel ‘Indefinitely’ After Charlie Kirk Comments: Here’s What He Said",
      "ABC suspends Jimmy Kimmel's show 'indefinitely' over his Charlie Kirk comments after FCC chair's threats",
      "Jimmy Kimmel Live pulled ‘indefinitely’ for joke about Charlie Kirk’s killer after FCC threat",
      "Jimmy Kimmel dropped by ABC amid affiliate revolt following Charlie Kirk comments",
      "ABC suspends Jimmy Kimmel’s late-night show indefinitely over his remarks about Charlie Kirk’s death"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.971,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.844,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "ABC has indefinitely suspended \"Jimmy Kimmel Live\" following remarks made by the host regarding the killing of conservative activist Charlie Kirk. Jimmy Kimmel suggested that Kirk's alleged killer was aligned with Trump's MAGA movement, leading to backlash. The decision came after Nexstar, an affiliate owner, announced it would pre-empt the show indefinitely, influenced by FCC chairman Brendan Carr's warning about pulling broadcast licenses over the comments. The show will be replaced by another ABC program for the foreseeable future.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Begins Second UK State Visit, Hosted by King Charles and Queen Camilla",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 17 Sep 2025 21:53:29 GMT",
    "source": "BBC",
    "sources": [
      "Financial Times",
      "BBC",
      "Deutsche Welle",
      "The Guardian",
      "New York Times",
      "Washington Post"
    ],
    "domains": [
      "www.ft.com",
      "www.nytimes.com",
      "www.dw.com",
      "www.theguardian.com",
      "www.bbc.com",
      "www.bbc.co.uk",
      "www.washingtonpost.com"
    ],
    "snippets": [
      "King Charles hosts Donald Trump at Windsor Castle on the first full day of his UK state visit.",
      "And the row over free speech after Charlie Kirk’s assassination",
      "US President Donald Trump is receiving an unprecedented welcome in the UK with King Charles at Windsor. Meanwhile, thousands are expected to take part in protests against the visit. Follow DW for the latest.",
      "But after spending time with the King, the US president may face a tricky final day as he holds talks with Sir Keir Starmer",
      "<p>The president and his wife were treated to the full array of British pageantry, including a banquet at Windsor Castle hosted by King Charles</p><p>Donald Trump hailed the so-called special relationship between the US and Britain as he paid a gushing tribute to King Charles during his historic sec",
      "When encountering a British royal, a bow or curtsy is okay, a hug generally is not, and “Your Majesty” or “Your Royal Highness,” is much preferred over saying “Chuck” or “Kate.”",
      "The president and first lady will be hosted by King Charles III and Queen Camilla at Windsor Castle. Mr. Trump will also meet the prime minister at his country residence, Chequers.",
      "<p>Other nations including France, Australia and Canada plan to take the same step at next week’s UN summit </p><p>Keir Starmer will reportedly recognise a Palestinian state over the weekend after Donald Trump concludes his state visit to the UK.</p><p>The prime minister has previously said he plans",
      "<p>Prime minister seeks to make best of difficult state visit by US president with package of commitments by US firms</p><p>Keir Starmer has sought to navigate a politically treacherous state visit by Donald Trump with an announcement of £150bn of US investment in the UK, as the president was kept s"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/7394/live/a7394020-9410-11f0-9cf6-cbf3e73ce2b9.jpg",
    "titles": [
      "Watch: Pomp and protests on day one of Trump state visit",
      "What does Donald Trump want from his UK state visit?",
      "Trump meets King Charles in historic second UK state visit",
      "Donald Trump soaks up the glory of his second UK state visit",
      "Trump lauds ‘special relationship’ between UK and US as historic second state visit sees thousands protest",
      "What Trump needs to know about royal etiquette on his U.K. state visit",
      "President Trump’s State Visit to the UK: What to Know",
      "Starmer to recognise Palestinian state ‘after Trump state visit’",
      "Starmer banks on £150bn investment to placate critics of Trump state visit"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.933,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.837,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Donald Trump arrived in the UK for a historic second state visit, during a sensitive time for the UK government. He and the First Lady are hosted by King Charles III and Queen Camilla at Windsor Castle, and will also visit the Prime Minister's residence, Chequers. The visit features displays of royal and military pageantry.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Suspect Neutralized After Killing 3 Officers, Injuring 2 in Pennsylvania",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 17 Sep 2025 23:13:44 GMT",
    "source": "BBC",
    "sources": [
      "Al Jazeera",
      "ABC News",
      "BBC",
      "The Guardian",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "www.aljazeera.com",
      "www.theguardian.com",
      "www.bbc.com",
      "abcnews.go.com"
    ],
    "snippets": [
      "Officials said the suspect has been \"neutralised\" and there is no further threat to the public.",
      "Shooting took place in York County, in a rural part of the US state.",
      "<a href=\"https://news.google.com/rss/articles/CBMidEFVX3lxTE9tU0RHc2QyVmYyVk85YWpXdXhrdWY2Q3pEQXNFZFVZTVc2dkliZ3dSVHV0c1hDcndQRkpwWmhOcTVOSU9KbmJPOHJhQ29LOEd6NWJ0bUhiTlFiYzZvTjUzbjM3Ul9hTTRqMi1sS3JOUXZzVjBq?oc=5\" target=\"_blank\">Multiple officers shot in rural Pennsylvania</a>&nbsp;&nbsp;<font color",
      "\"Please send prayers to the officers and those involved in the shooting in York County,\" Pennsylvania Lt. Gov. Austin Davis said on X.",
      "<p>Governor says ‘we grieve the loss of life of three precious souls’ as two injured in critical condition in hospital</p><p>Three police officers were killed and two were injured in a shooting on Wednesday in the southern part of Pennsylvania, state police said.</p><p>“We grieve for the loss of lif"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/d1f7/live/2c887a00-940e-11f0-b688-dd9e4988e08b.jpg",
    "titles": [
      "Three officers killed in Pennsylvania shooting, with two others critical",
      "Five police officers shot, three fatally, in Pennsylvania",
      "Multiple officers shot in rural Pennsylvania - Axios",
      "5 officers shot, 3 fatally, while serving warrant in Pennsylvania: Officials",
      "Three officers fatally shot and two injured in Pennsylvania shooting, police say"
    ],
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.959,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.821,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In York County, Pennsylvania, a suspect involved in a shooting that resulted in the death of three police officers and critical injuries to two others has been neutralized, posing no further threat to the public. This incident occurred in a rural part of the state. Pennsylvania's Lt. Gov. Austin Davis and the Governor have expressed their condolences and urged prayers for the officers and all those affected by the tragedy.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Federal Reserve Cuts Interest Rates to 4-4.25%, Aims to Boost Economy",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Wed, 17 Sep 2025 18:17:40 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Financial Times",
      "CNBC",
      "Deutsche Welle",
      "The Guardian"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.ft.com",
      "www.dw.com",
      "www.theguardian.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "The central bank’s widely-expected 0.25% cut comes amid a cooling labour market, which has stalled economic growth.",
      "The widely expected cut of a quarter percentage point comes amid economic pressures ranging inflation and tariffs to sluggish job growth. Two more cuts are expected before the end of the year.",
      "The U.S. labor market is producing relatively few jobs. In response, the Federal Reserve is lowering short-term interest rates to stimulate economic growth.",
      "US central bank’s first reduction in borrowing costs this year comes amid growing worries about labour market weakness",
      "<p>Central bank moves to set rates at range between 4 and 4.25% but decision unlikely to satisfy Donald Trump</p><p>The US <a href=\"https://www.theguardian.com/business/federal-reserve\">Federal Reserve</a> cut interest rates on Wednesday, its first rate cut since December, as the central bank moved "
    ],
    "image_url": "",
    "titles": [
      "US Federal Reserve cuts interest rates for the first time since December",
      "US Federal Reserve cuts interest rate for first time in 2025",
      "As U.S. jobs disappear, the Federal Reserve returns to rate cuts",
      "Federal Reserve cuts rates by quarter point and signals more to come",
      "Federal Reserve cuts US interest rates for first time since December"
    ],
    "score_components": {
      "magnitude": 0.964,
      "recency": 0.883,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.813,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The U.S. Federal Reserve cut interest rates by 0.25%, setting them between 4 and 4.25%. This decision, the first reduction this year, responds to a cooling labor market and slow economic growth. Influenced by factors like inflation, tariffs, and sluggish job growth, the cut aims to stimulate the economy. Two more rate cuts are expected before year-end.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "NCAA Ends Spring Transfer Window for College Football Players",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Wed, 17 Sep 2025 19:49:25 EST",
    "source": "ESPN",
    "sources": [
      "Yahoo Sports",
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.cbssports.com",
      "www.sportingnews.com",
      "www.espn.com"
    ],
    "snippets": [
      "The NCAA voted to eliminate the spring transfer portal window but did not sign off on establishing Jan. 2-11 as the lone window for FBS and FCS players.",
      "Beginning this year, players will no longer be able to transfer during the spring.",
      "College football players will no longer be on the move in the spring. Here's what to know about the NCAA's proposed changes."
    ],
    "image_url": "",
    "titles": [
      "NCAA removes spring transfer window for football",
      "NCAA approves single transfer portal window: How the new rule will impact college football",
      "College football transfer portal window, explained: What to know about new rules eliminating spring period"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.991,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.76,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The NCAA has voted to eliminate the spring transfer portal window for college football players, meaning they can no longer transfer during the spring. However, the proposal to establish a single transfer window from Jan. 2-11 for FBS and FCS players was not approved. This change is effective starting this year.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Ben & Jerry's Co-Founder Resigns Over Advocacy Restrictions",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Wed, 17 Sep 2025 17:19:28 -0400",
    "source": "NPR",
    "sources": [
      "CNBC",
      "NPR",
      "Axios"
    ],
    "domains": [
      "www.npr.org",
      "news.google.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "Greenfield said the Vermont ice cream maker \"has been silenced, sidelined for fear of upsetting those in power\" by Unilever, the multinational corporation that bought Ben & Jerry's in 2000.",
      "<a href=\"https://news.google.com/rss/articles/CBMif0FVX3lxTE93TVpES1FKdDRRSGJHSjgyV3hZWFFEa1JhdjdhNWhQakRBUDVhLUdNeXBJcG9hR0dhc2EwdEFZamNXb2p3YmhuaHM0dlBfSWMtLUpkQlc3ZnQta181MmxRZFVfWFNYX2QxcmlYUFg4akRGY0owUEtnVFVMTlRsYTA?oc=5\" target=\"_blank\">Ben & Jerry's co-founder resigns, says parent company \"s",
      "Greenfield dubbed the decision \"painful\" but said that the Unilever had silenced the company's ability to speak up on global issues."
    ],
    "image_url": "",
    "titles": [
      "Ben & Jerry's co-founder Jerry Greenfield resigns over dispute with owner Unilever",
      "Ben & Jerry's co-founder resigns, says parent company \"silenced\" activism - Axios",
      "Ben & Jerry's co-founder Jerry Greenfield quits over social activism row with Unilever"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.941,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.75,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Ben & Jerry's co-founder, Jerry Greenfield, resigned after 47 years, citing Unilever's restriction on the company's advocacy on global issues as the reason for his departure. Greenfield described the decision as \"painful\" but necessary due to a conflict of conscience.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Navalnaya Urges Labs to Release Navalny Poison Test Results",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 17 Sep 2025 12:49:38 GMT",
    "source": "BBC",
    "sources": [
      "Al Jazeera",
      "BBC",
      "The Guardian",
      "Washington Post"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.theguardian.com",
      "www.bbc.com",
      "www.washingtonpost.com"
    ],
    "snippets": [
      "Yulia Navalnaya is urging the two laboratories she says found her husband was poisoned to release their findings.",
      "The widow of vocal Kremlin critic Alexey Navalny says two independent labs have found that he was poisoned.",
      "Two labs tested samples from Navalny that were smuggled out of Russia and concluded he had been poisoned, his wife said. The official cause of death cited disease.",
      "<p>Yulia Navalnaya says tests by two laboratories on samples smuggled out of Russia show her husband was killed by poison</p><p>Yulia Navalnaya, the widow of the Russian opposition leader Alexei Navalny, said that two foreign laboratories had confirmed her husband was poisoned, after tests on biolog"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/ef8e/live/60e75040-93d3-11f0-9cf6-cbf3e73ce2b9.jpg",
    "titles": [
      "Navalny's widow says tests show he was poisoned in jail",
      "Alexey Navalny’s widow says lab results show her husband was poisoned",
      "Navalny’s widow says new lab evidence proves he was poisoned in prison",
      "Widow of Alexei Navalny says lab tests confirm he was poisoned in prison"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.772,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.744,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Yulia Navalnaya has called on two laboratories, which conducted tests on samples smuggled out of Russia, to publicly release their findings. These tests, according to her, confirm that her husband, Russian opposition leader Alexei Navalny, was poisoned. Despite these claims, the official cause of his death has been cited as disease.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Chelsea Loses 3-1 to Bayern Munich in Champions League Return",
    "domain": "sports",
    "source_domain": "www.bavarianfootballworks.com",
    "location": "national",
    "published": "Wed, 17 Sep 2025 23:45:00 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports",
      "Sky Sports",
      "The Guardian"
    ],
    "domains": [
      "www.bavarianfootballworks.com",
      "www.theguardian.com",
      "www.skysports.com"
    ],
    "snippets": [
      "Commanding win all things considered",
      "<p></p><p>The Allianz Arena will always hold cherished memories for Chelsea but when they pick through the wreckage of their first night back in the Champions League there will be plenty of moments that they would rather not have to think about again.</p><p>Back at the ground where they became Europ",
      "Chelsea felt the force of Harry Kane's ruthlessness as he scored twice in a 3-1 win for Bayern Munich in the Champions League."
    ],
    "image_url": "",
    "titles": [
      "Harry Kane praises Bayern Munich for deserved win over Chelsea in the Champions League",
      "Kane at double as Bayern Munich spoil Chelsea’s Champions League return",
      "Kane punishes naive Chelsea in Bayern win"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.99,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.735,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Chelsea faced a tough defeat at the Allianz Arena, losing 3-1 to Bayern Munich in their Champions League return. Harry Kane led Bayern's victory with two goals, marking a challenging night for Chelsea at a venue with historic significance for the club.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UN Commission Accuses Israel of Genocide in Gaza; Israel Denies Claims",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Wed, 17 Sep 2025 19:25:56 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "The Guardian",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "www.theguardian.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Key progressive lawmaker becomes the first US senator to describe Israel&#039;s assault on Gaza as a genocide.",
      "<a href=\"https://news.google.com/rss/articles/CBMic0FVX3lxTFA1Mzcwd2VYelZ3LUR2eTBwNTJRVThBbDR1N1lFd1hpWWMtRWo2TTdEdTMzamxPQmlwcGZfcGsxb1VHOHhRSlpsQ082SHZNVzEzMFlCcnhDWG1zbk5MMkNFTmgyQk5NY3ZWRTJ4dk9aRUpzOEE?oc=5\" target=\"_blank\">Bernie Sanders calls war in Gaza a \"genocide\"</a>&nbsp;&nbsp;<font color",
      "<p>The UN commission of inquiry’s report makes it almost impossible for Israel – and its allies – to maintain the narrative that criticism of it is part of an antisemitic plot</p><p>The conclusion of a UN commission of inquiry that <a href=\"https://www.theguardian.com/world/2025/sep/16/israel-commit"
    ],
    "image_url": "",
    "titles": [
      "‘Israel is committing genocide in Gaza’: Bernie Sanders",
      "Bernie Sanders calls war in Gaza a \"genocide\" - Axios",
      "Now the UN says Israel is committing genocide in Gaza, too. How can western governments still refuse to act? | Steve Crawshaw"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.905,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.732,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A UN commission has concluded that Israel is committing genocide in Gaza, a finding Israel rejects. This report aligns with the views of some governments and human rights organizations, challenging the narrative that criticism of Israel is antisemitic. Human rights experts and politicians are urging for sanctions on Israel similar to those on Russia.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Cubs Clinch MLB Post-Season Berth with 8-4 Win Over Pirates",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Wed, 17 Sep 2025 21:04:39 +0000",
    "source": "CBS Sports",
    "sources": [
      "Yahoo Sports",
      "CBS Sports",
      "Sportsnet"
    ],
    "domains": [
      "www.cbssports.com",
      "www.sportsnet.ca",
      "sports.yahoo.com"
    ],
    "snippets": [
      "The Cubs currently have a five-game hold on the top wild card spot",
      "Ian Happ hit a homer and drove in three runs Wednesday as the Chicago Cubs secured their first Major League Baseball post-season berth since 2020 with an 8-4 victory over the Pittsburgh Pirates.Happ and Moises Ballesteros hit back-to-back home runs as the Cubs put up four runs in the first inning an",
      "<p>Ian Happ homered and drove in three runs, and the Chicago Cubs clinched their first post-season berth since 2020 with an 8-4 win over the Pittsburgh Pirates on Wednesday.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/17/3ed9a85a-9953-45df-9cac-6315b2257b43/cubs-getty.png",
    "titles": [
      "Cubs clinch MLB playoff spot: Chicago joins Brewers, Phillies on postseason bracket for first time since 2020",
      "Surging Cubs secure first MLB playoff berth since 2020",
      "Cubs clinch post-season spot with victory over Pirates"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.936,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.724,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Ian Happ contributed a homer and three RBIs, leading the Chicago Cubs to clinch their first MLB post-season berth since 2020 with an 8-4 victory over the Pittsburgh Pirates. The win, highlighted by Happ and Moises Ballesteros's back-to-back homers in the first inning, solidifies the Cubs' five-game lead for the top wild card spot.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Van Dijk's Late Header Secures 3-2 Liverpool Win Over Atletico Madrid",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 17 Sep 2025 21:17:29 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Sky Sports",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com",
      "www.skysports.com"
    ],
    "snippets": [
      "Virgil Van Dijk's header in stoppage time helps Liverpool deliver another dramatic late twist as they open their Champions League campaign with victory over Atletico Madrid at Anfield.",
      "<p>It should have been a lot easier than&nbsp;this for Liverpool but the 92nd‑minute roar to celebrate Virgil van Dijk’s winner against Atlético Madrid made the hardship worthwhile. This is what everyone expects of Liverpool this season; the captain’s header was only their third latest decisive goal",
      "Virgil van Dijk scored a stoppage-time winner as Liverpool overcame an Atletico Madrid comeback to win 3-2 at Anfield."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/b6ce/live/5d94a860-940b-11f0-9cf6-cbf3e73ce2b9.jpg",
    "titles": [
      "Van Dijk header snatches victory for Liverpool against Atletico",
      "Van Dijk’s late header earns Liverpool dramatic win against Atlético Madrid",
      "Van Dijk heads in as Liverpool win late again against Atletico"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.921,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.721,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Virgil Van Dijk scored a decisive stoppage-time header, leading Liverpool to a 3-2 victory over Atletico Madrid in their Champions League opener at Anfield. This late win, celebrated with a roar in the 92nd minute, highlighted Liverpool's resilience and expectation for dramatic finishes this season.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Parliament Honors Ex-Canadiens Goalie and MP Ken Dryden",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Wed, 17 Sep 2025 23:00:08 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "CityNews"
    ],
    "domains": [
      "globalnews.ca",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "Members of Parliament paid tribute to hockey legend Ken Dryden in the House of Commons today.",
      "OTTAWA — Members of Parliament honoured former Montreal Canadiens goaltender Ken Dryden in the House of Commons on Wednesday with tributes and a moment of silence. Dryden also served as a member of Parliament from Toronto between 2004 and 2011 and was the minister of social development between 2004 "
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/ae24184d8d26b9e8ed13f2a33073fb58483d6cbbda148f3016a2f9e1386621da_65b625.jpg?quality=65&strip=all",
    "titles": [
      "MPs pay tribute to Ken Dryden in House of Commons",
      "MPs observe moment of silence for Ken Dryden in House of Commons"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.974,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 1.0
    },
    "score": 0.71,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Members of Parliament honored Ken Dryden, a former Montreal Canadiens goaltender and MP from Toronto (2004-2011), in the House of Commons with tributes and a moment of silence. Dryden also served as the minister of social development during his time in office.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Breanna Stewart to Play in Game 2 Against Mercury After MCL Sprain",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Wed, 17 Sep 2025 19:49:25 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "Liberty star Breanna Stewart will start in Wednesday night's Game 2 against the Mercury after spraining her MCL in Game 1.",
      "<p>Liberty star Breanna Stewart said she&#8217;s ready to go for Game 2 of the WNBA playoffs against the Phoenix Mercury on Wednesday night after spraining the MCL in her left knee in the opener of the first-round series.</p>"
    ],
    "image_url": "",
    "titles": [
      "Liberty's Stewart to start G2 despite MCL sprain",
      "Liberty’s Stewart to start Game 2 against Mercury"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.991,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.685,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Breanna Stewart, a key player for the Liberty, confirmed she will play in Game 2 against the Phoenix Mercury in the WNBA playoffs on Wednesday night. This comes after she sprained her MCL in Game 1 of the first-round series.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Utah Mammoth Unveils New State-of-the-Art Training Facility",
    "domain": "business",
    "source_domain": "www.forbes.com",
    "location": "global",
    "published": "Wed, 17 Sep 2025 15:30:34 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes",
      "NHL"
    ],
    "domains": [
      "www.forbes.com",
      "news.google.com"
    ],
    "snippets": [
      "In less than 13 months, the owners of the NHL's Utah Mammoth oversaw the construction of a best-in-class training space, part of a commitment to players and community.",
      "<a href=\"https://news.google.com/rss/articles/CBMinwFBVV95cUxPVEM1US03WEFTVkYySUVxYzNjRmQ0NHFyWWtqMHhJSlFRZ1kzLXF5WldpM0N3LXBJaUtXWG9tY3F1MFQzRjhxYl8xcUg5eml6V2tYWUJSSXJjdzZnenl5UWRjdHMwRF8xQ1VGNnZqWWszbERDei0yRjhIb3VJY29kWElVZGdXY3ZYaTBFbTdhT1hncTdWWFotLTYyeGRpZmc?oc=5\" target=\"_blank\">Utah is Home"
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/68c9fd360dd7cd54d40b6514/0x0.jpg?width=960",
    "titles": [
      "Utah Mammoth Open New State-Of-The-Art Practice And Training Facility",
      "Utah is Home with New Practice and Training Facility - NHL.com"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.906,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.653,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The NHL's Utah Mammoth team has completed the construction of a state-of-the-art training facility in under 13 months. This development is part of the team's commitment to enhancing the capabilities of their players and contributing positively to the local community.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Company to Add Manual Door Releases After Trapping Incidents",
    "domain": "technology",
    "source_domain": "techcrunch.com",
    "location": "global",
    "published": "Wed, 17 Sep 2025 20:23:42 +0000",
    "source": "TechCrunch",
    "sources": [
      "Ars Technica",
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com",
      "arstechnica.com"
    ],
    "snippets": [
      "Chief designer Franz von Holzhausen said Wednesday that the company is \"working on\" combining the electronic and manual door releases after owners have reported getting trapped.",
      "Cars have lost 12 V power, trapping children and dogs in hot cars."
    ],
    "image_url": "",
    "titles": [
      "Tesla is redesigning its door handles following safety probe, Bloomberg investigation",
      "Tesla Model Y door handles now under federal safety scrutiny"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.923,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.65,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Chief designer Franz von Holzhausen announced that the company plans to integrate electronic and manual door releases in response to reports of owners, including children and dogs, being trapped inside cars due to loss of 12 V power.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Senators Seek Trade for Formenton, Won't Return After Acquittal",
    "domain": "sports",
    "source_domain": "ottawacitizen.com",
    "location": "local",
    "published": "Wed, 17 Sep 2025 20:18:13 +0000",
    "source": "Ottawa Citizen",
    "sources": [
      "CityNews",
      "Ottawa Citizen"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "ottawacitizen.com"
    ],
    "snippets": [
      "Alex Formenton&#8217;s days with the Ottawa Senators are over. Steve Staios, the club&#8217;s president of hockey operations and general manager, confirmed on the first day of training camp at the Canadian Tire Centre that the Senators are trying to trade the rights of the restricted free agent forw",
      "Ottawa&#160;Senators general manager Steve Staios says Alex Formenton won&#8217;t return to the team when the winger becomes eligible to return to the NHL. Formenton was one of five players acquitted in July of sexual assault charges stemming from an incident in London, Ont., in 2018 when they were "
    ],
    "image_url": "",
    "titles": [
      "Steve Staios confirms Alex Formenton won’t return as Senators explore trade options",
      "Ottawa GM Staios says Formenton won’t return to Senators after acquittal"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.921,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.646,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Alex Formenton will not be returning to the Ottawa Senators, as confirmed by the team's general manager, Steve Staios. The Senators are seeking to trade the rights of Formenton, a restricted free agent forward. This decision comes after Formenton was acquitted of sexual assault charges from an incident in 2018.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Welcomed by UK Royals at Windsor Castle",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 17 Sep 2025 20:37:24 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "New York Times"
    ],
    "domains": [
      "www.nytimes.com",
      "www.bbc.com"
    ],
    "snippets": [
      "President Trump greeted by the King and Queen and other senior royals at Windsor Castle.",
      "Lavish courses for the visit by the American president."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/4755/live/5837e4d0-93e4-11f0-9cf6-cbf3e73ce2b9.jpg",
    "titles": [
      "In pictures: All the best images from the day at Windsor Castle",
      "Here’s the menu for the state dinner at Windsor Castle."
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.908,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.644,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "President Trump was welcomed by the King and Queen of England, along with other senior royals, during his visit to Windsor Castle. Lavish arrangements were made for the American president's stay.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Saudi Arabia, Pakistan Pact: Mutual Defense Against Attacks Amid Gulf Tensions",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Wed, 17 Sep 2025 19:30:24 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Financial Times"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.ft.com"
    ],
    "snippets": [
      "Pact declares any attack on Saudi Arabia or Pakistan an attack on both, deepening shared security alliance.",
      "Deal with nuclear-armed power comes a week after Gulf states were deeply rattled by Israeli attack on Hamas leaders in Doha"
    ],
    "image_url": "",
    "titles": [
      "Saudi Arabia signs mutual defence pact with nuclear-armed Pakistan",
      "Saudi Arabia signs ‘strategic mutual defence’ pact with Pakistan"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.906,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.643,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Saudi Arabia and Pakistan have signed a pact declaring that any attack on one nation is considered an attack on both, reinforcing their security alliance. This agreement, involving a nuclear-armed country, was established a week after Gulf states experienced heightened tensions due to an Israeli attack on Hamas leaders in Doha.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Arne Slot Celebrates Birthday with Isak's Anfield Debut in UCL Match",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 17 Sep 2025 23:24:37 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Yahoo Sports"
    ],
    "domains": [
      "www.bbc.com"
    ],
    "snippets": [
      "Liverpool boss Arne Slot enjoys a dramatic birthday as record signing Alexander Isak samples Anfield's Champions League power, says chief football writer Phil McNulty.",
      "Liverpool boss Arne Slot enjoys a dramatic birthday as record signing Alexander Isak samples Anfield's Champions League power, says chief football writer Phil McNulty."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/518f/live/be208900-9416-11f0-84c8-99de564f0440.jpg",
    "titles": [
      "Slot gets late birthday gift as Isak samples power of Anfield",
      "Slot gets late birthday gift as Isak samples power of Anfield"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.962,
      "consensus": 0.571,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.642,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "On his birthday, Liverpool manager Arne Slot experienced a dramatic event as the team's record signing, Alexander Isak, was introduced to the power of Anfield during a Champions League match, according to chief football writer Phil McNulty.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "NASA Confirms Discovery of 6,000th Exoplanet",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Wed, 17 Sep 2025 16:57:04 EDT",
    "source": "Phys.org",
    "sources": [
      "NASA",
      "Phys.org"
    ],
    "domains": [
      "www.nasa.gov",
      "phys.org"
    ],
    "snippets": [
      "The official number of exoplanets—planets outside our solar system—tracked by NASA has reached 6,000. Confirmed planets are added to the count on a rolling basis by scientists from around the world, so no single planet is considered the 6,000th entry. The number is monitored by NASA's Exoplanet Scie",
      "The milestone highlights the accelerating rate of discoveries, just over three decades since the first exoplanets were found. The official number of exoplanets — planets outside our solar system — tracked by NASA has reached 6,000. Confirmed planets are added to the count on a rolling basis by scien"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/nasas-tally-of-planets.jpg",
    "titles": [
      "NASA's tally of planets outside our solar system reaches 6,000",
      "NASA’s Tally of Planets Outside Our Solar System Reaches 6,000"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.934,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.642,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "NASA's Exoplanet Science Institute has confirmed that the number of exoplanets—planets outside our solar system—has reached 6,000. This milestone, achieved over three decades since the first discoveries, underscores the accelerating pace of exoplanet identification. Scientists worldwide contribute to this rolling count, with no single planet designated as the 6,000th.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Israel Continues Gaza Offensive Amid Global Critique",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 17 Sep 2025 18:52:53 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "New York Times"
    ],
    "domains": [
      "www.nytimes.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The sight of tanks in Sheikh Radwan has caused widespread alarm among residents, with thousands fleeing south.",
      "We bring together pieces of Times journalism to help you understand the big picture.",
      "Some of Israel’s oldest allies criticized its latest military assault in Gaza and warned of a deepening humanitarian crisis."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/6a33/live/c9987000-9415-11f0-84c8-99de564f0440.jpg",
    "titles": [
      "Israeli tanks push into major Gaza City residential area",
      "Israel’s Push Into Gaza City",
      "European Countries Condemn Israel’s Ground Offensive in Gaza City"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.876,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.637,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Israel's military offensive in Gaza City, aimed at defeating approximately 3,000 Hamas fighters, continues amidst international condemnation. The operation has led to relentless bombing in the area, impacting Palestinians living there.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Natalie Nakase Wins 2025 WNBA Coach of the Year Award",
    "domain": "business",
    "source_domain": "www.forbes.com",
    "location": "global",
    "published": "Wed, 17 Sep 2025 15:36:17 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes",
      "Sportsnet"
    ],
    "domains": [
      "www.forbes.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Natalie Nakase has been named the 2025 State Street Investment Management SPY WNBA Coach of the Year.",
      "<p>After guard Veronica Burton was named the WNBA&#8217;s most improved player, Valkyries head coach Natalie Nakase is set to walk away with the league&#8217;s Coach of the Year award, the WNBA announced Wednesday.</p>"
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/68cb0b923bd123cfe42e6261/0x0.jpg?width=960",
    "titles": [
      "Golden State Valkyries Natalie Nakase Named 2025 WNBA Coach Of The Year",
      "Valkyries’ Natalie Nakase named WNBA coach of the year"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.908,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.637,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Natalie Nakase, the head coach of the Valkyries, has been awarded the 2025 State Street Investment Management SPY WNBA Coach of the Year, following Veronica Burton's recognition as the WNBA's most improved player. This announcement was made by the WNBA on Wednesday.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Chimpanzees Consume Alcohol Naturally Through Ripe Fruit, Study Finds",
    "domain": "science",
    "source_domain": "www.newscientist.com",
    "location": "global",
    "published": "Wed, 17 Sep 2025 20:00:18 +0100",
    "source": "New Scientist",
    "sources": [
      "Phys.org",
      "New Scientist"
    ],
    "domains": [
      "phys.org",
      "www.newscientist.com"
    ],
    "snippets": [
      "Chimpanzees are consuming significant levels of alcohol from their diet of ripe fruit and the finding may help explain the origins of humans’ taste for alcohol",
      "The first-ever measurements of the ethanol content of fruits available to chimpanzees in their native African habitat show that the animals could easily consume the equivalent of more than two standard alcoholic drinks each day, according to researchers at the University of California, Berkeley."
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/09/17120504/SEI_266487197.jpg",
    "titles": [
      "Wild chimpanzees may get mildly intoxicated from alcoholic fruit",
      "In the wild, chimpanzees likely ingest the equivalent of several alcoholic drinks every day"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.897,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.634,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Researchers at the University of California, Berkeley, have discovered that chimpanzees in Africa consume significant amounts of alcohol by eating ripe fruit. Their study, the first to measure the ethanol content in fruits eaten by chimpanzees, suggests these animals can ingest the equivalent of over two standard alcoholic drinks daily. This finding might help explain the origins of the human preference for alcohol.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Susan Monarez Testifies RFK Jr. Pressured Her on Vaccine Stance, Staff Firings",
    "domain": "science",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Wed, 17 Sep 2025 16:34:14 GMT",
    "source": "Axios",
    "sources": [
      "Wired",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "www.wired.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMickFVX3lxTE80VTBScC0yZ3ZrVkcwU3l2QWI2LVdiaWgwaW8tYW1xTGhQU09TVGFhU2tqSWd3Vk1vMFNtRUpFbEp0Y2xuSlFNS001c1JGTW5yMDZGRWZJa25IdlM2TFAxYnF4NzVoQ0tCUkJ0Q0QwcExtZw?oc=5\" target=\"_blank\">Ex-CDC official says RFK Jr. pressured her to stay silent</a>&nbsp;&nbsp;",
      "Susan Monarez told a Senate committee that Robert F. Kennedy Jr. demanded she dismiss career officials without cause—and accept vaccine recommendations regardless of whether science backed them up."
    ],
    "image_url": "",
    "titles": [
      "Ex-CDC official says RFK Jr. pressured her to stay silent - Axios",
      "Fired CDC Director Says RFK Jr. Pressured Her to Blindly Approve Vaccine Changes"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.835,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.632,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Susan Monarez testified before a Senate committee that Robert F. Kennedy Jr. pressured her to fire career officials without cause and to accept vaccine recommendations without scientific support.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Beijing Seeks Chip Independence, Bans Nvidia AI Chips Amid US Tech Rivalry",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Wed, 17 Sep 2025 15:38:14 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Ars Technica"
    ],
    "domains": [
      "www.cnbc.com",
      "arstechnica.com"
    ],
    "snippets": [
      "Nvidia CEO Jensen Huang commented after a report that China has banned the use of the company's AI chips.",
      "China steps up efforts to boost semiconductor independence, compete with US."
    ],
    "image_url": "",
    "titles": [
      "Nvidia CEO says he's 'disappointed' after report China has banned its AI chips",
      "China blocks sale of Nvidia AI chips"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.819,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.626,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Beijing is intensifying its push for semiconductor independence to compete with the US, following a ban by the Cyberspace Administration of China on Alibaba, ByteDance, and other tech companies from purchasing or testing Nvidia's RTX Pro 6000D AI chips, specifically designed for the Chinese market. This move underscores the escalating tech rivalry between China and the US.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Half of Americans More Concerned Than Excited About AI: Pew Study",
    "domain": "technology",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Wed, 17 Sep 2025 14:34:57 GMT",
    "source": "Axios",
    "sources": [
      "The Verge",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "www.theverge.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMieEFVX3lxTE43SjBmV1dBRzZVSFJIUkI4VGtaeGhTSUg4X1dKR2REOGhjZTlZSmJEZjBTSXlxMXQ5QmowWkFKVVg2VGM4dmhtY0JxLXYyc2hBeG1OeFBUVDlpRFJFcVVuUmt4YlFYX0RNS0JmZWdnVl9vWW1jb1BsRA?oc=5\" target=\"_blank\">Americans don't want to turn everything over to AI</a>&nbsp;&nbsp",
      "A new study from Pew suggests that Americans aren’t particularly optimistic about AI. A full 50 percent of respondents said they were more concerned than excited about the use of AI in their daily lives. That’s down ever so slightly from 52 percent in 2023, but it’s up significantly from 37 percent "
    ],
    "image_url": "",
    "titles": [
      "Americans don't want to turn everything over to AI - Axios",
      "Americans want AI to stay out of their personal lives"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.801,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.622,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A recent Pew study found that 50% of Americans are more concerned than excited about AI's role in their lives, a slight decrease from 52% in 2023 but a significant increase from 37% previously. This indicates a growing apprehension towards AI among the US population.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "\"Belly Chooses in 'The Summer I Turned Pretty' Season 3 Finale\"",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 17 Sep 2025 11:42:48 GMT",
    "source": "BBC",
    "sources": [
      "Forbes",
      "BBC"
    ],
    "domains": [
      "www.forbes.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Spoiler warning: The much-anticipated final episode reveals how the talked-about TV show's plot ends.",
      "“The Summer I Turned Pretty” isn't over yet! Prime Video just greenlit a feature film that will follow the next \"milestone\" in Belly's life. Here’s everything we know so far."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/cbc9/live/e793fd20-83ff-11f0-bd2b-c9a8fb561af5.jpg",
    "titles": [
      "The Summer I Turned Pretty reaches emotional climax",
      "‘The Summer I Turned Pretty’ Movie Announced After Season 3 Finale—Here’s What To Know"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.754,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.606,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "\"The Summer I Turned Pretty\" Season 3 finale concludes with Belly making a definitive choice between Conrad and Jeremiah, resolving the central romantic conflict of the series. The final episode's outcome and implications for the characters' futures are addressed, marking the end of the show's storyline.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]