[
  {
    "title": "South Korea to Repatriate 300 Workers Detained in ICE Raid at Hyundai-LG in Geor",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sun, 07 Sep 2025 07:13:08 -0400",
    "source": "NPR",
    "sources": [
      "LA Times",
      "Financial Times",
      "Washington Post",
      "New York Times",
      "Business Insider",
      "NPR"
    ],
    "domains": [
      "www.businessinsider.com",
      "www.ft.com",
      "www.latimes.com",
      "www.washingtonpost.com",
      "www.npr.org",
      "www.nytimes.com"
    ],
    "snippets": [
      "More than 300 South Korean workers were detained in an immigration raid on Thursday. Presidential chief of staff Kang Hoon-sik said South Korea plans to send a charter plane to bring the workers home.",
      "Hyundai-LG site in Georgia targeted in biggest ICE operation of Trump’s administration",
      "South Korea said it intends to repatriate the more than 300 of its nationals who were detained during an immigration raid on a Hyundai factory in Georgia.",
      "The South Korean government said on Sunday that it would send a charter plane to the United States to retrieve hundreds of workers detained in an immigration raid.",
      "<p>South Korea says it has a deal for release of those caught in Hyundai Georgia raid.</p>",
      "\"This, in fact, was the largest single-site enforcement operation in the history of Homeland Security investigations,\" a DHS official said."
    ],
    "image_url": "",
    "titles": [
      "South Korea says it has reached a deal with the US for the release of workers in a Georgia plant",
      "South Korea charters plane to repatriate workers after US battery factory raid",
      "South Korea announces deal to repatriate workers detained in Hyundai raid",
      "South Korea Negotiates Release of Korean Workers Detained in Georgia Raid",
      "South Korea, irked at U.S. raid at Hyundai plant, announces deal for detainees' release",
      "South Korea says it has finished talks with the US to return nationals detained in an ICE raid on a Hyundai facility"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.764,
      "consensus": 1.0,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.838,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Over 300 South Korean workers were detained in the largest ICE raid of Trump's administration at a Hyundai-LG site in Georgia. South Korea announced plans to repatriate the workers, stating a charter plane will be sent to the U.S. once administrative procedures are completed. The South Korean government's action follows the significant immigration enforcement operation, highlighting its commitment to assisting its nationals abroad.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Alcaraz Wins Second US Open, Regains World No. 1 Ranking",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 07 Sep 2025 22:09:49 GMT",
    "source": "BBC",
    "sources": [
      "ESPN",
      "Deutsche Welle",
      "The Guardian",
      "Sportsnet",
      "Sky Sports",
      "Al Jazeera",
      "Forbes",
      "BBC"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.forbes.com",
      "www.espn.com",
      "www.theguardian.com",
      "www.bbc.com",
      "www.skysports.com",
      "www.dw.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Carlos Alcaraz triumphs in the latest chapter of his compelling rivalry with Jannik Sinner, earning a four-set victory to regain the US Open title.",
      "Alcaraz returns to number one spot after winning his sixth Grand Slam title and second of 2025 in four sets in New York.",
      "Alcaraz wins his second Grand Slam of the year by beating Sinner in the US Open men&#039;s singles final in New York.",
      "By beating Jannik Sinner in four sets, Carlos Alcaraz once again becomes the world's number one tennis player. The US Open final was delayed due to tightened security measures owing to the presence of Donald Trump.",
      "Carlos Alcaraz reasserted his superiority over Jannik Sinner with a 6-2, 3-6, 6-1, 6-4 win Sunday in the US Open final -- the third Grand Slam tournament in a row where these rivals met to decide the champion -- for his second title at Flushing Meadows.",
      "<ul><li><p>Spaniard wins final 6-2, 3-6, 6-1, 6-4</p></li><li><p>Alcaraz new world No 1 after victory</p></li></ul><p>When Carlos Alcaraz is fully focused and his impossibly complete game is in full flow, nothing in the world can stop him. As he has spent the early years of his career collecting maj",
      "Carlos Alcaraz dethroned Jannik Sinner in sensational fashion to seal his second US Open title and become new world No 1 after security delays frustrated fans.",
      "<p>Watch as Carlos Alcaraz serves an ace vs. Jannik Sinner to win his second US Open title in four sets and claim his sixth career Grand Slam victory.</p>",
      "Jannik Sinner took an injury timeout during his semifinal victory on Friday. Here's what he said about his status before his 2025 U.S. Open Final against Carlos Alcaraz"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/ae90/live/3d244610-8c38-11f0-b619-ffd5de982357.jpg",
    "titles": [
      "Alcaraz edges Sinner trilogy to win US Open",
      "Alcaraz beats Sinner to lift US Open 2025 trophy as Trump watches on",
      "US Open final 2025 updates: Alcaraz beats Sinner 6-2, 3-6, 6-1, 6-4",
      "Carlos Alcaraz beats Jannik Sinner to win second US Open title",
      "Alcaraz bests Sinner to win US Open, sixth Slam",
      "Carlos Alcaraz powers past Jannik Sinner in four sets to win US Open",
      "Alcaraz dethrones Sinner to win second US Open and become world No 1",
      "Alcaraz wins US Open with perfect ace vs. Sinner",
      "Jannik Sinner Injury Update Before US Open Final Vs. Carlos Alcaraz"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.94,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.838,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Carlos Alcaraz defeated Jannik Sinner in four sets (6-2, 3-6, 6-1, 6-4) to win his second US Open title and his sixth Grand Slam. This victory in New York also returned Alcaraz to the world number one ranking. The final, which marked the third consecutive Grand Slam final between Alcaraz and Sinner, experienced delays due to heightened security measures.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Japan PM Ishiba Resigns After Election Loss, Aims to Unite Party",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sun, 07 Sep 2025 05:13:46 -0400",
    "source": "NPR",
    "sources": [
      "Deutsche Welle",
      "The Guardian",
      "CNBC",
      "New York Times",
      "NPR"
    ],
    "domains": [
      "www.cnbc.com",
      "www.theguardian.com",
      "www.npr.org",
      "www.dw.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "Japan's Prime Minister Shigeru Ishiba has expressed his intention on Sunday to step down following growing calls from his party to take responsibility for a historic defeat in July's parliamentary election.",
      "Shigeru Ishiba's ruling coalition suffered a historic setback in national elections in July.",
      "Ishiba had faced calls for his resignation after the ruling Liberal Democratic Party failed to secure a majority in the lower house election on Oct. 27.",
      "The embattled leader is trying to head off a deep split in his party over a right-wing political surge, a weakened economy and turbulent trade relations with the United States.",
      "<p>Public broadcaster says prime minister has made decision to avoid divide within his Liberal Democratic party</p><p><a href=\"https://www.theguardian.com/world/japan\">Japan</a>’s prime minister, <a href=\"https://www.theguardian.com/world/2024/sep/27/who-is-new-japan-prime-minister-shigeru-ishiba\">S"
    ],
    "image_url": "",
    "titles": [
      "Japan's Prime Minister Shigeru Ishiba to resign",
      "Japanese Prime Minister Ishiba announces resignation",
      "Japan Prime Minister Ishiba Shigeru says he will step down after election setback",
      "Prime Minister Shigeru Ishiba of Japan Says He Will Step Down",
      "Japan PM Shigeru Ishiba to resign amid fallout from disastrous elections"
    ],
    "score_components": {
      "magnitude": 0.964,
      "recency": 0.733,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.808,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Japan's Prime Minister Shigeru Ishiba has announced his resignation due to pressure from his party after a significant defeat in the July parliamentary elections. His decision aims to prevent a split in the Liberal Democratic Party, following criticism over handling the economy, a right-wing political rise, and strained U.S. trade relations. Ishiba, who took office with promises of revitalizing Japan and addressing demographic challenges, faced further calls for resignation after failing to secure a majority in the October 27 lower house election.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Carlo Acutis Canonized as First Millennial Saint by Pope Leo XIV",
    "domain": "sports",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sun, 07 Sep 2025 04:00:00 -0400",
    "source": "NPR",
    "sources": [
      "Deutsche Welle",
      "ABC News",
      "Al Jazeera",
      "NPR",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "abcnews.go.com",
      "www.npr.org",
      "www.dw.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Carlo Acutis, who died of leukemia at 15 in 2006, is known in the Catholic Church as \"God's influencer\" for harnessing technology to spread the word about miracles.",
      "Before his death at 15, Carlo Acutis was known for his love of technology and had created a website to document miracles.",
      "Carlo Acutis, a digital pioneer, used his computer skills to spread Catholic teaching globally.",
      "'Cyber-apostle' Carlo Acutis, who died of leukaemia in 2006 aged just 15, was officially canonized at the Vatican on Sunday. Pope Leo said he was happy to see many young Catholics attending the ceremony.",
      "Pope Leo XIV has declared a 15-year-old computer whiz the Catholic Church's first millennial saint."
    ],
    "image_url": "",
    "titles": [
      "A teen nicknamed 'God's influencer' has become the first millennial saint",
      "Teen gamer who 'performed miracles' becomes  first millennial saint",
      "Pope Leo declares teen millennial , known as ‘God’s influencer’, a saint",
      "Vatican: 'God's influencer' declared first millennial saint",
      "WATCH:  Teen influencer becomes Catholic Church's 1st millennial saint"
    ],
    "score_components": {
      "magnitude": 0.964,
      "recency": 0.714,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.804,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Carlo Acutis, a London-born Italian teenager who died of leukemia in 2006 at age 15, was canonized by Pope Leo XIV at the Vatican, becoming the Catholic Church's first millennial saint. Known as \"God's influencer\" and a \"cyber-apostle,\" Acutis used his computer skills to document and spread Catholic teachings, particularly about miracles. His canonization, celebrated in an open-air mass attended by many young Catholics, highlights his role as a relatable figure for new generations, emphasizing his blend of typical teenage interests and devout faith. Acutis is credited with two miracles since h",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Russia's Air Assault on Ukraine: 805 Drones, 13 Missiles, 5 Dead",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 07 Sep 2025 18:59:40 GMT",
    "source": "BBC",
    "sources": [
      "Washington Post",
      "New York Times",
      "Deutsche Welle",
      "BBC"
    ],
    "domains": [
      "www.washingtonpost.com",
      "www.dw.com",
      "www.nytimes.com",
      "www.bbc.com"
    ],
    "snippets": [
      "It is the first time a Kyiv government building - in the heavily protected city centre - has been hit since Russia launched its full-scale invasion.",
      "Russia carries out massive strikes, attacking Ukraine with 805 drones and 13 missiles. The attacks set fire to Ukraine's cabinet of ministers building.",
      "Russia unleashed a massive air assault on Ukraine early Sunday, setting the main government building in Kyiv ablaze for the first time during the war.",
      "Ukrainians said it was the first time a key building in Kyiv’s government district had been damaged since the war began. Russia has kept attacking despite Trump administration efforts at peace talks."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/e006/live/9d7ada90-8bae-11f0-94f7-a595856b120f.jpg",
    "titles": [
      "Zelensky condemns 'ruthless attack' after Russia hits main government building in Kyiv",
      "Ukraine: Russia hits government building amid record assault",
      "Russia’s largest-ever air attack on Ukraine burns Kyiv government building",
      "Russia Strikes Ukraine Government Building in Largest Drone Assault of War"
    ],
    "score_components": {
      "magnitude": 0.932,
      "recency": 0.88,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.779,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Russia launched a significant air assault on Ukraine, employing 805 drones and 13 missiles, targeting various locations including Kyiv. This attack marked the first time a government building in Kyiv's city center was hit, specifically setting the Cabinet of Ministers building on fire. The assault resulted in at least five fatalities across Ukraine. This incident is notable for the damage to a key government facility in Kyiv since the full-scale invasion began in 2022.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Rory McIlroy Wins Irish Open in Playoff, Secures Career Grand Slam",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sun, 07 Sep 2025 19:16:04 +0000",
    "source": "CBS Sports",
    "sources": [
      "Sky Sports",
      "The Guardian",
      "Sports Illustrated",
      "CBS Sports"
    ],
    "domains": [
      "news.google.com",
      "www.cbssports.com",
      "www.theguardian.com",
      "www.skysports.com"
    ],
    "snippets": [
      "McIlroy's career grand slam-clinching campaign got even sweeter Sunday",
      "<ul><li><p>World No 2 edges out Lagergren at third extra hole</p></li><li><p>‘I’m so lucky I get to do this in front of these people’</p></li></ul><p>Rory McIlroy savoured “a pretty cool year” after adding a second Irish Open title to his Masters win. The world No 2 completed the career grand slam w",
      "<a href=\"https://news.google.com/rss/articles/CBMifEFVX3lxTE4wMEdLbnYwckl2OWRSa0NVaHJwTkVudDBWME1wc21tUmpqSDhwb1JSRnVrbDhUMXJXeDRGU3U3RnNHbnlJNVlYam4ycld5VlFmS19ReVlNMWpabTdaVG9qNFM1d2hSM3BOT1hhelBPZENjNnQxNTFWLUdEXzM?oc=5\" target=\"_blank\">Rory McIlroy Rallies to Win Irish Open in Dramatic Playoff</",
      "Rory McIlroy produced a sensational a final-hole eagle to force a play-off before defeating Joakim Lagergren in a remarkable finish to the Amgen Irish Open."
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/07/d1865edb-333b-490b-af5b-68f17c9ca3de/rory-mcilroy-irish-open-g.jpg",
    "titles": [
      "Rory McIlroy wins Irish Open after forcing playoff with eagle on 72nd hole, claiming fourth victory of 2025",
      "Rory McIlroy savours home win after thrilling Irish Open playoff victory",
      "Rory McIlroy Rallies to Win Irish Open in Dramatic Playoff - Sports Illustrated",
      "McIlroy snatches Irish Open win in play-off after final-round thriller"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.903,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.77,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Rory McIlroy won the Irish Open in a dramatic playoff against Joakim Lagergren, securing his second title at this event after a final-hole eagle pushed the match to extra holes. This victory adds to McIlroy's successful year, which includes completing the career grand slam. McIlroy expressed gratitude for the opportunity to achieve these milestones in front of supportive fans.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Rodgers Leads Steelers to Win Over Jets with 4 TD Passes",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sun, 7 Sep 2025 19:39:20 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sports Illustrated",
      "CBS Sports"
    ],
    "domains": [
      "news.google.com",
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "Aaron Rodgers threw four touchdown passes Sunday to help the Steelers win their opener and show the Jets that he 'still can' play.",
      "Here's what we know after Pittsburgh's first game of the season",
      "Rodgers takes extra delight in Sunday's win against his former team",
      "<a href=\"https://news.google.com/rss/articles/CBMimwFBVV95cUxNMUNLV0dnVG45OUJmNEpTVVJ3Y0NWdFhVQmMxQ0FtbUl2MGhYQXkyaEVPUE9IdTZ6YmlhYXRnM25FWmpYeGhpOXlNYVB5bE9QU2RmRkk0cm8tTTU0WnFYZV94M2JTcHViNG54RlNmT25Kb3FUanI1MG9sZXM4eE5jakN0ZmRKd2ZyRU43TVNvOEdTTUVXMXhpNHdiZw?oc=5\" target=\"_blank\">Aaron Rodgers Unl",
      "<a href=\"https://news.google.com/rss/articles/CBMieEFVX3lxTE9lTHl1NHA3NlQ1d1hZUDM2YVlMYUF2X0lUMU1vcE94SkVOQTFQM2gxeEsxc1pYQ3RnaFIzeVBzUzhMRWpCLTF0cElVZjBEbmpja0hiWVRHN3p2Q1k5a25ZUUJudUJOUHl3eTFXV2EwTkloTUlfcFE5Tg?oc=5\" target=\"_blank\">Aaron Rodgers Had Cocky Gesture After Beating Jets in Steelers' S"
    ],
    "image_url": "",
    "titles": [
      "Steelers' Rodgers shows Jets he still has it in win",
      "Steelers overreactions from Week 1 win: Aaron Rodgers still elite? Is the run defense still horrible?",
      "Aaron Rodgers sounds off after leading Steelers to a win over Jets",
      "Aaron Rodgers Unleashes Savage Line About Jets After Steelers’ Week 1 Win - Sports Illustrated",
      "Aaron Rodgers Had Cocky Gesture After Beating Jets in Steelers' Season Opener - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.99,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.76,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Aaron Rodgers led the Pittsburgh Steelers to victory in their season opener against the Jets, throwing four touchdown passes. This performance was particularly satisfying for Rodgers as it came against his former team, showcasing his ongoing prowess in the game. The win highlights Rodgers' capability and the Steelers' strong start to the season.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Giants' Coach Daboll Noncommittal on Wilson as Week 2 Starter",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sun, 7 Sep 2025 19:39:20 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet",
      "CBS Sports"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "Giants coach Brian Daboll was hardly definitive on his QB situation entering Week 2 following Sunday's loss to the Commanders, one that saw Russell Wilson struggle throughout.",
      "Daboll gave non-answers on whether he'd commit to Wilson, but did not consider putting in Jaxson Dart as Giants get smoked by Commanders",
      "<p>New York Giants head coach Brian Daboll says the team will watch tape when making a quarterback decision for week two, but adds everyone has to be better.</p>"
    ],
    "image_url": "",
    "titles": [
      "Daboll noncommittal on Giants QB for Week 2",
      "Brian Daboll noncommittal on Russell Wilson as Week 2 starter after Giants' season opening dud",
      "‘This game isn’t on Russell Wilson’: Daboll on week 2 quarterback"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.99,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.76,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "After a loss to the Commanders where quarterback Russell Wilson struggled, New York Giants coach Brian Daboll did not commit to Wilson as the starter for Week 2. Daboll mentioned the team would review game tape before making a quarterback decision and emphasized the need for overall improvement. He also did not consider replacing Wilson with Jaxson Dart during the game.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Attends US Open Final, Elicits Mixed Crowd Reactions",
    "domain": "sports",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Sun, 07 Sep 2025 18:54:32 GMT",
    "source": "The Guardian",
    "sources": [
      "Forbes",
      "The Guardian",
      "Global News"
    ],
    "domains": [
      "globalnews.ca",
      "www.forbes.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "<ul><li><p>US president attends <a href=\"https://www.theguardian.com/sport/live/2025/sep/07/us-open-tennis-2025-jannik-sinner-v-carlos-alcaraz-mens-singles-final-live\">Sinner v Alcaraz final</a></p></li><li><p>USTA told broadcasters not to show crowd reaction</p></li></ul><p>Donald Trump was booed a",
      "President Donald Trump was greeted with a mixture of cheers and boos when he arrived for the start of the U.S. Open men's tennis final match in New York on Sunday.",
      "The United States Tennis Association reportedly asked broadcasters to “refrain from showcasing any disruptions or reactions” to the president’s visit on Sunday."
    ],
    "image_url": "https://i.guim.co.uk/img/media/6648a7823188d75c990e3b3decf988630db12149/30_0_5902_4723/master/5902.jpg?width=140&quality=85&auto=format&fit=max&s=5ab941e6241bc072a7e1d6832bb8af73",
    "titles": [
      "Crowd greets Donald Trump with boos and cheers at US Open men’s final",
      "Trump arrives at US Open to cheers and boos, prompts security delay",
      "Donald Trump Receives Boos While Attending US Open Men’s Final (Photos)"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.878,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.719,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "President Donald Trump attended the U.S. Open men's final between Sinner and Alcaraz in New York, where he received mixed reactions from the crowd, including cheers and boos. The USTA requested broadcasters to avoid showing crowd reactions to Trump's presence.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "890 Arrested at London Protest Against Palestine Action Ban",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sun, 07 Sep 2025 15:21:43 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Financial Times",
      "The Guardian",
      "Al Jazeera"
    ],
    "domains": [
      "www.ft.com",
      "www.theguardian.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Organisers say detained demonstrators include &#039;vicars and priests, war veterans and descendants of Holocaust survivors&#039;.",
      "London force hits out at ‘exceptional level of abuse’ at demonstration in support of banned group",
      "<p>Demonstration in central London on Saturday led to 857 arrests under Terrorism Act</p><p>A total of 890 arrests were made at a demonstration in central London on Saturday against the banning of the protest group Palestine Action.</p><p>Police arrested 857 people under the Terrorism Act for showin"
    ],
    "image_url": "",
    "titles": [
      "UK police arrest almost 900 protesters at pro-Palestine Action rally",
      "Met police arrest almost 900 people at Palestine Action protest",
      "Almost 900 people arrested at Palestine Action ban protest, say Met police"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.833,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.71,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "At a demonstration in central London against the banning of Palestine Action, 890 individuals were arrested, with 857 detentions under the Terrorism Act. The protesters, including vicars, priests, war veterans, and Holocaust survivors' descendants, voiced opposition to police actions. The London police force criticized the 'exceptional level of abuse' they faced during the event. This incident has sparked discussions on freedom of speech in the UK.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Carlo Acutis Canonized as First Millennial Saint by Pope Leo XIV",
    "domain": "sports",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Sun, 07 Sep 2025 15:03:06 GMT",
    "source": "The Guardian",
    "sources": [
      "Washington Post",
      "The Guardian",
      "New York Times"
    ],
    "domains": [
      "www.washingtonpost.com",
      "www.nytimes.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "<p>London-born Italian, who died in 2006, built websites to spread Catholic teaching and is credited with two miracles</p><p>A London-born Italian teenage computer whiz who died in 2006 age 15, has been declared the Catholic church’s first millennial saint during an open-air mass in a packed St Pete",
      "He played video games like other teenagers but was also fascinated by the Eucharist and, since his death from leukemia at age 15, is credited with two miracles.",
      "Carlo, who died at 15, was canonized alongside Pier Giorgio Frassati, who also died young. The church is looking to the two saints to inspire new generations of Catholics."
    ],
    "image_url": "https://i.guim.co.uk/img/media/806127a3cadeedf2178ffb567f215b791a0edc19/586_0_4815_3850/master/4815.jpg?width=140&quality=85&auto=format&fit=max&s=93d411ba75f56e32df6e2fcd8a4a891f",
    "titles": [
      "Carlo Acutis, ‘God’s influencer’ who died age 15, declared a saint by Pope Leo",
      "Pope Leo canonizes Carlo Acutis, the teen deemed ‘God’s Influencer’",
      "Carlo Acutis, Known as ‘God’s Influencer,’ Is Declared a Saint by Pope Leo XIV"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.81,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.706,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Carlo Acutis, a London-born Italian teenager who died of leukemia in 2006 at age 15, was canonized by Pope Leo XIV at the Vatican, becoming the Catholic Church's first millennial saint. Known as \"God's influencer\" and a \"cyber-apostle,\" Acutis used his computer skills to document and spread Catholic teachings, particularly about miracles. His canonization, celebrated in an open-air mass attended by many young Catholics, highlights his role as a relatable figure for new generations, emphasizing his blend of typical teenage interests and devout faith. Acutis is credited with two miracles since h",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Verstappen Wins Italian GP, Extends Lead in Championship",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sun, 07 Sep 2025 15:29:17 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Forbes",
      "Al Jazeera",
      "Le Monde"
    ],
    "domains": [
      "www.lemonde.fr",
      "www.forbes.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Verstappen earned his third Italian GP at the famous track and is the first driver to win from pole at Monza since 2019.",
      "Près de quatre mois après son dernier succès, le Néerlendais de l’équipe Red Bull a largement remporté le Grand Prix d’Italie, dimanche à Monza. Il a devancé les deux pilotes McLaren Lando Norris et Oscar Piastri, à la lutte pour le titre mondial.",
      "Max Verstappen conquers Monza with record pace and clinical dominance, as McLaren’s team orders spark tension and Ferrari falters at its home race."
    ],
    "image_url": "",
    "titles": [
      "Max Verstappen wins F1 Italian Grand Prix at Monza",
      "Max Verstappen renoue avec la victoire en s’imposant au Grand Prix d’Italie de Formule 1",
      "Max Verstappen Delivers A Monza Masterclass Winning F1 Italian GP"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.835,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.704,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Max Verstappen won the Italian Grand Prix at Monza, marking his third victory at this track and the first win from pole position since 2019. Dominating the race, he finished ahead of McLaren drivers Lando Norris and Oscar Piastri. This win comes nearly four months after his last victory, showcasing his clinical pace and extending his lead in the world championship. The race also highlighted team tension within McLaren and a disappointing performance by Ferrari at their home race.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Canada's EV Policy Rollback Sparks Infrastructure Concerns",
    "domain": "business",
    "source_domain": "financialpost.com",
    "location": "national",
    "published": "Sun, 07 Sep 2025 17:33:25 +0000",
    "source": "Financial Post",
    "sources": [
      "CityNews",
      "Financial Post"
    ],
    "domains": [
      "financialpost.com",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "Not much changed immediately for electric vehicle drivers across Canada after the federal government announced a step back from its EV policy. But many drivers fear infrastructural growth and improved public charging stations will slow in the coming years. When Julien Kos drove to Moncton earlier th",
      "Not much changed immediately for electric vehicle drivers across Canada after the federal government announced a step back from its EV policy. But many drivers fear infrastructural growth and improved public charging stations will slow in the coming years. When Julien Kos drove to Moncton earlier th"
    ],
    "image_url": "",
    "titles": [
      "Many EV owners say they’re undeterred after the federal government’s mandate pause",
      "Many EV owners say they’re undeterred after the federal government’s mandate pause"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.872,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 1.0
    },
    "score": 0.689,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Following the federal government's decision to scale back its electric vehicle (EV) policy, immediate changes for EV drivers in Canada were minimal. However, there is widespread concern among drivers that this could lead to a slowdown in the development of EV infrastructure and public charging facilities in the future.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Indiana Fever Clinches Playoff Spot, Beats Mystics 94-65",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sun, 7 Sep 2025 19:39:20 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "Aliyah Boston had 12 points and 11 rebounds as the Fever, who have lost five players to season-ending injuries, clinched a playoff spot with a 94-65 rout of Washington.",
      "<p>Natasha Howard scored 17 points and the Indiana Fever beat the Washington Mystics 94-65 on Sunday to clinch a spot in the 2025 WNBA playoffs.</p>"
    ],
    "image_url": "",
    "titles": [
      "Injury-riddled Fever drub Mystics for playoff spot",
      "Fever clinch playoff spot with blowout win over Mystics"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.99,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.678,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Aliyah Boston contributed 12 points and 11 rebounds, helping the Indiana Fever, despite losing five players to season-ending injuries, secure a playoff berth by defeating the Washington Mystics 94-65. Natasha Howard led the scoring for the Fever with 17 points in the victory.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Chicago Churches Prepare for Crackdown, Advise Community",
    "domain": "general",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Sun, 07 Sep 2025 19:04:30 -0400",
    "source": "ABC News",
    "sources": [
      "ABC News",
      "The Guardian"
    ],
    "domains": [
      "abcnews.go.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Churches citywide are turning up their response from the pulpit.",
      "<p>Residents told to stay connected to family and tell people their whereabouts as city readies for expected crackdown</p><p>The Rev Marshall Hatch urged congregants of a prominent Black church on Chicago’s West Side to carry identification, stay connected to family and protest as the city readied f"
    ],
    "image_url": "https://s.abcnews.com/images/US/wirestory_02e11d79d30ca9c2c3b9f4fbef4122bb_4x3_384.jpg",
    "titles": [
      "Chicago churches urge calm resistance to expected federal intervention",
      "Chicago churches urge calm resistance as Trump threatens intervention"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.978,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.676,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Churches across the city are increasing their involvement in response to an anticipated crackdown. The Rev Marshall Hatch, from a notable Black church in Chicago's West Side, advised congregants to carry identification, maintain contact with family, and engage in protest, highlighting the community's preparation for the expected measures.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "London Underground Strike Closes Services for Four Days",
    "domain": "general",
    "source_domain": "www.nytimes.com",
    "location": "global",
    "published": "Sun, 07 Sep 2025 21:37:53 +0000",
    "source": "New York Times",
    "sources": [
      "The Guardian",
      "New York Times"
    ],
    "domains": [
      "www.nytimes.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "A strike on the London Underground began Sunday over pay and conditions, threatening to upend commuter journeys for most of the week.",
      "<p>Action will bring services to early finish on Sunday and close underground entirely for four days from Monday</p><p>Tube users have been urged to check before travelling this week as strikes by staff escalate, bringing services to an early finish on Sunday evening and closing the London Undergrou"
    ],
    "image_url": "https://static01.nyt.com/images/2025/09/07/multimedia/07int-uk-tube-strike-bpwt/07int-uk-tube-strike-bpwt-mediumSquareAt3X.jpg",
    "titles": [
      "Millions of Londoners Brace for Transit Disruption as Tube Strike Begins",
      "London tube users warned to plan for disruption as strike action escalates"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.949,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.662,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A strike affecting the London Underground started Sunday, focusing on disputes over pay and conditions. It led to an early shutdown of services on Sunday and will close the underground completely for four days starting Monday. Commuters are advised to check travel plans due to the disruptions.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UK to Create 50,000 Defence Jobs by 2035 Through New Deals",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 07 Sep 2025 21:33:39 GMT",
    "source": "BBC",
    "sources": [
      "Financial Times",
      "BBC"
    ],
    "domains": [
      "www.ft.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The government anticipates that up to 50,000 new defence jobs could be created by 2035.",
      "Funding for five deals across Britain aims to boost local economic growth"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/889e/live/eb950630-8c06-11f0-963f-9d097e3273e4.jpg",
    "titles": [
      "UK launches £250m defence strategy to boost jobs",
      "UK to kick off new defence industrial strategy with £250mn"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.928,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.651,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The government projects that by 2035, up to 50,000 new defence jobs will be created due to funding for five deals across Britain. This initiative is aimed at stimulating local economic growth.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: initiative",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Bessent Dismisses Tariff Concerns, Predicts US Economic Boost",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Sun, 07 Sep 2025 22:18:02 GMT",
    "source": "CNBC",
    "sources": [
      "The Guardian",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Bessent has warned that a delayed ruling \"could result in a scenario in which $750 billion-$1 trillion in tariffs have already been collected.\"",
      "<p>Billionaire Scott Bessent dismisses concerns about president’s levies and predicts ‘acceleration’ in US economy </p><p>US treasury secretary Scott Bessent has refused to acknowledge that the sweeping trade tariffs imposed by Donald Trump around the world are taxes on Americans.</p><p>In a new int"
    ],
    "image_url": "",
    "titles": [
      "Treasury Secretary Bessent warns of massive refunds if the Supreme Court voids Trump tariffs",
      "US treasury secretary denies Trump tariffs are tax on Americans"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.942,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.65,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Billionaire and US Treasury Secretary Scott Bessent has dismissed concerns over President Donald Trump's global trade tariffs, refusing to see them as taxes on Americans. He predicts an 'acceleration' in the US economy despite warnings that a delayed ruling could lead to $750 billion-$1 trillion in tariffs being collected.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "OPEC+ to Increase Oil Production in October, Aiming for Market Share",
    "domain": "business",
    "source_domain": "www.marketwatch.com",
    "location": "global",
    "published": "Sun, 07 Sep 2025 21:58:00 GMT",
    "source": "MarketWatch",
    "sources": [
      "Financial Post",
      "MarketWatch"
    ],
    "domains": [
      "financialpost.com",
      "www.marketwatch.com"
    ],
    "snippets": [
      "OPEC+ agreed Sunday to further increase oil production in October, in an ongoing move to regain market share at the expense of prices.",
      "OPEC+ agreed to accelerate the return of another chunk of oil that it’s been withholding from the market, as the group sticks with a strategy of prioritizing market share over prices."
    ],
    "image_url": "https://images.mktw.net/im-59513859",
    "titles": [
      "OPEC+ agrees to another oil production boost in October",
      "OPEC+ Speeds Up Return of Next Tier of Halted Oil Production"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.936,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.649,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "OPEC+ decided on Sunday to boost oil production in October, continuing its strategy to prioritize market share over prices. This involves accelerating the reintroduction of oil previously withheld from the market.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Zelenskyy: Putin Achieved Objectives at Trump Summit in Alaska",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Sun, 07 Sep 2025 16:30:49 GMT",
    "source": "Axios",
    "sources": [
      "ABC News",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "abcnews.go.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMidkFVX3lxTE9hd0huNDNoWlR1bVdlU0IwcjhEU0I2MDJWN1lWcW5SdktXZFVTNjN4aDdmS1N4UEEzLVpQVUdVc3IyUFRrTGhWcEIzYjNvSzZqRFZQMkgybzZmaWtVbFFRVmc5cjdja3dVd3p2N25rTFRScFhUQVE?oc=5\" target=\"_blank\">\"It's a pity\": Zelensky says Trump gave Putin what he wanted</a>&nbs",
      "Ukrainian President Volodymyr Zelenskyy said that President Donald Trump’s Alaskan summit with Russian President Vladimir Putin gave Putin what he wanted."
    ],
    "image_url": "",
    "titles": [
      "\"It's a pity\": Zelensky says Trump gave Putin what he wanted - Axios",
      "Zelenskyy says Trump’s Alaska summit ‘gave Putin what he wanted’"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.835,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.629,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Ukrainian President Volodymyr Zelenskyy stated that the summit between former U.S. President Donald Trump and Russian President Vladimir Putin in Alaska resulted in Putin achieving his objectives.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "London Underground Staff Start Five-Day Strike Over Pay, Conditions",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 07 Sep 2025 12:32:13 GMT",
    "source": "BBC",
    "sources": [
      "Financial Times",
      "BBC"
    ],
    "domains": [
      "www.ft.com",
      "www.bbc.com"
    ],
    "snippets": [
      "London Underground staff start a five-day walkout over pay and conditions.",
      "Union says management has refused to engage on pay and working conditions"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/71fe/live/a85e6b00-89a3-11f0-9cf6-cbf3e73ce2b9.jpg",
    "titles": [
      "Five-day London Underground strike under way",
      "TfL warns of severe disruption from London Underground strike"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.769,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.616,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "London Underground staff began a five-day strike due to disputes over pay and working conditions. The union claims management has not engaged in discussions to address their concerns.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]