[
  {
    "title": "Anthony Edwards Wins MVP as Team Stars Clinch 2026 NBA All Star",
    "domain": "sports",
    "source_domain": "cbssports.com",
    "location": "national",
    "published": "Mon, 16 Feb 2026 03:04:43 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sky Sports",
      "BBC Sport",
      "Sportsnet",
      "Yahoo Sports",
      "Globe and Mail",
      "Sports Illustrated"
    ],
    "domains": [
      "cbssports.com",
      "skysports.com",
      "bbc.com",
      "sportsnet.ca",
      "sports.yahoo.com",
      "news.google.com"
    ],
    "snippets": [
      "The new All-Star Game format created a much more competitive game than in recent years",
      "Anthony Edwards won the Most Valuable Player award while leading his \"Stars\" team past their fellow Americans on the \"Stripes\" team 47-21 to win the final of the NBA All-Star Game on Sunday.",
      "Anthony Edwards is named Most Valuable Player in the NBA All-Star Game as the USA Stars beat the USA Stripes 47-21.",
      "Watch as Team Stars hoists the trophy after winning the NBA All-Star game over Team Stripes, and Minnesota Timberwolves guard Anthony Edwards is crowned MVP.",
      "Anthony Edwards led Team Stars to All-Star Game glory, winning MVP along the way.",
      "Unlike recent years, when effort was absent, competition was central to the exhibition, thanks in large part to France's Victor Wembanyama, who literally set the tone from jump.",
      "Anthony Edwards takes All-Star MVP, leads Stars to tourney win The Globe and Mail",
      "Here's how the new NBA All-Star Game format works",
      "It's USA Stars vs. USA Stripes vs. Team World in the 2026 NBA All-Star Game at Intuit Dome on Sunday",
      "SportsLine's Larry Hartstein just released his best bets for the NBA All-Star Game 2026, which features a round-robin mini-tournament",
      "NBA All-Star Game’s USA vs. World Format Brings Back Real Intensity Sports Illustrated",
      "Kawhi Leonard dominated with 31 points while nailing six three-pointers in just 12 minutes of game time to lead Team Stripes to a 48-45 win over Team World at the 2026 NBA All-Star Game.",
      "Anthony Edwards posted a team-high 13 points, including a three-point bucket to force OT, and Scottie Barnes drained the game-winning basket to lead Team Stars past Team World 37-35.",
      "Jaylen Brown led up the offence with 11 points, and De’Aaron Fox hit the game-winning buzzer-beater three-pointer to lift Team Stripes past Team Stars 42-40.",
      "Basketball fans were the biggest winner at the All-Star Game.",
      "The 2026 NBA All-Star Game saw a new 'U.S. vs. World' format inject much-needed competition, with Anthony Edwards earning MVP honors.",
      "The 2026 NBA All-Star Game unveiled a USA vs. World round-robin format at Intuit Dome that reignited pride, intensity, and real competition—proving the league might have found a fix for its long-criticized showcase.",
      "Tyrese Maxey led the way with nine points while Anthony Edwards and Chet Holmgren each finished with eight points to elevate Team Stars to a 47-21 victory over Team Stripes in the final matchup of the 2026 NBA All-Star Game.",
      "The NBA might have found an exciting format for future years with the 2026 NBA All-Star Game.",
      "Former United States President Barack Obama and First Lady, Michelle, were among those in attendance for the NBA All-Star Game on Sunday.",
      "For the basketball purist and casual fan alike, Sunday afternoon offered up the best the NBA has to offer."
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2026/02/16/519241de-d783-41cd-8552-3b2d47644333/wemby-getty-4.png",
    "titles": [
      "Why did new NBA All-Star Game format work? Victor Wembanyama 'sets tone' and players 'step up'",
      "Edwards claims MVP award as younger stars dazzle in NBA All-Star game",
      "Edwards named MVP in new NBA All-Star Game format",
      "Team Stars hoist All-Star trophy, Edwards crowned MVP",
      "Anthony Edwards Wins All-Star Game MVP",
      "NBA All-Star Game 2026: Winners and losers, with Wemby and Anthony Edwards winning big",
      "Anthony Edwards takes All-Star MVP, leads Stars to tourney win - The Globe and Mail",
      "2026 NBA All-Star Game format explained: How USA vs. World works in three-team mini tournament",
      "2026 NBA All-Star Game rosters: How teams are split for new USA vs. World format",
      "2026 NBA All-Star Game predictions, odds, format, time: Picks for Team World, Team Stripes and Team Stars",
      "NBA All-Star Game’s USA vs. World Format Brings Back Real Intensity - Sports Illustrated",
      "2026 NBA All-Star Game Highlights: Team Stripes 48, Team World 45",
      "2026 NBA All-Star Game Highlights: Team Stars 37, Team World 35",
      "2026 NBA All-Star Game Highlights: Team Stripes 42, Team Stars 40",
      "2026 NBA All-Star Game, All-Star Weekend grades: Team USA vs World format gets A+",
      "NBA All-Star Game winners and losers: US vs World format is an upgrade",
      "USA vs World format delivers real competition at 2026 NBA All-Star Game",
      "2026 NBA All-Star Game Highlights: Team Stars 47, Team Stripes 21",
      "LeBron’s Team Stripes falls in final of entertaining 2026 NBA All-Star Game",
      "Barack and Michelle Obama attend 2026 NBA All-Star Game",
      "NBA All-Star 2026: USA vs. World format a success as future faces of the league lead the way — 'This is what it's all about'"
    ],
    "url": "https://www.cbssports.com/nba/news/why-did-new-nba-all-star-game-format-work-victor-wembanyama/",
    "alternate_urls": [
      "https://www.skysports.com/nba/news/12040/13508083/nba-all-star-game-anthony-edwards-claims-mvp-award-as-younger-team-stars-win-mini-tournament-in-los-angeles",
      "https://www.bbc.com/sport/basketball/articles/cvg38yp7v5do?at_medium=RSS&at_campaign=rss",
      "https://sports.yahoo.com/articles/gave-them-show-edwards-named-081912191.html",
      "https://sports.yahoo.com/articles/anthony-edwards-wins-star-game-052102113.html",
      "https://sports.yahoo.com/nba/article/nba-all-star-game-2026-winners-and-losers-with-wemby-and-anthony-edwards-winning-big-034004193.html",
      "https://news.google.com/rss/articles/CBMivAFBVV95cUxPUW9tZk9FVUdEU2cyXy1HdUJqbUgweXRNWWVrOGNGSmR6N3RVTVZsSkljV3B5b0hWZnNGVUJlWi1fYnlWZ2t1bWRubEgwWmlPZURqNkI0UWctbC0zVGZCeXhhOWxGeGZvbnlSbTU4RTdRdWpNZHRnZFFfY3NRRDNlSDBvWGFCZWMyRGIxZERxVVpray1SQUhSU0pGYTg3cVRkdUNVOFJkNEo2LTB0ZF83Sl8xUDBkc0otU0RGdA?oc=5",
      "https://www.cbssports.com/nba/news/2026-nba-all-star-game-format-explained/",
      "https://www.cbssports.com/nba/news/nba-all-star-game-rosters-2026/",
      "https://www.cbssports.com/nba/news/2026-nba-all-star-game-predictions-odds-format-time-spread-expert-picks-best-bets/",
      "https://news.google.com/rss/articles/CBMiowFBVV95cUxOZTU1UjRDVUJ6MDhMQUUtZzdKM3pOM1lMZnhjaExwd2ZtR05FVlplQ09zcWhfcTczdE1DSGdZU1hJS0R2Wmw2cXQ5bjBNWG93TVlGS2Z0QUhlLUpHMGMyMzhqcFBzM2oxZUdiVFBXaDJtQnJ5MVlTU3duc0VsampaOWsxRnpITFlVY2MwZ3BMZDhyVE1rOUM1RV9UZ3ZXU0VTUnp3?oc=5",
      "https://sports.yahoo.com/articles/2026-nba-star-game-star-035840785.html",
      "https://sports.yahoo.com/articles/nba-star-game-winners-losers-031652983.html",
      "https://sports.yahoo.com/articles/usa-vs-world-format-delivers-014832256.html",
      "https://sports.yahoo.com/articles/lebron-team-stripes-falls-final-010330401.html",
      "https://sports.yahoo.com/articles/barack-michelle-obama-attend-2026-000251110.html",
      "https://sports.yahoo.com/nba/article/nba-all-star-2026-usa-vs-world-format-a-success-as-future-faces-of-the-league-lead-the-way--this-is-what-its-all-about-030431088.html"
    ],
    "location_scope": "national",
    "link": "https://www.cbssports.com/nba/news/why-did-new-nba-all-star-game-format-work-victor-wembanyama/",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.806,
      "consensus": 1.0,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.852,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful context about the new NBA All-Star Game format and how players have adapted to it. It could help readers understand the dynamics of the game better.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Anthony Edwards was named Most Valuable Player after leading Team Stars to a 47-21 victory over Team Stripes in the final of the 2026 NBA All-Star Game at Intuit Dome. The event featured a new round-robin USA vs. World format, with Team Stars also defeating Team World and Team Stripes beating Team World in earlier games. The new format was praised for increasing competition and intensity.",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "Tyler Reddick Wins 2026 Daytona 500 for 23XI Racing",
    "domain": "sports",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Mon, 16 Feb 2026 09:17:51 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "ESPN",
      "Sportsnet",
      "Yahoo Sports"
    ],
    "domains": [
      "aljazeera.com",
      "espn.com",
      "sportsnet.ca",
      "sports.yahoo.com"
    ],
    "snippets": [
      "Toyota Racing driver triumphs in NASCAR's biggest race in a car co-owned by the NBA Hall of Famer.",
      "Tyler Reddick won the Daytona 500 in a car owned by Michael Jordan when Chase Elliott crashed as he and Reddick were battling for the win.",
      "Thanks to a buzzer-beater move befitting of Michael Jordan, Tyler Reddick won the biggest race in NASCAR.",
      "DAYTONA BEACH, Fla. — Tyler Reddick won the Daytona 500 in a car owned by Michael Jordan when Chase Elliott crashed as he and Reddick were battling for the win in NASCAR’s season opener. Reddick, in a Toyota for 23XI Racing, led only one lap Sunday: the one to the checkered flag for the team owned by the NBA Hall of Famer and three-time Daytona 500 winner Denny Hamlin. “Just incredible how it all played out. Just true Daytona madness,” said Reddick, the 25th different driver to lead a lap for a new Daytona 500 record. “I’ve already lost my voice from screaming. Never thought I’d be Daytona...",
      "DAYTONA BEACH, Fla. (AP) — Tyler Reddick wins the Daytona 500 in a car owned by Michael Jordan."
    ],
    "image_url": "",
    "titles": [
      "Tyler Reddick wins NASCAR Daytona 500 in Michael Jordan-owned car",
      "Reddick races to Daytona win in Jordan-owned car",
      "Reddick's Daytona 500 win a buzzer beater befitting of his boss: Michael Jordan",
      "Tyler Reddick wins the Daytona 500 for Michael Jordan-owned 23XI Racing",
      "Tyler Reddick wins the Daytona 500 in a car owned by Michael Jordan"
    ],
    "url": "https://www.aljazeera.com/sports/2026/2/16/tyler-reddick-wins-nascar-daytona-500-in-michael-jordan-owned-car?traffic_source=rss",
    "alternate_urls": [
      "https://www.espn.com/racing/story/_/id/47942112/tyler-reddick-wins-daytona-500-car-owned-michael-jordan",
      "https://www.espn.com/racing/nascar/story/_/id/47943611/tyler-reddick-nascar-daytona-500-win-buzzer-beater-befitting-23xi-boss-michael-jordan",
      "https://sports.yahoo.com/articles/tyler-reddick-wins-daytona-500-223953129.html"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/sports/2026/2/16/tyler-reddick-wins-nascar-daytona-500-in-michael-jordan-owned-car?traffic_source=rss",
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.958,
      "consensus": 0.908,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.837,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about the outcome of a major sports event. However, it does not provide any deeper insights, solutions, or empowering knowledge.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Tyler Reddick won the 2026 Daytona 500 in a Toyota for 23XI Racing, a team co-owned by Michael Jordan and Denny Hamlin. Reddick secured the victory after Chase Elliott crashed during their battle for the lead, making Reddick the 25th different driver to lead a lap in the race and setting a new Daytona 500 record.",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "North Korea Builds Housing for Families of Soldiers Killed in Ukraine",
    "domain": "general",
    "source_domain": "npr.org",
    "location": "national",
    "published": "Mon, 16 Feb 2026 01:59:14 -0500",
    "source": "NPR",
    "sources": [
      "NPR",
      "The Guardian",
      "Associated Press"
    ],
    "domains": [
      "npr.org",
      "theguardian.com",
      "news.google.com"
    ],
    "snippets": [
      "North Korea said Monday it completed a new housing district in Pyongyang for families of North Korean soldiers killed while fighting alongside Russian forces in Ukraine.",
      "Leader vows to repay the ‘young martyrs’ who died as North Korea intensifies propaganda glorifying troops deployed to fight for Russia North Korea has said it completed a new housing district in Pyongyang for families of North Korean soldiers killed while fighting alongside Russian forces in Ukraine",
      "North Korea opens a housing district for families of its soldiers killed in Russia-Ukraine war AP News"
    ],
    "image_url": "",
    "titles": [
      "North Korea opens a housing district for families of its soldiers killed in Russia-Ukraine war",
      "Kim Jong-un unveils housing for families of North Koreans killed in Ukraine war",
      "North Korea opens a housing district for families of its soldiers killed in Russia-Ukraine war - AP News"
    ],
    "url": "https://www.npr.org/2026/02/16/nx-s1-5715734/north-korea-housing-district-soldiers-russia-ukraine-war",
    "alternate_urls": [
      "https://www.theguardian.com/world/2026/feb/16/north-korea-housing-ukraine-war-families",
      "https://news.google.com/rss/articles/CBMiogFBVV95cUxOTG9PUmdlUUVKUWtGTDlqX0dCWGV6cllGRUpLN0QzODFTMXdBQ2tPNi1xMmg4cGtlVFBwZHdqT1VFT1A5VVdfRG1IeWxOLWhndFRmNnUwNVg4QUdzczJZVkxuOGNGOGRHVkNwUWR1R0Y4eTBXVGlXcktveS0zZHlNUE9UUTJXNDVCRjZWQUQ3MkZXbDhCSGhoc1k0dENCR09kVXc?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.npr.org/2026/02/16/nx-s1-5715734/north-korea-housing-district-soldiers-russia-ukraine-war",
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.899,
      "consensus": 0.789,
      "constructiveness": 0.6,
      "proximity": 0.75
    },
    "score": 0.823,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information about North Korea's response to its soldiers' deaths, which can help readers understand the country's policies and actions. However, it does not report on solutions or improvements, nor does it provide deep insights into the systems or causes involved.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "North Korea announced the completion of a new housing district in Pyongyang for families of North Korean soldiers who died fighting alongside Russian forces in Ukraine. The move is part of efforts to honor those killed and intensify propaganda supporting the deployment.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Kansas State Fires Basketball Coach Jerome Tang After Losing Season",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Sun, 15 Feb 2026 23:52:39 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports",
      "Sports Illustrated",
      "Yahoo Sports"
    ],
    "domains": [
      "espn.com",
      "cbssports.com",
      "news.google.com",
      "sports.yahoo.com"
    ],
    "snippets": [
      "Jerome Tang, who led Kansas State to the Elite Eight in his first season but has failed to replicate that success in his three seasons since, was fired for cause by the school.",
      "The Wildcats are 10-15 overall and 1-11 in the Big 12 this season under Tang, despite a hefty NIL budget. Now, a legal battle awaits",
      "Kansas State Fires Jerome Tang Amid Second Consecutive Losing Season Sports Illustrated",
      "Kansas State fired basketball coach Jerome Tang on Sunday night, four days after many Wildcats fans showed up with bags over their heads for a home blowout. Athletic director Gene Taylor announced the move in a statement. “This was a decision that was made in the best interest of our university and",
      "Ten Candidates for Kansas State Men’s Basketball Coaching Search After Jerome Tang’s Departure Sports Illustrated"
    ],
    "image_url": "",
    "titles": [
      "Kansas St. fires Tang after rant, one Big 12 win",
      "Kansas State fires Jerome Tang: Wildcats coach is out in fourth season just days after viral rant",
      "Kansas State Fires Jerome Tang Amid Second Consecutive Losing Season - Sports Illustrated",
      "Kansas State fires basketball coach Jerome Tang, days after fans wore bags over heads",
      "Ten Candidates for Kansas State Men’s Basketball Coaching Search After Jerome Tang’s Departure - Sports Illustrated"
    ],
    "url": "https://www.espn.com/mens-college-basketball/story/_/id/47943350/sources-jerome-tang-kansas-state-1-11-big-12",
    "alternate_urls": [
      "https://www.cbssports.com/college-basketball/news/kansas-state-jerome-tang-wildcats-coach-fired/",
      "https://news.google.com/rss/articles/CBMiowFBVV95cUxOS09QdkdxaEZhMlV1Zzc2NGlWd2V5STFQYjJobFVLMkRkNVVyeU82Ry1uWTJvQUFLZE9SbHo5M1JmLTNPbFN5U2xWempvQ3ZtTWNXVk1LUkJKb1d0NF9YUjBfeXd3aUpXczl2RldvN1FXZVdaMnFWbzFxT2JUT2ltZTgxMExoOFFZNjhjMzRzQ2N0bnNCLXVGR0tWaTF1ekg3c2pN?oc=5",
      "https://sports.yahoo.com/articles/kansas-state-fires-basketball-coach-022254379.html",
      "https://news.google.com/rss/articles/CBMiyAFBVV95cUxPSDNHMUNyR2ZINzJiS2pZTk1TZWNRQkRIMk5uSjRENEVBLUd4VWZvY1A0a2Y3RXlrOXExdlo2U1NFN2ZJZ2wyVllPWk5SbjlHa01CLXc4dzVIV1h6LW1VOEVuREtFSFktMndwenNlU0FtTjdYamxteTdES20xM3V6S3JjeGJnUjU5LWdjYUNZNkhQc3F5Vy15SXFYTkFZSHJ2SzZPdThmQ2ZWVUFzZ0FnVGd3WmZ6czI0R2c4M0owQm5rb210aHFETQ?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/mens-college-basketball/story/_/id/47943350/sources-jerome-tang-kansas-state-1-11-big-12",
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.848,
      "consensus": 0.908,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.809,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about the firing of a coach from Kansas St. However, without a summary or further details, it offers minimal depth or insight into the reasons behind the decision or its implications.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Kansas State fired basketball coach Jerome Tang after a second consecutive losing season, with the team standing at 10-15 overall and 1-11 in the Big 12. Athletic director Gene Taylor announced the decision, citing the university's best interests. Tang was dismissed for cause, and the school is beginning a search for a new coach.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Seahawks Set to Hire Brian Fleury as Offensive Coordinator",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Sun, 15 Feb 2026 23:52:39 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sports Illustrated",
      "Yahoo Sports",
      "CBS Sports"
    ],
    "domains": [
      "espn.com",
      "news.google.com",
      "sports.yahoo.com",
      "cbssports.com"
    ],
    "snippets": [
      "The Seahawks are expected to hire 49ers tight ends coach Brian Fleury as their offensive coordinator, sources told ESPN's Adam Schefter on Sunday.",
      "Why the 49ers Won't Miss New Seahawks Offensive Coordinator Brian Fleury Sports Illustrated",
      "3 Players That Benefit the Most With Brian Fluery as Seahawks OC Sports Illustrated",
      "The Seattle Seahawks are expected to hire San Francisco 49ers tight ends coach and run game coordinator Brian Fleury as their new offensive coordinator, a person with knowledge of the hiring process said Sunday. The person spoke to The Associated Press on condition of anonymity regarding Fleury beca",
      "The Seahawks have found a new offensive coordinator who is likely to keep the same scheme.",
      "The Seahawks have got their Klint Kubiak replacement, and he’s not an internal promotion as initially expected.",
      "Fleury was San Francisco's run game coordinator and tight ends coach",
      "The first staff under new Raiders coach Klint Kubiak is rapidly taking shape.",
      "The 49ers will need a new tight ends coach and run game coordinator with Brian Fleury headed to Seattle"
    ],
    "image_url": "",
    "titles": [
      "Sources: Seahawks to hire 49ers' Fleury as OC",
      "Why the 49ers Won't Miss New Seahawks Offensive Coordinator Brian Fleury - Sports Illustrated",
      "3 Players That Benefit the Most With Brian Fluery as Seahawks OC - Sports Illustrated",
      "Seahawks expected to hire 49ers tight end coach Fleury as offensive coordinator, AP source says",
      "Seahawks to hire Brian Fleury as offensive coordinator",
      "The Seahawks have found their newest offensive coordinator",
      "Seahawks hire Brian Fleury as offensive coordinator: Seattle gets assistant from 49ers to replace Klint Kubiak",
      "Raiders hire Seahawks quarterbacks coach as offensive coordinator",
      "The 49ers just lost their tight ends coach to the Seahawks"
    ],
    "url": "https://www.espn.com/nfl/story/_/id/47941623/sources-seahawks-expected-hire-49ers-brian-fleury-oc",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiqgFBVV95cUxNOFpMNjhyZHZzRUZ0UENUUGFBLVZNYjIyb2VvRjVZcFZmTVJMajRZY3V3eHM0V3NQdGxMVjBSZGRmbnhfWlBmYVFPZTBvZnRnV25GbTgzVzhPeDhwc3plRTJ0dHpONDVONzY2UVlITmlMdDM0OUc1VXRmVEU5RkJ0WmJXQXZWY3JhRzFoWDc2bXdYUDEtWXdyZl9RUjE3LWtsR2Vtb1FqLTJqdw?oc=5",
      "https://news.google.com/rss/articles/CBMifEFVX3lxTE1tcGQxQWY0MzdwUEpwSVVjY3E3Q2E0aWJMSkM4Zi1WSlpYdFBhZ2VFQlhrUlRkdGtjdVJVQWg0bXd3MVF6MU02YlJ5eDVydEhZTXhJTWZma0RlRmgwc0x6YVR4TkZQUjlKMFhMLWhSZ2VxanN6MHJVQjZEVHE?oc=5",
      "https://sports.yahoo.com/articles/seahawks-expected-hire-49ers-tight-012107591.html",
      "https://sports.yahoo.com/articles/seahawks-hire-brian-fleury-offensive-221619964.html",
      "https://sports.yahoo.com/articles/seahawks-found-newest-offensive-coordinator-221131257.html",
      "https://www.cbssports.com/nfl/news/seahawks-hire-brian-fleury-49ers-offensive-coordinator/",
      "https://sports.yahoo.com/articles/raiders-hire-seahawks-quarterbacks-coach-000709567.html",
      "https://sports.yahoo.com/articles/49ers-just-lost-tight-ends-220538241.html"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/nfl/story/_/id/47941623/sources-seahawks-expected-hire-49ers-brian-fleury-oc",
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.848,
      "consensus": 0.908,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.809,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about a staffing change within the Seahawks organization. However, without a summary or further details, it offers minimal depth or insight into the reasons behind the decision or its implications.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The Seattle Seahawks are expected to hire San Francisco 49ers tight ends coach and run game coordinator Brian Fleury as their new offensive coordinator, replacing Klint Kubiak. The 49ers will need to fill Fleury's previous roles.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "OpenClaw Creator Peter Steinberger Joins OpenAI",
    "domain": "business",
    "source_domain": "cnbc.com",
    "location": "national",
    "published": "Mon, 16 Feb 2026 05:58:27 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Reuters",
      "Financial Times",
      "Bloomberg"
    ],
    "domains": [
      "cnbc.com",
      "news.google.com",
      "ft.com"
    ],
    "snippets": [
      "OpenClaw, the open source AI agent that's surged in popularity in recent weeks, will live within OpenAI, according to a post on X from Sam Altman.",
      "OpenClaw founder Steinberger joins OpenAI, open-source bot becomes foundation Reuters",
      "The viral open source project enables users to create personal AI agents",
      "OpenAI Hires OpenClaw AI Agent Developer Peter Steinberg Bloomberg.com",
      "OpenClaw creator Peter Steinberger joining OpenAI, Altman says CNBC"
    ],
    "image_url": "",
    "titles": [
      "OpenClaw creator Peter Steinberger joining OpenAI, Altman says",
      "OpenClaw founder Steinberger joins OpenAI, open-source bot becomes foundation - Reuters",
      "OpenAI hires OpenClaw founder Peter Steinberger",
      "OpenAI Hires OpenClaw AI Agent Developer Peter Steinberg - Bloomberg.com",
      "OpenClaw creator Peter Steinberger joining OpenAI, Altman says - CNBC"
    ],
    "url": "https://www.cnbc.com/2026/02/15/openclaw-creator-peter-steinberger-joining-openai-altman-says.html",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMivgFBVV95cUxPV1RHa1VlbG5DdjlhajlGN0p0dWhyRDA0UXYwc0otdlFKekFrclFvM2lEclljdG1aeHBlUm1RdEFuRl9XNjAzbDlUOW5yeUNiOFh6S1U0R3ZKWW50WnhtUndXR28wWDE1YzRyYnJjMm9fSXBWWEFybjVrWnpvcXE3T1JyQXQxMXRWYnVwOWRLa2t2WVl0ZXAtNFVLdDJrRWZkdnQ3eGNLUjJlWWlNSDZxc29lSU9aTzNPZUYyYW5R?oc=5",
      "https://www.ft.com/content/45b172e6-df8c-41a7-bba9-3e21e361d3aa",
      "https://news.google.com/rss/articles/CBMiqwFBVV95cUxOa1NDZTRkUEpuYTBkNmQ1UmtjV2NKVWNtVHM3bV9nZGFiZHhDRUVsUEwyY3BQUXY3al95blhPXzJ3dzB4T0NXVnBtUzNMUTBkVGg0U2h2MHhaWnZZdWdGV1lxYldKa2E4V19tYkpRdGY4UXlWczQ5SjhGSS1oaVFVS1haSFEyNi1mcUZHVkxETzZkM3dDNXlaRV9yZ2NOTG5Dcm5iV2JONnZuaGc?oc=5",
      "https://news.google.com/rss/articles/CBMinwFBVV95cUxOdmVGeVJ5cm1DN0ZxX09iYjd2cDNBTElqam92SThUNXdZclJKUWd3eEMxeWQyVkQzNkVIQkxFWmZiMTlFeE1Xd00xNU9nRzllb2JqTDlOd0FST0VGN2xFOVN1Z291dTdFMTFuMGJQY2Q2ZW44UlpPV0Fqb05HcFdjczItekVZMnMzc2laSUVkaTY0emxKWWU3OUllakRwRDTSAaQBQVVfeXFMTWx3dDNpYXdGWnVxSEdleV9sTFNmRENZc0NnTGhzZUVtUGR4dEV6ZWtNZUY3NjNIeUFGRjQxUnZId0ZwREgxQ1FnUjdBS0pBaW1zSnVKSzdMYzlHVFdFbXdKZ3BPd1RZLXZBeEsyX1J2aFdVR19KQzNWOEhRa3hoMjR3Yk5QSW9Bam1QSVZlODZxOFBoTzY1Yl9yeERUdzJPVEV5ZmU?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.cnbc.com/2026/02/15/openclaw-creator-peter-steinberger-joining-openai-altman-says.html",
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.874,
      "consensus": 0.888,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.763,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Peter Steinberger, creator of the OpenClaw open source AI agent, is joining OpenAI. OpenClaw, which has gained popularity recently for enabling users to create personal AI agents, will now be developed within OpenAI, according to a statement from Sam Altman.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Israeli Cabinet Approves West Bank Land Registration Amid Criticism",
    "domain": "general",
    "source_domain": "npr.org",
    "location": "national",
    "published": "Mon, 16 Feb 2026 04:53:48 -0500",
    "source": "NPR",
    "sources": [
      "NPR",
      "Reuters"
    ],
    "domains": [
      "npr.org",
      "news.google.com"
    ],
    "snippets": [
      "Israel will begin a contentious land regulation process in a large part of the occupied West Bank, which could result in Israel gaining control over wide swaths of the area for future development.",
      "Israeli cabinet approves West Bank land registration, Palestinians condemn 'de-facto annexation' Reuters"
    ],
    "image_url": "",
    "titles": [
      "Israel will begin contentious West Bank land registration",
      "Israeli cabinet approves West Bank land registration, Palestinians condemn 'de-facto annexation' - Reuters"
    ],
    "url": "https://www.npr.org/2026/02/16/g-s1-110259/israel-will-begin-west-bank-land-registration",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiygFBVV95cUxNejB0bWJ0NUZKd1VXUi1HZjJ2MUxRRS0tS0x2ZHRUSkFZeUg2cm54dFg5S3BjLXFPWVk2cUluLWZ4MDF5eTRONnNEXzNjOEZkYjhaZTNuc3dpc3lXWllMVEJWVVNqWThjWkY3akJsMTRxOE1UeE41N3VoQlNYQVBfQ2U0b21WdDR4UEdfNHVmQzJvdXJLa2NtTUNHSENoRVpPMnFrMTdVZEwyUzg1UnZrcUlYS29iSldIdm1tMkFtazlNQVNkSUtuOFhR?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.npr.org/2026/02/16/g-s1-110259/israel-will-begin-west-bank-land-registration",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.974,
      "consensus": 0.591,
      "constructiveness": 0.5,
      "proximity": 0.75
    },
    "score": 0.762,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about a contentious issue, but it doesn't provide much depth or insight into the reasons behind the decision, the potential impacts, or any potential solutions or ways forward.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The Israeli cabinet has approved a process to register land in a large area of the occupied West Bank, a move that could lead to increased Israeli control. Palestinian officials have condemned the decision, calling it a 'de-facto annexation.'",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Former NFL Offensive Lineman Tre Johnson Dies at 54",
    "domain": "sports",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Sun, 15 Feb 2026 22:53:48 -0500",
    "source": "ABC News",
    "sources": [
      "ABC News",
      "ESPN",
      "Yahoo Sports"
    ],
    "domains": [
      "abcnews.go.com",
      "espn.com",
      "sports.yahoo.com"
    ],
    "snippets": [
      "Former NFL star Tre' Johnson has died at the age of 54, the Washington Commanders announced on Sunday.",
      "Tre' Johnson, the former standout NFL offensive lineman with Washington who went on to become a Maryland high school history teacher, died Sunday. He was 54.",
      "Former NFL star Tre Johnson died “suddenly and unexpectedly” on Sunday while on a family trip, his wife announced on social media with a heartbreaking statement. Johnson was 54 years old. His wife, Irene, revealed her husband had been dealing…",
      "Former NFL offensive lineman Tre' Johnson died on Sunday, Feb. 15 while the family was on a trip, according to his wife."
    ],
    "image_url": "https://s.abcnews.com/images/US/tre_1771212853349_hpMain_4x3t_384.jpg",
    "titles": [
      "Tre' Johnson, former Washington Commanders All-Pro, dies at 54",
      "Johnson, ex-Pro Bowl Washington OL, dies at 54",
      "Former NFL star Tre Johnson dies suddenly at 54 on family trip",
      "Former Pro Bowl NFL lineman Tre' Johnson dies at 54"
    ],
    "url": "https://abcnews.go.com/US/tre-johnson-former-washington-commanders-pro-dies-54/story?id=130198117",
    "alternate_urls": [
      "https://www.espn.com/nfl/story/_/id/47944143/tre-johnson-former-washington-o-lineman-dies-54",
      "https://sports.yahoo.com/articles/former-nfl-star-tre-johnson-094404583.html",
      "https://sports.yahoo.com/articles/former-pro-bowl-nfl-lineman-062634090.html"
    ],
    "location_scope": "national",
    "link": "https://abcnews.go.com/US/tre-johnson-former-washington-commanders-pro-dies-54/story?id=130198117",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.825,
      "consensus": 0.789,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.758,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about the passing of a former professional football player. However, without a summary or further details, it offers minimal depth or insight into his career or the circumstances of his death.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Tre' Johnson, a former NFL offensive lineman and history teacher, died at age 54 on Sunday, February 15, while on a family trip, according to his wife and the Washington Commanders.",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "India Hosts Global AI Summit With Focus on Cooperation and Governance",
    "domain": "general",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Mon, 16 Feb 2026 08:03:51 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Reuters"
    ],
    "domains": [
      "aljazeera.com",
      "news.google.com"
    ],
    "snippets": [
      "Summit aims to outline global AI governance and collaboration for inclusive growth and sustainability.",
      "From OpenAI to Google, India hosts global AI summit Reuters"
    ],
    "image_url": "",
    "titles": [
      "India hosts AI Impact Summit, drawing world leaders, tech giants",
      "From OpenAI to Google, India hosts global AI summit - Reuters"
    ],
    "url": "https://www.aljazeera.com/news/2026/2/16/india-hosts-ai-impact-summit-drawing-world-leaders-tech-giants?traffic_source=rss",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMipgFBVV95cUxQUTM2OWVwdUpMcHN3cFVZal9aSDZOVDJzSGVFWGJqQ0hITUdlSURWMGxxaGZnZFRFbnljQnNob1FIc09yUVZOUWZiQkpSSTl2bm1hQ3lidXRDc3UyQXprVUF5cVZjRjZmajQ4QmpWS2NpdHc2NHIxMHkyNnBZSlp3SnFIWWZKMnQ5c2RKNjNzV2J5NXdNbFcxZ01YdkE4eWlKMlFycC1B?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2026/2/16/india-hosts-ai-impact-summit-drawing-world-leaders-tech-giants?traffic_source=rss",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.926,
      "consensus": 0.591,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.752,
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The story informs readers about a significant event in the tech world and could provide useful context for understanding trends in AI. However, without more information about the content of the summit or its outcomes, it's hard to say whether it provides empowering knowledge or highlights progress or solutions.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "India is hosting a global AI summit with participation from major technology companies, including OpenAI and Google. The summit focuses on establishing international cooperation and governance standards to promote inclusive growth and sustainability in artificial intelligence.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Indonesia Prepares 1000 Troops for Possible Gaza Peacekeeping Mission",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Mon, 16 Feb 2026 06:57:54 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "Al Arabiya"
    ],
    "domains": [
      "news.google.com"
    ],
    "snippets": [
      "Indonesia readies 1,000 troops for potential peacekeeping force in Gaza in early April Reuters",
      "Indonesia readies 1,000 troops for potential peacekeeping force in Gaza in early April Al Arabiya English"
    ],
    "image_url": "",
    "titles": [
      "Indonesia readies 1,000 troops for potential peacekeeping force in Gaza in early April - Reuters",
      "Indonesia readies 1,000 troops for potential peacekeeping force in Gaza in early April - Al Arabiya English"
    ],
    "url": "https://news.google.com/rss/articles/CBMiygFBVV95cUxQN0dXdVNicWdTbEdvbXpsVkVGaXh4b1ZtQVlKSnYxODhucGNxSFdMMUMwUjhsS1ZLd0FheGxqRy1HRnZSc1R5YzJTZHVCV3dXcXA0TWJaUU8wZE83QWxwRlU2d0J5VlRRcFVSaHFKemZpWW9NN2tacWtiZmZ1cFFHVXVMQUxOX2R1NjhqYTNYMnRGV2FRX1ZKWEJCU2FYeUVkTFFiX0FvWFJOOVRKUHRKSE9tWDR0NFBiMXpVUUg1ZW5QQmNUU3Z3U1Jn?oc=5",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMi4gFBVV95cUxPczJGY214V0F6Q0lwM0VSeVNNYl9haFhGYXJYYUcwSjh5bEJOeGRFOGRrSGEtdUtEYks0cXd5b2NIOVJBMU94N1VJVG95ejA5V0ZGcmpVUm4wN0dfbGROMlVRcXNvenpnMnZja28zdnZXSDVhTHNJQ2ctak9JaFJsRmVaZVJNYkZZTWpfMlB1bUZFMGdSZUxBVEJSRVh3RTZySC0yd1FGY3JFUm9Ybk13QU9UTWxiUFJzZDJWUjdqT0lRQ1FNZm5qNENhRmc4YTRyR3UzcTB2SDRGYU40RUowUXpn0gHiAUFVX3lxTE9zMkZjbXhXQXpDSXAzRVJ5U01iX2FoWEZhclhhRzBKOHlsQk54ZEU4ZGtIYS11S0RiSzRxd3lvY0g5UkExT3g3VUlUb3l6MDlXRkZyalVSbjA3R19sZE4yVVFxc296emcydmNrbzN2dldINWFMc0lDZy1qT0loUmxGZVplUk1iRllNal8yUHVtRkUwZ1JlTEFUQlJFWHdFNnJILTJ3UUZjckVSb1huTXdBT1RNbGJQUnNkMlZSN2pPSVFDUU1mbmo0Q2FGZzhhNHJHdTNxMHZINEZhTjRFSjBRemc?oc=5"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMiygFBVV95cUxQN0dXdVNicWdTbEdvbXpsVkVGaXh4b1ZtQVlKSnYxODhucGNxSFdMMUMwUjhsS1ZLd0FheGxqRy1HRnZSc1R5YzJTZHVCV3dXcXA0TWJaUU8wZE83QWxwRlU2d0J5VlRRcFVSaHFKemZpWW9NN2tacWtiZmZ1cFFHVXVMQUxOX2R1NjhqYTNYMnRGV2FRX1ZKWEJCU2FYeUVkTFFiX0FvWFJOOVRKUHRKSE9tWDR0NFBiMXpVUUg1ZW5QQmNUU3Z3U1Jn?oc=5",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.898,
      "consensus": 0.571,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.734,
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful information about Indonesia's proactive steps towards peacekeeping in Gaza. It increases awareness about international efforts to maintain peace, but it doesn't provide a deeper understanding of the underlying issues or potential solutions.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Indonesia is preparing 1,000 troops to potentially join a peacekeeping force in Gaza in early April. The deployment is not yet confirmed and would depend on further developments.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Irans Foreign Minister to Meet IAEA Chief Before US Nuclear Talks",
    "domain": "business",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Mon, 16 Feb 2026 07:40:50 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Reuters",
      "Financial Post"
    ],
    "domains": [
      "aljazeera.com",
      "news.google.com",
      "financialpost.com"
    ],
    "snippets": [
      "Iran's top diplomat says he will meet with IAEA director before the high-stakes talks with US are held on Tuesday.",
      "Iran's foreign minister will meet IAEA chief ahead of nuclear talks Reuters",
      "Iran’s Foreign Minister Abbas Araghchi is set to meet the head of the United Nations’ nuclear watchdog, ahead of a second round of talks with the US."
    ],
    "image_url": "",
    "titles": [
      "Iran’s Araghchi arrives in Geneva for second round of nuclear talks with US",
      "Iran's foreign minister will meet IAEA chief ahead of nuclear talks - Reuters",
      "Iran Foreign Minister to Meet UN Nuclear Chief Before US Talks"
    ],
    "url": "https://www.aljazeera.com/news/2026/2/16/irans-araghchi-arrives-in-geneva-for-second-round-of-nuclear-talks-with-us?traffic_source=rss",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiuAFBVV95cUxOQ0hNOGRMS21yUGZBMGxQVTdlemlSanp5Nk8yVjBfVWtUbHpBRUs2TTNmdUVGNGQtZ2FXWkpsTHlCNmViN3RSNnhNekg3SWRnYTZ1d0tkdXVZalBTMkFabW83bXpEV3g5anF2MXFiS1dfTTZDOUNTelo4RzllVmk5YndSaEpRS0wwMmJxNlVud2xoU3ZtSXpVWG5IS3NWSjNnZlMtVzdzY0I4YWxrc2ViNHJFS3N3YmIt?oc=5",
      "https://financialpost.com/pmn/business-pmn/iran-foreign-minister-to-meet-un-nuclear-chief-before-us-talks"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2026/2/16/irans-araghchi-arrives-in-geneva-for-second-round-of-nuclear-talks-with-us?traffic_source=rss",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.916,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.731,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Iran's Foreign Minister Abbas Araghchi will meet with the head of the International Atomic Energy Agency before a second round of nuclear talks with the US scheduled for Tuesday.",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "Scotland Wins in Six Nations as Pressure Mounts on Parker at Burnley",
    "domain": "general",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Mon, 16 Feb 2026 06:09:48 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "bbc.com",
      "theguardian.com"
    ],
    "snippets": [
      "The second weekend of the Six Nations brings redemption for Scotland, another blistering display from France and a threat for Ireland.",
      "Pressure is telling on Scott Parker at Burnley while Dominik Szoboszlai is reaching new heights for Liverpool The lack of pressure on Scott Parker this season, despite a collection of desperate performances and an impending relegation, has been mystifying. Plenty at Turf Moor feel a strong sense of"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/b5e5/live/bb8847a0-0b17-11f1-9972-d3f265c101c6.png",
    "titles": [
      "Five talking points from round two of Six Nations",
      "FA Cup fourth round: 10 talking points from the weekend’s action"
    ],
    "url": "https://www.bbc.com/sport/rugby-union/articles/cq6qg5y983zo?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://www.theguardian.com/football/2026/feb/16/fa-cup-fourth-round-10-talking-points-from-the-weekends-action"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/sport/rugby-union/articles/cq6qg5y983zo?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.878,
      "consensus": 0.591,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.712,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story offers useful insights about the key points from the second round of the Six Nations tournament. It provides some depth and insight for readers interested in the sport, but it doesn't contribute significantly to a broader understanding of trends or impacts.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Scotland secured a redemption win in the second weekend of the Six Nations, France delivered a strong performance, and Ireland faces new challenges. In football, pressure is mounting on Scott Parker at Burnley amid poor results, while Dominik Szoboszlai continues to excel for Liverpool.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "US Military Seizes Venezuela Linked Tanker After Maduros Capture",
    "domain": "politics",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Mon, 16 Feb 2026 05:12:27 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "The Guardian"
    ],
    "domains": [
      "aljazeera.com",
      "theguardian.com"
    ],
    "snippets": [
      "Panamanian-flagged Veronica III left Venezuela on the same day as the US capture of President Nicolas Maduro in January.",
      "Pentagon tracked sanctioned Veronica III from Caribbean Sea after it left Venezuela on day Maduro was captured US military forces boarded another sanctioned tanker in the Indian Ocean after tracking the vessel from the Caribbean Sea in an effort to target illicit oil connected to Venezuela, the Pent"
    ],
    "image_url": "",
    "titles": [
      "US forces board tanker in Indian Ocean that fled Trump’s Venezuela blockade",
      "US boards second oil tanker in Indian Ocean after it fled Venezuelan raid"
    ],
    "url": "https://www.aljazeera.com/news/2026/2/16/us-forces-board-tanker-in-indian-ocean-that-fled-blockade-on-venezuela?traffic_source=rss",
    "alternate_urls": [
      "https://www.theguardian.com/world/2026/feb/15/us-forces-board-second-venezuelalinked-oil-tanker-in-indian-ocean"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2026/2/16/us-forces-board-tanker-in-indian-ocean-that-fled-blockade-on-venezuela?traffic_source=rss",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.855,
      "consensus": 0.591,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.701,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story provides basic awareness about the US's actions in enforcing a blockade against Venezuela, but it doesn't provide much depth or insight into why these actions are being taken or what the implications might be.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The US military tracked and boarded the sanctioned Panamanian-flagged tanker Veronica III in the Indian Ocean after it left Venezuela on the same day President Nicolas Maduro was captured in January. The operation targeted illicit oil shipments connected to Venezuela.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Netanyahu Urges US to Demand Iran Dismantle Nuclear Infrastructure",
    "domain": "politics",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Mon, 16 Feb 2026 04:22:53 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Reuters"
    ],
    "domains": [
      "aljazeera.com",
      "news.google.com"
    ],
    "snippets": [
      "Israeli prime minister details demands on Iran as US prepares to hold second round of nuclear talks in Geneva.",
      "Netanyahu says US deal with Iran must dismantle nuclear infrastructure Reuters"
    ],
    "image_url": "",
    "titles": [
      "Netanyahu calls for dismantling Iran’s nuclear programme in any US deal",
      "Netanyahu says US deal with Iran must dismantle nuclear infrastructure - Reuters"
    ],
    "url": "https://www.aljazeera.com/news/2026/2/16/netanyahu-calls-for-dismantling-irans-nuclear-programme-in-any-us-deal?traffic_source=rss",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiygFBVV95cUxQanRGV0Vwa2ZrLUFPcVdrbWd1WUVTSVdvMER3LVV6ek1rZmlpMmF2RUwybi0zYkZ0NXZsZDVYUkROWC1TUmlma2hIOHp0NFlGblFYUzQ4Wk4zakg5RVdLVVdHWWo5UHVja0hKZnlyNGZPNzVmYy1RZ2FtVzFjckJ5OU83ODJrMWMwdmFqb0ZycGNZcVhneXgtQ3p0bDZuV1JZNzJqRnludW9ud0l5MFlaRXdBSVN3cTdCdmx6VTF0MWN3MVZlSHB3RS1n?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2026/2/16/netanyahu-calls-for-dismantling-irans-nuclear-programme-in-any-us-deal?traffic_source=rss",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.836,
      "consensus": 0.591,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.7,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful context about the ongoing tensions between Israel and Iran, and the role of the US in mediating those tensions. However, it doesn't report on any solutions or progress, and the depth of the information provided is limited.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Netanyahu stated that any US deal with Iran should require dismantling Iran's nuclear infrastructure. This comes as the US prepares for a second round of nuclear talks with Iran in Geneva.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Former Steelers Offensive Lineman Announces Retirement",
    "domain": "sports",
    "source_domain": "forbes.com",
    "location": "global",
    "published": "Sun, 15 Feb 2026 22:28:46 -0500",
    "source": "Forbes",
    "sources": [
      "Forbes",
      "Sports Illustrated",
      "Yahoo Sports"
    ],
    "domains": [
      "forbes.com",
      "news.google.com",
      "sports.yahoo.com"
    ],
    "snippets": [
      "The star point guard played two seasons for the Rockets.",
      "Former Steelers Fan Favorite Announces Retirement Sports Illustrated",
      "A former Steelers offensive lineman is calling it a career."
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/69928a32b9bd11a3c72d5266/0x0.jpg?width=960",
    "titles": [
      "Former Rocket Chris Paul Announces Retirement",
      "Former Steelers Fan Favorite Announces Retirement - Sports Illustrated",
      "Former Steelers offensive lineman announces retirement"
    ],
    "url": "https://www.forbes.com/sites/rahathuq/2026/02/15/former-rocket-chris-paul-announces-retirement/",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMitAFBVV95cUxNMDc2MWtYMXB0cUs3S2ZjT0I3VmtHRUNyazM5QnM0MXV3eHRlc1R1aEhrVTA3NkJQcGhYdEJEUFU1Nkh0U2hfbUdfM0w2QTA3Q3R5Ym1jMFdFQXZYQ3JfNHZCSjdXckJIdXpJWmJuQ2dqOVR6RnpfaGFhSHhITzJGUXRSMDV3XzFfbndFS0kxSzBRcVpUQXRaMllSdDFudEo4anp3RkNJdEpKUEtyejIyMGREZVY?oc=5",
      "https://sports.yahoo.com/articles/former-steelers-offensive-lineman-announces-175454346.html"
    ],
    "location_scope": "global",
    "link": "https://www.forbes.com/sites/rahathuq/2026/02/15/former-rocket-chris-paul-announces-retirement/",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.815,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.7,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt_short",
    "summary_reason": "too_short",
    "headline_source": "gpt",
    "summary": "A former Steelers offensive lineman, described as a fan favorite, has announced his retirement from football, according to Sports Illustrated.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Tyler Reddick Wins Daytona 500 for Michael Jordans NASCAR Team",
    "domain": "sports",
    "source_domain": "npr.org",
    "location": "national",
    "published": "Mon, 16 Feb 2026 04:06:00 -0500",
    "source": "NPR",
    "sources": [
      "NPR",
      "Forbes"
    ],
    "domains": [
      "npr.org",
      "forbes.com"
    ],
    "snippets": [
      "Tyler Reddick won \"The Great American Race\" on Sunday with a last-lap pass at Daytona International Speedway that sent Jordan into a frantic celebration.",
      "The NBA held its 75th All-Star Game on February 15, but one of the greatest players in NBA history won the Daytona 500 as Michael Jordan's team won NASCAR biggest race."
    ],
    "image_url": "",
    "titles": [
      "Michael Jordan, six-time NBA champion, is now a Daytona 500 winner",
      "Michael Jordan Rules NBA All-Star Sunday With Daytona 500 Victory"
    ],
    "url": "https://www.npr.org/2026/02/16/g-s1-110249/michael-jordan-daytona-500-nascar-win",
    "alternate_urls": [
      "https://www.forbes.com/sites/brucemartin/2026/02/15/michael-jordan-rules-nba-all-star-sunday-with-daytona-500-victory/"
    ],
    "location_scope": "national",
    "link": "https://www.npr.org/2026/02/16/g-s1-110249/michael-jordan-daytona-500-nascar-win",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.953,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.7,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Tyler Reddick won the Daytona 500 at Daytona International Speedway with a last-lap pass, securing victory for Michael Jordan's NASCAR team. The win prompted a celebration by Jordan following the race on February 16, 2026.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Bondi Beach Shooting Suspect Faces 59 Charges in First Court",
    "domain": "general",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Mon, 16 Feb 2026 07:53:10 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Reuters"
    ],
    "domains": [
      "bbc.com",
      "news.google.com"
    ],
    "snippets": [
      "The 24-year-old faces 59 charges, including 15 counts of murder and one of committing a terrorist attack.",
      "Alleged Bondi Beach gunman makes first court appearance Reuters"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/4804/live/9b3b1360-0b08-11f1-b8d0-21adbc414b0b.jpg",
    "titles": [
      "Bondi Beach shooting accused faces court for the first time",
      "Alleged Bondi Beach gunman makes first court appearance - Reuters"
    ],
    "url": "https://www.bbc.com/news/articles/c3rzwe7lr4jo?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMirwFBVV95cUxOcmhMenBNaEo5aWpMOUJBY1hHdEVqcE4xRS1EWnBMOGZDek5EamZaeUgwbzhUY3Bfd0ZJVjRQYkZVczlVeDFyV1Q0SUI0ZkV3THFRQzlzZE1rV2tnNjhiMHd5R2hZdG5rejJyWE5zWkdIVDBRdHNPZzRuTjA0aTRVeHdyclhCampOWUJtQnRjQmRwTmlGX0FKVjladWNZQmF2OXlvcDBRejFTbEZueVFR?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/news/articles/c3rzwe7lr4jo?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.921,
      "consensus": 0.591,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.695,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about a court case related to a shooting incident. However, it lacks depth and insight, offering no clear takeaway or value for the reader.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "A 24-year-old accused of a shooting at Bondi Beach has appeared in court for the first time, facing 59 charges including 15 counts of murder and one count of committing a terrorist attack.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Weston and Stoecker Win Mixed Team Skeleton Gold for Team GB",
    "domain": "sports",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Sun, 15 Feb 2026 20:06:25 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian",
      "Sky Sports",
      "BBC Sport"
    ],
    "domains": [
      "bbc.com",
      "theguardian.com",
      "skysports.com"
    ],
    "snippets": [
      "Team GB wins two Winter Olympic titles on one day for the first time as Matt Weston and Tabitha Stoecker clinch mixed team skeleton gold.",
      "Matt Weston and Tabby Stoecker make history as they claim gold in the mixed team skeleton at the 2026 Winter Olympics. Weston becomes the first Team GB athlete to win two gold medals in a single Winter Olympics.",
      "British pair triumph in mixed team skeleton event Bankes and Nightingale win mixed snowboard cross The Games organisers had only just given Matt Weston the box for the medal he won on Friday night. He had been keeping it stashed in a spare sock in his top drawer since the moment he took it off that",
      "Matt Weston and Tabby Stoecker teamed up to claim Olympic gold in the mixed team skeleton competition.",
      "Great Britain's Matt Weston and Tabby Stoecker give their reactions to making history by winning gold in the mixed team skeleton at the 2026 Winter Olympics.",
      "Team GB’s Matt Weston and Tabby Stoecker reflect on an historic day at Milan-Cortina."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/f7a1/live/74b86510-0aa1-11f1-9972-d3f265c101c6.jpg",
    "titles": [
      "Weston and Stoecker win GB's second gold of day",
      "Weston and Stoecker make history as Team GB win third Olympic gold",
      "Weston and Stoecker strike gold to cap GB’s greatest day at Winter Olympics",
      "'Super Sunday' - Weston and Stoecker win mixed skeleton gold for Team GB",
      "'I can't believe it' - Weston and Stoecker react to historic gold",
      "'I didn't expect this!' | Weston and Stoecker stunned by Olympic glory"
    ],
    "url": "https://www.bbc.com/sport/articles/cm2x7m17jydo?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://www.bbc.com/sport/videos/c75ezvv7yddo?at_medium=RSS&at_campaign=rss",
      "https://www.theguardian.com/sport/2026/feb/15/matt-weston-tabby-stoecker-gold-mixed-team-skeleton-gb-winter-olympics-milano-cortina-2026",
      "https://www.skysports.com/olympics/news/12040/13508008/winter-olympics-2026-matt-weston-and-tabby-stoecker-win-mixed-team-skeleton-gold-for-team-gb",
      "https://www.bbc.com/sport/videos/c33j4m0ypxlo?at_medium=RSS&at_campaign=rss",
      "https://www.skysports.com/watch/video/13508053/matt-weston-and-tabby-stoecker-thrilled-following-gbs-greatest-day-at-winter-olympics"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/sport/articles/cm2x7m17jydo?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.664,
      "consensus": 0.888,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.694,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Matt Weston and Tabby Stoecker won gold for Great Britain in the mixed team skeleton at the 2026 Winter Olympics, marking Team GB's first time winning two Winter Olympic titles in one day. Weston also became the first Team GB athlete to win two gold medals at a single Winter Olympics.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Warner Bros. Considers Renewed Sale Talks With Paramount After New",
    "domain": "business",
    "source_domain": "cnbc.com",
    "location": "national",
    "published": "Sun, 15 Feb 2026 23:58:09 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Reuters",
      "Bloomberg"
    ],
    "domains": [
      "cnbc.com",
      "news.google.com"
    ],
    "snippets": [
      "Warner Bros. board members are weighing whether Paramount's sweetened bid may result in a better deal or prompt Netflix to up its offer, Bloomberg reports.",
      "Warner Bros weighs reopening sale talks with Paramount, Bloomberg News reports Reuters",
      "Warner Bros. Weighs Reopening Sale Negotiations With Paramount Bloomberg.com",
      "Warner Bros. may reopen sale talks with Paramount following new deal terms, Bloomberg reports CNBC"
    ],
    "image_url": "",
    "titles": [
      "Warner Bros. may reopen sale talks with Paramount following new deal terms, Bloomberg reports",
      "Warner Bros weighs reopening sale talks with Paramount, Bloomberg News reports - Reuters",
      "Warner Bros. Weighs Reopening Sale Negotiations With Paramount - Bloomberg.com",
      "Warner Bros. may reopen sale talks with Paramount following new deal terms, Bloomberg reports - CNBC"
    ],
    "url": "https://www.cnbc.com/2026/02/15/warner-bros-discovery-paramount-netflix.html",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMi0gFBVV95cUxNMDBOVGVidmlZSjM5dHQwbV9VRUFsUWJXYjN5LVFKZzhjb1NyN3NOczlTTVdpSHE3b1loakthMGNLaHBWMWdvaFMwTGYxbmFzZU1wbkdwc2ExOVh1Vy1CV20tdkREN0Fad21nTjZoX19vRjZYQW01b2lVaDZYM3JkMTVsc0ZvMVFHeG1sU0pUZG1oS0JHVnN5X2hwckQ0OHlXb0hHOVNrQktLaHAzUWNxMEJjMnFQVHQ5b1ZZVHhmSlFoam13R29VZkI5TF9BclcxZmc?oc=5",
      "https://news.google.com/rss/articles/CBMisgFBVV95cUxOSHlNSTV2cndLWUVwRFY2VW4tUEk4TkJEcy1vRTU2RDUwZnlUNFprVVBzY196cEgyMkhqZ09YSkVYQ2owUTNMZXlOSjBXUnVXSGktZUJsTHV0UjMwVkd3R1VPMFVzZERzdEdRdFBmQTFhOGd3eW9INlBZam81T3lad3hzYmY0RGpaa3RqcTY0Wi1zaGZSc2szQVpwS0tLLV9lMFRyQXBqY0NuV3BTQTY5VE5R?oc=5",
      "https://news.google.com/rss/articles/CBMiggFBVV95cUxOdG5SWUZCcmk0N1VHTUlYdl9KOTFBQzRtckc4Mnc2RmJvWmI2UVlDMHA1eDZSWlh0SWJaLUdHcnB2VEJ2MXFlOWRKZk9BcFl6VmtkSnpGbHdvSkw1eFIyVm1OR2RmWUhjTUZ4WFhxSUJ6VFl3ekxDbkVjR2E2ejlnTHZn0gGHAUFVX3lxTE93UFRtT011WEFZMllmMEFGU01LWFdnX2dpZ1d0T3lLaVhlMDVtZlFHdUx4REJYNi1tY2xJbmlCYlJRbXRzRDA0dnhZOFlNNnlESmdQSVlRVUJydUN5VjlYRTRFYUk2UDlySGM0OHVnY2lhYW8yTzJXcmpYVUZLWFBHY29ELWlHWQ?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.cnbc.com/2026/02/15/warner-bros-discovery-paramount-netflix.html",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.739,
      "consensus": 0.769,
      "constructiveness": 0.05,
      "proximity": 0.5
    },
    "score": 0.679,
    "constructiveness_score": 0.05,
    "constructiveness_reason": "actions: reopen; speculative_penalty=0.03 (tokens: may); semantic: pos_sim=0.20, neg_sim=0.00; semantic_boost=0.05; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Warner Bros. is considering reopening sale negotiations with Paramount after Paramount presented improved deal terms, according to Bloomberg. The board is evaluating whether the new offer could lead to a better agreement or influence competing bids.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Hungary and Slovakia Request Russian Oil Shipments Through Croatia",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Mon, 16 Feb 2026 09:32:10 GMT",
    "source": "Bloomberg",
    "sources": [
      "Bloomberg",
      "Financial Post"
    ],
    "domains": [
      "news.google.com",
      "financialpost.com"
    ],
    "snippets": [
      "Hungary Seeks Russian Crude Shipments Via Croatia, Minister Says Bloomberg.com",
      "Hungary and Slovakia requested that Croatia allow the shipment of Russian crude via the Adriatic pipeline while a key route through Ukraine remains blocked, Hungary’s foreign minister said."
    ],
    "image_url": "",
    "titles": [
      "Hungary Seeks Russian Crude Shipments Via Croatia, Minister Says - Bloomberg.com",
      "Hungary Seeks Russian Oil via Croatian Route Amid Disruption"
    ],
    "url": "https://news.google.com/rss/articles/CBMitAFBVV95cUxNdF9XOWMwVGNVcWJLVC0tNE00aFBqcnhjR1ZuMlNZMkxhYm0ydjhHNG0yU3g0NmVadGZKV1pMeWpDOVZIc0F2YmJITWlpNVdERTNNR0tfa2FaWEtFVVEwbGtqUzZoZHVmazFlbFAwdHJ0OFNkUGJmbW1rc0ZJakMwUFdpVmVsU0RSYnBSblZ2Tll4THBXQUd5ZUIxWmxDLXIxTXdQNm51Y0JVQTZldzBGRi1XZXA?oc=5",
    "alternate_urls": [
      "https://financialpost.com/pmn/business-pmn/hungary-seeks-russian-oil-via-croatian-route-amid-disruption"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMitAFBVV95cUxNdF9XOWMwVGNVcWJLVC0tNE00aFBqcnhjR1ZuMlNZMkxhYm0ydjhHNG0yU3g0NmVadGZKV1pMeWpDOVZIc0F2YmJITWlpNVdERTNNR0tfa2FaWEtFVVEwbGtqUzZoZHVmazFlbFAwdHJ0OFNkUGJmbW1rc0ZJakMwUFdpVmVsU0RSYnBSblZ2Tll4THBXQUd5ZUIxWmxDLXIxTXdQNm51Y0JVQTZldzBGRi1XZXA?oc=5",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.965,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.678,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Hungary and Slovakia have asked Croatia to permit shipments of Russian crude oil through the Adriatic pipeline, as their usual supply route via Ukraine is currently blocked, according to Hungary's foreign minister.",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Lindsey Vonn to Return to U.S. for Further Surgeries After Olympic",
    "domain": "politics",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Sun, 15 Feb 2026 18:54:00 GMT",
    "source": "Associated Press",
    "sources": [
      "Associated Press",
      "Globe and Mail",
      "Sportsnet"
    ],
    "domains": [
      "news.google.com",
      "sportsnet.ca"
    ],
    "snippets": [
      "Lindsey Vonn is preparing to fly home to the US with more surgeries to come, team official tells AP AP News",
      "Vonn is reportedly preparing to fly home to U.S. with more surgeries on deck The Globe and Mail",
      "CORTINA D’AMPEZZO, Italy — Lindsey Vonn was preparing to fly back to her home country on Sunday after her terrifying head-over-heels crash in the Olympic downhill, the U.S. Ski Team’s chief told The Associated Press. Sophie Goldschmidt, president and CEO of the U.S. Ski and Snowboard Association, told the AP the team’s medical staff has been coordinating Vonn’s recovery since the crash and subsequent helicopter evacuation at the Milan Cortina Games and would try to accompany her home. Vonn has had multiple surgeries in Italy to repair a complex tibia fracture in her left leg. “We’re working..."
    ],
    "image_url": "",
    "titles": [
      "Lindsey Vonn is preparing to fly home to the US with more surgeries to come, team official tells AP - AP News",
      "Vonn is reportedly preparing to fly home to U.S. with more surgeries on deck - The Globe and Mail",
      "Lindsey Vonn to have more surgeries at home: U.S. Ski Team chief"
    ],
    "url": "https://news.google.com/rss/articles/CBMikgFBVV95cUxOd3ctZnJUUDlENnhQb3Y1MzFucHlxSXRDenY2Q2tzb2xxdWJmTHNFRGQtUkdaTzRZX0RJY2Q4cXJ5anRlY2RROFB5M0ZYTC1KMUh3eWtLSnhHbEM0a2ZkMVZVS0ZNSEc3dWd5TFB5Q1FkUW9jenl5YW9XcTRnaWd4TnlrUHlFM1BLTnljbXNkajlCZw?oc=5",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMixAFBVV95cUxQUDJhSl8yNTMyeWtvT25sTzFmQXl3eF8td2RhbUFzLXZ1eHdwdFVQNnI4blVTQUx3VTdqeWhGcGlkY25lX0EzNWtZcHVsSEhqd014azkteWM4ZlUyYkQ2MWY1dXZqTDZfN3p5Ujg4RUU2eEYwMXVGRmwtZXpNMkJNZnlMSXVHSGo2d2pUTl9PV1VZTm1BSzhIZVJoRHkyX2dUOW5kTF8tdHp0UVJvMkZsUUpIUjEyMUg3MVM1T3k3NTB6SkI5?oc=5"
    ],
    "location_scope": "national",
    "link": "https://news.google.com/rss/articles/CBMikgFBVV95cUxOd3ctZnJUUDlENnhQb3Y1MzFucHlxSXRDenY2Q2tzb2xxdWJmTHNFRGQtUkdaTzRZX0RJY2Q4cXJ5anRlY2RROFB5M0ZYTC1KMUh3eWtLSnhHbEM0a2ZkMVZVS0ZNSEc3dWd5TFB5Q1FkUW9jenl5YW9XcTRnaWd4TnlrUHlFM1BLTnljbXNkajlCZw?oc=5",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.642,
      "consensus": 0.769,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.675,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "The story provides basic awareness about Lindsey Vonn's health status but does not provide any additional insight or useful information for the reader. It's more of a status update than a constructive news story.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Lindsey Vonn is preparing to return to the U.S. after undergoing multiple surgeries in Italy for a complex tibia fracture sustained during a crash at the Milan Cortina Olympic downhill. Additional surgeries are planned, and the U.S. Ski Team is coordinating her recovery and travel.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Hollywood Groups Accuse AI Video Generator of Using Likenesses",
    "domain": "business",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Mon, 16 Feb 2026 07:44:11 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "CNBC"
    ],
    "domains": [
      "aljazeera.com",
      "cnbc.com"
    ],
    "snippets": [
      "Hollywood groups say the AI video generator uses the likeness of actors and others without permission.",
      "ByteDance has said it will work to strengthen safeguards on a new AI video-making tool, following copyright concerns and legal threats from Hollywood."
    ],
    "image_url": "",
    "titles": [
      "ByteDance pledges fixes to Seedance 2.0 after Hollywood copyright claims",
      "ByteDance says it will add safeguards to Seedance 2.0 following Hollywood backlash"
    ],
    "url": "https://www.aljazeera.com/news/2026/2/16/bytedance-pledges-fixes-to-seedance-2-0-after-hollywood-copyright-claims?traffic_source=rss",
    "alternate_urls": [
      "https://www.cnbc.com/2026/02/16/bytedance-safegaurds-seedance-ai-copyright-disney-mpa-netflix-paramount-sony-universal.html"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2026/2/16/bytedance-pledges-fixes-to-seedance-2-0-after-hollywood-copyright-claims?traffic_source=rss",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.918,
      "consensus": 0.591,
      "constructiveness": 0.052,
      "proximity": 0.5
    },
    "score": 0.675,
    "constructiveness_score": 0.052,
    "constructiveness_reason": "phrases: fixes; semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Hollywood organizations have accused an AI video generator of using the likenesses of actors and others without their consent. The groups argue that the technology reproduces people's images without authorization, raising concerns over rights and compensation.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "U.S. Accepts European Findings on Navalny Poisoning as UK Weighs",
    "domain": "general",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Sun, 15 Feb 2026 16:59:24 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Reuters",
      "Globe and Mail"
    ],
    "domains": [
      "aljazeera.com",
      "news.google.com"
    ],
    "snippets": [
      "Secretary of state says Washington will 'not fight' European partners on their findings as UK considers new sanctions.",
      "Rubio says US does not dispute Navalny poisoning assessment by Europeans Reuters",
      "Video: U.S. does not dispute European assessment that Navalny was poisoned, says Rubio The Globe and Mail"
    ],
    "image_url": "",
    "titles": [
      "US ‘not disputing’ European assessment of Navalny poisoning, Rubio says",
      "Rubio says US does not dispute Navalny poisoning assessment by Europeans - Reuters",
      "Video: U.S. does not dispute European assessment that Navalny was poisoned, says Rubio - The Globe and Mail"
    ],
    "url": "https://www.aljazeera.com/news/2026/2/15/us-not-disputing-european-assessment-of-navalny-poisoning-rubio-says?traffic_source=rss",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMivgFBVV95cUxPT1BDMlJrU2d0cWVZQkd6VVV4aVAzd1VmbUNVeWVSX1lRRE5EV0xOR2tOdHFNSFNRSnFzR1JsaTFWMVJucnpLQ21ma21GQVp2dkpUSjZEaEZzamg1R0dyZU9HM1ZFbFFMdkdlQVpPUXNjNVdvUDdTbnpETGlJWlpIYmtjajdJbWQwdnF3ekRTeVZ6cUhOZjdRVDN6TUJFOWdmVnk4NGN5ZktBVW1jM0trWWFZWW9XYlUyWFhUVGFR?oc=5",
      "https://news.google.com/rss/articles/CBMitgFBVV95cUxPeGRJcDV1WW4yZE5kX1F5dUdKS2Jsbm1aa3YyeEU0NjdSbTRFLVdKSjJBRUFJOVRfV0FYWldQdG5vZGFVckJOWEIxODF0WnR2el9WVjJvNk93N3VUYy1NSl94VmpGZ0NTTzFCeXU2VGFORkN1VC1Uck5MMEwtYnJzSDVRUHp5NDZVaTZIV09tX01XaDJocXhGVlpoOW5qYXAzdFo0a3hDcFBHRl9FNGZBNFkyMjdmQQ?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2026/2/15/us-not-disputing-european-assessment-of-navalny-poisoning-rubio-says?traffic_source=rss",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.609,
      "consensus": 0.769,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.665,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about the US stance on the Navalny poisoning incident. However, it lacks depth or insight into the implications of this stance, the reasons behind it, or the broader geopolitical context.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Marco Rubio stated that the United States does not dispute the European assessment that Alexei Navalny was poisoned. The U.S. Secretary of State confirmed Washington will not challenge European findings, while the UK is considering new sanctions in response.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "FBI Finds DNA Matched Glove Near Nancy Guthries Tucson Home",
    "domain": "general",
    "source_domain": "npr.org",
    "location": "national",
    "published": "Sun, 15 Feb 2026 18:39:12 -0500",
    "source": "NPR",
    "sources": [
      "NPR",
      "CBC News"
    ],
    "domains": [
      "npr.org",
      "cbc.ca"
    ],
    "snippets": [
      "The FBI says a glove containing DNA was found about two miles from Nancy Guthrie's Arizona home and appears to match those worn by a masked person outside her front door the night she vanished.",
      "The FBI says a glove containing DNA was found about three kilometres from Nancy Guthrie's home and appears to match those worn by a masked person outside her front door in Tucson, Ariz., the night she vanished."
    ],
    "image_url": "",
    "titles": [
      "FBI: DNA from glove near Guthrie home appears to match glove worn by suspect",
      "DNA recovered from glove found near home of Savannah Guthrie's missing mom: FBI"
    ],
    "url": "https://www.npr.org/2026/02/15/nx-s1-5715252/fbi-dna-glove-guthrie-home-suspect-video",
    "alternate_urls": [
      "https://www.cbc.ca/news/world/savannah-guthrie-mom-missing-dna-glove-9.7091577?cmp=rss"
    ],
    "location_scope": "national",
    "link": "https://www.npr.org/2026/02/15/nx-s1-5715252/fbi-dna-glove-guthrie-home-suspect-video",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.733,
      "consensus": 0.591,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.664,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about an ongoing criminal investigation. However, it does not provide deeper insights or actionable information for the reader.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The FBI reports that a glove containing DNA was found about two miles from Nancy Guthrie's home in Tucson, Arizona. The glove appears to match those worn by a masked person seen outside her front door on the night she disappeared.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Starmer Seeks to Extend UK Online Safety Rules to AI Chatbots",
    "domain": "business",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Mon, 16 Feb 2026 06:44:38 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Bloomberg"
    ],
    "domains": [
      "aljazeera.com",
      "news.google.com"
    ],
    "snippets": [
      "PM seeks powers to act quickly on a consultation considering an Australia-style social media ban for children below 16.",
      "Starmer Wants AI Chatbots to Follow UK’s Online Safety Rules Bloomberg.com"
    ],
    "image_url": "",
    "titles": [
      "UK’s Starmer announces crackdown on AI chatbots in child safety push",
      "Starmer Wants AI Chatbots to Follow UK’s Online Safety Rules - Bloomberg.com"
    ],
    "url": "https://www.aljazeera.com/news/2026/2/16/uks-starmer-announces-crackdown-on-ai-chatbots-in-child-safety-push?traffic_source=rss",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMisAFBVV95cUxQR2ktQzdSMlE1Z3Bqajlzb1lhd2ZKY0FUT0VPOHZvU0lKQk9MOEdCZTJoWlpnQXBIa1NSbGJSY2l2MERFdjh6bkpvcDAyNGlSY0hYR1QxRTlUSVFPOUJhWlZjVnpwQnhlWmtGVEZQUGtNRWR4emMwTlJxUDk0S0d4SDkybW9MMGJuU2VYU24wVmpTcFlLRDJBLXlucllWbTBLMWgzbTNqaWhUOTZRZk5pUg?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2026/2/16/uks-starmer-announces-crackdown-on-ai-chatbots-in-child-safety-push?traffic_source=rss",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.893,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.663,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Prime Minister Starmer is seeking authority to enforce the UK's online safety rules on AI chatbots and is considering an Australia-style ban on social media for children under 16, with a consultation underway.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Sweden Reconsiders Adopting Euro Amid Shifting Global Alliances",
    "domain": "business",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Mon, 16 Feb 2026 05:39:01 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Bloomberg"
    ],
    "domains": [
      "bbc.com",
      "news.google.com"
    ],
    "snippets": [
      "European nations are asking whether traditional alliances can suffice, or whether they should be diversifying",
      "Trump’s New World Order Is Pushing Sweden to Warm Up to the Euro Bloomberg.com",
      "Why Sweden Is Changing Its Tune on Adopting the Euro Bloomberg.com"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/c9f8/live/23630490-08e9-11f1-b7e1-afb6d0884c18.jpg",
    "titles": [
      "Trump's new world order has become real and Europe is having to adjust fast",
      "Trump’s New World Order Is Pushing Sweden to Warm Up to the Euro - Bloomberg.com",
      "Why Sweden Is Changing Its Tune on Adopting the Euro - Bloomberg.com"
    ],
    "url": "https://www.bbc.com/news/articles/cddn002g6qzo?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiuwFBVV95cUxOWEtJZ1pONkdRQVpWNHVNdXdRZUlkZDRCeXpISU1xMUNnSUd0QVhNMDM3U0d2NGJlVXhhMmJLZUhQR2lja3MzcFVlR2gxVUtpTmNuel9tX21TZkI0MUgwNlBZM1puRnZXQmhpaWZ6bWZ6QmRnMGF0WFBzS3RtbmVWQTRpTWNHSkVKUUNiRzZ4bDJuV0Y1Wms5M0huejc0Y2d6ZnFfa001NENKdWhrSnpsQ2hQOW1pMVpRTV9V?oc=5",
      "https://news.google.com/rss/articles/CBMixwFBVV95cUxON29DYXJYMmhXNEtBbzZkTDVLZHhVdENLay10SmplYWs3R0xUTnNaWmtjT0F4WUhNQkV4dmtkM3hVNmpIazZnMXc2b0FrbDVsOHZmcy03XzZUWkNsWHBEbkFlUENvNlh0ZkV2YTN1VTB1RGo4VWM0bnRfX29fR1FYMWtUS3pyM1NGeXlNWXhZQjZ5cWJHMHA0cDZwZ0pRVmU5R2dwbXNvbk5vN2hRRmJtSVpUcDJzcURhdzN5Mkh5Z2V6SnpjWVA0?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/news/articles/cddn002g6qzo?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.866,
      "consensus": 0.591,
      "constructiveness": 0.05,
      "proximity": 0.5
    },
    "score": 0.659,
    "constructiveness_score": 0.05,
    "constructiveness_reason": "semantic: pos_sim=0.20, neg_sim=0.00; semantic_boost=0.05; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Sweden is reconsidering its position on adopting the euro, with recent discussions influenced by changes in global alliances and security concerns. The shift comes amid broader European debates about economic and political stability.",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Bryce Harper Responds to Dombrowskis 2025 Elite Player Comment",
    "domain": "business",
    "source_domain": "forbes.com",
    "location": "global",
    "published": "Sun, 15 Feb 2026 21:37:22 -0500",
    "source": "Forbes",
    "sources": [
      "Forbes",
      "Yahoo Sports"
    ],
    "domains": [
      "forbes.com",
      "sports.yahoo.com"
    ],
    "snippets": [
      "Philadelphia Phillies manager Rob Thomson revealed his thinking after the franchise slugger sent a Dave Dombrowski message.",
      "Bryce Harper is not using Dave Dombrowski's assessment of his play last season as motivation for 2026.",
      "In October last year, Phillies president Dave Dombrowski said Bryce Harper was no longer an elite player. Harper finally responded."
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/699281f2de5f286dd6e6047c/0x0.jpg?width=960&precrop=4342%2C2443%2Cx0%2Cy0",
    "titles": [
      "Phillies Make Bryce Harper Lineup Decision After ‘Wild’ Reaction",
      "Phillies’ Bryce Harper speaks out on ‘wild’ Dave Dombrowski comments",
      "Bryce Harper on Dave Dombrowski saying he's no longer elite: 'Kind of wild'"
    ],
    "url": "https://www.forbes.com/sites/peterchawaga/2026/02/15/phillies-make-bryce-harper-lineup-decision-after-wild-reaction/",
    "alternate_urls": [
      "https://sports.yahoo.com/articles/phillies-bryce-harper-speaks-wild-215606425.html",
      "https://sports.yahoo.com/articles/bryce-harper-dave-dombrowski-saying-173557847.html"
    ],
    "location_scope": "global",
    "link": "https://www.forbes.com/sites/peterchawaga/2026/02/15/phillies-make-bryce-harper-lineup-decision-after-wild-reaction/",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.796,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.628,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Bryce Harper has responded to Phillies president Dave Dombrowski's October 2025 comment that he was no longer an elite player, stating he is not using Dombrowski's assessment as motivation for the 2026 season. Manager Rob Thomson discussed his perspective following Harper's response.",
    "is_trending": false,
    "trending_score": 0.0
  }
]