[
  {
    "title": "House Democrats Release Trump's Alleged Epstein Birthday Message Photo",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Mon, 08 Sep 2025 17:14:23 -0400",
    "source": "NPR",
    "sources": [
      "Forbes",
      "ABC News",
      "The Guardian",
      "Al Jazeera",
      "Axios",
      "NPR",
      "CNBC",
      "BBC"
    ],
    "domains": [
      "abcnews.go.com",
      "www.theguardian.com",
      "www.forbes.com",
      "news.google.com",
      "www.cnbc.com",
      "www.bbc.com",
      "www.aljazeera.com",
      "www.npr.org"
    ],
    "snippets": [
      "Democrats on the House Oversight Committee said the book included a tawdry drawing and note that appeared to include President Trump's signature. Trump had previously denied its existence.",
      "The White House says the president did not draw the picture or sign the note, after it was published on Monday.",
      "After the letter was first reported by the WSJ, Trump denied he had written such a note and later sued for $10bn.",
      "<a href=\"https://news.google.com/rss/articles/CBMihwFBVV95cUxQNGp4U3EwY3A3VkdiaVUySWxidmFHeEtHcGFzNW5DWGVERUpuc2RPNGxFeEtGX3BpVkVIM182d1hwcWJZeVJlclZLV29nSUQyWE5WVkR1Ny1mRlhfM243X2ZhMVdTZWlab1hqNDNxRXBVTkhLMGEyWFlfMkZvblZGUTd5T2dILW8?oc=5\" target=\"_blank\">Trump's alleged drawing in Epstein birthday ",
      "The committee issued a subpoena in late August for information from the estate.",
      "President Donald Trump sued The Wall Street Journal for defamation over its report revealing the existence of the letter to Jeffrey Epstein.",
      "<p>Trump’s press secretary claims image released by Democrats on the House Oversight Committee proves US president did not draw picture or sign it</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/2025/sep/08/trump-epstein-birthday-letter\">House Democrats share screenshot of apparent Trump ",
      "<p>Screenshot mirrors description of letter, first revealed by WSJ and turned over by estate lawyers after subpoena</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/live/2025/sep/08/donald-trump-immigration-hyundai-tariffs-us-politics-live-news-updates\">US politics live – latest updates</a",
      "A photo allegedly showing a birthday message to Jeffrey Epstein allegedly signed by Donald Trump was published by House Democrats and the Wall Street Journal."
    ],
    "image_url": "",
    "titles": [
      "Estate of Jeffrey Epstein gives Congress 'birthday book' allegedly signed by Trump",
      "Democrats in Congress release alleged Trump birthday note to Epstein",
      "Trump’s alleged, suggestive birthday note to Epstein released by Democrats",
      "Trump's alleged drawing in Epstein birthday book released by House Democrats - Axios",
      "Democrats share image of alleged Trump letter in Epstein 'birthday book'",
      "Trump Epstein letter and drawing from 'birthday book' released",
      "White House hits back after Democrats share alleged Trump ‘birthday note’ to Jeffrey Epstein – live updates",
      "House Democrats share image of apparent Trump birthday note to Epstein",
      "Photo Allegedly Showing Birthday Message To Epstein Signed By Trump Given To Congress"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.94,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.863,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Democrats on the House Oversight Committee published a photo of a birthday message allegedly signed by Donald Trump to Jeffrey Epstein, which Trump had previously denied existed. The White House and Trump's press secretary claim he did not create or sign the drawing. Following the Wall Street Journal's report on the letter, Trump sued the publication for $10 billion for defamation. The image was released after a subpoena was issued for information from Epstein's estate.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "France's Government Falls as PM Bayrou Ousted in Confidence Vote",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Mon, 08 Sep 2025 13:28:05 -0400",
    "source": "NPR",
    "sources": [
      "Financial Times",
      "The Guardian",
      "Al Jazeera",
      "Deutsche Welle",
      "NPR",
      "New York Times"
    ],
    "domains": [
      "www.nytimes.com",
      "www.theguardian.com",
      "www.dw.com",
      "www.ft.com",
      "www.aljazeera.com",
      "www.npr.org"
    ],
    "snippets": [
      "Legislators toppled France's government in a confidence vote, a new crisis for Europe's second-largest economy. Prime Minister François Bayrou was ousted overwhelmingly in a 364-194 vote against him.",
      "French Parliament votes to bring down the Bayrou-led government over its plans to cut about $52bn to reduce the debt.",
      "France is set to lose its third premier in 12 months. Pressure is now mounting on President Emmanuel Macron to pick a new prime minister after Francois Bayrou's resignation.",
      "President Emmanuel Macron will look for a replacement who can break the budget impasse",
      "<p>Government collapses after Emmanuel Macron’s ally wins support of just 194 MPs with 364 against </p><p><a href=\"https://www.theguardian.com/world/2024/dec/13/from-farmer-to-premier-who-is-francois-bayrou-the-new-french-prime-minister\">François Bayrou</a> has been ousted in a confidence vote after",
      "Prime Minister François Bayrou failed a confidence vote aimed at breaking an impasse over the budget, adding more pressure on President Emmanuel Macron."
    ],
    "image_url": "",
    "titles": [
      "France's government collapses after the prime minister loses a confidence vote",
      "French government collapses after PM Bayrou ousted in confidence vote",
      "France: Prime Minister Bayrou ousted in confidence vote",
      "French government collapses as PM François Bayrou loses confidence vote",
      "François Bayrou ousted as French PM after losing confidence vote",
      "French Prime Minister Bayrou Loses Confidence Vote, Putting Pressure on Macron"
    ],
    "score_components": {
      "magnitude": 0.986,
      "recency": 0.869,
      "consensus": 1.0,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.854,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "France's government fell after a confidence vote ousted Prime Minister François Bayrou with a 364-194 result. The vote was a response to Bayrou's controversial plans to cut $52bn in spending to reduce national debt. This marks the third prime ministerial departure in France within a year, putting President Emmanuel Macron under pressure to find a successor capable of resolving the budget deadlock.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Lachlan Murdoch to Lead Murdoch Empire, Resolving Family Dispute",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 08 Sep 2025 22:24:37 GMT",
    "source": "BBC",
    "sources": [
      "Fortune",
      "Forbes",
      "Financial Times",
      "The Guardian",
      "Business Insider",
      "BBC"
    ],
    "domains": [
      "www.theguardian.com",
      "www.businessinsider.com",
      "www.bbc.com",
      "fortune.com",
      "www.ft.com",
      "www.forbes.com"
    ],
    "snippets": [
      "Lachlan Murdoch will retain control the conservative Fox and News Corp empire under the deal.",
      "Lachlan takes control as three siblings receive $1.1bn each to settle long-running family feud",
      "<p>Family announces Rupert Murdoch’s eldest son, Lachlan Murdoch, will secure control of business</p><p>The succession battle at Rupert Murdoch’s media empire has ended.</p><p>The family announced on Monday that Lachlan Murdoch, Murdoch’s eldest son, will secure control of the Murdochs’ sprawling me",
      "Rupert Murdoch and his children have reached an agreement over what will become of his media empire. It will see heir apparent Lachlan Murdoch reign.",
      "The dispute over the Murdoch’s family trust intensified last year, with family patriarch and billionaire Rupert Murdoch seeking to give control to Lachlan, his eldest son.",
      "The future of Fox News and The Wall Street Journal were at stake."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/3706/live/50d831a0-8cf4-11f0-bd6b-bb632e699d74.jpg",
    "titles": [
      "Murdochs reach deal in succession battle over media empire",
      "Murdoch seals $3.3bn succession deal to hand empire to eldest son",
      "Murdoch family reaches deal to resolve succession fight over media empire",
      "The real-life 'Succession' fight for control of the Murdoch media empire has come to an end",
      "Murdochs Resolve Succession Dispute With Multibillion-Dollar Deal Favoring Lachlan",
      "Rupert Murdoch’s real-life ‘Succession’ battle just ended in a multibillion-dollar deal that keeps Fox News, Wall Street Journal conservative"
    ],
    "score_components": {
      "magnitude": 0.986,
      "recency": 0.943,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.834,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Lachlan Murdoch will take control of the Murdoch media empire, including Fox News and The Wall Street Journal, following a family agreement. This decision resolves a succession dispute, with Lachlan's siblings receiving $1.1 billion each.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Murdoch Family Resolves Dispute Over Media Empire's Future Control",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Mon, 08 Sep 2025 17:37:22 -0400",
    "source": "NPR",
    "sources": [
      "Financial Post",
      "CityNews",
      "NPR",
      "ABC News"
    ],
    "domains": [
      "financialpost.com",
      "abcnews.go.com",
      "ottawa.citynews.ca",
      "www.npr.org"
    ],
    "snippets": [
      "The owner of Fox News, the <em>Wall Street Journal</em> and dozens of other media properties has settled a legal fight with three of his own children over who would control his companies after his death.",
      "Rupert Murdoch&rsquo;s family has reached a deal on control of his media empire after his death",
      "Rupert Murdoch&#8217;s family has reached a deal on control of the 94-year-old mogul&#8217;s media empire after his death, ensuring no change in direction at Fox News, the most popular network for President Donald Trump and conservatives. The deal creates a trust establishing control of the Fox Corp",
      "Rupert Murdoch’s family has reached a deal on control of the 94-year-old mogul’s media empire after his death, ensuring no change in direction at Fox News, the most popular network for President Donald Trump and conservatives. The deal creates a trust establishing control of the Fox Corp. for Lachla"
    ],
    "image_url": "",
    "titles": [
      "Rupert Murdoch buys out 3 of his children to seal fate of his media empire",
      "Rupert Murdoch's family reaches deal on who will control media empire after his death",
      "Rupert Murdoch’s family reaches deal on who will control media empire after his death",
      "Rupert Murdoch’s family reaches deal on who will control media empire after his death"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.947,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.804,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Rupert Murdoch and his children have settled a dispute over the future control of his media empire, including Fox News and the Wall Street Journal, after his death. A trust has been established to ensure continuity in the direction of the companies, with no expected changes at Fox News, a key outlet for conservative audiences. This agreement resolves internal family legal battles over Murdoch's assets.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Jerusalem Shooting: 5 Dead, 12 Injured in Attack at Bus Stop",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Mon, 08 Sep 2025 05:27:11 -0400",
    "source": "NPR",
    "sources": [
      "Washington Post",
      "The Guardian",
      "Al Jazeera",
      "New York Times",
      "NPR"
    ],
    "domains": [
      "www.nytimes.com",
      "www.theguardian.com",
      "www.washingtonpost.com",
      "www.aljazeera.com",
      "www.npr.org"
    ],
    "snippets": [
      "Hamas hailed the attack without claiming responsibility, calling it a \"natural response to the occupation's crimes against our people.\"",
      "Six people were killed in a shooting attack by suspected Palestinian gunmen at a bus stop in occupied East Jerusalem.",
      "<p>At least 12 others injured in attack at Ramot intersection during morning rush hour</p><p>Palestinian gunmen opened fire at a crowded bus stop in the northern outskirts of Jerusalem on Monday, killing six people and injuring 12 others before being shot dead by an off-duty soldier and a civilian a",
      "Israeli authorities identified the two gunmen, who were killed at the scene, as Palestinians from the West Bank.",
      "The Israeli police described the shooting as a terrorist attack and said that the perpetrators had been killed at the scene."
    ],
    "image_url": "",
    "titles": [
      "Palestinian gunmen kill 6 people in attack on Jerusalem bus stop",
      "Suspected Palestinian gunmen kill six people in East Jerusalem",
      "Palestinian gunmen kill six people at Jerusalem bus stop",
      "Gunmen kill 6 in shooting attack at Jerusalem bus stop, police say",
      "Gunmen Attack Bus Stop in Jerusalem, Killing at Least 6"
    ],
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.735,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.801,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "In Jerusalem, a shooting at a bus stop by two Palestinian attackers from the West Bank resulted in at least five deaths and 12 injuries, with six in serious condition. The incident, occurring during the morning rush hour, is among the deadliest in the city in recent years. Israeli police and civilians at the scene responded, killing the two gunmen. Authorities are treating the event as a terrorist attack.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Nottingham Forest Fires Coach Nuno Espirito Santo Amid Tensions",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 08 Sep 2025 23:32:50 GMT",
    "source": "BBC",
    "sources": [
      "Yahoo Sports",
      "Sky Sports",
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.independent.co.uk",
      "onefootball.com",
      "www.bbc.com",
      "www.skysports.com"
    ],
    "snippets": [
      "Nottingham Forest head coach Nuno Espirito Santo is sacked after 20 months in charge of the club.",
      "Nottingham Forest head coach Nuno Espirito Santo is sacked after 20 months in charge of the club.",
      "The 51-year-old was only given a new contract in June after guiding Forest into the Europa League last season",
      "Nottingham Forest have announced the sacking of their head coach, Nuno Espírito Santo.The decision, reported by BBC Sport, brings an abrupt end to Nuno’s tenure less than two years after his appoin...",
      "<ul><li><p>Nuno had led Forest to historic European qualification</p></li><li><p>Head coach recently admitted tensions with owner</p></li></ul><p>Nottingham Forest have parted company with their head coach, Nuno Espírito Santo, after a year and eight months. Nuno’s departure comes after the emergenc",
      "Nottingham Forest have sacked head coach Nuno Espirito Santo."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/6d91/live/7ed3f440-8d08-11f0-94ca-dfb746b80100.jpg",
    "titles": [
      "Nottingham Forest sack boss Nuno",
      "Nottingham Forest sack boss Nuno",
      "Nottingham Forest sack Nuno Espirito Santo after fallout with owner Evangelos Marinakis",
      "Nottingham Forest part ways with Nuno Espírito Santo",
      "Nottingham Forest part company with head coach Nuno Espírito Santo",
      "Nuno sacked by Nottingham Forest"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.966,
      "consensus": 0.928,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.787,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Nottingham Forest has dismissed head coach Nuno Espirito Santo after 20 months, despite him recently securing the team's place in the Europa League and receiving a new contract in June. The decision follows reported tensions between Nuno and the club's owner.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Meta Accused by Whistleblowers of Hiding VR Harm to Children",
    "domain": "technology",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Mon, 08 Sep 2025 23:42:49 GMT",
    "source": "The Guardian",
    "sources": [
      "TechCrunch",
      "The Verge",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.theverge.com",
      "techcrunch.com"
    ],
    "snippets": [
      "<p>Company accused of manipulating virtual reality research as congresswoman attacks Meta’s ‘disgusting web of lies’</p><p>A group of six whistleblowers have come forward with allegations of a cover-up of harm to children on Meta’s virtual reality devices and apps. They say the social media company,",
      "A new group of whistleblowers are coming forward to allege that Meta is restricting research into how its virtual reality offerings could negatively impact kids and teens, The Washington Post reports. Four current and former Meta staffers allege that after an earlier whistleblower, Frances Haugen, l",
      "Four whistleblowers share documents with Congress alleging that the company may have suppressed research on children's safety."
    ],
    "image_url": "https://i.guim.co.uk/img/media/62b6f5efd1f5bb395e0235dcff710ca33b5f97df/560_0_5600_4480/master/5600.jpg?width=140&quality=85&auto=format&fit=max&s=4889e4a4d70e278d7ef0f29f7f7cc1f8",
    "titles": [
      "Meta hid harms to children from VR products, whistleblowers allege",
      "Meta curbed research about VR safety risks to kids, whistleblowers say",
      "Meta suppressed children’s safety research, 4 whistleblowers claim"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.969,
      "consensus": 0.789,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.751,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Six whistleblowers have accused Meta of manipulating research and covering up potential harm to children caused by its virtual reality devices and apps. These allegations include restricting investigations into the negative impacts on minors and suppressing safety research. The issue has drawn criticism from a congresswoman and has led to the sharing of documents with Congress to support these claims.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: research, support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Court Upholds $83.3M Defamation Judgment Against Trump",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Mon, 08 Sep 2025 23:11:03 GMT",
    "source": "Axios",
    "sources": [
      "Financial Times",
      "CNBC",
      "Axios"
    ],
    "domains": [
      "www.ft.com",
      "news.google.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMidkFVX3lxTE5OOGRLNC1ZTzFESHYwc1pGSVdLdmw5STlNSVdHOXhVTUJCaWFWWVVkdkxyWUd3eGpsMWpLQXdsRkJnb0RKNnoyR3pmM25wYjdodWVDSVp5Z2V0UFQ0QnBsXy1id25Ybkc1YzdaTV9XV2Y3dlNGaXc?oc=5\" target=\"_blank\">E. Jean Carroll's $83 million judgment against Trump upheld by appea",
      "Carroll has accused Trump of defaming her in statements denying her accusation that he raped her decades earlier in a New York City department store.",
      "Appeals court rejects president’s plea to vacate payment to writer E Jean Carroll"
    ],
    "image_url": "",
    "titles": [
      "E. Jean Carroll's $83 million judgment against Trump upheld by appeals court - Axios",
      "Trump loses bid to overturn $83.3 million judgment in E. Jean Carroll defamation case",
      "Trump loses attempt to have $83mn defamation judgment tossed out"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.958,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.742,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A federal appeals court upheld an $83.3 million judgment against former President Trump for defaming E. Jean Carroll, who accused him of rape. The court rejected Trump's immunity claim. With interest, the judgment exceeds $89 million.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Flotillas Aim for Gaza in Political Statement; Alvarez vs. Crawford Fight Looms",
    "domain": "sports",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-09-08T19:38:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "Forbes",
      "ESPN"
    ],
    "domains": [
      "www.forbes.com",
      "www.dw.com",
      "www.espn.com"
    ],
    "snippets": [
      "What is the symbolic and political impact of the flotillas en route to Gaza? DW takes a look at the various missions that have tried to reach the shores of Gaza since 2010.",
      "Andreas Hale explains why Canelo Alvarez and Terence Crawford are fighting, what it means for boxing and more.",
      "Everything you need to know about Saturday's Canelo Alvarez Vs. Terence Crawford boxing card, including event date, time, location, streaming info and costs."
    ],
    "image_url": "",
    "titles": [
      "Gaza-bound flotillas: All you need to know",
      "Canelo Alvarez vs. Terence Crawford: All you need to know about Saturday's fight",
      "Canelo Alvarez Vs. Terence Crawford Fight Card: Date, Time,  Location"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.909,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.726,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Since 2010, multiple flotillas have attempted to reach Gaza, symbolizing resistance and drawing political attention to the region's blockade. Meanwhile, the boxing match between Canelo Alvarez and Terence Crawford is significant for the sport, with Andreas Hale discussing its implications. The event is scheduled for Saturday, including details on time, location, and how to watch.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Nepal Protests: 19 Dead as Citizens Rally Against Corruption, Social Media Ban",
    "domain": "general",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Mon, 08 Sep 2025 15:32:49 GMT",
    "source": "The Guardian",
    "sources": [
      "Washington Post",
      "New York Times",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.washingtonpost.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "<p>Many demonstrators say they are also on the streets over corruption and nepotism they allege is rampant </p><p>At least 19 people have been killed during protests in Nepal over a government ban on dozens of online platforms including Facebook, Instagram, WhatsApp and X.</p><p>The government has f",
      "The demonstrations in Nepal over government corruption and restrictions to apps such as WhatsApp and Facebook were driven by widespread anger among young people.",
      "The government retreated from the ban amid anger over violent dispersal of demonstrators protesting graft, inequality and social media controls."
    ],
    "image_url": "https://i.guim.co.uk/img/media/3ec7617b05d41ceb469e6d8673defe4b6bdbaab8/360_0_3600_2880/master/3600.jpg?width=140&quality=85&auto=format&fit=max&s=1e87d1cd1d50355620e144827065b1a2",
    "titles": [
      "At least 19 killed in ‘gen Z’ protests against Nepal’s social media ban",
      "At least 19 killed, hundreds injured in protests after Nepal social media ban",
      "19 Killed in Nepal ‘Gen Z’ Protests Over Social Media Ban and Corruption"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.817,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.707,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "In Nepal, protests erupted against government corruption and the ban of major social media platforms, including Facebook, Instagram, WhatsApp, and X. Demonstrators, demanding the lifting of the ban and addressing corruption, clashed with police who used water cannons, batons, and rubber bullets. The unrest led to at least 19 deaths and over 200 injuries. Protesters also stormed the Parliament complex, highlighting widespread frustration with nepotism and governance issues.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Manchester City, Premier League Settle Dispute Over Sponsorship Rules",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 08 Sep 2025 14:43:37 GMT",
    "source": "BBC",
    "sources": [
      "Sky Sports",
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.skysports.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Manchester City and the Premier League reach a settlement in their dispute over the rules that govern commercial deals.",
      "<ul><li><p>Dispute over associated party transaction rules ends</p></li><li><p>Club still face charges of breaching financial rules</p></li></ul><p>Manchester City and the Premier League have settled their dispute over rules that limit the ability of top-flight clubs to sign sponsorship deals with c",
      "Manchester City and the Premier League have reached a settlement in their dispute over the rules governing Associated Party Transactions (APTs)."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/cc68/live/d0917e40-8cc4-11f0-b6ff-bfdd1f9c1014.jpg",
    "titles": [
      "Man City & Premier League end sponsor rules dispute",
      "Manchester City settle with Premier League and accept sponsorship rules are valid",
      "Man City and Premier League settle dispute over APT rules"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.804,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.698,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Manchester City and the Premier League have settled a dispute regarding Associated Party Transactions rules, which limit clubs' sponsorship deal capabilities. While this specific disagreement has been resolved, Manchester City still faces charges related to breaching other financial regulations, with the outcome of those charges still pending.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Israel Orders Gaza Evacuations Amid Airstrikes; 6 Killed in Jerusalem Shooting",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Mon, 08 Sep 2025 23:04:19 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Deutsche Welle"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.dw.com"
    ],
    "snippets": [
      "Gaza City residents told to &#039;leave now&#039;, while UN human rights chief condemns Israel for &#039;war crime upon war crime&#039;.",
      "Israel told Gaza City residents to evacuate immediately, warning of intensified airstrikes and expanded ground operations. Meanwhile six people were killed in a shooting at a Jerusalem bus stop. Follow DW for more."
    ],
    "image_url": "",
    "titles": [
      "Netanyahu threatens Gaza residents as UN slams Israel over ‘mass killing’",
      "Israel's Netanyahu warns Gaza City residents to 'leave now'"
    ],
    "score_components": {
      "magnitude": 0.795,
      "recency": 0.976,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.681,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Israel has instructed Gaza City residents to evacuate immediately due to plans for intensified airstrikes and expanded ground operations. Concurrently, a shooting at a Jerusalem bus stop resulted in six fatalities. The UN human rights chief has condemned Israel, accusing it of committing \"war crime upon war crime.\"",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Sen. Blumenthal Warns WNBA Against Interfering in Sun Ownership Talks",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 8 Sep 2025 18:52:14 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "U.S. Senator Richard Blumenthal (D-CT) sent a letter to the WNBA on Monday warning the league to stay out of negotiations between the Mohegan tribe and prospective new ownership groups for the Connecticut Sun.",
      "The stalemate between the Sun and WNBA added a new layer of drama"
    ],
    "image_url": "",
    "titles": [
      "Senator warns WNBA to stay out of Sun sale talks",
      "Connecticut Sun sale: U.S. Senator warns WNBA blocking sale 'would violate federal antitrust laws'"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.972,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.681,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "U.S. Senator Richard Blumenthal warned the WNBA in a letter to not interfere with negotiations between the Mohegan tribe and potential new owners for the Connecticut Sun. This adds tension to the ongoing stalemate regarding the team's ownership.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Russell Wilson Confirmed as Giants' QB for Sunday's Game Against Cowboys",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 8 Sep 2025 18:52:14 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "Russell Wilson will remain the Giants' starting quarterback for Sunday's game against the Cowboys, coach Brian Daboll said Monday.",
      "<p>The New York Giants are riding with their veteran.</p>"
    ],
    "image_url": "",
    "titles": [
      "Giants sticking with Wilson as QB1 vs. Cowboys",
      "Giants sticking with Russell Wilson as starting QB, says head coach Daboll"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.972,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.681,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Russell Wilson will start as the Giants' quarterback in Sunday's game against the Cowboys, confirmed by coach Brian Daboll. The team is sticking with the veteran player for the upcoming match.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "49ers' Kittle Out with Injury, Purdy's Status Uncertain",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Mon, 08 Sep 2025 23:13:05 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Yahoo Sports"
    ],
    "domains": [
      "sports.yahoo.com",
      "www.nbcsports.com",
      "www.cbssports.com",
      "www.usatoday.com"
    ],
    "snippets": [
      "San Francisco will be without one of its best players for a while",
      "49ers tight end George Kittle left Sunday's game in the second quarter and did not return.",
      "George Kittle is expected to miss at least a few weeks because of a hamstring injury he suffered in Week 1 of the 2025 NFL season.",
      "San Francisco 49ers star tight end George Kittle will miss at least a few weeks with a hamstring injury and quarterback Brock Purdy's status for this week is in question after he hurt his left shoulder and toe in the season opener.  Coach Kyle Shanahan said the team hasn't decided yet whether to pla"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/08/63bd4cac-d145-4d0e-91bf-bb4d6f25cdff/kittlesea.jpg",
    "titles": [
      "George Kittle injury update: 49ers TE expected to miss multiple weeks after injuring hamstring, per report",
      "49ers TE George Kittle will miss &quot;a few weeks&quot; with hamstring injury",
      "How long is George Kittle out? Injury update, timeline for 49ers TE",
      "49ers' George Kittle out with hamstring injury, Brock Purdy's status uncertain"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.979,
      "consensus": 0.631,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.678,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "San Francisco 49ers tight end George Kittle will be sidelined for at least a few weeks due to a hamstring injury sustained in the first week of the 2025 NFL season. Additionally, quarterback Brock Purdy's participation in the upcoming week is uncertain after injuring his left shoulder and toe in the season opener. The team has not yet made a decision on Purdy's status for the next game.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: sustain",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Belichick Allowed to Visit Patriots Facility, Says Coach Vrabel",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 8 Sep 2025 18:52:14 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "Mike Vrabel said Bill Belichick is welcome at the Patriots' facility \"to the best of my knowledge.\"",
      "<p>If Bill Belichick wants to visit the New England Patriots&#8217; facility, the current coach of the team doesn&#8217;t see it as a problem.</p>"
    ],
    "image_url": "",
    "titles": [
      "Vrabel says Belichick welcome at Patriots facility",
      "New England coach Mike Vrabel: Bill Belichick not banned from Patriots facility"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.972,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.674,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Mike Vrabel, the current coach of the New England Patriots, stated that Bill Belichick is allowed to visit the team's facility, indicating there are no known restrictions against such a visit.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Howard Shares Strategy to Disrupt Tua: Target First Read Option",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 8 Sep 2025 18:52:14 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "Former Dolphins and current Colts corner Xavien Howard said the game plan Sunday was to take away QB Tua Tagovailoa's first read and get him into \"panic mode.\"",
      "Howard didn't pull any punches when describing his former quarterback"
    ],
    "image_url": "",
    "titles": [
      "Ex-Fins CB says Colts forced Tua into 'panic mode'",
      "Xavien Howard says ex-teammate Tua Tagovailoa went into 'panic mode' during Colts' blowout of Dolphins"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.972,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.674,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Former Dolphins, now Colts cornerback Xavien Howard, revealed their strategy against QB Tua Tagovailoa in Sunday's game was to eliminate his first read option, aiming to induce panic. Howard spoke candidly about his former teammate's performance.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Erin Patterson Gets Life for Murdering 3 Relatives with Poisonous Mushrooms",
    "domain": "general",
    "source_domain": "www.washingtonpost.com",
    "location": "global",
    "published": "Mon, 08 Sep 2025 05:33:58 +0000",
    "source": "Washington Post",
    "sources": [
      "Washington Post",
      "New York Times",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.washingtonpost.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "Erin Patterson was convicted of killing three relatives with a lunch laced with death cap mushrooms. The judge called her actions “an enormous betrayal of trust.”",
      "Erin Patterson was found guilty of murdering three of her husband’s relatives and trying to kill a fourth by serving them deadly mushrooms.",
      "<p>A Victorian supreme court judge has sentenced Erin Patterson to life imprisonment with a non-parole period of 33 years. A jury had previously found Patterson guilty of three counts of murder and one count of attempted murder by serving beef wellingtons laced with deadly death cap mushrooms. She h",
      "<p>Erin Patterson has been sentenced to life in prison with a non-parole period of 33 years after murdering three people and attempting to murder a fourth with a lunch laced with death cap mushrooms. Patterson, 50, was found guilty of murdering Don and Gail Patterson – the parents of her estranged h"
    ],
    "image_url": "",
    "titles": [
      "Australian woman gets life in prison for ‘mushroom murders’",
      "Australian Woman, Erin Patterson, Gets Life in Mushroom Murder Case",
      "Watch in full: Erin Patterson sentenced to life in prison for Australian mushroom murders – video",
      "Erin Patterson: Australia's mushroom murderer sentenced to life in prison – video"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.678,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.672,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Erin Patterson was sentenced to life in prison with a minimum non-parole period of 33 years by an Australian court for murdering three of her estranged husband's relatives and attempting to murder a fourth by serving them a meal containing death cap mushrooms. The judge noted Patterson showed no remorse for her actions, which were described as a significant betrayal of trust.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Mac Jones May Start Week 2 for 49ers if Current QB Injured: Shanahan",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Mon, 08 Sep 2025 23:23:36 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Yahoo Sports"
    ],
    "domains": [
      "www.nbcsports.com",
      "www.sportingnews.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Mac Jones would start if Purdy is unable to do so",
      "The 49ers quarterback could miss Week 2",
      "Kyle Shanahan said it is too early to know whether the 49ers quarterback will play in Week 2."
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/08/bea3b1ef-570f-48d2-a505-72a3819b8338/purdy.jpg",
    "titles": [
      "Brock Purdy injury: 49ers QB dealing with toe, shoulder issues as status for Week 2 vs. Saints is uncertain",
      "49ers QB Brock Purdy suffers multiple injuries, status for Week 2 uncertain",
      "Brock Purdy has left shoulder and toe injuries"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.983,
      "consensus": 0.611,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.657,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Mac Jones is set to start for the 49ers in Week 2 if the current quarterback, whose status is uncertain due to potential injury, cannot play. Coach Kyle Shanahan stated it's too early to confirm the starting quarterback's availability for the upcoming game.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "2025 MTV VMAs Hit Six-Year Viewership Peak with 5.5 Million Tuning In",
    "domain": "business",
    "source_domain": "www.forbes.com",
    "location": "global",
    "published": "Mon, 08 Sep 2025 18:44:51 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes",
      "Business Insider"
    ],
    "domains": [
      "www.forbes.com",
      "www.businessinsider.com"
    ],
    "snippets": [
      "The 2025 \"MTV Video Music Awards\" (VMAs) delivered 5.5 million viewers, which marked a six-year audience high for the annual telecast.",
      "One of MTV's most popular programs, the VMAs, aired on … CBS, Paramount's broadcast network. Does that make sense? Sure. Here's why."
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/68bf5914c2aae6a3e33cc6d3/0x0.png?width=960",
    "titles": [
      "MTV Video Music Awards Hit Six-Year Audience High",
      "It makes sense that MTV's Video Music Awards aired on CBS"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.97,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.649,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The 2025 MTV Video Music Awards attracted 5.5 million viewers, reaching a six-year high for the annual show. It was broadcast on CBS, a network owned by Paramount, indicating a strategic choice given its popularity.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Google Admits \"Rapid Decline\" of Open Web, Contradicting Earlier Claims",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-09-08T12:50:20-04:00",
    "source": "The Verge",
    "sources": [
      "Ars Technica",
      "The Verge"
    ],
    "domains": [
      "www.theverge.com",
      "arstechnica.com"
    ],
    "snippets": [
      "For months, Google has maintained that the web is “thriving,” AI isn’t tanking traffic, and its search engine is sending people to a wider variety of websites than ever. But in a court filing from last week, Google admitted that “the open web is already in rapid decline,” as spotted earlier by Jason",
      "Google's position on the state of the Internet is murky to say the least."
    ],
    "image_url": "",
    "titles": [
      "Google admits the open web is in ‘rapid decline’",
      "In court filing, Google concedes the open web is in “rapid decline”"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.857,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.633,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Google, previously claiming the web is \"thriving\" and its search engine promotes diversity, contradicted itself in a recent court filing, acknowledging the \"rapid decline\" of the open web. This marks a significant shift in the company's public stance on the internet's health and the effects of AI on web traffic.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "475 Arrested in Raid at Hyundai Site in Georgia, South Korea Expresses Concerns",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Mon, 08 Sep 2025 16:24:52 GMT",
    "source": "CNBC",
    "sources": [
      "Washington Post",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "www.washingtonpost.com"
    ],
    "snippets": [
      "Federal and immigration agents conducted a massive raid on a Hyundai facility in Ellabell, Georgia, last week, arresting 475 people.",
      "South Korea pledged to invest $350 billion in the U.S. in a trade deal. Now the country is reeling at actions many see as counter to the spirit of the alliance."
    ],
    "image_url": "",
    "titles": [
      "What to know about the Hyundai-LG plant immigration raid in Georgia",
      "Outrage, confusion in South Korea after Georgia immigration raid"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.832,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.628,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Federal and immigration agents arrested 475 people in a raid at a Hyundai facility in Ellabell, Georgia. Following the raid, South Korea, which had committed to investing $350 billion in the U.S. as part of a trade deal, expressed concerns that the action contradicted the spirit of the U.S.-South Korea alliance.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "SpaceX Secures $17 Billion Wireless Spectrum Deal",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Mon, 08 Sep 2025 15:48:55 GMT",
    "source": "Axios",
    "sources": [
      "MarketWatch",
      "Axios"
    ],
    "domains": [
      "www.marketwatch.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMiggFBVV95cUxOa0hFRWgybTJZT19hU0lVWmpGMmxnc05TWjVHRGgweVBQSnR1SDdsSkRTS0J0UmRyUElQdlZ3YTdkR05yZl84cmJvVjlVMU5ITnRIVUF5ZGNTWG0xcG4tQjh3VEp3ZW1TOWdkZmZScDJGcVVERlhKQ3BucHREdHNxUndn?oc=5\" target=\"_blank\">SpaceX to pay $17 billion in wireless spectrum deal",
      "EchoStar’s stock soared further into record territory after a $17 billion deal to sell spectrum to Elon Musk’s SpaceX."
    ],
    "image_url": "",
    "titles": [
      "SpaceX to pay $17 billion in wireless spectrum deal - Axios",
      "SpaceX deal sends EchoStar’s stock soaring. Why Elon Musk is buying $17 billion in wireless spectrum."
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.822,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.619,
    "summary_source": "snippet",
    "summary_reason": "retry_exhausted",
    "summary": "<a href=\"https://news.google.com/rss/articles/CBMiggFBVV95cUxOa0hFRWgybTJZT19hU0lVWmpGMmxnc05TWjVHRGgweVBQSnR1SDdsSkRTS0J0UmRyUElQdlZ3YTdkR05yZl84cmJvVjlVMU5ITnRIVUF5ZGNTWG0xcG4tQjh3VEp3ZW1TOWdkZmZScDJGcVVERlhKQ3BucHREdHNxUndn?oc=5\" target=\"_blank\">SpaceX to pay $17 billion in wireless spectrum deal",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]