[
  {
    "title": "France's PM Lecornu Resigns After Less Than 24 Hours Amid Political Crisis",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Mon, 06 Oct 2025 06:07:55 -0400",
    "source": "NPR",
    "sources": [
      "New York Times",
      "MarketWatch",
      "Al Jazeera",
      "NPR",
      "Financial Times",
      "Washington Post"
    ],
    "domains": [
      "www.washingtonpost.com",
      "www.nytimes.com",
      "www.marketwatch.com",
      "www.aljazeera.com",
      "www.ft.com",
      "www.npr.org"
    ],
    "snippets": [
      "Facing criticism from all sides, France's new prime minister Sébastien Lecornu resigned less than 24 hours after naming his government and after less than a month in office, plunging the country into a deep political crisis.",
      "French Prime Minister Sebastien Lecornu has stepped down, blaming deep divisions in parliament.",
      "President Emmanuel Macron accepts resignation of newly appointed prime minister after criticism over cabinet lineup.",
      "Sébastien Lecornu quits after rightwing allies indicate they could withdraw from his government",
      "Sébastien Lecornu, a former defense minister, was in the job less than a month. He was appointed after a no-confidence vote toppled his predecessor.",
      "Sébastien Lecornu’s departure ratcheted up pressure on President Emmanuel Macron to call snap parliamentary elections.",
      "U.S. government bond yields followed their counterparts in Europe higher on Monday in reaction to the resignation of French Prime Minister Sébastien Lecornu, who held the job for less than a month."
    ],
    "image_url": "",
    "titles": [
      "France's prime minister resigns after less than a month in office",
      "France’s prime minister resigns over divisions after just weeks in office",
      "France’s new Prime Minister Lecornu resigns hours after naming cabinet",
      "France’s prime minister resigns less than a month after appointment",
      "Prime minister of France resigns hours after naming new government",
      "French Prime Minister Sébastien Lecornu Resigns",
      "Treasury market swept up in global jitters tied to resignation of French prime minister after less than a month"
    ],
    "score_components": {
      "magnitude": 0.986,
      "recency": 0.88,
      "consensus": 1.0,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.856,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Sébastien Lecornu, France's newly appointed Prime Minister, resigned less than 24 hours after forming his government and less than a month in office, citing deep political divisions and criticism from various factions, including threats from rightwing allies to withdraw support. His resignation, accepted by President Emmanuel Macron, follows criticism over the largely unchanged cabinet lineup and plunges the country into a political crisis. Lecornu, a former defense minister, had assumed the role after a no-confidence vote ousted his predecessor.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "2025 Nobel Prize in Medicine Awarded for Autoimmunity Research",
    "domain": "science",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Mon, 06 Oct 2025 05:55:46 -0400",
    "source": "NPR",
    "sources": [
      "The Guardian",
      "Deutsche Welle",
      "Al Jazeera",
      "NPR",
      "New Scientist",
      "CityNews"
    ],
    "domains": [
      "www.theguardian.com",
      "ottawa.citynews.ca",
      "www.newscientist.com",
      "www.dw.com",
      "www.aljazeera.com",
      "www.npr.org"
    ],
    "snippets": [
      "Mary E. Brunkow, Fred Ramsdell and Shimon Sakaguchi were honored for research into how the body helps the immune system avoid attacking your own tissues instead of foreign invaders.",
      "The international team discovered how the immune system is kept in check to prevent it attacking the body.",
      "Mary E. Brunkow, Fred Ramsdell, and Shimon Sakaguchi will be awarded the Nobel Prize in physiology or medicine for their instrumental work in improving our understanding of how the immune system functions.",
      "The 2025 Nobel prize in physiology or medicine has gone to Mary Brunkow, Fred Ramsdell and Shimon Sakaguchi for their discoveries around how we keep our immune system under control",
      "<p>Mary E Brunkow, Fred Ramsdell and Shimon Sakaguchi win for work on preventing immune system harming body</p><p>The Nobel prize in physiology or medicine 2025 has been awarded to three scientists for their work on how the immune system is prevented from attacking the body.</p><p>Mary E Brunkow, no",
      "STOCKHOLM (AP) — Mary E. Brunkow, Fred Ramsdell and Dr. Shimon Sakaguchi won the Nobel Prize in medicine Monday for their discoveries concerning peripheral immune tolerance. Brunkow, 64, is a senior program manager at the Institute for Systems Biology in Seattle. Ramsdell, 64, is a scientific advise"
    ],
    "image_url": "",
    "titles": [
      "The medicine Nobel Prize goes to 3 scientists for work on peripheral immune tolerance",
      "Nobel Prize for medicine awarded to immune system researchers",
      "Trio wins Nobel Prize in medicine for immune system research",
      "Nobel prize for medicine goes to trio for work on immune tolerance",
      "Nobel prize in medicine awarded to scientists for immune system research",
      "The Nobel Prize in medicine goes to 3 scientists for work on the human immune system"
    ],
    "score_components": {
      "magnitude": 0.986,
      "recency": 0.877,
      "consensus": 1.0,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.855,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Mary E. Brunkow, Fred Ramsdell, and Shimon Sakaguchi were awarded the 2025 Nobel Prize in Physiology or Medicine for their groundbreaking research on how the immune system is regulated to prevent it from attacking the body's own tissues. Their work, which involves the identification of mechanisms that help maintain immune system balance, has been pivotal in advancing our understanding of autoimmunity. This US-Japanese team's discoveries have significantly contributed to the field of immunology.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: research",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Judge Blocks Trump's National Guard Deployment to Portland; SCOTUS Eyes Presiden",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Mon, 06 Oct 2025 07:25:59 -0400",
    "source": "NPR",
    "sources": [
      "The Guardian",
      "ABC News",
      "Axios",
      "NPR",
      "LA Times"
    ],
    "domains": [
      "www.theguardian.com",
      "news.google.com",
      "www.latimes.com",
      "abcnews.go.com",
      "www.npr.org"
    ],
    "snippets": [
      "A judge issues an order to stop Trump's latest attempt to deploy the National Guard to Oregon. And, the Supreme Court opens a new term with justices tackling cases testing presidential power.",
      "<a href=\"https://news.google.com/rss/articles/CBMikAFBVV95cUxQSU83ZkFnMmR4eDlDN2l1Rk1DbVNjclFRaHM4VWZWcG1UWUJkbERQTE13MDBHTWVNRFRDcE1tWTc3NGx2TFJJTHRHN2pGQXROZ3FzR2I5Ny13eGpHSkZwVnBnOTA0YXU2bl9NUDdCbGtYZzRoS1Rvb05MMGVWYVJqQjRRNTJ1aUpIZG9WRFRaN3o?oc=5\" target=\"_blank\">Judge temporarily blocks Trump f",
      "<a href=\"https://news.google.com/rss/articles/CBMieEFVX3lxTE1SNEQwYU1yYjl5Z2JlOXhkTWVGR0V1QXVXNTZXZTlOdEhPNU50MXlkOHNBcE5hVDBKeV9uYmJaUGxjLVZjdjFoaVUwbk91WTZvSkY0QjlSR0VINGF3R0tXZTNWZjFSempoclpWblNGcktuNERETmVJZw?oc=5\" target=\"_blank\">Newsom says Trump sent California National Guard troops to Oregon",
      "<a href=\"https://news.google.com/rss/articles/CBMiiwFBVV95cUxOZHJnU1hodVpwYXJ0dGxCWDVIZjhJdUN4R2FLank1X0Fvd0F0QnZqdGh1TjE1ZklMT05sQmJFb1h2VmNSWEJNRzVwV2pwYTNNMU1HZ3EtcXhzbEJWX08zRFdESFhONzVJLXNVZGRlVmhQVWJWcjJoRnE2WTZYdERhd2d3eUsyRjA2YVU0?oc=5\" target=\"_blank\">Trump administration challenges ruling ",
      "<p>Complaint filed by Illinois says ‘these advances in President Trump’s long-declared ‘War’ on Chicago and Illinois are unlawful and dangerous’</p><p>The supreme court has <strong>rejected Ghislaine Maxwell’s challenge of her criminal conviction for recruiting and grooming minors</strong>, who were",
      "<p>A federal judge barred Trump from deploying National Guard troops to Oregon after the California Guard was sent to the state Sunday.</p>",
      "The state of Illinois and city of Chicago filed a lawsuit Monday morning seeking to block President Trump's federalization and deployment of the National Guard."
    ],
    "image_url": "",
    "titles": [
      "Judge blocks deployment of National Guard to Oregon. And, the Supreme Court's new term",
      "Judge temporarily blocks Trump from any sending National Guard troops to Oregon - Axios",
      "Newsom says Trump sent California National Guard troops to Oregon - Axios",
      "Trump administration challenges ruling on National Guard in Portland - Axios",
      "Illinois sues to block Trump from deploying national guard troops to Chicago – live",
      "Judge blocks Trump from deploying California National Guard — or any Guard troops — in Oregon",
      "Illinois files lawsuit to block deployment of National Guard"
    ],
    "score_components": {
      "magnitude": 0.964,
      "recency": 0.904,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.842,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A US District Judge, Karin Immergut, issued an order halting Trump's attempt to deploy the National Guard to Portland, Oregon, for two weeks amid ongoing legal disputes. Concurrently, the Supreme Court began a new term focusing on cases related to presidential power.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Ghislaine Maxwell's Supreme Court Appeal Declined, Transferred to Texas Camp",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 06 Oct 2025 15:34:08 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC",
      "CNBC",
      "Global News",
      "Forbes"
    ],
    "domains": [
      "www.theguardian.com",
      "globalnews.ca",
      "www.forbes.com",
      "www.cnbc.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The British socialite is serving a 20-year prison sentence on sex -trafficking charges related to former boyfriend Jeffrey Epstein.",
      "Ghislaine Maxwell, the convicted procurer of Jeffrey Epstein, may now focus efforts to get a pardon or sentence commutation from President Donald Trump.",
      "<p>Jeffrey Epstein associate was sentenced in 2022 to 20 years in prison for sex trafficking and related crimes</p><p>The <a href=\"https://www.theguardian.com/us-news/us-supreme-court\">US supreme court</a> has declined to hear an appeal from <a href=\"https://www.theguardian.com/us-news/jeffrey-epste",
      "<p>Jeffrey Epstein associate was sentenced in 2022 to 20 years in prison for sex trafficking and related crimes</p><p>The <a href=\"https://www.theguardian.com/us-news/us-supreme-court\">US supreme court</a> has declined to hear an appeal from <a href=\"https://www.theguardian.com/us-news/jeffrey-epste",
      "Ghislaine Maxwell is serving a 20-year prison term, though she was moved from a low-security federal prison in Florida to a minimum-security prison camp in Texas in July.",
      "Maxwell argued she shouldn’t have been indicted because of Jeffrey Epstein’s 2007 non-prosecution agreement."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/23fa/live/941ed560-a2be-11f0-92db-77261a15b9d2.jpg",
    "titles": [
      "US Supreme Court rejects Ghislaine Maxwell appeal in Epstein case",
      "Supreme Court rejects appeal of Ghislaine Maxwell for Epstein abetting conviction",
      "US supreme court declines to hear Ghislaine Maxwell’s appeal of sex trafficking conviction",
      "US supreme court declines to hear Ghislaine Maxwell’s appeal of sex-trafficking conviction",
      "Ghislaine Maxwell appeal in Epstein case rejected by Supreme Court",
      "Ghislaine Maxwell’s Conviction Stands As Supreme Court Rejects Case"
    ],
    "score_components": {
      "magnitude": 0.964,
      "recency": 0.965,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.829,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Ghislaine Maxwell, associated with Jeffrey Epstein, is serving a 20-year sentence for sex trafficking and related crimes as of 2022. Her appeal to the US Supreme Court was declined. Maxwell attempted to argue her indictment was invalid due to Epstein's 2007 non-prosecution agreement. Recently, she was transferred from a low-security prison in Florida to a minimum-security camp in Texas.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Rescue Efforts Underway for Hikers Trapped on Everest's North Slope",
    "domain": "general",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Mon, 06 Oct 2025 11:53:48 -0400",
    "source": "ABC News",
    "sources": [
      "Global News",
      "New York Times",
      "ABC News",
      "Washington Post"
    ],
    "domains": [
      "www.nytimes.com",
      "www.washingtonpost.com",
      "globalnews.ca",
      "abcnews.go.com"
    ],
    "snippets": [
      "An effort is underway to rescue hundreds of hikers who became trapped on Mount Everest due to an unexpected blizzard.",
      "Some 350 hikers were rescued and 200 remain stranded, Chinese state media reported Monday, as rescue efforts continued in China’s Tibet Autonomous Region.",
      "The snowfall buried tents and reduced visibility. The local authorities said that they were in contact with the hikers and that rescue efforts were underway.",
      "The freak blizzard struck during China's Golden Week holiday, which marks the start of a busy tourist season on Mt. Everest."
    ],
    "image_url": "https://s.abcnews.com/images/International/251006_abc_social_everest_hpMain_4x3_384.jpg",
    "titles": [
      "WATCH:  Hundreds of hikers trapped by blizzard on Mount Everest",
      "Snowstorm traps hundreds on Mount Everest",
      "Snowstorm Traps Hundreds of Everest Hikers",
      "Hundreds of climbers stranded on Mount Everest amid freak blizzard"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.993,
      "consensus": 0.908,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.798,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Rescue workers in Tibet are assisting hundreds of hikers trapped by a snowstorm on Mount Everest's northern slope. Chinese state media reported that tents at tourist campsites were damaged, and there are casualties. The heavy snowfall has buried tents and blocked rescue roads, but local authorities are in contact with the hikers and rescue efforts are ongoing.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Boston Bruins to Retire Zdeno Chara's No. 33 Jersey on Jan. 15",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 6 Oct 2025 11:30:23 EST",
    "source": "ESPN",
    "sources": [
      "NHL",
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.cbssports.com",
      "www.espn.com",
      "news.google.com"
    ],
    "snippets": [
      "Zdeno Chara, captain of the 2011 Stanley Cup champs, will become the Bruins' 13th player to have his number retired when his No. 33 is honored Jan. 15.",
      "The Stanley Cup champion's number will forever hang in the rafters at the TD Garden",
      "<a href=\"https://news.google.com/rss/articles/CBMikwFBVV95cUxPT0N3dnZCUllMMW53NjNqQlBvb3RTVmxpdXgtNmg0cmpfcWdneWpxWEZFelQtTU9zVzN6X3BzOUpoTVY2cFhGVWw2S3NGRG9QT1ZiLTMwblZHcDY0QUhvQmViOWlwdkpIQkp1U1FITTgwUGFjZU5mS1N6MVVoeXdnclZVaEg3Mk5Td0YzejNLSldBdU0?oc=5\" target=\"_blank\">Boston Bruins to Retire Zden"
    ],
    "image_url": "",
    "titles": [
      "Bruins to retire No. 33 of former captain Chara",
      "Bruins to retire Zdeno Chara's No. 33 as ex-captain, franchise legend joins star-studded names in rafters",
      "Boston Bruins to Retire Zdeno Chara’s Number 33 on Jan. 15 - NHL.com"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.985,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.759,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Zdeno Chara, former captain of the Boston Bruins and 2011 Stanley Cup champion, will have his No. 33 jersey retired by the team on Jan. 15. Chara will be the 13th player in Bruins history to receive this honor, with his number set to hang in the rafters at TD Garden.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "ICC Convicts Janjaweed Leader of War Crimes in Darfur",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Mon, 06 Oct 2025 15:13:57 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Deutsche Welle",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.dw.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "The International Criminal Court has found Sudanese militia chief Ali Muhammad Ali Abd-Al-Rahman guilty of war crimes.",
      "The 27 guilty verdicts are the first handed down by The Hague-based court over war crimes in Sudanese region in 2000s.",
      "For the first time, the ICC has found a militia leader guilty of war crimes committed in Sudan's Darfur region more than 20 years ago.",
      "<p>Janjaweed commander Ali Muhammad Ali Abd-al-Rahman, known as Ali Kushayb, found guilty over atrocities</p><p>The international criminal court has convicted a leader of the Janjaweed militia of playing a leading role in a campaign of atrocities committed in the Sudanese region of Darfur more than "
    ],
    "image_url": "",
    "titles": [
      "ICC convicts first militia leader for brutal attacks in Darfur",
      "ICC convicts ex-Janjaweed leader Ali Kushayb of war crimes in Darfur",
      "Darfur militia leader convicted by ICC for war crimes",
      "ICC convicts former Sudan militia leader for war crimes in Darfur"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.979,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.733,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The International Criminal Court (ICC) has convicted Janjaweed militia leader Ali Muhammad Ali Abd-Al-Rahman, known as Ali Kushayb, of war crimes in Sudan's Darfur region, marking the court's first conviction for crimes in this area. Abd-Al-Rahman was found guilty on 27 counts of war crimes committed over 20 years ago.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Casale Updates Top 20 College Football Teams, Reflects Week 7 Changes",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Mon, 06 Oct 2025 15:24:30 +0000",
    "source": "CBS Sports",
    "sources": [
      "Sports Illustrated",
      "Yahoo Sports",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "sports.yahoo.com",
      "news.google.com"
    ],
    "snippets": [
      "SportsLine college football betting expert Thomas Casale breaks down his top 20 teams ahead of Week 7",
      "Both the Nittany Lions and Longhorns lost on Saturday.",
      "<a href=\"https://news.google.com/rss/articles/CBMijAFBVV95cUxOVmc3OVZWTTQ0MXFER0Q3VEtXNDB3cklqNHJKNWc2c1ZndHQ2TGhZUzRTTVZyQ2FaZEF2cU9WWkVqdWZSLXJlWl9PNHRGdW1NUzZlTlJNcmJwUzQxbDBDa3JfMWRWdHFsOXp0bWxlX2R0TTUzQndvOHFIbVlFX19hVXc2d0kyQURGQWlaZA?oc=5\" target=\"_blank\">Forde-Yard Dash: Is There Any Way Bac"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/10/04/2b43f69f-8f99-40eb-8bc5-ab6195c1eafd/carson-beck-miami-hurricanes-imagn-images.jpg",
    "titles": [
      "College football Week 7 power ratings: Miami moves into Tier 1 while Texas, Penn State slide",
      "College Football Playoff predictions: Who takes Penn State and Texas' spots in the field?",
      "Forde-Yard Dash: Is There Any Way Back Into the Playoff Picture for Penn State, Texas? - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.983,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.733,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "SportsLine college football betting expert Thomas Casale provided analysis on his top 20 teams ahead of Week 7. In recent games, both the Nittany Lions and the Longhorns experienced losses. This update reflects the current status and performance of these teams in the college football landscape as of Week 7.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "OpenAI Signs Multibillion-Dollar Deal with AMD for AI Chips and Stake",
    "domain": "business",
    "source_domain": "www.ft.com",
    "location": "global",
    "published": "Mon, 06 Oct 2025 12:36:54 GMT",
    "source": "Financial Times",
    "sources": [
      "The Guardian",
      "Financial Times",
      "Forbes"
    ],
    "domains": [
      "www.theguardian.com",
      "www.forbes.com",
      "www.ft.com"
    ],
    "snippets": [
      "Latest circular transaction aims to make ChatGPT maker central to the effort to build a huge AI infrastructure",
      "<p>The deal offers the ChatGPT maker an opportunity to buy a 10% stake in chipmaker AMD </p><p><a href=\"https://www.theguardian.com/technology/openai\">OpenAI</a> and chipmaker AMD announced Monday that they had signed a multibillion-dollar chip deal that would also give the <a href=\"https://www.theg",
      "OpenAI has agreed to purchase and deploy 6 gigawatt worth of AMD’s AI chips."
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Fcc71ba22-1433-4be3-9c08-1745a1f21542.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "OpenAI targets 10% AMD stake via multibillion-dollar chip deal",
      "OpenAI signs multibillion-dollar chip deal with AMD",
      "AMD Shares Surge 30% After Multibillion-Dollar Deal With OpenAI"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.908,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.725,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "OpenAI, the creator of ChatGPT, has entered into a multibillion-dollar agreement with AMD to buy and deploy 6 gigawatts of AI chips. This deal also allows OpenAI to acquire a 10% stake in AMD, positioning OpenAI at the forefront of building a vast AI infrastructure.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Supreme Court Term Begins, Presidential Power Limits in Focus",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Mon, 06 Oct 2025 13:57:42 GMT",
    "source": "Axios",
    "sources": [
      "The Guardian",
      "New York Times",
      "Axios"
    ],
    "domains": [
      "www.theguardian.com",
      "www.nytimes.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMiiwFBVV95cUxPVEpBWDJPcGpPNEZCVVUtR3RlbDU5NXNGR2NYZDhPcWVPQ3F1TGgxYTVoWU9PYUEtNFVjNExJdzYzZVZoODgxN2p1SWdsRmRmVkxRNVVhVUlMQXNsSTR6Vm1XdTEzVmUxNEpycEhWUUV0eEViOU92aDcyRXBVYU1fekQ0MGQwTnkyREo4?oc=5\" target=\"_blank\">Trump, tariffs and trans rights: The Su",
      "Today, we look ahead at the potential consequences of the Supreme Court term that begins today.",
      "<p>As a new term begins, the justices have continually failed to provide a check on presidential power – with disastrous consequences</p><p>Two 0f the world’s best-known authoritarian leaders – Viktor Orbán, <a href=\"https://www.theguardian.com/world/hungary\">Hungary</a>’s prime minister, and Recep "
    ],
    "image_url": "",
    "titles": [
      "Trump, tariffs and trans rights: The Supreme Court gears up for a new term - Axios",
      "President Trump and the Supreme Court",
      "Why does the supreme court keep bending the knee to Trump? | Steven Greenhouse"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.934,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.724,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Supreme Court's new term starts today, amid concerns over its failure to limit presidential power, which critics argue has had negative consequences. This term's outcomes could have significant implications, especially in the context of global authoritarian trends highlighted by leaders like Hungary's Viktor Orbán and Turkey's Recep Tayyip Erdoğan.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Optimistic on Israel-Hamas Talks Amid Gaza Violence",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-10-06T07:20:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "The Guardian",
      "Deutsche Welle",
      "Washington Post"
    ],
    "domains": [
      "www.theguardian.com",
      "www.dw.com",
      "www.washingtonpost.com"
    ],
    "snippets": [
      "Delegations from Israel and Hamas are holding indirect talks on US President Donald Trump's plan for Gaza. Germany's foreign minister is heading to Egypt for talks on the negotiations. DW has the latest.",
      "<p>Activists deported to Greece and Slovakia; delegations from Israel and Hamas began indirect negotiations</p><p>Iran signalled its support for Trump’s Gaza plan, with the country’s foreign ministry saying it supports any initiative that brings an end to the genocide of Palestinian people.</p><p>Ir",
      "<p>Talks on Monday expected to focus on release of hostages and end to war, after Israel kills 63 people in Gaza in past day</p><p>Donald Trump has urged negotiators to “move fast” in talks focused on the release of hostages held by Hamas in Gaza and a broader end to the war, as representatives arri",
      "Israel and Hamas gathered in Egypt for indirect talks over a U.S.-backed plan to end the Gaza war after months of deadlock."
    ],
    "image_url": "",
    "titles": [
      "Middle East updates: Gaza ceasefire talks start in Egypt",
      "Greta Thunberg among 171 Gaza flotilla activists deported by Israel; ceasefire talks begin in Egypt – Middle East crisis live",
      "Trump urges negotiators to ‘move fast’ as Gaza ceasefire talks set to begin in Egypt",
      "Gaza ceasefire talks begin in Egypt, as Israel strikes enclave"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.83,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.717,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "US President Donald Trump expressed optimism about the speed of negotiations between Israel and Hamas, focusing on the release of hostages and ending the conflict. This comes as talks are set to begin, following a deadly day in Gaza where 63 people were killed by Israeli forces. Trump has urged for quick action in these discussions.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump to Host UFC Fight at White House on 80th Birthday",
    "domain": "sports",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Mon, 06 Oct 2025 08:15:15 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Yahoo Sports",
      "Axios"
    ],
    "domains": [
      "www.aljazeera.com",
      "mmajunkie.usatoday.com",
      "news.google.com"
    ],
    "snippets": [
      "US President Donald Trump announces the &#039;big UFC fight&#039; on the White House grounds will now take place on June 14.",
      "<a href=\"https://news.google.com/rss/articles/CBMiigFBVV95cUxQbC10Z3g4dkctYWdWVHFsLTd3ckszOVhjVlRSVWItZ1FEMEhwb0ppMjZTQk96ZGFGbnpoaDdwaUprbE5XTVdMOHluakJubFdGbmRPak1QNjZ4NEN3ZEdLUExTcFNpZVQ5bzNSTWlsZWVxNTJkQThEWnFmZmw4WlJ5T1BXalBtRlNEaEE?oc=5\" target=\"_blank\">Trump to host UFC fight at White House o",
      "If you thought the UFC White House event was meant to be in celebration of America's 250th anniversary, that might not be entirely true."
    ],
    "image_url": "",
    "titles": [
      "Trump says UFC fight at White House to be staged on his 80th birthday",
      "Trump to host UFC fight at White House on his 80th birthday - Axios",
      "President Trump reveals UFC White House event will happen on his 80th birthday"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.846,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.713,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "President Donald Trump announced that an Ultimate Fighting Championship (UFC) fight will be hosted at the White House on his 80th birthday. This event was previously scheduled for July 4 but has been confirmed for Trump's birthday by both him and UFC president Dana White.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Ford Threatens to Pull Diageo Products Over Ontario Facility Closure",
    "domain": "general",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Mon, 06 Oct 2025 15:30:43 +0000",
    "source": "Global News",
    "sources": [
      "CityNews",
      "Global News"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "globalnews.ca"
    ],
    "snippets": [
      "On Monday, Doug Ford repeated his threat to pull Diageo-made products from store shelves and suggested the manufacturer would be responsible for the outcome.",
      "Premier Doug Ford is escalating his fight with spirits giant Diageo, vowing to pull Crown Royal and other popular brands from LCBO shelves if the company follows through on plans to shutter a bottling facility in southwestern Ontario. Speaking in Quebec on Monday, Ford said the province will remove "
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/1983ab3be85e95fc050b79ff3513d715bb8a858f495af6c17b77f013820555c5.jpg?quality=65&strip=all",
    "titles": [
      "Ford renews threat to pull Crown Royal and Smirnoff from LCBO amid production spat",
      "‘Smirnoff’s next’: Ford doubles down on pulling Crown Royal from LCBO shelves"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.985,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.702,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "On Monday, Premier Doug Ford threatened to remove Diageo products, including Crown Royal, from LCBO shelves if Diageo closes a bottling facility in southwestern Ontario. Ford blames Diageo for any potential fallout from this action.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Titans Rally to Beat Cardinals 22-21 After Trailing 21-3",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 6 Oct 2025 11:30:23 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "QB Kyler Murray didn't know what to think after the Cardinals' 22-21 defeat to the lowly Titans -- a game that Arizona led 21-3 but that was ultimately derailed by two botched plays in the fourth quarter.",
      "Two unbelievable plays opened the door for a three-possession Titans comeback"
    ],
    "image_url": "",
    "titles": [
      "Murray: Cards shocker 'How to Lose a Game 101'",
      "Kyler Murray laments Cardinals' mistakes in stunning loss to Titans: 'How to Lose a Game 101'"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.985,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.684,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Arizona Cardinals, led by QB Kyler Murray, lost to the Titans 22-21 after leading 21-3. The defeat was marked by two critical errors in the fourth quarter, enabling a comeback by the Titans.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Israel-Premier Tech Cycling Team Rebrands Amid Protests",
    "domain": "sports",
    "source_domain": "www.independent.co.uk",
    "location": "national",
    "published": "Mon, 06 Oct 2025 15:43:32 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Sportsnet",
      "Yahoo Sports"
    ],
    "domains": [
      "www.independent.co.uk",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "The team was targeted by repeated mass demonstrations at last month’s Vuelta a Espana and multiple races rescinded their invitations to participate over security fears",
      "<p>In the wake of recent protests, the beleaguered Israel-Premier Tech cycling team is rebranding and &#8220;moving away from its current Israeli identity.&#8221;</p>"
    ],
    "image_url": "",
    "titles": [
      "Israel-Premier Tech to rebrand ‘away from Israeli identity’ after pressure",
      "Israel-Premier Tech cycling team to rebrand in wake of recent protests"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.989,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.66,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Following mass protests at the Vuelta a Espana and other events, the Israel-Premier Tech cycling team is rebranding to distance itself from its Israeli identity. This decision comes after several races withdrew their invitations to the team due to security concerns.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Pro-Israel, Anti-'Woke' Commentator to Lead US News Network",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Mon, 06 Oct 2025 15:34:00 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Appointment of media figure known for pro-Israel, anti-&#039;woke&#039; stances comes as US media firms feel Trump pressure.",
      "<p>Commentator to lead storied US news network, five years after acrimonious exit from New York Times</p><p>The<strong> </strong><a href=\"https://www.theguardian.com/media/cbs\">CBS</a> News owner Paramount will acquire the Free Press, a media startup founded by <a href=\"https://www.theguardian.com/m"
    ],
    "image_url": "",
    "titles": [
      "Conservative writer Bari Weiss named editor-in-chief of CBS News",
      "Bari Weiss named editor-in-chief of CBS News as Paramount buys Free Press startup"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.986,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.659,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A commentator known for pro-Israel and anti-'woke' views has been appointed to lead a prominent US news network, marking their return five years after leaving the New York Times under tense circumstances. This move comes as US media companies, including CBS News' owner Paramount, which is acquiring the Free Press, a media startup, face pressure in the current political climate influenced by Trump.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Mark Sanchez Charged With Felony Battery After Altercation in Indianapolis",
    "domain": "sports",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Mon, 06 Oct 2025 11:48:10 -0400",
    "source": "ABC News",
    "sources": [
      "ABC News",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "abcnews.go.com"
    ],
    "snippets": [
      "Former NFL quarterback and current Fox Sports commentator Mark Sanchez has now been charged with a felony.",
      "Mark Sanchez is facing a felony battery charge over the altercation between the former NFL quarterback and a 69-year-old truck driver early Saturday in Indianapolis."
    ],
    "image_url": "https://s.abcnews.com/images/US/Mark-Sanchez-1-ap-gmh-251006_1759753145526_hpMain_4x3t_384.jpg",
    "titles": [
      "Mark Sanchez now facing felony charge of battery involving serious bodily injury",
      "Sanchez now facing felony charge for altercation"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.991,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.653,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Former NFL quarterback and Fox Sports commentator Mark Sanchez has been charged with felony battery following an altercation with a 69-year-old truck driver in Indianapolis early Saturday.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Daria Kasatkina Ends Season Early for Mental Health, Plans 2026 Return",
    "domain": "sports",
    "source_domain": "www.upi.com",
    "location": "national",
    "published": "Mon, 06 Oct 2025 15:40:22 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "The Guardian",
      "Yahoo Sports"
    ],
    "domains": [
      "www.theguardian.com",
      "www.upi.com"
    ],
    "snippets": [
      "Russian-born tennis star Daria Kasatkina will end her season early after reaching a mental and emotional &quot;breaking point,&quot; she announced Monday on social media.",
      "<ul><li><p>Russian-born star has ‘hit a wall and can’t continue’</p></li><li><p>She promises to be back in 2026 and ‘ready to rock’</p></li></ul><p>Australia’s women’s tennis No 1 has put her career on hold for the rest of the year stating “mentally and emotionally I am at breaking point”.</p><p>Dar"
    ],
    "image_url": "",
    "titles": [
      "Daria Kasatkina ends tennis season, cites mental 'breaking point'",
      "Daria Kasatkina, Australia’s No 1 women’s tennis player, takes career break citing ‘mental stress’"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.988,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.653,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Russian-born tennis star Daria Kasatkina will end her season early due to reaching a mental and emotional breaking point, she announced on social media. She has decided to put her career on hold for the rest of the year but promises to return in 2026, ready to compete again.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Verizon Names Ex-PayPal CEO Dan Schulman as New CEO, Replacing Vestberg",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Mon, 06 Oct 2025 15:56:43 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "MarketWatch"
    ],
    "domains": [
      "www.marketwatch.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "Verizon on Monday named former PayPal CEO Dan Schulman as the company's new CEO, effective immediately and replacing Hans Vestberg.",
      "Verizon once was widely viewed as having the best wireless network, but that’s now up in the air. New CEO Dan Schulman sees “a clear opportunity to redefine our trajectory.”"
    ],
    "image_url": "",
    "titles": [
      "Verizon names former PayPal boss Dan Schulman as new CEO, replacing Hans Vestberg",
      "Verizon names a PayPal veteran as its next CEO. Can that help its lagging stock?"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.973,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.65,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Verizon appointed former PayPal CEO Dan Schulman as its new CEO, effective immediately, replacing Hans Vestberg. Schulman aims to redefine Verizon's trajectory amid questions about its network's current standing as the best in wireless.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Paul Tudor Jones Compares Current Market to Pre-Dot-Com Bubble Era",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Mon, 06 Oct 2025 15:43:39 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "MarketWatch"
    ],
    "domains": [
      "www.marketwatch.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "Paul Tudor Jones said today's market is reminiscent of the setup leading up to the burst of the dot-com bubble in late 1999.",
      "That’s Paul Tudor Jones, the billionaire investor and founder of Tudor Investment, who said the setup in markets these days reminds him of late 1999, just as the dot-com bubble was nearing its most extreme level."
    ],
    "image_url": "",
    "titles": [
      "Paul Tudor Jones says ingredients are in place for massive rally before a 'blow off' top to bull market",
      "Hedge-fund billionaire Paul Tudor Jones says stage is set for massive rally before bull market reaches ‘blow off’ top"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.969,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.649,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Billionaire investor Paul Tudor Jones, founder of Tudor Investment, compared today's market conditions to those of late 1999, just before the dot-com bubble burst. He highlighted similarities in the market setup between the two periods.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "France PM Lecornu Resigns Amid Political Crisis, Cites Partisan Issues",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 06 Oct 2025 14:44:32 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "CNBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "Lecornu criticised the \"partisan appetites\" of political factions, who he said had refused to compromise.",
      "France's new Prime Minister Sebastien Lecornu has resigned just weeks after his appointment to the role, plunging the country into a fresh political crisis."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/023b/live/68dfa340-a2c1-11f0-b741-177e3e2c2fc7.jpg",
    "titles": [
      "France in fresh political crisis as PM Lecornu quits after 26 days",
      "French PM resigns after 27 days sparking fresh political chaos"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.949,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.645,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "France's Prime Minister Sebastien Lecornu resigned weeks after his appointment, citing criticism of \"partisan appetites\" among political factions for the lack of compromise. His departure has led to a new political crisis in the country.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Netanyahu Optimistic on Hostage Release by Oct. 13 Amid Gaza Ceasefire Talks",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 06 Oct 2025 11:48:47 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "New York Times"
    ],
    "domains": [
      "www.bbc.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "Negotiators from Israel and Hamas are heading to Sharm El-Sheikh, Egypt, to start indirect talks about ending the Israel-Gaza war.",
      "Hamas said it would release all Israeli hostages but wants to negotiate elements of President Trump’s peace plan for Gaza. Adam Rasgon, a reporter for The New York Times in Jerusalem, explains where negotiations stand.",
      "Israel and Hamas said they will work with President Trump’s proposal to end the Gaza war. But persistent sticking points could derail a diplomatic breakthrough."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/a650/live/54b668f0-a2bb-11f0-b2c5-019105d9c0cd.jpg",
    "titles": [
      "What are the key sticking points in Trump's Gaza peace plan?",
      "Hamas Partially Accepts Trump’s Peace Plan",
      "Trump’s Gaza Peace Plan: What to Know"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.893,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.644,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Israeli Prime Minister Netanyahu expressed hope for the release of all hostages by Hamas by Oct. 13, following partial agreement to President Trump's 20-point Gaza ceasefire plan. While Hamas has agreed to release hostages and discuss governing Gaza with Palestinian technocrats, negotiations on several aspects of the plan remain. Both Israel and Hamas have shown willingness to work towards ending the conflict, but unresolved issues could impede a diplomatic breakthrough. The US President has cautioned Hamas about the limited time available to finalize the deal.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Fifth Third Bancorp Acquires Comerica in $10.9B All-Stock Deal",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Mon, 06 Oct 2025 13:40:54 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "MarketWatch"
    ],
    "domains": [
      "www.marketwatch.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "Fifth Third Bancorp said Monday it will acquire fellow regional bank Comerica in an all-stock deal worth $10.9 billion.",
      "Fifth Third said the combined company will operate in some of the fastest-growing areas of the country, such as Texas."
    ],
    "image_url": "",
    "titles": [
      "Fifth Third Bancorp to buy Comerica for $10.9 billion in all-stock deal",
      "Fifth Third paying $10.9 billion for Comerica as wave of bank mergers builds"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.928,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.641,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Fifth Third Bancorp announced it will buy Comerica in an all-stock transaction valued at $10.9 billion. The merger aims to expand their presence in rapidly growing regions, including Texas.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Social Security Chief Named IRS CEO in Major Leadership Shift",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Mon, 06 Oct 2025 13:13:54 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "MarketWatch"
    ],
    "domains": [
      "www.marketwatch.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMibEFVX3lxTE1xMHpJeXhtOHM1YXpzNjVRSk9ibVZTT25WMTc5MkJxNjJEXzZVSTFLSjNFRXVlY3JZbS1Eb3RrWkh5c183cTVkNC1LWkNkdzhTTG5oQXlnZTN2S0NZZU1sLWRRMkUyamlQS2JrUA?oc=5\" target=\"_blank\">Social Security chief to be IRS CEO</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Axios</f",
      "The appointment would not require Senate confirmation."
    ],
    "image_url": "",
    "titles": [
      "Social Security chief to be IRS CEO - Axios",
      "Social Security’s Bisignano named to additional role as CEO of IRS"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.92,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.639,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Social Security chief has been appointed as the IRS CEO, a position that does not require Senate confirmation. This move marks a significant leadership change within two major U.S. government agencies.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Former England Rugby Captain Lewis Moody Diagnosed with MND at 47",
    "domain": "sports",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Mon, 06 Oct 2025 07:10:05 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "Sky Sports"
    ],
    "domains": [
      "www.theguardian.com",
      "www.skysports.com"
    ],
    "snippets": [
      "<p>Former World Cup winner, 47, tells BBC he has been diagnosed with motor neurone disease</p><p>Lewis Moody, the former England rugby captain and 2003 World Cup winner, has been diagnosed with motor neurone disease.</p><p>The 47-year-old told the BBC he was having trouble accepting what the news me",
      "Former England captain Lewis Moody has revealed he has been diagnosed with motor neurone disease."
    ],
    "image_url": "https://i.guim.co.uk/img/media/eb675fc9b4071bf391b36c26ac8ee946e4119851/166_0_2902_2324/master/2902.jpg?width=140&quality=85&auto=format&fit=max&s=9d025d31227783c9eacdbcde18e3c657",
    "titles": [
      "Former England rugby captain Lewis Moody reveals MND diagnosis",
      "Former England captain Moody diagnosed with motor neurone disease"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.81,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.624,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Lewis Moody, the former England rugby captain and 2003 World Cup winner, has announced in an interview with BBC Breakfast that he has been diagnosed with motor neurone disease (MND) at the age of 47.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "OpenAI and Jony Ive to Launch Palm-Sized AI Assistant Next Year",
    "domain": "technology",
    "source_domain": "techcrunch.com",
    "location": "global",
    "published": "Sun, 05 Oct 2025 16:34:26 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch",
      "Ars Technica"
    ],
    "domains": [
      "arstechnica.com",
      "techcrunch.com"
    ],
    "snippets": [
      "OpenAI and Jony Ive reportedly face significant technical challenges as they work to develop a screen-less, AI-powered device.",
      "ChatGPT maker working with former Apple design boss to launch personal assistant."
    ],
    "image_url": "",
    "titles": [
      "OpenAI and Jony Ive may be struggling to figure out their AI device",
      "OpenAI, Jony Ive struggle with technical details on secretive new AI gadget"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.611,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.584,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "OpenAI, the creator of ChatGPT, is collaborating with Jony Ive, former Apple design chief, to release a small, palm-sized personal assistant in the upcoming year. Despite facing substantial technical hurdles, they aim to develop this AI-powered, screen-less device.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]