[
  {
    "title": "Anthropic Settles for $1.5B in AI Piracy Lawsuit with Authors",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Fri, 05 Sep 2025 16:33:18 -0400",
    "source": "NPR",
    "sources": [
      "Ars Technica",
      "The Verge",
      "Business Insider",
      "CNBC",
      "NPR",
      "The Guardian",
      "Forbes"
    ],
    "domains": [
      "www.theverge.com",
      "www.cnbc.com",
      "www.theguardian.com",
      "www.npr.org",
      "arstechnica.com",
      "www.businessinsider.com",
      "www.forbes.com"
    ],
    "snippets": [
      "The artificial intelligence company Anthropic has agreed to pay authors $3,000 per book in a landmark settlement over pirated chatbot training material.",
      "Authors had sued Anthropic, claiming the artificial intelligence startup had illegally used their books to train its models.",
      "<p>Settlement could be pivotal after authors claimed company took pirated copies of their work to train chatbots</p><p><a href=\"https://www.theguardian.com/technology/artificialintelligenceai\">The artificial intelligence</a> company Anthropic has agreed to pay $1.5bn to settle a class-action lawsuit",
      "The AI firm will pay $3,000 for each of about 500,000 books under the settlement agreement.",
      "Anthropic agreed to pay over $1.5 billion to settle a lawsuit brought by authors who say the company used their pirated books to train its AI.",
      "In what’s potentially the first major payout to creatives whose work was used to train AI systems, Anthropic has reached an agreement to pay “at least” a staggering $1.5 billion, plus interest, to authors to settle its class-action lawsuit. The amount breaks down to smaller payouts expected to be ap",
      "Settlement shows AI companies can face consequences for pirated training data."
    ],
    "image_url": "",
    "titles": [
      "Anthropic to pay authors $1.5B to settle lawsuit over pirated chatbot training material",
      "Anthropic agrees to pay $1.5 billion to settle authors' copyright lawsuit",
      "AI startup Anthropic agrees to pay $1.5bn to settle book piracy lawsuit",
      "Anthropic Will Pay $1.5 Billion To Settle Copyright Lawsuit From Book Authors",
      "Anthropic agrees to pay authors over $1.5 billion for using their work to train AI, totaling around $3,000 a book",
      "Anthropic to pay $1.5 billion to authors in landmark AI settlement",
      "“First of its kind” AI settlement: Anthropic to pay authors $1.5 billion"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.927,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.86,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Anthropic, an artificial intelligence company, has agreed to a $1.5 billion settlement in a class-action lawsuit with authors. The lawsuit accused Anthropic of using pirated copies of about 500,000 books to train its AI models. Under the agreement, the company will pay each author $3,000 per book. This settlement marks a significant moment, showing that AI firms can be held accountable for using pirated training data.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Alcaraz Beats Djokovic to Reach US Open Final, Eyes Second Grand Slam Win",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 05 Sep 2025 23:07:09 GMT",
    "source": "BBC",
    "sources": [
      "Sky Sports",
      "Sportsnet",
      "BBC",
      "CBS Sports",
      "Yahoo Sports",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.bbc.com",
      "www.cbssports.com",
      "www.sportsnet.ca",
      "www.skysports.com"
    ],
    "snippets": [
      "World number two Carlos Alcaraz makes his youth count as he powers past 38-year-old Novak Djokovic to reach another US Open final.",
      "Carlos Alcaraz has defeated Novak Djokovic 6-4, 7-6 (4), 6-2 at the US Open to reach his third consecutive Grand Slam final.",
      "Alcaraz will compete for the final Grand Slam title of the year for the first time since winning it back in 2022",
      "World number two Carlos Alcaraz makes his youth count as he powers past 38-year-old Novak Djokovic to reach another US Open final.",
      "Carlos Alcaraz soaked up everything Novak Djokovic could throw at him before marching into his second US Open final and denying the 38-year-old a shot at a record-breaking 25th Grand Slam title.",
      "<p>Carlos Alcaraz used his youth, athleticism and creativity to assert himself against the much more accomplished, but also much older, Novak Djokovic and beat the 24-time major champion 6-4, 7-6 (4), 6-2 at the US Open on Friday for a berth in his third consecutive Grand Slam final.</p>"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/66d2/live/d2e0daf0-8a9f-11f0-aec2-e98cb6019532.jpg",
    "titles": [
      "Alcaraz powers past Djokovic to reach US Open final",
      "Alcaraz dominates Djokovic to make US Open final",
      "US Open 2025 results: Carlos Alcaraz sweeps Novak Djokovic to return to final for first time in four years",
      "Alcaraz powers past Djokovic to reach US Open final",
      "Clinical Alcaraz denies ailing Djokovic to reach second US Open final",
      "Carlos Alcaraz beats Novak Djokovic in US Open semifinal"
    ],
    "score_components": {
      "magnitude": 0.986,
      "recency": 0.958,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.837,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Carlos Alcaraz defeated Novak Djokovic 6-4, 7-6 (4), 6-2 at the US Open, securing his spot in the final. This victory marks Alcaraz's third consecutive Grand Slam final appearance and denies Djokovic a chance at a 25th Grand Slam title. Alcaraz will compete for the final Grand Slam title of the year, aiming to replicate his 2022 success.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump to Sign Order Renaming Defense Department to Department of War",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Fri, 05 Sep 2025 21:14:35 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Axios",
      "Deutsche Welle",
      "ABC News",
      "The Guardian"
    ],
    "domains": [
      "news.google.com",
      "abcnews.go.com",
      "www.theguardian.com",
      "www.dw.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Pentagon chief Pete Hegseth says the name change signals a more offensive approach for the US military under Trump.",
      "US President Donald Trump signed an executive order to change the name of the Department of Defense to the \"Department of War.\" This move revives a name that was abandoned over seven decades ago.",
      "<a href=\"https://news.google.com/rss/articles/CBMid0FVX3lxTE5ENDJYTUxaT3Y3VXNfdWxGXzM0VlF0dnlubDdzbGtXTi1VWlVSdmtKYl9TV3o3WGpXc0JUOXozV2c4VWFZbDhYY3pUeHYyYW01Z3RzeUVMNk04MkJ3Ni1obkhGOWtCS3ZCekpZVEdwd0U3XzZTQVIw?oc=5\" target=\"_blank\">Trump seeks to rename Department of Defense to Department of War</a",
      "President Trump signed an executive order renaming the Department of Defense the Department of War, though a formal name change would require Congress to act.",
      "<p>Directive will make Department of War secondary title and is way to get around need for congressional approval</p><p><a href=\"https://www.theguardian.com/us-news/donaldtrump\">Donald Trump</a> signed an executive order on Friday to rebrand the Department of Defense as the Department of War, a call"
    ],
    "image_url": "",
    "titles": [
      "Trump changes the Department of Defense’s name to ‘Department of War’",
      "US: Trump signs order renaming Pentagon 'Department of War'",
      "Trump seeks to rename Department of Defense to Department of War - Axios",
      "Trump signs order renaming Pentagon 'Department of War'",
      "Trump signs executive order rebranding Pentagon as Department of War"
    ],
    "score_components": {
      "magnitude": 0.964,
      "recency": 0.941,
      "consensus": 0.995,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.834,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "President Trump plans to sign an executive order renaming the Department of Defense to the Department of War, emphasizing a focus on \"warfighting\" and a \"warrior ethos.\" The change, which can be used in official correspondence and ceremonial contexts, requires Congressional approval for full implementation.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Sabalenka to Face Anisimova in US Open Final",
    "domain": "sports",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Fri, 05 Sep 2025 17:04:50 +0000",
    "source": "Al Jazeera",
    "sources": [
      "ESPN",
      "Al Jazeera",
      "Forbes",
      "Sky Sports"
    ],
    "domains": [
      "www.skysports.com",
      "www.espn.com",
      "www.forbes.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Will Sabalenka overcome her two Grand Slam final losses in 2025 to beat Anisimova, a woman carving a comeback trail?",
      "No. 1 Sabalenka will take on No. 8 Anisimova in the US Open final Saturday. Who will prevail? It's not as straightforward as it seems on paper.",
      "Aryna Sabalenka and Amanda Anisimova meet in the U.S. Open final on Saturday. Both have suffered traumatic slam experiences this season which could make it very nervy.",
      "The stage for the US Open women's final is set as defending champion Aryna Sabalenka takes on home favourite Amanda Anisimova from 9pm on Saturday, live on <em>Sky Sports.</em>"
    ],
    "image_url": "",
    "titles": [
      "Sabalenka vs Anisimova – US Open women’s final: Match start time, stats",
      "Sabalenka vs. Anisimova: Who will win the US Open title?",
      "Sabalenka And Anisimova Are Full Of Hopes And Fears In U.S. Open Final",
      "Anisimova bids for first Grand Slam as Sabalenka looks to continue US Open reign"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.863,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.762,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Aryna Sabalenka, the defending champion and world No. 1, is set to compete against No. 8 seed Amanda Anisimova in the US Open women's final on Saturday. Both players have faced challenges in Grand Slam tournaments this season, adding a layer of anticipation to the match. The event will be broadcast live on Sky Sports starting at 9pm.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Chicago Sky's Angel Reese Suspended for Detrimental Comments",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Fri, 5 Sep 2025 19:39:16 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sports Illustrated",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "news.google.com",
      "www.espn.com"
    ],
    "snippets": [
      "Angel Reese was suspended by the Chicago Sky for the first half of Sunday's matchup against the Las Vegas Aces for comments she made that were \"detrimental to the team.\"",
      "Reese will now serve two suspensions over the Sky's next two games",
      "<a href=\"https://news.google.com/rss/articles/CBMikwFBVV95cUxNNFA4LXlNa1loM2hzMnMxUlA2V1lEdHlNSXlGZGhXVExCZWxYUkZpdWZjTVBtMDhrLWRGaVZPSy1WOUk5UkFTSVZSbk5ITE9iaHo0amFrREotZURzR0VzX3ZCYTZxSlh4b1oyZXhYVmJfX3Z1S2htWWQ4b0tCNk1BSEtJR0pFNW1rVUlOQ3ZsM0tpdEk?oc=5\" target=\"_blank\">Chicago Sky Hit Angel Reese "
    ],
    "image_url": "",
    "titles": [
      "Sky suspend Reese for 'detrimental' comments",
      "Chicago Sky suspend Angel Reese for one half after 'detrimental' comments made about teammates",
      "Chicago Sky Hit Angel Reese With Bizarre Suspension After Comments Critical of Team - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.989,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.76,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Angel Reese, a player for the Chicago Sky, has been suspended for the first half of a game against the Las Vegas Aces and will face additional suspensions in the next two games. The suspension is due to comments she made that were considered detrimental to the team.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Thunder Rookie Sorber Out for Season with ACL Tear",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Fri, 5 Sep 2025 19:39:16 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Yahoo Sports",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "sports.yahoo.com",
      "www.espn.com"
    ],
    "snippets": [
      "Thunder rookie big man Thomas Sorber tore the ACL in his right knee and will miss the 2025-26 season, the team announced.",
      "Sorber is the latest in a string of bad luck for Thunder draft picks in their rookie years",
      "Thomas Sorber will miss the entirety of what was to be his rookie season with the NBA champion Oklahoma City Thunder, the team said Friday.  This is the second consecutive year that the Thunder have seen a first-round pick be sidelined for the entire season because of an ACL injury; it also happened"
    ],
    "image_url": "",
    "titles": [
      "OKC rookie Sorber out for season with torn ACL",
      "Thunder 2025 first-round pick Thomas Sorber suffers torn ACL, expected to miss entire 2025-2026 season",
      "Thunder lose rookie big man Thomas Sorber for season after ACL tear in right knee"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.989,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.76,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Thomas Sorber, a rookie for the Oklahoma City Thunder, has torn the ACL in his right knee and will miss the entire 2025-26 NBA season, the team confirmed. This marks the second year in a row that a Thunder first-round draft pick has been sidelined for an entire season due to an ACL injury.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "HHS Report to Explore Possible Tylenol-Autism Link, Kenvue Denies Claims",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Fri, 05 Sep 2025 20:03:45 GMT",
    "source": "Axios",
    "sources": [
      "CNBC",
      "Axios",
      "Forbes"
    ],
    "domains": [
      "news.google.com",
      "www.cnbc.com",
      "www.forbes.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMif0FVX3lxTFBJOTNyNW83bjNKYkZZU1Q1eXU2cmhBalV3bTZCeFlHakM4bWh3SWVWNUlPeUVSclJUSnVNZVZhUUN2T0QxWk9LVFJTem02eDRpOUZ6UEVodUJmaGMzYkV3NUpuWkJtSnY3Um44Yk1VbURqX2ZjMV9TcFFUTXVBaDQ?oc=5\" target=\"_blank\">RFK Jr. to draw link between Tylenol and autism: Report<",
      "HHS will release the report that could draw that link between the pain medication and autism this month, according to the Wall Street Journal.",
      "Tylenol maker Kenvue denies the connection allegedly made in the report, which is expected to be published by the Department of Health and Human Services this month."
    ],
    "image_url": "",
    "titles": [
      "RFK Jr. to draw link between Tylenol and autism: Report - Axios",
      "Kenvue stock drops 10% on report RFK Jr. will link autism to Tylenol use during pregnancy",
      "RFK Jr. Report Will Link Autism To Tylenol Use During Pregnancy, Report Says"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.899,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.724,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Department of Health and Human Services (HHS) is set to release a report this month that may suggest a link between Tylenol and autism, as reported by the Wall Street Journal. Kenvue, the manufacturer of Tylenol, denies any connection as alleged in the upcoming report.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Russia Threatens Western Troops in Ukraine as \"Legitimate Targets\"",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 05 Sep 2025 18:02:40 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC",
      "New York Times"
    ],
    "domains": [
      "www.bbc.com",
      "www.nytimes.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "The Russian leader's refusal comes after 26 countries pledged to deploy troops to Ukraine in the event of a ceasefire.",
      "<p>This blog is now closed. You can read all our coverage of the conflict in Ukraine <a href=\"https://www.theguardian.com/world/ukraine\">here</a>.</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/sep/04/european-leaders-pressure-trump-to-reveal-how-much-support-us-will-give-ukraine\">Mac",
      "<p>Russian president’s threat follows French proposal for postwar support for Kyiv that would include presence of Nato countries’ forces</p><p>Vladimir Putin has said any western troops placed in Ukraine would be “legitimate targets” for Russian strikes, upping the stakes as Kyiv’s allies scramble t",
      "The Russian leader made the threat a day after European leaders said they were willing to deploy forces on the ground to secure an agreement to end the war."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/f69c/live/b4477700-8a29-11f0-b917-03bcebef22ec.jpg",
    "titles": [
      "Putin rejects Western security in Ukraine, warning troops would be target",
      "Putin says western troops in Ukraine would be ‘legitimate targets’ as European countries pledge security support – as it happened",
      "Western troops in Ukraine would be ‘legitimate targets’, Putin says",
      "Western Troops in Ukraine Before a Peace Deal Would Be ‘Targets’, Putin Says"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.862,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.723,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Russian president has declared that any Western troops deployed in Ukraine, following a proposal involving 26 nations offering security guarantees to Kyiv, would be considered \"legitimate targets\" by Russia. This statement escalates tensions as it comes after European leaders expressed willingness to send forces to Ukraine to help secure a ceasefire. Concurrently, Ukraine has conducted an attack on a Russian oil refinery.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Judge Dismisses Newsmax Antitrust Lawsuit Against Fox News",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Fri, 05 Sep 2025 18:00:34 GMT",
    "source": "Axios",
    "sources": [
      "CNBC",
      "Axios",
      "Business Insider"
    ],
    "domains": [
      "news.google.com",
      "www.cnbc.com",
      "www.businessinsider.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMieEFVX3lxTE1Na0hrUmtnQmFmQWpvUzhPTUhXVDNjcThxOU5MMkkyWFRJanNweU0wTTdNOVQzaXZRTGN1TGxLSkMwZzE0dGUwbTQ2TFVFVDV6ZnJYbHpUMTkxUGplVjFhWEVqcHZpY1pqZ3JUVU9lVmU0QzAzU09DXw?oc=5\" target=\"_blank\">Judge dismisses Newsmax's antitrust lawsuit against Fox</a>&nbsp;",
      "Judge Aileen Cannon is best known for presiding over a criminal case against President Trump for retaining classified government records after his first term.",
      "US District Judge Aileen Cannon dismissed the lawsuit just two days after Newsmax filed it against Fox News and its parent company."
    ],
    "image_url": "",
    "titles": [
      "Judge dismisses Newsmax's antitrust lawsuit against Fox - Axios",
      "Judge dismisses Newsmax's antitrust suit against Fox News, but will allow amended complaint",
      "Federal judge dismisses Newsmax's 'shotgun' antitrust lawsuit against Fox News"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.861,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.723,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "US District Judge Aileen Cannon dismissed Newsmax's antitrust lawsuit against Fox News and its parent company, just two days after it was filed. Judge Cannon is known for overseeing a criminal case against President Trump related to classified records.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Tesla Unveils $1T Potential Compensation Plan for Musk, Targets $8.5T Valuation",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Fri, 05 Sep 2025 16:55:47 +0000",
    "source": "Al Jazeera",
    "sources": [
      "TechCrunch",
      "The Guardian",
      "Al Jazeera"
    ],
    "domains": [
      "techcrunch.com",
      "www.theguardian.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "The compensation would be delivered in shares and tied to performance milestones set by the Tesla board over 10 years.",
      "<p>CEO will have to increase the value of his electric car company from just over $1tn to $8.5tn over 10 years</p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/sep/05/ons-crisis-retail-sales-error-uk-house-prices-record-high-us-jobs-report-business-live-news-updates\">Business li",
      "Tesla has proposed a new 10-year compensation plan for CEO Elon Musk that could be worth as much as $1 trillion even as the EV maker's car business stumbles and it sets its sights on humanoid robotics and AI."
    ],
    "image_url": "",
    "titles": [
      "Tesla proposes trillion-dollar compensation package for CEO Elon Musk",
      "Tesla offers Elon Musk a trillion-dollar pay package",
      "Tesla proposes new pay package for Elon Musk worth up to $1T"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.86,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.719,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Tesla has introduced a new 10-year compensation plan for CEO Elon Musk, potentially worth up to $1 trillion. This plan requires Musk to increase Tesla's value from just over $1tn to $8.5tn. The proposal is notable for its ambitious growth target and the significant potential payout, amidst Tesla's focus on expanding into humanoid robotics and AI, despite challenges in its electric vehicle business.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "EU Fines Google €2.95B for Ad Tech Abuse",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 05 Sep 2025 19:42:04 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC",
      "The Verge"
    ],
    "domains": [
      "www.theverge.com",
      "www.bbc.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "The Commission said competitors faced higher costs and reduced revenues as a result.",
      "<p>Regulators ordered the tech giant to end ‘self-preferencing practices’ in advertising services but declined to force sale</p><p><a href=\"https://www.theguardian.com/world/eu\">European Union</a> regulators on Friday hit <a href=\"https://www.theguardian.com/technology/google\">Google</a> with a €2.9",
      "The European Commission has waged a €2.95 billion (~$3.5 billion) fine against Google for “abusing its dominant position” in advertising technology. In its announcement, the Commission claims that Google’s alleged anticompetitive practices have increased costs for advertisers and publishers, potenti"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/882a/live/9a70c0a0-8a76-11f0-8ba8-9d1af6a803b3.jpg",
    "titles": [
      "Google fined €2.95bn by EU for abusing advertising dominance",
      "EU fines Google nearly €3bn for ‘abusing’ dominant position in ad tech",
      "Google fined $3.5 billion by EU for ad tech abuse"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.892,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.715,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The European Commission fined Google €2.95 billion (~$3.5 billion) for abusing its dominant position in advertising technology, leading to higher costs and reduced revenues for competitors. Regulators have ordered Google to stop its self-preferencing practices in advertising services but did not require the company to sell any assets.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Angela Rayner Resigns After Ethics Breach, Shaking Starmer's Leadership",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 05 Sep 2025 16:46:05 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC",
      "New York Times"
    ],
    "domains": [
      "www.bbc.com",
      "www.nytimes.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Her departure comes after the PM's ethics adviser concludes that she breached ministerial rules.",
      "In a blow to Prime Minister Keir Starmer, Ms. Rayner said she would step down after an ethics adviser found she had breached a code of conduct for government ministers.",
      "<p>Guardian columnist Gaby Hinsliff talks through the tax row that brought down the now former deputy prime minister</p><p>Angela Rayner’s political stock had never been higher.</p><p>After a difficult summer for the government, Rayner was more popular than ever with Labour’s backbench MPs. She was "
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/82ab/live/8a7bc150-8a48-11f0-94f4-77b666520245.jpg",
    "titles": [
      "Angela Rayner resigns after underpaying tax on Hove flat",
      "Angela Rayner, UK Deputy Prime Minister, Resigns After Underpaying Tax",
      "Angela Rayner resigns – Today in Focus Extra"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.839,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.715,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Angela Rayner resigned following a breach of ministerial rules, as determined by the Prime Minister's ethics adviser. This decision comes amid Keir Starmer's refusal to discuss her potential dismissal and has led to turmoil within his administration. Rayner's resignation is seen as a significant setback for Starmer, who had previously supported her.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Israeli Forces Seize 40% of Gaza City, Escalate Crisis with Tower Demolition",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 05 Sep 2025 14:25:09 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Axios",
      "New York Times"
    ],
    "domains": [
      "www.bbc.com",
      "www.nytimes.com",
      "news.google.com"
    ],
    "snippets": [
      "The images come as the Israeli military says it has established control over 40% of Gaza City.",
      "<a href=\"https://news.google.com/rss/articles/CBMifkFVX3lxTE15bUQwZHI3YmlpNTZ3UXpXQ3JIR2dBUVpEbWlIVkx2Q2lvZHdKYzV1S1NFSk9BUVhkU0dMM0FzTVVaSVlfQ0l6Q3NIRDUybTZIa2x1UHBTVlRXRS12VnhfcXZjMU5lRlN3NGZUaWxZRW4wQXBXa3YxTE0wZzRHQQ?oc=5\" target=\"_blank\">Israel bombs high-rise buildings in Gaza City ahead of ma",
      "The Israeli military destroyed a landmark building after saying it had taken control of almost half of the city, where hundreds of thousands of civilians are sheltering amid a worsening humanitarian crisis."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/43b8/live/9ff5e5d0-8a73-11f0-84c8-99de564f0440.png",
    "titles": [
      "Israel destroys dozens of buildings in Gaza City as new offensive intensifies",
      "Israel bombs high-rise buildings in Gaza City ahead of massive offensive - Axios",
      "Israel Steps Up Attacks on Gaza City Ahead of a Planned Wider Offensive"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.799,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.704,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Israeli military has taken control of approximately 40% of Gaza City, escalating tensions and causing widespread panic among civilians. The Israeli Defence Minister described the situation as \"the gates of hell are opening\" in Gaza. In a significant move, Israeli forces demolished the 12-storey Mushtaha tower in Gaza City. This action is part of a broader offensive that has seen the destruction of key infrastructure, leading to a severe humanitarian crisis for the city's residents.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "16 Killed in Lisbon Funicular Derailment; Mechanical Fault Suspected",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 05 Sep 2025 11:03:40 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC",
      "CityNews"
    ],
    "domains": [
      "www.bbc.com",
      "ottawa.citynews.ca",
      "www.theguardian.com"
    ],
    "snippets": [
      "Authorities have confirmed three Brits are among 16 people who were killed in Wednesday's accident.",
      "<p>Portuguese investigators find no evidence of sabotage, with mechanical or maintenance issues among possible causes</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/sep/04/someone-needs-to-answer-for-what-happened-lisbon-reacts-to-streetcar-crash-that-killed-16\">‘Someone needs to answ",
      "Two Quebec archeologists were among 16 people killed in Wednesday&#8217;s funicular crash in Lisbon, the Quebec government has confirmed. André Bergeron and Blandine Daux were a couple and had worked as part of a specialized team of archeologists in Quebec&#8217;s Culture Department, restoring histo"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/5855/live/ae84b1f0-8a3f-11f0-a107-b1e54fc8eabd.jpg",
    "titles": [
      "Three British nationals among 16 killed in Lisbon crash",
      "Three Britons among 16 people killed in Lisbon funicular crash, police confirm",
      "Two Quebecers identified among 16 dead in Lisbon funicular crash"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.745,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.703,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Sixteen people, including three Brits, two Canadians, five Portuguese, two South Koreans, one American, one French, one Swiss, and one Ukrainian, were killed in a funicular derailment in Lisbon. Portuguese investigators have ruled out sabotage, focusing on mechanical or maintenance issues as the likely cause. Recovery efforts have highlighted damage to a cable connecting the funicular's cars.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Canadiens Trade Carey Price to Sharks, Including 2026 Fifth-Round Pick",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Fri, 05 Sep 2025 21:58:16 +0000",
    "source": "Global News",
    "sources": [
      "Sportsnet",
      "Global News"
    ],
    "domains": [
      "globalnews.ca",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "The Canadiens will also send a fifth-round draft pick in 2026 to San Jose in the deal announced Friday.",
      "<p>In a just world, Carey Price would’ve finished his career as a Canadien.</p>\n<p>But after allowing his contract to be traded to the Sharks, Price came up huge for the franchise once again. </p>",
      "<p>A legend is being traded from the only team he&#8217;s ever know. Well, at least his contract.</p>"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/f70ea8753b1d2a42f2100931c9a2597a8587de257fb005444dc775955bcdfca1.jpg?quality=65&strip=all",
    "titles": [
      "Montreal Canadiens trade Carey Price’s contract to San Jose Sharks",
      "Canadiens’ trade with Sharks one last huge save from Carey Price",
      "Canadiens trade Carey Price’s contract to Sharks for D Gannon Laroque"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.955,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.696,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Montreal Canadiens have traded Carey Price's contract to the San Jose Sharks, along with a fifth-round draft pick in 2026. This move ends Price's tenure with the Canadiens, the only team he has played for in his career.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Dylan Harper Undergoes Surgery, Expected to Play in Spurs' Opener",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Fri, 5 Sep 2025 19:39:16 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Yahoo Sports"
    ],
    "domains": [
      "www.poundingtherock.com",
      "www.nbcsports.com",
      "www.espn.com"
    ],
    "snippets": [
      "Dylan Harper, the No. 2 pick in this year's draft, might recover in time for the Spurs' Oct. 22 opener after having surgery to repair a partially torn collateral ligament in his left thumb.",
      "Harper is likely to miss all of his rookie training camp recovering from this surgery, a setback to open his career.",
      "The injury was suffered in practice, but he is expected back by the start of the season."
    ],
    "image_url": "",
    "titles": [
      "Spurs' Harper has thumb surgery; opener possible",
      "Spurs No. 2 pick Dylan Harper undergoes surgery to repair torn ligament in left thumb",
      "Dylan Harper undergoes surgery to repair torn ligament in thumb"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.989,
      "consensus": 0.611,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.683,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Dylan Harper, the No. 2 pick in this year's draft, underwent surgery for a partially torn collateral ligament in his left thumb. Despite missing rookie training camp, he is expected to recover in time for the Spurs' season opener on Oct. 22. The injury occurred during practice.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Rare \"Blood Moon\" Eclipse Visible in UK Sunday Evening",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 05 Sep 2025 07:36:36 GMT",
    "source": "BBC",
    "sources": [
      "Deutsche Welle",
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.dw.com",
      "www.bbc.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "A total lunar eclipse will be visible from parts of the UK on Sunday evening, weather permitting.",
      "A total lunar eclipse makes the moon shine with all the sunrises and sunsets on Earth — at the same time. But how? The moon is in Earth's shadow! Here's what’s going on.",
      "<p>The satellite will turn deep red as the Earth passes between the sun and the moon at about 7.30pm on Sunday</p><p>A rare total lunar eclipse “blood moon” will be visible from the UK on Sunday night for the first time since 2022.</p><p>The moon is expected to turn a deep, dark red as the Earth pas"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/e02e/live/5274e560-67cb-11f0-bdb3-2fec70b719ae.jpg",
    "titles": [
      "How to see Sunday's 'Blood Moon' total lunar eclipse",
      "Blood Moon this Sunday: What makes a total lunar eclipse",
      "Rare total lunar eclipse ‘blood moon’ to be visible from UK"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.694,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.676,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A rare total lunar eclipse, known as a \"blood moon,\" will be visible from parts of the UK on Sunday evening, weather permitting. This phenomenon, where the moon turns deep red, occurs when the Earth passes between the sun and the moon. This will be the first such event visible from the UK since 2022, expected to start around 7:30 pm.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump to Host G20 Summit at Doral Resort, Focus on Economy",
    "domain": "sports",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-09-05T22:50:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "Financial Post"
    ],
    "domains": [
      "www.dw.com",
      "financialpost.com"
    ],
    "snippets": [
      "The United States hasn't hosted a G20 summit in nearly two decades. This is not the first time President Donald Trump has proposed to hold the event at his golf course in Florida.",
      "US President Donald Trump made official his intention to host next year’s Group of 20 summit at his Doral resort in south Florida, with plans to curtail the attendee list and focus talks on the economy."
    ],
    "image_url": "",
    "titles": [
      "Trump says US will host G20 summit in 2026",
      "Trump Says He’ll Host 2026 G-20 Summit at His Doral Resort"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.973,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.667,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "President Donald Trump announced plans to host the next G20 summit at his Doral resort in Florida, marking the first time the US will host the event in nearly two decades. The summit will have a reduced attendee list and will focus on economic discussions.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Anthropic Agrees to $1.5B AI Copyright Settlement, Pays Authors $3,000/Book",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Fri, 05 Sep 2025 23:24:38 GMT",
    "source": "Axios",
    "sources": [
      "Fortune",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "fortune.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMidEFVX3lxTFBERV9wVGlXZHdncG8tbnV1aVEwcHpxaGxZZzlSTHdQUkpkMHJkMGpkNG0wbGlFaDhMUUtWT2FxZGVrWjRrVTJYeGxKS2xxZTRVLXdmTmF0djVwZzFqckdka1VIOEFkam93dVFzN1drbmp3dkdR?oc=5\" target=\"_blank\">Anthropic to pay $3,000 per book in $1.5 billion AI copyright settlemen",
      "Anthropic’s deal with authors may accelerate a shift toward licensing copyrighted material needed to train AI models, legal experts say"
    ],
    "image_url": "",
    "titles": [
      "Anthropic to pay $3,000 per book in $1.5 billion AI copyright settlement - Axios",
      "Anthropic reaches $1.5 Billion settlement with authors in landmark copyright case"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.964,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.655,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Anthropic has agreed to a $1.5 billion AI copyright settlement, under which it will pay authors $3,000 per book. This deal is seen by legal experts as potentially accelerating the trend towards licensing copyrighted material for AI model training.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Dabrowski and Routliffe Clinch Second US Open Women's Doubles Title",
    "domain": "sports",
    "source_domain": "sports.yahoo.com",
    "location": "national",
    "published": "Fri, 05 Sep 2025 23:42:16 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "CityNews",
      "Yahoo Sports"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "sports.yahoo.com"
    ],
    "snippets": [
      "Gabriela Dabrowski won her second US Open women's doubles title alongside Erin Routliffe on Friday, the culmination of a &quot;wild ride&quot; that began with a breast cancer diagnosis last year.&quot;Yeah, wild ride.",
      "Canada&#8217;s Gabriela&#160;Dabrowski&#160;and Erin Routliffe are U.S. Open women&#8217;s doubles champions for the second time in three years. They defeated top-seeded American Taylor Townsend and Czechia&#8217;s Katerina Siniakova 6-4, 6-4 in Friday&#8217;s final. Dabrowski is an Ottawa native, w"
    ],
    "image_url": "",
    "titles": [
      "Dabrowski takes 'wild ride' from cancer diagnosis to US Open doubles crown",
      "Ottawa’s Gabriela Dabrowski wins U.S. Open women’s doubles title"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.99,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.653,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Gabriela Dabrowski and Erin Routliffe won their second US Open women's doubles title, defeating Taylor Townsend and Katerina Siniakova 6-4, 6-4. This victory marks a significant achievement for Dabrowski, an Ottawa native, especially after a challenging year due to a breast cancer diagnosis.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Robinhood Joins S&P 500 in Latest Quarterly Rebalance",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Fri, 05 Sep 2025 23:02:13 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Financial Post"
    ],
    "domains": [
      "www.cnbc.com",
      "financialpost.com"
    ],
    "snippets": [
      "The S&amp;P 500 already has a heavy concentration of large technology companies. Datadog and DoorDash entered earlier this year.",
      "Robinhood Markets Inc. has been added to the S&#038;P 500, marking a new phase for the retail trading platform that helped define the pandemic-era boom in individual investing. The company will join the benchmark in the latest quarterly rebalance, S&#038;P Dow Jones Indices said Friday."
    ],
    "image_url": "",
    "titles": [
      "AppLovin and Robinhood added to S&P 500",
      "Robinhood, AppLovin, Emcor to Join S&P 500 in Rebalancing"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.957,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.646,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Robinhood Markets Inc. has been added to the S&P 500, joining other large technology companies in the index. This inclusion marks a significant milestone for the retail trading platform, highlighting its influence on the pandemic-era investing boom. The update was announced by S&P Dow Jones Indices during their latest quarterly rebalance.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "U.S. May Bar Foreign Leaders from UN Assembly Over Detentions",
    "domain": "business",
    "source_domain": "www.ft.com",
    "location": "global",
    "published": "Fri, 05 Sep 2025 22:09:09 GMT",
    "source": "Financial Times",
    "sources": [
      "Washington Post",
      "Financial Times"
    ],
    "domains": [
      "www.washingtonpost.com",
      "www.ft.com"
    ],
    "snippets": [
      "Move raises possibility the administration could bar some foreign leaders from attending upcoming UN General Assembly",
      "The move empowers the State Department to impose sanctions and other punitive measures on governments that hold Americans without justification."
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Fa136e9ff-fe1e-4b5b-93b7-840465867727.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Trump issues order to penalise countries that detain American citizens",
      "Trump executive order targets nations that detain U.S. citizens"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.939,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.643,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The U.S. administration's recent action could lead to barring certain foreign leaders from the UN General Assembly. This move allows the State Department to apply sanctions against governments detaining Americans without valid reasons.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Warner Bros. Sues Midjourney Over Copyright Infringement Claims",
    "domain": "technology",
    "source_domain": "techcrunch.com",
    "location": "global",
    "published": "Fri, 05 Sep 2025 16:56:38 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch",
      "Ars Technica"
    ],
    "domains": [
      "arstechnica.com",
      "techcrunch.com"
    ],
    "snippets": [
      "Warner Bros. says that Midjourney knowingly engaged in wrongful conduct, noting that the company previously restricted subscribers from generating content based on infringing images but recently lifted those protections.",
      "Warner Bros. case builds on arguments raised in a Disney/Universal lawsuit."
    ],
    "image_url": "",
    "titles": [
      "Warner Bros. sues Midjourney for AI images of Superman, Batman, and other characters",
      "Warner Bros. sues Midjourney to stop AI knockoffs of Batman, Scooby-Doo"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.86,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.634,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Warner Bros. accuses Midjourney of intentionally allowing users to generate content from copyrighted images after lifting previous restrictions. This case follows similar legal arguments made in a Disney/Universal lawsuit against Midjourney.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "PM Keir Starmer Reshuffles Cabinet to Boost Labour Party's Effectiveness",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 05 Sep 2025 17:56:30 GMT",
    "source": "BBC",
    "sources": [
      "Financial Times",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.ft.com"
    ],
    "snippets": [
      "An in-depth look at which Labour MPs are currently serving in Prime Minister Keir Starmer's cabinet.",
      "Overhaul of top team hands experienced ministers and fast risers new briefs and challenges"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/32a4/live/ebb32100-8a4f-11f0-9cf6-cbf3e73ce2b9.jpg",
    "titles": [
      "Who's in Keir Starmer's new cabinet?",
      "Who’s who in Starmer’s new cabinet?"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.86,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.627,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Prime Minister Keir Starmer has reshuffled his cabinet, assigning new roles and challenges to both seasoned ministers and rapidly advancing members of the Labour Party. This move aims to strengthen the team's effectiveness and address current political demands.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Tesla Proposes Pay Package for Musk, Aiming for Trillionaire Status",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Fri, 05 Sep 2025 15:36:41 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Business Insider"
    ],
    "domains": [
      "www.cnbc.com",
      "www.businessinsider.com"
    ],
    "snippets": [
      "Tesla will also ask shareholders to vote on whether the automaker should invest in Musk's artificial intelligence company, xAI.",
      "Tesla Chair Robyn Denholm said the proposed pay package for Elon Musk is meant to keep his \"focus and attention\" on the EV maker."
    ],
    "image_url": "",
    "titles": [
      "Tesla's nearly $1 trillion new pay plan for Musk would expand his voting power",
      "Tesla's $1 trillion pay package for Elon Musk boils down to one thing: Keeping the attention of the world's richest man"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.819,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.626,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Tesla's board proposed a new pay package for Elon Musk, which could make him the world's first trillionaire if shareholders approve. The package requires Musk to achieve milestones like producing 1 million robotaxis and 1 million homes. Additionally, shareholders will vote on Tesla investing in Musk's AI company, xAI.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]