[
  {
    "title": "Sanae Takaichi Elected LDP Leader, Set to Be Japan's First Female PM",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sat, 04 Oct 2025 06:17:39 -0400",
    "source": "NPR",
    "sources": [
      "BBC",
      "Washington Post",
      "Al Jazeera",
      "The Guardian",
      "NPR",
      "New York Times",
      "Deutsche Welle",
      "Financial Times"
    ],
    "domains": [
      "www.nytimes.com",
      "www.theguardian.com",
      "www.aljazeera.com",
      "www.dw.com",
      "www.bbc.com",
      "www.ft.com",
      "www.npr.org",
      "www.washingtonpost.com"
    ],
    "snippets": [
      "Japan's governing party on Saturday elected Sanae Takaichi, a hard-line ultra-conservative and China hawk, as its new leader, making her likely to become the country's first female prime minister.",
      "Takaichi is a long-time admirer of Margaret Thatcher, but many female voters do not see her as an advocate for progress.",
      "If elected, Takaichi will face a host of issues, including an ageing population and growing unease about immigration.",
      "Conservative hard-liner Takaichi is the former internal affairs minister of Japan. She holds hawkish views on China, and has also visited the controversial Yasukuni Shrine, which memorializes Japan's war dead.",
      "Arch-conservative who models herself on Margaret Thatcher beats Shinjiro Koizumi in second-round party vote",
      "<p>Margaret Thatcher admirer beat her more moderate rival to become leader of Liberal Democratic party</p><p>Japan is poised to get its first female prime minister after Sanae Takaichi was elected as leader of the governing Liberal Democratic party (LDP) – a victory that should lead to her being ins",
      "The new leader will take the helm of the world’s fourth-largest economy at a time of unusual political instability, rising prices and increasing regional tensions.",
      "Sanae Takaichi, a hard-line conservative, was elected as leader by Japan’s embattled governing party, paving the way for her to become prime minister of the coalition government."
    ],
    "image_url": "",
    "titles": [
      "Japan's ruling party elects Sanae Takaichi as leader, likely to become first female PM",
      "Sanae Takaichi set to become Japan's first female prime minister",
      "Japan’s LDP elects Takaichi as new leader, likely to be first female PM",
      "Sanae Takaichi expected to be Japan's first female PM",
      "Japan set for first female PM after Sanae Takaichi wins leadership race",
      "Japan poised to get first female PM after Sanae Takaichi wins ruling party leadership",
      "Sanae Takaichi is set to become Japan’s first female prime minister",
      "Japan Is Set for Its First Female Prime Minister"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.961,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.867,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Sanae Takaichi, a conservative hard-liner and former Economic Security Minister, has been elected as the new leader of Japan's governing Liberal Democratic Party (LDP), positioning her to become the country's first female prime minister. Takaichi, known for her admiration of Margaret Thatcher and hawkish views on China, won against her more moderate rival, Shinjiro Koizumi, in a second-round party vote. Her leadership arrives amidst challenges such as political instability, an ageing population, rising prices, and regional tensions.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Hamas Agrees to Release Hostages, Engages in Peace Talks with Trump's Plan",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sat, 04 Oct 2025 10:18:31 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Axios",
      "Fortune",
      "Al Jazeera",
      "New York Times",
      "The Guardian"
    ],
    "domains": [
      "www.nytimes.com",
      "www.theguardian.com",
      "www.aljazeera.com",
      "fortune.com",
      "news.google.com"
    ],
    "snippets": [
      "The Israeli army repeats threat to Palestinians to leave northern Gaza to the south and not to return to Gaza City.",
      "Israeli air strikes and shelling destroy homes in Gaza, in defiance of Trump&#039;s ceasefire call.",
      "US President Donald Trump has ordered Israel to halt its bombing of Gaza, saying Hamas is ready to make peace.",
      "US leader tells Israel it &#039;must immediately stop&#039; bombing Gaza, says he believes Hamas is &#039;ready for a lasting peace&#039;.",
      "<a href=\"https://news.google.com/rss/articles/CBMif0FVX3lxTE1vUzN3NUNhdW5KdGZNLW0tdndmRk0tU3p3aDhxMkdHLW84YVJCTGR0RnFvTl8zVHNLU090NTBfMEpzN3JFbUQ1VERoV1phR1RRX1g0QXhnWmk3ektQTFdNZFBDcm8ydERPWVI3U01vaGZfMHR5cy1jTm5qV1NYLVE?oc=5\" target=\"_blank\">Trump tells Israel to stop bombing Gaza after Hamas resp",
      "<p>Palestinian militant group accepts part of US president’s plan but seeks further negotiations on many terms</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/oct/04/israel-gaza-hamas-trump-plan-hostages-netanyahu-latest-news-updates\">Israel-Gaza live: latest new updates</a></p></",
      "President Trump said he believed Hamas was “ready for a lasting peace” after the militant group offered to release hostages and discuss the U.S.-led peace proposal.",
      "Hamas said it was willing to release the hostages and hand over power to other Palestinians, but that other aspects of the plan require further consultations among Palestinians."
    ],
    "image_url": "",
    "titles": [
      "Israel says Gaza City still a ‘combat zone’ after Trump says ‘stop bombing’",
      "Israeli air strikes hit Gaza despite Trump’s ‘stop bombing’ demand",
      "Trump orders Israel to stop bombing Gaza, says Hamas ready for peace",
      "LIVE: Israel kills 20 people after Trump tells it to ‘stop bombing’ Gaza",
      "Trump tells Israel to stop bombing Gaza after Hamas responds to peace plan - Axios",
      "Donald Trump orders Israel to ‘immediately’ stop bombing Gaza as Hamas agrees to free hostages",
      "Trump Calls on Israel to Stop Bombing Gaza After Hamas Agrees to Parts of Cease-Fire Plan",
      "Trump orders Israel to stop bombing Gaza after Hamas partially accepts his peace plan"
    ],
    "score_components": {
      "magnitude": 0.964,
      "recency": 0.961,
      "consensus": 0.995,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.838,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Hamas has agreed to release Israeli hostages and accepted parts of President Trump's peace plan to end the nearly two-year war, but seeks further negotiations on many terms. Trump has ordered Israel to immediately stop bombing Gaza, signaling a potential move towards peace. Despite not fully agreeing to the U.S. proposal, Hamas's willingness to discuss the plan and release hostages has been acknowledged by Trump as a step towards achieving lasting peace in the Middle East.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Sean \"Diddy\" Combs Sentenced to Over 4 Years for Prostitution Charges",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Fri, 03 Oct 2025 17:17:13 -0400",
    "source": "NPR",
    "sources": [
      "ABC News",
      "Axios",
      "Al Jazeera",
      "CityNews",
      "NPR",
      "Deutsche Welle",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "ottawa.citynews.ca",
      "www.aljazeera.com",
      "www.dw.com",
      "www.npr.org",
      "abcnews.go.com",
      "news.google.com"
    ],
    "snippets": [
      "Combs had been convicted in July on two counts of transportation for prostitution. During his sentencing hearing he spoke at length for the first time in the trial, addressing the judge at length.",
      "The famed hip-hop mogul told the court that his actions were &#039;disgusting&#039; and &#039;shameful&#039; in a plea for leniency.",
      "The US rapper and record producer was convicted over sexual encounters, capping a sordid federal case that featured harrowing testimony. The judge said \"these were serious offenses that irreparably harmed two women.\"",
      "<a href=\"https://news.google.com/rss/articles/CBMihwFBVV95cUxNNGVad0ZMd0hIWDZMV1dpdmxQZ2tTdTM2UncxRlMtLWlGdkM2aEZrMHEwb3dCejM2RGRiYXFmcW5XTHdRQ2VFcEJaX0YxYlphV2hLNzd6UlpKUTd2OGtpenNxM3laXzVLYnVvS3I2bXI1US1yc0IxaUxHRGZHQkVnVF9nQkc3Um8?oc=5\" target=\"_blank\">Sean \"Diddy\" Combs sentenced to four years f",
      "Sean Combs sat expressionless in his seat when the judge sentenced him to just over four years in prison Friday for his conviction on two prostitution-related offenses.",
      "<p>Combs, who was convicted of ‘transportation to engage in prostitution’, sentenced in New York. This blog is now closed.</p><p><strong>The prosecution <a href=\"https://viewer.gutools.co.uk/us-news/2025/sep/30/sean-diddy-combs-sentence-recommendation\">submitted several victim impact </a>statements ",
      "NEW YORK (AP) —&#160;Sean “Diddy” Combs&#160;was sentenced Friday to four years and two months in prison for transporting people across state lines for sexual encounters, capping a sordid federal case that featured harrowing testimony and ended in a forceful reckoning for&#160;one of the most influe"
    ],
    "image_url": "",
    "titles": [
      "Sean Combs sentenced to over four years in prison for prostitution-related charges",
      "Musician Sean ‘Diddy’ Combs sentenced to four years in prison after apology",
      "US: Sean 'Diddy' Combs sentenced to over 4 years in prison",
      "Sean \"Diddy\" Combs sentenced to four years for prostitution charges - Axios",
      "WATCH:  Sean 'Diddy' Combs sentenced to 50 months in prison",
      "Sean ‘Diddy’ Combs sentenced to more than four years in prison and given $500,000 fine – as it happened",
      "Sean ‘Diddy’ Combs is sentenced to over 4 years in prison"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.733,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.822,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Sean \"Diddy\" Combs was sentenced to 4 years and 2 months in prison after being convicted on two counts of transportation for prostitution. In his trial, he admitted his actions were \"disgusting\" and \"shameful.\" Despite his plea for leniency and the prosecution's push for a longer sentence of 11 years and three months, the judge determined the crimes caused irreparable harm to two women and emphasized the need for a lengthy sentence to serve as a deterrent.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Munich Airport Halts Flights Amid Drone Sightings, Affects Oktoberfest",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 04 Oct 2025 08:01:49 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Deutsche Welle",
      "New York Times",
      "Financial Post",
      "The Guardian"
    ],
    "domains": [
      "www.nytimes.com",
      "www.theguardian.com",
      "www.dw.com",
      "www.bbc.com",
      "financialpost.com"
    ],
    "snippets": [
      "Flights were suspended for several hours on Friday night, with around 6,500 passengers affected.",
      "Both runways at Munich Airport had been closed for the second time in 24 hours after further \"unconfirmed drone sightings.\" A drone was earlier sighted over a nearby military facility. DW has more.",
      "The disruption comes as Munich hosts its world-famous Oktoberfest beer festival, which runs until Sunday. Last week, Denmark and Norway closed airports due to drones.",
      "<p>About 6,500 passengers stranded as interior minister says earlier drone incident a ‘wake-up call’</p><p>Munich airport was forced to halt operations for the second day in a row on Friday over drone sightings, with dozens of flights and more than 6,000 passengers affected.</p><p>Airports in Denmar",
      "The airport in Germany was the latest in Europe to shut because of drone sightings. Officials have blamed Russia, which has denied being behind the drone incursions.",
      "MUNICH (AP) &#8212; Germany&#8217;s Munich Airport reopened Saturday morning after authorities shut it down the night before for the second time in less than 24 hours after two additional drone sightings, officials said. The closures are the latest after mysterious drone overflights in the airspace "
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/5a8a/live/74e773f0-a0ac-11f0-b741-177e3e2c2fc7.jpg",
    "titles": [
      "Munich airport resumes flights after suspected drones force second closure in 24 hours",
      "Germany news: Munich Airport resumes flights after drone sightings",
      "Germany: Drone sightings disrupt Munich Airport",
      "Munich airport forced to suspend flights for second day in a row over drone sightings",
      "Flights Are Briefly Halted at Munich Airport After Drone Sightings",
      "Germany’s Munich Airport reopens after second closure in less than 24 hours due to drones"
    ],
    "score_components": {
      "magnitude": 0.964,
      "recency": 0.897,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.816,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Munich airport suspended operations due to drone sightings on Thursday evening, affecting the Oktoberfest beer festival. This led to 17 flight cancellations and disrupted nearly 3,000 travelers. This incident is part of a series of drone disruptions in European aviation, with officials blaming Russia, which has denied the accusations.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Blue Jays to Host Yankees, Boosting Toronto Economy",
    "domain": "business",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sat, 04 Oct 2025 10:02:10 +0000",
    "source": "Global News",
    "sources": [
      "CityNews",
      "Global News",
      "Financial Post"
    ],
    "domains": [
      "financialpost.com",
      "globalnews.ca",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "As the Toronto Blue Jays prepare to host the New York Yankees in the first game of the American League Division Series on Saturday, local businesses and industry groups say they welcome the expected boost in tourism and consumer spending amid a tough year for the Canadian economy.",
      "TORONTO &#8212; As the Toronto Blue Jays prepare to host the New York Yankees in the first game of the American League Division Series on Saturday, local businesses and industry groups say they welcome the expected boost in tourism and consumer spending amid a tough year for the Canadian economy. Th",
      "TORONTO — As the Toronto Blue Jays prepare to host the New York Yankees in the first game of the American League Division Series on Saturday, local businesses and industry groups say they welcome the expected boost in tourism and consumer spending amid a tough year for the Canadian economy. The firs"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/10/f6bec9db225c9e1ab55f54d27feb349bfbc54f141b92af2368e424115fca3a78.jpg?quality=65&strip=all",
    "titles": [
      "Businesses, industry groups welcome Jays playoffs",
      "‘Massive lift’: Toronto businesses, industry groups welcome Blue Jays playoff boost",
      "‘Massive lift’: Toronto businesses, industry groups welcome Blue Jays playoff boost"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.955,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 1.0
    },
    "score": 0.788,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Toronto Blue Jays are set to host the New York Yankees in the first game of the American League Division Series on Saturday. Local businesses and industry groups in Toronto anticipate a significant increase in tourism and consumer spending, which is seen as a positive development during a challenging year for the Canadian economy.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "US President Urges Israel to Stop Gaza Bombings Amid Peace Efforts",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sat, 04 Oct 2025 06:58:42 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Washington Post",
      "ABC News",
      "Al Jazeera",
      "New York Times"
    ],
    "domains": [
      "www.nytimes.com",
      "abcnews.go.com",
      "www.aljazeera.com",
      "www.washingtonpost.com"
    ],
    "snippets": [
      "Hope-filled reactions follow Hamas’s response, which marks a potential turning point in Israel&#039;s two-year war on Gaza.",
      "Hamas responded to President Trump's proposal for peace in Gaza, saying it will release all remaining hostages if Israel withdraws from Gaza and \"proper field conditions are met.\"",
      "The plan aims to secure the release of Israeli hostages held in the Gaza Strip and end a two-year conflict that has reduced much of the enclave to rubble.",
      "Hamas has responded positively to Trump&#039;s Gaza peace proposal, but differences remain.",
      "Israel said it would cooperate with the White House to end the war, but much remains unclear about Hamas’s future and whether it will agree to disarm."
    ],
    "image_url": "",
    "titles": [
      "World reacts to Hamas’s response to Trump’s Gaza plan",
      "WATCH:  Hamas responds to President Trump's proposal to end Gaza war",
      "Hamas accepts Trump’s plan to end the war in Gaza, but with conditions",
      "How did Hamas respond to Trump’s Gaza deal? What did Trump say in response?",
      "Israel and Hamas Say They’ll Work With Trump’s Gaza Plan, but Gaps Remain"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.896,
      "consensus": 0.908,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.785,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The US President has called on Israel to halt bombings in Gaza, indicating Hamas's willingness for a 'lasting peace.' This move is part of a peace plan aimed at ending a two-year conflict and securing the release of Israeli hostages in Gaza. While Hamas agrees to aspects of the plan, it hesitates to fully endorse the proposal, particularly the demand to disarm.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Supreme Court Backs Trump Policy, Ends Protections for 300K Immigrants",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 21:48:49 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Forbes",
      "Washington Post",
      "Al Jazeera",
      "LA Times"
    ],
    "domains": [
      "www.forbes.com",
      "www.latimes.com",
      "www.aljazeera.com",
      "www.washingtonpost.com"
    ],
    "snippets": [
      "The US court&#039;s conservative supermajority once again backed Trump&#039;s efforts to limit temporary immigration pathways.",
      "A federal judge had ruled on Sept. 5 that Homeland Security Secretary Kristi L. Noem broke the law by revoking the temporary protected status of Venezuelan and Haitian immigrants.",
      "<p>Trump's lawyers said the new administration had the right to cancel Biden's temporary protections for immigrants.</p>",
      "The Supreme Court, in a 6-3 split, granted another emergency request to revoke Temporary Protected Status to about 300,000 Venezuelans."
    ],
    "image_url": "",
    "titles": [
      "Supreme Court allows Trump to nix temporary status for Venezuelan migrants",
      "Supreme Court will let Trump end protected status for Venezuelans for now",
      "Supreme Court says again Trump may cancel temporary protections for Venezuelans granted under Biden",
      "Supreme Court Lets Trump Administration End Protections For Venezuelan Immigrants"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.741,
      "consensus": 0.908,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.754,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The US Supreme Court, with a conservative supermajority, supported the Trump administration's move to revoke Temporary Protected Status for Venezuelan and Haitian immigrants, affecting about 300,000 individuals. This decision came after a lower court had ruled that Homeland Security Secretary Kristi L. Noem's cancellation of the protections was unlawful. The court's 6-3 split decision temporarily halts the lower court's ruling.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "U.S. Strike Kills 4 on Suspected Drug Boat in Caribbean",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-10-03T18:02:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Washington Post",
      "New York Times",
      "Deutsche Welle",
      "The Guardian"
    ],
    "domains": [
      "www.nytimes.com",
      "www.dw.com",
      "www.theguardian.com",
      "www.washingtonpost.com"
    ],
    "snippets": [
      "The US said it carried out another strike on a small boat in the Caribbean Sea, killing four people on board. Pentagon chief Pete Hegseth said \"narco-terrorists\" were the target.",
      "<p>Pentagon chief says strike – fourth by US military in recent weeks – targeted boat with ‘substantial amounts’ of drugs</p><p>The United States carried out a strike against an alleged drug-trafficking boat on Friday that killed four people, US defense secretary <a href=\"https://www.theguardian.com",
      "The U.S. strike near Venezuela is the latest in the Trump administration’s legally nebulous campaign targeting Latin American drug cartels.",
      "It was the fourth strike in the Trump administration’s legally disputed campaign targeting suspected drug runners in the Caribbean Sea."
    ],
    "image_url": "",
    "titles": [
      "US strikes drug alleged boat near Venezuelan waters",
      "Hegseth says four killed in US strike on alleged drug boat off Venezuelan coast",
      "U.S. kills 4 alleged drug smugglers near Venezuela, Hegseth says",
      "U.S. Military Attacked Boat Off Venezuela, Killing Four Men, Hegseth Says"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.685,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.733,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The U.S. conducted a strike in the Caribbean Sea, killing four individuals on a boat suspected of drug trafficking. This action, confirmed by Pentagon Chief Pete Hegseth, marks the fourth similar strike by the U.S. military under the Trump administration's campaign against Latin American drug cartels. The operation is part of a series targeting vessels believed to be carrying substantial amounts of drugs.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "US President Urges Israel to Stop Gaza Bombings Amid Peace Efforts",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 20:11:14 +0000",
    "source": "Al Jazeera",
    "sources": [
      "LA Times",
      "Al Jazeera",
      "Financial Times"
    ],
    "domains": [
      "www.latimes.com",
      "www.aljazeera.com",
      "www.ft.com"
    ],
    "snippets": [
      "US president tells Israel to &#039;immediately stop bombing Gaza&#039;, says Hamas ready for &#039;lasting peace&#039;.",
      "US president ordered Israel to cease bombing but Gaza residents report scattered explosions",
      "<p>Hamas said it would agree to some parts of President Trump's peace plan, but held back on endorsing the entire initiative, which calls for it to lay down its weapons.</p>"
    ],
    "image_url": "",
    "titles": [
      "Hamas agrees to parts of Trump’s Gaza plan, seeks more talks, bombing eases",
      "Israel prepares for hostage release after Hamas agrees to parts of Trump’s peace plan",
      "Hamas agrees to return hostages but resists other parts of Trump's peace plan"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.716,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.697,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The US President has called on Israel to halt bombings in Gaza, indicating Hamas's willingness for a 'lasting peace.' This move is part of a peace plan aimed at ending a two-year conflict and securing the release of Israeli hostages in Gaza. While Hamas agrees to aspects of the plan, it hesitates to fully endorse the proposal, particularly the demand to disarm.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "WNBA's Engelbert Responds to Criticism, Seeks to Mend Player Relations",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sat, 04 Oct 2025 01:16:46 +0000",
    "source": "CBS Sports",
    "sources": [
      "Sportsnet",
      "CityNews",
      "CBS Sports"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "www.cbssports.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "'Obviously, I did not make those comments,' Engelbert said",
      "Engelbert has come under significant fire this week, particularly from the players",
      "Engelbert faces blazing criticism from WNBA players, but the NBA's ownership and influence remain the central challenge to the league's future",
      "<p>WNBA commissioner Cathy Engelbert said Friday there&#8217;s work to be done to repair relationships with players in the league, while adding that there were “inaccuracies” in some of the comments attributed to her by Napheesa Collier in a blistering assessment earlier this week.</p>",
      "LAS VEGAS (AP) — WNBA Commissioner Cathy Engelbert said Friday there&#8217;s work to be done to repair relationships with players in the league, while adding that there were “inaccuracies” in some of the comments attributed to her by Napheesa Collier in a blistering assessment earlier this week. “I "
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/10/04/68ec3d3e-1822-4d6d-b484-c8c24681dbea/untitled-design-30.png",
    "titles": [
      "WNBA commissioner Cathy Engelbert denies saying Caitlin Clark needs to be 'grateful' for WNBA platform",
      "WNBA commissioner Cathy Engelbert says she won't resign: 'I've never been a quitter'",
      "WNBA commissioner Cathy Engelbert is under fire, but the NBA is the real power worth challenging",
      "WNBA commissioner Cathy Engelbert vows to repair trust after facing criticism",
      "WNBA Commissioner Cathy Engelbert vows to repair player relationships"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.796,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.696,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "WNBA Commissioner Cathy Engelbert addressed criticism from players, stating there are inaccuracies in comments attributed to her by Napheesa Collier. Engelbert acknowledged the need to repair relationships with players amid the controversy. She refuted making certain remarks and highlighted ongoing challenges, including the NBA's influence on the WNBA's future.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Yom Kippur Attack at Synagogue Kills 2; Israel Detains Activists, Starbucks Cuts",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 20:49:28 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "New York Times",
      "Financial Times"
    ],
    "domains": [
      "www.nytimes.com",
      "www.bbc.com",
      "www.ft.com"
    ],
    "snippets": [
      "Two Jewish people were killed in a car and stabbing attack at Heaton Park Hebrew Congregation Synagogue in Manchester on the holiest day in the Jewish religious calendar.",
      "Shocked family condemns atrocity as ‘heinous act’",
      "Japan’s beleaguered governing party will convene for a crucial election that could pave the way for the first female prime minister or the youngest leader in 140 years.",
      "Two people were killed on Yom Kippur after a driver rammed a vehicle into people in Manchester and stabbed others. One man who died was accidentally shot by the police, who also killed the attacker."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/e75f/live/9e76f8a0-a109-11f0-b741-177e3e2c2fc7.jpg",
    "titles": [
      "What we know about the attack",
      "What we know about Manchester synagogue attacker Jihad Al-Shamie",
      "What to Know About Japan’s Leadership Election",
      "Synagogue Attack on Yom Kippur in Manchester, UK: What We Know"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.711,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.693,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Two individuals were killed in a car and stabbing attack at Heaton Park Hebrew Congregation Synagogue during Yom Kippur, with the assailant also deceased. Meanwhile, Israeli forces detained activists from several aid boats in international waters, amidst criticism of international inaction on the situation in Gaza. Additionally, Starbucks announced the closure of 1% of its North American stores, though specific locations were not disclosed.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Senators Trade for MacDermid from Devils, Seek Roster Toughness",
    "domain": "sports",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Fri, 03 Oct 2025 21:39:38 GMT",
    "source": "NHL",
    "sources": [
      "Sportsnet",
      "NHL",
      "Ottawa Citizen"
    ],
    "domains": [
      "ottawacitizen.com",
      "news.google.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMilAFBVV95cUxNWEdNck9VVExkWWtIUU5oOTlYWUlTVGo4bDRNak55Y0ZSOWZJMU9JVzZZTHV6WFhTY19WSGhZUXpzczZoS1B3Wk12RzFIeGNYV3hGTV9xZU1KMC1fQ2dhbHVxam01NjdFWUczTUVKX251OWs2WDNtQ1pwX056SnBZbWVzV0cwZDJIMTJ0LTRpNGJQUnBX?oc=5\" target=\"_blank\">Senators acquire winger Kur",
      "<a href=\"https://news.google.com/rss/articles/CBMikgFBVV95cUxPMFN3d3kxMmdzNk16MjJCS1lucWYxdWsxRWRaUGk3dENvd3FBQ3BlVGtaV05jdWxhcHlpSEIwUk5JdjA5XzVVR3V2WXd2T2wtX3ZXamdNWEd1a0ZVOWdOVHFESGZsLXAzT1JBaURLWjhwcUF6d1RnbnB4YTZqSnVPTTVTRGtoWWU2bmlZZjNyMkVzUQ?oc=5\" target=\"_blank\">Senators acquire Kurtis MacDe",
      "<a href=\"https://news.google.com/rss/articles/CBMiigFBVV95cUxQX2F0Nk83YWQtRUJzQTJkMFV5ekpDd3lzNDI5eWktZ2QxVGg4a2tIMFBmMnlZeHpTVEpSbjJ4WjlPcVh1TURIWmg0LXJYanNNZkNxak5ibjJQeXVuM0dybDBhbmFkcFNwNDdGWW9sVW44WU10Z2d5QjVNaEVJMVhiOWdWZFlGb3pTTkE?oc=5\" target=\"_blank\">Devils Acquire MacEwen from Ottawa | REL",
      "<p>The Ottawa Senators added some depth on Friday, acquiring veteran enforcer Kurtis MacDermid from the New Jersey Devils in exchange for Zack MacEwen.</p>",
      "The Ottawa Senators have served notice to the Atlantic Division that they won&#8217;t be pushed around. After taking it on the chin from the Montreal Canadiens in a 5-0 loss on Tuesday in Quebec City, the Senators served notice on Friday night that they won&#8217;t stand still by acquiring Kurtis Ma"
    ],
    "image_url": "",
    "titles": [
      "Senators acquire winger Kurtis MacDermid from New Jersey - NHL.com",
      "Senators acquire Kurtis MacDermid in trade with Devils - NHL.com",
      "Devils Acquire MacEwen from Ottawa | RELEASE | New Jersey Devils - NHL.com",
      "Senators acquire Kurtis MacDermid from Devils in exchange for Zack MacEwen",
      "Ottawa Senators add muscle by acquiring Kurtis MacDermid from Devils"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.723,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.688,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Ottawa Senators acquired winger Kurtis MacDermid from the New Jersey Devils in exchange for Zack MacEwen, aiming to add depth and toughness to their roster. This move comes after a significant 5-0 loss to the Montreal Canadiens, signaling the Senators' intent to enhance their competitiveness in the Atlantic Division.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Jeff Bezos Criticizes AI as an \"Industrial Bubble\"",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Fri, 03 Oct 2025 21:28:47 GMT",
    "source": "Axios",
    "sources": [
      "CNBC",
      "Fortune",
      "Axios"
    ],
    "domains": [
      "fortune.com",
      "www.cnbc.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMieEFVX3lxTFBVa2J0U2ZhaXlvYXVLUm02WkZGY2lMeG5zS1lUTDdCeUVHR2Z6TEViUVE5aURJUklYWmpTSWlVWVN1TnhVQlZZN3RWUVB2MWVHWnZ3bTAwSkV5YmxsQlNmdWF2cWdscXlmcVA4LVVvZG9WRHE3UnVfQg?oc=5\" target=\"_blank\">Jeff Bezos slams AI \"industrial bubble,\" while Goldman Sachs' CEO",
      "Amazon founder Jeff Bezos said that artificial intelligence is showing signs of being in an \"industrial bubble.\"",
      "“That doesn’t mean anything that is happening isn’t real. AI is real, and it is going to change every industry.”"
    ],
    "image_url": "",
    "titles": [
      "Jeff Bezos slams AI \"industrial bubble,\" while Goldman Sachs' CEO expects \"drawdown\" - Axios",
      "Jeff Bezos says AI is in an industrial bubble but society will get 'gigantic' benefits from the tech",
      "Jeff Bezos agrees with OpenAI’s Sam Altman: We’re in an AI bubble. But Amazon’s founder says the benefits will be ‘gigantic’"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.72,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.688,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Jeff Bezos, Amazon's founder, criticized the current state of artificial intelligence, describing it as an \"industrial bubble.\" This statement reflects his perspective on the hype and investment surrounding AI technologies.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Justice Dept. Urges Apple to Remove ICE Tracking Apps, Citing Risks",
    "domain": "technology",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Fri, 03 Oct 2025 21:57:46 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Ars Technica",
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com",
      "www.cnbc.com",
      "arstechnica.com"
    ],
    "snippets": [
      "Joshua Aaron has said he created ICEBlock after seeing the Trump administration's deportation efforts, which he said evoked events in Nazi Germany.",
      "The app, which went viral earlier this year, allowed users to lawfully share information about where they've seen ICE agents within a 5-mile radius of their location, and also share details of the clothing agents are wearing.",
      "Apple nixes tracking apps after Trump admin claimed they put ICE agents at risk."
    ],
    "image_url": "",
    "titles": [
      "Creator of ICE agent tracking app asks Apple to rescind ban from online store",
      "Apple removes ICEBlock and similar tracking apps from the App Store",
      "Apple removes ICEBlock, won’t allow apps that report locations of ICE agents"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.728,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.682,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Justice Department requested Apple to remove ICEBlock and similar apps, arguing they pose security risks to ICE agents by allowing users to share their locations and clothing details. Following these concerns, Apple has removed these tracking apps, which had gained popularity for enabling users to lawfully report sightings of ICE agents.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Russia Strikes Ukraine Train Station; Both Nations Target Energy Sites",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sat, 04 Oct 2025 10:41:43 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Deutsche Welle",
      "Al Jazeera"
    ],
    "domains": [
      "www.dw.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "No figure has been given for the number of casualties in Moscow&#039;s latest attack on Ukraine&#039;s railway infrastructure.",
      "Russia has continued attacks on civilians in Ukraine with a strike targeting a passenger train station. Meanwhile, Moscow and Kyiv traded attacks on each other's energy infrastructure. DW has the latest."
    ],
    "image_url": "",
    "titles": [
      "Russian attack hits passenger train in Ukraine’s Sumy, causing casualties",
      "Ukraine updates: Russia hits passenger train, injures dozens"
    ],
    "score_components": {
      "magnitude": 0.795,
      "recency": 0.969,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.67,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Russia launched an attack on Ukraine's railway infrastructure and targeted a passenger train station, causing an unspecified number of casualties. Concurrently, Moscow and Kyiv exchanged strikes on each other's energy facilities. The exact impact on the infrastructure and casualty figures have not been disclosed.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Indonesia Searches for 49 Missing After School Collapse, 14 Dead",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sat, 04 Oct 2025 08:26:56 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Authorities say they are using heavy equipment to look for the 49 people who remain missing.",
      "<p>Dozens of students remain unaccounted for at Sidoarjo boarding school as rescuers bring in heavy excavators to clear large slabs of concrete</p><p>The death toll from a school collapse in Indonesia rose to 14 on Friday after recovery crews pulled multiple bodies from beneath the rubble. Dozens of"
    ],
    "image_url": "",
    "titles": [
      "Death toll from Indonesia school collapse rises to 14 as more victims found",
      "Indonesian school collapse: death toll rises to 14 as crews pull more bodies from rubble"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.924,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.647,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Authorities in Indonesia are using heavy equipment to search for 49 people still missing after a school collapse in Sidoarjo. The incident has resulted in 14 confirmed deaths, with recovery teams finding multiple bodies under the rubble. Rescuers are focusing on clearing large concrete slabs at the boarding school to locate dozens of unaccounted-for students.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "OMB Chief Central in Shutdown Talks, Highlighted by Trump's AI Video",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 21:31:21 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Axios"
    ],
    "domains": [
      "www.bbc.com",
      "news.google.com"
    ],
    "snippets": [
      "The Office of Management and Budget boss may not be a household name, but he's a key figure in Washington's shutdown.",
      "<a href=\"https://news.google.com/rss/articles/CBMidEFVX3lxTE1pWTVxM3hpR1A2amFNSHBQSVFBZjRwb1NIZE10UjA0RWp3T09OVUVTN3pqMmpMUDM4ZXBsNW1oaXJ1NllDSnVNZXFKOWREenZaWVhzV2FXU2lxQVNmWnhLcGM3VGRsUlZCSThiRURvdkVEb1cw?oc=5\" target=\"_blank\">\"Here comes the reaper.\" Trump's AI clip casts Vought as shutdown enfor"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/323f/live/91f80ab0-a082-11f0-bb47-b30225268691.jpg",
    "titles": [
      "Trump's Grim Reaper - from Project 2025 to shutdown enforcer",
      "\"Here comes the reaper.\" Trump's AI clip casts Vought as shutdown enforcer - Axios"
    ],
    "score_components": {
      "magnitude": 0.795,
      "recency": 0.721,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.62,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Office of Management and Budget head is playing a crucial role in the potential government shutdown, highlighted by a dramatic AI-generated video shared by Trump, which portrays him as a key enforcer. This position, though not widely recognized by the public, is pivotal in Washington's budget negotiations and the current discussions surrounding the shutdown.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Super Bowl XLVII Winner Arthur Jones Passes Away",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sat, 04 Oct 2025 02:53:30 +0000",
    "source": "CBS Sports",
    "sources": [
      "Sports Illustrated",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "news.google.com"
    ],
    "snippets": [
      "Jones was a key member of the Ravens' Super Bowl XLVII-winning team and the older brother of Jon and Chandler Jones",
      "<a href=\"https://news.google.com/rss/articles/CBMijAFBVV95cUxNWG82U1NneXZOWVpyQ0d6akk1ckVWeWxheEtraWFDa1BXeFpOZ3dud2o2b0V2WmRLNVdHZjBvdl94VWRUUTlKaXVGcF9qM0xkSTRLNmt3cTN0RUpWMjJXNzBsSElZODJPY3NQV0duRGtZVnZlcU9LTFIwU1JSempibWkyaGFSSVdwckcyYw?oc=5\" target=\"_blank\">Arthur Jones, Super Bowl Champion Def"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/10/03/ffc61181-6954-4f35-842e-9f97dd419481/arthur-jones-ravens.jpg",
    "titles": [
      "Arthur Jones dies at 39: Former Super Bowl winning defensive tackle for Baltimore Ravens passes away",
      "Arthur Jones, Super Bowl Champion Defensive Tackle With Ravens, Dies at 39 - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.823,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.62,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Arthur Jones, a key member of the Ravens' Super Bowl XLVII-winning team and the older brother of Jon and Chandler Jones, has been reported as deceased. Jones had a successful career in the NFL and was well-regarded by his teammates and fans.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Drone Kills Journalist in Ukraine, a First: European Federation",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-10-03T19:38:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "New York Times",
      "Deutsche Welle"
    ],
    "domains": [
      "www.nytimes.com",
      "www.dw.com"
    ],
    "snippets": [
      "The European Federation of Journalists said Antoni Lallican's death marks the first time a journalist had been killed by a drone in the Ukraine conflict.",
      "Antoni Lallican, a Paris-based photographer, is the first working journalist to be killed by a remotely piloted drone during the war, according to press associations."
    ],
    "image_url": "",
    "titles": [
      "Ukraine: French photojournalist killed by Russian drone",
      "French Photojournalist Killed in Drone Attack in Ukraine"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.708,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.611,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Antoni Lallican, a Paris-based photographer, became the first journalist to be killed by a drone in the Ukraine conflict, as confirmed by the European Federation of Journalists. This incident marks a tragic milestone in the war, highlighting the dangers journalists face while reporting.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Deputy PM Heckled at Vigil for Manchester Synagogue Attack Victims",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 21:24:36 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Deutsche Welle",
      "Al Jazeera"
    ],
    "domains": [
      "www.dw.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Deputy Prime Minister David Lammy heckled by members of the public at vigil for victims of attack.",
      "Two people were killed and three seriously injured in an attack on a synagogue in Manchester on Thursday. Police said one victim may have been accidentally shot by officers, as the attacker had no firearm."
    ],
    "image_url": "",
    "titles": [
      "Police say one victim possibly shot by officer during Manchester attack",
      "UK synagogue attack: Police likely shot one victim"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.734,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.602,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "At a vigil for victims of a Manchester synagogue attack, Deputy Prime Minister David Lammy was heckled. The attack resulted in two deaths and three serious injuries. Police stated one victim might have been accidentally shot by officers, as the attacker was unarmed. The assailant, previously arrested on suspicion of rape, had been bailed before the attack. Authorities are investigating the motive behind the incident.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Mets Overhaul Staff, Bench Coach Gibbons Exits Amid Changes",
    "domain": "sports",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Fri, 03 Oct 2025 17:27:16 GMT",
    "source": "Sports Illustrated",
    "sources": [
      "Sportsnet",
      "Sports Illustrated"
    ],
    "domains": [
      "news.google.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMiigFBVV95cUxNM1RiQ2t3ZFJvT093OTVLbkZsT3FERmFfWDlTeUEwdGo0MmphM1NiNzhkQ0tIQUY5NXQwMUJMNVZwVENsZ1pXZGp5ajFxV1JWaEtKRHR2Y3hmSE5IYUh5YnhldWpUbU1xbGVrSTdSb2NZUjFFMWQ0SlZvbWJtM051d3dCYmtFUlFZU1E?oc=5\" target=\"_blank\">Mets to Overhaul Coaching Staff After Se",
      "<p>A popular Toronto baseball man will be looking for a new job. John Gibbons told the New York Mets he is leaving his role as bench coach as part of a large overhaul of the team&#8217;s coaching staff, the team announced Friday.</p>"
    ],
    "image_url": "",
    "titles": [
      "Mets to Overhaul Coaching Staff After Season Collapse - Sports Illustrated",
      "John Gibbons out as bench coach as Mets overhaul coaching staff"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.662,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.587,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The New York Mets, after not making the playoffs despite having the MLB's highest payroll, are overhauling their staff. John Gibbons, the bench coach, announced his departure from the team as part of this major shake-up.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Jets Rally to Beat Flames 5-4 in Shootout, Pearson Scores Winner",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sat, 04 Oct 2025 04:32:18 +0000",
    "source": "Global News",
    "sources": [
      "Global News"
    ],
    "domains": [
      "globalnews.ca"
    ],
    "snippets": [
      "The Jets rallied from an early three-goal deficit to win their final exhibition game over the Calgary Flames 5-4 in a shootout.",
      "Tanner Pearson scored the winner in the seventh round of a shootout as the visiting Winnipeg Jets erased a 4-2 third-period deficit to beat the Calgary Flames 5-4 in NHL pre-season action on Friday at Scotiabank Saddledome."
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/JETS-CAMP.jpg?quality=65&strip=all",
    "titles": [
      "Winnipeg Jets end pre-season with 5-4 shootout win in Calgary",
      "Jets rally to beat Flames 5-4 in shootout"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.852,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.488,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Winnipeg Jets overcame a 4-2 third-period deficit to defeat the Calgary Flames 5-4 in a shootout during their final pre-season game. Tanner Pearson scored the winning goal in the seventh round of the shootout at Scotiabank Saddledome.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Week 5 Injury Reports Out for Bills, Patriots, Jets, Cowboys",
    "domain": "sports",
    "source_domain": "billswire.usatoday.com",
    "location": "national",
    "published": "Sat, 04 Oct 2025 11:45:33 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "jetswire.usatoday.com",
      "billswire.usatoday.com"
    ],
    "snippets": [
      "Here are the final full injury reports for the Bills and Patriots ahead of their 'Sunday Night Football' game in Week 5.",
      "Here are the full injury reports for the Jets and Cowboys ahead of their Week 5 game."
    ],
    "image_url": "",
    "titles": [
      "Buffalo Bills vs. New England Patriots: Final injury reports for both teams",
      "New York Jets vs. Dallas Cowboys: Final injury reports for both teams"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.99,
      "consensus": 0.37,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.471,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The final injury reports for the Bills, Patriots, Jets, and Cowboys have been released ahead of their respective Week 5 games. These reports detail player injuries and their statuses for the upcoming 'Sunday Night Football' game and Week 5 game, providing essential information for team preparations and fan expectations.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "SportsLine Experts Release College Football Picks for Week 6",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sat, 04 Oct 2025 11:40:30 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com"
    ],
    "snippets": [
      "A closer look at the top games for the sixth week of the 2025 college football season",
      "The SportsLine Projection Model has revealed its Kentucky vs. Georgia SEC matchup on Saturday",
      "The SportsLine projection model has revealed its Navy Midshipmen vs. Air Force Falcons picks for Saturday on CBS and Paramount+",
      "The SportsLine Projection Model has revealed its Wisconsin vs. Michigan Big Ten matchup on Saturday",
      "SportsLine's computer model has revealed its Week 6 college football picks, which include Arch Manning and No. 9 Texas covering against Florida",
      "The SportsLine projection model has revealed its Buffalo vs. New England picks for 'Sunday Night Football' in NFL Week 5",
      "SportsLine expert Jimmie Kaylor has revealed his SJSU Spartans vs. New Mexico Lobos picks, predictions, and best bets for Friday's game",
      "The SportsLine Projection Model has revealed its West Virginia Mountaineers vs. BYU Cougars picks for Friday's Big 12 matchup",
      "The SportsLine Projection Model has made its USF Bulls vs. Charlotte 49ers picks for Friday's AAC matchup",
      "Longtime college football betting expert Bruce Marshall breaks down point spread trends to identify teams worth backing in Week 6"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/10/03/142ed020-61ba-4239-aa99-441b6b37aeb9/carson-beck-t25-picks-1.jpg",
    "titles": [
      "College football picks: Predictions against the spread, odds, betting lines for top 25 games in Week 6",
      "Georgia vs. Kentucky prediction, odds, line, time: 2025 college football Week 6 picks by proven model",
      "Air Force vs. Navy prediction, odds, spread, time: 2025 Week 6 college football picks by proven model",
      "Michigan vs. Wisconsin prediction, odds, line, time: 2025 college football Week 6 picks by proven model",
      "College football odds, picks, predictions for Week 6, 2025: Model backing Texas, Louisville in best bets",
      "Patriots vs. Bills prediction, odds, time: 2025 Week 5 Sunday Night Football picks by proven model",
      "New Mexico vs. San Jose State prediction, odds: 2025 college football Week 6 picks by expert who's up 99 units",
      "BYU vs. West Virginia prediction, odds, line, start time: 2025 college football Week 6 picks by proven model",
      "Charlotte vs. South Florida prediction, odds, line, start time: 2025 college football Week 6 picks by model",
      "College football Week 6 betting notes: Expert finds betting value by analyzing spread trends"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.989,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.466,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "SportsLine experts and the Projection Model have released their picks for upcoming college football games. Emory Hunt has chosen for the New Mexico State vs. Sam Houston, and Jimmie Kaylor for the SJSU Spartans vs. New Mexico Lobos matchups. The Projection Model has made its selections for West Virginia vs. BYU and South Florida vs. Charlotte. Additionally, Thomas Casale has shared his top three college football picks for Week 6, offering a parlay with a potential payout of around +600.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Week 5 Fantasy Football Ratings Out; Ja'Marr Chase Expected to Shine",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sat, 04 Oct 2025 11:45:18 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com"
    ],
    "snippets": [
      "Matchup ratings for every player in Week 5 for Non-PPR leagues",
      "Matchup ratings for every player in Week 5 for PPR leagues",
      "Ja'Marr Chase looks to have a bounce-back game in Week 5"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/25/fe411b29-f119-44b7-ac5c-1b330faf6da2/getty-josh-allen-bills-huddle.jpg",
    "titles": [
      "Fantasy Football 2025 Week 5 Non-PPR Cheat Sheet: Player ratings to guide your toughest lineup calls",
      "Fantasy Football 2025 Week 5 PPR Cheat Sheet: Player ratings to guide your toughest lineup calls",
      "Fantasy Football 2025 Week 5 DFS lineups: Jamey Eisenberg's most rostered, must have player on the slate"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.99,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.466,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Week 5 fantasy football matchup ratings have been released for both Non-PPR and PPR leagues. Additionally, Ja'Marr Chase is anticipated to have a bounce-back performance in Week 5.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]