[
  {
    "title": "Sister of Saskatoon homicide victim speaks out",
    "domain": "general",
    "location": "national",
    "published": "Tue, 20 May 2025 23:55:42 +0000",
    "source": "Global News",
    "sources": [
      "Global News"
    ],
    "snippets": [
      "The identity of one of the two homicide victims in Saskatoon May long weekend has been identified as Matthew Brabant by his sister, Allison Forsberg."
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/05/Saskatoon-homicide-location-May-17.jpg?quality=85&strip=all",
    "titles": [
      "Sister of Saskatoon homicide victim speaks out"
    ],
    "summary": "Over the May long weekend in Saskatoon, two individuals were victims of homicide. One of the victims has been identified as Matthew Brabant, according to his sister, Allison Forsberg. The current status of the investigation or details about the second victim have not been disclosed.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness of a tragic event but does not offer any deeper understanding or insight into the situation, nor does it report on any progress or solutions. The lack of information about the investigation or the second victim also leaves readers with many unanswered questions.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.998,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.525,
    "normalized_score": 2.04
  },
  {
    "title": "Trump says space force general will lead Golden Dome missile defense project – US politics live",
    "domain": "general",
    "location": "global",
    "published": "Tue, 20 May 2025 23:54:16 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "snippets": [
      "<p>Funding for Trump’s missile defense shield idea to protect the US from long-range strikes included in tax bill facing opposition from some Republicans</p><p>These are challenging days for <strong>Florida</strong> governor <strong>Ron DeSantis</strong>, the man who <a href=\"https://www.theguardian.com/us-news/2024/jan/21/ron-desantis-republican-presidential-candidate-dropped-out-analysis\">would have been king</a>. Barely two and a half years since his landslide re-election and anointment as “DeFuture” of the Republican party in a <a href=\"https://nypost.com/cover/november-9-2022/\">fawning New York Post cover</a>, he stands isolated from the national political stage, feuding with his once blindingly loyal Florida legislature, and limping towards the finish line of his second term with an uncertain pathway beyond.</p><p>It has been, in the view of many analysts, a fall of stunning velocity and magnitude. And while few are willing to completely rule out a comeback for a 46-year-old politician who was the darling of the Republican hard right until he dared to challenge <strong>Donald Trump</strong> for his party’s 2024 presidential nomination, it is also clear that everything has changed.</p><p>He’s lost the ability to push things through. He’s lost that luster he had that at one time seemed like he could do no wrong in Republican conservative circles. He’s definitely come back down to earth and some of it is his own doing because if you govern with an autocratic style, that doesn’t usually make you a lot of allies.</p> <a href=\"https://www.theguardian.com/us-news/live/2025/may/20/donald-trump-plane-qatar-immigration-marco-rubio-republicans-democrats-us-politics-live-news-updates\">Continue reading...</a>"
    ],
    "image_url": "https://i.guim.co.uk/img/media/3c4de640dc35a6b3b063c161bb7fb103ae510237/554_0_4402_3521/master/4402.jpg?width=140&quality=85&auto=format&fit=max&s=1e6efcf780078a04a9bfb484388c3f3f",
    "titles": [
      "Trump says space force general will lead Golden Dome missile defense project – US politics live"
    ],
    "summary": "Funding for a missile defense shield proposed by Trump is included in a tax bill currently facing opposition from some Republicans. Meanwhile, Florida Governor Ron DeSantis, once celebrated as a rising star within the party, is experiencing significant political challenges. After a rapid rise and a landslide re-election, DeSantis is now estranged from the national political stage and his state's legislature, with his future uncertain. Analysts note his diminished influence and speculate on his potential for a comeback, highlighting the consequences of his governance style.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful context about the political landscape, including the challenges faced by Florida Governor Ron DeSantis and the proposed missile defense shield. It informs readers about the current state of US politics, but it does not focus on solutions or improvements, nor does it empower readers with actionable insights.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.997,
      "consensus": 0.2,
      "constructiveness": 0.7
    },
    "score": 0.573,
    "normalized_score": 6.7
  },
  {
    "title": "Australia news live: Minns promises fare-free day and independent review into Sydney’s ‘nowhere near good enough’ trains",
    "domain": "general",
    "location": "global",
    "published": "Tue, 20 May 2025 23:52:59 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "snippets": [
      "<p>Wednesday’s power outage at Strathfield still causing delays across the system. Follow today’s news live</p><ul><li><strong>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></strong></li></ul><p><strong>People trapped by flooding as river rise breaks record</strong></p><p>Intense falls and major flooding have hit Australia’s most populous state as a slow-moving system dumps rain, causing a major river to rise to the highest level in almost 100 years.</p> <a href=\"https://www.theguardian.com/australia-news/live/2025/may/21/australia-news-live-sydney-train-delays-taree-nsw-floods-coalition-breakup-david-littleproud-sussan-ley-nationals-liberals-ntwnfb\">Continue reading...</a>",
      "<p>Wednesday’s power outage at Strathfield still causing delays across the system. Follow today’s news live</p><ul><li><strong>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></strong></li></ul><p><strong>People trapped by flooding as river rise breaks record</strong></p><p>Intense falls and major flooding have hit Australia’s most populous state as a slow-moving system dumps rain, causing a major river to rise to the highest level in almost 100 years.</p> <a href=\"https://www.theguardian.com/australia-news/live/2025/may/21/australia-news-live-sydney-train-delays-taree-nsw-floods-coalition-breakup-david-littleproud-sussan-ley-nationals-liberals-ntwnfb\">Continue reading...</a>"
    ],
    "image_url": "https://i.guim.co.uk/img/media/138e300d485730a60ec7415076eafcba1e883a8b/4_244_3475_2780/master/3475.jpg?width=140&quality=85&auto=format&fit=max&s=3500a63b9e5d56f7a5b460defd873ac1",
    "titles": [
      "Australia news live: Minns promises fare-free day and independent review into Sydney’s ‘nowhere near good enough’ trains",
      "Australia news live: Minns promises fare-free day and independent review into Sydney’s ‘nowhere near good enough’ trains"
    ],
    "summary": "A power outage at Strathfield on Wednesday continues to cause delays in the transportation system. Concurrently, Australia's most populous state is experiencing major flooding due to intense rainfall, leading to a significant river rising to its highest level in nearly a century. This has resulted in people being trapped by the floodwaters.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful information about current events in Australia, including the power outage at Strathfield, the major flooding, and the problems with Sydney's trains. It also reports on a proposed solution (a fare-free day and an independent review into the trains). However, it does not provide a deep understanding of the underlying systems or causes of these issues.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.997,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.583,
    "normalized_score": 7.67
  },
  {
    "title": "U.S. Bill Named for Artemis Ghasemzadeh Aims to Shield Asylum Seekers",
    "domain": "general",
    "location": "global",
    "published": "Tue, 20 May 2025 23:49:18 +0000",
    "source": "New York Times",
    "sources": [
      "New York Times"
    ],
    "snippets": [
      "A lawmaker is introducing a bill named for Artemis Ghasemzadeh, an Iranian Christian convert, that seeks to stop the expedited removal of people fleeing countries that persecute religious minorities."
    ],
    "image_url": "https://static01.nyt.com/images/2025/05/20/multimedia/20int-iran-migrant-congress-tqcp/20int-iran-migrant-congress-tqcp-mediumSquareAt3X.jpg",
    "titles": [
      "U.S. Bill Named for Artemis Ghasemzadeh Aims to Shield Asylum Seekers"
    ],
    "summary": "A lawmaker has proposed a bill named after Artemis Ghasemzadeh, an Iranian Christian convert, aiming to prevent the fast-track deportation of individuals escaping from nations known for persecuting religious minorities. This legislative effort seeks to offer protection to those facing persecution on the basis of their religious beliefs, ensuring they have a chance to seek refuge and safety.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it provides useful information about a proposed bill aiming to protect asylum seekers from fast-track deportation. This story highlights a potential solution to a problem, thus empowering readers with knowledge about efforts to improve the situation of persecuted religious minorities.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.996,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.592,
    "normalized_score": 8.54
  },
  {
    "title": "Britain, France and Canada Condemn Israel’s Expansion of Gaza War",
    "domain": "general",
    "location": "global",
    "published": "Tue, 20 May 2025 23:38:50 +0000",
    "source": "New York Times",
    "sources": [
      "New York Times"
    ],
    "snippets": [
      "Britain, France and Canada called the Israeli plans for escalation “disproportionate” and “egregious” at a time when the U.N. is warning the population is at risk of famine."
    ],
    "image_url": "https://static01.nyt.com/images/2025/05/20/multimedia/20int-israel-europeans-01-wmkg/20int-israel-europeans-01-wmkg-mediumSquareAt3X.jpg",
    "titles": [
      "Britain, France and Canada Condemn Israel’s Expansion of Gaza War"
    ],
    "summary": "Britain, France, and Canada criticized Israeli plans for escalation as \"disproportionate\" and \"egregious,\" amid U.N. warnings that the population faces a risk of famine. These statements underscore international concern over the potential humanitarian impact of Israel's actions.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides awareness about the international response to Israel's actions in Gaza. However, it lacks depth and does not provide actionable insights or report on potential solutions to the crisis.",
    "score_components": {
      "magnitude": 0.429,
      "recency": 0.994,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.57,
    "normalized_score": 6.41
  },
  {
    "title": "Tennessee's Zakai Zeigler files lawsuit against NCAA, challenging redshirt rule for 5th year of eligilbility",
    "domain": "sports",
    "location": "national",
    "published": "Tue, 20 May 2025 23:51:11 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "snippets": [
      "Zeigler did not receive because he did not redshirt and is arguing that is costing him a fifth year that is &quot;the most lucrative&quot; for NIL earnings."
    ],
    "image_url": "",
    "titles": [
      "Tennessee's Zakai Zeigler files lawsuit against NCAA, challenging redshirt rule for 5th year of eligilbility"
    ],
    "summary": "Zeigler is contesting the loss of a potentially lucrative fifth year of eligibility because he did not take a redshirt year. He argues this decision is negatively impacting his Name, Image, and Likeness (NIL) earnings opportunities, which are typically highest in an athlete's fifth year.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story offers useful information about a legal challenge to NCAA rules, which could potentially impact other athletes. It provides context about the issue, informing readers about the potential financial implications of the redshirt rule. However, it does not highlight a clear solution or progress towards one.",
    "score_components": {
      "magnitude": 0.469,
      "recency": 0.997,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.607,
    "normalized_score": 10.0
  },
  {
    "title": "Indianapolis Colts' 2025 UDFA profiles: UAB DE Desmond Little",
    "domain": "sports",
    "location": "national",
    "published": "Tue, 20 May 2025 23:48:25 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "snippets": [
      "Let's take a closer look at each of the Colts' UDFAs. Up next is UAB defensive end Desmond Little."
    ],
    "image_url": "",
    "titles": [
      "Indianapolis Colts' 2025 UDFA profiles: UAB DE Desmond Little"
    ],
    "summary": "The Indianapolis Colts have signed Desmond Little, a defensive end from the University of Alabama at Birmingham (UAB), as an undrafted free agent (UDFA). Little's addition to the Colts' roster is part of the team's efforts to strengthen their defense by bringing in new talent following the NFL Draft.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information about the Indianapolis Colts' recruitment strategy and the addition of a new player to their roster. However, it does not delve into the potential impacts or implications of this decision, nor does it offer any solutions or innovations.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.996,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.534,
    "normalized_score": 2.91
  },
  {
    "title": "São Paulo set to seal last-16 spot against Náutico",
    "domain": "sports",
    "location": "national",
    "published": "Tue, 20 May 2025 23:47:00 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "snippets": [
      "This article was translated into English by Artificial Intelligence. You can read the original version in 🇧🇷 here.Náutico and São Paulo are lined up for this Tuesday's (20) match in the third ..."
    ],
    "image_url": "",
    "titles": [
      "São Paulo set to seal last-16 spot against Náutico"
    ],
    "summary": "Náutico and São Paulo are scheduled to play a match on Tuesday, 20th. The article detailing this event was translated into English using Artificial Intelligence. The original version is available in Portuguese.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "The story offers basic awareness about an upcoming match between Náutico and São Paulo, but it does not provide any deeper insight or analysis. It also does not report on any progress, solutions, or improvements.",
    "score_components": {
      "magnitude": 0.359,
      "recency": 0.996,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.512,
    "normalized_score": 0.78
  },
  {
    "title": "Don't let Neal Shipley's unpretentious vibe fool you — he's at Schwab Challenge to win",
    "domain": "sports",
    "location": "national",
    "published": "Tue, 20 May 2025 23:45:38 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "snippets": [
      "Neal Shipley's devil-may-care approach to 18 holes can give the impression that the Ohio State product doesn't have a competitive temperament."
    ],
    "image_url": "",
    "titles": [
      "Don't let Neal Shipley's unpretentious vibe fool you — he's at Schwab Challenge to win"
    ],
    "summary": "Neal Shipley, an Ohio State alumnus, displays a carefree attitude during his golf games, which may lead observers to question his competitive nature. However, this perception is based on his approach to playing 18 holes and does not necessarily reflect his overall temperament or competitiveness in the sport.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story provides some insight into the mindset and approach of golfer Neal Shipley, which could be useful for fans or other golfers. However, it doesn't provide any actionable insights or report on any solutions, improvements, or innovations.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.995,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.524,
    "normalized_score": 1.94
  },
  {
    "title": "Anthony Edwards' Pregame Decision for Game 1 of Timberwolves-Thunder Turns Heads",
    "domain": "sports",
    "location": "national",
    "published": "Tue, 20 May 2025 23:43:52 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "snippets": [
      "As Anthony Edwards traverses his way through the 2025 NBA playoffs, he continues to show the basketball world why he's capable of being the face of the league (even if he doesn't want to be).  Edwards and the Minnesota Timberwolves have eliminated two surefire Hall-of-Famers in LeBron James and Stephen Curry in back-to-back series'.  Edwards, at just 23 years of age, continues to show the world his ceiling is still unknown in his fifth season."
    ],
    "image_url": "",
    "titles": [
      "Anthony Edwards' Pregame Decision for Game 1 of Timberwolves-Thunder Turns Heads"
    ],
    "summary": "During the 2025 NBA playoffs, Anthony Edwards, at 23 years old, has made a significant impact by leading the Minnesota Timberwolves to victories over teams led by LeBron James and Stephen Curry, both regarded as future Hall-of-Famers. This performance in his fifth season has highlighted Edwards' potential and capability to be a leading figure in the league, underscoring his rising status despite his personal reservations about being the face of the NBA.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about the player's performance and his potential influence in the NBA. However, it lacks depth or insight into how this impacts the sport, the team, or the reader.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.995,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.504,
    "normalized_score": 0.0
  },
  {
    "title": "Jim Cramer explains how bonds shaped Tuesday's market action",
    "domain": "business",
    "location": "national",
    "published": "Tue, 20 May 2025 23:34:24 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "snippets": [
      "CNBC's Jim Cramer examined Tuesday's market action and said rising bond yields drove a number of stock moves."
    ],
    "image_url": "",
    "titles": [
      "Jim Cramer explains how bonds shaped Tuesday's market action"
    ],
    "summary": "Jim Cramer, a CNBC commentator, analyzed the stock market's performance on Tuesday, attributing a series of stock movements to the increase in bond yields.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is useful as it provides an analysis of the stock market's performance in relation to bond yields. It could help readers make informed decisions about their investments, even though it doesn't necessarily report on solutions or improvements.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.993,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.582,
    "normalized_score": 7.57
  },
  {
    "title": "Fortnite approved by Apple, returns to U.S. App Store 5 years after removal",
    "domain": "business",
    "location": "national",
    "published": "Tue, 20 May 2025 22:59:40 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "snippets": [
      "Fortnite was kicked off the App Store in 2020 and is finally available again for iPhone users."
    ],
    "image_url": "",
    "titles": [
      "Fortnite approved by Apple, returns to U.S. App Store 5 years after removal"
    ],
    "summary": "In 2020, Fortnite was removed from the App Store, but it has now been made available again for iPhone users. This marks the return of the popular game to Apple's platform after a hiatus.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness about the return of Fortnite to the App Store. However, it doesn't provide deeper insights into why it was removed in the first place, what changes led to its return, or what this means for users or the gaming industry.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.985,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.541,
    "normalized_score": 3.59
  },
  {
    "title": "Trump unveils plans for 'Golden Dome' missile defense system",
    "domain": "business",
    "location": "national",
    "published": "Tue, 20 May 2025 22:42:46 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "snippets": [
      "President Donald Trump wants to create a missile defense shield system for the United States that is akin to Israel's Iron Dome."
    ],
    "image_url": "",
    "titles": [
      "Trump unveils plans for 'Golden Dome' missile defense system"
    ],
    "summary": "President Donald Trump has proposed the creation of a missile defense system for the United States, similar to Israel's Iron Dome. This system aims to protect the country from missile threats.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "The story provides useful information about a proposed missile defense system, which can contribute to the reader's understanding of national security matters. However, it does not report on any progress or solutions, nor does it increase awareness around systems, causes, trends, or impacts.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.981,
      "consensus": 0.2,
      "constructiveness": 0.7
    },
    "score": 0.568,
    "normalized_score": 6.21
  },
  {
    "title": "Tesla and xAI Plan to Keep Buying Chips From Nvidia and AMD, Musk Says",
    "domain": "business",
    "location": "global",
    "published": "Tue, 20 May 2025 22:31:02 GMT",
    "source": "Investopedia",
    "sources": [
      "Investopedia"
    ],
    "snippets": [
      "<figure><img alt=\"LIONEL BONAVENTURE / Getty Images Elon Musk said xAI plans to build a facility near Memphis that will house 1 million GPUs\" src=\"https://www.investopedia.com/thmb/-pu084dOnngYWtyYhnSbc5aH4sE=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2193208237-65a8719308b24382b2ffc9c730326d7e.jpg\" title=\"Screens displaying the xAI logo, the Grok logo, and Elon Musk's face.\" /><figcaption><i><p>LIONEL BONAVENTURE / Getty Images</p> Elon Musk said xAI plans to build a facility near Memphis that will house 1 million GPUs</i></figcaption></figure><br /><h3>Key Takeaways</h3><ul><li>Elon Musk expects Tesla and xAI to continue buying chips from Nvidia and Advanced Micro Devices, the CEO said in an interview with <em>CNBC</em> Tuesday.</li><li>Musk said xAI is planning to build a facility near Memphis that will house 1 million GPUs. </li><li>Meanwhile, Tesla requires “quite a few” GPUs to train its Optimus humanoid robots, the CEO said.</li></ul><br /><br /><p>Elon Musk expects Tesla (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;TSLA\">TSLA</a>) and xAI to continue buying chips from Nvidia (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;NVDA\">NVDA</a>) and Advanced Micro Devices (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;AMD\">AMD</a>), the CEO said in an interview with <em>CNBC </em>Tuesday.<span class=\"ql-inline-citation\"></span></p><p>Musk said xAI, the company behind the Grok large language model, plans to build a facility near Memphis that will house 1 million GPUs. The X platform parent has already installed 200,000 chips at an existing facility in the area, Musk said. </p><p>Meanwhile, Tesla needs “quite a few” GPUs for training its Optimus <a href=\"https://www.investopedia.com/tesla-valuation-problem-could-get-worse-before-it-gets-better-morgan-stanley-says-11738491\">humanoid robots</a>, Musk said. “We expect to still buy a lot of GPUs from Nvidia, some from AMD, and maybe from others,” Musk said. “So long as Nvidia is better than what we make, we'll keep buying from Nvidia.”</p><p>Nvidia, which saw its shares surge over the past week after <a href=\"https://www.investopedia.com/nvidia-returns-to-usd3-trillion-club-as-stock-surges-on-saudi-ai-partnership-11734094\">announcing a major deal</a> to supply chips to Saudi AI startup Humain, is due to report earnings next week.<span class=\"ql-inline-citation\"></span> Shares of AMD and Tesla had also <a href=\"https://www.investopedia.com/tesla-stock-rises-for-fourth-week-in-a-row-11736251\">rallied last week</a> amid optimism that a series of AI partnerships announced during President Donald Trump's four-day trip to the Middle East <a href=\"https://www.investopedia.com/nvidia-and-other-ai-stocks-climb-as-saudi-deals-raise-expectations-of-more-to-come-11734578\">could mean more deals to come</a>.<br /></p><p>In a separate interview Tuesday, Musk told attendees of the Qatar Economic Forum he <a href=\"https://www.investopedia.com/elon-musk-says-he-plans-to-stay-tesla-s-ceo-for-next-5-years-11738240\">remains committed</a> to being CEO of the electric vehicle maker for at least the next five years.</p><p>Shares of Tesla, AMD, and Nvidia were little-changed in after-hours trading, after Tesla eked out a 0.5% gain during Tuesday's regular session, while AMD and Nvidia lost about 1%.</p>"
    ],
    "image_url": "https://www.investopedia.com/thmb/-pu084dOnngYWtyYhnSbc5aH4sE=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2193208237-65a8719308b24382b2ffc9c730326d7e.jpg",
    "titles": [
      "Tesla and xAI Plan to Keep Buying Chips From Nvidia and AMD, Musk Says"
    ],
    "summary": "Elon Musk announced plans for xAI, a company linked to the X platform, to construct a facility near Memphis to accommodate 1 million GPUs, complementing the 200,000 already installed in the area. This development is part of a broader strategy where Tesla and xAI will continue purchasing chips from Nvidia and Advanced Micro Devices (AMD) to support projects, including Tesla's Optimus humanoid robots. Musk emphasized the ongoing need for Nvidia's GPUs, citing their superiority for Tesla's requirements. Meanwhile, shares of Tesla, AMD, and Nvidia showed minimal changes in after-hours trading, fol",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive as it provides useful insights into the strategies of Tesla and xAI, and their continued reliance on Nvidia and AMD chips. It also reports on the progress of these companies in terms of infrastructure development and project support. It increases awareness around the trends in the tech industry and the impacts of these strategies on the market.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.978,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.587,
    "normalized_score": 8.06
  },
  {
    "title": "Watch These Strategy Price Levels as Stock Continues to Surge Alongside Bitcoin",
    "domain": "business",
    "location": "global",
    "published": "Tue, 20 May 2025 22:27:20 GMT",
    "source": "Investopedia",
    "sources": [
      "Investopedia"
    ],
    "snippets": [
      "<figure><img alt=\"Source: TradingView.com\" src=\"https://www.investopedia.com/thmb/mbOEcmwcMrV68-PAOrhN4KMcAAs=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/MSTRChart-3dbc7aae87b74f6399f72e8967858c74.jpg\" title=\"This image depicts the MSTR chart.\" /><figcaption><i>Source: TradingView.com</i></figcaption></figure><br /><h3>Key Takeaways</h3><ul><li>Shares of Strategy, the world's largest corporate holder of bitcoin, have soared 75% from their April low, tracking a recovery in the cryptocurrency and other risk-on assets. </li><li>The stock has climbed back toward its record high following a retracement to the 50-day moving average in March.</li><li>Investors should watch key overhead areas on Strategy's chart around $440 and $945, while also monitoring crucial support levels near $230 and $180.</li></ul><br /><br /><p>Shares of Strategy (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;mstr\">MSTR</a>), the world's largest corporate holder of bitcoin that until recently was known as MicroStrategy, rose again Tuesday as the digital currency continued rising.</p><p>The stock, which provides investors with a leverage bet on bitcoin's price, had gotten a boost to start the week after the company announced its latest purchase of the cryptocurrency. According to a regulatory filing on Monday, Strategy purchased 7,390 bitcoin between May 12 and 18, taking its total holding to 576,230 BTC, currently worth more about $61 billion based on bitcoin's recent price.<span class=\"ql-inline-citation\"></span></p><p>Strategy shares have soared 75% from their April low, tracking a recovery in the price of bitcoin and other <a href=\"https://www.investopedia.com/terms/r/risk-on-risk-off.asp\">risk-on</a> assets as investor concerns about global trade tensions and their potential economic impact have subsided. Bitcoin surged above $107,000 on Tuesday, hitting its highest level since January and approaching its record high of just over $109,000.</p><p>Below, we take a closer look at Strategy’s <a href=\"https://www.investopedia.com/terms/w/weeklychart.asp\">weekly chart</a> and apply <a href=\"https://www.investopedia.com/terms/t/technicalanalysis.asp\">technical analysis</a> to point out key price levels that investors will likely be watching.</p><h2>Record High Remains in Focus</h2><p>Since the <a href=\"https://www.investopedia.com/ask/answers/012815/why-50-simple-moving-average-sma-so-common-traders-and-analysts.asp\">50-day moving average (MA)</a> crossed above the 200-day MA in January last year to form a bullish <a href=\"https://www.investopedia.com/terms/g/goldencross.asp\">golden cross</a> pattern, Strategy shares have continued to trend sharply higher. </p><p>More recently, the stock has climbed back toward its <a href=\"https://www.investopedia.com/terms/r/record_high.asp\">record high</a> throughout April and May following a retracement to the 50-day MA in March. However, it's worth noting this move has occurred on significantly less <a href=\"https://www.investopedia.com/ask/answers/041015/why-trading-volume-important-investors.asp\">trading volume</a> than the two most prior <a href=\"https://www.investopedia.com/terms/u/uptrend.asp\">uptrends</a>, indicating that larger market participants may remain on the sidelines.</p><p>Let’s identify two key overhead areas on Strategy’s chart to watch if the shares continue their bullish move, while also locating crucial <a href=\"https://www.investopedia.com/terms/s/support.asp\">support levels</a> worth monitoring during <a href=\"https://www.investopedia.com/terms/c/correction.asp\">corrections</a>.</p><h2>Key Overhead Areas to Watch</h2><p>A move higher from current levels could bring the $440 level into play. This area may provide overhead <a href=\"https://www.investopedia.com/terms/r/resistance.asp\">resistance</a> near a brief consolidation period that developed on the chart shortly after the stock set its <a href=\"https://www.investopedia.com/terms/r/record_high.asp\">record high</a> last November.</p><p>To forecast an overhead area to watch if the shares move into <a href=\"https://www.investopedia.com/terms/p/pricediscovery.asp\">price discovery</a> mode, investors can use the bars pattern tool. We apply this technique by taking the price bars from the stock’s <a href=\"https://www.investopedia.com/terms/t/trending-market.asp\">trending</a> move from September to November and reposition them from the start of the current uptrend. This analysis, which predicts how a move higher may play out if <a href=\"https://www.investopedia.com/terms/p/price-action.asp\">price action</a> rhymes, projects an upside target of around $945.</p><h2>Crucial Support Levels Worth Monitoring</h2><p>During a correction in the stock, investors should initially monitor the $230 level. This location on the chart could attract buying interest near the February and March <a href=\"https://www.investopedia.com/trading/peak-and-trough-analysis/\">troughs</a>, and also closely aligns with a slight pause in the stock’s uptrend during late October.</p><p>Finally, a more significant drop could see Strategy shares test lower support around $180. Investors may may look to place buy <a href=\"https://www.investopedia.com/terms/l/limitorder.asp\">limit orders</a> in this region near a trendline that links three peaks that formed on the chart between March and July last year.</p><p><em>The comments, opinions, and analyses expressed on Investopedia are for informational purposes only. Read our <a href=\"https://www.investopedia.com/legal-4768893#toc-warranty-and-liability-disclaimer\">warranty and liability disclaimer</a> for more info.</em></p><p><em>As of the date this article was written, the author does not own any of the above securities.</em><br /></p>"
    ],
    "image_url": "https://www.investopedia.com/thmb/mbOEcmwcMrV68-PAOrhN4KMcAAs=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/MSTRChart-3dbc7aae87b74f6399f72e8967858c74.jpg",
    "titles": [
      "Watch These Strategy Price Levels as Stock Continues to Surge Alongside Bitcoin"
    ],
    "summary": "Shares of Strategy (formerly known as MicroStrategy), the world's largest corporate holder of bitcoin, have seen a significant increase, rising 75% from their April low. This surge aligns with the recovery of bitcoin and other risk-on assets, with Strategy's stock climbing back toward its record high. The company recently boosted its bitcoin holdings by purchasing an additional 7,390 BTC, bringing its total to 576,230 BTC, valued at about $61 billion. Investors are advised to watch for key resistance levels at $440 and $945, and support levels at $230 and $180, as these could indicate future p",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The story provides useful insights for investors about the performance of Strategy's stock and its correlation with bitcoin. It also provides actionable advice on key resistance and support levels. However, it does not clearly highlight solutions or progress, nor does it significantly increase awareness about the broader systems or causes behind these trends.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.977,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.569,
    "normalized_score": 6.31
  },
  {
    "title": "How the US military wants to use the world's largest aircraft",
    "domain": "science",
    "location": "global",
    "published": "Tue, 20 May 2025 23:00:27 +0100",
    "source": "New Scientist",
    "sources": [
      "New Scientist"
    ],
    "snippets": [
      "The world’s largest aircraft, called WindRunner, is being designed to carry huge wind turbine blades – but the US military is looking into its own applications for the proposed plane"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/05/20200534/SEI_252271169.jpg",
    "titles": [
      "How the US military wants to use the world's largest aircraft"
    ],
    "summary": "The WindRunner, the world's largest aircraft in development, is intended to transport massive wind turbine blades. Additionally, the US military is exploring potential uses for this proposed plane, indicating a dual interest in its capabilities for both renewable energy and defense applications.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it provides useful insights into the dual-purpose potential of the WindRunner aircraft. It informs readers about the intersection of renewable energy and defense applications, which can contribute to their understanding of how technology can be utilized in different sectors.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.971,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.575,
    "normalized_score": 6.89
  },
  {
    "title": "Galaxy Clusters Should Be Cold – XRISM Just Found Out Why They’re Not",
    "domain": "science",
    "location": "global",
    "published": "Tue, 20 May 2025 20:33:07 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/galaxy-clusters-should-be-cold-xrism-just-found-out-why-theyre-not/\" rel=\"nofollow\" title=\"Galaxy Clusters Should Be Cold – XRISM Just Found Out Why They’re Not\"><img alt=\"Galaxy Cluster Heart Art\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Galaxy-Cluster-Heart-Art-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>Astronomers may have finally cracked one of the universe’s long-standing puzzles: why galaxy clusters remain mysteriously warm despite constantly losing energy through X-rays. Using Japan’s XRISM satellite, scientists observed a fast, swirling flow of superheated gas in the Centaurus cluster. This gentle but powerful motion appears to redistribute heat throughout the cluster, acting like a [...]"
    ],
    "image_url": "",
    "titles": [
      "Galaxy Clusters Should Be Cold – XRISM Just Found Out Why They’re Not"
    ],
    "summary": "Astronomers have discovered why galaxy clusters stay warm, solving a long-standing cosmic mystery. Using Japan's XRISM satellite, they observed a fast, swirling flow of superheated gas in the Centaurus cluster. This motion redistributes heat throughout the cluster, preventing it from cooling down despite losing energy through X-rays.",
    "constructiveness_score": 1.0,
    "constructiveness_reason": "The story clearly highlights a scientific breakthrough, offering empowering knowledge about the universe. It provides a deeper understanding of galaxy clusters, solving a long-standing cosmic mystery. This information can be useful for those interested in astronomy or the natural sciences.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.951,
      "consensus": 0.2,
      "constructiveness": 1.0
    },
    "score": 0.581,
    "normalized_score": 7.48
  },
  {
    "title": "NASA’s Perseverance Snaps Rare, Eerie View of Mars’ Tiny Moon Before Sunrise",
    "domain": "science",
    "location": "global",
    "published": "Tue, 20 May 2025 20:08:54 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/nasas-perseverance-snaps-rare-eerie-view-of-mars-tiny-moon-before-sunrise/\" rel=\"nofollow\" title=\"NASA’s Perseverance Snaps Rare, Eerie View of Mars’ Tiny Moon Before Sunrise\"><img alt=\"Perseverance Views Deimos Before Sunrise\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"583\" src=\"https://scitechdaily.com/images/Perseverance-Views-Deimos-Before-Sunrise-777x583.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>Perseverance caught a hauntingly beautiful glimpse of Mars’ tiny moon Deimos rising in the pre-dawn sky, using a long-exposure shot stitched from 16 images. At 4:27 a.m. local time on March 1, 2025, NASA’s Perseverance rover captured a striking view of Deimos, the smaller of Mars’ two moons, glowing faintly in the pre-dawn sky. It [...]"
    ],
    "image_url": "",
    "titles": [
      "NASA’s Perseverance Snaps Rare, Eerie View of Mars’ Tiny Moon Before Sunrise"
    ],
    "summary": "NASA's Perseverance rover captured a rare and striking image of Deimos, Mars' smaller moon, using a long-exposure technique. This image, made from 16 stitched photos, shows Deimos rising in the pre-dawn sky on Mars at 4:27 a.m. local time on March 1, 2025. The photo offers a hauntingly beautiful view of the tiny moon, showcasing NASA's ongoing exploration and study of Mars and its celestial surroundings.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "While this story offers a fascinating glimpse into space exploration, its constructive value is somewhat limited. It provides a unique view of Mars' moon Deimos, contributing to the public's understanding of Mars and its celestial surroundings. However, it doesn't necessarily offer actionable insights or report on solutions or improvements.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.945,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.539,
    "normalized_score": 3.4
  },
  {
    "title": "NASA Just Found New Signs of Life Inside Venus – Geologic Life, That Is",
    "domain": "science",
    "location": "global",
    "published": "Tue, 20 May 2025 19:43:55 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/nasa-just-found-new-signs-of-life-inside-venus-geologic-life-that-is/\" rel=\"nofollow\" title=\"NASA Just Found New Signs of Life Inside Venus – Geologic Life, That Is\"><img alt=\"Venus Active Volcano\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"437\" src=\"https://scitechdaily.com/images/Venus-Active-Volcano-777x437.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>New research reveals that Venus may still be geologically alive, with massive circular features pointing to hot plumes stirring deep beneath its crust. Vast, circular features on the surface of Venus may be signs that the planet is still geologically active. That’s according to new research based on data collected over 30 years ago by [...]"
    ],
    "image_url": "",
    "titles": [
      "NASA Just Found New Signs of Life Inside Venus – Geologic Life, That Is"
    ],
    "summary": "New research, based on data from over 30 years ago, suggests Venus is geologically active. Scientists have identified large, circular features on Venus's surface as potential signs of hot plumes stirring beneath its crust, indicating the planet may still have active geology.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it provides useful insights into the field of astrogeology, specifically about Venus. It increases awareness about the planet's potential geological activity, which could be important for future space exploration and scientific understanding. However, it doesn't explicitly report on solutions, improvements or innovations.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.939,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.557,
    "normalized_score": 5.15
  },
  {
    "title": "On the origin (and fate) of plants that never bloom",
    "domain": "science",
    "location": "global",
    "published": "Tue, 20 May 2025 19:10:01 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "snippets": [
      "Plants that reproduce exclusively by self-pollination arise from populations with extremely low diversity to begin with. Kobe University research not only adds a facet to possible evolutionary strategies, but also lends weight to Darwin's suspicion that this strategy might be a path to extinction."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/on-the-origin-and-fate.jpg",
    "titles": [
      "On the origin (and fate) of plants that never bloom"
    ],
    "summary": "Kobe University research found that plants which reproduce only through self-pollination originate from populations with very low diversity. This discovery supports Charles Darwin's theory that such reproductive strategies could lead to extinction, providing new insight into evolutionary strategies.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive. It provides a deeper understanding of plant evolution and reproduction, supporting a theory proposed by Charles Darwin. This knowledge could be useful for botanists, ecologists, and the general public interested in biology. It also indirectly highlights the importance of biodiversity for the survival of species.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.932,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.565,
    "normalized_score": 5.92
  }
]