[
  {
    "title": "Sean \"Diddy\" Combs Sentenced to Over 4 Years for Prostitution Charges",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Fri, 03 Oct 2025 17:17:13 -0400",
    "source": "NPR",
    "sources": [
      "CityNews",
      "The Guardian",
      "Al Jazeera",
      "NPR",
      "Axios",
      "Deutsche Welle"
    ],
    "domains": [
      "www.theguardian.com",
      "news.google.com",
      "www.npr.org",
      "www.dw.com",
      "www.aljazeera.com",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "Combs had been convicted in July on two counts of transportation for prostitution. During his sentencing hearing he spoke at length for the first time in the trial, addressing the judge at length.",
      "The famed hip-hop mogul told the court that his actions were &#039;disgusting&#039; and &#039;shameful&#039; in a plea for leniency.",
      "The US rapper and record producer was convicted over sexual encounters, capping a sordid federal case that featured harrowing testimony. The judge said \"these were serious offenses that irreparably harmed two women.\"",
      "<a href=\"https://news.google.com/rss/articles/CBMihwFBVV95cUxNNGVad0ZMd0hIWDZMV1dpdmxQZ2tTdTM2UncxRlMtLWlGdkM2aEZrMHEwb3dCejM2RGRiYXFmcW5XTHdRQ2VFcEJaX0YxYlphV2hLNzd6UlpKUTd2OGtpenNxM3laXzVLYnVvS3I2bXI1US1yc0IxaUxHRGZHQkVnVF9nQkc3Um8?oc=5\" target=\"_blank\">Sean \"Diddy\" Combs sentenced to four years f",
      "<p>Combs, who was convicted of ‘transportation to engage in prostitution’, sentenced in New York</p><p><strong>The prosecution <a href=\"https://viewer.gutools.co.uk/us-news/2025/sep/30/sean-diddy-combs-sentence-recommendation\">submitted several victim impact </a>statements to the court ahead of sent",
      "<p>Federal prosecutors had pushed for a jail term of 11 years and three months of a possible 20 after music mogul’s conviction</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/live/2025/oct/03/sean-diddy-combs-sentencing-trial-conviction-latest-updates\">Sean ‘Diddy’ Combs sentencing – live",
      "NEW YORK (AP) — Sean ‘Diddy’ Combs was sentenced Friday to 4 years and 2 months in prison in case involving sex workers, violence and “freak-offs.” The judge said a lengthy sentence was needed for deterrence and that he was unconvinced that if Combs is released these crimes won’t happen again. Combs"
    ],
    "image_url": "",
    "titles": [
      "Sean Combs sentenced to over four years in prison for prostitution-related charges",
      "Musician Sean ‘Diddy’ Combs sentenced to four years in prison after apology",
      "US: Sean 'Diddy' Combs sentenced to over 4 years in prison",
      "Sean \"Diddy\" Combs sentenced to four years for prostitution charges - Axios",
      "Sean ‘Diddy’ Combs sentenced to more than four years in prison and given $500,000 fine – live updates",
      "Sean ‘Diddy’ Combs sentenced to more than four years in prison on prostitution-related charges",
      "Sean ‘Diddy’ Combs is sentenced to over 4 years in prison"
    ],
    "score_components": {
      "magnitude": 0.986,
      "recency": 0.941,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.858,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Sean \"Diddy\" Combs was sentenced to 4 years and 2 months in prison after being convicted on two counts of transportation for prostitution. In his trial, he admitted his actions were \"disgusting\" and \"shameful.\" Despite his plea for leniency and the prosecution's push for a longer sentence of 11 years and three months, the judge determined the crimes caused irreparable harm to two women and emphasized the need for a lengthy sentence to serve as a deterrent.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Hamas Agrees to Release Hostages, Engages in Peace Talks with Trump's Plan",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Fri, 03 Oct 2025 12:26:36 -0400",
    "source": "NPR",
    "sources": [
      "CityNews",
      "Financial Times",
      "The Guardian",
      "Fortune",
      "New York Times",
      "NPR",
      "Axios"
    ],
    "domains": [
      "www.theguardian.com",
      "news.google.com",
      "fortune.com",
      "www.nytimes.com",
      "www.npr.org",
      "ottawa.citynews.ca",
      "www.ft.com"
    ],
    "snippets": [
      "Hamas said it would agree to release the remaining Israeli hostages in exchange for Palestinian prisoners. Despite not agreeing to the full U.S. peace proposal, President Trump said the group seemed ready for peace.",
      "<a href=\"https://news.google.com/rss/articles/CBMif0FVX3lxTE1vUzN3NUNhdW5KdGZNLW0tdndmRk0tU3p3aDhxMkdHLW84YVJCTGR0RnFvTl8zVHNLU090NTBfMEpzN3JFbUQ1VERoV1phR1RRX1g0QXhnWmk3ektQTFdNZFBDcm8ydERPWVI3U01vaGZfMHR5cy1jTm5qV1NYLVE?oc=5\" target=\"_blank\">Trump tells Israel to stop bombing Gaza after Hamas resp",
      "US president says he ‘believes’ Palestinian militant group is ‘ready for a lasting peace’",
      "<p>Palestinian militant group accepts part of US president’s plan but seeks further negotiations on many terms</p><p>Donald Trump ordered Israel to “immediately” stop bombing Gaza as he welcomed Hamas’s partial acceptance of his ultimatum to end the nearly two-year war.</p><p>Hamas has agreed to rel",
      "<p>Donald Trump welcomes response from Hamas to his Gaza plan despite group saying further negotiations are required over details</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/oct/02/hamas-likely-to-accept-trump-peace-plan-with-key-revisions-experts-say\">Hamas could ask for revisions",
      "Hamas said it would release the Israeli hostages but wanted to negotiate elements of the Trump plan. Later, in a video, President Trump said, “Everybody was unified in wanting this war to end and seeing peace in the Middle East, and we’re very close to achieving that.”",
      "President Trump said he believed Hamas was “ready for a lasting peace” after the militant group offered to release hostages and discuss the U.S.-led peace proposal.",
      "Hamas said it was willing to release the hostages and hand over power to other Palestinians, but that other aspects of the plan require further consultations among Palestinians.",
      "DEIR AL-BALAH, Gaza Strip (AP) — U.S. President Donald Trump on Friday ordered Israel to stop bombing the Gaza Strip after Hamas said it had accepted some elements of his plan to end the nearly two-year war and return all the remaining hostages taken in the Oct. 7, 2023, attack. Hamas said it was wi"
    ],
    "image_url": "",
    "titles": [
      "Trump tells Israel to stop bombing Gaza after Hamas agrees to release Israeli hostages",
      "Trump tells Israel to stop bombing Gaza after Hamas responds to peace plan - Axios",
      "Trump tells Israel to stop bombing Gaza after Hamas agrees to release hostages",
      "Donald Trump orders Israel to ‘immediately’ stop bombing Gaza as Hamas agrees to free hostages",
      "Trump says Hamas is ready for peace and Israel ‘must immediately stop bombing of Gaza’ – live",
      "Live Updates: Trump Says Hamas Is Ready for Peace and Tells Israel to Stop Bombing",
      "Trump Calls on Israel to Stop Bombing Gaza After Hamas Agrees to Parts of Cease-Fire Plan",
      "Trump orders Israel to stop bombing Gaza after Hamas partially accepts his peace plan",
      "Trump orders Israel to stop bombing Gaza after Hamas partially accepts his peace plan"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.851,
      "consensus": 1.0,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.855,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Hamas has agreed to release Israeli hostages and accepted parts of President Trump's peace plan to end the nearly two-year war, but seeks further negotiations on many terms. Trump has ordered Israel to immediately stop bombing Gaza, signaling a potential move towards peace. Despite not fully agreeing to the U.S. proposal, Hamas's willingness to discuss the plan and release hostages has been acknowledged by Trump as a step towards achieving lasting peace in the Middle East.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Supreme Court Backs Trump Policy, Ends Protections for 300K Immigrants",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 21:48:49 +0000",
    "source": "Al Jazeera",
    "sources": [
      "The Guardian",
      "Al Jazeera",
      "Washington Post",
      "LA Times",
      "Forbes"
    ],
    "domains": [
      "www.forbes.com",
      "www.latimes.com",
      "www.theguardian.com",
      "www.aljazeera.com",
      "www.washingtonpost.com"
    ],
    "snippets": [
      "The US court&#039;s conservative supermajority once again backed Trump&#039;s efforts to limit temporary immigration pathways.",
      "<p>Justices’ order puts on hold lower-court ruing that found officials had wrongly ended temporary protected status</p><p>The <a href=\"https://www.theguardian.com/us-news/us-supreme-court\">US supreme court</a> on Friday allowed Donald Trump’s administration to strip legal protections from more than ",
      "A federal judge had ruled on Sept. 5 that Homeland Security Secretary Kristi L. Noem broke the law by revoking the temporary protected status of Venezuelan and Haitian immigrants.",
      "<p>Trump's lawyers said the new administration had the right to cancel Biden's temporary protections for immigrants</p>",
      "The Supreme Court, in a 6-3 split, granted another emergency request to revoke Temporary Protected Status to about 300,000 Venezuelans."
    ],
    "image_url": "",
    "titles": [
      "Supreme Court allows Trump to nix temporary status for Venezuelan migrants",
      "US supreme court allows Trump to strip temporary status from Venezuelans",
      "Supreme Court will let Trump end protected status for Venezuelans for now",
      "Supreme Court says again Trump may cancel temporary protections for Venezuelans granted under Biden",
      "Supreme Court Lets Trump Administration End Protections For Venezuelan Immigrants"
    ],
    "score_components": {
      "magnitude": 0.964,
      "recency": 0.952,
      "consensus": 0.995,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.837,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The US Supreme Court, with a conservative supermajority, supported the Trump administration's move to revoke Temporary Protected Status for Venezuelan and Haitian immigrants, affecting about 300,000 individuals. This decision came after a lower court had ruled that Homeland Security Secretary Kristi L. Noem's cancellation of the protections was unlawful. The court's 6-3 split decision temporarily halts the lower court's ruling.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "U.S. Strike Kills 4 on Suspected Drug Boat in Caribbean",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 20:07:02 +0000",
    "source": "Al Jazeera",
    "sources": [
      "The Guardian",
      "New York Times",
      "Al Jazeera",
      "Washington Post",
      "Deutsche Welle"
    ],
    "domains": [
      "www.theguardian.com",
      "www.nytimes.com",
      "www.dw.com",
      "www.aljazeera.com",
      "www.washingtonpost.com"
    ],
    "snippets": [
      "The US has released video it says shows its military striking a boat near the coast of Venezuela, killing four.",
      "The US said it carried out another strike on a small boat in the Caribbean Sea, killing four people on board. Pentagon chief Pete Hegseth said \"narco-terrorists\" were the target.",
      "<p>Pentagon chief says strike – fourth by US military in recent weeks – targeted boat with ‘substantial amounts’ of drugs</p><p>The United States carried out a strike against an alleged drug-trafficking boat on Friday that killed four people, US defense secretary <a href=\"https://www.theguardian.com",
      "The U.S. strike near Venezuela is the latest in the Trump administration’s legally nebulous campaign targeting Latin American drug cartels.",
      "It was the fourth strike in the Trump administration’s legally disputed campaign targeting suspected drug runners in the Caribbean Sea."
    ],
    "image_url": "",
    "titles": [
      "US releases video of another strike on a boat near Venezuela",
      "US strikes drug alleged boat near Venezuelan waters",
      "Hegseth says four killed in US strike on alleged drug boat off Venezuelan coast",
      "U.S. kills 4 alleged drug smugglers near Venezuela, Hegseth says",
      "U.S. Military Attacked Boat Off Venezuela, Killing Four Men, Hegseth Says"
    ],
    "score_components": {
      "magnitude": 0.964,
      "recency": 0.919,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.82,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The U.S. conducted a strike in the Caribbean Sea, killing four individuals on a boat suspected of drug trafficking. This action, confirmed by Pentagon Chief Pete Hegseth, marks the fourth similar strike by the U.S. military under the Trump administration's campaign against Latin American drug cartels. The operation is part of a series targeting vessels believed to be carrying substantial amounts of drugs.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Sarah Mullally Appointed First Female Archbishop of Canterbury",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 17:58:26 +0000",
    "source": "Al Jazeera",
    "sources": [
      "The Guardian",
      "New York Times",
      "Al Jazeera",
      "Washington Post",
      "Deutsche Welle"
    ],
    "domains": [
      "www.theguardian.com",
      "www.nytimes.com",
      "www.dw.com",
      "www.aljazeera.com",
      "www.washingtonpost.com"
    ],
    "snippets": [
      "Announcement draws criticism from Anglican churches that oppose female bishops.",
      "Sarah Mullally will become the first female leader when she officially takes charge of the church in March 2026. A group of conservative Anglican churches across Africa and Asia criticized the appointment.",
      "Sarah Mullally, previously the bishop of London, is the first woman to serve as spiritual leader of the Church of England in its nearly 500-year history.",
      "Sarah Mullally, the bishop of London, has been appointed archbishop of Canterbury. She has been a vocal supporter of the rights of women in the church.",
      "<p>Former chief nursing officer for England will legally assume role at Canterbury Cathedral ceremony in January</p><p>Dame Sarah Mullally has been named as the first female leader in the history of the Church of England as Downing Street announced the 106th archbishop of Canterbury nearly a year on"
    ],
    "image_url": "",
    "titles": [
      "Church of England names first female archbishop of Canterbury",
      "First female Archbishop appointed to lead Church of England",
      "First woman is named archbishop of Canterbury, leader of Church of England",
      "Sarah Mullally Is Named as First Female Archbishop of Canterbury",
      "Sarah Mullally is named as first female archbishop of Canterbury"
    ],
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.879,
      "consensus": 0.995,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.815,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Sarah Mullally has been appointed as the new Archbishop of Canterbury, marking the first time a woman will lead the Church of England and its 85 million Anglicans globally. Previously the Bishop of London and a former chief nursing officer, Mullally's historic appointment follows Justin Welby's resignation last year. She is recognized for her support of women's rights within the church. Mullally will officially assume her role in a ceremony at Canterbury Cathedral in January, becoming the 106th archbishop in the Church's history.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Jihad Al-Shamie Attacks Synagogue, Was on Bail for Prior Alleged Crime",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 22:02:32 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "New York Times",
      "Financial Times",
      "BBC"
    ],
    "domains": [
      "www.theguardian.com",
      "www.ft.com",
      "www.bbc.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "Counter terror police also say Al-Shamie may have been influenced by \"extreme Islamist ideology\".",
      "More details emerge about the attacker, who had recently been arrested on suspicion of rape and bailed",
      "Shocked family condemns atrocity as ‘heinous act’",
      "In the hours after an attack, a blanket of fear and grief fell over synagogues and Jewish community centers across the country.",
      "<p>Exclusive: Jihad al-Shamie had been under investigation over alleged sexual attack earlier this year, sources say</p><p>The Manchester synagogue terrorist was on police bail for an alleged rape when he carried out the attack, the Guardian can reveal.</p><p>Jihad al-Shamie, 35, was being investiga"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/7014/live/b50aaa10-a09d-11f0-85af-1377c963b9be.jpg",
    "titles": [
      "Synagogue attacker was on bail after rape arrest, police say",
      "Victim killed in Manchester synagogue attack was shot by police",
      "What we know about Manchester synagogue attacker Jihad Al-Shamie",
      "Manchester Synagogue Attack Fuels Fears of Antisemitism in Britain",
      "Manchester synagogue terrorist was on bail for alleged rape"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.937,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.784,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Jihad Al-Shamie, who attacked individuals at the Heaton Park Congregation synagogue in northwestern England, had previously been under investigation for an alleged sexual attack. He was known as a weightlifting enthusiast who kept to himself. Despite the ongoing investigation, he was released on bail prior to the synagogue attack.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Proposes 20-Point Gaza Peace Plan, Threatens Hamas with Consequences",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Fri, 03 Oct 2025 16:19:01 -0400",
    "source": "NPR",
    "sources": [
      "Axios",
      "NPR",
      "Al Jazeera"
    ],
    "domains": [
      "www.npr.org",
      "www.aljazeera.com",
      "news.google.com"
    ],
    "snippets": [
      "Hamas said it has accepted some elements of President Trump's plan, including giving up power and releasing all remaining hostages, but that others require further consultations among Palestinians.",
      "Palestinian group says it is ready to release all Israeli captives held in Gaza after US president issues ultimatum.",
      "<a href=\"https://news.google.com/rss/articles/CBMieEFVX3lxTE4yS2JEQU1ySW5fRXd3Tkxsc0hsYWVSb2Z0SW1xWFY3dTF5RUlPd0pYWFRKMFYweEs3emJ4NWpsR2FieU1MLW1zei1ZTi1wQjczYmxNVWRKVFRnU20wcGo2VmhfVnZpeW1ldkJWWVZIdG1tcDhvYUROYQ?oc=5\" target=\"_blank\">Trump says Hamas must accept Gaza peace deal by Sunday, or war es"
    ],
    "image_url": "",
    "titles": [
      "Hamas says it accepts some elements of Gaza peace plan after Trump issues ultimatum",
      "Hamas says it agrees to parts of Trump’s Gaza plan but seeks more talks",
      "Trump says Hamas must accept Gaza peace deal by Sunday, or war escalates - Axios"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.923,
      "consensus": 0.789,
      "constructiveness": 0.2,
      "proximity": 0.75
    },
    "score": 0.773,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "President Trump has proposed a 20-point plan aimed at ending the conflict in Gaza, which includes an immediate ceasefire, the release of hostages and detained Gazans, and the temporary control of Gaza by a \"Board of Peace\" chaired by himself. Critics argue the plan does not support Palestinian sovereignty. Trump warned that failure to accept the deal by Sunday would lead to severe consequences against Hamas, which is currently divided on the response. Egypt and Qatar are attempting to persuade Hamas to agree to the ultimatum.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: plan, support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Lamar Jackson Out for Week 5, Ravens Miss 4 Pro Bowlers Against Texans",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Fri, 3 Oct 2025 18:55:36 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "www.cbssports.com",
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "After not practicing all week, quarterback Lamar Jackson has been ruled out for the Ravens, who will be without four Pro Bowlers in all against the Texans.",
      "The Ravens are off to a surprising 1-3 start and now will be without Jackson",
      "<p>Superstar quarterback Lamar Jackson has officially been ruled out of the Ravens&#8217; Week 5 matchup against the Houston Texans, the team announced Friday. </p>"
    ],
    "image_url": "",
    "titles": [
      "Ravens rule out QB Jackson due to hamstring",
      "Lamar Jackson injury update: Ravens star quarterback (hamstring) out for Week 5 matchup with Texans",
      "Ravens rule out QB Lamar Jackson for Week 5 matchup vs. Texans"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.974,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.764,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Lamar Jackson, the Ravens' quarterback, will not play in Week 5 against the Texans after not practicing all week. This adds to the team's challenges as they are already off to a 1-3 start and will be missing four Pro Bowlers in total for the game.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Las Vegas, Phoenix Vie for 2025 WNBA Title Starting Friday",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Fri, 3 Oct 2025 19:58:53 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "www.cbssports.com",
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "The Mercury and Aces tip off the first best-of-seven WNBA Finals in history. Follow all the live action here.",
      "It's Las Vegas vs. Phoenix for the 2025 title",
      "<p>After a year away from the big dance, the Las Vegas Aces are back in the WNBA Finals, squaring off this time against the breakout Phoenix Mercury. Catch Game 1 of the championship series on Sportsnet ONE or stream on Sportsnet+ at 8 p.m. ET / 5 p.m. PT.</p>"
    ],
    "image_url": "",
    "titles": [
      "WNBA Finals Game 1 live tracker: Updates on Mercury vs. Aces series opener",
      "2025 WNBA Finals: Aces vs. Mercury schedule, prediction, players to watch",
      "WNBA Finals on Sportsnet: Mercury vs. Aces Game 1"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.996,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.761,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Las Vegas and Phoenix are set to compete in the WNBA Finals starting Friday, with the 2025 title at stake. The outcome will likely hinge on which team's top three players perform best.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Senators Trade for MacDermid from Devils, Seek Roster Toughness",
    "domain": "sports",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Fri, 03 Oct 2025 21:39:38 GMT",
    "source": "NHL",
    "sources": [
      "Sportsnet",
      "NHL",
      "Ottawa Citizen"
    ],
    "domains": [
      "www.sportsnet.ca",
      "ottawacitizen.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMilAFBVV95cUxNWEdNck9VVExkWWtIUU5oOTlYWUlTVGo4bDRNak55Y0ZSOWZJMU9JVzZZTHV6WFhTY19WSGhZUXpzczZoS1B3Wk12RzFIeGNYV3hGTV9xZU1KMC1fQ2dhbHVxam01NjdFWUczTUVKX251OWs2WDNtQ1pwX056SnBZbWVzV0cwZDJIMTJ0LTRpNGJQUnBX?oc=5\" target=\"_blank\">Senators acquire winger Kur",
      "<a href=\"https://news.google.com/rss/articles/CBMikgFBVV95cUxPMFN3d3kxMmdzNk16MjJCS1lucWYxdWsxRWRaUGk3dENvd3FBQ3BlVGtaV05jdWxhcHlpSEIwUk5JdjA5XzVVR3V2WXd2T2wtX3ZXamdNWEd1a0ZVOWdOVHFESGZsLXAzT1JBaURLWjhwcUF6d1RnbnB4YTZqSnVPTTVTRGtoWWU2bmlZZjNyMkVzUQ?oc=5\" target=\"_blank\">Senators acquire Kurtis MacDe",
      "<a href=\"https://news.google.com/rss/articles/CBMiigFBVV95cUxQX2F0Nk83YWQtRUJzQTJkMFV5ekpDd3lzNDI5eWktZ2QxVGg4a2tIMFBmMnlZeHpTVEpSbjJ4WjlPcVh1TURIWmg0LXJYanNNZkNxak5ibjJQeXVuM0dybDBhbmFkcFNwNDdGWW9sVW44WU10Z2d5QjVNaEVJMVhiOWdWZFlGb3pTTkE?oc=5\" target=\"_blank\">Devils Acquire MacEwen from Ottawa | REL",
      "<p>The Ottawa Senators added some depth on Friday, acquiring veteran enforcer Kurtis MacDermid from the New Jersey Devils in exchange for Zack MacEwen.</p>",
      "The Ottawa Senators have served notice to the Atlantic Division that they won&#8217;t be pushed around. After taking it on the chin from the Montreal Canadiens in a 5-0 loss on Tuesday in Quebec City, the Senators served notice on Friday night that they won&#8217;t stand still by acquiring Kurtis Ma"
    ],
    "image_url": "",
    "titles": [
      "Senators acquire winger Kurtis MacDermid from New Jersey - NHL.com",
      "Senators acquire Kurtis MacDermid in trade with Devils - NHL.com",
      "Devils Acquire MacEwen from Ottawa | RELEASE | New Jersey Devils - NHL.com",
      "Senators acquire Kurtis MacDermid from Devils in exchange for Zack MacEwen",
      "Ottawa Senators add muscle by acquiring Kurtis MacDermid from Devils"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.929,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.73,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Ottawa Senators acquired winger Kurtis MacDermid from the New Jersey Devils in exchange for Zack MacEwen, aiming to add depth and toughness to their roster. This move comes after a significant 5-0 loss to the Montreal Canadiens, signaling the Senators' intent to enhance their competitiveness in the Atlantic Division.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Wigan Warriors Beat Leigh Leopards 18-6, Eye Third Straight Super League Title",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 21:09:19 GMT",
    "source": "BBC",
    "sources": [
      "Sky Sports",
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.skysports.com",
      "www.bbc.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Bevan French keeps Wigan on course for a hat-trick of Super League titles as the Warriors see off Leigh Leopards to reach the Grand Final.",
      "<ul><li><p>Super League playoff semi-final: Wigan 18-6 Leigh</p></li><li><p>Wigan grateful to Jai Field’s amazing second-half tackle</p></li></ul><p>It was a week which began with unexpected controversy and the prospect of this game not even taking place. But, in the end, there was an all too famili",
      "Wigan Warriors booked a spot in the Super League Grand Final with an 18-6 victory over neighbours Leigh Leopards at The Brick Community Stadium."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/6c84/live/89979f10-a092-11f0-b1b3-b903aa8071ae.jpg",
    "titles": [
      "French double books Grand Final return for Wigan",
      "French sees off Leigh to put Wigan in Grand Final after week of acrimony",
      "Wigan book spot in Grand Final with victory over Leigh"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.919,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.728,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Wigan Warriors advanced to the Super League Grand Final after defeating Leigh Leopards 18-6, keeping their hopes for a third consecutive title alive. Key contributions included Bevan French's performance and Jai Field's crucial second-half tackle. The match, held at The Brick Community Stadium, followed a week of controversy but ultimately proceeded as planned.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Bournemouth Beats Fulham 3-1, Climbs to Second in Premier League",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 21:29:54 GMT",
    "source": "BBC",
    "sources": [
      "Sky Sports",
      "Sportsnet",
      "BBC"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.bbc.com",
      "www.skysports.com"
    ],
    "snippets": [
      "Antoine Semenyo nets twice and Justin Kluivert scores a screamer as Bournemouth come from behind to beat Fulham in stormy conditions and move up to second in the Premier League table.",
      "Pieces of individual brilliance from Antoine Semenyo and Justin Kluivert helped Bournemouth come from behind against Fulham to climb up to second in the Premier League.",
      "<p>Bournemouth came from 1-0 down and scored three late goals to defeat Fulham 3-1 in a pulsating and blustery Premier League encounter on Friday.</p>"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/8cf8/live/da102220-a09f-11f0-b741-177e3e2c2fc7.jpg",
    "titles": [
      "Semenyo scores twice as Bournemouth beat Fulham",
      "Semenyo and Kluivert stunners send Bournemouth second after Fulham comeback",
      "Semenyo salvages win for Bournemouth against Fulham on wet and windy night"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.926,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.722,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Antoine Semenyo scored twice and Justin Kluivert netted a spectacular goal as Bournemouth overcame a 1-0 deficit to defeat Fulham 3-1 in challenging weather conditions. This victory propelled Bournemouth to second place in the Premier League standings.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UK Police Arrest 3 More in Manchester Synagogue Attack, Total Now 6",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 20:44:04 GMT",
    "source": "BBC",
    "sources": [
      "ABC News",
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "abcnews.go.com",
      "www.bbc.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Counter terrorism police arrest three more people as part of the investigation into Thursday's attack.",
      "Police on Friday identified the two men who were killed in an attack on a synagogue in Manchester, as Britain’s chief rabbi said an “unrelenting wave” of antisemitism lay behind the crime.",
      "<p>Police arrest three more people, bringing the total to six, Justice secretary faces calls of ‘shame on you’ as crowd gathers to remember victims of terror attack</p><ul><li><p><a href=\"https://www.theguardian.com/uk-news/2025/oct/03/what-do-we-know-about-jihad-al-shamie-the-manchester-synagogue-a"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/6aa9/live/24098e70-a096-11f0-a918-e111dd54869c.jpg",
    "titles": [
      "Three more arrests over synagogue attack",
      "WATCH:  UK authorities search for motive in synagogue attack",
      "Three more arrests in synagogue attack investigation; Lammy heckled at vigil for Manchester synagogue attack – as it happened"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.911,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.719,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "British counter-terrorism police arrested three additional individuals in connection to the attack on a Manchester synagogue, raising the total number of arrests to six. The incident, which resulted in the deaths of two men, has been linked by Britain’s chief rabbi to a surge of antisemitism. Public outcry and memorials for the victims are ongoing, with some voices directing criticism towards the Justice Secretary.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Taylor Swift's Album Sets Record, Features Kelce; Ottawa Teams Face Off",
    "domain": "business",
    "source_domain": "www.forbes.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 13:39:20 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes",
      "Business Insider",
      "Ottawa Citizen"
    ],
    "domains": [
      "www.forbes.com",
      "ottawacitizen.com",
      "www.businessinsider.com"
    ],
    "snippets": [
      "Swift’s latest release smashed pre-save records as the billionaire singer referenced her fiancé Travis Kelce.",
      "Taylor Swift's new album, \"The Life of a Showgirl,\" features 12 new songs, a duet with Sabrina Carpenter, and a theatrical \"release party\" event.",
      "The University of Ottawa GeeGees and Carleton Ravens face off for 55th time Sunday afternoon."
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/68e009450de5e6f08df5d01e/0x0.jpg?width=960&precrop=2760%2C1554%2Cx0%2Cy43",
    "titles": [
      "Taylor Swift’s ‘Life Of A Showgirl’ Hits Number 1 On Apple—As Album Hints At Travis Kelce And More",
      "Taylor Swift's new album 'The Life of a Showgirl' has arrived. Here's everything you need to know.",
      "Everything you need to know about the Panda Game"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.873,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.711,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Taylor Swift's new album, \"The Life of a Showgirl,\" featuring 12 songs and a duet with Sabrina Carpenter, set pre-save records. Swift mentioned her fiancé Travis Kelce in the release, which was celebrated with a theatrical event. In sports, the University of Ottawa GeeGees and Carleton Ravens are set to compete in their 55th face-off on Sunday afternoon.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Jayden Daniels to Start for Commanders vs. Chargers After Knee Injury",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Fri, 3 Oct 2025 18:55:36 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "Commanders quarterback Jayden Daniels will start Sunday against the Chargers after missing the past two games with a sprained left knee.",
      "Marcus Mariota went 1-1 in Daniels' stead"
    ],
    "image_url": "",
    "titles": [
      "Commanders' Daniels officially a go vs. Chargers",
      "Commanders QB Jayden Daniels to return for Week 5 vs. Chargers after missing two games with knee sprain"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.974,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.675,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Jayden Daniels, the Commanders' quarterback, will return to start in Sunday's game against the Chargers after being sidelined for two games due to a sprained left knee. Marcus Mariota, who filled in for Daniels, led the team to a 1-1 record during his absence.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Mets Overhaul Staff, Bench Coach Gibbons Exits Amid Changes",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Fri, 3 Oct 2025 18:55:36 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "After missing the playoffs despite the highest payroll in the MLB, the New York Mets are engaging in a large staffing overhaul.",
      "<p>A popular Toronto baseball man will be looking for a new job. John Gibbons told the New York Mets he is leaving his role as bench coach as part of a large overhaul of the team&#8217;s coaching staff, the team announced Friday.</p>"
    ],
    "image_url": "",
    "titles": [
      "Mets begin staff overhaul after missing playoffs",
      "John Gibbons out as bench coach as Mets overhaul coaching staff"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.974,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.675,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The New York Mets, after not making the playoffs despite having the MLB's highest payroll, are overhauling their staff. John Gibbons, the bench coach, announced his departure from the team as part of this major shake-up.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Apple Pulls ICEBlock App Over Safety Concerns, Following DOJ Demands",
    "domain": "technology",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-10-03T06:17:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "TechCrunch",
      "Axios",
      "Deutsche Welle"
    ],
    "domains": [
      "techcrunch.com",
      "www.dw.com",
      "news.google.com"
    ],
    "snippets": [
      "The Justice Department reportedly reached out to Apple to take down ICEBlock and similar apps, citing security risks to immigration enforcement officers.",
      "<a href=\"https://news.google.com/rss/articles/CBMib0FVX3lxTE9Eb3BJYnU3dk5GR1lkQjdRaGNTR0Jub3lkeXloUFJrUVdqU2VGNU84RHFBQVRhVlIxZ29BOW1CMS1uNjRrOUV0QzItNnp4OEZCU3h5NXRBQlhFNGFBQUZocVo0b29zN2FVQU91S1FSdw?oc=5\" target=\"_blank\">Apple drops ICE tracking apps from its store after Trump DOJ demand</a>&nbsp;",
      "The app, which went viral earlier this year, allowed users to lawfully share information about where they've seen ICE agents within a 5-mile radius of their location, and also share details of the clothing agents are wearing."
    ],
    "image_url": "",
    "titles": [
      "Apple pulls ICE tracking apps after Trump admin request",
      "Apple drops ICE tracking apps from its store after Trump DOJ demand - Axios",
      "Apple removes ICEBlock and similar tracking apps from the App Store"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.689,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.675,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Apple removed the ICEBlock app, designed to track immigration enforcement activities, from its App Store, citing safety concerns. This action follows demands from the Trump-era Department of Justice. The app's creator, Joshua Aaron, developed ICEBlock in response to the Trump administration's deportation policies, which he compared to events in Nazi Germany.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Coalition Sues Over $100K H-1B Visa Fee, Claiming Excess Authority",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 22:09:43 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Financial Post",
      "Al Jazeera"
    ],
    "domains": [
      "financialpost.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "The lawsuit claims Trump does not have the authority to override the law that created the H-1B visa programme.",
      "SEATTLE (AP) &#8212; In what appears to be the first major challenge to the new $100,000 fee required for H-1B visa applications, a coalition of health care providers, religious groups, university professors and others filed a federal lawsuit Friday to stop the plan, saying it has &#8220;thrown empl"
    ],
    "image_url": "",
    "titles": [
      "First lawsuit filed challenging Trump’s $100,000 H-1B visa fee",
      "Lawsuit seeks to stop Trump’s $100,000 fee for H-1B visas"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.959,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.654,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A coalition, including health care providers and university professors, filed a lawsuit to challenge a new $100,000 fee for H-1B visa applications, claiming it exceeds Trump's authority and disrupts employment. This marks a significant legal opposition to the fee imposed on the visa program designed for specialized foreign workers.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Munich Airport Halts Flights Amid Drone Sightings, Affects Oktoberfest",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-10-03T21:40:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "New York Times",
      "Deutsche Welle"
    ],
    "domains": [
      "www.dw.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "Both runways at Munich airport have been closed for the second time in 24 hours after further \"unconfirmed drone sightings.\" A drone was earlier sighted over a nearby military facility. DW has more.",
      "The disruption comes as Munich hosts its world-famous Oktoberfest beer festival, which runs until Sunday. Last week, Denmark and Norway closed airports due to drones.",
      "The airport in Germany was the latest in Europe to shut because of drone sightings. Officials have blamed Russia, which has denied being behind the drone incursions."
    ],
    "image_url": "",
    "titles": [
      "Germany: Munich airport closes again amid drone sightings",
      "Germany: Drone sightings disrupt Munich Airport",
      "Flights Are Briefly Halted at Munich Airport After Drone Sightings"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.949,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.652,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Munich airport suspended operations due to drone sightings on Thursday evening, affecting the Oktoberfest beer festival. This led to 17 flight cancellations and disrupted nearly 3,000 travelers. This incident is part of a series of drone disruptions in European aviation, with officials blaming Russia, which has denied the accusations.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Drone Kills Journalist in Ukraine, a First: European Federation",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-10-03T19:38:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "New York Times",
      "Deutsche Welle"
    ],
    "domains": [
      "www.dw.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "The European Federation of Journalists said Antoni Lallican's death marks the first time a journalist had been killed by a drone in the Ukraine conflict.",
      "Antoni Lallican, a Paris-based photographer, is the first working journalist to be killed by a remotely piloted drone during the war, according to press associations."
    ],
    "image_url": "",
    "titles": [
      "Ukraine: French photojournalist killed by Russian drone",
      "French Photojournalist Killed in Drone Attack in Ukraine"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.909,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.651,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Antoni Lallican, a Paris-based photographer, became the first journalist to be killed by a drone in the Ukraine conflict, as confirmed by the European Federation of Journalists. This incident marks a tragic milestone in the war, highlighting the dangers journalists face while reporting.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Blue Jays to Battle Yankees in First Postseason Matchup",
    "domain": "sports",
    "source_domain": "sports.yahoo.com",
    "location": "national",
    "published": "Fri, 03 Oct 2025 23:12:37 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Sportsnet",
      "Yahoo Sports"
    ],
    "domains": [
      "www.sportsnet.ca",
      "sports.yahoo.com"
    ],
    "snippets": [
      "From April through September, the Toronto Blue Jays got the best of the New York Yankees, winning the AL East in a tiebreaker based on 8-5 head-to-head record that included a 6-1 advantage north of the border.  Kevin Gausman will start Game 1 for the Blue Jays, opposed by the Yankees' Luis Gil.  Man",
      "<p>The American League Division Series roster puzzle began taking shape for the Blue Jays with the naming of Kevin Gausman as their Game 1 starter. </p>\n<p>Although, how exactly the club plans to line up against the Yankees remains somewhat in the air.</p>",
      "<p>Luis Gil was very good last time out against the Toronto Blue Jays. The New York Yankees hope he’ll deliver similar results in the American League Division Series opener.</p>",
      "<p>The Toronto Blue Jays’ most consistent pitcher this year will get the ball for Game 1 of the American League Division Series.</p>"
    ],
    "image_url": "",
    "titles": [
      "Blue Jays' Kevin Gausman set to face Yankees' Luis Gil in Game 1 of ALDS between division foes",
      "Gausman gets Game 1 call as Blue Jays and Yankees resume rivalry",
      "Yankees’ Luis Gil to start Game 1 of ALDS vs. Blue Jays",
      "Blue Jays’ Kevin Gausman to start Game 1 of ALDS vs. Yankees"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.98,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.651,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Toronto Blue Jays and New York Yankees will face off in the American League Division Series, marking their first postseason encounter. The best-of-five series kicks off Saturday in Toronto, with the Blue Jays' top pitcher starting Game 1.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Jeff Bezos Criticizes AI as an \"Industrial Bubble\"",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Fri, 03 Oct 2025 21:29:16 GMT",
    "source": "Axios",
    "sources": [
      "CNBC",
      "Axios"
    ],
    "domains": [
      "www.cnbc.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMieEFVX3lxTFBVa2J0U2ZhaXlvYXVLUm02WkZGY2lMeG5zS1lUTDdCeUVHR2Z6TEViUVE5aURJUklYWmpTSWlVWVN1TnhVQlZZN3RWUVB2MWVHWnZ3bTAwSkV5YmxsQlNmdWF2cWdscXlmcVA4LVVvZG9WRHE3UnVfQg?oc=5\" target=\"_blank\">Jeff Bezos slams AI \"industrial bubble,\" while Goldman Sachs' CEO",
      "Amazon founder Jeff Bezos said that artificial intelligence is showing signs of being in an \"industrial bubble.\""
    ],
    "image_url": "",
    "titles": [
      "Jeff Bezos slams AI \"industrial bubble,\" while Goldman Sachs' CEO expects \"drawdown\" - Axios",
      "Jeff Bezos says AI is in an industrial bubble but society will get 'gigantic' benefits from the tech"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.926,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.647,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Jeff Bezos, Amazon's founder, criticized the current state of artificial intelligence, describing it as an \"industrial bubble.\" This statement reflects his perspective on the hype and investment surrounding AI technologies.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Sean \"Diddy\" Combs Sentenced to Four Years for Prostitution Charges",
    "domain": "business",
    "source_domain": "www.businessinsider.com",
    "location": "global",
    "published": "2025-10-03T21:28:07Z",
    "source": "Business Insider",
    "sources": [
      "Fortune",
      "Business Insider"
    ],
    "domains": [
      "fortune.com",
      "www.businessinsider.com"
    ],
    "snippets": [
      "Sean \"Diddy\" Combs was sentenced to four years in prison Friday after he was convicted in July of two prostitution-related counts.",
      "Since Combs has served a year in jail already, this sentence means he would be released in about three years."
    ],
    "image_url": "https://i.insider.com/68e0372b5dbc4fd10daa30e8?format=jpeg",
    "titles": [
      "Diddy sentenced to over 4 years in prison for transporting sex workers to 'freak offs'",
      "Sean ‘Diddy’ Combs gets 4 years in prison and is fined half a million dollars for case involving sex workers, violence and ‘freak-offs’"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.945,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.644,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Sean \"Diddy\" Combs was sentenced to four years in prison on two prostitution-related charges, with a conviction in July. Having already served a year, Combs is expected to be released in approximately three years.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Amorim Admits Poor Performance Amid Criticism, Man Utd Struggles Continue",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 21:30:06 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Al Jazeera"
    ],
    "domains": [
      "www.bbc.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Manchester United head coach Ruben Amorim admits he cannot hide from his dire record and it is 'normal' that Old Trafford legends criticise him.",
      "Manchester United are currently in the bottom half of the Premier League, where they also finished last season."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/0f3a/live/455aafb0-a059-11f0-b741-177e3e2c2fc7.jpg",
    "titles": [
      "Amorim says Man Utd 'need results to continue project'",
      "Man Utd manager Amorim can’t run away from results’"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.926,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.64,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Manchester United head coach Ruben Amorim acknowledged his poor performance record amid criticism from Old Trafford legends. With the team currently in the bottom half of the Premier League, this follows a similar finish last season.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Netflix's \"Monster: The Ed Gein Story\" Stars Charlie Hunnam",
    "domain": "business",
    "source_domain": "www.forbes.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 17:54:46 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes"
    ],
    "domains": [
      "www.forbes.com"
    ],
    "snippets": [
      "Click in to find out who stars in the ensemble cast of \"Monster: The Ed Gein Story,\" starring Charlie Hunnam in the title role.",
      "Ryan Murphy and Ian Brennan’s “Monster: The Ed Gein Story,” starring Charlie Hunnam as the infamous “Butcher of Plainfield\" is new on Netflix. How many episodes does the new Monster series contain?"
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/68df56fb608e0ad2e0827998/0x0.jpg?width=960",
    "titles": [
      "Here’s The Cast Of Netflix’s ‘Monster: The Ed Gein Story’",
      "‘Monster: The Ed Gein Story’: How Many Episodes Are There In Netflix’s True Crime Series?"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.954,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.459,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "\"Monster: The Ed Gein Story,\" a new series on Netflix, stars Charlie Hunnam as Ed Gein, known as the \"Butcher of Plainfield.\" Created by Ryan Murphy and Ian Brennan, the show delves into the life of the infamous figure. The summary does not specify the number of episodes in the series.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]