[
  {
    "title": "Economic Data Release at Risk Amid Congressional Spending Deadlock",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 30 Sep 2025 22:57:08 GMT",
    "source": "BBC",
    "sources": [
      "Deutsche Welle",
      "Business Insider",
      "Phys.org",
      "MarketWatch",
      "BBC",
      "Financial Times",
      "The Guardian",
      "Al Jazeera"
    ],
    "domains": [
      "www.marketwatch.com",
      "phys.org",
      "www.ft.com",
      "www.theguardian.com",
      "www.bbc.com",
      "www.dw.com",
      "www.businessinsider.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Government funding will be cut off after Republicans and Democrats failed to agree on a spending bill.",
      "Funding will be cut off unless Republicans and Democrats can agree a way forward on a spending bill.",
      "Experts say furloughs and layoffs could slow consumer spending in the months to come.",
      "A US government shutdown could result in layoffs of federal workers.",
      "The US could see its first government shutdown in almost seven years as both parties stand firm on their demands.",
      "The United States is facing yet another government shutdown. What happens and who is impacted when the government can't pay its bills? And could the Trump administration use it as an excuse for more layoffs?",
      "Lawmakers unable to break gridlock in a series of votes on Tuesday evening",
      "<p>Senate sinks Democratic and Republican plans to extend government funding beyond midnight and avert shutdown</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/live/2025/sep/30/us-government-shutdown-funding-trump-vance-portland-hegseth-latest-updates\">US politics – latest updates</a></p>",
      "A government shutdown could disrupt flights, extend security wait times, and slow safety functions, creating a stressful travel experience for flyers.",
      "The U.S. government faces a shutdown on Oct. 1 unless Congress passes a spending bill to keep the government funded.",
      "Federal workers may end up missing paychecks, depending on how long the shutdown lasts. Members of Congress won't have to worry about that.",
      "Millions of Americans are poised to pay more for their health insurance next year."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/ee8d/live/32dbf5d0-9e4a-11f0-928c-71dbb8619e94.jpg",
    "titles": [
      "What could happen during the US government shutdown?",
      "Why the US government might shut down and when it might happen",
      "Will a government shutdown hurt the US economy?",
      "Why is the US government on the brink of a shutdown? What will it mean?",
      "US government shutdown looms amid 'large differences'",
      "What does a US government shutdown actually mean?",
      "US on brink of government shutdown as lawmakers remain deadlocked",
      "US on brink of government shutdown after Senate rejects funding plans",
      "How a US government shutdown could impact your next flight",
      "Q&A: What happens during a government shutdown?",
      "Yes, Congress still gets paid during a government shutdown",
      "Here’s how much your health insurance could go up next year — whether there’s a government shutdown or not"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.955,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.841,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Funding for key economic data is at risk as Republicans and Democrats struggle to agree on a spending bill. If no resolution is reached, the release of crucial economic information could be delayed.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Warriors, Kuminga End Stalemate with $48.5M Two-Year Deal",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 30 Sep 2025 19:53:07 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports",
      "Yahoo Sports",
      "Sportsnet"
    ],
    "domains": [
      "www.espn.com",
      "www.nbcsports.com",
      "www.sportsnet.ca",
      "www.cbssports.com",
      "www.usatoday.com",
      "www.blazersedge.com"
    ],
    "snippets": [
      "Jonathan Kuminga and the Warriors ended a monthslong stalemate Tuesday, reaching agreement on a two-year deal worth $48.5 million.",
      "The Kuminga contract saga is finally over",
      "The Warriors went up a little in money and Kuminga accepted the team option on the second year, making a trade more likely.",
      "Golden State and the forward come together after a long and public negotiation",
      "Jonathan Kuminga and the Warriors have finally reached agreement on a deal, ESPN reports. A look at the contract and what it means.",
      "<p>Restricted free agent forward Jonathan Kuminga has signed a two-year, $48.5 million contract to return to the Golden State Warriors, ESPN&#8217;s Shams Charania reported Tuesday. </p>"
    ],
    "image_url": "",
    "titles": [
      "Kuminga, Warriors end stalemate with 2-year deal",
      "Jonathan Kuminga, Warriors end contract standoff as forward signs two-year deal with Golden State, per report",
      "Stalemate over: Jonathan Kuminga, Warriors reportedly agree to two-year, $48.5 million contract extension",
      "Warriors, Kuminga Agree On Two-Year $48M Deal",
      "Warriors, Jonathan Kuminga reach agreement on new contract, per report: What it means",
      "Report: Jonathan Kuminga signs two-year, $48.5M contract with Warriors"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.994,
      "consensus": 0.948,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.823,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Jonathan Kuminga and the Golden State Warriors have ended a prolonged negotiation by agreeing to a two-year contract worth $48.5 million. The deal, which includes a team option for the second year, was finalized after the Warriors increased their financial offer. This resolution comes after a public and extended stalemate between the forward and the team.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Ex-Congo President Kabila Sentenced to Death in Absentia for Multiple Crimes",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 30 Sep 2025 17:36:39 GMT",
    "source": "BBC",
    "sources": [
      "Deutsche Welle",
      "New York Times",
      "BBC",
      "The Guardian",
      "Al Jazeera"
    ],
    "domains": [
      "www.nytimes.com",
      "www.theguardian.com",
      "www.bbc.com",
      "www.dw.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Joseph Kabila is accused of supporting the M23, but he denies having any involvement with the rebel group.",
      "Head of military tribunal says Kabila convicted of several crimes, including treason, murder and torture.",
      "Former Congolese President Joseph Kabila was sentenced to death in absentia by a military court. He was found guilty of treason and complicity with the M23 militia.",
      "<p>Military court convicts Kabila of war crimes, treason and other offences in verdict that could fuel enduring tensions</p><p>A military court in the Democratic Republic of the Congo has sentenced the country’s former president Joseph Kabila to death in absentia after convicting him of war crimes, ",
      "Joseph Kabila, who was president of the Democratic Republic of Congo for 18 years, was convicted of treason by a court in Kinshasa."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/7058/live/7e9f7ef0-9dec-11f0-928c-71dbb8619e94.jpg",
    "titles": [
      "Former Congolese president sentenced to death for war crimes",
      "DR Congo’s ex-President Joseph Kabila sentenced to death in absentia",
      "Congo: Death sentence for former leader Joseph Kabila",
      "Former DRC president Joseph Kabila sentenced to death in absentia",
      "Congo’s Former President Sentenced to Death in Absentia"
    ],
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.854,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.8,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Former Congolese President Joseph Kabila was sentenced to death in absentia by a military court in the Democratic Republic of the Congo. He was convicted of several crimes, including treason, murder, torture, and complicity with the M23 militia. This verdict comes after Kabila's 18-year presidency and could escalate tensions in the region.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UN Security Council Votes to Expand Haiti Mission with 5,500 Troops",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Tue, 30 Sep 2025 21:02:10 +0000",
    "source": "Al Jazeera",
    "sources": [
      "The Guardian",
      "Washington Post",
      "Al Jazeera",
      "New York Times"
    ],
    "domains": [
      "www.nytimes.com",
      "www.aljazeera.com",
      "www.theguardian.com",
      "www.washingtonpost.com"
    ],
    "snippets": [
      "International mission would surge personnel in Haiti, with mandate to &#039;neutralise, isolate, and deter&#039; gangs.",
      "<p>Unit will have up to 5,500 soldiers and police officers who will tackle the violence that has overwhelmed the country</p><p>The United Nations has adopted a resolution to transform a security mission in gang-dominated Haiti into a larger, fully fledged force with military troops.</p><p>The new un",
      "The Security Council vote was an acknowledgment that the police mission it once backed had failed to wrest back control of the beleaguered Caribbean nation.",
      "The vote on Tuesday would establish a force of up to 5,500 soldiers and police officers. It was unclear what countries were willing to contribute personnel or money."
    ],
    "image_url": "",
    "titles": [
      "UN Security Council approves ‘Gang Suppression Force’ for Haiti",
      "UN security council approves new military force to fight Haiti gangs",
      "U.N. approves militarized force to take on Haiti’s gangs",
      "U.N. Security Council Approves Larger Force to Fight Gangs in Haiti"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.936,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.783,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The United Nations Security Council has voted to expand a security mission in Haiti into a larger force with up to 5,500 soldiers and police officers. This decision aims to neutralize, isolate, and deter gangs that have overwhelmed the country. The move acknowledges the failure of the previous police mission to control the situation in Haiti. However, the contributing countries and funding details remain unspecified.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Administration Strikes Deal to Lower U.S. Drug Prices",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Tue, 30 Sep 2025 18:55:59 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "CNBC",
      "Axios"
    ],
    "domains": [
      "www.cnbc.com",
      "www.npr.org",
      "news.google.com"
    ],
    "snippets": [
      "The Trump administration says it is making deals with drug companies to lower prices U.S. consumers pay for medicines. But key details are missing on how the initiative would work.",
      "<a href=\"https://news.google.com/rss/articles/CBMibkFVX3lxTE94Qzh2QXRTMUlzSW1FeVplcjY1QUxfTDhWNkFETUdOUy0xaWRjSnJieVlRbGw5bXdOdWVSaDN5RFlnQ0FyaVk4WVZkRkpNWnk2Vm5fRFZpX2lkTnJMeWgzdVA0anhOVXZ6OVpGTkx3?oc=5\" target=\"_blank\">Trump and Pfizer announce deal to lower drug prices, launch \"Trump Rx\" website<",
      "The deal comes after Trump sent letters to Pfizer and 16 other drugmakers calling on them to take steps to lower drug prices by Sept. 29."
    ],
    "image_url": "",
    "titles": [
      "President announces TrumpRx website for drugs, and pricing deal with Pfizer",
      "Trump and Pfizer announce deal to lower drug prices, launch \"Trump Rx\" website - Axios",
      "Trump, Pfizer agree to lower U.S. drug prices, exempt company from pharma tariffs"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.974,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.78,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Trump administration announced a deal with Pfizer and other drugmakers aimed at lowering U.S. drug prices. Details on how the initiative will work are unclear, but it follows Trump's letters to 17 drug companies urging price reductions by Sept. 29. The outcome or effectiveness of this agreement remains unspecified.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: initiative",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Scientists Develop Technique to Create Eggs from Skin Cells for Infertility Trea",
    "domain": "science",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Tue, 30 Sep 2025 11:01:00 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "New Scientist",
      "BBC",
      "Wired"
    ],
    "domains": [
      "www.newscientist.com",
      "www.wired.com",
      "www.bbc.com",
      "www.npr.org"
    ],
    "snippets": [
      "Scientists created the eggs using DNA from adult skin cells, a step that could someday potentially lead to new ways to treat infertility and enable gay couples to have genetically related children.",
      "US scientists testing the technique say it could help people overcome infertility and potentially allow same-sex couples to have a genetically related child.",
      "An innovative use of skin cells could provide a route for gay couples or women with fertility problems to have children they are both genetically related to",
      "The embryos weren’t used to try to establish a pregnancy, but the researchers behind the technique say it could one day be used to address infertility."
    ],
    "image_url": "",
    "titles": [
      "Scientists create human eggs in the lab, using skin cells",
      "Scientists make embryos from human skin DNA for first time",
      "Egg cells made with DNA from human skin fertilised in the lab",
      "Scientists Made Human Eggs From Skin Cells and Used Them to Form Embryos"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.826,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.779,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Scientists have developed a technique to create eggs from the DNA of adult skin cells, offering a potential future treatment for infertility. This method could also enable gay couples to have genetically related children. However, the embryos created were not used to attempt pregnancy. The researchers believe this approach could one day help address infertility issues.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "South African Ambassador to France Found Dead in Paris",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 30 Sep 2025 16:21:56 GMT",
    "source": "BBC",
    "sources": [
      "New York Times",
      "Al Jazeera",
      "BBC",
      "Deutsche Welle"
    ],
    "domains": [
      "www.nytimes.com",
      "www.aljazeera.com",
      "www.bbc.com",
      "www.dw.com"
    ],
    "snippets": [
      "The circumstances around Nathi Mthethwa's death are being investigated by the French authorities.",
      "South African Ambassador Nkosinathi Emmanuel &quot;Nathi&quot; Mthethwa was found dead outside of a high-rise hotel in Paris.",
      "Ambassador Nkosinathi Emmanuel \"Nathi\" Mthethwa's body was discovered outside a Paris hotel. His death is being treated as a possible suicide, the local presecutor's office says.",
      "The police are investigating the death of the ambassador, Nkosinathi Emmanuel Mthethwa, as a possible suicide."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/ca83/live/869eb4c0-9dfd-11f0-a82d-4d2348b593b6.jpg",
    "titles": [
      "South Africa's top diplomat in France found dead near Paris hotel",
      "South African Ambassador to France found dead outside Paris hotel",
      "South Africa's ambassador to France found dead in Paris",
      "South African Ambassador to France Is Found Dead in Paris"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.832,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.756,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "South African Ambassador Nkosinathi Emmanuel \"Nathi\" Mthethwa was found dead outside a high-rise hotel in Paris. French authorities are investigating the circumstances of his death, with police considering it a possible suicide.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Nicole Kidman Files for Divorce from Keith Urban After 19 Years",
    "domain": "general",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Tue, 30 Sep 2025 21:30:54 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "New York Times",
      "CityNews"
    ],
    "domains": [
      "www.nytimes.com",
      "www.theguardian.com",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "<p>Divorce papers filed in Nashville court include detailed plan for shared childcare of their daughters</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/oct/01/australia-news-live-nicole-kidman-divorce-keith-urban-sussan-ley-coalition-andrew-hastie-anthony-albanese-housin",
      "The couple married in Australia in 2006. Their breakup surprised many fans.",
      "Oscar winner Nicole Kidman has filed for divorce from country music star Keith Urban after 19 years of marriage, according to multiple media reports. The news comes nearly 24 hours after TMZ reported that the couple had been living “apart since the beginning of summer.”&#160; Last month, Kidman was "
    ],
    "image_url": "https://i.guim.co.uk/img/media/22749c10de026b8b8242d17686f277a2cb570e99/336_0_4202_3362/master/4202.jpg?width=140&quality=85&auto=format&fit=max&s=81e49e16750ee4df89a02e10bddd7b0f",
    "titles": [
      "Nicole Kidman files for divorce from Keith Urban citing ‘marital difficulties and irreconcilable differences’",
      "Nicole Kidman Files for Divorce From Keith Urban After Nearly 20 Years",
      "Nicole Kidman files for divorce from Keith Urban after 19 years of marriage: reports"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.926,
      "consensus": 0.789,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.742,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Nicole Kidman has filed for divorce from Keith Urban after 19 years of marriage, with divorce papers filed in Nashville court detailing a shared childcare plan for their daughters. The couple, married in 2006, had reportedly been living apart since the beginning of summer. This development has surprised many of their fans.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: development, plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Gaza Palestinians React to Trump's 20-Point Plan Endorsed by Netanyahu",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Tue, 30 Sep 2025 18:22:34 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "CityNews",
      "Axios"
    ],
    "domains": [
      "www.aljazeera.com",
      "news.google.com",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "US president says Hamas has &#039;three or four days&#039; to respond to his Gaza ceasefire proposal.",
      "Palestinians in Gaza have been reacting to US President Donald Trump&#039;s 20-point plan to bring an end to the war on Gaza.",
      "<a href=\"https://news.google.com/rss/articles/CBMijAFBVV95cUxNd2MweHlKVzZIOXJ1SWQxYk84VTN2Q3lEOHdEeGhOc2Zsd001N1lTcVlvaVRJRmVxNlN6TGM0cGlubldsblhRbFV1VXBUeXlTQ05kcWVPazNLRDN2azBCN3REVWp0bzJ2ak9rNHlaRVN4SS1neG03X0MwVDVuV3cweWRlQXVNZ0VuZVRtVg?oc=5\" target=\"_blank\">The scramble to shape Trump's Gaza pl",
      "OTTAWA — Prime Minister Mark Carney says Canada welcomes U.S. President Donald Trump&#8217;s &#8220;historic new Middle East peace plan,&#8221; which Washington has asked Ottawa to sell to other nations. Trump&#8217;s plan to put the Gaza Strip and its 2.1 million Palestinians under an international"
    ],
    "image_url": "",
    "titles": [
      "Can Trump’s plan end the war in Gaza?",
      "Palestinians in Gaza react to Trump plan on ending Israel’s war",
      "The scramble to shape Trump's Gaza plan is just beginning - Axios",
      "PM Carney welcomes Trump’s peace plan proposal for Israel and Gaza"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.886,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.731,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Palestinians in Gaza have responded to US President Donald Trump's 20-point plan aimed at ending the war on Gaza. The plan, which has received endorsement from Prime Minister Benjamin Netanyahu, largely meets Netanyahu's expectations, despite increasing international isolation.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump, Netanyahu Agree on Gaza Peace Deal; Hamas Approval Pending",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Tue, 30 Sep 2025 19:24:09 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Washington Post",
      "Al Jazeera",
      "New York Times"
    ],
    "domains": [
      "www.nytimes.com",
      "www.aljazeera.com",
      "www.washingtonpost.com"
    ],
    "snippets": [
      "Details are key in any peace agreement. Donald Trump’s 20-point plan for Gaza is notably lacking in them.",
      "The Israeli premier’s reluctance to fully withdraw troops or make way for a Palestinian state, combined with Hamas’s reluctance to disarm, may result in a fragile deal, analysts say.",
      "It would end the war and secure the release of all hostages. Hamas would give up its arms and its power, while a transitional government is set up. Hamas has not agreed and the terms will be hard for it to swallow."
    ],
    "image_url": "",
    "titles": [
      "Trump’s Gaza peace plan has 20 points but few details",
      "Netanyahu tries to sell Trump’s Gaza peace plan to a skeptical right wing",
      "Trump’s Gaza Plan: What We Know"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.905,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.725,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "US President Donald Trump and Israeli Prime Minister Benjamin Netanyahu have agreed on a new Gaza peace deal, lacking detailed information. The deal aims to end the war and secure the release of all hostages by having Hamas disarm and relinquish power for a transitional government. However, challenges arise from Netanyahu's reluctance to withdraw troops or allow a Palestinian state, and Hamas's hesitation to disarm. The outcome remains uncertain as Hamas has yet to agree to the terms.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "750K Federal Workers Face Furlough Risk Amid Shutdown Concerns",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Tue, 30 Sep 2025 17:47:37 GMT",
    "source": "Axios",
    "sources": [
      "Business Insider",
      "CNBC",
      "Axios"
    ],
    "domains": [
      "www.cnbc.com",
      "news.google.com",
      "www.businessinsider.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMiigFBVV95cUxNV0xnNWlZd2h3ZFRsbUtCUG1aUkczZXhxUkxvU29MeFlUOEFEY1lSOEd3VkpNYkJxZ3lVcDdDQXMyd1lIZ1dXby1fcFRMdGVQRkVOajZSSXF3R0NtUzhRRjljWEk1UlZFYWN3S1Bla0NsNlpoTWxLRDNOeFA1Y3hPUUJicUVmUVBMT0E?oc=5\" target=\"_blank\">750K federal workers risk furloughs in g",
      "<a href=\"https://news.google.com/rss/articles/CBMid0FVX3lxTFBKT1lta1d2UEUzVk95dy1IWW5ZdUU5alZuZmM3U3FjbFBjX2lFeFNOS0YzRXVaTXNuNFV6dFhnYk1kd3VUeUhUTEhSd0FscFNfaEswNmtYdW9RQl9kNmg0LXY3WWRsdnpuUlF4OUYtdFRhZzJZZERv?oc=5\" target=\"_blank\">Federal workers don't want a shutdown, but some are OK with it</a>&",
      "Democrats insist that any stopgap funding bill included an extension of enhance Affordable Care Act tax credits due to expire at the end of 2025.",
      "Federal workers received an email Tuesday, saying that a looming government shutdown will come with furloughs."
    ],
    "image_url": "",
    "titles": [
      "750K federal workers risk furloughs in government shutdown, CBO estimates - Axios",
      "Federal workers don't want a shutdown, but some are OK with it - Axios",
      "Government shutdown would furlough about 750,000 federal workers, CBO says",
      "Read the email federal workers are getting hours before a potential government shutdown"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.857,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.715,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Approximately 750,000 federal workers are at risk of furloughs due to a potential government shutdown. Despite the risk, some federal employees are indifferent to the possibility of a shutdown. The shutdown could also freeze the IPO market. Democrats are demanding that any temporary funding measure to prevent the shutdown includes an extension of enhanced Affordable Care Act tax credits set to expire at the end of 2025. Federal workers were notified via email about the potential furloughs associated with the shutdown.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump, Netanyahu Agree on Gaza Peace Deal; Hamas Approval Pending",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Tue, 30 Sep 2025 16:24:31 +0000",
    "source": "Al Jazeera",
    "sources": [
      "The Guardian",
      "Al Jazeera",
      "Axios"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.theguardian.com",
      "news.google.com"
    ],
    "snippets": [
      "US president says it will be &#039;a very sad end&#039; if Palestinian group does not agree to his 20-point Gaza plan.",
      "US President Donald Trump says Hamas has three or four days to respond to his proposed plan to end the war in Gaza.",
      "<a href=\"https://news.google.com/rss/articles/CBMiigFBVV95cUxOeHlpLWZjbFpUazZha2YxampoeWJfUktad1haSV9tMC1LdTZjNVdqUkR1OElXbmxkeG9uODl3MGlMUFBuTDlwQnJPbzRpMG02MGdKakVDcjUzY1RoVFFSVTlYcC1VSTl5dFYwUDNCTlVkOXZnTUJhZjRuNWxjdGJULU1MODFjRWNKaGc?oc=5\" target=\"_blank\">Qatar, Egypt and Turkey urge Hamas to ac",
      "<p>US president warns militant group will ‘pay in hell’ if it rejects the deal, which seeks to end two-year-long war</p><p>Donald Trump has given Hamas an ultimatum of “three or four days” to respond to his proposed peace and reconstruction plan in Gaza, warning the militant group would “pay in hell"
    ],
    "image_url": "",
    "titles": [
      "Trump says Hamas has ‘three or four days’ to respond to Gaza proposal",
      "Trump sets deadline for Hamas to respond to his Gaza peace plan",
      "Qatar, Egypt and Turkey urge Hamas to accept Trump's Gaza peace plan - Axios",
      "Trump gives Hamas ‘three or four days’ to respond to his peace plan for Gaza"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.85,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.714,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "US President Donald Trump and Israeli Prime Minister Benjamin Netanyahu have agreed on a new Gaza peace deal, lacking detailed information. The deal aims to end the war and secure the release of all hostages by having Hamas disarm and relinquish power for a transitional government. However, challenges arise from Netanyahu's reluctance to withdraw troops or allow a Palestinian state, and Hamas's hesitation to disarm. The outcome remains uncertain as Hamas has yet to agree to the terms.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump, Hegseth Urge Military to Use Cities for 'Warrior Ethos'",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Tue, 30 Sep 2025 16:52:30 GMT",
    "source": "Axios",
    "sources": [
      "Financial Times",
      "Fortune",
      "Axios"
    ],
    "domains": [
      "fortune.com",
      "news.google.com",
      "www.ft.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMiiAFBVV95cUxQcC1PNlc2cUh6ZnZCTmMwdHRYbldaRWpVU3NwTnhycElLbFZGUW1qSlFmNGpiaUtRYkNrQ1VxRW0wYUM1UFhSTXRKMllSN19RUkc2bFYtSGpjWEkyMDY1djlXRk5PWU8zWGM3cktSQUVGTmkyY0E4U2Q4NFBpRDNlZDBBV3BuMWlW?oc=5\" target=\"_blank\">Trump says military should use U.S. cities ",
      "Defence secretary Pete Hegseth also tells admirals and generals they must restore ‘warrior ethos’",
      "The military leaders sat mostly stone-faced through Trump’s politicized remarks."
    ],
    "image_url": "",
    "titles": [
      "Trump says military should use U.S. cities as \"training grounds\" - Axios",
      "Trump says US cities should be used as military ‘training grounds’",
      "Trump says U.S. cities should be ‘training grounds’ for the military to fight an ‘invasion from within’ during unusual speech to generals"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.841,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.712,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "President Trump and Defense Secretary Pete Hegseth addressed hundreds of generals and admirals, advocating for the military's use of U.S. cities to restore 'warrior ethos.' Their speeches, described as incendiary, aimed to influence military leadership amidst current U.S. political dynamics.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Deepti Sharma Leads India to Win Over Sri Lanka in World Cup Opener",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 30 Sep 2025 18:22:26 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC",
      "Sky Sports"
    ],
    "domains": [
      "www.skysports.com",
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Watch highlights from a rain-affected opening game of the Women's World Cup as India fight back following a middle-order collapse to defeat Sri Lanka by 59 runs.",
      "<ul><li><p>India, 269-8, beat Sri Lanka, 211, by 59 runs (DLS)</p></li><li><p>Sharma scores 53 and takes three wickets in Guwahati</p></li></ul><p>Deepti Sharma impressed with bat and ball as India defeat fellow co-hosts Sri Lanka by 59 runs (Duckworth-Lewis-Stern method) in the rain-affected openin",
      "Amanjot Kaur scored her maiden Women's Cricket World Cup half-century as India began their campaign with a 59-run victory (DLS Method) over Sri Lanka in a rain-affected opening encounter in Guwahati."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/1f4d/live/3b0b7d80-9e26-11f0-b741-177e3e2c2fc7.jpg",
    "titles": [
      "India secure opening-day World Cup win over Sri Lanka",
      "Deepti Sharma leads India rally to deny Sri Lanka in Cricket World Cup opener",
      "Amanjot impresses as India beat Sri Lanka in rain-affected World Cup opener"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.868,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.71,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Deepti Sharma starred with a half-century and three wickets, leading India to a 59-run victory over Sri Lanka under the Duckworth-Lewis-Stern method in the rain-affected Women's World Cup opener in Guwahati. Amanjot Kaur also scored her maiden World Cup half-century, contributing to India's total of 269-8 before restricting Sri Lanka to 211.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Jets Trim Training Camp Roster to 35, NHL Teams Adjust Lineups",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Tue, 30 Sep 2025 22:47:41 +0000",
    "source": "Global News",
    "sources": [
      "NHL",
      "Global News"
    ],
    "domains": [
      "news.google.com",
      "globalnews.ca"
    ],
    "snippets": [
      "The Jets made five more cuts on Tuesday, leaving the team with 35 players left in training camp.",
      "<a href=\"https://news.google.com/rss/articles/CBMigAFBVV95cUxPVmdqV3BxUFFhTGgxNlloMEsydFUtN1FmU1gyQUJtYU56ay1RRmJsMU1DSFh1eGVDMnZ2UVp6VHdkVk1EaG5IaUJBNUhadWJqbEhCS3ZEUHAxSEphU1M5UExZTm9FTDBELTl0R0NCbk9acFk3bHpfb1ZOZ2tjOHJaWQ?oc=5\" target=\"_blank\">Flames Reduce Training Camp Roster</a>&nbsp;&nbsp;<fo",
      "<a href=\"https://news.google.com/rss/articles/CBMimgFBVV95cUxNb1VCOWRDdmpoQmtuOXA1cXJMeDEzOGFQOV94eHNrUFlxbFBwdExaZ2cxZi11YUcyalFBRV96SWMzZDFOWUEzcDY4N2RCWUVHQ1ltYXd1X3k4VkpLaVJTVXhkajZyZS1DcWJzVVZVUXdobDJNZzJidmJZRGN4Vk13eU5xVmI4ZktXd2M5bERTRnBLRUphZ1dDekdn?oc=5\" target=\"_blank\">Flyers Make Changes"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/JETS-CAMP.jpg?quality=65&strip=all",
    "titles": [
      "Winnipeg Jets trim training camp roster by 5",
      "Flames Reduce Training Camp Roster - NHL.com",
      "Flyers Make Changes to Training Camp Roster - NHL.com"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.971,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.706,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Jets have reduced their training camp roster to 35 players after making five cuts on Tuesday. This move is part of the team's preparation for the upcoming season. Meanwhile, other teams like the Flames and Flyers are also making adjustments to their training camp rosters, indicating a common practice among NHL teams as they finalize their lineups.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Truck Overturns Near Whatcom Road Exit, No Injuries Reported",
    "domain": "general",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Tue, 30 Sep 2025 21:16:24 +0000",
    "source": "Global News",
    "sources": [
      "Ottawa Citizen",
      "Global News"
    ],
    "domains": [
      "ottawacitizen.com",
      "globalnews.ca"
    ],
    "snippets": [
      "The crash happened just after 8 p.m. near the Whatcom Road exit, with a truck flipping its load onto the road. Police said that no one was injured.",
      "The driver was caught attempting to turn the wrong way on Isabella Street shortly after 4 a.m. Tuesday."
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/Hwy-1-Whatcom-Road-Semi-Crash-Abby-PD-X.png",
    "titles": [
      "Semi-truck driver detained for impaired driving following Abbotsford crash",
      "Wrong-way driver charged with impaired driving in downtown Ottawa"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.941,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.693,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A truck overturned near the Whatcom Road exit just after 8 p.m., spilling its load onto the road. Police confirmed there were no injuries. Separately, the driver was caught making an illegal turn on Isabella Street around 4 a.m. Tuesday.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Lynx's Collier Criticizes WNBA Leadership and Officiating",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 30 Sep 2025 19:53:07 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.espn.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Lynx star Napheesa Collier said the WNBA has the \"worst leadership\" and accused commissioner Cathy Engelbert of being \"negligent\" in her governance.",
      "<p>Minnesota Lynx superstar Napheesa Collier delivers a statement on the state of the WNBA, calling out league officials for allowing poor officiating and failing to do right by its players.</p>",
      "<p>Minnesota Lynx star Napheesa Collier is joining her coach in raising alarm bells about the state of the WNBA.</p>"
    ],
    "image_url": "",
    "titles": [
      "Collier blasts WNBA's Engelbert: 'Worst leadership'",
      "Collier sounds off on WNBA brass: ‘Worst leadership in the world’",
      "Lynx star Napheesa Collier on WNBA: ‘Worst leadership in the world’"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.994,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.689,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Napheesa Collier, a star player for the Minnesota Lynx, criticized the WNBA's leadership, specifically targeting Commissioner Cathy Engelbert for negligence. Collier accused the league of poor officiating and not adequately supporting its players, aligning her concerns with her coach's previous statements about the league's governance issues.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "LeBron James Misses Lakers Camp Due to Nerve Irritation, Expected to Recover",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 30 Sep 2025 19:53:07 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "LeBron James was sidelined to open training camp Tuesday with what the Lakers are calling \"a little bit of nerve irritation in the glute.\"",
      "James wasn't a participant at practice but the Lakers intend to have him ready for opening night"
    ],
    "image_url": "",
    "titles": [
      "LeBron out to start camp; eyeing longer ramp-up",
      "LeBron James sidelined to start training camp: Lakers plan 'longer ramp up' for star amid glute injury"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.994,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.689,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "LeBron James missed the Lakers' opening training camp on Tuesday due to nerve irritation in his glute. Despite not practicing, the team plans for him to be ready for the season's opening night.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Chelsea Wins 1-0 Against Benfica, Mourinho's Popularity Endures",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 30 Sep 2025 19:50:59 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sky Sports"
    ],
    "domains": [
      "www.skysports.com",
      "www.espn.com"
    ],
    "snippets": [
      "Maresca's Chelsea beat Mourinho's Benfica in the Champions League, but the reception from fans made it clear which manager is revered.",
      "Chelsea collected their first win of the Champions League league phase as they beat former manager Jose Mourinho's Benfica 1-0 at Stamford Bridge."
    ],
    "image_url": "",
    "titles": [
      "Mourinho reception at Stamford Bridge shows how far Maresca needs to go with Chelsea",
      "Chelsea sneak past Benfica in CL as Mourinho makes Stamford Bridge return"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.993,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.686,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Chelsea secured their first Champions League victory of the season by defeating Benfica 1-0 at Stamford Bridge. Despite the win against Jose Mourinho's team, the fan reception highlighted Mourinho's enduring popularity among Chelsea supporters.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Kaprizov Stands Out in Wild's History Amid NHL Contract Discussions",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 30 Sep 2025 19:45:22 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.espn.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Here's how Connor McDavid, Mikko Rantanen, Kyle Connor and others should feel after the winger's new pact.",
      "<p>Over the quarter-century that covers the Minnesota Wild&#8217;s modest existence in the NHL, Kirill Kaprizov has made himself one of a kind.</p>"
    ],
    "image_url": "",
    "titles": [
      "Winners and losers of Kirill Kaprizov's NHL record-setting contract",
      "Wild sign star Kirill Kaprizov to record-setting contract extension"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.991,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.678,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Kirill Kaprizov has distinguished himself as a unique player in the Minnesota Wild's 25-year history, according to discussions around the impact of a new contract for a fellow NHL winger. This contract has implications for players like Connor McDavid, Mikko Rantanen, and Kyle Connor, suggesting a benchmark or point of comparison for their own negotiations or contracts.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Angels' Washington, Montgomery Exit; Team Seeks New Manager for 2026",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 30 Sep 2025 19:40:07 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.espn.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "The offseason carousel has started. Here's who is out -- and who could be in line to replace them.",
      "<p>The Los Angeles Angels will have a new skipper in 2026.</p>"
    ],
    "image_url": "",
    "titles": [
      "Tracking MLB offseason manager changes: Washington won't return to Angels, who else is out?",
      "Ron Washington won’t return as Angels manager"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.989,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.678,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Ron Washington and Ray Montgomery will not return as managers for the Los Angeles Angels in 2026, following Washington's absence due to heart surgery. The Angels are among at least four MLB teams seeking new managers this offseason, as confirmed by a source to ESPN.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "U.S. Government to Acquire 5% Stake in Lithium Americas for Nevada Project",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Tue, 30 Sep 2025 22:46:07 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Financial Post"
    ],
    "domains": [
      "www.cnbc.com",
      "financialpost.com"
    ],
    "snippets": [
      "U.S. Energy Secretary Chris Wright told Bloomberg TV that the U.S. government will take a 5% stake in the company.",
      "The US government agreed to acquire a stake in Lithium Americas Corp., Secretary of Energy Chris Wright said, giving a boost to the Canadian company as it develops its Thacker Pass lithium project in Nevada."
    ],
    "image_url": "",
    "titles": [
      "Lithium Americas stock pops 35% as government takes a stake to boost Nevada project",
      "US to Take Stake in Lithium Americas to Boost Nevada Project"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.951,
      "consensus": 0.591,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.665,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The U.S. government has agreed to acquire a 5% stake in Lithium Americas Corp., as announced by Energy Secretary Chris Wright. This move supports the Canadian company's development of the Thacker Pass lithium project in Nevada, aiming to boost lithium production.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: development, support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "US President Signals Pending Deal with 'Linda' Amid Funding Freeze for Harvard",
    "domain": "business",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Tue, 30 Sep 2025 22:01:25 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "Forbes"
    ],
    "domains": [
      "www.theguardian.com",
      "www.forbes.com"
    ],
    "snippets": [
      "<p>US president says ‘Linda is finishing up the details’ but not clear whether university ready to announce agreement</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/live/2025/sep/30/us-government-shutdown-funding-trump-vance-portland-hegseth-latest-updates\">US politics – latest updates</",
      "The settlement comes after the Trump administration froze $2.2 billion in funding for Harvard and attempted to stop international student enrollment at the university."
    ],
    "image_url": "https://i.guim.co.uk/img/media/4ebb849bdc33b51db208e524748d741a14f54ae0/446_0_4446_3559/master/4446.jpg?width=140&quality=85&auto=format&fit=max&s=a4d3fedf9c6666a75ed061d8ea141c8c",
    "titles": [
      "Trump says $500m deal reached with Harvard to settle dispute",
      "Harvard May Settle Government Dispute For $500 Million, Trump Says"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.936,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.652,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The US President indicated that an agreement is being finalized by 'Linda', though it's unclear if the university is ready to announce it. This follows the Trump administration's freeze of $2.2 billion in funding for Harvard and efforts to halt international student enrollment.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Tigers Beat Guardians 2-1 in AL Wild Card Series Opener, Skubal Strikes 14",
    "domain": "business",
    "source_domain": "www.forbes.com",
    "location": "global",
    "published": "Tue, 30 Sep 2025 16:58:26 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes",
      "Sportsnet"
    ],
    "domains": [
      "www.forbes.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Two unearned runs scored on costly errors, costing the Cleveland Guardians a loss against the Detroit Tigers.",
      "<p>Tarik Skubal tied Detroit&#8217;s post-season record with 14 strikeouts and the Tigers beat the Cleveland Guardians 2-1 on Tuesday in Game 1 of their AL Wild Card Series.</p>"
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/68dc429c3c2c9a7240d8da11/0x0.jpg?width=960",
    "titles": [
      "Detroit Tigers Take Cleveland Guardians Game One Of Wild Card Series",
      "Tarik Skubal fans 14 as Tigers top Guardians in Game 1 of wild-card series"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.935,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.649,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In Game 1 of their AL Wild Card Series, the Detroit Tigers defeated the Cleveland Guardians 2-1, largely due to two unearned runs resulting from costly errors by the Guardians. Tarik Skubal of the Tigers tied the team's post-season record with 14 strikeouts during the game.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Disney Escalates Legal Action Against AI Firms with Cease and Desist to Characte",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Tue, 30 Sep 2025 19:30:18 GMT",
    "source": "Axios",
    "sources": [
      "CNBC",
      "Axios"
    ],
    "domains": [
      "www.cnbc.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMickFVX3lxTE9naW4zYmdWaGMzRUdseTJzRVdLOTVLNDJKZXoyNS1SVjhOY0ZuN2pvUFE1cTh0M0o3UlJ4QnF2U1JpWTlWaDFLSVVINGozTzJHMEVQRl9oeG9TOTlOVWthZXh6MHBiN0ptc21LSF9JOEp2Zw?oc=5\" target=\"_blank\">Scoop: Disney sends cease and desist letter to Character.AI</a>&nbsp;&nbs",
      "Disney is already involved in an ongoing lawsuit against AI image creator Midjourney."
    ],
    "image_url": "",
    "titles": [
      "Scoop: Disney sends cease and desist letter to Character.AI - Axios",
      "Disney sent cease and desist letter to Character.AI over use of copyrighted characters"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.888,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.64,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Disney has issued a cease and desist letter to Character.AI, escalating its legal actions in the tech space. This follows an ongoing lawsuit against AI image creator Midjourney, indicating Disney's increasing legal scrutiny of AI companies using its copyrighted content.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]