[
  {
    "title": "Charlie Kirk, Conservative Activist, Killed at Utah Event; Suspect in Custody",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Wed, 10 Sep 2025 19:25:18 -0400",
    "source": "NPR",
    "sources": [
      "Axios",
      "Deutsche Welle",
      "ABC News",
      "Business Insider",
      "Al Jazeera",
      "LA Times",
      "NPR",
      "Financial Times",
      "The Guardian",
      "CityNews",
      "The Verge",
      "Fortune"
    ],
    "domains": [
      "www.latimes.com",
      "ottawa.citynews.ca",
      "www.npr.org",
      "fortune.com",
      "www.aljazeera.com",
      "www.ft.com",
      "news.google.com",
      "www.businessinsider.com",
      "www.dw.com",
      "abcnews.go.com",
      "www.theguardian.com",
      "www.theverge.com"
    ],
    "snippets": [
      "Kirk, the founder of Turning Point USA, was arguably the most influential voice in young conservatism, and played a pivotal role in President Trump's return to the White House.",
      "Conservative American activist Charlie Kirk was shot during a campus event at Utah Valley University.",
      "Governor and FBI director say a suspect has been taken into custody.",
      "Charlie Kirk was fielding questions during a speaking engagement at a university when he was struck in the neck by a gunshot. Authorities say a suspect is in custody.",
      "<a href=\"https://news.google.com/rss/articles/CBMifkFVX3lxTE1ReTF0LXBBWFYycnJQeTBReEV6UzhrNEg1Q1pUUnlBM25XN2w0TjZFaExWMFJLWlkxWm05clV2a3BobVlyd0tEWXlrZk5RNUFxbUpjeERmbGs1SWdiNk1iQWJRVkdzeUlmRWhOem94d2hERjN2MnBJZjJobDdEdw?oc=5\" target=\"_blank\">Charlie Kirk dies after being shot at campus event in Uta",
      "Conservative youth activist Charlie Kirk has been shot during an event at Utah Valley University, according to law enforcement sources.",
      "Conservative activist was attacked while addressing students on university campus",
      "<p>Officials giving update on deadly attack on Trump ally say person is being interviewed; person arrested earlier is no longer a suspect </p><ul><li><p><a href=\"https://www.theguardian.com/us-news/2025/sep/10/charlie-kirk-shot-utah\">Trump ally Charlie Kirk shot during event at Utah Valley Universit",
      "Charlie Kirk, the cofounder and executive director of Turning Point USA, was shot at an event at Utah Valley University on Wednesday.",
      "The co-founder and CEO of the youth organization Turning Point USA, the 31-year-old Kirk is the latest victim in a spasm of political violence across the United States.",
      "Charlie Kirk, the influencer and activist who co-founded right-wing group Turning Point USA, has died at the age of 31 after being shot while speaking at an event at Utah Valley University, according to his spokesperson Andrew Kolvet, speaking to the New York Times. Deseret News had earlier reported",
      "The person suspected of fatally shooting conservative activist Charlie Kirk on a Utah college campus Wednesday is now in custody. That&#8217;s according to a social media post from FBI Director Kash Patel. THIS IS A BREAKING NEWS UPDATE. AP’s earlier story follows below. OREM, Utah (AP) — Charlie Ki",
      "<p>Kirk, a founder of Turning Point USA, has been instrumental in recruiting young Americans on college campuses to GOP voter rolls, making himself an indispensable part of Republican campaigns.</p>"
    ],
    "image_url": "",
    "titles": [
      "Charlie Kirk, a Trump ally and voice for young conservatives, is shot down at age 31",
      "Trump: conservative activist Charlie Kirk dead after being shot",
      "Right-wing activist Charlie Kirk dies after being shot at Utah university",
      "US: Conservative pundit Charlie Kirk shot dead in Utah",
      "Charlie Kirk dies after being shot at campus event in Utah - Axios",
      "WATCH:  Political activist Charlie Kirk shot at event in Utah, sources say",
      "Trump ally Charlie Kirk shot dead in Utah",
      "Trump ally Charlie Kirk has died after being shot at university event, with suspect still at large – latest updates",
      "Charlie Kirk, conservative activist and Trump ally, was shot dead at a Utah campus event",
      "Trump: Conservative activist Charlie Kirk has died after being shot at a Utah college event",
      "Charlie Kirk fatally shot at Turning Point USA event in Utah",
      "Conservative activist Charlie Kirk fatally shot at Utah college event; shooter in custody, FBI says",
      "Charlie Kirk was a force with young conservatives, boosting GOP and Trump"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.984,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.872,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Charlie Kirk, co-founder of Turning Point USA and a prominent conservative activist, was shot and killed during a speaking event at Utah Valley University. The incident has heightened concerns about political violence in the United States. Authorities have reported that a suspect is now in custody in connection with the shooting. Kirk, 31, was known for his influential role in engaging young Americans in conservative politics and had played a significant part in political campaigns, including President Trump's return to the White House.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Poland Reports 19 Airspace Breaches, Blames Belarus and Russia; NATO Responds",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-09-10T13:24:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Axios",
      "Washington Post",
      "Deutsche Welle",
      "ABC News",
      "New York Times",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "news.google.com",
      "www.dw.com",
      "abcnews.go.com",
      "www.washingtonpost.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "NATO member Poland said it scrambled defenses in response to 19 airspace breaches. Polish Prime Minister Donald Tusk said many of the drones came from Belarus. DW has the latest.",
      "<a href=\"https://news.google.com/rss/articles/CBMihAFBVV95cUxOUFd1dlpHZ1BCMWNTYU84TVNLOHFnM0I2NjcwN0JJQnExNmxONzJNZldXVnpjX0FmUHhRSHpFdGJWN3BRcTJQa29PMEVQbVpvemNIdWtoMU5Oa1dUY1QwU1JiUGZreXV3OFVIc3BrS3pGNk9UanZucWtVSnkwT0VSejdzMlY?oc=5\" target=\"_blank\">Poland, NATO leaders condemn Russian drones in P",
      "Military officials in Poland say the country's airspace was \"repeatedly violated by drone-type objects\" in the overnight hours amid Russian strikes on targets in Ukraine.",
      "<p>Donald Tusk says Poland dealing with a large-scale provocation after at least 19 violations of Polish airspace</p><p>Poland’s prime minister, Donald Tusk, said the country is closer to military conflict “than at any time since the second world war” as Warsaw and Nato allies weighed a response to ",
      "The military called the breach of Poland’s airspace “unprecedented,” and it triggered a request by Warsaw to consult with fellow NATO members.",
      "The incursion was the first time alliance planes had engaged enemy targets in NATO airspace. Poland’s leader called it “a large-scale provocation.”",
      "Poland accused Russia of violating its airspace 19 times overnight, during its bombardment of neighboring Ukraine. Moscow denies the drones are Russian.",
      "Article 4 allows member states to start a formal discussion within the alliance about threats to their security. It does not commit the alliance to military action."
    ],
    "image_url": "",
    "titles": [
      "Poland calls NATO meeting after downing Russian drones",
      "Poland, NATO leaders condemn Russian drones in Polish airspace - Axios",
      "WATCH:  NATO downs Russian drones over Poland",
      "Poland ‘closer to military conflict than at any time since WW2’ as Nato allies weigh response to Russian drones",
      "NATO says it scrambled fighter jets, shot down Russian drones over Poland",
      "NATO Says It Scrambled Fighter Jets to Shoot Down Russian Drones Over Poland",
      "What to know as Poland invokes NATO Article 4, citing Russian drone violation",
      "Poland Has Invoked NATO’s Article 4. What Comes Next?"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.799,
      "consensus": 1.0,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.82,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Poland reported 19 airspace breaches, attributing many to drones from Belarus, and accused Russia of involvement. This prompted Poland to scramble defenses and consult with NATO, marking the first time NATO planes engaged targets within its airspace. The incidents led to NATO deploying fighter jets to counter what was described as a deliberate provocation. Moscow denies the drones were Russian. The situation triggered discussions under NATO's Article 4 but does not automatically lead to military action.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Prince Harry, King Charles III Reunite in London After 19 Months",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 10 Sep 2025 19:04:28 GMT",
    "source": "BBC",
    "sources": [
      "Washington Post",
      "Forbes",
      "New York Times",
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "www.bbc.com",
      "www.forbes.com",
      "www.washingtonpost.com",
      "www.theguardian.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "There had been no face to face meeting between father and son since February 2024.",
      "The last time the pair met was in February 2024, the day after the palace announced that Charles was receiving treatment for an undisclosed form of cancer.",
      "Father and son had tea at the king’s London residence on Wednesday, in what may be a first step toward healing a painful rift that has divided Britain’s royal family.",
      "<p>Clarence House meeting comes after Duke of Sussex expressed hope of a reconciliation with his family in May</p><p>Prince Harry met King Charles at Clarence House on Wednesday, their first face-to-face meeting for 19 months.</p><p>The private tea in London, which lasted 54 minutes, comes after the",
      "Prince Harry and King Charles III last met in February 2024, following Charles’ cancer diagnosis."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/6c64/live/a5dbef90-8e69-11f0-84c8-99de564f0440.jpg",
    "titles": [
      "Prince Harry meets King Charles for first time in more than a year",
      "Tea with dad — Prince Harry meets King Charles for first time in 19 months",
      "Prince Harry Reunites With King Charles for First Time in Over a Year",
      "Prince Harry visits King Charles in first face-to-face meeting for 19 months",
      "Prince Harry Meets With King Charles For First Time In 19 Months"
    ],
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.88,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.805,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Prince Harry met with King Charles III at Clarence House in London for the first time in 19 months since February 2024, following the announcement of Charles' cancer diagnosis. The private meeting, lasting 54 minutes, is seen as a potential step towards reconciling the rift within Britain's royal family. This encounter comes after Prince Harry expressed hope for reconciliation with his family in May.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Qatar Denounces Israeli Airstrikes in Doha as \"State Terrorism\"",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Wed, 10 Sep 2025 16:29:19 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "New York Times",
      "Washington Post"
    ],
    "domains": [
      "www.npr.org",
      "www.washingtonpost.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "Qatar slams Israeli attacks on Hamas leaders in Doha as \"state terrorism\" after the bombardment rocks the tiny U.S. ally and dashes hopes of a ceasefire in Gaza",
      "Gaza City residents face an impossible choice as Israel steps up attacks: Escape and try to survive elsewhere in the enclave, or risk death.",
      "Why did Israel attack? Who was killed? What has been the Qatari response? Here are answers to those and other key questions."
    ],
    "image_url": "",
    "titles": [
      "Israel's attacks on Hamas in Qatar stun the Gulf and dash chances for a Gaza ceasefire",
      "Israel escalates attacks on Gaza City as Qatar strike scuttles ceasefire talks",
      "Israel’s Strike on Hamas in Qatar: What to Know"
    ],
    "score_components": {
      "magnitude": 0.887,
      "recency": 0.926,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.768,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Qatar condemned Israeli airstrikes targeting Hamas leaders in Doha, labeling them \"state terrorism.\" These attacks disrupted prospects for a ceasefire in Gaza, where residents now face the dilemma of fleeing or risking death amid escalating violence. The specifics of casualties and the broader implications of Qatar's response remain central concerns.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Cowboys' DaRon Bland Injures Foot, Could Miss Weeks",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Wed, 10 Sep 2025 19:26:44 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Yahoo Sports",
      "CBS Sports"
    ],
    "domains": [
      "www.usatoday.com",
      "sports.yahoo.com",
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "Cowboys cornerback DaRon Bland, who injured his right foot in Monday's practice, could be sidelined for a couple of weeks, sources told ESPN.",
      "Bland just signed a four-year extension in the offseason",
      "Dallas Cowboys cornerback DaRon Bland suffered a right foot injury during Monday's practice, and it could sideline him for a couple of weeks, according an ESPN report.",
      "The Cowboys could be without one of their defensive stars after DaRon Bland reportedly suffered a foot injury during practice. Here's the latest."
    ],
    "image_url": "",
    "titles": [
      "Sources: Cowboys' Bland (foot) could miss weeks",
      "DaRon Bland injury: Cowboys CB could miss multiple weeks with yet another setback, per report",
      "Cowboys CB DaRon Bland could miss couple of weeks with right foot injury he suffered in practice: Report",
      "DaRon Bland injury update: Cowboys CB could miss 'couple of weeks' with foot injury"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.984,
      "consensus": 0.809,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.764,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Dallas Cowboys cornerback DaRon Bland injured his right foot in Monday's practice and may be sidelined for several weeks, according to ESPN sources. Bland, who recently signed a four-year extension, is considered a key player in the Cowboys' defense.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Week 2 Fantasy Football Rankings and Projections Released, Texas A&M Snubbed",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Wed, 10 Sep 2025 19:26:44 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sports Illustrated",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "news.google.com",
      "www.espn.com"
    ],
    "snippets": [
      "Weekly individual and composite rankings for each position in PPR and IDP formats, as well as Eric Karabell's superflex ranks.",
      "Goff is set to bounce right back in week 2",
      "Updated Dynasty rankings for quarterback, running back, wide receiver, and tight end",
      "Wide receivers you want in your Week 2 lineups, and those you should avoid",
      "Quarterbacks you want in Week 2 lineups, and those you should avoid",
      "<a href=\"https://news.google.com/rss/articles/CBMinwFBVV95cUxOU2hTWTM4RG9zQXV6UWpuaXh0ZzljaE9CV0JObjZTN3FSaTFWNDVuenR1VHEzOG1WLXB0aGFYeVRkb1hJSWRQVHpKUHNQMmpuWHJOeDRqY0RkaE9oeW94MVhQNEZZVE1YejhjNFJfSlNlQno3LUFfZkpYdjhVVWt2Q2xNdWFnS3JfWjNxQkVtUmxLZEI4NUhKRVdVLUo5d2c?oc=5\" target=\"_blank\">Defense & Ki",
      "<a href=\"https://news.google.com/rss/articles/CBMinAFBVV95cUxOeGNMVlotREh5QnhtaVVvVjRGQkt4MVc0RFhBb3B3clo2ejNnTENFd2drVGIzdjBKMWJJZjBwUHg4Z3hPUHR3WlpYLW9vdjZHZWJsemIyRFNIZlRFWjlwckxORHJXTXVWY2JaclZ6bXNCVGliTG1iaW5KZGlJZGNTeHdWZUc2ZkxuQVpWa3N0VEh0THZpcjRwOHozN3U?oc=5\" target=\"_blank\">Running Back Sta",
      "<a href=\"https://news.google.com/rss/articles/CBMimAFBVV95cUxPWEdtUkp2N3hEckJ1S1BtQ2trX0lFZHVFUU9DbW5tdlBEZElmVjJPeVNieDNib2RITGZPdC1mM2xhOXJZQXR3Y0lNa1ZzWkN5TWlmcW5nUDVwcS14LU44NE1LM2ZXMmtITUptQkxYaUxhRnBIRG5JTWRTY1FubkRJOEZ5NmhYUWVIdmRkZmtGbGJ1RGh5aGhYOQ?oc=5\" target=\"_blank\">Tight End Start 'Em, "
    ],
    "image_url": "",
    "titles": [
      "🏈 Fantasy football: Updated week 2 rankings",
      "Fantasy Football Week 2 Start 'Em & Sit 'Em: Jared Goff gets back on track, plus sleepers at every position",
      "Fantasy Football Dynasty Rankings Update for Week 2: Harold Fannin and Jacory Croskey-Merritt are surging",
      "Fantasy Football Week 2 Start 'Em & Sit 'Em Wide Receivers: Who to start, bench, sleepers and bust of the week",
      "Fantasy Football Week 2 Start 'Em & Sit 'Em Quarterbacks: Justin Herbert a must play, plus more QBs to stream",
      "Defense & Kicker Start 'Em, Sit 'Em For Fantasy Football Week 2 - Sports Illustrated",
      "Running Back Start ‘Em, Sit ‘Em For Fantasy Football Week 2 - Sports Illustrated",
      "Tight End Start 'Em, Sit 'Em For Fantasy Football Week 2 - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.984,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.758,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Weekly fantasy football rankings for PPR and IDP formats, and superflex ranks by Eric Karabell, have been released. SportsLine's model offers Week 2 projections, PPR rankings, and start-sit advice for various platforms. Despite many polls ranking Texas A&M in the top 25, CBS Sports' Brandon Marcello does not include them. Key players like Lamar Jackson, Christian McCaffrey, Ja'Marr Chase, and Brock Bowers are highlighted in Week 2 positional rankings for the 2025 NFL season. Steelers' Chris Boswell made headlines with a 60-yard field goal among his four in Week 1, affecting kicker rankings. Fa",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Charlie Kirk Shot at Utah University; Suspect in Custody",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Wed, 10 Sep 2025 16:45:09 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "The Guardian",
      "Forbes"
    ],
    "domains": [
      "www.npr.org",
      "www.forbes.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Utah officials say the suspected shooter was dressed in \"all dark clothing\" and fired from a long distance, potentially on a roof.",
      "<p>Rightwing activist shot in neck while speaking at Utah Valley University and FBI director says suspect in custody</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/live/2025/sep/10/donald-trump-jeffrey-epstein-tariffs-immigration-crime-us-politics-live-news-updates\">Charlie Kirk shooting",
      "The governor said he doesn’t believe another person was involved in the shooting."
    ],
    "image_url": "",
    "titles": [
      "'Person of interest' in custody after Charlie Kirk shot dead at Utah college event",
      "Trump ally Charlie Kirk fatally shot in Utah as ‘person of interest’ in custody",
      "‘Person Of Interest’ In Charlie Kirk Shooting Taken Into Custody, Utah Governor Says (Live Updates)"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.931,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.748,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A rightwing activist, Charlie Kirk, was shot in the neck while speaking at Utah Valley University. The suspected shooter, described as wearing all dark clothing and firing from a long distance, possibly from a roof, is now in custody, according to the FBI director. Utah officials, including the governor, believe the shooter acted alone.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "NASA Finds Potential Signs of Ancient Life in Mars Rock Sample",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Wed, 10 Sep 2025 16:14:56 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "Deutsche Welle",
      "NASA"
    ],
    "domains": [
      "www.npr.org",
      "www.dw.com",
      "www.nasa.gov"
    ],
    "snippets": [
      "Ancient organisms may have left microscopic \"biosignatures\" on Mars. That's according to NASA scientists, who say a rock sample offers the most concrete proof yet that the red planet once hosted life.",
      "The discovery is among the strongest evidence yet that the red planet may have once harbored life. . However, scientists say more study is needed, ideally in labs on Earth.",
      "Lee este comunicado de prensa en español aquí. A sample collected by NASA’s Perseverance Mars rover from an ancient dry riverbed in Jezero Crater could preserve evidence of ancient microbial life. Taken from a rock named “Cheyava Falls” last year, the sample, called “Sapphire Canyon,” contains poten"
    ],
    "image_url": "",
    "titles": [
      "Life on Mars? NASA says a rock sample shows potential signs of ancient life",
      "NASA rover discovers potential signs of ancient life on Mars",
      "NASA Says Mars Rover Discovered Potential Biosignature Last Year"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.921,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.746,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "NASA scientists have discovered a rock sample on Mars, named \"Sapphire Canyon,\" which may contain microscopic \"biosignatures\" suggesting ancient microbial life. This evidence, collected by the Perseverance rover from an ancient riverbed in Jezero Crater, represents some of the strongest indications of past life on Mars. Further analysis on Earth is required to confirm these findings.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Ex-FBI Officials Sue, Claiming Retaliation for Probing Trump",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Wed, 10 Sep 2025 19:06:13 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Deutsche Welle",
      "Axios",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.dw.com",
      "news.google.com"
    ],
    "snippets": [
      "Fired FBI officials allege dismissals were part of a retaliatory campaign targeting US agents seen as disloyal to Trump.",
      "Three former senior officials have said they were fired without cause as part of a \"campaign of retribution\" against those who had worked on previous criminal investigations against Donald Trump.",
      "<a href=\"https://news.google.com/rss/articles/CBMidkFVX3lxTE16dnZ5TTRtMlRoSzIxRDRuNGc0aXR4Qm51RzFnYmZXQUkzSDRveVpMamtLdmxyelhMZ2lNM1hSS2EzVzRMdklYZFV2SEZibEJ6ZUlzU0tLTFhrYUluVDBheElGQnhBOVV3QmtLR2hOeGRwVlhhbEE?oc=5\" target=\"_blank\">Former FBI officials fired by Patel and Bondi sue claiming retaliati"
    ],
    "image_url": "",
    "titles": [
      "Fired FBI officials sue Trump administration for ‘illegal retribution’",
      "Former FBI leaders sue Trump administration over firings",
      "Former FBI officials fired by Patel and Bondi sue claiming retaliation - Axios"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.899,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.731,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Three former senior FBI officials claim they were unjustly fired as part of a retaliatory campaign for their involvement in criminal investigations against Donald Trump. They allege their dismissals were aimed at agents viewed as disloyal to Trump, marking a significant accusation of retribution within the agency. The officials have taken legal action, suing for what they perceive as wrongful termination.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Vikings, Falcons Release Injury Reports; Cashman Out with Hamstring Injury",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Wed, 10 Sep 2025 21:56:51 +0000",
    "source": "CBS Sports",
    "sources": [
      "Yahoo Sports",
      "Sports Illustrated",
      "CBS Sports"
    ],
    "domains": [
      "www.dailynorseman.com",
      "www.cbssports.com",
      "news.google.com"
    ],
    "snippets": [
      "London practiced in a limited capacity Wednesday",
      "The Minnesota Vikings and Atlanta Falcons have issued their first injury reports of the week in advance of their Sunday night showdown. Here they are: Minnesota Vikings Did not participate Limited participation Full participation For the Vikings, Blake Cashman has a hamstring injury he suffered in M",
      "<a href=\"https://news.google.com/rss/articles/CBMinAFBVV95cUxNNFgtRWJ3OTkzVHNRSUZaTjZUeEFyd3dPNTBqOFpzbGpYeTJtTV9YSWlRNGxZdmQ4UW9VUUtaTV9aZldoM1J5OTYxdXI5TlgycVVJSWdINlJVWFFjYzZVVkJMRHlEdG9QdTRsSFJOLXU3bVN1VGJhV2lkMktfYkxQNk1uNjJiZkE1bm0wMkJySUVaV3lZbXNiMzRSc3g?oc=5\" target=\"_blank\">Vikings face num"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/10/da69ab9c-0f69-47a3-90bc-5bb6b709b3ef/drake-london-getty.png",
    "titles": [
      "Drake London injury update: Falcons coach Raheem Morris expects star WR to play in Week 2 vs. Vikings",
      "First Injury Report: Falcons at Vikings",
      "Vikings face numerous injury concerns ahead of Falcons clash - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.954,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.728,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Minnesota Vikings and Atlanta Falcons have released their initial injury reports ahead of their Sunday game. For the Vikings, Blake Cashman is notable for not participating due to a hamstring injury. The reports detail player participation levels, indicating who may be limited or fully available for the upcoming match.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Larry Ellison Tops Musk as World's Richest After Oracle's AI-Driven Surge",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Wed, 10 Sep 2025 19:43:29 +0000",
    "source": "Al Jazeera",
    "sources": [
      "The Guardian",
      "Axios",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.theguardian.com",
      "news.google.com"
    ],
    "snippets": [
      "The switch in the ranking came after a blockbuster earnings report from Oracle, powered by multibillion-dollar orders.",
      "<a href=\"https://news.google.com/rss/articles/CBMieEFVX3lxTE5neHFhRkxKT3F1Wm5YU1hVcW5NRU1JR2M3MkpxM3JwVFQxYUlvaXE5d0xQMmo3SjJGYzlNT1VlSERydGIzeVgxR0N0QzlGMGN0bF9OeFE5ZW0zaFQ1Z1QzVTFpeVhmdmg3Sjd2R2M2Um52QW02RzBlRA?oc=5\" target=\"_blank\">Oracle's Larry Ellison surpasses Elon Musk as world's richest per",
      "<p>Oracle co-founder’s shares rose by 40% in early trading, valuing his fortune at $393bn, just ahead of Musk’s $384bn</p><p>US tech billionaire Larry Ellison is neck-and-neck with Elon Musk in the contest to be the world’s richest person after briefly overtaking the Tesla chief executive on Wednesd"
    ],
    "image_url": "",
    "titles": [
      "Oracle’s Ellison surpasses Tesla’s Musk to be world’s richest man",
      "Oracle's Larry Ellison surpasses Elon Musk as world's richest person - Axios",
      "Larry Ellison briefly overtakes Elon Musk as world’s richest person"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.911,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.726,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Larry Ellison of Oracle has become the world's richest person, surpassing Elon Musk, following a significant surge in Oracle's market value by over $290 billion due to an impressive quarter driven by AI growth. Economists were extremely impressed by Oracle's AI growth projections. Musk previously held the title for 300 days.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Canelo Alvarez vs. Terence Crawford: Historic Title Fight in Las Vegas",
    "domain": "sports",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Wed, 10 Sep 2025 15:52:19 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Yahoo Sports",
      "Al Jazeera",
      "Forbes"
    ],
    "domains": [
      "www.forbes.com",
      "www.aljazeera.com",
      "sports.yahoo.com"
    ],
    "snippets": [
      "All to know about the unified super middleweight title blockbuster clash.",
      "Who holds the edge in the historic showdown between Saul “Canelo” Alvarez and Terence “Bud” Crawford? Seven of boxing's most accomplished minds break it all down.",
      "We look at the line-up for the undercard for Saturday's Canelo Alvarez vs. Terence Crawford undisputed super middleweight title fight in Las Vegas."
    ],
    "image_url": "",
    "titles": [
      "Canelo Alvarez vs Terence Crawford: Fight card, start time, where to watch",
      "'Canelo has slipped': Boxing's best trainers break down Canelo Alvarez vs. Terence Crawford superfight",
      "Canelo Alvarez Vs. Terence Crawford Fight Card Undercard"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.841,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.705,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Saul \"Canelo\" Alvarez and Terence \"Bud\" Crawford are set to face off in a historic undisputed super middleweight title fight in Las Vegas. Seven respected boxing experts have analyzed the match-up, providing insights into who holds the edge. Additionally, the undercard for the event on Saturday has been announced, featuring several bouts leading up to the main event.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "49ers QB Brock Purdy Likely Out for Saints Game, Coach Says",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Wed, 10 Sep 2025 19:26:44 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "49ers quarterback Brock Purdy is \"a long shot\" to play Sunday at the New Orleans Saints, coach Kyle Shanahan told reporters.",
      "<p>The injury troubles are already piling up for the San Francisco 49ers once again.</p>"
    ],
    "image_url": "",
    "titles": [
      "49ers' Purdy unlikely to play, could miss weeks",
      "49ers’ Purdy a ‘long shot’ to play Week 2, could miss ‘multiple weeks’"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.984,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.684,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "San Francisco 49ers quarterback Brock Purdy is unlikely to play against the New Orleans Saints on Sunday, according to coach Kyle Shanahan. This announcement adds to the team's growing list of injury concerns.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Lamar Jackson Apologizes for Shoving Bills Fan in Week 1 Incident",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Wed, 10 Sep 2025 19:26:44 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Yahoo Sports"
    ],
    "domains": [
      "www.usatoday.com",
      "www.espn.com"
    ],
    "snippets": [
      "Ravens quarterback Lamar Jackson apologized to the Buffalo Bills fan that he shoved in retaliation on Sunday night.",
      "The Ravens' star quarterback got in a very brief shoving match with a fan during &quot;Sunday Night Football&quot; in Week 1."
    ],
    "image_url": "",
    "titles": [
      "Lamar apologizes to fan but 'just chill next time'",
      "Ravens QB Lamar Jackson tells fan who shoved him to 'just chill next time'"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.984,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.677,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Ravens quarterback Lamar Jackson apologized to a Buffalo Bills fan he shoved during \"Sunday Night Football.\" The brief altercation occurred in Week 1. Jackson expressed regret for the incident.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "SportsLine Releases Week 2 NFL Survivor Picks for ESPN Challenge",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Wed, 10 Sep 2025 17:44:17 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "NFL survivor pool strategy, predictions and picks for ESPN Eliminator Challenge Week 2.",
      "SportsLine's advanced computer model just locked in its top Week 2 NFL survivor picks"
    ],
    "image_url": "",
    "titles": [
      "Survivor pool strategy: The top teams to take in Week 2",
      "NFL football knockout, survivor pool picks, advice, strategy guide for Week 2, 2025: Avoid the Niners"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.95,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.67,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "SportsLine's advanced computer model has released its Week 2 NFL survivor picks for the ESPN Eliminator Challenge. These selections are based on comprehensive data analysis to guide participants in making strategic choices for their survivor pools. The specific picks were not disclosed in the summary.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UEFA Women's Champions League Unveils New League Phase with 6 English Clubs",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Wed, 10 Sep 2025 16:24:59 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sky Sports"
    ],
    "domains": [
      "www.skysports.com",
      "www.espn.com"
    ],
    "snippets": [
      "We're going to take you on a guided tour of the new UEFA Women's Champions League and show you how the draw and the format work.",
      "The Champions League is back with six English clubs involved and the league phase format here to stay &#8211; here&#8217;s everything you need to know..."
    ],
    "image_url": "",
    "titles": [
      "How the new league phase format plays out",
      "Champions League 2025/26: How does league phase work?"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.924,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.665,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The UEFA Women's Champions League has introduced a league phase format, involving six English clubs. This guide explains the draw process and the structure of the competition, ensuring fans understand how the tournament operates.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "OpenAI Buys $300B in Oracle Computing Power in Historic Cloud Deal",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-09-10T19:01:10-04:00",
    "source": "The Verge",
    "sources": [
      "TechCrunch",
      "The Verge"
    ],
    "domains": [
      "techcrunch.com",
      "www.theverge.com"
    ],
    "snippets": [
      "OpenAI and Oracle signed a deal “to purchase $300 billion in computing power over roughly five years,” one of the largest cloud computing deals ever, reports the Wall Street Journal. In July, the two companies revealed their partnership to build data centers worth 4.5 gigawatts of power as part of t",
      "OpenAI and Oracle reportedly signed a deal that includes OpenAI buying $300 billion of compute over a five-year span."
    ],
    "image_url": "",
    "titles": [
      "OpenAI reportedly signs $300 billion Project Stargate cloud deal with Oracle",
      "OpenAI and Oracle reportedly ink historic cloud computing deal"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.976,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.657,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "OpenAI and Oracle have entered into a significant agreement, with OpenAI set to purchase $300 billion in computing power from Oracle over five years. This deal, one of the largest in cloud computing history, follows their July announcement to construct data centers with a capacity of 4.5 gigawatts.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Conservative Activist Charlie Kirk Fatally Shot in Utah, Prompting Reactions",
    "domain": "technology",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Wed, 10 Sep 2025 18:31:32 -0400",
    "source": "ABC News",
    "sources": [
      "ABC News",
      "The Verge"
    ],
    "domains": [
      "abcnews.go.com",
      "www.theverge.com"
    ],
    "snippets": [
      "President Donald Trump and lawmakers across the political spectrum are reacting after conservative activist Charlie Kirk was shot and killed at an event in Utah.",
      "Horrifying videos of influencer and right-wing activist Charlie Kirk being fatally shot were widely available on social media platforms. We’ve reached out to some of the platforms to ask how they will be treating the videos and charged posts about the shooting. So far, we’re aware of responses from "
    ],
    "image_url": "https://s.abcnews.com/images/US/charlie-kirk-9-rt-gmh-250910_1757539849153_hpMain_4x3t_384.jpg",
    "titles": [
      "Outpouring of grief from Trump, other leaders after Charlie Kirk fatal shooting",
      "How platforms are responding to the Charlie Kirk shooting"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.966,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.648,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Charlie Kirk, a conservative activist and influencer, was fatally shot at an event in Utah, prompting reactions from President Donald Trump and lawmakers from various political affiliations. Videos of the incident have circulated on social media, leading to inquiries about how platforms will handle the content. The current status of platform responses remains partially unspecified.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Merck Scraps £1bn London Research Center, Cuts 125 Jobs Over UK Competitiveness",
    "domain": "business",
    "source_domain": "www.ft.com",
    "location": "global",
    "published": "Wed, 10 Sep 2025 16:33:10 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times",
      "The Guardian"
    ],
    "domains": [
      "www.ft.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "US company says country is ‘not internationally competitive’ and lays off 125 staff",
      "<p>New blow to UK’s key life science sector as industry body says country is losing ground on investment and research</p><p>The US drugmaker Merck has scrapped a £1bn London research centre and is laying off 125 scientists in the capital this year, in a big blow to the UK’s important life science se"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F149532f6-14bb-41ac-90e6-feee7e67c3c7.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Merck slams UK as it scraps £1bn London drug research centre",
      "US drugmaker Merck scraps £1bn London research centre and cuts 125 science jobs"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.835,
      "consensus": 0.591,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.642,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "US drugmaker Merck has canceled plans for a £1bn research center in London and is laying off 125 scientists, citing concerns over the UK's international competitiveness in the life science sector. This decision marks a significant setback for the UK's ambitions in life sciences, as an industry body highlights the country's declining position in investment and research.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: plan, research",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Appeals Decision on Cook's Fed Board Tenure to Supreme Court",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Wed, 10 Sep 2025 17:54:50 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMifkFVX3lxTE9iMUFDcFgzLTlUd096b3VmTEljcnB4VncxbXJLbkRQSEc3dmNvSkRzLTFJOXN5cno4bFAtbnluWWtYcHpfNHgwOUZpODNDMjZobnA5WXEzTVl1N3M4Qy05OVA1N2dSMzBtYXNJTTV3LUZHMUhKbmZSc3VDZ1hVdw?oc=5\" target=\"_blank\">Trump appeals judge's order letting Cook stay on Fed boar",
      "The Supreme Court is expected to make the final decision on the question of whether President Trump has legal cause to remove Cook from the Federal Reserve."
    ],
    "image_url": "",
    "titles": [
      "Trump appeals judge's order letting Cook stay on Fed board - Axios",
      "Trump appeals order blocking him from firing Fed Governor Lisa Cook"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.859,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.634,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Former President Trump has appealed a judge's decision that allows Cook to remain on the Federal Reserve board. The Supreme Court is anticipated to resolve whether Trump has the legal authority to remove Cook.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Sony Launches PlayStation Family App for Parental Controls",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-09-10T13:43:34-04:00",
    "source": "The Verge",
    "sources": [
      "TechCrunch",
      "The Verge"
    ],
    "domains": [
      "techcrunch.com",
      "www.theverge.com"
    ],
    "snippets": [
      "PlayStation is launching a new PlayStation Family app for iOS and Android to help parents manage their child’s playtime on PS5 and PS4. Parents can already set parental control features directly on a console, but this app gives parents another way to set limits and keep track of what their kid is pl",
      "While Sony has long offered parental controls, the new app brings all of these tools into one dedicated place for easier access."
    ],
    "image_url": "",
    "titles": [
      "PlayStation launches new app for parental controls",
      "Sony rolls out new ‘PlayStation Family’ parental controls app"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.874,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.63,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Sony has released a PlayStation Family app for iOS and Android, designed to help parents manage their child's playtime on PS5 and PS4. This app consolidates existing parental control features into one platform, allowing for easier access to set limits and monitor activity.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "TechCrunch Disrupt 2025 Set for SF, Focus on AI Voice Tech with ElevenLabs CEO",
    "domain": "technology",
    "source_domain": "techcrunch.com",
    "location": "global",
    "published": "Wed, 10 Sep 2025 17:00:00 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com"
    ],
    "snippets": [
      "TechCrunch Disrupt 2025 hits Moscone West in San Francisco from October 27 to 29, bringing together 10,000+ startup and VC leaders for three days of bold ideas, groundbreaking tech, and future-shaping conversations.",
      "From audiobooks and dubbing to gaming and avatars, AI-generated voice is breaking into the mainstream — and Mati Staniszewski, CEO and co-founder of ElevenLabs, is helping lead the charge. At TechCrunch Disrupt 2025, he’ll take the stage to talk about what it takes to make voice AI truly human."
    ],
    "image_url": "",
    "titles": [
      "Humanoids, AVs, and what’s next in AI hardware at TechCrunch Disrupt 2025",
      "Exploring the future of voice AI with Mati Staniszewski at TechCrunch Disrupt 2025"
    ],
    "score_components": {
      "magnitude": 0.393,
      "recency": 0.861,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.447,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "TechCrunch Disrupt 2025 will be held at Moscone West in San Francisco from October 27 to 29, attracting over 10,000 startup and VC leaders for discussions on innovative technology. A highlight will be Mati Staniszewski, CEO of ElevenLabs, discussing the advancement of AI-generated voice technology towards human-like quality.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]