[
  {
    "title": "Iconic Fashion Designer Giorgio Armani Dies at 91",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Thu, 04 Sep 2025 10:38:19 -0400",
    "source": "NPR",
    "sources": [
      "Washington Post",
      "Financial Times",
      "The Guardian",
      "Deutsche Welle",
      "BBC",
      "NPR"
    ],
    "domains": [
      "www.dw.com",
      "www.theguardian.com",
      "www.washingtonpost.com",
      "www.bbc.com",
      "www.ft.com",
      "www.npr.org"
    ],
    "snippets": [
      "Armani's clothes highlight the body as an object of art. Celebrities have flaunted his fashion on red carpets for decades. He revolutionized the suit jacket, with casual silhouettes and softer colors.",
      "He worked his way up from a Milan department store to a global empire that changed the way we dress.",
      "The Piacenza native founded the Milan-based luxury fashion company of the same name in 1975. Prime Minister Giorgia Meloni called him a \"symbol of the best of Italy.\"",
      "Founder of world’s largest private luxury brand transformed his industry",
      "<p>His company pays tribute to its ‘tireless driving force’ who pioneered soft power dressing and built a global empire</p><p>Giorgio Armani, the celebrated Italian fashion designer who built a global empire, has died at the age of 91, his company said on Thursday.</p><p>“With infinite sorrow, the A",
      "He brought refinement to the power suit, transforming contemporary fashion. “He was completely radical,” said designer Paul Smith."
    ],
    "image_url": "",
    "titles": [
      "Fashion designer Giorgio Armani, whose name became synonymous with luxury, dies at 91",
      "A style guru who revolutionised fashion - Giorgio Armani dies aged 91",
      "Italian fashion icon Giorgio Armani dies",
      "Giorgio Armani, fashion designer and businessman, 1934-2025",
      "Giorgio Armani, celebrated Italian fashion designer, dies at 91",
      "Giorgio Armani, whose streamlined fashions ruled the red carpet, dies at 91"
    ],
    "score_components": {
      "magnitude": 0.986,
      "recency": 0.819,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.834,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Giorgio Armani, the iconic Italian fashion designer known for revolutionizing the suit with casual silhouettes and softer colors, has died at the age of 91. His company, founded in Milan in 1975, confirmed his peaceful passing surrounded by loved ones. Armani, celebrated for his contributions to modern Italian style and elegance, transformed global fashion with his designs. Prime Minister Giorgia Meloni hailed him as a symbol of the best of Italy. His legacy includes being the founder of the world's largest privately-owned luxury fashion brand.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump to Sign Order Renaming Defense Department to Department of War",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 04 Sep 2025 22:58:13 GMT",
    "source": "BBC",
    "sources": [
      "Forbes",
      "ABC News",
      "BBC",
      "Axios"
    ],
    "domains": [
      "abcnews.go.com",
      "www.bbc.com",
      "news.google.com",
      "www.forbes.com"
    ],
    "snippets": [
      "The US president has sought to refocus the department on \"warfighting\" and a \"warrior ethos\".",
      "<a href=\"https://news.google.com/rss/articles/CBMid0FVX3lxTE5ENDJYTUxaT3Y3VXNfdWxGXzM0VlF0dnlubDdzbGtXTi1VWlVSdmtKYl9TV3o3WGpXc0JUOXozV2c4VWFZbDhYY3pUeHYyYW01Z3RzeUVMNk04MkJ3Ni1obkhGOWtCS3ZCekpZVEdwd0U3XzZTQVIw?oc=5\" target=\"_blank\">Trump seeks to rename Department of Defense to Department of War</a",
      "The formal renaming would require Congress to act, but the order is expected to say the new name can be used in official correspondence and ceremonial contexts.",
      "The name change will be made official through an executive order Trump is slated to sign Friday."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/8495/live/2902a9e0-89e2-11f0-9169-2d5f04c84218.jpg",
    "titles": [
      "Trump to rebrand Pentagon as Department of War",
      "Trump seeks to rename Department of Defense to Department of War - Axios",
      "Trump to sign order renaming Pentagon 'Department of War': Sources",
      "Defense Department Being Renamed Department Of War Under Trump Executive Order"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.954,
      "consensus": 0.908,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.797,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "President Trump plans to sign an executive order renaming the Department of Defense to the Department of War, emphasizing a focus on \"warfighting\" and a \"warrior ethos.\" The change, which can be used in official correspondence and ceremonial contexts, requires Congressional approval for full implementation.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Daniel Levy Steps Down as Tottenham Chairman After 25 Years",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 04 Sep 2025 21:37:06 GMT",
    "source": "BBC",
    "sources": [
      "CBS Sports",
      "BBC",
      "The Guardian",
      "Al Jazeera"
    ],
    "domains": [
      "www.bbc.com",
      "www.cbssports.com",
      "www.theguardian.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Daniel Levy has left Tottenham after almost 25 years as executive chairman of the Premier League club.",
      "Levy&#039;s departure comes after Spurs secured the UEFA Europa League last season but finished 17th in the Premier League.",
      "Levy, the longest-serving chairman in the Premier League, exits Spurs after 24 years at the club's helm",
      "Levy, 63, the longest-serving chairman in the Premier League, has called it quits",
      "<ul><li><p>Chair’s 25-year tenure concludes with mixed legacy</p></li><li><p>New leadership team includes Enic director Charrington</p></li></ul><p>Daniel Levy has left his role as the chair of Tottenham, eased aside after almost 25 years in charge and leaving a legacy that is best described as mixe"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/3ac4/live/327a2670-89b4-11f0-98cc-8182b2586301.jpg",
    "titles": [
      "Daniel Levy steps down as Tottenham executive chairman after 24 years",
      "Daniel Levy steps down as Tottenham chairman after divisive 25-year tenure",
      "Despite imperfections, Daniel Levy leaves impressive legacy as Tottenham Hotspur chairman",
      "Daniel Levy surprisingly steps down as Tottenham executive chairman: What does move mean for Spurs?",
      "Daniel Levy eased aside at Tottenham as club seek new path and investment"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.927,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.782,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Daniel Levy has stepped down as the executive chairman of Tottenham after nearly 25 years, marking the end of the longest tenure for a chairman in the Premier League. His departure follows a season where Spurs won the UEFA Europa League but finished 17th in the Premier League. Levy's exit is part of a leadership change that includes the introduction of Enic director Charrington to the new team.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Germany Suffers Historic 2-0 Loss to Slovakia in World Cup Qualifier",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Thu, 04 Sep 2025 21:51:36 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Deutsche Welle",
      "Forbes",
      "Sportsnet",
      "Al Jazeera"
    ],
    "domains": [
      "www.dw.com",
      "www.sportsnet.ca",
      "www.forbes.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Germany begin their World Cup qualifying group with defeat by Slovakia, the third straight loss for four-time winners.",
      "Germany's 2026 World Cup qualifying campaign got off to a disastrous start as they suffered a deserved 2-0 defeat to Slovakia. Furious head coach Julian Nagelsmann questioned his team's mentality.",
      "For the first time in history, Germany has lost a World Cup qualifier away from home. On Thursday, Die Nationalmannschaft was defeated 2-0 by Slovakia in Bratislava.",
      "<p>Germany lost an away World Cup qualifying game for the first time in a 2-0 upset against Slovakia on Thursday, which threw its campaign to reach the 2026 tournament into immediate jeopardy.</p>"
    ],
    "image_url": "",
    "titles": [
      "Germany shocked by Slovakia with third loss in row as World Cup path begins",
      "Germany suffer shock World Cup qualifying loss to Slovakia",
      "Germany Suffer Historic 2-0 Defeat Against Slovakia",
      "Germany stunned by Slovakia in rare World Cup qualifying loss"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.952,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.78,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Germany's 2026 World Cup qualifying campaign began with a historic 2-0 defeat to Slovakia, marking their first-ever away loss in a World Cup qualifier. This setback is Germany's third consecutive defeat, putting their campaign for the 2026 tournament in jeopardy. Head coach Julian Nagelsmann expressed frustration over the team's performance and mentality.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Afghanistan Earthquake Kills 2,200; Terrain, Bans Hinder Rescue Efforts",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Thu, 04 Sep 2025 16:32:32 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Deutsche Welle",
      "New York Times",
      "The Guardian",
      "Al Jazeera"
    ],
    "domains": [
      "www.dw.com",
      "www.nytimes.com",
      "www.theguardian.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "An aftershock hit the quake-hit area of Afghanistan on Thursday as aid organisations struggle to reach survivors.",
      "Taliban authorities report the death toll has climbed as rescue teams struggle to reach isolated areas after an earthquake struck Afghanistan's mountainous eastern region. Another tremor hit the area late on Thursday.",
      "<p>South-east of country rocked as rescuers struggle to find survivors of first quake </p><p>A magnitude 6.2 earthquake has shaken <a href=\"https://www.theguardian.com/world/afghanistan\">Afghanistan</a> as the death toll from the devastating quake on Sunday rose to more than 2,200.</p><p>It struck s",
      "<p>Aid agencies plead for funds as rough terrain hinders relief effort and 98% of buildings in one province are damaged</p><p>Hundreds more bodies have been recovered from houses in mountain villages destroyed by a major earthquake in Afghanistan early this week, pushing the death toll to more than ",
      "A prohibition on contact between unrelated women and men meant many women’s wounds went untended and some were left trapped under rubble after a deadly earthquake, witnesses said."
    ],
    "image_url": "",
    "titles": [
      "Afghanistan earthquake death toll rises to 2,200",
      "Afghanistan earthquake death toll tops 2,200",
      "Third earthquake hits Afghanistan as death toll rises above 2,200",
      "Afghan earthquake death toll jumps to more than 2,200, say Taliban",
      "After Afghanistan Earthquake, Women Tell of Being Shunned by Male Rescuers"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.852,
      "consensus": 0.908,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.777,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Afghanistan experienced a magnitude 6.2 earthquake, followed by an aftershock, causing over 2,200 deaths. The disaster struck the country's mountainous eastern region, severely damaging 98% of buildings in one province. Rescue efforts are hindered by difficult terrain and a Taliban-imposed prohibition affecting medical treatment for women. Aid organizations are urgently requesting funds to assist survivors and reach isolated areas.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Travis Kelce on Engagement to Taylor Swift: \"Living Life on a High\"",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Thu, 4 Sep 2025 18:28:38 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet",
      "CBS Sports"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "The Kansas City Chiefs tight end kept things lighthearted about his relationship and engagement to the superstar singer/songwriter.",
      "Kelce says he is 'living life on a high' after his engagement to the pop superstar went public",
      "<p>Kansas City Chiefs tight end and three-time Super Bowl winner Travis Kelce made teammate Patrick Mahomes and reporters laugh on Thursday when asked what has changed in his life since announcing his engagement to pop superstar Taylor Swift last week.</p>"
    ],
    "image_url": "",
    "titles": [
      "Travis Kelce talks engagement to Taylor Swift in Brazil",
      "Travis Kelce says he got 'one more ring' from engagement to Taylor Swift as Chiefs TE enters last year of deal",
      "‘One more ring’: Travis Kelce enjoying life since engagement to Taylor Swift"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.964,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.754,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Kansas City Chiefs tight end Travis Kelce, after announcing his engagement to pop superstar Taylor Swift, shared he's \"living life on a high.\" His comments, made during a press conference, amused teammates and reporters. Kelce, a three-time Super Bowl winner, kept the mood light when discussing how his life has changed since the engagement went public.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "26 Nations Pledge Postwar Security for Ukraine, Including Troops Deployment",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 04 Sep 2025 17:26:57 GMT",
    "source": "BBC",
    "sources": [
      "New York Times",
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "www.bbc.com",
      "www.nytimes.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "The French president also says US support for the \"Coalition of the Willing\" would be finalised in the coming days.",
      "<p>French president says allies would either deploy ‘reassurance force’ troops to Ukraine, or be present in the area on land, sea or in the air</p><p>Twenty-six nations have pledged to provide postwar security guarantees to Ukraine, including an international force on land and sea and in the air, Em",
      "The pledges were made in Paris at a summit designed to show that Europe is ready to uphold any future peace deal for Ukraine."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/ca11/live/355f8f20-89e0-11f0-84c8-99de564f0440.jpg",
    "titles": [
      "Macron says 26 countries ready to send troops for Ukraine ceasefire",
      "Macron says 26 nations ready to provide postwar military backing to Ukraine",
      "Macron Said That 26 Countries Would Secure Ukraine"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.85,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.731,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "At a summit in Paris, 26 nations pledged to provide postwar security guarantees to Ukraine, including deploying an international force on land, sea, and air. The French President announced that US support for the \"Coalition of the Willing\" would be finalized soon, highlighting a commitment to either deploy 'reassurance force' troops to Ukraine or maintain a presence in the region. This move demonstrates Europe's readiness to support any future peace deal for Ukraine.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "South Africa Clinches Series Against England with Narrow Victory at Lord's",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Thu, 04 Sep 2025 21:11:46 GMT",
    "source": "BBC",
    "sources": [
      "Sky Sports",
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "www.bbc.com",
      "www.skysports.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "England's poor form in white-ball cricket continues as they are beaten by South Africa to lose the second one-day international and the series with a game to spare.",
      "England's poor form in white-ball cricket continued as they were beaten by South Africa to lose the second one-day international and the series with a game to spare.",
      "<ul><li><p><a href=\"https://www.theguardian.com/sport/cricket/match/2025-09-04/england-cricket-team\">2nd ODI: South Africa, 330-8, bt England, 325-9, by 5 runs</a></p></li><li><p>Visitors secure series despite Archer’s late cameo</p></li></ul><p>It has been a South African summer at Lord’s. After th",
      "South Africa wrapped up a one-day international series victory over England with a match to spare after holding on to claim a dramatic five-run win in the second ODI at Lord&#8217;s.",
      "Full highlights from Lord's as half-centuries for England's Jacob Bethell, Joe Root and Jos Buttler came in vain with South Africa edging to a series-sealing, five-run victory"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/7c6d/live/b2bc1320-89c8-11f0-84c8-99de564f0440.jpg",
    "titles": [
      "England beaten to lose South Africa ODI series",
      "England take match to final ball but South Africa clinch series",
      "Breetzke helps South Africa edge England to clinch second men’s ODI and series",
      "South Africa pip England in ODI thriller to secure series win",
      "Highlights: South Africa edge England in dramatic ODI to claim series victory"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.919,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.728,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "South Africa defeated England by 5 runs in the second one-day international at Lord's, securing the series victory with one game left. Despite half-centuries from England's Jacob Bethell, Joe Root, and Jos Buttler, South Africa's total of 330-8 proved just enough to edge out England's 325-9. This loss continues England's poor performance in white-ball cricket.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "RFK Jr. Faces Criticism from Dems, HHS Staff Over Health Policy Approach",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Thu, 04 Sep 2025 18:37:11 +0000",
    "source": "Al Jazeera",
    "sources": [
      "ABC News",
      "Axios",
      "Al Jazeera"
    ],
    "domains": [
      "abcnews.go.com",
      "news.google.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "RFK Jr faces bipartisan criticism for allegedly undermining vaccine trust and reshaping public health leadership.",
      "<a href=\"https://news.google.com/rss/articles/CBMif0FVX3lxTE5VZkhGRFAzdjlUR2VVYU9hUTBjX0t3VXVOeUhJV1N1SjQ1ZTlSYTJjM0x4YkNZSWVNbGpjMERDQy1OXzBnTkZvNTR4YTV6TF96a1RROG8yQkppdFRLVUNBbENWM1pKUlJJYUY0MG05SjF4RXlzWHhDNkotVzI4YVk?oc=5\" target=\"_blank\">RFK Jr. testifies at Senate hearing amid CDC, vaccine up",
      "HHS Secretary Robert F. Kennedy Jr. faced a grilling before the Senate Finance Committee on Thursday over CDC turmoil and vaccine changes. Here are four takeaways."
    ],
    "image_url": "",
    "titles": [
      "Senate clashes with RFK Jr over vaccine policies and CDC firings",
      "RFK Jr. testifies at Senate hearing amid CDC, vaccine upheaval - Axios",
      "Amid RFK Jr.'s fiery Senate hearing over CDC turmoil, vaccines, here are 4 takeaways"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.89,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.725,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Democratic lawmakers and over a thousand current and former HHS staff have criticized RFK Jr.'s actions as harmful to public health. RFK Jr., however, contends that his efforts are aimed at reforming the system, stating he is fulfilling his promise to \"clean house.\" This controversy came to light during a Senate hearing, highlighting the deep divide over his approach to health policy and its implications.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Texans' Kirk Doubtful for Week 1 Due to Hamstring Injury",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Thu, 04 Sep 2025 21:04:57 +0000",
    "source": "CBS Sports",
    "sources": [
      "Yahoo Sports",
      "Sports Illustrated",
      "CBS Sports"
    ],
    "domains": [
      "news.google.com",
      "www.cbssports.com",
      "texanswire.usatoday.com"
    ],
    "snippets": [
      "Houston's receiver depth will be on display in Week 1",
      "Christian Kirk is could be missing time after suffering a hamstring injury ahead of the Week 1 showdown for the Houston Texans",
      "<a href=\"https://news.google.com/rss/articles/CBMifkFVX3lxTE1qdktoMll3YTVVVDFKLVRKWWxmTmJHS1FLRkljRHFiS09zakJ1SE1BUTdMdGRVY0hvd25KNnlRSVFDQkxTVmxjS09lUGZXeU5lZXBmYWZHM2paai1CSVFxMUlTOTRDVzUxTHVyQkZHR3prYW96TXIzb0xnVWVXUQ?oc=5\" target=\"_blank\">Texans Get Concerning Injury Update on WR Christian Kirk<"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/04/076bd1f7-b380-4a4f-8f36-f1ddc53a4855/kirk.jpg",
    "titles": [
      "Christian Kirk injury: Texans receiver to miss Week 1 showdown vs. Rams with strained hamstring, per report",
      "Texans WR Christian Kirk expected to miss at least two games with hamstring injury",
      "Texans Get Concerning Injury Update on WR Christian Kirk - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.936,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.724,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Houston Texans are facing a receiver depth challenge in Week 1 as Christian Kirk may miss time due to a hamstring injury. The team is concerned about Kirk's availability for the upcoming game.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Takes Control of D.C. Police, Deploys National Guard; Orsted Fights Stop-W",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Thu, 04 Sep 2025 19:10:06 GMT",
    "source": "CNBC",
    "sources": [
      "Forbes",
      "CNBC",
      "New York Times"
    ],
    "domains": [
      "www.nytimes.com",
      "www.forbes.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "President Donald Trump last month put the D.C. police department under federal control and deployed hundreds of National Guard troops to the city.",
      "Orsted asked the United States District Court for the District of Columbia to set aside the stop-work order, calling it \"unlawful\" and \"issued in bad faith.\"",
      "The Danish company behind Revolution Wind, a $6 billion project off Rhode Island, said the federal government had unlawfully halted work on the wind farm.",
      "The National Guard will have been deployed in the U.S. capital for three and a half months by the time the extension expires."
    ],
    "image_url": "",
    "titles": [
      "DC sues Trump administration over National Guard deployment",
      "Orsted sues to save offshore wind farm from Trump administration axe",
      "Orsted Sues Trump Administration in Fight to Restart Its Blocked Wind Farm",
      "National Guard’s DC Stay Extended To November As City Sues Trump Over Deployment"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.881,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.72,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "President Donald Trump placed the D.C. police under federal control and deployed National Guard troops to the capital for 3.5 months. Meanwhile, Orsted, the Danish firm behind the $6 billion Revolution Wind project off Rhode Island, is challenging a stop-work order in court, labeling it \"unlawful\" and \"bad faith.\" The company argues the federal government improperly halted construction on the wind farm.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Congo Faces Deadly Virus Outbreak: 28 Cases, 15 Dead in Kasai Province",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Thu, 04 Sep 2025 16:33:01 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Deutsche Welle",
      "New York Times",
      "Al Jazeera"
    ],
    "domains": [
      "www.dw.com",
      "www.nytimes.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Authorities suspect 28 cases of the deadly virus, with the latest recorded in the southern Kasai province.",
      "The Health Ministry of the Democratic Republic of Congo said that samples tested confirmed the presence of the Zaire strain of the virus. It said there were currently 28 suspected cases and 15 people had died.",
      "Health officials have recorded 28 suspected cases and 15 fatalities so far in the latest outbreak of the deadly virus, which has claimed thousands of lives in previous outbreaks in the Central African country."
    ],
    "image_url": "",
    "titles": [
      "DR Congo announces new Ebola outbreak",
      "DR Congo reports new Ebola outbreak with 15 dead",
      "Ebola Outbreak Is Declared in Kasai Province of Congo"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.852,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.714,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Democratic Republic of Congo is experiencing an outbreak of the Zaire strain of a deadly virus, with the Health Ministry confirming 28 suspected cases, including 15 fatalities. The latest case was recorded in the southern Kasai province. This strain has been responsible for thousands of deaths in past outbreaks in the country.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Amari Cooper Retires Before 2025 Season, Days After Raiders Deal",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Thu, 4 Sep 2025 18:48:47 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.espn.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Wide receiver Amari Cooper has informed the Raiders that he intends to retire just days before the team will open the 2025 season at New England.",
      "<p>Five-time Pro Bowl wide receiver Amari Cooper retired Thursday, a little more than a week after signing a one-year contract to return to the Las Vegas Raiders.</p>"
    ],
    "image_url": "",
    "titles": [
      "WR Cooper informs Raiders he's retiring from NFL",
      "Raiders’ Amari Cooper retires from NFL"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.971,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.681,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Amari Cooper, a five-time Pro Bowl wide receiver, announced his retirement from professional football just days before the 2025 season opener. This decision came shortly after signing a one-year contract to return to the Las Vegas Raiders.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Mike Clay's Playbook Adds Shadow Report for Week 1 NFL Fantasy Insights",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Thu, 4 Sep 2025 18:48:47 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Yahoo Sports"
    ],
    "domains": [
      "www.espn.com",
      "www.sportingnews.com",
      "sports.yahoo.com"
    ],
    "snippets": [
      "Mike Clay's Playbook now includes the Shadow Report, providing an all-encompassing look at Week 1's matchups to exploit and avoid in fantasy.",
      "Dominate your Week 1 matchups with all of our fantasy football content, all in one place!",
      "Weather is one of the many factors that go into making a start or sit decision. Here's everything to know about the Week 1 NFL forecasts that could impact"
    ],
    "image_url": "",
    "titles": [
      "🏈 The Playbook: Week 1 fantasy football guide",
      "Fantasy Football Week 1: Rankings, sleepers, start/sit advice and more",
      "NFL Weather Week 1: Fantasy football start, sit decisions to watch for rain, wind forecasts"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.971,
      "consensus": 0.611,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.679,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Mike Clay's Playbook has expanded to include the Shadow Report, offering detailed insights on Week 1 NFL matchups for fantasy football players. This comprehensive guide aims to help users make informed decisions on starting or sitting players based on matchups and weather forecasts, among other factors. All relevant fantasy football content for Week 1 is now accessible in one location to assist players in dominating their matchups.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "WTA Doubles Star Muhammad Adopts Wilson",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Thu, 4 Sep 2025 19:20:38 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "The Guardian"
    ],
    "domains": [
      "www.espn.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "On Thursday, Muhammad, currently ranked No. 17 in doubles and the winner of 13 doubles titles on the WTA Tour, announced she had adopted Wilson.",
      "<ul><li><p>Latest news and updates from Flushing Meadows</p></li><li><p>Email <a href=\"mailto:beau.dure@theguardian.com\">beau.dure@theguardian.com</a> with your thoughts</p></li></ul><p><strong>Highlight time. </strong>A second double fault already for Pegula, but she forces Sabalenka to stretch for"
    ],
    "image_url": "",
    "titles": [
      "US Open rescue pup wins over Aryna Sabalenka -- and finds a home with Asia Muhammad",
      "US Open tennis 2025 women’s semi-finals: Aryna Sabalenka v Jessica Pegula – live"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.982,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.676,
    "summary_source": "snippet",
    "summary_reason": "retry_exhausted",
    "summary": "On Thursday, Muhammad, currently ranked No. 17 in doubles and the winner of 13 doubles titles on the WTA Tour, announced she had adopted Wilson.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Suárez Apologizes for Spitting on Sounders Staffer After Cup Loss",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Thu, 4 Sep 2025 18:48:47 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Yahoo Sports"
    ],
    "domains": [
      "www.espn.com",
      "sports.yahoo.com"
    ],
    "snippets": [
      "Luis Suárez apologized for spitting on a Seattle Sounders staffer following Sunday's Leagues Cup final loss.",
      "Things got heated in the minutes after the Sounders defeated Inter Miami 3-0 in the Leagues Cup final.",
      "Inter Miami forward Luis Suárez apologized Thursday for his behavior following his team's defeat by the Seattle Sounders in the Leagues Cup final earlier this week, antics that became the latest entry on a long list of on-field transgressions over his lengthy career.  Suárez — a longtime teammate of"
    ],
    "image_url": "",
    "titles": [
      "Suárez apologizes for spitting on Sounders staffer",
      "Inter Miami's Luis Suárez apologizes after inciting fight, spitting on Sounders staff member after Leagues Cup",
      "Inter Miami's Luis Suárez apologizes for on-field antics after Leagues Cup final loss to Seattle"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.971,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.674,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Luis Suárez, Inter Miami forward, apologized for spitting on a Seattle Sounders staffer after his team lost 3-0 in the Leagues Cup final. This incident adds to Suárez's history of controversial actions throughout his career.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "NY Attorney General Appeals to Reinstate Trump Fraud Penalty",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Thu, 04 Sep 2025 21:25:28 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "A lower court said in August that the huge fine on President Donald Trump and his company violated the U.S. Constitution's ban on excessive fines.",
      "<p>Letitia James seeks to reverse appeals court’s decision to wipe away president’s penalty in financial fraud case</p><p>New York’s attorney general has requested the state’s highest court reinstate Donald Trump’s large civil fraud penalty, appealing a lower-court decision <a href=\"https://www.theg"
    ],
    "image_url": "",
    "titles": [
      "New York AG appeals reversal of Trump's $500 million fraud penalty",
      "New York attorney general urges court to reinstate Trump’s $500m fraud fine"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.924,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.647,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "New York's Attorney General, Letitia James, has appealed to the state's highest court to reinstate a large civil fraud penalty against Donald Trump and his company. This comes after a lower court ruled in August that the fine was excessive and violated the U.S. Constitution. The outcome of James' appeal is pending.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Waymo Expands to Austin and Atlanta, Adds California Airport Rides",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Thu, 04 Sep 2025 21:29:18 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "Waymo has launched commercial operations in Austin, Texas, as well as Atlanta, San Francisco, Phoenix and Los Angeles.",
      "It's the first airport in California that Waymo will offer rides to and from. The company's been active at the Phoenix airport for nearly two years."
    ],
    "image_url": "",
    "titles": [
      "Waymo to begin testing at San Jose airport this fall",
      "Waymo cleared to offer robotaxi rides at San Jose airport"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.925,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.647,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Waymo has expanded its commercial operations to Austin, Texas, and Atlanta, joining San Francisco, Phoenix, and Los Angeles. This includes offering rides to and from the first airport in California, building on nearly two years of operations at the Phoenix airport.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UK AI Institute Chief Resigns Amid Criticism and Calls for Reform",
    "domain": "business",
    "source_domain": "www.ft.com",
    "location": "global",
    "published": "Thu, 04 Sep 2025 17:02:27 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times",
      "The Guardian"
    ],
    "domains": [
      "www.ft.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Technology secretary Peter Kyle branded flagship national AI agency a “failing organisation”",
      "<p>Jean Innes says it is time for ‘new chapter’ at AI research body, after staff revolt and government calls for change</p><p>The chief executive of the UK’s leading artificial intelligence institute is stepping down after a <a href=\"https://www.theguardian.com/technology/2025/aug/18/shut-it-down-an"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Ff86af324-69eb-4061-aaac-ef8dfa9659f0.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Alan Turing Institute head to quit after internal turmoil",
      "Head of UK’s beleaguered Alan Turing Institute resigns"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.843,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.641,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Jean Innes, the chief executive of the UK's top artificial intelligence institute, announced her resignation amid staff unrest and government demands for reform. This follows Technology Secretary Peter Kyle's criticism of the agency as a \"failing organization\". Innes stated it was time for a \"new chapter\" at the AI research body.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: research",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "British Teams Advance to US Open Finals in Wheelchair, Men's Doubles",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "national",
    "published": "Thu, 04 Sep 2025 23:50:08 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports",
      "Sportsnet"
    ],
    "domains": [
      "www.bbc.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "British wheelchair doubles pair Alfie Hewett and Gordon Reid cruise through to the final of the US Open, where they will go for a 24th Grand Slam title.",
      "British pair Joe Salisbury and Neal Skupski continue their pursuit of a first men's doubles Grand Slam crown by reaching the US Open final.",
      "<p>Gabriela Dabrowski and Erin Routliffe are back in the U.S. Open women’s doubles final, two years after they began their partnership and immediately won their first Grand Slam title as a team in New York.</p>"
    ],
    "image_url": "",
    "titles": [
      "GB's Hewett & Reid reach US Open doubles final",
      "GB's Salisbury & Skupski into US Open doubles final",
      "Canada’s Dabrowski, partner Routliffe return to women’s doubles final at US Open"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.992,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.25
    },
    "score": 0.635,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "British wheelchair doubles team Alfie Hewett and Gordon Reid advanced to the US Open final, aiming for their 24th Grand Slam title. In men's doubles, British duo Joe Salisbury and Neal Skupski also reached the US Open final, seeking their first Grand Slam crown. Gabriela Dabrowski and Erin Routliffe made it to the women’s doubles final at the US Open, two years after winning their first Grand Slam title together in New York.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Nepal to Block 26 Social Media Sites, Sparking Public Protests",
    "domain": "technology",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-09-04T16:01:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "TechCrunch"
    ],
    "domains": [
      "www.dw.com",
      "techcrunch.com"
    ],
    "snippets": [
      "Nepal's government said it would block access to several social media platforms which had so far failed to register with authorities as part of a crackdown on misuse. The law has been met with some protests and dissent.",
      "Nepal has moved to block 26 social media platforms for failing to comply with its registration requirements."
    ],
    "image_url": "",
    "titles": [
      "Nepal to block Facebook, YouTube, X, LinkedIn, others",
      "Nepal blocks Facebook, Instagram, YouTube, X over rule breach, amid censorship concerns"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.843,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.634,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Nepal's government announced plans to block 26 social media platforms for not registering with authorities, aiming to curb misuse. This decision has sparked protests and dissent among the public.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Apple Launches New Watches; Affordable Robot Vacuums Highlight Tech Accessibilit",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-09-04T19:33:28-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "www.theverge.com"
    ],
    "snippets": [
      "While the best iPad deals usually land during major sale events like Black Friday and Amazon Prime Day,&#160;many great iPad deals are available outside of those times. The day-to-day discounts come and go like changing winds, so there’s often some amount to be saved, particularly on Apple’s most af",
      "At the end of last year, Apple launched its latest smartwatch, introducing the Apple Watch Series 10 alongside a black rendition of the Apple Watch Ultra 2. Each wearable has its own pros and cons, as does the second-gen Apple Watch SE, but the introduction of Apple’s newest wearables also means the",
      "We’re in an age where you can realistically delegate tasks to smart hunks of metal, whether it’s a self-driving car or a robot that can clean on your behalf. Most of us probably won’t be able to afford the helpful sentient humanoids being developed in our lifetimes, but robot vacuums are an affordab"
    ],
    "image_url": "",
    "titles": [
      "The best iPad deals you can get right now",
      "Here are the best Apple Watch deals available right now",
      "Here are the best robot vacuum deals available right now"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.986,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.465,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Great iPad deals can be found year-round, not just during Black Friday or Amazon Prime Day. Apple recently launched the Apple Watch Series 10 and a black version of the Apple Watch Ultra 2, each with unique features. Additionally, the availability of affordable robot vacuums highlights the accessibility of smart technology for everyday tasks.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Attorney Mark S. Zuckerberg Loses Business Over Facebook Profile Issues",
    "domain": "technology",
    "source_domain": "techcrunch.com",
    "location": "global",
    "published": "Thu, 04 Sep 2025 20:59:30 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com"
    ],
    "snippets": [
      "Mark S. Zuckerberg, an attorney, says that he's losing business because his Facebook business profile keeps getting disabled.",
      "Former Meta exec Nick Clegg recalls an MMA session with Zuckerberg at a management offsite."
    ],
    "image_url": "",
    "titles": [
      "Mark Zuckerberg sues Mark Zuckerberg",
      "Mark Zuckerberg encouraged execs to do MMA training with him"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.935,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.455,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Mark S. Zuckerberg, an attorney not affiliated with Meta, reports losing business due to his Facebook profile being repeatedly disabled, likely due to confusion with Meta's CEO. Meanwhile, former Meta executive Nick Clegg shared a memory of an MMA session with Meta's CEO, Zuckerberg, at a management offsite, highlighting a personal anecdote unrelated to the attorney's issue.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]