[
  {
    "title": "Israeli Airstrike Kills Yemeni Houthi PM and Ministers in Sanaa",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sat, 30 Aug 2025 10:28:55 -0400",
    "source": "NPR",
    "sources": [
      "Washington Post",
      "New York Times",
      "Financial Times",
      "BBC",
      "The Guardian",
      "NPR",
      "Al Jazeera",
      "CityNews"
    ],
    "domains": [
      "www.npr.org",
      "www.ft.com",
      "www.washingtonpost.com",
      "www.aljazeera.com",
      "www.theguardian.com",
      "www.bbc.com",
      "ottawa.citynews.ca",
      "www.nytimes.com"
    ],
    "snippets": [
      "The Iranian-backed Houthis said an Israeli airstrike killed the prime minister of the rebel-controlled government in the Yemeni capital, Sanaa.",
      "Ahmed Ghaleb Nasser al-Rahawi and several other Houthi officials were killed in the attack, the Iran-backed movement says.",
      "Houthis condemn killing of Ahmed al-Rahawi, other government ministers in Israeli attack on Yemen&#039;s capital this week.",
      "Iran-backed militants confirm death of Ahmed Ghaleb al-Rahawi in bombing of Sana’a on Thursday",
      "<p>Ahmed al-Rahawi killed alongside several ministers gathered for prerecorded speech by rebel group’s leader</p><p>An Israeli airstrike killed the prime minister of the Houthi rebel-controlled government in Yemen’s capital, Sana’a, the Houthis have said.</p><p>Ahmed al-Rahawi was killed in a strike",
      "Prime Minister Ahmad al-Rahawi and several ministers were killed in an Israeli strike Thursday on Sanaa, the Houthis said.",
      "Ahmed al-Rahawi had led the Houthi cabinet in Yemen since 2024. His killing is unlikely to halt the Iranian-backed group’s missile attacks on Israel.",
      "CAIRO (AP) — An Israeli airstrike killed the prime minister of the Houthi rebel-controlled government in Yemen&#8217;s capital Sanaa, the Houthis said Saturday. He was the most senior Houthi official killed in the Israeli-U.S. campaign against the Iranian-backed rebels. Ahmed al-Rahawi was killed in"
    ],
    "image_url": "",
    "titles": [
      "Houthi rebels say Israeli airstrike killed their prime minister in Yemen's capital",
      "Yemen's Houthi rebels say prime minister was killed in Israeli strike",
      "Yemen’s Houthis confirm prime minister killed in Israeli strike on Sanaa",
      "Houthi prime minister killed in Israeli air strike on Yemen",
      "Israeli airstrike kills Houthi prime minister in Yemen, rebels say",
      "Israeli strike killed Houthi prime minister",
      "Houthis Say Prime Minister Was Killed in Israeli Attack",
      "Israeli airstrike kills Houthi rebel prime minister in Yemen’s capital"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.818,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.839,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Ahmed al-Rahawi, the Prime Minister of the Houthi-controlled government in Yemen, and several ministers were killed in an Israeli airstrike on Sanaa. The strike, confirmed by Israel's military as targeting a Houthi location, represents a significant escalation in the conflict involving the Iranian-backed Houthis. Al-Rahawi's death marks the highest-profile casualty in the ongoing Israeli-U.S. campaign against the rebels. Despite his killing, it is reported that the incident is unlikely to stop the Houthis' missile attacks on Israel.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Ostapenko Apologizes for Remarks to Townsend After US Open Match",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 30 Aug 2025 21:57:11 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "ESPN",
      "Sky Sports",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "www.bbc.com",
      "www.espn.com",
      "www.skysports.com"
    ],
    "snippets": [
      "Latvia's Jelena Ostapenko says \"English is not my first language\" after telling American opponent Taylor Townsend she has \"no education\".",
      "Jelena Ostapenko apologized on social media Saturday, three days after telling Taylor Townsend that she had \"no class\" and \"no education\" following their second-round match at the US Open.",
      "Ostapenko's post-match blowup went viral on Wednesday",
      "Jelena Ostapenko has apologised for her comments towards Taylor Townsend at the US Open."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/da81/live/bd50bdd0-85dc-11f0-8ebc-e9078a2c3b0a.jpg",
    "titles": [
      "Ostapenko apologises for 'no education' Townsend comments",
      "Ostapenko apologizes for words toward Townsend",
      "US Open 2025: Jelena Ostapenko apologizes to Taylor Townsend for 'no class' comments after their match",
      "Ostapenko apologies for 'no education' comment to Townsend at US Open"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.936,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.776,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Latvian tennis player Jelena Ostapenko apologized on social media for telling American opponent Taylor Townsend she has \"no class\" and \"no education\" after their US Open match. Ostapenko's remarks, which went viral, were made following their second-round game. She cited language barriers, stating \"English is not my first language,\" as part of her apology.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Indonesia Protests: Buildings Torched, 3 Dead Amid Economic, Police Unrest",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sat, 30 Aug 2025 05:13:00 -0400",
    "source": "NPR",
    "sources": [
      "The Guardian",
      "Al Jazeera",
      "NPR",
      "New York Times"
    ],
    "domains": [
      "www.npr.org",
      "www.nytimes.com",
      "www.aljazeera.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "An angry mob set fire to a local parliament building in an Indonesian provincial capital, leaving at least three people dead and five others hospitalized, officials said.",
      "At least three people were killed and several injured in a fire blamed on protesters in Sulawesi island.",
      "<p>Cities in Indonesia rocked by protests after motorcycle taxi driver run over by police tactical vehicle</p><p>Protesters have torched parliamentary buildings in three further Indonesian provinces, a day after at least three people were killed by a fire started by demonstrators at a council buildi",
      "In spreading protests against the president, three government workers died after jumping from a building that protesters set afire. A fourth person was attacked by a crowd and later died of his injuries."
    ],
    "image_url": "",
    "titles": [
      "3 dead after mob sets fire to Indonesian regional parliament building",
      "Three killed in fire at Indonesian government building blamed on protesters",
      "Fire kills three people in Indonesia after protesters torch council buildings",
      "3 Dead in Indonesia After Jumping From Building Protesters Set on Fire, Official Says"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.733,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.761,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "In Indonesia, protests against President Prabowo Subianto's economic policies and police brutality have escalated, leading to the torching of parliamentary buildings in four provinces, including Sulawesi Island. The unrest, sparked by a police vehicle running over a motorcycle taxi driver, has resulted in at least three deaths and several injuries. In one incident, a local parliament building was set ablaze, killing at least three people and hospitalizing five.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Chicago Mayor Bans Police from Aiding Federal Immigration Enforcement",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sat, 30 Aug 2025 21:36:27 +0000",
    "source": "Al Jazeera",
    "sources": [
      "The Guardian",
      "Al Jazeera",
      "CityNews"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "www.aljazeera.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Mayor Brandon Johnson says order aims to protect residents from &#039;threats and actions of out-of-control administration&#039;.",
      "<p>Brandon Johnson’s order directs city police not to collaborate with federal agents in immigration enforcement</p><p>The mayor of <a href=\"https://www.theguardian.com/us-news/chicago\">Chicago</a> is planning to sign an executive order on Saturday outlining how the city will attempt to resist <a hr",
      "The mayor of Chicago pushed back Saturday against what he called the “out-of-control” Trump administration&#8217;s plan to surge federal officers into the nation’s third-largest city, which could take place within days. The Chicago Police Department will be barred from helping federal authorities wi"
    ],
    "image_url": "",
    "titles": [
      "Chicago mayor signs order to resist possible Trump troop deployment",
      "Chicago mayor to sign executive order directing city to resist Trump’s immigration raids",
      "Chicago mayor defies Trump’s immigration crackdown plan for the city"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.949,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.744,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Chicago Mayor Brandon Johnson signed an executive order preventing city police from collaborating with federal agents on immigration enforcement, aiming to protect residents against what he terms the \"threats and actions\" of the Trump administration's plans to increase federal presence in the city. This move underscores Johnson's stance against the administration's approach towards Chicago.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Piastri Takes Pole at Dutch GP, Narrowly Beats Norris",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sat, 30 Aug 2025 10:25:52 EST",
    "source": "ESPN",
    "sources": [
      "The Guardian",
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.espn.com",
      "www.sportsnet.ca",
      "www.theguardian.com"
    ],
    "snippets": [
      "Oscar Piastri secured pole position after beating his teammate and title rival Lando Norris.",
      "<ul><li><p>Australian gives himself chance to extend title advantage</p></li><li><p>Isack Hadjar takes career-best fourth for Racing Bulls</p></li></ul><p>The sun may have been shining but the blustery winds barrelling in over the dunes on the edge of the North Sea delivered a buffeting that might j",
      "<p>Oscar Piastri beat his teammate Lando Norris by just over one-hundredth of a second to take pole position for the Dutch Grand Prix in qualifying on Saturday.</p>"
    ],
    "image_url": "",
    "titles": [
      "Piastri takes pole ahead of Norris at Dutch GP",
      "Oscar Piastri earns F1 Dutch GP pole by finest margin ahead of Lando Norris",
      "Piastri edges McLaren teammate Norris for pole at Dutch Grand Prix"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.817,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.725,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Oscar Piastri secured pole position for the Dutch Grand Prix, edging out his McLaren teammate Lando Norris by a mere 0.012 seconds in a closely contested qualifying session. This achievement gives Piastri an opportunity to extend his lead in the title race, while Isack Hadjar achieved a career-best fourth place for Racing Bulls.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Zelenskyy Condemns Assassination of Ex-Speaker Parubiy in Ukraine",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 30 Aug 2025 16:41:58 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Al Jazeera",
      "Financial Times"
    ],
    "domains": [
      "www.bbc.com",
      "www.ft.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "President Zelensky said the killing of Parubiy was a \"terrible murder\" - with a manhunt under way.",
      "Ukrainian President Volodymyr Zelenskyy condemns killing of prominent politician Andriy Parubiy as &#039;horrendous murder&#039;.",
      "Assassination of former parliament speaker Andriy Parubiy is the most significant in a series of high-profile killings"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/6bad/live/f1197b20-858c-11f0-ab22-d347aa25866a.jpg",
    "titles": [
      "Prominent Ukrainian politician Andriy Parubiy shot dead in Lviv",
      "Former Ukrainian parliament speaker shot dead in Lviv",
      "Prominent Ukrainian nationalist politician shot dead in Lviv"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.839,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.719,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Ukrainian President Volodymyr Zelenskyy condemned the assassination of Andriy Parubiy, a former parliament speaker, calling it a \"horrendous murder.\" This incident marks a significant event in a series of high-profile killings in Ukraine. A manhunt is currently underway to find those responsible for Parubiy's death.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Russia Attacks 14 Ukrainian Regions; 1 Dead, 30 Injured",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 30 Aug 2025 15:37:54 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Al Jazeera",
      "Deutsche Welle"
    ],
    "domains": [
      "www.dw.com",
      "www.bbc.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Russia hits 14 Ukrainian regions, Kyiv says, with at least one person reported killed and 30 injured.",
      "At least one person has been killed and 28 wounded, including children, in attack that targeted Zaporizhia.",
      "Explosions were reported in the cities of Dnipro and Pavlograd in Dnipropetrovsk, authorities said. Follow DW for the latest."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/f7be/live/2f129190-85bb-11f0-84c8-99de564f0440.jpg",
    "titles": [
      "Russia launches massive attack on Ukraine, as Kyiv hits oil refineries",
      "Russia attacks Ukraine’s Zaporizhia; Kyiv hits Russian oil refineries",
      "Ukraine updates: Russia launches 'massive attack' on Ukraine's Dnipropetrovsk region"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.821,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.708,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Russia launched attacks across 14 Ukrainian regions, resulting in at least one death and 30 injuries, as reported by Kyiv. Among the affected areas, Zaporizhia saw at least one fatality and 28 wounded, including children. Explosions also occurred in Dnipro and Pavlograd, Dnipropetrovsk region, according to authorities.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Osaka vs. Gauff in U.S. Open Fourth Round Showdown",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sat, 30 Aug 2025 18:46:06 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.espn.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Naomi Osaka and Coco Gauff will meet in the fourth round on Monday night. And it's more of a toss-up than recent results suggest.",
      "<p>For the first time at this U.S. Open, Coco Gauff didn&#8217;t double-fault in her first service game. And for the first time, she didn&#8217;t get broken to begin things, either.</p>"
    ],
    "image_url": "",
    "titles": [
      "Coco Gauff vs. Naomi Osaka: Who will win?",
      "Coco Gauff, Naomi Osaka to meet in US Open fourth round"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.972,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.674,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Naomi Osaka and Coco Gauff are set to compete in the fourth round of the U.S. Open on Monday night. This match is considered highly competitive, despite past results. Notably, in this U.S. Open, Coco Gauff achieved a first by not double-faulting or getting broken in her opening service game.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Spirit Airlines Files for Bankruptcy Again, Continues Operations",
    "domain": "sports",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sat, 30 Aug 2025 08:26:13 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "Axios"
    ],
    "domains": [
      "www.npr.org",
      "news.google.com"
    ],
    "snippets": [
      "The budget carrier filed for fresh bankruptcy protection months after emerging from a Chapter 11 reorganization. The airline said it plans to keep flying as usual during the restructuring process.",
      "<a href=\"https://news.google.com/rss/articles/CBMic0FVX3lxTE9TZENHc1lvay10a016NFlfS0toVlpqVDFRaEhvUmtDaXhkMEpaNGd4OWtwSjc4bWZ4WXpWYWw0Qm1jempOa3RtWC1MVUlTamdUN1RTUEFSU2s4RXlEMHdRNlh1emVwM3d6YmU3a1lGZG5keU0?oc=5\" target=\"_blank\">Spirit Airlines is back in bankruptcy</a>&nbsp;&nbsp;<font color=\"#6f6f6"
    ],
    "image_url": "",
    "titles": [
      "Spirit Airlines files for bankruptcy for 2nd time in less than a year",
      "Spirit Airlines is back in bankruptcy - Axios"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.784,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.654,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Spirit Airlines filed for bankruptcy protection again, just months after completing a Chapter 11 reorganization. Despite this, the airline plans to continue its operations without interruption during the restructuring process.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Williams, Fernandez Reach U.S. Open Round of 16 in Doubles",
    "domain": "sports",
    "source_domain": "sports.yahoo.com",
    "location": "national",
    "published": "Sat, 30 Aug 2025 23:43:17 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports",
      "Sportsnet"
    ],
    "domains": [
      "sports.yahoo.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Williams and Fernandez are moving on to the Round of 16 — marking Williams' best Grand Slam result in nearly a decade.",
      "<p>Venus Williams and Leylah Fernandez reached the third round of women’s doubles at the U.S. Open by defeating Ulrikke Eikeri and Eri Hozumi 7-6 (1), 6-1 on Saturday.</p>"
    ],
    "image_url": "",
    "titles": [
      "US Open 2025: Venus Williams, with Canada's Leylah Fernandez, keeps doubles dream alive with second-round win",
      "Canada’s Fernandez, Williams reach third round of doubles at US Open"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.992,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.653,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Venus Williams and Leylah Fernandez advanced to the Round of 16 at the U.S. Open after beating Ulrikke Eikeri and Eri Hozumi 7-6 (1), 6-1 in women's doubles. This result marks Williams' best Grand Slam performance in nearly ten years.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Florida State Upsets Alabama, Shaking College Football Playoff Predictions",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sat, 30 Aug 2025 23:29:52 +0000",
    "source": "CBS Sports",
    "sources": [
      "Yahoo Sports",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "www.nbcsports.com"
    ],
    "snippets": [
      "It's reflection time for one of the SEC's perceived elites during opening weekend",
      "Coming off a 2-10 season, Florida State handed a crushing setback to Alabama, which was viewed as a College Football Playoff contender under second-year coach Kalen DeBoer."
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/08/30/8b49dbdf-ebcf-4ede-9f9b-05debe87e4b3/tysimpsonalabama.jpg",
    "titles": [
      "Florida State humiliates No. 8 Alabama as Crimson Tide's glow as a football elite flickers away",
      "Florida State stuns No. 8 Alabama 31-17, delivering blow to Crimson Tide's playoff hopes"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.987,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.652,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Florida State, after a 2-10 season, delivered a significant defeat to Alabama, considered a contender for the College Football Playoff. This loss comes under Alabama's second-year coach, Kalen DeBoer, marking a reflective moment for the team early in the season.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Court Limits Trump's Tariff Powers; Duties Stand Pending Supreme Court Appeal",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Sat, 30 Aug 2025 19:25:45 GMT",
    "source": "CNBC",
    "sources": [
      "New York Times",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "If the Supreme Court upholds the ruling, President Donald Trump would lose some, but not all, of his broad tariff powers.",
      "The decision is a big blow to President Trump’s trade policies, but the judges left the duties in place for now to allow time for a likely appeal to the Supreme Court."
    ],
    "image_url": "",
    "titles": [
      "Trump tariffs that are voided by — and ones that are safe from — Friday's appeals court ruling",
      "Trump’s Sweeping Tariffs Invalidated by Appeals Court"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.888,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.647,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A court ruling has limited President Donald Trump's tariff powers, marking a significant impact on his trade policies. However, the duties remain effective for now, as the judges have allowed time for a probable appeal to the Supreme Court. The outcome of this appeal will determine if Trump retains his broad tariff powers.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Former Cowboys Linebacker Lee Roy Jordan Passes Away",
    "domain": "sports",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Sat, 30 Aug 2025 15:39:42 -0400",
    "source": "ABC News",
    "sources": [
      "Sports Illustrated",
      "ABC News"
    ],
    "domains": [
      "news.google.com",
      "abcnews.go.com"
    ],
    "snippets": [
      "Lee Roy Jordan, a linebacker on the first Super Bowl-winning team for the Dallas Cowboys in the 1970s, has died",
      "<a href=\"https://news.google.com/rss/articles/CBMiiwFBVV95cUxNck83Z3RJVGxoTVJTTWRKSnVVNzJIMDJqaTZuS3RvSmpnbS1JaUN5b2dKMldEc0lWTzFYTXJPMlZSNTNOVmp6TjlNWUNVZWJWTlJaYWczRUh4SVQ0bng5Y1FlcXRSNUV6MV9ZdU9DcTNaMjZkMXhzeTFNbnVXX2kyT0IwVm5qV3dHbHBz?oc=5\" target=\"_blank\">Lee Roy Jordan, 1960s Star for Alabama "
    ],
    "image_url": "https://s.abcnews.com/images/Sports/lee-roy-jordan-ap-jt-250830_1756581405316_hpMain_4x3t_384.jpg",
    "titles": [
      "Lee Roy Jordan, who helped the Dallas Cowboys win their first Super Bowl title, dies at 84",
      "Lee Roy Jordan, 1960s Star for Alabama and Cowboys, Dies at 84 - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.912,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.637,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Lee Roy Jordan, a former linebacker for the Dallas Cowboys and star player for Alabama in the 1960s, has passed away. He was part of the first Super Bowl-winning team for the Cowboys in the 1970s. The news of his death was confirmed recently.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Over 500 VOA Employees Face Layoffs; Legal Battle Looms with Federal Judge",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 30 Aug 2025 19:37:30 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "New York Times"
    ],
    "domains": [
      "www.bbc.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "Termination notices have been issued to more than 500 employees of VOA and its parent agency.",
      "The layoffs set up a potential battle with a federal judge who blocked previous efforts by Kari Lake, a fierce Trump ally, to restructure the agency."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/195a/live/e6f5b2d0-85d7-11f0-913d-513d3ce0c9e3.jpg",
    "titles": [
      "Trump administration moves to fire most Voice of America journalists",
      "Trump Officials Move to Fire Most Voice of America Journalists"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.892,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.633,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Over 500 employees of Voice of America (VOA) and its parent agency received termination notices, leading to a likely conflict with a federal judge who previously halted attempts by Kari Lake, a strong supporter of Trump, to reorganize the agency.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Peer Lord Charles Brockett Denies Rape Charges in Court",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 30 Aug 2025 17:57:46 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "www.bbc.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Lord Brockett was arrested on Friday, the Metropolitan Police said.",
      "<p>Peer who appeared on I’m a Celebrity denies charges of rape and sexual assault at Westminster magistrates court</p><p>A celebrity peer and former reality TV show contestant has appeared in court after being charged with rape and sexual assault by penetration, police said.</p><p>Lord Charles Brock"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/3df6/live/8725e120-85ca-11f0-bc2f-491435739aad.jpg",
    "titles": [
      "Celebrity peer charged with rape and sexual assault",
      "Celebrity peer Lord Charles Brocket charged with rape"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.862,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.627,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Lord Charles Brockett, a peer and former reality TV contestant, was arrested and charged with rape and sexual assault by penetration. He appeared in Westminster Magistrates Court, denying all charges.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "England's Breach Leads Record 92-3 Win Over Samoa in Women's Rugby World Cup",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 30 Aug 2025 18:00:20 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Sky Sports"
    ],
    "domains": [
      "www.bbc.com",
      "www.skysports.com"
    ],
    "snippets": [
      "Jess Breach scores a hat-trick as England thrash Samoa in Northampton to register a record Women's Rugby World Cup win.",
      "Jess Breach plundered a hat-trick as England continued their march through the Rugby World Cup pool stage with a 92-3 victory over Samoa at Franklin's Gardens."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/f57d/live/d850dc90-85dd-11f0-84c8-99de564f0440.jpg",
    "titles": [
      "Breach scores hat-trick in record England World Cup win",
      "Breach hat-trick as record win sends Red Roses to World Cup quarters"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.862,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.627,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "England's Jess Breach scored a hat-trick in a dominant 92-3 win over Samoa in the Women's Rugby World Cup. The victory set a record for England's largest win in the tournament, solidifying their strong performance in the pool stage.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "SIU Investigates Cyclist Injured in E-Bike Collision During Police Chase",
    "domain": "general",
    "source_domain": "ottawacitizen.com",
    "location": "local",
    "published": "Sat, 30 Aug 2025 13:57:23 +0000",
    "source": "Ottawa Citizen",
    "sources": [
      "CityNews",
      "Ottawa Citizen"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "ottawacitizen.com"
    ],
    "snippets": [
      "The province&#8217;s police watchdog has opened a file after a speeding e-bike struck and seriously injured a cyclist while being pursued by an Ottawa police cruiser Aug. 7. In an online release, the Special Investigations Unit says an officer in an Ottawa Police Service cruiser attempted to stop tw",
      "The province&#8217;s Special Investigations Unit is investigating after an e-cyclist, being pursued by police, struck another cyclist. It happened on the evening of Aug. 7, shortly after 8:15 p.m. Investigators say an OPS officer in a marked cruiser attempted to strop two men riding e-bikes at high "
    ],
    "image_url": "",
    "titles": [
      "SIU launches case after e-bike fleeing police strikes cyclist",
      "Cyclist injured after struck by e-cyclist fleeing police; SIU investigates"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.809,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.617,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "On August 7, the Special Investigations Unit began probing an incident where a cyclist was seriously injured after being hit by an e-bike. The e-bike was speeding and being chased by an Ottawa police cruiser at the time. The collision occurred shortly after 8:15 p.m. as police attempted to stop two individuals on e-bikes.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Hints for NYT Strands Puzzle and Connections Game Now Online",
    "domain": "business",
    "source_domain": "www.forbes.com",
    "location": "global",
    "published": "Sat, 30 Aug 2025 18:30:16 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes"
    ],
    "domains": [
      "www.forbes.com"
    ],
    "snippets": [
      "Looking for help with today's NYT Strands puzzle? Here's an extra hint to help you uncover the right words, as well as all of today's answers and Spangram.",
      "Looking for some help with today's NYT Connections? Some hints and the answers for today's game are right here."
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/661994c1a11cd45a738c205f/0x0.jpg?width=960",
    "titles": [
      "Today’s NYT Strands Puzzle: Hints, Spangram And Answers For Sunday, August 31st",
      "Today’s NYT ‘Connections’ Hints And Answers For Sunday, August 31st"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.967,
      "consensus": 0.35,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.471,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Hints and solutions for today's New York Times Strands puzzle and Connections game are available online. These resources provide extra assistance for players seeking to uncover the correct words and complete the puzzles.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: solution",
    "constructiveness_source": "heuristic"
  }
]