[
  {
    "title": "\"Jimmy Kimmel Live!\" Resumes on ABC After Suspension Over Kirk Comments",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Mon, 22 Sep 2025 16:55:00 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "CityNews",
      "ABC News",
      "Axios",
      "Forbes",
      "Deutsche Welle",
      "The Guardian",
      "CNBC",
      "Business Insider",
      "Ars Technica",
      "Al Jazeera"
    ],
    "domains": [
      "www.npr.org",
      "www.forbes.com",
      "www.aljazeera.com",
      "www.dw.com",
      "www.businessinsider.com",
      "ottawa.citynews.ca",
      "arstechnica.com",
      "abcnews.go.com",
      "www.cnbc.com",
      "www.theguardian.com",
      "news.google.com"
    ],
    "snippets": [
      "The late night comic was suspended last week under pressure from the Trump administration after comments about Charlie Kirk's killing.",
      "Announcement comes nearly a week after the late-night host was controversially suspended for remarks about Charlie Kirk.",
      "\"Jimmy Kimmel Live!\" was hauled off American screens after the host made comments related to conservative activist Charlie Kirk, who was killed on September 10. The show is set to return on Tuesday.",
      "The Walt Disney Co. issued a statement Monday about Kimmel's return.",
      "Jimmy Kimmel is set to return to the air Tuesday night on ABC, The Walt Disney Company said.",
      "ABC had pulled Kimmel's show after he made comments linking the alleged killer of conservative activist Charlie Kirk to President Donald Trump's MAGA movement.",
      "<p>Late-night host reinstated after brief suspension related to comments on Maga and Charlie Kirk that Disney called ‘insensitive’</p><p><a href=\"https://www.theguardian.com/tv-and-radio/jimmy-kimmel\">Jimmy Kimmel</a> is headed back to air.</p><p>Disney announced on Monday that Jimmy Kimmel Live! wo",
      "Disney subsidiary ABC said last week the show would be cancelled indefinitely following comments Kimmel made about Trump supporters and conservative activist Charlie Kirk.",
      "\"Jimmy Kimmel Live!\" will return to ABC on Tuesday after the late-night host's comments on Charlie Kirk's death caused the network to pull the show.",
      "ABC will reinstate Jimmy Kimmel’s late night show in the wake of criticism over his comments about the assassination of conservative activist Charlie Kirk, officials with the network said Monday. &#8220;We have spent the last days having thoughtful conversations with Jimmy, and after those conversat",
      "<a href=\"https://news.google.com/rss/articles/CBMibkFVX3lxTE9aRUxERGpVTU9EWjJVSDN6ZVdLRnplMFFxaDF6d0VqZThEZkN1OVN3ZXk1OU9fQllTUDQ4ZlBRQ0N0VXZwRUs0MWhBdklCTng3U1JQekY2MElwSEc4OVl0M1dISFVNT1JKQmZLLUpR?oc=5\" target=\"_blank\">Disney bringing Jimmy Kimmel back Tuesday</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">",
      "Disney says \"thoughtful conversations with Jimmy\" led to show's return.",
      "Sinclair, which owns ABC affiliate stations, said it would not be returning Jimmy Kimmel to the air on its stations after Disney's announcement."
    ],
    "image_url": "",
    "titles": [
      "Jimmy Kimmel will be back on air on Tuesday, Disney says",
      "Jimmy Kimmel’s show to return on Tuesday after Disney lifts suspension",
      "US: Jimmy Kimmel returns to late-night TV after suspension",
      "Jimmy Kimmel to return to air on Tuesday",
      "WATCH:  Jimmy Kimmel returns to ABC on Tuesday after suspension",
      "Disney says 'Jimmy Kimmel Live' will return to ABC on Tuesday",
      "Jimmy Kimmel will return to TV after highly criticized suspension",
      "‘Jimmy Kimmel Live!’ Will Return Tuesday Following Charlie Kirk Controversy",
      "Jimmy Kimmel is returning to ABC on Tuesday, Disney says",
      "ABC ends Jimmy Kimmel’s suspension and his show will return Tuesday",
      "Disney bringing Jimmy Kimmel back Tuesday - Axios",
      "Disney reinstates Jimmy Kimmel after backlash over capitulation to FCC",
      "Sinclair says it won't air Jimmy Kimmel on its stations after Disney announced his return"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.934,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.862,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "\"Jimmy Kimmel Live!\" will return to ABC on Tuesday after being pulled off the air due to comments the host made about the death of conservative activist Charlie Kirk, linking the alleged killer to President Trump's MAGA movement. The Walt Disney Company, ABC's parent company, announced the show's return following a brief suspension and \"thoughtful conversations with Jimmy.\" However, Sinclair, owning ABC affiliate stations, stated it would not air the show following Disney's decision.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "France Recognizes Palestinian Statehood at U.N., Aligns with UK, Australia, Cana",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 22 Sep 2025 21:15:42 GMT",
    "source": "BBC",
    "sources": [
      "Axios",
      "New York Times",
      "Financial Times",
      "Washington Post",
      "Al Jazeera",
      "BBC"
    ],
    "domains": [
      "www.ft.com",
      "www.nytimes.com",
      "www.washingtonpost.com",
      "www.bbc.com",
      "www.aljazeera.com",
      "news.google.com"
    ],
    "snippets": [
      "Speaking at the UN in New York, President Emmanuel Macron said \"the time for peace has come\".",
      "The UK, Australia and Canada have recognised a Palestinian state, while France and other countries are set to do so in the coming days.",
      "The announcement by President Emmanuel Macron comes as world leaders meet to revive the long-stalled two-state solution.",
      "Several Western nations have formally recognised Palestine, drawing praise from Palestinians.",
      "<a href=\"https://news.google.com/rss/articles/CBMid0FVX3lxTE1ZSzF0Vkc1bWhZM1NiZEpxVlYyeGNuS3FWYU1BaUZ5d2ZkZE5TZEhHR0ZneEFaUk5BOXFJR3BlVGpZSVB3d3ZMZE9xNG1leGxKRUtrZTIzTDZqMTNRdkNVWDhrYWxpdGptMklFNnRUZXVOQVRZcDBB?oc=5\" target=\"_blank\">France is the latest country to formally recognize State of Palesti",
      "<a href=\"https://news.google.com/rss/articles/CBMiekFVX3lxTFBPZFN1QXgzNndRQ2tVQzI1MC1ITnBBSXVlcWlYcUcyQnpWX0xkMEpFNi1DaDJ6V041NjVraWM0TUpRSWNlNHVTZVJaU2FTRjV0X0stWXdWTERBSnJGZUJMcUUyVXN0ck9GNzNiczQ0Qzd4cGRfOVZkZVhR?oc=5\" target=\"_blank\">What countries recognize a Palestinian state in 2025?</a>&nbsp;",
      "At a meeting ahead of the U.N. General Assembly, France and other U.S. allies made official a breach with Washington that has been years in the making.",
      "President Emmanuel Macron says ‘nothing justifies’ further conflict in enclave",
      "Secretary of State Marco Rubio tried to kill France’s recognition of Palestinian statehood, publicly lambasting it as a “gift to Hamas” ahead of the U.N. summit in New York.",
      "France became the latest Western nation to formally recognize Palestinian sovereignty, which remains a largely symbolic gesture. It was followed by calls for Israel to end the war in Gaza and stop its expansion of West Bank settlements.",
      "The moves came just before the annual U.N. General Assembly, increasing pressure on Israel and putting key allies at odds with the Trump administration."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/7923/live/825e3bb0-97f9-11f0-928c-71dbb8619e94.jpg",
    "titles": [
      "France formally recognises Palestinian state",
      "What does recognising a Palestinian state mean?",
      "France recognises state of Palestine before UN General Assembly meeting",
      "Global reactions to Palestinian state recognition",
      "France is the latest country to formally recognize State of Palestine - Axios",
      "What countries recognize a Palestinian state in 2025? - Axios",
      "World Leaders Recognize Palestinian State, in a Challenge to U.S. and Israel",
      "France recognises Palestinian statehood and calls for end to Israeli war in Gaza",
      "France defies Trump, recognizes Palestinian statehood despite U.S. pressure",
      "France and Other Nations Recognize Palestinian Statehood at U.N. Summit",
      "Britain, Australia, Canada and Portugal Recognize a Palestinian State"
    ],
    "score_components": {
      "magnitude": 0.986,
      "recency": 0.921,
      "consensus": 1.0,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.859,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "At the U.N. General Assembly in New York, France, led by President Emmanuel Macron, formally recognized Palestinian statehood, joining the UK, Australia, and Canada in a move that diverges from U.S. policy. This recognition is part of a broader effort to revive the two-state solution and has been praised by Palestinians. The decision comes amidst calls for peace and an end to conflict in the region, with Macron stating \"the time for peace has come.\" This development marks a significant shift in international relations and increases pressure on Israel regarding its policies in Gaza and the West",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "keywords: development, effort, solution",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Admin Links Acetaminophen to Autism, Faces Criticism",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Mon, 22 Sep 2025 13:08:06 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "ABC News",
      "Axios",
      "Forbes",
      "CNBC",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.npr.org",
      "www.forbes.com",
      "abcnews.go.com",
      "www.cnbc.com",
      "news.google.com"
    ],
    "snippets": [
      "President Trump and HHS secretary Robert F. Kennedy Jr. are expected to tie autism to acetaminophen use during pregnancy, and present a cancer drug as a possible treatment. There is little credible scientific evidence for either claim.",
      "Some studies have suggested an association between the two, but experts say there is no causal relationship.",
      "<a href=\"https://news.google.com/rss/articles/CBMigAFBVV95cUxQOWJtTFRQZzV0akxxbXJoLXgwWmNqbWdBTFhNUEpoRTVLdWVSUTluUXdhZU1wME0za2VGNWNBQm9xRWtFNFlTRFp4bS0yUUI1ZVFWd3JZa3NFYTRlTDVYN3p4c1JwdUl2Z0V1WVcyZFBVQkloMnF6UXN6d1pQd0c3cQ?oc=5\" target=\"_blank\">Trump urges pregnant women to limit taking Tylenol</a",
      "<a href=\"https://news.google.com/rss/articles/CBMidEFVX3lxTE5nYUx4cVlYemFCdDVHM2hoc2RYVWQ1N3hmd2l5V0w1TlBHLXFRTm1pZ1VWcmxMMk50bE91WjhBLUJpeDRYMGFuc21iU2pIQlRzYThfcDhwb1RZY3F0R3c1dTNBYWdjeVl1YkFpQjVSaXdZaklN?oc=5\" target=\"_blank\">Trump to link autism to Tylenol use during pregnancy</a>&nbsp;&nbsp;<fo",
      "The Trump administration stated on Monday that the use of an over-the-counter pain medication during pregnancy may be linked to autism.",
      "Officials warned pregnant women against using acetaminophen unless they have a fever, and touted a lesser-known drug as a potential treatment for autism.",
      "Federal health officials also are expected to highlight leucovorin, a form of folate, as a potential autism treatment, according to The Washington Post.",
      "The administration will reportedly also identify leucovorin, a drug used to treat cancer and anemia, as a potential treatment for autism.",
      "<a href=\"https://news.google.com/rss/articles/CBMifkFVX3lxTE5rSU5RbGdUTHlsUkR4MXlLbVl6TjJmRmxHZzNnbXVuakhNODlQbDZVLWQ3ai1zZDVXWHdaQlRjZzAzWmVUNDMwZHFQRThZbW5iaFBTSHloZkgtQlNLMlM5QV9tUmpvZmdBNlUxampQZEtwOWUwZEF2T0tWVFctQQ?oc=5\" target=\"_blank\">Tylenol maker Kenvue blasts Trump administration's autism"
    ],
    "image_url": "",
    "titles": [
      "The Trump administration is expected to link autism to Tylenol use during pregnancy",
      "Trump urges pregnant women to avoid Tylenol over unproven autism link",
      "Trump urges pregnant women to limit taking Tylenol - Axios",
      "Trump to link autism to Tylenol use during pregnancy - Axios",
      "Trump admin links Tylenol use in pregnancy to increased risk of autism",
      "Trump admin draws unproven link between autism and Tylenol ingredient use during pregnancy",
      "Trump administration reportedly plans to link autism to Tylenol ingredient use in pregnancy",
      "Trump Ties Tylenol During Pregnancy To Autism: ‘Don’t Take It’",
      "Tylenol maker Kenvue blasts Trump administration's autism claim - Axios"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.863,
      "consensus": 1.0,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.858,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Trump administration claims a link between acetaminophen use during pregnancy and autism, advising against its use unless necessary and promoting leucovorin as a potential autism treatment. However, there's minimal credible scientific support for these assertions, with experts denying a causal relationship between acetaminophen and autism. The situation has sparked controversy, including criticism from Tylenol's manufacturer, Kenvue.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Nvidia Partners with OpenAI, Commits $100 Billion to AI Advancements",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 22 Sep 2025 21:00:21 GMT",
    "source": "BBC",
    "sources": [
      "Axios",
      "Financial Times",
      "The Guardian",
      "Business Insider",
      "TechCrunch",
      "Al Jazeera",
      "BBC"
    ],
    "domains": [
      "www.ft.com",
      "techcrunch.com",
      "www.bbc.com",
      "www.aljazeera.com",
      "www.businessinsider.com",
      "www.theguardian.com",
      "news.google.com"
    ],
    "snippets": [
      "Nvidia says it will supply high-performance chips needed for OpenAI's data centres.",
      "The company will also provide chips for OpenAI’s data centres.",
      "<a href=\"https://news.google.com/rss/articles/CBMidkFVX3lxTE1ody1RblVBeDlaT2VoNlB1R1pFUEZqVUxCZWNyOFFzUDcxZHNfWUlaRlF4dF9TRHFPQklGdndiak40bXVaMlA1aE1NeFBQTUJEWnFxdVhRYVJkbkR0TVhWa1lycXlyUFp2ZDJ6X2JRcHc2X1ptOVE?oc=5\" target=\"_blank\">Nvidia to invest up to $100B in ChatGPT creator OpenAI</a>&nbsp;&nbs",
      "Partnership will support huge build-out of data centres for artificial intelligence",
      "<p>Deal will involve two transactions – OpenAI will pay Nvidia for chips, and the chipmaker will invest in the AI start-up</p><p>Nvidia, the chipmaking company, will invest up to $100bn in OpenAI and provide it with data center chips, the companies said on Monday, a tie-up between two of the highest",
      "$100 billion is worth something like 333 AI researchers with Meta salaries.",
      "OpenAI and Nvidia agreed to deploy 10 gigawatts worth AI chips to power the next generation of ChatGPT."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/8529/live/499529f0-97e6-11f0-8f46-6b3a3352ef22.jpg",
    "titles": [
      "Nvidia to invest $100bn in OpenAI",
      "Nvidia to invest billions in OpenAI as AI race heats up",
      "Nvidia to invest up to $100B in ChatGPT creator OpenAI - Axios",
      "Nvidia to invest up to $100bn in OpenAI",
      "Nvidia to invest $100bn in OpenAI, bringing the two AI firms together",
      "Nvidia plans to invest $100 billion into OpenAI. That's uh, a lot of money.",
      "Nvidia plans to invest up to $100B in OpenAI"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.916,
      "consensus": 1.0,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.843,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Nvidia has announced a partnership with OpenAI, agreeing to supply high-performance chips for OpenAI's data centers and invest up to $100 billion in the AI startup. This collaboration aims to significantly expand data center capabilities for artificial intelligence advancements. The deal includes OpenAI purchasing chips from Nvidia and a substantial investment by Nvidia into OpenAI, highlighting a major commitment to the future of AI technology.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: collaboration",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Dembélé Wins First Ballon d'Or, Bonmati Secures Women's Award",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 22 Sep 2025 20:52:44 GMT",
    "source": "BBC",
    "sources": [
      "Sky Sports",
      "Sportsnet",
      "Sports Illustrated",
      "ESPN",
      "BBC"
    ],
    "domains": [
      "www.espn.com",
      "www.sportsnet.ca",
      "www.bbc.com",
      "www.skysports.com",
      "news.google.com"
    ],
    "snippets": [
      "Paris St-Germain's Ousmane Dembele wins the Ballon d'Or, the award for the best player in the world, for the first time.",
      "Paris Saint-Germain forward Ousmane Dembélé has beaten Barcelona's Lamine Yamal to the Ballon d'Or after a fine season that ended with Champions League success.",
      "<a href=\"https://news.google.com/rss/articles/CBMib0FVX3lxTE1lMjBtQWZIS1lVbnBzMTdCMnh2MEkwbE5VV2dhcGkzUkxQME1qRmlYajBaQjJZTjV6Nm9ZWHpmX0xJX2FoZGR4TnRKazVsZWlMS1lySTlUdTd2TGxGOF9qYWhkbE9kZnhWM3lUTU1Hbw?oc=5\" target=\"_blank\">Ousmane Dembele Wins 2025 Men’s Ballon d’Or</a>&nbsp;&nbsp;<font color=\"#6f6f",
      "Ousmane Dembele and Aitana Bonmati were crowned the best men's and women's player in the world at the 2025 Ballon d'Or ceremony in Paris.",
      "<p>After securing a domestic treble and a pair of continental trophies, Ousmane Dembele will have to find room for yet another piece of distinguished hardware on his mantle. </p>"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/a5d9/live/acd74230-97f7-11f0-beff-6fe19e0dd9d4.jpg",
    "titles": [
      "Tearful Dembele wins Ballon d'Or as PSG dominate",
      "PSG's Dembélé wins Ballon d'Or ahead of Yamal",
      "Ousmane Dembele Wins 2025 Men’s Ballon d’Or - Sports Illustrated",
      "Dembele and Bonmati win Ballon d'Or awards",
      "PSG’s Ousmane Dembele, Barcelona’s Aitana Bonmati win Ballon d’Or awards"
    ],
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.914,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.812,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Ousmane Dembélé, Paris Saint-Germain forward, won the 2025 Ballon d'Or, marking his first win of the award for the world's best player. His victory came after a successful season highlighted by Champions League success and a domestic treble. Aitana Bonmati won the women's award at the same ceremony in Paris.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Rockets' Fred VanVleet Tears ACL, May Miss 2025-26 Season",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 22 Sep 2025 16:03:57 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Forbes",
      "Sportsnet",
      "CBS Sports"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com",
      "www.sportsnet.ca",
      "www.forbes.com"
    ],
    "snippets": [
      "Rockets star guard Fred VanVleet suffered a torn ACL during a recent workout and could potentially miss the entirety of the 2025-26 season, sources told ESPN.",
      "VanVleet recently signed a two-year, $50 million deal to remain in Houston",
      "Houston Rockets point guard Fred VanVleet has suffered an ACL tear according to ESPN’s Shams Charania. This injury puts his status for the 2025-26 NBA season in jeopardy.",
      "<p>Rockets veteran guard Fred VanVleet has reportedly suffered a torn ACL and will potentially miss the 2025-26 season, according to ESPN&#8217;s Shams Charania.</p>"
    ],
    "image_url": "",
    "titles": [
      "Sources: VanVleet has torn ACL, may miss season",
      "Fred VanVleet injury: Rockets star suffers torn ACL, could miss entire 2025-26 season, per report",
      "Rockets Guard Fred VanVleet Reportedly Suffers ACL Tear",
      "Report: Rockets’ Fred VanVleet suffers torn ACL"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.917,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.798,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Houston Rockets guard Fred VanVleet has torn his ACL during a workout, potentially sidelining him for the entire 2025-26 NBA season. This injury comes after he signed a two-year, $50 million contract to stay with the Rockets.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Denmark Airport Halts Flights Over Drone Concerns; 15 Diverted Amid Security",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 22 Sep 2025 22:59:39 GMT",
    "source": "BBC",
    "sources": [
      "Al Jazeera",
      "New York Times",
      "Deutsche Welle",
      "BBC"
    ],
    "domains": [
      "www.dw.com",
      "www.nytimes.com",
      "www.bbc.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Take-offs and landings at the airport have been suspended since around 20:30 local time (19:30 BST).",
      "At least 15 flights have been diverted as airport remains closed until the situation is resolved, Denmark officials say.",
      "According to FlightRadar, some 35 flights were diverted from Denmark's principal airport. Security concerns in northern Europe have increased in recent weeks after Russian fighter jet incursions into NATO airspace.",
      "The airport was closed for several hours because or two or three large drones spotted in the area."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/a3b8/live/b82541c0-97f0-11f0-be9f-872dac3e9076.jpg",
    "titles": [
      "Copenhagen Airport reopens after drone sightings",
      "Copenhagen airport shut after sighting of ‘unidentified drones’",
      "Copenhagen Airport halts air traffic after drone sightings",
      "Flights Are Temporarily Diverted From Copenhagen Airport After Drone Sightings"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.955,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.787,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Denmark's main airport suspended take-offs and landings since 20:30 local time due to security concerns after spotting 2-3 large drones nearby. At least 15 flights were diverted, with FlightRadar reporting about 35 in total. The closure, amid rising security tensions in northern Europe from Russian jet incursions into NATO airspace, lasted several hours until the situation was resolved.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Supreme Court Allows Trump to Dismiss FTC's Slaughter Pending Review",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Mon, 22 Sep 2025 15:49:45 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "CNBC",
      "Al Jazeera"
    ],
    "domains": [
      "www.cnbc.com",
      "www.npr.org",
      "www.aljazeera.com"
    ],
    "snippets": [
      "At issue is whether the president has the authority to dismiss the heads of those agencies that are protected by Congress.",
      "Decision means Rebecca Slaughter remains barred from her post at the Federal Trade Commission for the time being.",
      "The Supreme Court allowed President Donald Trump to remove Rebecca Slaughter as a member of the Federal Trade Commission while the justices consider her case."
    ],
    "image_url": "",
    "titles": [
      "Supreme Court allows Trump to fire -- for now -- remaining Democrat on FTC",
      "US Supreme Court to consider whether Trump may fire Democratic FTC member",
      "Supreme Court lets Trump fire FTC's Slaughter for now"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.913,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.751,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Supreme Court has permitted President Donald Trump to dismiss Rebecca Slaughter from her position at the Federal Trade Commission. This decision is pending as the justices deliberate on whether the president has the authority to remove heads of agencies protected by Congress. Consequently, Slaughter is currently barred from her post.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "British-Egyptian Activist Alaa Abd el-Fattah Released After Sentence Commuted",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-09-22T13:51:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Washington Post",
      "New York Times",
      "Deutsche Welle",
      "The Guardian"
    ],
    "domains": [
      "www.dw.com",
      "www.nytimes.com",
      "www.washingtonpost.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Prominent British-Egyptian democracy advocate Alaa Abd el-Fattah has been freed after years of detention. His release follows a petition from Egypt’s human rights council and increased international pressure.",
      "Abdel Fattah was a symbol of the 2011 uprising but was arrested two years later. He has since spent almost all of the past 12 years behind bars.",
      "Alaa Abd El Fattah, a British-Egyptian dual citizen, was imprisoned for most of the past 12 years as a dissident. He and his mother went on hunger strike to press for his release.",
      "<p>Reports say writer, who has served six years for sharing a Facebook post, was given a presidential pardon</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/sep/22/palestinian-state-gaza-israel-middle-east-hamas-benjamin-netanyahu-latest-live-updates\">Middle East crisis – live upd"
    ],
    "image_url": "",
    "titles": [
      "Egypt pardons jailed activist Alaa Abd el-Fattah",
      "Egypt’s president pardons jailed Arab Spring activist Alaa Abdel Fattah",
      "Egypt Pardons Alaa Abd El Fattah, Its Most Prominent Political Prisoner",
      "British-Egyptian activist Alaa Abd el-Fattah to be freed from prison"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.806,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.75,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "British-Egyptian activist Alaa Abd el-Fattah, arrested in 2019 and sentenced in 2021 to five years for \"spreading false news,\" has been released. His freedom comes after President Abdul Fattah al-Sisi commuted his sentence along with five others, following a petition from Egypt’s human rights council and international advocacy. Abd el-Fattah, known for his role in the 2011 uprising, spent nearly 12 years in detention.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Estonia, Poland Accuse Russia of Airspace Violation, Seek NATO Response",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Mon, 22 Sep 2025 23:23:42 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Axios",
      "Al Jazeera",
      "Deutsche Welle"
    ],
    "domains": [
      "www.dw.com",
      "news.google.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Russia denies the allegations and accuses European powers of levying baseless accusations.",
      "Following Poland, Estonia is calling on NATO to respond to violations of its national airspace by Russia. Some analysts fear that it may take downing a Russian aircraft to discourage future incursions.",
      "<a href=\"https://news.google.com/rss/articles/CBMihwFBVV95cUxOTkVpa0kyckN1RkFveFNJcTdPbEhOTzQ0aGtGV2RpcU4zNE84MVFnZkdMN2NyNUNzQ2o3bEZIb3hvWGNhX0FxSWpqaE5EN1FwRnpHUWtoOXRWZ2ZlNUExNTRpRFRoS0FWWmpYYzUtb2h2cDIzcXJtZHhwci1WSjFBcTF1TEdwZlU?oc=5\" target=\"_blank\">Russia's \"brazen\" NATO airspace violations h"
    ],
    "image_url": "",
    "titles": [
      "At UNSC meeting, West and Russia clash over NATO airspace violations",
      "Estonia urges NATO to act on Russia's airspace violations",
      "Russia's \"brazen\" NATO airspace violations head to UN Security Council - Axios"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.983,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.747,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Estonia and Poland have accused Russia of violating their national airspace, calling on NATO for a response. Russia denies these allegations, labeling them as baseless. The situation raises concerns among some analysts that it might require the downing of a Russian aircraft to deter future incursions.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "49ers' Nick Bosa Out for Season with Torn ACL After Cardinals Game",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 22 Sep 2025 14:32:43 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sports Illustrated",
      "Sportsnet"
    ],
    "domains": [
      "www.espn.com",
      "www.sportsnet.ca",
      "news.google.com"
    ],
    "snippets": [
      "49ers Pro Bowl defensive end Nick Bosa tore his right ACL during Sunday's 16-15 victory against the Cardinals at Levi's Stadium, and he will need season-ending surgery.",
      "<a href=\"https://news.google.com/rss/articles/CBMifEFVX3lxTE5mLVpQNTFsOUVIaWZYbjBWTXJmSC1wS3NqdXhySUNjUERnN0JhVlZOZDA2aC02VW16YTMwQWdrVjJ2NlU4OGVaOXZKbWx4aW5QMi0tT0Ixc2VERnJEcU8wQVlQcDh5OXdwbEVSMnNpNURMa1dsb2lnci1XeE4?oc=5\" target=\"_blank\">49ers Lose Nick Bosa for Remainder of 2025 Season with Torn ",
      "<a href=\"https://news.google.com/rss/articles/CBMilwFBVV95cUxNWURlMWNZVWZWcGhHYjZGakNlN1FCaWlZZldRT0hrVUk1N0hOSmlvM25KU2xFUlVoQ2N0Q1p2RmZXMEtRQzV0Q1Z0UmwwQ25Fd1paQmN0dzc1YkJoNjZ3clFhQ3NPQkVyQ25oUFhQaWhaaXQtSExkMTFxc2JEaGJtLVFCblFjZl93X0NsQmFYQnpTdWtFbnhv?oc=5\" target=\"_blank\">Auburn's Bruce Pearl Se",
      "<p>The San Francisco 49ers&#8217; injury woes have gone from bad to worse.</p>"
    ],
    "image_url": "",
    "titles": [
      "49ers DE Bosa out for season with torn right ACL",
      "49ers Lose Nick Bosa for Remainder of 2025 Season with Torn ACL - Sports Illustrated",
      "Auburn's Bruce Pearl Set to Retire Before 2025-26 Season - Sports Illustrated",
      "Report: 49ers DE Nick Bosa suffers season-ending torn ACL"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.889,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.74,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "San Francisco 49ers Pro Bowl defensive end Nick Bosa suffered a torn right ACL during a 16-15 victory against the Cardinals at Levi's Stadium, necessitating season-ending surgery. This injury adds to the 49ers' growing list of setbacks this season.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Jimmy Kimmel's Show to Resume Tuesday After Disney Suspension",
    "domain": "technology",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 22 Sep 2025 22:12:14 GMT",
    "source": "BBC",
    "sources": [
      "Financial Times",
      "The Verge",
      "BBC"
    ],
    "domains": [
      "www.ft.com",
      "www.theverge.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The late-night comic's show will return to air after Disney said it had \"thoughtful coversations\" with him.",
      "Jimmy Kimmel’s late-night talk show is returning on Tuesday after Disney pulled it off the air over comments made about the assassination of Charlie Kirk. In a statement on Monday, Disney said it planned to resume production after having “thoughtful conversations” with Kimmel. &#8220;Last Wednesday,",
      "Company says comments on Charlie Kirk killing were ‘insensitive’ but broadcast is to resume after talks with host"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/6a8f/live/3a2c90b0-97fb-11f0-be80-2974137b337f.jpg",
    "titles": [
      "Jimmy Kimmel show to return after suspension over Charlie Kirk comments",
      "Jimmy Kimmel’s show will return after censorship outrage",
      "Disney to return Kimmel’s show to airwaves after brief suspension"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.939,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.725,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Jimmy Kimmel's late-night show will return to air on Tuesday after being temporarily pulled by Disney due to his comments about the assassination of Charlie Kirk. Disney described the comments as 'insensitive' but decided to resume the show following \"thoughtful conversations\" with Kimmel.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "SportsLine Experts Share Picks for NFL Week 3, Fans Discuss Early Games",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Mon, 22 Sep 2025 23:53:25 +0000",
    "source": "CBS Sports",
    "sources": [
      "Yahoo Sports",
      "CBS Sports"
    ],
    "domains": [
      "www.windycitygridiron.com",
      "www.cbssports.com",
      "www.hogshaven.com",
      "www.battleredblog.com"
    ],
    "snippets": [
      "The SportsLine projection model has revealed its Baltimore vs. Detroit picks for the 2025 NFL Week 3 Monday Night Football game",
      "DFS millionaire Mike McClure shares his top daily fantasy football picks and lineup advice for Ravens vs. Lions on 'Monday Night Football'",
      "SportsLine expert Mike Tierney has revealed his Detroit vs. Baltimore picks for the Week 3 NFL matchup on 'Monday Night Football'",
      "The SportsLine Projection Model has locked in its top anytime TD scorer picks for Detroit vs. Baltimore on Monday Night Football",
      "With the Chicago Bears drawing a late afternoon kickoff time slot today against the Dallas Cowboys, we had to give the WCG faithful a place to talk about the early games, so this will be your open thread (Rated WCG-MA). Here’s the full slate of Noon (CT) games. Cleveland Browns at Green Bay Packers ",
      "The Lions visit the 49ers",
      "Come and watch a football game with us!"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/13/1c482567-9713-4729-9cde-16ebbee52c47/jahmyr-gibbs-lions-imagn-images.jpg",
    "titles": [
      "Lions vs. Ravens prediction, odds, start time: 2025 NFL Week 3 Monday Night Football picks from proven model",
      "NFL DFS, Lions vs. Ravens: Best FanDuel, DraftKings daily Fantasy football picks for Monday Night Football",
      "Monday Night Football prediction, odds, line, spread: Ravens vs. Lions picks by Baltimore expert on 45-22 run",
      "Ravens vs. Lions anytime touchdown scorer picks, odds, prediction: Back Derrick Henry on Monday Night Football",
      "NFL Week 3 Monday Night Football Open Thread",
      "Monday Night Football: Detroit Lions vs Baltimore Ravens",
      "Monday Night Football Open Thread – Detroit Lions at Baltimore Ravens"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.993,
      "consensus": 0.631,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.664,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The SportsLine projection model and experts Mike McClure and Mike Tierney have provided their picks and analysis for the Week 3 NFL Monday Night Football game between Baltimore and Detroit. Additionally, the model has selected its top picks for anytime TD scorer in the same game. Meanwhile, the Chicago Bears are set to play the Dallas Cowboys in a late afternoon slot, and an open thread has been created for fans to discuss the early games, including a notable match between the Cleveland Browns and Green Bay Packers. The Lions are also mentioned as visiting the 49ers, indicating a full schedule",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Bruce Pearl, Tigers' Winningest Coach, Retires 42 Days Before Season",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 22 Sep 2025 15:50:19 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sports Illustrated"
    ],
    "domains": [
      "www.espn.com",
      "news.google.com"
    ],
    "snippets": [
      "The Tigers' winningest coach is retiring. Here's what that means with 42 days until the 2025-26 season tips off.",
      "<a href=\"https://news.google.com/rss/articles/CBMimgFBVV95cUxQY0VkZFhkMmcwczN4bi1reFBGOHdsV3ZGUTJKZ1BlWGtia0phaFR0c01Fa3JXU0lKVWttMDliSGVMS0d5d1lBaTZRWXliQmJhUVFiamJwUkg4TWVqTWZ0bE05NEp4dnozNWttVU1tUS0wRzNpekJsUTRJYzdLdm9OaGthYTF2ZHBCY1JabVdZNHM5WHUySm9wN3Fn?oc=5\" target=\"_blank\">Bruce Pearl’s Retir"
    ],
    "image_url": "",
    "titles": [
      "What Bruce Pearl's retirement means for Auburn, college basketball",
      "Bruce Pearl’s Retirement Spotlights a Growing College Basketball Coaching Trend - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.913,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.663,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Tigers' most successful coach, Bruce Pearl, is retiring with 42 days left until the 2025-26 season begins. This marks the end of an era for the team as they prepare for the upcoming season without their winningest coach at the helm.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Cowboys Face Injury Crisis Ahead of Packers Game",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Mon, 22 Sep 2025 23:23:08 +0000",
    "source": "CBS Sports",
    "sources": [
      "Sportsnet",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Dallas' injuries on offense continue to mount ahead of a Week 4 showdown with Micah Parsons and the Packers",
      "<p>Fresh off a loss to the Chicago Bears, the Dallas Cowboys will have to keep their heads above water without the help of their superstar receiver for the foreseeable future. </p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/22/8eeb591d-bd26-4e57-9db7-358a8b7be905/tyler-booker-dallas-cowboys.jpg",
    "titles": [
      "Tyler Booker injury: Cowboys guard expected to miss 4-6 weeks with high ankle sprain",
      "Cowboys’ CeeDee Lamb suffers ankle sprain, could miss 3-4 weeks"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.983,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.652,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Dallas Cowboys are facing significant injury challenges on their offense as they prepare for a Week 4 game against the Packers, following a recent loss to the Chicago Bears. The team will be without their superstar receiver for an unspecified period, adding to their difficulties.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Lions vs. Ravens in Playoff-Chasing Primetime Clash",
    "domain": "sports",
    "source_domain": "www.prideofdetroit.com",
    "location": "national",
    "published": "Mon, 22 Sep 2025 23:30:00 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports",
      "Sportsnet"
    ],
    "domains": [
      "www.prideofdetroit.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Come join our live chat for the first half of Detroit Lions at Baltimore Ravens.",
      "<p>The Baltimore Ravens and Detroit Lions, two teams with massive playoff aspirations, square off in an inter-conference heavyweight matchup perfect for primetime. Follow the action with Sportsnet&#8217;s live tracker at 8:15 p.m. ET / 5:15 p.m. PT</p>"
    ],
    "image_url": "",
    "titles": [
      "Detroit Lions vs. Baltimore Ravens first half live chat",
      "NFL Live Tracker: Lions vs. Ravens"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.985,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.652,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Detroit Lions and Baltimore Ravens, both aiming for playoff spots, faced off in a primetime inter-conference game. Fans could follow the live action through Sportsnet's tracker at 8:15 p.m. ET / 5:15 p.m. PT.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Meta Launches AI Dating Assistant and \"Meet Cute\" Feature on Facebook Dating",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-09-22T14:59:59-04:00",
    "source": "The Verge",
    "sources": [
      "TechCrunch",
      "The Verge"
    ],
    "domains": [
      "www.theverge.com",
      "techcrunch.com"
    ],
    "snippets": [
      "Facebook Dating is getting new AI features to help users avoid “swipe fatigue,” Meta announced today. The new features include a new “dating assistant” AI chatbot that helps you find potential matches as well as a new “Meet Cute” feature that automatically matches you with someone using a “personali",
      "Facebook Dating's AI assistant is supposed to help users build their profiles and find the matches they're looking for."
    ],
    "image_url": "",
    "titles": [
      "Facebook Dating tries using AI to end ‘swipe fatigue’",
      "Facebook is getting an AI dating assistant"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.897,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.651,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Meta introduced new AI features to Facebook Dating, including a \"dating assistant\" chatbot and a \"Meet Cute\" feature for automatic matching based on personality, aiming to reduce \"swipe fatigue\" among users. These updates are designed to assist in profile creation and improve match-finding efficiency.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: improve",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Aitana Bonmati Wins Women's Ballon d'Or for 3rd Time, a Historic First",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 22 Sep 2025 21:32:55 GMT",
    "source": "BBC",
    "sources": [
      "Forbes",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.forbes.com"
    ],
    "snippets": [
      "Spain and Barcelona midfielder Aitana Bonmati makes history by becoming the first player to win the women's Ballon d'Or three times.",
      "FC Barcelona’s Aitana Bonmatí has become the first woman to win three Ballon D’Or trophies after being awarded the prestigious accolade for the third year in succession."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/6922/live/992afbe0-97f8-11f0-beff-6fe19e0dd9d4.jpg",
    "titles": [
      "Why Spain's Bonmati won record third women's Ballon d'Or",
      "Aitana Bonmatí Wins Historic Third Consecutive Ballon D’Or In Paris"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.926,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.647,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Aitana Bonmati, a midfielder from Spain and Barcelona, has made history by winning the women's Ballon d'Or three times. She is the first woman to achieve this feat, securing the prestigious award for the third consecutive year.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Apple Stock Rises on New iPhone, Watch, and AirPods Launch",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Mon, 22 Sep 2025 20:00:20 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "MarketWatch"
    ],
    "domains": [
      "www.marketwatch.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "Apple's stock has turned green for the year after the company released new iPhone, Apple Watch, and AirPods models on Friday.",
      "Strong early demand for the new iPhone is fueling a rally in Apple’s stock, but some analysts are seeing mixed signals for the pricier models."
    ],
    "image_url": "",
    "titles": [
      "Apple's stock turns positive for the year after iPhone 17 launch",
      "Apple’s stock surges to a 2025 high on hot iPhone 17 demand. Can the rally continue?"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.897,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.641,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Apple's stock has become positive for the year following the release of new iPhone, Apple Watch, and AirPods models. The surge in Apple’s stock is attributed to high early demand for the new iPhone, although analysts have given mixed reviews about the demand for the more expensive models.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Treasury Considers \"All Options\" to Aid President Milei Amid Market Volatility",
    "domain": "business",
    "source_domain": "www.ft.com",
    "location": "global",
    "published": "Mon, 22 Sep 2025 18:02:35 GMT",
    "source": "Financial Times",
    "sources": [
      "New York Times",
      "Financial Times"
    ],
    "domains": [
      "www.ft.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "Scott Bessent says ‘all options’ are on the table to support the country through period of market volatility",
      "Treasury Secretary Scott Bessent said “all options” are under consideration to help President Javier Milei."
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F6092dc9e-55b2-4a45-bb7e-3345728f1f9c.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "US offers financial lifeline to Argentina’s Javier Milei",
      "U.S. Pledges Support for Argentina’s Economy and Javier Milei"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.861,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.634,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Treasury Secretary Scott Bessent stated that \"all options\" are being considered to assist President Javier Milei during a period of market volatility. The outcome of this consideration is currently pending.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Judge Allows Restart of Revolution Wind Project Off Rhode Island",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Mon, 22 Sep 2025 19:19:26 GMT",
    "source": "Axios",
    "sources": [
      "CNBC",
      "Axios"
    ],
    "domains": [
      "www.cnbc.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMigAFBVV95cUxPMVhvc3lxczRPTnpPc3dtMFZ5TzZ3enMtdzh5Q2FYcmFSeWx6ZDNlOWwySlVVRjhGaWJqOVFFUC1JNmNOTXJ6SnN2ak9QSERMeUMxQmlNdmFueVRRVkVLaDVXS2U4b3R1WGpTcE5Fd0FrSGxCb3U4RUdWV1VPMjRtYQ?oc=5\" target=\"_blank\">Trump-stalled offshore wind project can restart, judg",
      "The Interior Department had ordered Orsted on Aug. 22 to halt construction on Revolution Wind off the coast of Rhode Island and Connecticut."
    ],
    "image_url": "",
    "titles": [
      "Trump-stalled offshore wind project can restart, judge says - Axios",
      "Trump's order to halt offshore wind project overturned, Orsted to restart work soon"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.884,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.632,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A judge has ruled that the offshore wind project, Revolution Wind, which had been halted by the Interior Department on August 22, can now restart. This project, located off the coast of Rhode Island and Connecticut, had faced delays due to Trump administration policies.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Kara Lawson Named U.S. Women's Basketball Coach for 2028 LA Games",
    "domain": "sports",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Mon, 22 Sep 2025 17:26:52 GMT",
    "source": "Sports Illustrated",
    "sources": [
      "Sports Illustrated",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMihgFBVV95cUxPVnE5S1FyNENuYm43TVN0WlFST1duVmp4ZE1uMTRFcG9Ec1IteEZCSlZhYUhtaU1ocGFJTENkbXhsbDVYNmlQdXZibkNaTU1PdHE2MERIdVdrNXdaOUhGcmFVTDFzdl93dUlFMXNLZDZwVmU4cW1yWFVzWk1lRGgzV1pYSlNsQQ?oc=5\" target=\"_blank\">Team USA Announces New Women's Basketball Hea",
      "<p>Kara Lawson helped the U.S. women&#8217;s basketball team win an Olympic gold medal as a player 17 years ago. Now she&#8217;ll have a chance to lead it to another as the coach in the 2028 Los Angeles Games.</p>"
    ],
    "image_url": "",
    "titles": [
      "Team USA Announces New Women's Basketball Head Coach for 2028 Los Angeles Games - Sports Illustrated",
      "Kara Lawson named head coach of the US women’s basketball team for 2028 Olympics"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.851,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.625,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Kara Lawson, a former Olympic gold medalist, has been named the head coach of the U.S. women's basketball team for the 2028 Los Angeles Games. This marks her return to the team, this time in a leadership role, 17 years after her victory as a player.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Brussels Airport Cuts 50% Flights After Cyberattack on Check-In System",
    "domain": "technology",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 22 Sep 2025 09:58:16 GMT",
    "source": "BBC",
    "sources": [
      "TechCrunch",
      "BBC"
    ],
    "domains": [
      "techcrunch.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Brussels Airport asks airlines to cancel nearly half of their outgoing flights on Monday.",
      "A cyberattack targeting Collins Aerospace, a provider of airport check-in systems, sparked delays and disrupted flights across Europe over the weekend."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/dcb9/live/5f3c2610-97a9-11f0-af62-91486a511a31.jpg",
    "titles": [
      "EU cyber agency says airport software held to ransom by criminals",
      "EU cyber agency confirms ransomware attack causing airport disruptions"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.728,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.608,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Brussels Airport requested airlines to cancel almost 50% of their outgoing flights on Monday due to a cyberattack on Collins Aerospace's airport check-in systems. This incident caused widespread delays and disruptions to flights across Europe over the weekend.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Western Forest Products to Curtail BC Sawmill Operations in Q4 2025",
    "domain": "business",
    "source_domain": "financialpost.com",
    "location": "national",
    "published": "Mon, 22 Sep 2025 22:05:07 +0000",
    "source": "Financial Post",
    "sources": [
      "Financial Post"
    ],
    "domains": [
      "financialpost.com"
    ],
    "snippets": [
      "VANCOUVER, British Columbia, Sept. 22, 2025 (GLOBE NEWSWIRE) &#8212; Western Forest Products Inc. (TSX: WEF) (“Western” or the “Company”) announced today planned temporary operating curtailments at its British Columbia (“B.C.”) sawmills during the fourth quarter of 2025. These planned curtailments, ",
      "VANCOUVER, British Columbia, Sept. 22, 2025 (GLOBE NEWSWIRE) &#8212; Western Forest Products Inc. (TSX: WEF) (“Western” or the “Company”) third quarter 2025 financial and operating results will be released on Wednesday, November 5, 2025. Western will host its third quarter 2025 analyst conference ca"
    ],
    "image_url": "",
    "titles": [
      "Western Forest Products Announces Lumber Production Curtailments",
      "Western Forest Products Inc. Announces Release Date of Third Quarter 2025 Results and Conference Call Details"
    ],
    "score_components": {
      "magnitude": 0.393,
      "recency": 0.957,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.466,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Western Forest Products Inc. announced it will temporarily curtail operations at its British Columbia sawmills in Q4 2025. The company will also release its Q3 financial and operating results on November 5, 2025, and host an analyst conference call the same day.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "TechCrunch Disrupt 2025 to Unveil Space Tech Future in San Francisco",
    "domain": "technology",
    "source_domain": "techcrunch.com",
    "location": "global",
    "published": "Mon, 22 Sep 2025 19:15:00 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com"
    ],
    "snippets": [
      "At TechCrunch Disrupt 2025, Charles Hudson (Precursor Ventures) and Wesley Chan (FPV Ventures) break down what early-stage investors really look for in founders — from narrative and resilience to red flags and common mistakes. Don’t miss this candid Builders Stage conversation. Register by September",
      "Elad Gil shares his approach to early-stage investing, frontier tech, and spotting breakout potential at TechCrunch Disrupt 2025 (Oct 27–29, Moscone West, SF). Register before Sept 26 to save up to $668.",
      "Whether you’re a space junkie, a startup builder, or an investor chasing the edge of innovation, the Space Stage will deliver insights on what’s next in one of the most dynamic sectors in tech."
    ],
    "image_url": "",
    "titles": [
      "What Early-Stage Investors Really Look for in Founders at TechCrunch Disrupt 2025",
      "Inside the mind of Elad Gil: Early-stage investing and next-gen innovation at TechCrunch Disrupt 2025",
      "Lift off: First look at the Space Stage agenda at TechCrunch Disrupt 2025"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.902,
      "consensus": 0.35,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.458,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "TechCrunch Disrupt 2025, happening in San Francisco from October 27-29, will feature the first reveal of the Space Stage agenda, focusing on the future of space technology. Attendees, ranging from enthusiasts to investors, will gain insights into this dynamic sector. Early registration by September 26 offers savings up to $668. The event aims to connect founders with investors and partners, highlighting innovation in tech.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: innovation",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "New Bass and \"Ghost\" Marsupial Species Discovered",
    "domain": "science",
    "source_domain": "scitechdaily.com",
    "location": "global",
    "published": "Mon, 22 Sep 2025 13:39:38 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "scitechdaily.com"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/scientists-discover-two-new-bass-species-hiding-in-plain-sight/\" rel=\"nofollow\" title=\"Scientists Discover Two New Bass Species Hiding in Plain Sight\"><img alt=\"Altamaha Bass\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"583\" src=\"https://scitechdaily.com/im",
      "<a href=\"https://scitechdaily.com/scientists-discover-new-ghost-species-of-marsupial-closely-related-to-the-kangaroo/\" rel=\"nofollow\" title=\"Scientists Discover New “Ghost” Species of Marsupial, Closely Related to the Kangaroo\"><img alt=\"Woylie Illustration\" class=\"webfeedsFeaturedVisual wp-post-ima"
    ],
    "image_url": "",
    "titles": [
      "Scientists Discover Two New Bass Species Hiding in Plain Sight",
      "Scientists Discover New “Ghost” Species of Marsupial, Closely Related to the Kangaroo"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.803,
      "consensus": 0.35,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.439,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Scientists have identified two new bass species previously unrecognized and a new \"ghost\" species of marsupial closely related to kangaroos. These discoveries, made through genetic analysis and field observations, highlight the ongoing diversity in both aquatic and terrestrial ecosystems. The findings, published in separate studies, expand our understanding of species diversity and underscore the importance of conservation efforts for these newly identified animals.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  }
]