[
  {
    "title": "Astronomers Discover Iron Rain Potential on YSES-1 System Planet",
    "domain": "general",
    "location": "global",
    "published": "Tue, 10 Jun 2025 15:00:02 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "<p>Experts say thick slabs of cloud in YSES-1 system could consist of mineral dust and iron, which would rain down</p><p>Should humans ever venture to a particular planet that circles a sun-like star in the constellation of the fly, they would do well to keep an eye on the weather.</p><p>The thick slabs of cloud that blot the planet’s skies are mostly made from mineral dust, but astronomers suspect there may be iron in them, too, which would rain down on the world below when the clouds break.</p> <a..."
    ],
    "image_url": "https://i.guim.co.uk/img/media/dcbced00390b69417ffc8d155f538651979ef55d/204_0_3100_2480/master/3100.jpg?width=140&quality=85&auto=format&fit=max&s=d6ff8b0484f115fd59cd1e16ee08031c",
    "titles": [
      "Astronomers left puzzled by high-altitude clouds forming on young planet"
    ],
    "summary": "Astronomers have discovered that the planet orbiting a sun-like star in the YSES-1 system, located in the constellation of the fly, features thick clouds composed primarily of mineral dust. It is suspected that these clouds also contain iron, which could lead to iron rain falling on the planet's surface when the clouds dissipate. This finding adds a unique aspect to the planet's atmospheric conditions and weather patterns.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides a deeper understanding of the atmospheric conditions and weather patterns on a planet in the YSES-1 system. However, it does not offer actionable insights or report on solutions or improvements. It does increase awareness about the unique features of celestial bodies.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.993,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.427
  },
  {
    "title": "Islamabad Hikes Defence Budget; Canada to Meet NATO Target Early",
    "domain": "general",
    "location": "global",
    "published": "Tue, 10 Jun 2025 14:59:36 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "The Guardian"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "Defence spending surges in Islamabad&#039;s new budget, even as overall expenditures shrink.",
      "<p>Carney says Canada will hit Nato target of 2% of GDP five years ahead of schedule amid ‘dangerous and divided world’</p><p><a href=\"https://www.theguardian.com/world/mark-carney\">Mark Carney</a> has promised to boost defence spending to its highest level in decades, warning that in a “dangerous and divided world”, <a href=\"https://www.theguardian.com/world/canada\">Canada</a> must reduce its dependence on the US for defence.</p><p>Speaking at the University of Toronto on Monday, Carney said Canada would reach <a href=\"https://www.theguardian.com/world/nato\">Nato</a>’s 2% military..."
    ],
    "image_url": "",
    "titles": [
      "Pakistan ramps up defence spending by 20 percent after India conflict",
      "Canadian PM vows to boost defence spending and reduce dependency on US"
    ],
    "summary": "Islamabad has increased its defence spending in the new budget, despite overall budget cuts. Simultaneously, Canada, as stated by Mark Carney, plans to reach the NATO target of allocating 2% of its GDP to defence spending five years ahead of schedule, aiming to lessen its reliance on the US amidst global tensions. This marks Canada's highest defence budget increase in decades.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story provides useful information about the defence spending of two countries, which could influence decision-making in international relations. It reports on Canada's proactive approach to meeting NATO targets, indicating a solution to reliance on the US. It also increases awareness about the global trend of defense spending.",
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.993,
      "consensus": 0.632,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.714
  },
  {
    "title": "Alleged Smuggler Caught with $437K of Cocaine in Shoes",
    "domain": "general",
    "location": "national",
    "published": "Tue, 10 Jun 2025 14:56:47 +0000",
    "source": "Global News",
    "sources": [
      "Global News"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "An alleged drug smuggler was unsuccessful in a recent attempt to walk on by border services officers with $437,000 worth of cocaine hidden in shoes."
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/06/Screenshot-2025-06-10-101618.png",
    "titles": [
      "$437K worth of cocaine found hidden inside shoes at Toronto Pearson airport"
    ],
    "summary": "An alleged drug smuggler was caught attempting to pass through border services with $437,000 worth of cocaine concealed within shoes. The smuggling attempt was unsuccessful, leading to the individual's apprehension by authorities.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "While this story does provide basic awareness about a specific smuggling attempt, it lacks depth and insight. It does not provide actionable insights or report on solutions to the problem of drug trafficking. The story does not contribute meaningfully to the reader's understanding or sense of agency.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.992,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 1.0
    },
    "score": 0.447
  },
  {
    "title": "Alberta Tops in Reclamation Security Costs for Renewables, Study Finds",
    "domain": "general",
    "location": "national",
    "published": "Tue, 10 Jun 2025 14:48:42 +0000",
    "source": "Global News",
    "sources": [
      "Global News"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "Business Renewables Centre-Canada analyzed the reclamation security requirements for renewables in 27 jurisdictions and found Alberta's are now the most costly."
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/06/123adebe5a52fd2e8fef1419762138db52a656ce5345391a3452185ae391f321.jpg?quality=85&strip=all",
    "titles": [
      "Report suggests renewable cleanup rules making Alberta less competitive for investment"
    ],
    "summary": "An analysis by the Business Renewables Centre-Canada of reclamation security requirements for renewable energy projects across 27 jurisdictions found that Alberta has the highest costs. This means that for projects in Alberta, the financial guarantees required to ensure sites are properly reclaimed after use are more expensive than in any other examined location.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story is constructive as it provides useful information about the financial implications of renewable energy projects in Alberta compared to other jurisdictions. However, it does not report on any solutions, improvements, or attempts to solve the problem of high reclamation security costs.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.989,
      "consensus": 0.393,
      "constructiveness": 0.7,
      "proximity": 1.0
    },
    "score": 0.48
  },
  {
    "title": "Trump Orders More Troops to California Amid Protests, LAPD Concerned",
    "domain": "general",
    "location": "global",
    "published": "Tue, 10 Jun 2025 14:45:55 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "<p>Trump doubles down on decision to deploy thousands more troops; LAPD says marines’ arrival without coordination presents a ‘significant’ challenge</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/2025/jun/09/los-angeles-protests\">Trump sends thousands more troops to California in ‘authoritarian’ move</a></p></li></ul><p>US officials said the marines were being deployed to protect federal property and personnel, including immigration agents. A convoy of 10 to 15 buses with blacked-out windows and escorted by sheriff’s vehicles, left the base at Twentynine Palms in the desert east..."
    ],
    "image_url": "https://i.guim.co.uk/img/media/beb4bde6cc42f6e427da87039049f6b816cb56ee/797_0_4800_3840/master/4800.jpg?width=140&quality=85&auto=format&fit=max&s=d7ebb188659d581843c483469996a935",
    "titles": [
      "Trump again defends decision to ‘send in the troops’ after LAPD calls marines’ arrival an ‘operational challenge’ – live"
    ],
    "summary": "President Trump has escalated his decision to deploy thousands more troops to California, a move criticized by some as authoritarian. The deployment aims to protect federal property and personnel amidst ongoing protests. The LAPD has expressed concerns over the lack of coordination, highlighting the challenges this presents. A convoy of buses carrying marines left the Twentynine Palms base, indicating the immediate implementation of this decision.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "While the story provides basic awareness about the ongoing protests in California and the government's response, it lacks depth and insight into the underlying causes or potential solutions to the situation. The story also does not empower the reader with actionable insights.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.988,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.416
  },
  {
    "title": "Canada's F-35 Jet Program Costs Soar by $8.7 Billion, Audit Finds",
    "domain": "general",
    "location": "national",
    "published": "Tue, 10 Jun 2025 14:40:56 +0000",
    "source": "Global News",
    "sources": [
      "Global News"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "An investigation by the auditor general of Canada finds costs associated with the F-35 advanced fighter jet program are running $8.7 billion higher than the original estimates."
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/06/F-35-fighter-jet.jpg?quality=85&strip=all",
    "titles": [
      "F-35 costs soar nearly 50% amid delays, AG reports"
    ],
    "summary": "The auditor general of Canada concluded that the F-35 fighter jet program's expenses have exceeded initial projections by $8.7 billion. This finding highlights a significant increase in costs from the original estimates for the advanced aircraft procurement plan.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs readers about the increased costs of Canada's F-35 jet program, providing useful context. However, it does not offer solutions or highlight any progress made in addressing the issue. The story does increase clarity around the financial impacts of the program.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.987,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 1.0
    },
    "score": 0.469
  },
  {
    "title": "Deadliest Mass Shooting in Austria: 10 Dead in Graz School Incident",
    "domain": "general",
    "location": "global",
    "published": "Tue, 10 Jun 2025 14:40:23 GMT",
    "source": "BBC",
    "sources": [
      "Washington Post",
      "New York Times",
      "Al Jazeera",
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "Police say the gunman is among the dead, with the Interior Minister saying he was a former pupil.",
      "Several people have been killed in a mass shooting at a high school in Graz, the country’s second-largest city, police said.",
      "The victims names and ages have not been released. The police said the gunman also died, in an apparent suicide. The attack is among the worst school shootings in Europe in years.",
      "At least 10 people have died in Austria&#039;s deadliest mass shooting in the country&#039;s second-largest city.",
      "Police for the state of Styria said nine people were killed and several seriously injured in a high school in Graz, Austria. They said the shooter was also dead.",
      "French President Emmanuel Macron said that the \"nation was in mourning\" after the death of the 31-year-old.",
      "<p>Fifteen-year-old suspect arrested and Emmanuel Macron condemns ‘senseless violence’ after stabbing in Nogent</p><p>Emmanuel Macron has condemned what he called a “senseless wave of violence” after a 15-year-old pupil fatally stabbed a teaching assistant at a school.</p><p>The 31-year-old woman died in hospital after she was stabbed during a bag search at the start of the school day outside a middle school in Nogent, in the Haute-Marne department in north-east France.</p> <a...",
      "<p>Mayor of Graz says presumed gunman among the dead as local media report as many as 30 people injured</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/jun/10/russia-strikes-drown-peace-efforts-zelenskyy-ukraine-europe-latest-news-updates\">Austria school shooting – latest updates</a></p></li></ul><p>At least 10 people have been killed and several more seriously injured in a shooting at a secondary school in the southern Austrian city of Graz, authorities have said.</p><p>The mayor of Graz, Elke Kahr, said the presumed shooter, several students and another adult, thought to...",
      "<p>Interior minister says there were six female and three male victims of the shooting and suspect is dead</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/jun/10/students-killed-in-school-shooting-in-austria-graz\">10 people killed in school shooting in Austria</a></p></li></ul><p>The Austrian interior ministry has confirmed <strong>that several people have been killed in the attack on the school in Graz </strong>in the south of the country, without specifing the exact number, AP reported.</p><p>Austria’s <strong>Kronen Zeitung </strong>noted that the incident took place close to...",
      "Suspected shooter reported to have died by suicide as country mourns after one of its worst mass shootings.",
      "Several people have been killed in a suspected shooting at a school in the Austrian city of Graz.",
      "Police in Graz say several others were wounded in the attack."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/4e24/live/568ac280-45ef-11f0-b439-cf6fd1574621.jpg",
    "titles": [
      "Ten dead in Austria school shooting",
      "Austria School Shooting: What to Know",
      "At Least 9 Dead After Austria School Shooting, Police Say",
      "Austria’s deadliest mass shooting: Who are the Graz victims, shooter?",
      "Nine killed in Austrian school shooting, police say",
      "Teaching assistant killed in stabbing outside France school",
      "Teaching assistant fatally stabbed by pupil at school in north-east France",
      "At least 10 people killed in Austria school shooting",
      "10 people dead and 12 injured in school shooting in city of Graz in Austria – Europe live",
      "Gunman kills nine people in school shooting in Austria’s Graz",
      "Several people killed in school shooting in Austria",
      "Ten dead, including suspect, in Austria school shooting"
    ],
    "summary": "A mass shooting at a high school in Graz, Austria, resulted in at least 10 fatalities, making it the country's deadliest mass shooting. The gunman, a former pupil, is among the deceased, having died by apparent suicide. The incident left several others seriously injured. The victims' names and ages have not been released. This event marks one of the worst school shootings in Europe in recent years. The Austrian Interior Minister confirmed the deaths of six females and three males, without specifying if these numbers were included in the total death toll. The city of Graz and the nation are in ",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story reports on a tragic event but does not provide any actionable insights or deeper understanding for the reader. It does not report on any solutions, improvements, or attempts to solve the problem, nor does it increase clarity around systems, causes, trends, or impacts.",
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.987,
      "consensus": 0.988,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.804
  },
  {
    "title": "Violence Erupts in Ballymena, NI; 15 Officers Injured, Homes Attacked",
    "domain": "general",
    "location": "global",
    "published": "Tue, 10 Jun 2025 14:39:42 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "<p>Northern Irish politicians condemn violence that erupted after vigil for girl who was allegedly sexually assaulted</p><p>Fifteen police officers were injured and several homes attacked during what has been called a “mob fury” of racially motivated disturbances in the Northern Irish town of Ballymena.</p><p>Members of a crowd threw petrol bombs, fireworks, heavy masonry and bricks at police and tried to burn the homes of a handful of foreign families in the County Antrim town on Monday night.</p> <a..."
    ],
    "image_url": "https://i.guim.co.uk/img/media/694b653fdb77fdb4bdf3b69403fdc3afdd8364fc/0_0_3781_3024/master/3781.jpg?width=140&quality=85&auto=format&fit=max&s=fb6dd58b61afbca14a2267664c232693",
    "titles": [
      "Fifteen police injured amid suspected racially motivated attacks in Ballymena"
    ],
    "summary": "In Ballymena, Northern Ireland, violence broke out following a vigil for a girl allegedly sexually assaulted, resulting in 15 police officers injured and attacks on several homes. The disturbances, described as racially motivated \"mob fury,\" saw assailants using petrol bombs, fireworks, and masonry against police and attempting to set fire to homes of foreign families. Northern Irish politicians have condemned the violence.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "While this story raises awareness about a violent event, it does not provide any actionable insights or deeper understanding for the reader. It does not report on any solutions, improvements, or attempts to solve the problem, nor does it increase clarity around systems, causes, trends, or impacts.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.986,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.389
  },
  {
    "title": "Vikings' 2011 Draft Decision Still Disappoints; Trades Down for 2026 Draft",
    "domain": "sports",
    "location": "national",
    "published": "Tue, 10 Jun 2025 15:01:48 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "The 2011 NFL Draft will be remebered as one of the best in recent memory, but for Vikings fans it remains a sour note in their minds.",
      "The Minnesota Vikings swing a trade within the division to move down in a very early 2026 NFL mock draft."
    ],
    "image_url": "",
    "titles": [
      "Minnesota Vikings land different QB in 2011 NFL re-draft from PFF",
      "Minnesota Vikings make unique trade in Way-Too-Early 2026 NFL Mock Draft"
    ],
    "summary": "In the 2011 NFL Draft, widely regarded as one of the best in recent history, the Minnesota Vikings made a decision that continues to disappoint their fans. Recently, the Vikings executed an intra-division trade to move down in an early projection for the 2026 NFL Draft.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides some context and insight into the decision-making process of a professional sports team. It does not report on any solutions or improvements, but it does provide a deeper understanding of the topic for readers interested in sports management and strategy.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.994,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.421
  },
  {
    "title": "Tyler Badie Fit to Play for Broncos; Miles Sanders Eyes Cowboys' Starting Role",
    "domain": "sports",
    "location": "national",
    "published": "Tue, 10 Jun 2025 15:00:26 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Tyler Badie is back and healthy. What kind of role will he have with the Broncos this season?",
      "Dallas Cowboys running back Miles Sanders is the co-clubhouse leader for the starting role, but could he solidify his standing at minicamp."
    ],
    "image_url": "",
    "titles": [
      "Forgotten Broncos running back could be a sleeper for key role in 2025",
      "Will Cowboys' Starting Running Back Role Be Settled At Minicamp?"
    ],
    "summary": "Tyler Badie has returned to health and is set to play for the Broncos, though his specific role for the season remains undefined. Meanwhile, Miles Sanders, a running back for the Dallas Cowboys, is currently a leading candidate for the starting position, with the potential to secure his spot during minicamp.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information for sports fans and fantasy football players who need to know about player health and potential roles. However, it doesn't offer any insights into broader trends, systems, or impacts, and doesn't report on any solutions or innovations.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.993,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.42
  },
  {
    "title": "Scotland's Coach Clarke Disappointed After Friendlies Ahead of World Qualifiers",
    "domain": "sports",
    "location": "global",
    "published": "Tue, 10 Jun 2025 15:00:00 BST",
    "source": "Sky Sports",
    "sources": [
      "Sky Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Scotland salvaged something from the friendlies this month, but even Steve Clarke saw it as a \"disappointing camp\" with questions unanswered ahead the World Cup qualifiers."
    ],
    "image_url": "https://e0.365dm.com/25/05/1920x1080/skysports-clarke-steve-scotland_6921116.jpg?20250518224826",
    "titles": [
      "Where do Scotland stand ahead of first World Cup qualifiers?"
    ],
    "summary": "Scotland's performance in the recent friendlies was considered disappointing by coach Steve Clarke, leaving unresolved questions ahead of the World Cup qualifiers. Despite salvaging some positive outcomes, the camp did not meet expectations.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story offers basic awareness about the state of Scotland's football team, but lacks depth or insight. It doesn't provide any actionable insights for readers, nor does it report on any solutions or improvements.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.993,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.41
  },
  {
    "title": "Aumua Family Finalizes Key Agreement During Official Weekend Visit",
    "domain": "sports",
    "location": "national",
    "published": "Tue, 10 Jun 2025 14:57:30 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "The weekend official visit sealed the deal for the Aumua family."
    ],
    "image_url": "",
    "titles": [
      "New Florida commit Kekua Aumua 'loved everything' about latest visit"
    ],
    "summary": "During an official visit over the weekend, the Aumua family made a significant decision, finalizing an agreement or commitment. The details of the deal or the nature of the commitment were not specified, but the visit was pivotal in reaching this conclusion.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides very minimal information and lacks depth or insight. It doesn't provide any actionable insights for readers, nor does it report on any solutions or improvements. It also doesn't increase clarity around any systems, causes, trends, or impacts.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.992,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.39
  },
  {
    "title": "Kevin Durant Denies Crying in Event, Clarifies Misconceptions",
    "domain": "sports",
    "location": "national",
    "published": "Tue, 10 Jun 2025 14:55:43 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Kevin Durant has something to say about that crying story."
    ],
    "image_url": "",
    "titles": [
      "Kevin Durant Addresses Infamous 'Crying' Rumor"
    ],
    "summary": "NBA star Kevin Durant addressed a story that claimed he cried during a specific event. Durant publicly refuted the story, providing his version of events to clarify the situation. His response aimed to correct any misconceptions and set the record straight regarding his emotional response during the incident mentioned.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness about the event and Kevin Durant's response to it. However, it lacks depth and insight, and doesn't provide any actionable insights for the reader.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.992,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.41
  },
  {
    "title": "Sean Avery Suggests Overhaul of Maple Leafs' Team DNA to Boost Performance",
    "domain": "sports",
    "location": "national",
    "published": "Tue, 10 Jun 2025 14:55:00 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Sean Avery says the Maple Leafs must change the team’s DNA even if that means they overpay."
    ],
    "image_url": "",
    "titles": [
      "Maple Leafs Should Overpay for Mitch Marner Replacement, Claims Analyst"
    ],
    "summary": "Former NHL player Sean Avery has suggested that the Toronto Maple Leafs need to overhaul their team's DNA to improve performance, even if it requires them to overpay for changes.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the Toronto Maple Leafs' performance, and Sean Avery's suggestions for improvement. However, it doesn't report on any actual attempts to solve the problem, or provide any solutions.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.992,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.42
  },
  {
    "title": "Arkansas Favored for 2025 College World Series, Post-Murray State Upset",
    "domain": "sports",
    "location": "national",
    "published": "Tue, 10 Jun 2025 14:54:03 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Arkansas is the favorite to win the 2025 College World Series per BetSaracen. (Photo by Braeden Botts)    With 4-seed Murray State's upset of Duke in the Durham Super Regional Monday night, the eight-team College World Series in Omaha, Neb.",
      "Which 8 teams will make the 2026 Women's College World Series? Here's a way-too-early prediction for next year's field."
    ],
    "image_url": "",
    "titles": [
      "Latest BetSaracen College World Series Odds",
      "2026 Women's College World Series way too early predictions"
    ],
    "summary": "Arkansas is favored to win the 2025 College World Series, according to BetSaracen. This follows 4-seed Murray State's surprising victory over Duke in the Durham Super Regional, leading up to the eight-team College World Series in Omaha, Nebraska. Additionally, there are early predictions for the eight teams expected to make it to the 2026 Women's College World Series, though specific teams were not mentioned in the provided content.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about the College World Series and the teams involved. However, it lacks depth, doesn't provide any actionable insights for the reader, and doesn't report on any solutions or improvements.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.991,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.39
  },
  {
    "title": "Boulter Defeats Tomljanovic Despite 9 Double Faults, Advances at Queen's",
    "domain": "sports",
    "location": "national",
    "published": "Tue, 10 Jun 2025 14:52:46 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Katie Boulter served nine double faults but still had enough to beat Ajla Tomljanovic 7-6, 1-6, 6-4 to reach the second round at Queen’s."
    ],
    "image_url": "",
    "titles": [
      "Katie Boulter overcomes serving woes to battle into Queen’s second round"
    ],
    "summary": "Katie Boulter overcame nine double faults to defeat Ajla Tomljanovic with scores of 7-6, 1-6, 6-4, advancing to the second round at Queen's.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness of a sports event but does not offer any deeper insights or actionable information for the reader. It does not report on solutions, improvements, or innovations, nor does it increase clarity around systems, causes, trends, or impacts.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.991,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.39
  },
  {
    "title": "Novo Nordisk's U.S. Shares Fall Nearly 8% Since Year Start",
    "domain": "business",
    "location": "global",
    "published": "Tue, 10 Jun 2025 15:10:22 GMT",
    "source": "Investopedia",
    "sources": [
      "Investopedia"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "<figure><img alt=\"Kristian Tuxen Ladegaard Berg / SOPA Images / LightRocket / Getty Images Novo Nordisk's U.S.-listed shares are down nearly 8% since the start of the year.\" src=\"https://www.investopedia.com/thmb/5GqF65wc0J9U1e9qnST_Tcwv60A=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2206633954-a2b2ddb5aff940ceb5f5609129f73289.jpg\" title=\"Three white flags with the blue Novo Nordisk logo are seen on flagpoles in front of a cloudy sky.\" /><figcaption><i><p>Kristian Tuxen Ladegaard Berg / SOPA Images / LightRocket / Getty Images</p> Novo Nordisk's U.S.-listed..."
    ],
    "image_url": "https://www.investopedia.com/thmb/5GqF65wc0J9U1e9qnST_Tcwv60A=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2206633954-a2b2ddb5aff940ceb5f5609129f73289.jpg",
    "titles": [
      "Novo Nordisk Stock Climbs on Report of Activist Investor Parvus Building Stake"
    ],
    "summary": "Novo Nordisk's U.S.-listed shares have experienced a nearly 8% decline since the beginning of the year. This information is highlighted alongside an image showing the company's flags, indicating a downturn in their stock market performance.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs about a significant trend in the stock market performance of a major company, which could be useful for investors or those interested in the pharmaceutical industry. However, it does not offer any solutions or insights into the causes of this decline, limiting its constructiveness.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.997,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.421
  },
  {
    "title": "Meta Launches AI Lab for Superintelligence Development",
    "domain": "business",
    "location": "national",
    "published": "Tue, 10 Jun 2025 15:06:58 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Investopedia"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Meta is forming a new artificial intelligence research lab dedicated to \"superintelligence,\" according to a report.",
      "<figure><img alt=\"Chris Unger / Zuffa LLC / Getty Images Meta CEO Mark Zuckerberg reportedly is building a team of AI researchers and engineers referred to internally as a “superintelligence group.”\" src=\"https://www.investopedia.com/thmb/LmGxjSCuh-w3nYRLlg5jgdPtejA=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2204057803-2da21bf5f2d94daf941251a7fd1eee76.jpg\" title=\"Meta Platforms CEO Mark Zuckerberg.\" /><figcaption><i><p>Chris Unger / Zuffa LLC / Getty Images</p> Meta CEO Mark Zuckerberg reportedly is building a team of AI researchers and engineers referred to..."
    ],
    "image_url": "",
    "titles": [
      "Meta forming new AI lab helmed by Scale AI CEO Alex Wang, report says",
      "Zuckerberg Assembling 'Superintelligence' AI Team at Meta, Report Says"
    ],
    "summary": "Meta is launching a new artificial intelligence research lab focused on developing \"superintelligence.\" CEO Mark Zuckerberg is assembling a dedicated team of AI researchers and engineers for this initiative, aiming to advance AI technology. This move underscores Meta's commitment to leading in the AI domain.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story clearly highlights progress in the field of artificial intelligence, reporting on a new initiative by a major tech company. It provides useful information about the company's strategic direction and could empower readers interested in AI technology. However, it could have been more constructive if it had included more details about the potential impacts or benefits of this development.",
    "score_components": {
      "magnitude": 0.62,
      "recency": 0.996,
      "consensus": 0.632,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.714
  },
  {
    "title": "Boeing Records Highest Gross Orders Since December 2023 with 303 Aircraft",
    "domain": "business",
    "location": "national",
    "published": "Tue, 10 Jun 2025 15:00:01 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Boeing booked 303 gross orders in May, the most since December 2023."
    ],
    "image_url": "",
    "titles": [
      "Boeing airplane orders rise to highest level since late 2023 ahead of Paris Air Show"
    ],
    "summary": "In May, Boeing achieved its highest number of gross orders since December 2023, with a total of 303 orders placed for its aircraft. This marks a significant milestone for the company, indicating a robust demand for its airplanes.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about Boeing's recent success, contributing to a deeper understanding of the company's current situation. However, it lacks details on the implications of this milestone, the strategies behind the success, or the broader trends in the aviation industry.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.993,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.427
  },
  {
    "title": "Glean Raises $150M, Valuation Surges to $7B in AI Funding Round",
    "domain": "business",
    "location": "national",
    "published": "Tue, 10 Jun 2025 15:00:01 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Glean, a generative AI enterprise search startup, raised $150 million from investors in a deal that increased its valuation to over $7 billion."
    ],
    "image_url": "",
    "titles": [
      "Glean, gen AI enterprise search startup, raises $150 million in deal adding billions to valuation"
    ],
    "summary": "Glean, a startup specializing in generative AI for enterprise search, successfully raised $150 million from investors. This funding round significantly increased the company's valuation to over $7 billion.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "While the story offers basic awareness about Glean's recent funding round and its impact on the company's valuation, it lacks depth or insight into what Glean plans to do with the funding, how this fits into larger trends in AI funding, or what this means for the AI industry overall.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.993,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.417
  },
  {
    "title": "Couples Therapist Advises 'Relationship Bank Account' Deposits for Stronger Bond",
    "domain": "business",
    "location": "national",
    "published": "Tue, 10 Jun 2025 14:44:01 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Phil Stark, a therapist who works with couples, encourages partners to 'make deposits' into their 'relationship bank account.' Here's how to do it."
    ],
    "image_url": "",
    "titles": [
      "Couples who follow one simple rule tend to fight less and be happier in the long run, says relationship expert"
    ],
    "summary": "Phil Stark, a couples therapist, advocates for partners to strengthen their relationship by making metaphorical 'deposits' into a 'relationship bank account.' This concept involves partners contributing positive actions and support to build a stronger bond.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive. It provides actionable insights for readers on how to strengthen their relationships, offers a solution to common relationship problems, and empowers readers with knowledge about relationship dynamics.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.988,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.45
  },
  {
    "title": "EU Announces 18th Sanctions Package Against Russia, Targets Shadow Fleet",
    "domain": "business",
    "location": "global",
    "published": "Tue, 10 Jun 2025 14:33:44 GMT",
    "source": "Financial Times",
    "sources": [
      "The Guardian",
      "Financial Times",
      "New York Times"
    ],
    "domains": [
      "business",
      "general"
    ],
    "snippets": [
      "European Commission presented 18th series of measures against Moscow on Tuesday",
      "Ursula von der Leyen, president of the European Commission, announced a proposal meant to ramp up pressure on Moscow.",
      "<p>Other measures to include tightening restrictions on ‘shadow fleet’, banks and Nord Stream investment</p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/jun/10/us-china-trade-talks-resume-uk-jobs-market-weakening-payrolls-tumble-growth-economy-business-live-news\">Business live – latest updates</a></p></li></ul><p>The EU executive is to propose lowering the price cap on Russian oil as it seeks to tighten energy and financial sanctions targeting the Kremlin’s ability to wage war.</p><p>The president of the European Commission, Ursula von der Leyen, is expected to put..."
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F8a60c140-a4be-439c-b730-cfad97d17ec5.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "EU to target Nord Stream and Russian oil cap in new sanctions",
      "European Union Unveils Fresh Sanctions on Russia, Including a Nord Stream Ban",
      "EU to propose lowering price cap on Russian oil in new sanctions package"
    ],
    "summary": "The European Commission, led by President Ursula von der Leyen, announced its 18th series of measures against Moscow, aiming to increase pressure on Russia. These measures include tightening restrictions on a 'shadow fleet', banks, and investments in Nord Stream, as well as proposing a lower price cap on Russian oil. The initiatives are part of the EU's effort to enhance energy and financial sanctions to undermine the Kremlin's war capabilities.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it provides useful information about the European Union's strategies to increase pressure on Russia. It offers insight into the measures being taken, including tightening restrictions on various entities, which could influence readers' understanding of the geopolitical situation. However, it doesn't explicitly highlight progress or solutions.",
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.984,
      "consensus": 0.897,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.803
  },
  {
    "title": "ChatGPT Experiences Outage, Over 2,000 Reports Logged",
    "domain": "business",
    "location": "national",
    "published": "Tue, 10 Jun 2025 14:29:15 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Business Insider",
      "Investopedia"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Artificial intelligence chatbot ChatGPT was down Tuesday for some users, with more than 2,000 outage reports on Downdetector.",
      "<figure><img alt=\"Silas Stein / picture alliance via Getty Images OpenAI said it is investigating the ChatGPT outage.\" src=\"https://www.investopedia.com/thmb/JPm_XJPBwegeCrh6FA1o7vSp60g=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2218358100-bcdb82e9683c4176afa8cddb2b7eb8b9.jpg\" title=\"ChatGPT logo.\" /><figcaption><i><p>Silas Stein / picture alliance via Getty Images</p> OpenAI said it is investigating the ChatGPT outage.</i></figcaption></figure><br /><h3>KEY TAKEAWAYS</h3><ul><li>ChatGPT is down, the large language model’s developer OpenAI confirmed Tuesday...",
      "OpenAI confirmed that ChatGPT was experiencing issues on Tuesday and the company was \"working on implementing a mitigation.\""
    ],
    "image_url": "",
    "titles": [
      "ChatGPT is down for some users with OpenAI reporting 'elevated error rates'",
      "ChatGPT, Sora Are Down, OpenAI Confirms",
      "ChatGPT not working for you? OpenAI says it's experiencing a 'partial outage'"
    ],
    "summary": "ChatGPT, an artificial intelligence chatbot developed by OpenAI, was reported down for some users on Tuesday, with over 2,000 outage reports logged on Downdetector. OpenAI has acknowledged the issue and is currently investigating the cause of the outage, with efforts underway to implement a solution.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs readers about a significant outage affecting a popular AI chatbot, which is useful for users of the service. It also mentions that OpenAI is investigating and working on a solution, showing an attempt to solve the problem. However, it doesn't provide deeper insights into the cause or potential impacts of the outage.",
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.983,
      "consensus": 0.847,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.763
  },
  {
    "title": "United Natural Foods Shares Drop After Cyberattack Disclosure",
    "domain": "business",
    "location": "global",
    "published": "Tue, 10 Jun 2025 14:28:35 GMT",
    "source": "Investopedia",
    "sources": [
      "Investopedia"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "<figure><img alt=\"ANGELA WEISS / AFP via Getty Images United Natural Foods shares fell for a second straight session following the firm's disclosure of a cyberattack.\" src=\"https://www.investopedia.com/thmb/hWyyzgzeAwnmIDDEQ3tG_aJBQOA=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2217065734-75179bb920714e11b5d877bd2aaf125e.jpg\" title=\"Traders work on the floor of the New York Stock Exchange\" /><figcaption><i><p>ANGELA WEISS / AFP via Getty Images</p> United Natural Foods shares fell for a second straight session following the firm's disclosure of a..."
    ],
    "image_url": "https://www.investopedia.com/thmb/hWyyzgzeAwnmIDDEQ3tG_aJBQOA=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2217065734-75179bb920714e11b5d877bd2aaf125e.jpg",
    "titles": [
      "Cyberattack Disclosure Continues to Rattle United Natural Foods Stock"
    ],
    "summary": "United Natural Foods experienced a decline in their shares for two consecutive sessions after the company disclosed a cyberattack. This incident has impacted investor confidence, leading to a noticeable drop in the firm's stock value.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story raises awareness about the impact of a cyberattack on a company's stock value, which could be useful for investors. However, it doesn't provide much depth or insight into the incident itself, the response from the company, or broader trends in cybersecurity. It also doesn't report on any solutions or improvements.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.983,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.408
  },
  {
    "title": "New Method Identifies Species from Fossil Fragments, Sheds Light on Extinctions",
    "domain": "science",
    "location": "global",
    "published": "Tue, 10 Jun 2025 13:26:39 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/ancient-collagen-could-unravel-mystery-of-wombat-the-size-of-a-hippo/\" rel=\"nofollow\" title=\"Ancient Collagen Could Unravel Mystery of “Wombat the Size of a Hippo”\"><img alt=\"Zygomaturus trilobus\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"643\" src=\"https://scitechdaily.com/images/Zygomaturus-trilobus-777x643.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>Scientists have discovered new markers that enable the identification of species from fossilized bone fragments, offering new insights into the extinction of..."
    ],
    "image_url": "",
    "titles": [
      "Ancient Collagen Could Unravel Mystery of “Wombat the Size of a Hippo”"
    ],
    "summary": "Scientists have developed a method to identify species from fossilized bone fragments, revealing new insights into the extinction of ancient animals, including a wombat-like creature the size of a hippo. This breakthrough in studying ancient collagen could help unravel mysteries surrounding the disappearance of these prehistoric species.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive as it provides useful knowledge about a new method developed by scientists to identify species from fossil fragments. It also reports on the progress made in understanding the extinction of ancient animals, thereby contributing to the reader's understanding and increasing awareness about prehistoric species and their disappearance.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.962,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.444
  },
  {
    "title": "New Crustacean Species Found in Bermuda Cave; Fungi's Climate Role Stressed",
    "domain": "science",
    "location": "global",
    "published": "Tue, 10 Jun 2025 13:01:30 +0000",
    "source": "SciTechDaily",
    "sources": [
      "Phys.org",
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/scientists-discover-mysterious-new-species-of-crustacean-in-underground-cave/\" rel=\"nofollow\" title=\"Scientists Discover Mysterious New Species of Crustacean in Underground Cave\"><img alt=\"Illuminated Underwater Passage\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Illuminated-Underwater-Passage-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>Bermudensis, a newly discovered copepod, reveals Bermuda’s hidden cave biodiversity and the need for stronger habitat protection....",
      "Mycorrhizal fungi help regulate the Earth's climate and ecosystems by forming underground networks that provide plants with essential nutrients, while drawing carbon deep into soils. Scientists and conservationists have been racing to find ways to protect these underground fungi, but they keep finding dark taxa—species that are known only by their DNA sequences that can't be linked to named or described species."
    ],
    "image_url": "",
    "titles": [
      "Scientists Discover Mysterious New Species of Crustacean in Underground Cave",
      "Mysterious fungi: Researchers pinpoint hotspots of 'dark taxa' across Earth's underground ecosystems"
    ],
    "summary": "Scientists have discovered a new species of crustacean, named Bermudensis, in an underground cave in Bermuda, highlighting the island's rich cave biodiversity and the urgency for enhanced habitat protection. Additionally, the role of mycorrhizal fungi in regulating Earth's climate and ecosystems has been emphasized, with efforts underway to protect these fungi. These discoveries underscore the importance of underground biodiversity and the ongoing challenge of identifying and conserving unknown species, known as dark taxa, which are identified solely by their DNA sequences.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it provides actionable insights into the importance of habitat protection and biodiversity. It also highlights the progress made in the discovery of a new crustacean species and the role of fungi in climate regulation. The story increases awareness about the importance of conserving unknown species and the role of biodiversity in the ecosystem.",
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.953,
      "consensus": 0.632,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.699
  },
  {
    "title": "Archaeologist Suggests Vikings Used Stories, Islands for Offshore Navigation",
    "domain": "science",
    "location": "global",
    "published": "Tue, 10 Jun 2025 12:36:55 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/this-archaeologist-sailed-like-a-viking-for-3-years-and-made-an-unexpected-discovery/\" rel=\"nofollow\" title=\"This Archaeologist Sailed Like a Viking for 3 Years and Made an Unexpected Discovery\"><img alt=\"Viking Style Boat Sails Across Open Sea\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"437\" src=\"https://scitechdaily.com/images/Viking-Style-Boat-Sails-Across-Open-Sea-777x437.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>Vikings likely sailed farther offshore, navigating by stories and island harbors. Jarrett’s..."
    ],
    "image_url": "",
    "titles": [
      "This Archaeologist Sailed Like a Viking for 3 Years and Made an Unexpected Discovery"
    ],
    "summary": "An archaeologist, after sailing in Viking-style for three years, discovered that Vikings likely navigated far offshore using stories and island harbors for guidance. This finding challenges previous beliefs about Viking navigation techniques.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it provides a deeper understanding of Viking navigation techniques, challenging previous beliefs. However, it doesn't clearly highlight a solution or improvement, but it does present a new perspective on historical navigation methods, which can be useful for readers interested in history, archaeology, or navigation.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.945,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.431
  },
  {
    "title": "IBM Plans \"Practical\" Quantum Computer by Decade's End",
    "domain": "science",
    "location": "global",
    "published": "Tue, 10 Jun 2025 12:00:10 +0100",
    "source": "New Scientist",
    "sources": [
      "New Scientist",
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "The company has unveiled new innovations in quantum hardware and software that researchers hope will make quantum computing both error-proof and useful before the end of the decade",
      "Technology veteran IBM on Tuesday laid out a plan to have a \"practical\" quantum computer tackling big problems before the end of this decade."
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/06/06210151/SEI_254541335.jpg",
    "titles": [
      "IBM says it will build a practical quantum supercomputer by 2029",
      "IBM claims 'real world' edge in quantum computing race"
    ],
    "summary": "IBM announced on Tuesday their plan to develop a \"practical\" quantum computer capable of solving significant problems by the end of this decade. The company revealed new advancements in quantum hardware and software aimed at making quantum computing error-proof and practical for use in the near future.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This news story is constructive as it reports on technological progress and innovation in the field of quantum computing. It provides useful information about IBM's plans and their advancements in quantum hardware and software, contributing to the reader's understanding of the current state and future of quantum computing.",
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.914,
      "consensus": 0.632,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.691
  },
  {
    "title": "Scientists Edit Oat DNA to Boost Fiber, Yield, and Climate Resilience",
    "domain": "science",
    "location": "global",
    "published": "Tue, 10 Jun 2025 11:02:04 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "For the first time, scientists have successfully edited oat DNA, a breakthrough that could accelerate the development of oats with more fiber, higher yields, and greater resilience to climate change."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/oat-dna-edited-boostin.jpg",
    "titles": [
      "Scientists successfully edit oat DNA using for first time, enabling climate-resilient crops"
    ],
    "summary": "Scientists have achieved a milestone by successfully editing oat DNA for the first time. This advancement opens the door to developing oats that are higher in fiber, yield more, and are more resilient to climate change. This breakthrough could significantly benefit agricultural practices and food production by enhancing the nutritional value and sustainability of oats.",
    "constructiveness_score": 1.0,
    "constructiveness_reason": "This story is highly constructive. It not only offers awareness about a scientific breakthrough but also highlights its potential benefits in terms of improving nutritional value, yield, and climate resilience of oats. This could have significant implications for agricultural practices and food production, providing actionable insights for stakeholders in these fields.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.994,
      "consensus": 0.393,
      "constructiveness": 1.0,
      "proximity": 0.5
    },
    "score": 0.461
  },
  {
    "title": "James Webb Telescope Images Young Exoplanets, Unveils Silicate Clouds, Moon Form",
    "domain": "science",
    "location": "global",
    "published": "Tue, 10 Jun 2025 11:00:01 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Astrophysicists have gained precious new insights into how distant exoplanets form and what their atmospheres can look like, after using the James Webb Telescope to image two young exoplanets in extraordinary detail. Among the headline findings were the presence of silicate clouds in one of the planet's atmospheres, and a circumplanetary disk thought to feed material that can form moons around the other."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2021/exoplanet.jpg",
    "titles": [
      "Silicate clouds discovered in atmosphere of distant exoplanet"
    ],
    "summary": "Astrophysicists have used the James Webb Telescope to image two young exoplanets in detail, revealing silicate clouds in one's atmosphere and a circumplanetary disk around the other, which may help form moons. These findings offer new insights into exoplanet formation and atmospheric composition.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it provides useful information about the findings from the James Webb Telescope, increasing the reader's understanding of exoplanet formation and atmospheric composition. However, it does not explicitly mention any solutions or improvements that these findings might lead to, hence the slightly lower score.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.993,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.441
  },
  {
    "title": "Human Development: From Two Cells to Organism in Under a Year",
    "domain": "science",
    "location": "global",
    "published": "Tue, 10 Jun 2025 11:00:01 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Human development is a beautiful, complex process. Beginning from just two germ cells, the cells divide and double until an entire organism is developed in just under a year."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/this-claw-machine-can.jpg",
    "titles": [
      "'Claw machine' approach can sort a large number of embryo models quickly and effectively"
    ],
    "summary": "Human development begins with two germ cells and involves a complex process of cell division and doubling. This process results in the development of an entire organism in less than a year.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful insights into the process of human development, which can contribute to readers' understanding of biology and human life. However, it doesn't report on progress, solutions, or attempts to solve problems, nor does it increase awareness around systems or impacts that matter.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.993,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.441
  },
  {
    "title": "ISSCR Updates Guidelines for Stem Cell-Based Embryo Models Research",
    "domain": "science",
    "location": "global",
    "published": "Tue, 10 Jun 2025 11:00:01 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "The International Society for Stem Cell Research (ISSCR) Embryo Models Working Group has released updated recommendations for the oversight and regulation of stem cell-based embryo models (SCBEM), aiming to address rapid advancements and ensure responsible scientific progress."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2024/ivf-1.jpg",
    "titles": [
      "Working group recommends enhanced oversight of stem cell-based embryo models"
    ],
    "summary": "The International Society for Stem Cell Research (ISSCR) Embryo Models Working Group has issued new guidelines for the regulation and oversight of stem cell-based embryo models (SCBEM). These updates aim to keep pace with fast advancements in the field and promote responsible scientific development. The recommendations focus on ensuring ethical practices and responsible research as the technology progresses.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story clearly highlights progress in the field of stem cell research, reporting on the new guidelines issued by the ISSCR. It provides readers with actionable insights into the ethical practices and responsible research in this field. It also increases awareness about the systems and impacts of these advancements.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.993,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.451
  }
]