[
  {
    "title": "Trump Announces 90-Day Pause on New Tariffs, Sets August Deadline",
    "domain": "general",
    "location": "global",
    "published": "2025-07-06T22:19:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Financial Times",
      "Deutsche Welle",
      "Axios",
      "Fortune"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "EU and US negotiators met over the weekend to secure trade deals that would help Europe avoid Trump's tariffs.",
      "<a href=\"https://news.google.com/rss/articles/CBMickFVX3lxTE9HUUU1clhlTGkwYi1pd0UwSnI1eUx4bGM3MGc3a21SN0pic1FNUGswYWZNUFdESDlfU0czY0VpWE5tb2NaZHkwZjlpR3RDSnl0MnEzM1VYZFIwb3lVNi1FZkVyTE14UUVZZWgtNXU2TjNFQQ?oc=5\" target=\"_blank\">Tariffs return to April rates on August 1 without deals, Bessent says</a>",
      "Treasury secretary’s warning comes as 90-day pause on steep levies is set to expire on Wednesday",
      "\"We are saying, this is when it's happening. If you want to speed things up, have at it. If you want to go back to the old rate, that's your choice.\""
    ],
    "image_url": "",
    "titles": [
      "US demands trade deals or threatens tariffs by August 1",
      "Tariffs return to April rates on August 1 without deals, Bessent says - Axios",
      "US threatens tariffs ‘boomerang’ next month if no deals are struck",
      "U.S. tariffs will return to ‘Liberation Day’ levels on Aug. 1, if no trade deals are reached by then, Bessent says"
    ],
    "score_components": {
      "magnitude": 0.84,
      "recency": 0.963,
      "consensus": 0.985,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.863,
    "summary": "President Donald Trump announced a 90-day pause on newly unveiled tariffs against major trading partners in April. Without reaching deals by August 1, tariffs will revert to their April rates, according to Bessent. This move is positioned as an incentive for trading partners to expedite negotiations or choose to return to the previous tariff rates.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The story provides useful information about the tariff pause and its implications. It also provides insight into the negotiation dynamics between the US and its trading partners, contributing to a deeper understanding of the topic."
  },
  {
    "title": "Nationals Fire Manager Dave Martinez, GM Mike Rizzo After Latest Loss",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 6 Jul 2025 19:42:19 EST",
    "source": "ESPN",
    "sources": [
      "Sports Illustrated",
      "Yahoo Sports",
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Headed into an off day and stuck in last place in the NL East, the Washington Nationals fired manager Davey Martinez and general manager Mike Rizzo on Sunday night, hours after a 6-4 loss at home completed a sweep by the Boston Red Sox.",
      "The Washington Nationals announced Sunday they have fired manager Dave Martinez and general manager Mike Rizzo after suffering their fourth Major League Baseball loss in five games.Shortly after the Nats dropped a 6-4 decision at home to Boston, team owner Mark D. Lerner announced Rizzo, the preside",
      "<a href=\"https://news.google.com/rss/articles/CBMimwFBVV95cUxOVHRNRWlQdEdzeWQwVHhqT3ZEUmJNNjlRRXhueWtzVjEwTU1QdGxCSFBFTm1LNThiSlVKMkFaVF9hWHkwU2ExdkVQQWFQVHV3c2FvQmVkck95ZUhGTDdILVgwZURLMjJrcldhZkxtNWVTSWltTXpqR1p0R3oyMEllTVVNZDFTWnRoM0J0THQ2Z041dmUwdkg2MHR3NA?oc=5\" target=\"_blank\">Nationals Fire Ma",
      "<p>The Washington Nationals are shaking up their leadership group amid another trying season for the ballclub. </p>"
    ],
    "image_url": "",
    "titles": [
      "Nats seek 'fresh approach,' fire Martinez, Rizzo",
      "MLB Nationals fire manager Martinez, GM Rizzo after loss",
      "Nationals Fire Manager Dave Martinez, GM Mike Rizzo in Abrupt House-Cleaning - Sports Illustrated",
      "Nationals fire general manager Mike Rizzo, manager Dave Martinez"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.991,
      "consensus": 0.935,
      "constructiveness": 0.6,
      "proximity": 0.75
    },
    "score": 0.847,
    "summary": "The Washington Nationals have dismissed manager Dave Martinez and general manager Mike Rizzo following a 6-4 loss to the Boston Red Sox, marking their fourth loss in five games. This decision comes as the team languishes in last place in the NL East. The announcement was made by team owner Mark D. Lerner shortly after the defeat, signaling a significant leadership shake-up during an ongoing challenging season for the Nationals.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs readers about the major changes in the Washington Nationals' leadership following a series of losses. It provides useful insights into the team's current situation and the potential implications of these changes. However, it lacks depth in discussing the causes behind the team's performance or potential solutions for improvement."
  },
  {
    "title": "Lac-Mégantic Marks 12th Anniversary of Rail Disaster, Calls for Safety Reforms",
    "domain": "general",
    "location": "national",
    "published": "Sun, 06 Jul 2025 21:09:34 +0000",
    "source": "Global News",
    "sources": [
      "CityNews",
      "Financial Post",
      "Global News"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "On Sunday, the town lowered flags to half-mast, laid flowers and organized a moment of silence to commemorate the July 6, 2013, tragedy.",
      "MONTREAL &#8212; As citizens of Lac-Megantic, Que., marked the 12th anniversary of a rail disaster that killed 47 people when a runaway train derailed and smashed into downtown, an advocate warned that more needs to be done to ensure rail safety. On Sunday, the town lowered flags to half-mast, laid ",
      "MONTREAL — As citizens of Lac-Mégantic, Que., marked the 12th anniversary of a rail disaster that killed 47 people when a runaway train derailed and smashed into downtown, an advocate warned that more needs to be done to ensure rail safety. On Sunday, the town lowered flags to half-mast, laid flower"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/07/lac-megantic.jpg?quality=85&strip=all",
    "titles": [
      "Lac-Mégantic marks 12th anniversary as calls for improved rail safety mount",
      "Advocate calls for better rail safety on 12th anniversary of Lac-Megantic disaster",
      "Advocate calls for better rail safety on 12th anniversary of Lac-Mégantic disaster"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.94,
      "consensus": 0.897,
      "constructiveness": 0.8,
      "proximity": 1.0
    },
    "score": 0.844,
    "summary": "Lac-Mégantic, Quebec, commemorated the 12th anniversary of a catastrophic rail disaster that claimed 47 lives on July 6, 2013. The town honored the victims by lowering flags to half-mast, laying flowers, and observing a moment of silence. During the remembrance, an advocate highlighted the ongoing need for improved rail safety measures, indicating that further actions are necessary to prevent future tragedies.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story informs readers about the ongoing need for improved rail safety measures, providing useful context around a significant past event. However, it does not report on any specific solutions, improvements, or innovations in rail safety, limiting its score."
  },
  {
    "title": "Elon Musk Forms New Political Party After Dispute with Trump",
    "domain": "general",
    "location": "national",
    "published": "Sun, 06 Jul 2025 13:39:10 -0400",
    "source": "NPR",
    "sources": [
      "Al Jazeera",
      "Deutsche Welle",
      "The Guardian",
      "CBC News",
      "NPR",
      "Financial Times",
      "Business Insider"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "Musk said he's carrying out his threat to form a new political party after a falling out with Trump over the president's sweeping tax cuts law.",
      "Tesla CEO follows through on pledge to create a new political party after Donald Trump signs his budget bill into law.",
      "The US president described the plan by Musk, who was until recently his adviser and most prominent financial backer, to create a new political party as \"ridiculous.\"",
      "Billionaire investor offers no significant details but suggests key congressional races will be initial targets",
      "<p>US president railed against his former adviser online after tech billionaire said he will start and bankroll America party</p><p><a href=\"https://www.theguardian.com/us-news/donaldtrump\">Donald Trump</a> called <a href=\"https://www.theguardian.com/technology/elon-musk\">Elon Musk</a>’s decision to",
      "<img alt=\"A person speaks while sitting at a desk as another person standing looks on.\" height=\"349\" src=\"https://i.cbc.ca/1.7578538.1751839460!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_620/trump.jpg\" title=\"President Donald Trump speaks during a news conference with Elon Musk in the Oval Of",
      "Tesla CEO Elon Musk has been a harsh critic of President Donald Trump's spending bill. Trump said Musk had \"gone off the rails.\""
    ],
    "image_url": "",
    "titles": [
      "Musk forms new party after split with Trump over tax and spending bill",
      "Elon Musk launches the America Party as feud with Trump escalates",
      "Elon Musk launches 'America Party' drawing rebuke from Trump",
      "Elon Musk launches US political party to fight ‘one-party system’",
      "Trump says Musk is ‘off the rails’ and calls his new political party ‘ridiculous’",
      "Trump slams 'ridiculous' decision by Musk to start new U.S. political party",
      "Elon Musk says he's formed the 'America Party.' Mark Cuban and Anthony Scaramucci are interested."
    ],
    "score_components": {
      "magnitude": 0.82,
      "recency": 0.873,
      "consensus": 1.0,
      "constructiveness": 0.5,
      "proximity": 0.75
    },
    "score": 0.837,
    "summary": "Elon Musk, CEO of Tesla and previously an adviser and financial supporter of President Donald Trump, has announced the formation of a new political party following a disagreement over Trump's tax cuts law. The move, described by Trump as \"ridiculous,\" comes after Musk criticized Trump's spending bill. Despite offering no significant details, Musk suggested that his party, which he plans to start and fund, will initially target key congressional races. Trump has publicly criticized Musk's decision, highlighting a significant rift between the two.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about a significant political development involving a prominent business figure. However, it lacks depth and actionable insights, as it does not provide any substantial details about the new political party or its potential impact on the political landscape."
  },
  {
    "title": "Israel Agrees to Ceasefire Proposal, Hamas Seeks Changes Amid Gaza Conflict",
    "domain": "general",
    "location": "global",
    "published": "Sun, 06 Jul 2025 20:27:17 GMT",
    "source": "BBC",
    "sources": [
      "ABC News",
      "BBC",
      "Axios",
      "New York Times"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "Hamas said it has responded to the latest ceasefire proposal positively but there are still gaps to be bridged.",
      "<a href=\"https://news.google.com/rss/articles/CBMidkFVX3lxTE1pOXh5dnB5Z3lpcFY5Vll3N1BGZ0xBOXZUMGgxcnFLVHE4MF9KOVZXeTZHTDlIVTU1cVpPTmV1OUdZZ2FOWnkwSmNHeVpBVUlIVkZTSFlwQWk4OV9tQjNxbkZ1ZHlsai1qQWxaMkIzaDZnalRtQmc?oc=5\" target=\"_blank\">Israel and Hamas to hold indirect ceasefire talks in Qatar</a>&nbsp;",
      "Israel sent a negotiating team to Qatar ahead of Netanyahu&rsquo;s White House visit.",
      "Prime Minister Benjamin Netanyahu of Israel is set to meet with President Trump on Monday as attention has turned from Iran to a cease-fire for Gaza."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/21bd/live/ecdac480-5aa1-11f0-bf57-2d681db6ae65.jpg",
    "titles": [
      "Gaza ceasefire talks begin in Qatar as Netanyahu heads to Washington",
      "Israel and Hamas to hold indirect ceasefire talks in Qatar - Axios",
      "New details emerge on Gaza ceasefire proposal as Netanyahu heads to White House",
      "Netanyahu Heads to Washington as Trump Pushes for Israel-Hamas Cease-Fire"
    ],
    "score_components": {
      "magnitude": 0.82,
      "recency": 0.926,
      "consensus": 0.935,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.836,
    "summary": "Israeli Prime Minister Benjamin Netanyahu announced that Israel has accepted a ceasefire proposal, but Hamas is seeking changes to the proposal, which Israel finds 'unacceptable'. Despite ongoing conflict resulting in dozens of deaths in Gaza, including those at aid sites and from airstrikes, both sides are preparing for indirect ceasefire talks in Doha, Qatar. The talks, backed by a U.S.-led effort and set to begin Sunday, aim to halt nearly 21 months of war. However, significant differences in positions present challenges to achieving a truce, with hopes for peace cautiously rising.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful information about the ongoing conflict between Israel and Hamas, and the efforts being made towards a ceasefire. It also highlights the challenges involved in achieving a truce, thus giving readers a deeper understanding of the situation. However, it does not clearly highlight any solutions or progress, hence the score is not higher."
  },
  {
    "title": "2025 MLB All-Star Roster Revealed; Notable Snubs Spark Debate",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 6 Jul 2025 18:32:01 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "Sports Illustrated",
      "Yahoo Sports",
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Some of the game's biggest names are headed to Atlanta, but some deserving stars will be watching from home.",
      "Some of these players will be added as injury replacements, but who deserved more of an honor?",
      "We take a look at a half-dozen players omitted from the July 6 MLB All-Star roster drop.",
      "<a href=\"https://news.google.com/rss/articles/CBMicEFVX3lxTE4yemk0S000b0QxbEdPbXpuaVNGdk9VVDlPNnZqWGgzUl9BcWpGVUNndGY2UDQzaDJZa09ERUFEdzZQVFg2Wndlam5pTFJLNXI5dXlxdFZUbVZoeTBzSXp5dTkwbGswbk5RZkVPSGZOQnE?oc=5\" target=\"_blank\">Full MLB All-Star Game 2025 Rosters Revealed</a>&nbsp;&nbsp;<font color=\"#6f",
      "<a href=\"https://news.google.com/rss/articles/CBMihgFBVV95cUxQdU9uME93OEJpNmR2U1IzYnRlLXVmSTN5X3pWVzc2YWJYOWo2a1ZmV0swMEoyS3lXZVk4UnFJVERDc0NNeUJ2X3lIOFJtbmlPM1J0clI4d2FKd3E0TUhLUVFweU1GSGRYeDBrZWVMamF1NGUyOTJreXFwYnJqbTBpYThKQzNGZw?oc=5\" target=\"_blank\">Four Biggest Snubs From 2025 WNBA All-Star Ga"
    ],
    "image_url": "",
    "titles": [
      "All-Star rosters: Biggest snubs and other takeaways",
      "2025 MLB All-Star Game: Cubs' Seiya Suzuki, Astros' Framber Valdez among surprising snubs from rosters",
      "The biggest MLB All-Star Game snubs, from Juan Soto to Framber Valdez",
      "Full MLB All-Star Game 2025 Rosters Revealed - Sports Illustrated",
      "Four Biggest Snubs From 2025 WNBA All-Star Game After Full Field Is Announced - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.967,
      "consensus": 0.935,
      "constructiveness": 0.5,
      "proximity": 0.75
    },
    "score": 0.832,
    "summary": "The 2025 MLB All-Star Game roster has been revealed, featuring some of the biggest names in the game headed to Atlanta. However, several deserving players were omitted from the initial roster. While some may be added later as injury replacements, the discussion around who deserved to be honored but was left out is ongoing. Additionally, the WNBA All-Star Game has its own share of snubs, with four significant players missing from the lineup. Both events highlight the competitive nature and depth of talent in professional baseball and basketball.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story provides basic awareness about the 2025 MLB All-Star Game roster and the ongoing debate around omitted players. However, it lacks depth or insight into why certain players were snubbed and what criteria are used for selection, limiting its usefulness and progress."
  },
  {
    "title": "Norris Wins British GP Amid Wet Conditions and Teammate Penalty Drama",
    "domain": "general",
    "location": "global",
    "published": "Sun, 06 Jul 2025 16:20:26 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Sky Sports",
      "Al Jazeera",
      "The Guardian",
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "general",
      "sports"
    ],
    "snippets": [
      "Lando Norris becomes 13th British driver to win home Grand Prix as Nico Hulkenberg makes first podium after 239 races.",
      "As Lando Norris closed in on home victory at the British Grand Prix, he had one overriding thought in his head: \"Just don't f--- it up.\"",
      "<ul><li><p>Piastri fumes at controversial stewards decision</p></li><li><p>Norris: ‘Being on top at your home race is very special’</p></li></ul><p>Lando Norris said his maiden victory at the British Grand Prix was everything he had dreamed of and a special moment to savour at his home race. However",
      "Lando Norris won his home British Grand Prix for the first time after title-leading team-mate Oscar Piastri collected a 10-second penalty for a controversial Safety Car incident with Max Verstappen in a thrilling rain-hit race.",
      "<p>Lando Norris&#8217; dreams came true Sunday, winning on home asphalt for the first time at the British GP, but the victory came at the expense of McLaren teammate Oscar Piastri.</p>"
    ],
    "image_url": "",
    "titles": [
      "Norris wins British GP as Hulkenberg scores record first F1 podium",
      "Norris on British GP final lap: Don't mess it up",
      "Lando Norris savours ‘dream’ British GP win but Piastri left hurt and confused",
      "Norris wins epic British GP after Piastri penalty for Verstappen controversy",
      "F1 Takeaways: Piastri’s penalty proves costly as Norris wins British GP"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.85,
      "consensus": 1.0,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.81,
    "summary": "Lando Norris secured his first home victory at the British Grand Prix in a race marked by challenging wet conditions and dramatic incidents. The event was notable for Norris's McLaren teammate, Oscar Piastri, receiving a 10-second penalty for a Safety Car infringement, which significantly impacted his chance for victory. The penalty, involving a controversial moment with Max Verstappen, allowed Norris to take the lead and ultimately win the race, narrowing the points gap between him and Piastri in the title race.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information about the race, including the conditions, incidents, and results. However, it doesn't provide deeper insights about the systems, trends, or impacts of the race or the sport in general."
  },
  {
    "title": "Kevin Durant Traded to Rockets in Historic Seven-Team NBA Deal",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 6 Jul 2025 19:42:18 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "Sports Illustrated",
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "A series of moves going back to Kevin Durant's trade to the Houston Rockets before the draft ultimately became the first seven-team trade in NBA history.",
      "Here's what each of the seven teams in the Kevin Durant trade are getting",
      "<a href=\"https://news.google.com/rss/articles/CBMikgFBVV95cUxOcVFCYzd5YUF0Nk9RX0oyaWVaUWtOV0ZQZ1Jfc2ttMkZhYW50QnJKRzBvNWlYNHY0VURmelhVZW8tNVhuV3BDc1p6TWNsVkN0V1hYUERoZnF2RGgzNV9ZZDduV1lPVWpaM2UzR0JPOGM3VUtvMDJOZllRWWlwdVpscGZuX3ZFNDBjRW9kRXYyX2wzQQ?oc=5\" target=\"_blank\">Kevin Durant Trade: All the M"
    ],
    "image_url": "",
    "titles": [
      "Durant to Rockets part of NBA-first 7-team trade",
      "Kevin Durant trade details: Full terms for Suns, Rockets, five others in historic seven-team transaction",
      "Kevin Durant Trade: All the Moves Made in NBA’s Historic Seven-Team Deal - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.991,
      "consensus": 0.847,
      "constructiveness": 0.6,
      "proximity": 0.75
    },
    "score": 0.79,
    "summary": "In a historic NBA event, Kevin Durant was traded to the Houston Rockets in a complex deal involving seven teams, marking the first seven-team trade in the league's history. This trade reshaped the rosters and future prospects of all teams involved, although the specific assets each team received were not detailed in the summary provided.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story informs about a significant event in NBA history, providing context about the complexity of the trade. However, without details on the specific assets each team received, it falls short in offering actionable insights or a deeper understanding of the trade's impact on the teams and players involved."
  },
  {
    "title": "Trump Administration Sets Deadline for Trade Deals, Threatens Tariffs",
    "domain": "business",
    "location": "global",
    "published": "Sun, 06 Jul 2025 20:12:19 +0000",
    "source": "Fortune",
    "sources": [
      "CityNews",
      "Financial Post",
      "Fortune"
    ],
    "domains": [
      "business",
      "general"
    ],
    "snippets": [
      "\"There are deadlines, and there are things that are close, so maybe things will push back past the deadline or maybe they won’t.\"",
      "WASHINGTON (AP) &#8212; The Trump administration is stepping up pressure on trading partners to quickly make new deals before a Wednesday deadline, with plans for the United States to start sending letters Monday warning countries that higher tariffs could kick in Aug. 1. That furthers the uncertain",
      "WASHINGTON (AP) — The Trump administration is stepping up pressure on trading partners to quickly make new deals before a Wednesday deadline, with plans for the United States to start sending letters Monday warning countries that higher tariffs could kick in Aug. 1. That furthers the uncertainty for"
    ],
    "image_url": "https://fortune.com/img-assets/wp-content/uploads/2025/07/AP25172075974812-e1751832148495.jpg?w=2048",
    "titles": [
      "Trump officials keep up tariff pressure but hint at flexibility on deadline",
      "Pressure from Trump for trade deals before Wednesday deadline, but hints of more time for talks",
      "Pressure from Trump for trade deals before Wednesday deadline, but hints of more time for talks"
    ],
    "score_components": {
      "magnitude": 0.74,
      "recency": 0.921,
      "consensus": 0.897,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.777,
    "summary": "The Trump administration is increasing pressure on trading partners to finalize new deals before a set Wednesday deadline. It plans to issue letters on Monday to warn that higher tariffs may be imposed starting Aug. 1 if agreements are not reached. This move adds to the existing uncertainty surrounding trade negotiations.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about upcoming changes in trade policy, which could impact a variety of sectors. However, it lacks depth in explaining the potential impacts or solutions to the issue, and does not provide much in the way of actionable insights."
  },
  {
    "title": "Brian Campbell Wins 2025 John Deere Classic in Playoff Victory",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 06 Jul 2025 19:35:24 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sky Sports",
      "Yahoo Sports",
      "Sportsnet"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "The PGA Tour visits TPC Deere Run for the Fourth of July",
      "A complete list of the golf equipment Brian Campbell used to win the PGA Tour's 2025 John Deere Classic.",
      "Highlights from day four of the John Deere Classic as Brian Campbell gets his second PGA Tour win.",
      "<p>Brian Campbell won for the second time this year on the PGA Tour, both in a playoff, when he closed with a 4-under 67 and beat Emiliano Grillo with a par on the first extra hole Sunday in the John Deere Classic.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/07/01/f914a7df-dc55-4469-82af-758650eda573/john-deere.jpg",
    "titles": [
      "2025 John Deere Classic TV schedule, coverage, golf live stream, channel, where to watch PGA Tour event",
      "Winner's Bag: Brian Campbell, 2025 John Deere Classic",
      "John Deere Classic | Highlights as Campbell gets second PGA Tour win",
      "Brian Campbell wins John Deere Classic for second playoff victory this year"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.909,
      "consensus": 0.935,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.776,
    "summary": "Brian Campbell secured his second PGA Tour victory of the year at the 2025 John Deere Classic, held at TPC Deere Run. He finished the tournament with a 4-under 67, ultimately winning against Emiliano Grillo in a playoff with a par on the first extra hole. This event marks Campbell's second win in a playoff this year, underlining his performance at the Fourth of July event.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "The story reports on a sports event result and highlights Brian Campbell's performance. However, it offers minimal depth or insight into the strategies or skills that led to his victory, or the broader implications of his win for the PGA tour or his career. Therefore, its usefulness, progress, and awareness are limited."
  },
  {
    "title": "Cowboys' Turpin Arrested on Drug, Weapon Charges in Texas",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 6 Jul 2025 19:42:19 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Cowboys All-Pro kick returner KaVontae Turpin was arrested Saturday by the Allen (Texas) Police Department and is facing two misdemeanor charges.",
      "Turpin signed a three-year deal in March that made him the highest-paid special teams player in the NFL",
      "<p>All-Pro return man KaVontae Turpin of the Cowboys was arrested in a Dallas suburb on misdemeanor charges of marijuana possession and unlawful carrying of a weapon, authorities said Sunday.</p>"
    ],
    "image_url": "",
    "titles": [
      "Cowboys All-Pro KR Turpin arrested on 2 charges",
      "Cowboys' All-Pro returner KaVontae Turpin arrested, faces weapon, marijuana charges months after signing deal",
      "Cowboys return man KaVontae Turpin arrested on marijuana and weapon charges"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.991,
      "consensus": 0.847,
      "constructiveness": 0.3,
      "proximity": 0.75
    },
    "score": 0.76,
    "summary": "KaVontae Turpin, the Cowboys' All-Pro kick returner, was arrested by the Allen, Texas Police Department on misdemeanor charges of marijuana possession and unlawful carrying of a weapon. This incident occurred after Turpin signed a three-year contract in March, making him the NFL's highest-paid special teams player.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story is primarily reactive and doesn't provide much depth or insight beyond the basic facts of the arrest. It raises awareness about the incident, but doesn't provide any actionable insights or deeper understanding for the reader."
  },
  {
    "title": "Wimbledon Apologizes for Line-Call System Error in Key Match",
    "domain": "general",
    "location": "global",
    "published": "Sun, 06 Jul 2025 21:32:25 GMT",
    "source": "BBC",
    "sources": [
      "Sky Sports",
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "general",
      "sports"
    ],
    "snippets": [
      "Wimbledon organisers apologise after the electronic line-calling system on Centre Court is turned off in error and misses three calls in one game.",
      "<p>Briton Sonay Kartal loses to Russian Anastasia Pavlyuchenkova in clash marred by technological failure </p><p>Wimbledon organisers<strong> </strong>have apologised after the electronic line-calling system was turned off in error at a crucial moment in Sonay Kartal’s match on Centre Court.</p><p>T",
      "<ul><li><p>British No 3 loses in fourth round 7-6, 6-4 on Centre Court</p></li><li><p>Line-calling system malfunctions at key point in first set</p></li></ul><p>Sonay Kartal took Wimbledon by storm as the last British player standing in the women’s singles, after Emma Raducanu’s exit. The Brighton n",
      "Wimbledon officials have apologised to Anastasia Pavlyuchenkova and Sonay Kartal after an embarrassing malfunction of the new electronic line-calling system on Centre Court."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/6dd9/live/732b1680-5aa6-11f0-b5c5-012c5796682d.jpg",
    "titles": [
      "'Human error' - Wimbledon sorry over missed line calls",
      "Wimbledon organisers apologise after line-calling system turned off in error",
      "Pavlyuchenkova ends Sonay Kartal’s Wimbledon dream as AI line-calling fails",
      "Wimbledon officials apologise to players after line-calling tech blunder"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.947,
      "consensus": 0.897,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.759,
    "summary": "Wimbledon organisers apologised following a malfunction of the electronic line-calling system on Centre Court, which was accidentally turned off, missing three calls in a crucial game. The error occurred during a match where British player Sonay Kartal was defeated by Russian Anastasia Pavlyuchenkova with scores of 7-6, 6-4 in the fourth round. This incident marked a significant technological failure at a key moment, affecting the last British player standing in the women’s singles competition.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about a technological error during a key match at Wimbledon. However, it doesn't offer any actionable insights or deeper understanding for the reader. Nor does it discuss any solutions or improvements to prevent such errors in the future."
  },
  {
    "title": "Arsenal Signs Zubimendi, Advances in Deal for Gyökeres",
    "domain": "general",
    "location": "global",
    "published": "Sun, 06 Jul 2025 18:02:32 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian",
      "ESPN"
    ],
    "domains": [
      "general",
      "sports"
    ],
    "snippets": [
      "With Arsenal hoping to sign the final piece to complete the jigsaw puzzle of their midfield, BBC Sport looks at what they would be getting with\nMartin Zubimendi.",
      "Arsenal have completed the signing of highly rated Spain midfielder Martín Zubimendi from Real Sociedad, the Premier League club have announced.",
      "<ul><li><p>Sporting No 9 agrees terms as talks over fee continue</p></li><li><p>Zubimendi in from Real Sociedad despite Madrid interest</p></li></ul><p>Arsenal are closing in on the signing of Viktor Gyökeres from Sporting after agreeing personal terms with the Sweden striker. Negotiations are conti"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/1b38/live/8d751730-4e1b-11f0-a871-1dfe95a5332c.jpg",
    "titles": [
      "Why Arsenal are signing 'brain of the future' Zubimendi",
      "Martín Zubimendi joins Arsenal from Sociedad",
      "Arsenal close on Viktor Gyökeres after signing Martín Zubimendi in £50m-plus deal"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.881,
      "consensus": 0.897,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.755,
    "summary": "Arsenal has successfully signed Spain midfielder Martín Zubimendi from Real Sociedad, as confirmed by the Premier League club. This acquisition is seen as the final piece to complete Arsenal's midfield puzzle. Additionally, Arsenal is progressing in their pursuit of Swedish striker Viktor Gyökeres from Sporting, having agreed on personal terms while discussions regarding the transfer fee are ongoing.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information about Arsenal's recent signings and potential future acquisitions. It gives readers an understanding of the club's strategy and decisions. However, it doesn't delve into the potential impacts of these signings or provide a broader context for the club's performance."
  },
  {
    "title": "Kevin Durant Joins Houston Rockets in Record-Setting Trade at 37",
    "domain": "general",
    "location": "global",
    "published": "Mon, 07 Jul 2025 00:41:38 +0200",
    "source": "Le Monde",
    "sources": [
      "Le Monde",
      "Yahoo Sports",
      "Sportsnet"
    ],
    "domains": [
      "general",
      "sports"
    ],
    "snippets": [
      "A 37 ans, le huitième meilleur marqueur de l’histoire de la ligue nord-américaine de basket espère relancer sa carrière dans le Texas où il rejoint une équipe ambitieuse, après un passage décevant à Phoenix.",
      "Kevin Durant delivered a statement after the trade between the Phoenix Suns and the Houston Rockets.",
      "Kevin Durant reflects on his time with the Suns.",
      "<p>Kevin Durant’s trade to the Houston Rockets is official and officially record-setting.</p>"
    ],
    "image_url": "https://img.lemde.fr/2025/06/20/39/0/2803/1401/644/322/60/0/6a26da3_ftp-import-images-1-ud3ba9j3c620-2025-06-20t180214z-1671251742-rc2pmdavqtsv-rtrmadp-3-soccer-france-psg-durant.JPG",
    "titles": [
      "NBA : le joueur star Kevin Durant officiellement annoncé chez les Houston Rockets",
      "Kevin Durant Makes Statement After Suns-Rockets Trade",
      "Kevin Durant Addresses Suns Exit After Historic Trade to Rockets",
      "Durant trade to Rockets includes record-breaking seven teams"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.97,
      "consensus": 0.897,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.743,
    "summary": "At 37, the NBA's eighth all-time leading scorer, Kevin Durant, aims to revive his career by joining the ambitious Houston Rockets, following a disappointing stint with the Phoenix Suns. The trade between the Suns and the Rockets has been officially confirmed and is considered record-setting. Durant has shared his reflections on his time with the Suns as he moves forward with his career in Texas.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers basic awareness about a significant event in the sports world. However, it does not provide any deeper understanding, actionable insights, or clarity around systems, causes, trends, or impacts that matter. It is mostly reactive and does not contribute meaningfully to the reader's understanding or decision-making."
  },
  {
    "title": "Analysts Predict Fantasy Season Surprises and Concerns for Lamar Jackson",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 6 Jul 2025 19:42:19 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Which players will surprise, disappoint or make a big jump this fantasy season? Our analysts give their picks.",
      "SportsLine simulated the NFL season 10,000 times and revealed its 2025 Fantasy football sleepers for 2025 Fantasy football draft prep"
    ],
    "image_url": "",
    "titles": [
      "🏈 Fantasy football sleepers, busts and breakouts",
      "Fantasy Football Rankings 2025: Sleepers from top-rated NFL model that predicted James Cook's monster year"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.991,
      "consensus": 0.632,
      "constructiveness": 0.9,
      "proximity": 0.75
    },
    "score": 0.731,
    "summary": "Sports analysts have shared their predictions for the upcoming fantasy season, identifying players who may surprise, disappoint, or make significant progress. Additionally, there are concerns regarding potential regression in performance for Lamar Jackson. These insights aim to guide fantasy sports enthusiasts in making informed decisions.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it offers actionable insights for fantasy sports enthusiasts. It provides a deeper understanding of player performance and potential surprises or disappointments, aiding the reader in making informed decisions."
  },
  {
    "title": "Pirates' Cruz Makes 105.2 mph Throw, Second-Hardest in Statcast History",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 6 Jul 2025 19:42:19 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Pirates center fielder Oneil Cruz made a 105.2 mph throw to nab Seattle's J.P. Crawford at the plate on Sunday, the second-hardest thrown ball to produce an outfield assist since Statcast started tracking in 2015.",
      "<p>Watch as Pittsburgh Pirates centre fielder Oneil Cruz scoops up the ball in the outfield and displays his incredible to throw out J.P. Crrawford at home. The throw registered at 105.2 MPH.</p>",
      "<p>Pittsburgh Pirates centre fielder Oneil Cruz made a 105.2 m.p.h. throw to nab Seattle&#8217;s J.P. Crawford at the plate on Sunday, the second-hardest thrown ball to produce an outfield assist since Statcast started tracking in 2015.</p>"
    ],
    "image_url": "",
    "titles": [
      "Pirates CF Cruz makes 105.2 mph throw to plate",
      "Pirates’ Cruz shows off cannon of an arm to throw out runner at home",
      "Pirates’ Cruz nabs runner at the plate on 105.2 mph throw from centre field"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.991,
      "consensus": 0.632,
      "constructiveness": 0.6,
      "proximity": 0.75
    },
    "score": 0.701,
    "summary": "Oneil Cruz, the center fielder for the Pittsburgh Pirates, executed a remarkable throw to prevent Seattle's J.P. Crawford from scoring on Sunday. His throw was recorded at 105.2 mph, making it the second-hardest throw leading to an outfield assist since Statcast began its measurements in 2015. This feat showcases Cruz's significant arm strength and defensive skill.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information on a significant achievement in baseball, contextualizing it within the history of recorded throws. It gives the reader a deeper understanding of the player's skill and the significance of the event, even though it doesn't report on solutions, improvements, or innovations."
  },
  {
    "title": "Amazon Offers Early Streaming Deals Ahead of Prime Day 2025",
    "domain": "business",
    "location": "global",
    "published": "Sun, 06 Jul 2025 17:38:39 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes",
      "The Verge"
    ],
    "domains": [
      "business",
      "technology"
    ],
    "snippets": [
      "Amazon is giving users an early shot at subscribing to several different add-on streaming services through the platform ahead of Prime Day 2025.",
      "Amazon’s next Prime Day event hasn’t officially kicked off yet, but as usual, the retailer has already dropped a selection of early deals ahead of the four-day shopping event. While steeper discounts are surely to arrive when things kick off on July 8th, many of the current offers are already worth "
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/686ae9a31b88005b8db606d6/0x0.jpg?width=960",
    "titles": [
      "Amazon Lists Early Prime Day Streaming Service Subscription Deals",
      "Here are 33 of our favorite deals from Amazon’s early Prime Day sale"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.949,
      "consensus": 0.682,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.7,
    "summary": "Amazon is offering early access to subscribe to various add-on streaming services before Prime Day 2025. This comes as part of their early deals leading up to the event, which officially starts on July 8th. Although the biggest discounts are expected during the four-day event, the current promotions are considered significant.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The story informs readers about an upcoming opportunity to save money, which is useful and actionable. However, it doesn't provide a broader context or insight into trends or impacts in the streaming or e-commerce industries."
  },
  {
    "title": "Switzerland Beats Iceland, Boosts Euro 2025 Knockout Stage Hopes",
    "domain": "sports",
    "location": "national",
    "published": "Sun, 6 Jul 2025 17:36:30 EST",
    "source": "ESPN",
    "sources": [
      "The Guardian",
      "ESPN"
    ],
    "domains": [
      "general",
      "sports"
    ],
    "snippets": [
      "Switzerland's win over Iceland has them on course for the knockouts. Here's what else you need to know from Euro 2025 action.",
      "<p>Iceland will be leaving the party early but, following some initial wobbles, the hosts are still going strong.</p><p>After losing their <a href=\"https://www.theguardian.com/football/2025/jul/02/switzerland-norway-womens-euro-2025-group-a-match-report\">tournament opener to Norway</a>, Switzerland "
    ],
    "image_url": "",
    "titles": [
      "Euro 2025 Daily: Hosts Switzerland keep knockout hopes alive",
      "Switzerland keep Euro 2025 dream alive after Reuteler and Pilgrim knock out Iceland"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.949,
      "consensus": 0.682,
      "constructiveness": 0.5,
      "proximity": 0.75
    },
    "score": 0.695,
    "summary": "Switzerland's recent victory over Iceland in Euro 2025 has improved their chances of advancing to the knockout stages, while Iceland is set to exit the tournament early. Despite losing their opening match to Norway, Switzerland's performance has improved, keeping their hopes alive in the competition.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness about the outcome of a sports match and its implications for the tournament. However, it lacks depth or insight into the strategies or performances that led to this outcome, limiting its usefulness for the reader."
  },
  {
    "title": "\"Jurassic World Rebirth\" Earns $318.3M Globally in Debut",
    "domain": "business",
    "location": "global",
    "published": "Sun, 06 Jul 2025 16:08:47 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes",
      "CityNews"
    ],
    "domains": [
      "business",
      "general"
    ],
    "snippets": [
      "The latest “Jurassic World” installment made over $318 million in box office sales domestically and internationally over the last five days.",
      "Dinosaurs rule this Fourth of July holiday weekend, but will they keep the crown when DC and Marvel enter the race later this month with some superpowered challengers?",
      "Dinosaur fatigue may be a theme in “Jurassic World Rebirth,” but moviegoing audiences don’t seem to have that reservation. The newest installment in the “Jurassic World” franchise ruled the Fourth of July holiday box office with a global, five-day launch of $318.3 million, according to studio estima"
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/686ad74f2508837b2a34e2ba/0x0.jpg?width=960&precrop=1999%2C1125%2Cx0%2Cy163",
    "titles": [
      "‘Jurassic World Rebirth’ Dominates Box Office With $318 Million Holiday Weekend—But Still Lags Previous Installments",
      "‘Jurassic World: Rebirth’ Devours July 4th Box Office At $320 Million",
      "‘Jurassic World Rebirth’ bites off $318 million at the global box office"
    ],
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.92,
      "consensus": 0.682,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.645,
    "summary": "The latest installment of the \"Jurassic World\" franchise, titled \"Jurassic World Rebirth,\" dominated the Fourth of July holiday box office, earning $318.3 million globally in its first five days according to studio estimates. This performance indicates strong audience interest despite potential concerns of \"dinosaur fatigue.\"",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "The story provides basic awareness about the success of a new movie, but it doesn't offer deeper insights or understanding about the film industry, the factors contributing to the movie's success, or the potential implications of this success."
  },
  {
    "title": "New Method Turns Immune Cells Into Enhanced Cancer Killers",
    "domain": "science",
    "location": "global",
    "published": "Sun, 06 Jul 2025 22:32:58 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/scientists-discover-unknown-organelle-inside-our-cells/\" rel=\"nofollow\" title=\"Scientists Discover Unknown Organelle Inside Our Cells\"><img alt=\"Biology Cells Art Concept\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images",
      "<a href=\"https://scitechdaily.com/scientists-turn-forgotten-cells-into-powerful-cancer-killers/\" rel=\"nofollow\" title=\"Scientists Turn Forgotten Cells Into Powerful Cancer Killers\"><img alt=\"Natural Killer Cell Destorying Cancer Cell Illustration\" class=\"webfeedsFeaturedVisual wp-post-image\" height="
    ],
    "image_url": "",
    "titles": [
      "Scientists Discover Unknown Organelle Inside Our Cells",
      "Scientists Turn Forgotten Cells Into Powerful Cancer Killers"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.967,
      "consensus": 0.393,
      "constructiveness": 1.0,
      "proximity": 0.5
    },
    "score": 0.455,
    "summary": "Scientists have developed a method to transform a type of immune cell, previously overlooked, into potent cancer killers. This breakthrough, detailed in recent research, leverages natural killer (NK) cells, enhancing their ability to target and destroy cancer cells effectively. This advancement represents a significant step forward in cancer treatment, offering a new, potentially more effective approach to combating the disease.",
    "constructiveness_score": 1.0,
    "constructiveness_reason": "This news story is highly constructive. It provides useful insights into a new method of cancer treatment, reporting on a significant innovation. It increases awareness about the role of natural killer cells in combating cancer, and offers hope for more effective cancer treatments in the future."
  },
  {
    "title": "US Researchers Develop AI Microscope for Enhanced Soil Health Testing",
    "domain": "science",
    "location": "global",
    "published": "Sun, 06 Jul 2025 19:00:01 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "The classic microscope is getting a modern twist—US researchers are developing an AI-powered microscope system that could make soil health testing faster, cheaper, and more accessible to farmers and land managers around the world."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/ai-revives-classic-mic.jpg",
    "titles": [
      "AI revives classic microscopy for on-farm soil health testing"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.976,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.454,
    "summary": "US researchers are developing an AI-powered microscope system designed to enhance soil health testing. This innovative approach aims to provide farmers and land managers globally with a faster, more affordable, and accessible method for assessing soil conditions, potentially benefiting agricultural practices and land management strategies.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "The story reports on an innovative solution to a problem, providing useful information about a new technology that could improve agricultural practices. It highlights progress in the area of soil health testing and could empower farmers and land managers with knowledge about this new tool."
  },
  {
    "title": "Gene Therapy Reverses Deafness in Mice, Offers Hope for Humans",
    "domain": "science",
    "location": "global",
    "published": "Sun, 06 Jul 2025 21:22:03 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/a-shot-of-sound-gene-therapy-reverses-deafness-in-just-weeks/\" rel=\"nofollow\" title=\"A Shot of Sound: Gene Therapy Reverses Deafness in Just Weeks\"><img alt=\"Young Man Huge Hearing Aid\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechda"
    ],
    "image_url": "",
    "titles": [
      "A Shot of Sound: Gene Therapy Reverses Deafness in Just Weeks"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.944,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.441,
    "summary": "Researchers have developed a gene therapy that can reverse deafness in mice within weeks of treatment. The therapy involves a one-time injection that targets the inner ear, restoring hearing by promoting the regeneration of hair cells critical for hearing. This breakthrough could potentially lead to new treatments for hearing loss in humans.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive as it reports on a significant scientific breakthrough, providing readers with a deeper understanding of the potential future treatments for hearing loss. It highlights progress in gene therapy and offers hope for innovative solutions to a common health issue."
  },
  {
    "title": "Hearing Aids Linked to Longer Life and Less Loneliness in Seniors",
    "domain": "science",
    "location": "global",
    "published": "Sun, 06 Jul 2025 21:57:08 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/hearing-aids-could-help-you-live-longer-and-feel-less-lonely/\" rel=\"nofollow\" title=\"Hearing Aids Could Help You Live Longer and Feel Less Lonely\"><img alt=\"Happy Senior Woman Ear Hearing Restored\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https"
    ],
    "image_url": "",
    "titles": [
      "Hearing Aids Could Help You Live Longer and Feel Less Lonely"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.955,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.44,
    "summary": "Recent research suggests that using hearing aids may not only improve hearing but could also extend life expectancy and reduce feelings of loneliness. The study highlighted the positive impacts on seniors' overall well-being, indicating that better hearing contributes to more active social engagement and a healthier lifestyle.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story increases awareness about the potential benefits of using hearing aids beyond just improved hearing, which could influence decisions related to health and lifestyle in seniors. It provides useful insights but doesn't explicitly report on solutions or improvements to current hearing aid technology or accessibility."
  },
  {
    "title": "U.S. Stock Futures Drop as Trump Delays Tariffs to August 1",
    "domain": "business",
    "location": "global",
    "published": "Sun, 06 Jul 2025 23:59:00 GMT",
    "source": "MarketWatch",
    "sources": [
      "MarketWatch"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "U.S. stock-market futures declined as the Trump administration said a broad swath of tariffs against U.S. trade partners won’t take effect until Aug. 1, rather than July 9."
    ],
    "image_url": "https://images.mktw.net/im-40768419",
    "titles": [
      "Oil prices fall as OPEC+ ramps up production; U.S. stock futures decline as tariffs to go into effect Aug. 1"
    ],
    "score_components": {
      "magnitude": 0.079,
      "recency": 0.997,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.435,
    "summary": "U.S. stock-market futures fell after the Trump administration announced that a wide range of tariffs against U.S. trade partners, initially set to start on July 9, will now be delayed until August 1.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story offers useful information about the delay of tariffs and its immediate impact on U.S. stock-market futures. However, it does not provide a deeper understanding of the reasons behind the decision or its potential long-term impacts."
  },
  {
    "title": "Delta Air Lines to Kick Off Q2 Earnings Season with Modest Expectations",
    "domain": "business",
    "location": "global",
    "published": "Sun, 06 Jul 2025 23:38:00 GMT",
    "source": "MarketWatch",
    "sources": [
      "MarketWatch"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "The second-quarter earnings season will begin a little more quietly than usual this week, with results from Delta Air Lines due on Thursday. Wall Street’s advice? Keep expectations low."
    ],
    "image_url": "https://images.mktw.net/im-47780581",
    "titles": [
      "Delta kicks off second-quarter earnings this week. But is 2025 already a ‘lost year’ for airlines?"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.989,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.427,
    "summary": "The second-quarter earnings season is starting off quietly, with Delta Air Lines set to release its results on Thursday. Wall Street is advising to maintain low expectations for these upcoming financial disclosures.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information about the upcoming earnings season, which might be important for investors or those interested in the airline industry. However, it lacks depth and does not report on any solutions, improvements, or attempts to solve problems."
  },
  {
    "title": "Tariff Reprieve Extended Briefly Beyond July 9, Short of Market Expectations",
    "domain": "business",
    "location": "global",
    "published": "Sun, 06 Jul 2025 22:58:03 +0000",
    "source": "Fortune",
    "sources": [
      "Fortune"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "While markets expected an extension ahead of the July 9 end to the tariff reprieve, administration officials signaled there will be just a few weeks' worth."
    ],
    "image_url": "https://fortune.com/img-assets/wp-content/uploads/2025/07/GettyImages-2222513572-e1751840629287.jpg?w=2048",
    "titles": [
      "Dow futures fall as Trump officials signal limited breathing room before tariffs ‘boomerang back’"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.976,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.424,
    "summary": "The administration has indicated that the tariff reprieve, which was anticipated by markets to extend beyond its July 9 expiration, will only be prolonged for a few weeks. This decision comes despite expectations for a longer extension.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the tariff reprieve extension, which can influence decision-making in the market. However, it lacks depth as it does not explain why the extension is shorter than expected or what impacts this might have."
  },
  {
    "title": "PM Carney Signals Likely New Oil Pipeline to West Coast",
    "domain": "business",
    "location": "national",
    "published": "Sun, 06 Jul 2025 19:13:14 +0000",
    "source": "Financial Post",
    "sources": [
      "Financial Post"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Prime Minister Mark Carney said a new oil pipeline to Canada’s West Coast is “highly likely” to be proposed as a nation-building project, which could mean it becomes part of Ottawa’s push to fast-track major developments under new legislation."
    ],
    "image_url": "",
    "titles": [
      "Carney Says New Oil Pipeline Proposal ‘Highly Likely’ in Canada"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.902,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.422,
    "summary": "Prime Minister Mark Carney announced that a new oil pipeline to Canada's West Coast is \"highly likely\" to be proposed, suggesting it could be integrated into Ottawa's initiative to expedite significant projects through new legislation. This move aligns with the government's efforts to enhance national development.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it offers a deeper understanding of the government's development plans. It informs readers about a potential new oil pipeline and the government's initiative to expedite significant projects. However, it does not fully highlight solutions or progress, as the pipeline is still just a proposal."
  },
  {
    "title": "NASA Rover Finds Hidden Water in Martian Rock with SuperCam Laser",
    "domain": "science",
    "location": "global",
    "published": "Sun, 06 Jul 2025 16:04:30 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/lasers-gas-blasts-and-hidden-water-how-perseverance-cracked-mars-stubborn-rock/\" rel=\"nofollow\" title=\"Lasers, Gas Blasts, and Hidden Water: How Perseverance Cracked Mars’ Stubborn Rock\"><img alt=\"Mars Perseverance SuperCam Laser Zapping\" class=\"webfeedsFeaturedVisu"
    ],
    "image_url": "",
    "titles": [
      "Lasers, Gas Blasts, and Hidden Water: How Perseverance Cracked Mars’ Stubborn Rock"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.845,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.421,
    "summary": "NASA's Perseverance rover successfully analyzed Martian rock using a SuperCam laser, revealing hidden water within. Despite initial challenges with the rock's hard surface, the combination of laser technology and gas blasts enabled the discovery. This finding contributes to the understanding of Mars' geology and past water presence, marking a significant achievement in the ongoing exploration of the planet.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive as it reports on a significant scientific discovery that contributes to our understanding of Mars' geology and past water presence. It highlights the progress made in space exploration and the innovative use of technology, providing readers with empowering knowledge."
  },
  {
    "title": "Ambroxol Shows Promise in Parkinson’s Dementia Study",
    "domain": "science",
    "location": "global",
    "published": "Sun, 06 Jul 2025 09:01:26 EDT",
    "source": "ScienceDaily",
    "sources": [
      "ScienceDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Ambroxol, long used for coughs in Europe, stabilized symptoms and brain-damage markers in Parkinson’s dementia patients over 12 months, whereas placebo patients worsened. Those with high-risk genes even saw cognitive gains, hinting at real disease-modifying power."
    ],
    "image_url": "",
    "titles": [
      "Cough medicine turned brain protector? Ambroxol may slow Parkinson’s dementia"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.793,
      "consensus": 0.393,
      "constructiveness": 1.0,
      "proximity": 0.5
    },
    "score": 0.421,
    "summary": "Ambroxol, a medication traditionally used for treating coughs in Europe, demonstrated potential benefits for patients with Parkinson’s dementia in a 12-month study. The drug stabilized symptoms and reduced markers of brain damage, contrasting with the deterioration observed in patients who received a placebo. Notably, individuals carrying high-risk genes for the condition experienced cognitive improvements, suggesting that Ambroxol could have disease-modifying effects for Parkinson’s dementia.",
    "constructiveness_score": 1.0,
    "constructiveness_reason": "This story is highly constructive. It reports on a potential solution or improvement for patients with Parkinson's dementia, providing actionable insights for patients and healthcare providers. It also increases clarity around the disease-modifying effects of Ambroxol, contributing to the reader's understanding of Parkinson's dementia."
  },
  {
    "title": "Exports to US Decline, Surge to ASEAN and EU Indicates Trade Shift",
    "domain": "business",
    "location": "global",
    "published": "Sun, 06 Jul 2025 20:00:06 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Value of goods sent to US falls but shipping to Asean countries and EU rises"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F1da14973-9345-4ef9-8872-9463e63ca8a7.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "China reroutes exports via south-east Asia in bid to dodge Trump’s tariffs"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.917,
      "consensus": 0.393,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.415,
    "summary": "Exports to the United States have decreased in value, while there has been an increase in goods shipped to ASEAN countries and the European Union. This shift indicates a change in trade patterns, with exporters finding growing markets in Southeast Asia and Europe despite the decline in exports to the US.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides a useful understanding of shifting global trade patterns, which could inform business and economic decisions. However, it doesn't offer specific solutions or improvements, nor does it delve deep into the causes or impacts of these changes."
  },
  {
    "title": "JWST Discovers Galaxies Had \"Thick Phase\" in Evolution Process",
    "domain": "science",
    "location": "global",
    "published": "Sun, 06 Jul 2025 17:14:02 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/galaxies-had-a-thick-phase-jwst-just-revealed-how-they-slimmed-down/\" rel=\"nofollow\" title=\"Galaxies Had a “Thick Phase” – JWST Just Revealed How They Slimmed Down\"><img alt=\"Thick Galaxy Art Concept\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"ht"
    ],
    "image_url": "",
    "titles": [
      "Galaxies Had a “Thick Phase” – JWST Just Revealed How They Slimmed Down"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.866,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.415,
    "summary": "The James Webb Space Telescope (JWST) has provided new insights into galaxy evolution, revealing that galaxies underwent a \"thick phase\" before slimming down. This discovery offers a deeper understanding of how galaxies evolved over time, shedding light on the processes that influenced their current shapes and sizes.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it provides useful information about galaxy evolution, contributing to readers' understanding of the universe. However, it doesn't directly translate into actionable insights for the reader, hence the score is not at the highest end."
  },
  {
    "title": "Hidden Rings Around Young Stars Hint at Early Planet Formation",
    "domain": "science",
    "location": "global",
    "published": "Sun, 06 Jul 2025 16:39:22 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/hidden-rings-around-baby-stars-reveal-earliest-clues-of-planet-birth/\" rel=\"nofollow\" title=\"Hidden Rings Around Baby Stars Reveal Earliest Clues of Planet Birth\"><img alt=\"High-Resolution Images of Protoplanetary Disks in Ophiuchus\" class=\"webfeedsFeaturedVisual wp"
    ],
    "image_url": "",
    "titles": [
      "Hidden Rings Around Baby Stars Reveal Earliest Clues of Planet Birth"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.856,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.413,
    "summary": "Astronomers have discovered hidden rings around young stars in the Ophiuchus star-forming region, providing the earliest evidence of planet formation. These findings, based on high-resolution images, reveal structures in protoplanetary disks that precede planet development. This discovery adds significant insight into the process of how planets form from dust and gas surrounding new stars.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive because it increases awareness about the process of planet formation, giving readers a deeper understanding of the universe. It doesn't provide actionable insights for most readers but contributes to the overall knowledge base about our universe."
  },
  {
    "title": "TikTok’s ‘ban’ problem could end soon with a new app and a sale",
    "domain": "technology",
    "location": "global",
    "published": "2025-07-06T14:34:07-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Even with the TikTok divest-or-ban law officially in effect since January, the app has only shut down service in the US for one day. Now, The Information reports that an agreement for a sale satisfying the law’s requirements is close and would come with a new, separate version of the app. Any deal, "
    ],
    "image_url": "",
    "titles": [
      "TikTok’s ‘ban’ problem could end soon with a new app and a sale"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.89,
      "consensus": 0.393,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.41,
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story seems to be informative and provides useful context about TikTok's ongoing issues, potentially offering insights into the dynamics of tech companies and government regulations. However, without more information about the specifics of the 'new app' or 'sale', it's hard to determine if it reports on solutions or improvements."
  },
  {
    "title": "Figuring out why a nap might help people see things in new ways",
    "domain": "technology",
    "location": "global",
    "published": "Sun, 06 Jul 2025 11:06:38 +0000",
    "source": "Ars Technica",
    "sources": [
      "Ars Technica"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "An EEG signal of sleep is associated with better performance on a mental task."
    ],
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/07/GettyImages-1054583202-1024x648.jpg",
    "titles": [
      "Figuring out why a nap might help people see things in new ways"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.762,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.404,
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story potentially offers readers actionable insights about the benefits of napping and contributes to a deeper understanding of how sleep might influence perception and cognition. It also raises awareness about an aspect of human health and behavior."
  },
  {
    "title": "At least 36 new tech unicorns were minted in 2025 so far",
    "domain": "technology",
    "location": "global",
    "published": "Sun, 06 Jul 2025 17:47:34 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "With AI igniting an investor frenzy, every month, more startups obtain unicorn status. Using data from Crunchbase and PitchBook, TechCrunch tracked down the VC-backed startups that became unicorns so far this year. While most are AI-related, a surprising number are focused in other industries like s"
    ],
    "image_url": "",
    "titles": [
      "At least 36 new tech unicorns were minted in 2025 so far"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.876,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.397,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the trends in the tech industry, indicating a surge in successful startups. However, without more context or analysis, it doesn't offer deep insights or actionable knowledge."
  },
  {
    "title": "How to watch Summer Games Done Quick 2025",
    "domain": "technology",
    "location": "global",
    "published": "2025-07-06T12:00:00-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Grab your grill, your hot dogs, and your sparklers because it's time to celebrate… Summer Games Done Quick 2025. The annual speedrunning charity marathon benefitting Doctors without Borders is back starting July 6th and finishes July 12th. Here's how and most importantly what to watch as you enjoy t"
    ],
    "image_url": "",
    "titles": [
      "How to watch Summer Games Done Quick 2025"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.844,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.391,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information to readers interested in the event, but it does not offer any deeper understanding or insight into broader issues or trends."
  },
  {
    "title": "X blocked Reuters accounts in India",
    "domain": "technology",
    "location": "global",
    "published": "Sun, 06 Jul 2025 17:34:56 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "The main Reuters news account, as well as the Reuters World account, have apparently been inaccessible to X users in India since Saturday evening."
    ],
    "image_url": "",
    "titles": [
      "X blocked Reuters accounts in India"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.872,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.386,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story raises awareness about potential issues of censorship or control over media outlets. However, without further details about why this happened or what it means for the broader media landscape, it lacks depth and actionable insights."
  },
  {
    "title": "‘Improved’ Grok criticizes Democrats and Hollywood’s ‘Jewish executives’",
    "domain": "technology",
    "location": "global",
    "published": "Sun, 06 Jul 2025 20:58:44 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "On Friday morning, Elon Musk declared, “We have improved @Grok significantly. You should notice a difference when you ask Grok questions.”"
    ],
    "image_url": "",
    "titles": [
      "‘Improved’ Grok criticizes Democrats and Hollywood’s ‘Jewish executives’"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.936,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.379,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story seems to be more reactive and sensational, focusing on criticism and controversy. It doesn't provide actionable insights or deeper understanding, nor does it report on solutions, improvements, or attempts to solve problems. However, it might offer basic awareness about the political and cultural landscape."
  },
  {
    "title": "The Verge’s summer ‘in’ and ‘out’ list",
    "domain": "technology",
    "location": "global",
    "published": "2025-07-06T09:00:00-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Here at this website, my colleagues and I follow our beats closely, from wearable tech and laptops to influencer culture and federal policy. Last year, I asked a bunch of staff at The Verge to pretend to be trend forecasters for a lighthearted collection of what's hot and what's not. Some of the pre"
    ],
    "image_url": "",
    "titles": [
      "The Verge’s summer ‘in’ and ‘out’ list"
    ],
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.793,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.35,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story seems to offer basic awareness about trends, likely in technology or culture, but without more information, it's unclear how deep or useful this information is. It doesn't appear to report on solutions, improvements, or attempts to solve problems."
  },
  {
    "title": "How Brex is keeping up with AI by embracing the ‘messiness’",
    "domain": "technology",
    "location": "global",
    "published": "Sun, 06 Jul 2025 15:00:00 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Brex quickly realized its normal software procurement process wouldn't work in the age of AI and found a new way to test and vet tools."
    ],
    "image_url": "",
    "titles": [
      "How Brex is keeping up with AI by embracing the ‘messiness’"
    ],
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.827,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.334,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "The story lacks a summary or any content to evaluate its constructiveness. Based on the title alone, it's unclear whether the story provides any actionable insights, reports on solutions, or increases awareness of a particular issue."
  }
]