[
  {
    "title": "Australia news live: Canva billionaire joins Bill Gates pledge to give away wealth; woman found dead in Sydney after alleged DV assault",
    "domain": "general",
    "location": "global",
    "published": "Mon, 19 May 2025 23:49:28 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "snippets": [
      "<p>Co-founder Cameron Adams and his wife, Lisa Miller, to give away most of their $7bn fortune to charity. Follow today’s news live</p><ul><li><strong>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></strong></li></ul><p><strong>Liberals question role of advocacy group Advance</strong></p><p>We have an exclusive story this morning about the bitter aftermath within the Liberal party after its election defeat with some senior Liberal sources questioning the impact of Advance Australia, the rightwing advocacy that campaigned for the party.</p><p>We are absolutely deeply and gravely concerned about the situation in Gaza. For anyone who is watching the images or reading about what is happening there, we have been calling to ensure that aid is getting through and this is something that the Australian government keeps a watching brief on.</p><p><strong>I will leave it to the foreign minister to make any further updates</strong>, but we … certainly … are seeking support for the people of Gaza and for Israel to allow that support to be provided.</p> <a href=\"https://www.theguardian.com/australia-news/live/2025/may/20/australia-news-live-rba-interest-rates-decision-floods-storm-hunter-nsw-victoria-state-budget-aec-count-bradfield-goldstein-coalition-ley-littleproud-ntwnfb\">Continue reading...</a>",
      "<p>Co-founder Cameron Adams and his wife, Lisa Miller, to give away most of their $7bn fortune to charity. Follow today’s news live</p><ul><li><strong>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></strong></li></ul><p><strong>Liberals question role of advocacy group Advance</strong></p><p>We have an exclusive story this morning about the bitter aftermath within the Liberal party after its election defeat with some senior Liberal sources questioning the impact of Advance Australia, the rightwing advocacy that campaigned for the party.</p><p>We are absolutely deeply and gravely concerned about the situation in Gaza. For anyone who is watching the images or reading about what is happening there, we have been calling to ensure that aid is getting through and this is something that the Australian government keeps a watching brief on.</p><p><strong>I will leave it to the foreign minister to make any further updates</strong>, but we … certainly … are seeking support for the people of Gaza and for Israel to allow that support to be provided.</p> <a href=\"https://www.theguardian.com/australia-news/live/2025/may/20/australia-news-live-rba-interest-rates-decision-floods-storm-hunter-nsw-victoria-state-budget-aec-count-bradfield-goldstein-coalition-ley-littleproud-ntwnfb\">Continue reading...</a>"
    ],
    "image_url": "https://i.guim.co.uk/img/media/cda700aa916d3509299ba771abbb6c95d32ab438/341_0_4560_3648/master/4560.jpg?width=140&quality=85&auto=format&fit=max&s=fe265371fa2cc4f524ba05fb8a0afc92",
    "titles": [
      "Australia news live: Canva billionaire joins Bill Gates pledge to give away wealth; woman found dead in Sydney after alleged DV assault",
      "Australia news live: Canva billionaire joins Bill Gates pledge to give away wealth; woman found dead in Sydney after alleged DV assault"
    ],
    "summary": "Cameron Adams and his wife, Lisa Miller, plan to donate most of their $7bn fortune to charity. Meanwhile, there's internal conflict within the Liberal party over the influence of the rightwing advocacy group Advance Australia following an election defeat. Additionally, the Australian government expresses deep concern for the situation in Gaza, emphasizing the importance of ensuring aid delivery and seeking support for the people of Gaza and Israel.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful information about philanthropy, political dynamics, and international relations. It reports on a significant charitable pledge, which may inspire others to give. It also raises awareness about political conflicts within the Liberal party and the situation in Gaza, contributing to readers' understanding of these issues.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.996,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.582,
    "normalized_score": 9.29
  },
  {
    "title": "Ex-deputy in California repays $3,500 in cash he stole from homeless man",
    "domain": "general",
    "location": "global",
    "published": "Mon, 19 May 2025 23:41:49 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "snippets": [
      "<p>Felony charges dismissed but John Sanzone banned from serving as peace officer in state after covering up theft</p><p>A former sheriff’s deputy who stole $3,500 from a homeless man he arrested in <a href=\"https://www.theguardian.com/us-news/california\">California</a> has been permanently banned from serving as a peace officer in the state, while felony theft charges against him were dropped, authorities said.</p><p>John Sanzone, a former deputy with the Glenn county sheriff’s office, arrested a homeless man who had been carrying $3,500 – money the man had been saving for urgent dental work.</p> <a href=\"https://www.theguardian.com/us-news/2025/may/19/california-deputy-repays-stolen-money-homeless-man\">Continue reading...</a>"
    ],
    "image_url": "https://i.guim.co.uk/img/media/ac69f168bbb6bf10fcd524c1696f4a7998e5dbd0/229_0_1541_1234/master/1541.jpg?width=140&quality=85&auto=format&fit=max&s=a16f8080d21cb53c8f700d848742a20f",
    "titles": [
      "Ex-deputy in California repays $3,500 in cash he stole from homeless man"
    ],
    "summary": "John Sanzone, a former deputy in California's Glenn County Sheriff's Office, was permanently banned from serving as a peace officer in the state after he stole $3,500 from a homeless man he arrested. The money was intended for the man's urgent dental work. While felony theft charges against Sanzone were dropped, the ban remains in effect as a consequence of his actions.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs readers about an instance of misconduct within the police force, which is important for public accountability. However, it doesn't provide much depth or insight beyond the specific incident, nor does it report on any systemic changes or solutions to prevent such incidents in the future.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.995,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.554,
    "normalized_score": 5.95
  },
  {
    "title": "Comey says ‘8647’ post that caused Trump firestorm was totally innocent",
    "domain": "general",
    "location": "global",
    "published": "Mon, 19 May 2025 23:41:04 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "snippets": [
      "<p>Former FBI director describes as ‘crazy’ claim that seashell photo on Instagram signified assassination call</p><p>James Comey went for a walk on the beach with his wife when they stumbled on a message in the sand: 8647.</p><p>According to the former FBI director, his wife wondered if it was an address. They stood over the seashells, trying to decipher meaning. His wife, according to Comey’s account, recalled her days as a server, and said 86 was the term used to remove an item from the menu. Comey chimed in that when he was a kid, “86” meant “to ditch a place”.</p> <a href=\"https://www.theguardian.com/us-news/2025/may/19/james-comey-seashell-instagram-photo-trump\">Continue reading...</a>"
    ],
    "image_url": "https://i.guim.co.uk/img/media/01067cd7a1aa75bc8ddba3b374597f82d884a3e4/8_0_3331_2666/master/3331.jpg?width=140&quality=85&auto=format&fit=max&s=2db733c12d83396ccd1cd3f35f533f79",
    "titles": [
      "Comey says ‘8647’ post that caused Trump firestorm was totally innocent"
    ],
    "summary": "Former FBI director James Comey described as 'crazy' a claim that a seashell photo he posted on Instagram, showing the numbers 8647 written in the sand, was a call for assassination. The photo was taken during a beach walk with his wife, who speculated the numbers could be an address or, referencing her server days, a code to remove something, while Comey related it to a term from his youth meaning to leave a place. The interpretation of the photo has sparked controversy, but Comey has dismissed the assassination claim as unfounded.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers basic awareness about a controversy involving a public figure, but it doesn't provide much depth or insight. It doesn't contribute meaningfully to readers' understanding or decision-making, nor does it report on solutions or improvements. It seems to focus more on sensationalism than constructive information.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.994,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.532,
    "normalized_score": 3.33
  },
  {
    "title": "Trump Backs Off His Demand That Russia Declare a Cease-Fire in Ukraine",
    "domain": "general",
    "location": "global",
    "published": "Mon, 19 May 2025 23:38:47 +0000",
    "source": "New York Times",
    "sources": [
      "New York Times"
    ],
    "snippets": [
      "President Trump once vowed to broker peace between Russia and Ukraine in 24 hours. Now he says the two sides should work it out themselves."
    ],
    "image_url": "https://static01.nyt.com/images/2025/05/19/multimedia/19dc-prexy-wtpz/19dc-prexy-wtpz-mediumSquareAt3X.jpg",
    "titles": [
      "Trump Backs Off His Demand That Russia Declare a Cease-Fire in Ukraine"
    ],
    "summary": "Former President Trump, who previously claimed he could broker peace between Russia and Ukraine within 24 hours, has now stated that the two countries should resolve their conflict independently. This marks a significant shift in his stance on the matter.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about the changing stance of a significant political figure on an ongoing international conflict. However, it does not provide actionable insights or highlight progress towards a solution.",
    "score_components": {
      "magnitude": 0.449,
      "recency": 0.994,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.578,
    "normalized_score": 8.81
  },
  {
    "title": "Kelowna woman paddling 365 km for cause near and dear to her heart",
    "domain": "general",
    "location": "national",
    "published": "Mon, 19 May 2025 23:28:53 +0000",
    "source": "Global News",
    "sources": [
      "Global News"
    ],
    "snippets": [
      "“I am paddling 365 km for the month,” Kim Inglis said. “The whole idea behind the 365 is that autism doesn’t take a break.\" This is the 2nd annual event."
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/05/Kim-Inglis.jpg?quality=85&strip=all",
    "titles": [
      "Kelowna woman paddling 365 km for cause near and dear to her heart"
    ],
    "summary": "Kim Inglis is undertaking a 365 km paddling challenge over the course of a month for the second annual event aimed at raising awareness that autism does not take breaks. This initiative highlights the continuous nature of autism and seeks to draw attention to the condition through her physical endeavor.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story clearly highlights an individual's efforts to raise awareness about autism, a significant societal issue. It provides insight into the continuous nature of autism and how individuals can contribute to raising awareness.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.992,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.583,
    "normalized_score": 9.4
  },
  {
    "title": "Luana Santos proud to 'leave a little mark' in UFC record books with historic finish",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 19 May 2025 23:50:24 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "snippets": [
      "Record are made to be broken, but Luana Santos' win at UFC Vegas 106 will stand the test of time."
    ],
    "image_url": "",
    "titles": [
      "Luana Santos proud to 'leave a little mark' in UFC record books with historic finish"
    ],
    "summary": "Luana Santos achieved a significant milestone by winning at UFC Vegas 106, setting a record that is expected to endure. This victory marks a notable accomplishment in her career and the UFC history.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "While this story provides basic awareness about an individual's achievement in the UFC, it does not provide deeper understanding or actionable insights. It also does not report on solutions, improvements, or innovations.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.997,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.525,
    "normalized_score": 2.5
  },
  {
    "title": "Seong-Jun Kim gets signing bonus of just over $1.2 million in minor league deal with Rangers",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 19 May 2025 23:48:33 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "snippets": [
      "Kim is the fifth player from the high school to sign with a major league team, following Byung-Hyun Kim, Hee-Seop Choi, Jae Weong Seo and Jung Ho Kang."
    ],
    "image_url": "",
    "titles": [
      "Seong-Jun Kim gets signing bonus of just over $1.2 million in minor league deal with Rangers"
    ],
    "summary": "Kim has become the fifth player from his high school to sign with a major league baseball team, joining alumni Byung-Hyun Kim, Hee-Seop Choi, Jae Weong Seo, and Jung Ho Kang in achieving this milestone.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about Seong-Jun Kim's signing with the Rangers and his high school's history of producing major league players. However, it doesn't offer deeper insights into his potential impact on the team, the terms of his contract, or how this compares to other minor league deals.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.996,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.504,
    "normalized_score": 0.0
  },
  {
    "title": "Five Lions Ranked in Top 25 Best Players Under 25 Years Old",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 19 May 2025 23:46:00 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "snippets": [
      "The Detroit Lions are loaded with young talent and recently landed five players on a list ranking the top 25 players in the NFL under 25 years old."
    ],
    "image_url": "",
    "titles": [
      "Five Lions Ranked in Top 25 Best Players Under 25 Years Old"
    ],
    "summary": "The Detroit Lions have been recognized for their young talent, with five of their players being ranked among the top 25 NFL players under the age of 25. This highlights the team's potential and the successful acquisition of promising young athletes.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story offers useful information about the young talent on the Detroit Lions team. It indicates the team's potential for future success, but it could be more constructive by providing more context about the players' individual contributions or how the team plans to develop these athletes.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.996,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.554,
    "normalized_score": 5.95
  },
  {
    "title": "White Sox unveil a graphic installation honoring Pope Leo XIV and his World Series appearance",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 19 May 2025 23:45:40 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "snippets": [
      "Some fans have been dressing as the pope for White Sox games, and there are several different T-shirts that celebrate the team’s most famous fan."
    ],
    "image_url": "",
    "titles": [
      "White Sox unveil a graphic installation honoring Pope Leo XIV and his World Series appearance"
    ],
    "summary": "Fans of the White Sox have adopted the unique tradition of dressing as the pope for games, celebrating the team's most famous fan. This phenomenon has inspired the creation of various T-shirts commemorating this distinctive form of support.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story increases awareness of a unique fan tradition and the team's recognition of it. However, it lacks depth and doesn't provide insights into why this tradition started, how it impacts the team or the fan experience, or why the team decided to honor it with a graphic installation.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.995,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.524,
    "normalized_score": 2.38
  },
  {
    "title": "Fan who sued over Shedeur Sanders draft slide requests early discovery",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 19 May 2025 23:45:01 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "snippets": [
      "The fan who filed what appears to be a frivolous lawsuit against the NFL over the draft-day free fall of Browns quarterback Shedeur Sanders is committed to the bit."
    ],
    "image_url": "",
    "titles": [
      "Fan who sued over Shedeur Sanders draft slide requests early discovery"
    ],
    "summary": "A fan has filed a lawsuit against the NFL concerning the draft-day drop of Browns quarterback Shedeur Sanders, which is being viewed as frivolous. The individual behind the lawsuit remains dedicated to their cause, despite skepticism surrounding the validity of their claims.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers basic awareness about a lawsuit filed by a fan against the NFL. However, it lacks depth and does not provide actionable insights or deeper understanding to the reader. It also does not report on solutions, improvements, or attempts to solve problems.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.995,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.504,
    "normalized_score": 0.0
  },
  {
    "title": "The CEO trap—why 70% of CHROs depart after a change at the top",
    "domain": "business",
    "location": "global",
    "published": "Mon, 19 May 2025 23:31:38 +0000",
    "source": "Fortune",
    "sources": [
      "Fortune"
    ],
    "snippets": [
      "There’s a survival guide for being a C-suite HR leader, and it requires thinking like an investor and leading like a CEO, says leadership effectiveness expert Rosanna Trasatti."
    ],
    "image_url": "https://fortune.com/img-assets/wp-content/uploads/2025/05/54529939152_5bfab7265c_o-e1747697017293.jpg?w=2048",
    "titles": [
      "The CEO trap—why 70% of CHROs depart after a change at the top"
    ],
    "summary": "Leadership effectiveness expert Rosanna Trasatti advises C-suite HR leaders to adopt a dual approach for success: think like an investor and lead like a CEO. This strategy is presented as a survival guide for HR executives aiming to excel in their roles.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive as it provides empowering knowledge to C-suite HR leaders on how to excel in their roles. It presents a strategy that could potentially help HR executives survive and succeed after a change in leadership. It's useful, promotes progress, and increases awareness.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.992,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.583,
    "normalized_score": 9.4
  },
  {
    "title": "Alphabet's Waymo wins approval to expand driverless ride-hailing service to San Jose",
    "domain": "business",
    "location": "national",
    "published": "Mon, 19 May 2025 23:19:44 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "snippets": [
      "Waymo has received approval from California regulators to expand its driverless ride-hailing service to San Jose and other parts of the Bay Area."
    ],
    "image_url": "",
    "titles": [
      "Alphabet's Waymo wins approval to expand driverless ride-hailing service to San Jose"
    ],
    "summary": "Waymo, an autonomous vehicle company, has been granted permission by California regulators to extend its driverless ride-hailing service to include San Jose and additional areas within the Bay Area. This approval marks a significant expansion of Waymo's operations in California.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story informs readers about the expansion of Waymo's driverless ride-hailing service, which is a significant development in the field of autonomous vehicles. It provides useful information and context about the state of autonomous vehicle services in California. However, it does not clearly highlight solutions or empowering knowledge.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.989,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.58,
    "normalized_score": 9.05
  },
  {
    "title": "Has Donald Trump abandoned Ukraine?",
    "domain": "business",
    "location": "global",
    "published": "Mon, 19 May 2025 23:16:39 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times"
    ],
    "snippets": [
      "After a phone call with Putin, the US leader seems ready to ditch his vow to end Russia’s war on its neighbour"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F4bdc41f9-a9fa-4b0c-a1fd-7b7e48f11cec.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Has Donald Trump abandoned Ukraine?"
    ],
    "summary": "Following a phone conversation with Russian President Vladimir Putin, the U.S. leader appears to reconsider his previous commitment to ending Russia's conflict with its neighboring country.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides some insight into the current geopolitical situation involving the U.S., Russia, and Ukraine. However, it lacks depth in explaining the potential impacts or causes of the U.S. leader's reconsideration, making it less constructive.",
    "score_components": {
      "magnitude": 0.449,
      "recency": 0.989,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.576,
    "normalized_score": 8.57
  },
  {
    "title": "Jim Cramer tells investors to tame their market fears",
    "domain": "business",
    "location": "national",
    "published": "Mon, 19 May 2025 23:14:03 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "snippets": [
      "Interpreting the Moody's downgrade of U.S. debt as a sign to sell is a mistake, CNBC's Jim Cramer told investors."
    ],
    "image_url": "",
    "titles": [
      "Jim Cramer tells investors to tame their market fears"
    ],
    "summary": "Jim Cramer, a CNBC commentator, advised investors that interpreting Moody's downgrade of U.S. debt as a cue to sell is incorrect. He emphasized that making investment decisions based on this downgrade is a misstep.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive as it provides actionable advice to investors about how to interpret and react to market news. It also offers a deeper understanding of the implications of Moody's downgrade of U.S. debt.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.988,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.582,
    "normalized_score": 9.29
  },
  {
    "title": "LA Port shipments fell 30% in early May after Trump tariffs",
    "domain": "business",
    "location": "global",
    "published": "Mon, 19 May 2025 23:13:21 +0000",
    "source": "Fortune",
    "sources": [
      "Fortune"
    ],
    "snippets": [
      "The drop in port activity came as importers and retailers—especially those with business in China—grappled with Trump’s tariffs announced in early April."
    ],
    "image_url": "https://fortune.com/img-assets/wp-content/uploads/2025/05/GettyImages-2214260294-e1747696105404.jpg?w=2048",
    "titles": [
      "LA Port shipments fell 30% in early May after Trump tariffs"
    ],
    "summary": "In early April, the announcement of tariffs by the Trump administration led to a decrease in port activity. This downturn was particularly noted among importers and retailers with business ties to China, who were directly affected by the new trade measures.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The story provides useful information about the impacts of the Trump administration's tariffs, specifically on importers and retailers with ties to China. However, it does not explore potential solutions or improvements, limiting its constructiveness.",
    "score_components": {
      "magnitude": 0.429,
      "recency": 0.988,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.588,
    "normalized_score": 10.0
  },
  {
    "title": "New Study Shows Obesity Scrambles the Body’s Metabolic Clock",
    "domain": "science",
    "location": "global",
    "published": "Mon, 19 May 2025 20:53:10 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/new-study-shows-obesity-scrambles-the-bodys-metabolic-clock/\" rel=\"nofollow\" title=\"New Study Shows Obesity Scrambles the Body’s Metabolic Clock\"><img alt=\"Overweight Man Fat Belly\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"583\" src=\"https://scitechdaily.com/images/Overweight-Man-Fat-Belly-777x583.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>Obesity causes temporary disruptions, but not permanent structural changes, in the liver’s molecular network that regulates adaptation to starvation. Researchers led by Keigo Morita and Shinya Kuroda at the University of Tokyo have discovered that obesity causes a temporary disruption in how the liver adapts to starvation. Despite this functional disturbance, the underlying structure of [...]"
    ],
    "image_url": "",
    "titles": [
      "New Study Shows Obesity Scrambles the Body’s Metabolic Clock"
    ],
    "summary": "A study led by Keigo Morita and Shinya Kuroda from the University of Tokyo found that obesity temporarily disrupts the liver's molecular network, which is responsible for adapting to starvation. However, this disturbance does not lead to permanent structural changes in the liver.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "The story provides useful insights into the effects of obesity on the body's metabolic system. However, it doesn't offer solutions or progress towards addressing the issue, nor does it fully explain the systems or causes involved.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.956,
      "consensus": 0.2,
      "constructiveness": 0.7
    },
    "score": 0.552,
    "normalized_score": 5.71
  },
  {
    "title": "Scientists Uncover Hidden Biological Dangers of Ultra-Processed Foods",
    "domain": "science",
    "location": "global",
    "published": "Mon, 19 May 2025 20:28:03 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/scientists-uncover-hidden-biological-dangers-of-ultra-processed-foods/\" rel=\"nofollow\" title=\"Scientists Uncover Hidden Biological Dangers of Ultra-Processed Foods\"><img alt=\"Bacon Double Cheeseburger\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Bacon-Double-Cheeseburger-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>A major Canadian study links ultra-processed foods to serious health risks, uncovering biological signs of inflammation and metabolic dysfunction that persist regardless of weight or lifestyle. Chips, frozen pizza, sugary breakfast cereals — these ultra-processed foods are convenient and popular, but a groundbreaking Canadian study has confirmed they are strongly linked to serious health risks. [...]"
    ],
    "image_url": "",
    "titles": [
      "Scientists Uncover Hidden Biological Dangers of Ultra-Processed Foods"
    ],
    "summary": "A major Canadian study has found that ultra-processed foods, such as chips, frozen pizza, and sugary cereals, are linked to serious health risks including signs of inflammation and metabolic dysfunction. These risks persist regardless of an individual's weight or lifestyle, highlighting the inherent dangers of these popular, convenient food choices.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story increases awareness about the health risks associated with ultra-processed foods. It provides useful information that can inform reader's decision-making about dietary choices, but it doesn't highlight solutions or innovations to mitigate these health risks.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.95,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.561,
    "normalized_score": 6.79
  },
  {
    "title": "The Dark Side of the Hottest Diet Drug: Ozempic Risks You Can’t Ignore",
    "domain": "science",
    "location": "global",
    "published": "Mon, 19 May 2025 20:03:20 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/the-dark-side-of-the-hottest-diet-drug-ozempic-risks-you-cant-ignore/\" rel=\"nofollow\" title=\"The Dark Side of the Hottest Diet Drug: Ozempic Risks You Can’t Ignore\"><img alt=\"Obese Man Using Semaglutide Ozempic\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"436\" src=\"https://scitechdaily.com/images/Obese-Man-Using-Semaglutide-Ozempic-777x436.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>Despite semaglutide’s popularity for weight loss, experts are sounding the alarm on its major shortcomings—limited long-term success, serious side effects, and rapid weight regain after stopping the drug. While millions of Americans qualify for semaglutide, research reveals that most users remain overweight or obese even after years of treatment. Semaglutide: Effectiveness and Limitations A popular [...]"
    ],
    "image_url": "",
    "titles": [
      "The Dark Side of the Hottest Diet Drug: Ozempic Risks You Can’t Ignore"
    ],
    "summary": "Semaglutide, a popular weight loss drug, faces criticism for its significant drawbacks, including limited long-term effectiveness, severe side effects, and quick weight regain post-treatment. Despite its widespread use, research indicates that the majority of users continue to be overweight or obese even after prolonged use.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The story provides useful information about the risks associated with a popular weight loss drug. It increases awareness about the limitations and side effects of the drug, which can inform readers' decision-making. However, it doesn't report on solutions or improvements to these issues.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.944,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.559,
    "normalized_score": 6.55
  },
  {
    "title": "Attempt to reach expert consensus on teens and phones ends in argument",
    "domain": "science",
    "location": "global",
    "published": "Mon, 19 May 2025 17:57:03 +0100",
    "source": "New Scientist",
    "sources": [
      "New Scientist"
    ],
    "snippets": [
      "There are a range of competing views on whether smartphones and social media are harmful to adolescents, and an attempt to settle the debate has instead sparked more disagreement"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/05/19151756/SEI_252153067.jpg",
    "titles": [
      "Attempt to reach expert consensus on teens and phones ends in argument"
    ],
    "summary": "An attempt to resolve the debate on whether smartphones and social media are harmful to adolescents has led to further disagreement. Despite various perspectives, no consensus has been reached, indicating the complexity of the issue and the diversity of opinions surrounding the impact of digital technology on youth well-being.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful awareness about the ongoing debate surrounding the impact of smartphones and social media on adolescents. However, it doesn't offer any solutions or progress on the issue, nor does it provide actionable insights for the reader.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.901,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.526,
    "normalized_score": 2.62
  },
  {
    "title": "This new book is a one-sided attempt to puncture the AI bubble",
    "domain": "science",
    "location": "global",
    "published": "Mon, 19 May 2025 17:45:00 +0100",
    "source": "New Scientist",
    "sources": [
      "New Scientist"
    ],
    "snippets": [
      "The AI Con by Emily Bender and Alex Hanna wants to expose the hype generated by large artificial intelligence companies, but it is a frustrating read"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/05/19160844/SEI_251040596.jpg",
    "titles": [
      "This new book is a one-sided attempt to puncture the AI bubble"
    ],
    "summary": "\"The AI Con\" by Emily Bender and Alex Hanna critiques the excessive hype surrounding large AI companies. The book aims to reveal the overpromises and potential harms of this hype. However, readers have found the book to be a frustrating read, suggesting challenges in its approach to addressing these issues.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful context about the hype surrounding AI and its potential harms, contributing to the reader's understanding of the topic. However, it doesn't report on any solutions or improvements, and the one-sided critique may not provide a balanced perspective.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.898,
      "consensus": 0.2,
      "constructiveness": 0.7
    },
    "score": 0.543,
    "normalized_score": 4.64
  }
]