[
  {
    "title": "49ers' Demarcus Robinson Suspended 3 Games for DUI Charge",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Wed, 20 Aug 2025 19:52:08 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "CBS Sports",
      "Sports Illustrated",
      "ESPN"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.cbssports.com",
      "news.google.com",
      "www.espn.com"
    ],
    "snippets": [
      "49ers coach Kyle Shanahan said Wednesday on San Francisco's KNBR radio that receiver Demarcus Robinson has been suspended three games stemming from a misdemeanor DUI charge.",
      "Robinson started all 17 games last year for the Rams",
      "<a href=\"https://news.google.com/rss/articles/CBMigwFBVV95cUxOWnJHMkdabzFfaU9YQ1VtdFdLeDM1NmRvd2tkeDVseF9KemNNQXZZcHJQd1RMb2ZRdzJkbGUwOWRiVndDRmdhZk96TlYxOHRUdkVsQzROSzJ1dWlCdEdOQzU2MWFWZldvSDZudUxHb1RuRHRCdlI3YkxHMlRuQ3dwM2JDNA?oc=5\" target=\"_blank\">49ers Wide Receiver Demarcus Robinson Suspended T",
      "<p>San Francisco 49ers coach Kyle Shanahan said receiver Demarcus Robinson is facing a three-game suspension to start the season for violating the league’s substance abuse policy.</p>"
    ],
    "image_url": "",
    "titles": [
      "WR Robinson suspended 3 games, per Shanahan",
      "49ers WR Demarcus Robinson to be suspended for three games after pleading no contest in DUI case",
      "49ers Wide Receiver Demarcus Robinson Suspended Three Games - Sports Illustrated",
      "49ers WR Demarcus Robinson faces three-game suspension, coach says"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.992,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.813,
    "summary": "San Francisco 49ers wide receiver Demarcus Robinson has been suspended for three games due to a misdemeanor DUI charge, as announced by 49ers coach Kyle Shanahan on KNBR radio. The suspension comes as a violation of the league's substance abuse policy. Robinson, who played all 17 games last season for the Rams, will miss the start of the season.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Saints Trade for Broncos' Vele, Exchange Two Future Picks",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Wed, 20 Aug 2025 19:52:08 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN",
      "Yahoo Sports"
    ],
    "domains": [
      "sports.yahoo.com",
      "www.sportsnet.ca",
      "saintswire.usatoday.com",
      "www.espn.com"
    ],
    "snippets": [
      "The Saints added to their receiver room ahead of the regular-season opener Wednesday, acquiring Devaughn Vele in a trade with the Broncos, who received two future draft picks in return.",
      "The Saints are down to just five picks in the 2026 draft after their Devaughn Vele trade, and they won't own all of their selections again until 2028:",
      "The Denver Broncos are alleviating some of the crowding in their wide receiver room by sending second-year pro Devaughn Vele to the New Orleans Saints for a pair of draft picks.  The Broncos will get a fourth-round selection in next year's draft and a seventh-rounder in 2027 in exchange for Vele, wh",
      "<p>The Denver Broncos are alleviating some of the crowding in their wide receiver room by sending second-year pro Devaughn Vele to the New Orleans Saints for a pair of draft picks.</p>"
    ],
    "image_url": "",
    "titles": [
      "Saints acquire WR Vele, send picks to Broncos",
      "New Orleans Saints future draft picks update after trading for Broncos WR Devaughn Vele",
      "Saints acquire second-year wide receiver Devaughn Vele from Broncos for a pair of draft picks",
      "Saints acquire second-year WR Devaughn Vele from Broncos for draft picks"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.992,
      "consensus": 0.809,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.772,
    "summary": "The New Orleans Saints acquired wide receiver Devaughn Vele from the Denver Broncos in exchange for two future draft picks, a fourth-rounder in next year's draft and a seventh-rounder in 2027. This trade aims to bolster the Saints' receiver options ahead of the season opener. As a result, the Saints are left with five picks in the 2026 draft and won't have a full slate of draft selections until 2028. The move helps the Broncos reduce their surplus of wide receivers.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Jake Paul to Fight Gervonta Davis in Atlanta on Nov 14",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 20 Aug 2025 20:19:46 GMT",
    "source": "BBC",
    "sources": [
      "Sportsnet",
      "CBS Sports",
      "Forbes",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.forbes.com",
      "www.sportsnet.ca",
      "www.cbssports.com"
    ],
    "snippets": [
      "Jake Paul will take on WBA lightweight champion Gervonta Davis in Atlanta, Georgia on 14 November.",
      "The latest bizarre boxing match pairs a fighter who competes at 200 pounds with one at 135 pounds",
      "Two of boxing's biggest names will clash on Nov. 14 when Paul faces Davis at State Farm Arena in Atlanta.",
      "<p>YouTuber-turned-cruiserweight boxer Jake Paul and undefeated WBA lightweight champion Gervonta “Tank” Davis have agreed to fight on Nov. 14 at Atlanta&#8217;s State Farm Arena.</p>"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/57a6/live/5cd7a9b0-7e01-11f0-ab50-1bd1cf07c8be.png",
    "titles": [
      "Jake Paul to face 5ft 5ins Davis in November",
      "Jake Paul vs. Gervonta Davis fight: Social media superstar to face 'Tank' in exhibition bout in November",
      "Boxing On Netflix: Jake Paul vs. Gervonta Davis Set For Nov. 14",
      "Jake Paul and Gervonta Davis announce they will fight on Nov. 14"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.903,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.77,
    "summary": "Jake Paul, a YouTuber-turned-cruiserweight boxer, is set to fight undefeated WBA lightweight champion Gervonta \"Tank\" Davis on November 14 at the State Farm Arena in Atlanta, Georgia. This match-up features two prominent figures from different weight classes, with Paul competing at 200 pounds and Davis at 135 pounds.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Sony Raises PlayStation 5 Price in U.S. to $550 Amid Economic Challenges",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Wed, 20 Aug 2025 17:00:09 GMT",
    "source": "CNBC",
    "sources": [
      "TechCrunch",
      "Ars Technica",
      "Fortune",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "fortune.com",
      "techcrunch.com",
      "arstechnica.com"
    ],
    "snippets": [
      "Sony said on Wednesday that PlayStation 5 game consoles will cost more in the U.S. starting this week.",
      "The PlayStation 5 is currently the most popular gaming console in America.",
      "Sony is hiking the price of PlayStation 5 consoles in the U.S. this week, citing a \"challenging economic environment.\"",
      "Price hikes go into effect August 21; standard PS5 will now start at $550."
    ],
    "image_url": "",
    "titles": [
      "Sony raises PlayStation 5 prices in U.S. as tariffs start to hit",
      "Sony will pass on tariff costs to U.S. consumers by hiking PlayStation 5 prices",
      "Sony is increasing the price of the PlayStation 5 as new tariffs take hold",
      "Sony makes the “difficult decision” to raise PlayStation 5 prices in the US"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.842,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.765,
    "summary": "Sony announced that PlayStation 5 console prices in the U.S. will increase due to a challenging economic environment. The standard PS5 will now start at $550, up from the previous price. The price hike will be effective starting August 21. The PlayStation 5 is currently the most popular gaming console in America.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic",
    "image": {
      "src": "icons/usa.svg",
      "thumbnail": "icons/usa.svg",
      "alt": "u s flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Lamar Jackson Exits Practice Early After Foot Incident, Not Seriously Injured",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Wed, 20 Aug 2025 19:52:08 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "Sports Illustrated",
      "ESPN"
    ],
    "domains": [
      "www.cbssports.com",
      "news.google.com",
      "www.espn.com"
    ],
    "snippets": [
      "Ravens quarterback Lamar Jackson left Wednesday's practice early after having his foot stepped on, but he's fine, a team spokesman said.",
      "Jackson left practice roughly 40 minutes early after his foot was stepped on",
      "<a href=\"https://news.google.com/rss/articles/CBMiekFVX3lxTFBJVi1lN0oteGJ4ODctTm1nZHllVzFnazc5Q3pmdGc3N0xKMkNUZHBQVHZMeUNsNDJxVGc2MUpzcmc5aGIzVy1rOGVHU2RyX1JNblprTXlGYkhPV3JEdERUM0tpbUJnall2RHVzYlBhLWN0cEFUcS1xQ2NR?oc=5\" target=\"_blank\">NFL Insider Explains Why Ravens Star Lamar Jackson Left Practic"
    ],
    "image_url": "",
    "titles": [
      "Lamar OK after injury scare at Ravens practice",
      "Lamar Jackson injury: Ravens star quarterback OK after scare during practice, team says",
      "NFL Insider Explains Why Ravens Star Lamar Jackson Left Practice Early Wednesday - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.992,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.76,
    "summary": "Lamar Jackson, the quarterback for the Ravens, exited Wednesday's practice early due to his foot being accidentally stepped on. Despite leaving 40 minutes before the session ended, a team spokesperson confirmed that Jackson is fine and not seriously injured.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Trump Urges Fed Governor Cook to Resign Amid Allegations",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Wed, 20 Aug 2025 12:56:04 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "Axios",
      "Al Jazeera"
    ],
    "domains": [
      "www.npr.org",
      "www.aljazeera.com",
      "news.google.com"
    ],
    "snippets": [
      "President Trump is calling for the resignation of Federal Reserve governor Lisa Cook after a Trump ally accused her of making false statements on mortgage applications.",
      "The resignation calls intensify Trump’s attempts to yield influence over the central bank.",
      "<a href=\"https://news.google.com/rss/articles/CBMid0FVX3lxTE5jUlRSVWNJZkQ0Vkl3QzgwcnluWVQxTU5xZDhjejc3eXpSSFZqVU9jQWxkYlVxOVhyd094WXptOVc2TW0wTXAxT2R5VmJ6WFJnRWstTDdIbHhFOXlmQ1BUTDBsYkFseDYyZndqOFRjQWNrSk02cHpJ?oc=5\" target=\"_blank\">Trump housing regulator accuses Fed governor Cook of mortgage fraud"
    ],
    "image_url": "",
    "titles": [
      "Trump calls for resignation of Fed governor in latest line of attack",
      "Trump calls on Fed Gov Cook to resign over mortgage allegations",
      "Trump housing regulator accuses Fed governor Cook of mortgage fraud - Axios"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.859,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.75,
    "summary": "President Trump has called for Federal Reserve governor Lisa Cook to resign following accusations from a Trump ally of making false statements on mortgage applications. This move marks an escalation in Trump's efforts to influence the Federal Reserve. The outcome or current status regarding Cook's position or response to these allegations has not been provided in the information available.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic",
    "image": {
      "src": "icons/newspaper.svg",
      "thumbnail": "icons/newspaper.svg",
      "alt": "general",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Trump Criticizes Fed, Calls for Lisa Cook's Resignation Amid Fraud Claims",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Wed, 20 Aug 2025 21:46:04 GMT",
    "source": "CNBC",
    "sources": [
      "The Guardian",
      "Financial Times",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "www.theguardian.com",
      "www.ft.com"
    ],
    "snippets": [
      "Trump has targeted the Federal Reserve and its chairman, Jerome Powell, as he pressures the central bank to slash interest rates.",
      "Trump had called on central banker to step down after his ally accused her of falsifying mortgage documents",
      "<p>Lisa Cook, first Black woman to sit on Fed board, responds after allegation by ally of president of mortgage fraud</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/live/2025/aug/20/tulsi-gabbard-security-clearance-donald-trump-administration-us-politics-latest-updates\">US politics live "
    ],
    "image_url": "",
    "titles": [
      "Fed's Cook says she will not be 'bullied' into resigning after Trump official accuses her of mortgage fraud",
      "Fed governor Lisa Cook says she will not be ‘bullied’ into resigning",
      "Fed governor urged by Trump to resign will not be ‘bullied’ into stepping down"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.93,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.737,
    "summary": "Former President Trump has criticized the Federal Reserve and its chairman, Jerome Powell, urging the central bank to lower interest rates. Additionally, Trump has called for the resignation of central banker Lisa Cook, the first Black woman on the Fed board, after an ally of his accused her of mortgage fraud. Cook has responded to these allegations, though details of her response were not provided in the summary content.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic",
    "image": {
      "src": "icons/briefcase.svg",
      "thumbnail": "icons/briefcase.svg",
      "alt": "business",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Google Unveils Pixel 10 Updates with Advanced AI and Three-Camera System",
    "domain": "technology",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Wed, 20 Aug 2025 16:00:01 GMT",
    "source": "CNBC",
    "sources": [
      "The Guardian",
      "TechCrunch",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "techcrunch.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "The newest series prominently feature the Gemini assistant as AI increasingly becomes the battleground where device companies compete.",
      "<p>Gemini’s new Magic Cue feature allows chatbot to scan digital life and pull up relevant information</p><p>Google’s latest Gemini AI upgrades attempt to anticipate what useful information you made need from your life to address a potential issue, make you to better photographer or become your pers",
      "Google is improving the base Pixel offering by introducing a three-rear-camera system to the Pixel 10.",
      "Google's updates to the Pixel 10 line allow it to showcase what its latest AI technology can do when enhanced by the Tensor G5 processor, an upgrade to the company's custom silicon designed for the AI experience.",
      "Pixel Journal is a new journaling app from Google that uses on-device AI to suggest writing prompts.",
      "The tech giant says the new personal health coach is a fitness trainer, sleep coach, and wellness advisor all in one."
    ],
    "image_url": "",
    "titles": [
      "Google announces its AI-powered Pixel 10 smartphone series",
      "Google launches Pixel 10 with AI tools that anticipate users’ needs",
      "Google launches the Pixel 10 series,  base model now has three cameras",
      "Google doubles down on ‘AI phones’ with its Pixel 10 series",
      "Google launches a new Pixel Journal app",
      "Google announces new AI-powered personal health and fitness coach for Fitbit"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.825,
      "consensus": 0.789,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.729,
    "summary": "Google has launched updates for its Pixel 10 line, introducing a three-rear-camera system and showcasing its latest AI technology, including the Gemini assistant with features like Magic Cue. The upgrades are powered by the new Tensor G5 processor, enhancing the AI experience. Additionally, Google introduced Pixel Journal, an app using on-device AI for writing prompts, and a new personal health coach, combining a fitness trainer, sleep coach, and wellness advisor. These innovations highlight Google's focus on integrating AI into its devices to improve user experience and compete in the device ",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: improve, innovation",
    "constructiveness_source": "heuristic",
    "image": {
      "src": "icons/robot.svg",
      "thumbnail": "icons/robot.svg",
      "alt": "ai",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Israel Approves Major Settlement Expansion in West Bank's E1 Area",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-08-20T13:40:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "New York Times",
      "Deutsche Welle",
      "The Guardian"
    ],
    "domains": [
      "www.nytimes.com",
      "www.theguardian.com",
      "www.dw.com"
    ],
    "snippets": [
      "The plan aims to enlarge an Israeli settlement by building thousands of new apartments in the West Bank. Critics say this would essentially split the Palestinian territory and make any two-state solution untenable.",
      "<p>Construction would be ‘flagrant breach of international law’ and undermine two-state solution, foreign secretary says</p><p>Israel has announced it is expanding its military operations in Gaza City, as the UK foreign secretary, David Lammy, condemned its approval of a huge new illegal settlement ",
      "The long-stalled project near Jerusalem, known as E1, further fragments West Bank lands envisioned as part of a Palestinian state, advancing a goal of Israeli hard-liners."
    ],
    "image_url": "",
    "titles": [
      "Israel approves controversial West Bank settlement plan",
      "Israel expands Gaza City offensive as UK decries West Bank settlement approval",
      "Israel Approves Settlements, a Blow to Faded Hopes for a Palestinian State"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.802,
      "consensus": 0.789,
      "constructiveness": 0.095,
      "proximity": 0.5
    },
    "score": 0.714,
    "summary": "Israel has granted final approval for a significant settlement expansion in the E1 area of the occupied West Bank, planning to build thousands of new apartments. This development is controversial because it is located in a critical area that connects Bethlehem and Ramallah, and critics argue it could split Palestinian territory in two, undermining the feasibility of a two-state solution. This move has drawn criticism from Palestinians and human rights groups, who believe it could jeopardize the prospects for a future Palestinian state.",
    "constructiveness_score": 0.095,
    "constructiveness_reason": "2 constructive keywords out of 84 tokens",
    "constructiveness_source": "heuristic",
    "image": {
      "src": "icons/israel.svg",
      "thumbnail": "icons/israel.svg",
      "alt": "israel flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Bright Meteor Lights Up Night Sky Over Southern Japan",
    "domain": "general",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Wed, 20 Aug 2025 08:12:18 -0400",
    "source": "ABC News",
    "sources": [
      "ABC News",
      "Washington Post",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "abcnews.go.com",
      "www.washingtonpost.com"
    ],
    "snippets": [
      "A fireball was caught on multiple cameras lighting up the night skies in southern Japan on Tuesday evening.",
      "<p>Flash of light visible for hundreds of miles was an exceptionally bright meteor, say experts</p><p>A huge fireball dashed across the skies of western Japan, shocking residents and dazzling stargazers, though experts said it was a natural phenomenon and not an alien invasion.</p><p>Videos and phot",
      "The fireball, widely believed to be an exceptionally bright meteor, shot through the sky just after 11 p.m., turning the sky bright white for a moment."
    ],
    "image_url": "https://s.abcnews.com/images/International/250820_abc_social_japan_hpMain_4x3_384.jpg",
    "titles": [
      "WATCH:  Fireball streaks through skies over Japan",
      "Fireball lights up sky over western Japan",
      "Spectacular fireball streaks across western Japan, lighting up night sky"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.778,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.692,
    "summary": "A fireball, identified as an exceptionally bright meteor by experts, illuminated the night skies in southern Japan on Tuesday evening, shortly after 11 p.m. The phenomenon, captured by multiple cameras, turned the sky bright white momentarily, causing excitement and shock among residents and stargazers. Despite the spectacle, experts confirmed it as a natural occurrence, dismissing any speculation of an alien invasion. The flash of light was visible for hundreds of miles, highlighting the meteor's significant brightness and impact.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 80 tokens",
    "constructiveness_source": "heuristic",
    "image": {
      "src": "icons/japan.svg",
      "thumbnail": "icons/japan.svg",
      "alt": "japan flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Jets Hold Secret Practice with Coach Glenn, No Media or Assistants Present",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Wed, 20 Aug 2025 19:52:08 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "The Jets held a clandestine practice Sunday. There were no media present. There were no assistant coaches, either. It was just coach Aaron Glenn and the players.",
      "Only the players and coach Aaron Glenn were present"
    ],
    "image_url": "",
    "titles": [
      "Jets held secret player-led practice on Sunday",
      "Why Jets held secretive players-only practice after lopsided preseason loss to Giants"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.992,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.678,
    "summary": "The New York Jets conducted a secretive practice on Sunday with only coach Aaron Glenn and players present. No media or assistant coaches were in attendance. The purpose and details of the practice remain undisclosed.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Russia Demands Inclusion in Ukraine Security Talks, Criticizes Europe",
    "domain": "business",
    "source_domain": "www.ft.com",
    "location": "global",
    "published": "Wed, 20 Aug 2025 21:25:46 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.ft.com"
    ],
    "snippets": [
      "Demand from foreign minister Sergei Lavrov would give Moscow an effective veto over efforts to defend Kyiv",
      "<p>Foreign minister Sergei Lavrov dismisses European diplomacy as ‘clumsy effort to sway Trump’</p><p>Moscow has said it must be part of any international talks on Ukraine’s security, as Russia continues to stall on Donald Trump’s push for a meeting between Vladimir Putin and Volodymyr Zelenskyy.</p"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F07683a77-b4c8-4018-8fcd-36e2422bffdf.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Russia says it must be included in any Ukraine security guarantees",
      "Russia says it must be part of international talks on Ukraine’s security"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.924,
      "consensus": 0.591,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.674,
    "summary": "Russia insists on being included in international discussions regarding Ukraine's security. Foreign Minister Sergei Lavrov criticized European diplomatic efforts as ineffective and aimed at influencing Donald Trump. This stance could potentially give Moscow a veto over actions to support Kyiv amidst ongoing delays in arranging a meeting between Presidents Vladimir Putin and Volodymyr Zelenskyy.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: effort, support",
    "constructiveness_source": "heuristic",
    "image": {
      "src": "icons/ukraine.svg",
      "thumbnail": "icons/ukraine.svg",
      "alt": "ukraine flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Trump Aims to Mediate End to Russia-Ukraine Conflict",
    "domain": "general",
    "source_domain": "www.washingtonpost.com",
    "location": "global",
    "published": "Wed, 20 Aug 2025 23:31:21 +0000",
    "source": "Washington Post",
    "sources": [
      "New York Times",
      "Washington Post"
    ],
    "domains": [
      "www.nytimes.com",
      "www.washingtonpost.com"
    ],
    "snippets": [
      "As Trump pushes for a peace deal to end Russia’s invasion of Ukraine, he says he has ended a growing list of conflicts. In some of them, his role remains contested.",
      "President Trump has cast himself as a global peacemaker. His interventions have calmed some conflicts, while in others his role is less clear."
    ],
    "image_url": "",
    "titles": [
      "Trump says he has ‘solved’ 7 conflicts. Here’s what to know about them.",
      "Trump Says He’s Ended 6 (or 7) Wars. Here’s Some Context."
    ],
    "score_components": {
      "magnitude": 0.795,
      "recency": 0.985,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.673,
    "summary": "Former President Trump has positioned himself as a mediator aiming to conclude Russia's invasion of Ukraine, claiming to have resolved numerous conflicts globally. While his involvement has reportedly led to de-escalation in some cases, the extent and impact of his role in others remain disputed.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic",
    "image": {
      "src": "icons/ukraine.svg",
      "thumbnail": "icons/ukraine.svg",
      "alt": "ukraine flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Texas House Passes GOP Maps, May Flip 5 Seats; White House Joins TikTok",
    "domain": "general",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Wed, 20 Aug 2025 19:32:44 -0400",
    "source": "ABC News",
    "sources": [
      "ABC News",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "abcnews.go.com"
    ],
    "snippets": [
      "After a long day of debate, the Texas House of Representatives passed GOP-favored congressional maps Wednesday evening that could flip five Democratic districts.",
      "<p>The new Texas map – which now heads to the state senate, where it is expected to pass – could give Republicans five new US House seats in 2026</p><p><strong>The White House launched an official TikTok account on Tuesday, as <a href=\"https://www.theguardian.com/us-news/donaldtrump\">Donald Trump</a"
    ],
    "image_url": "https://s.abcnews.com/images/US/texas-7-rt-gmh-250820_1755714143016_hpMain_4x3t_384.jpg",
    "titles": [
      "Texas House passes new GOP-friendly congressional maps",
      "Texas house passes Republican-drawn gerrymandered congressional map after weeks of protest – live updates"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.986,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.662,
    "summary": "The Texas House of Representatives approved new GOP-favored congressional maps, potentially flipping five Democratic districts to Republican. These maps are now moving to the state senate, where they are expected to pass, potentially giving Republicans five new US House seats by 2026. In a separate development, the White House launched its official TikTok account on Tuesday.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic",
    "image": {
      "src": "icons/newspaper.svg",
      "thumbnail": "icons/newspaper.svg",
      "alt": "general",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "SportsLine Releases Top Parlay Predictions for 2025 College Football Week 0",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Wed, 20 Aug 2025 23:23:23 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sports Illustrated"
    ],
    "domains": [
      "www.cbssports.com",
      "news.google.com"
    ],
    "snippets": [
      "The SportsLine Projection Model has released its top parlay for Week 0 of the 2025 college football season",
      "<a href=\"https://news.google.com/rss/articles/CBMijAFBVV95cUxOaVJmTDdFY1FhdFZGWDZJUGo0QllTME5MUWU4VVItR29GNl83dEVsdlY3YllHOGI2UmZSUlU2Ml9XSEk0X1FIek8wTC1Vc1Z0RUV6b1FzRkxvZmlZdVNzQ0U3Wk9XWFFpa25hUVlHNXdoNWNlY3gzcld4V0VmRm1LREZLRXlHT1pYaGJVYg?oc=5\" target=\"_blank\">2025 College Football Preseason Bowl "
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/08/18/3304753d-df00-463f-8f0b-50bc32fd202c/rocco-becht-imagn.jpg",
    "titles": [
      "College football odds, picks, predictions: Proven model reveals top 2025 Week 0 parlay",
      "2025 College Football Preseason Bowl Predictions - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.983,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.662,
    "summary": "The SportsLine Projection Model has released its top parlay predictions for Week 0 of the 2025 college football season. This announcement provides bettors with insights and forecasts for upcoming games as the season kicks off. The model, known for its accuracy in sports predictions, aims to guide sports enthusiasts with its projections. The outcome or effectiveness of these predictions will become clear as the season progresses.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: progress",
    "constructiveness_source": "heuristic",
    "image": {
      "src": "icons/football.svg",
      "thumbnail": "icons/football.svg",
      "alt": "football",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "NASA Study Suggests Ceres May Have Supported Microbial Life",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Wed, 20 Aug 2025 16:56:03 EDT",
    "source": "Phys.org",
    "sources": [
      "NASA",
      "Phys.org"
    ],
    "domains": [
      "www.nasa.gov",
      "phys.org"
    ],
    "snippets": [
      "New NASA research has found that Ceres may have had a lasting source of chemical energy: the right types of molecules needed to fuel some microbial metabolisms. Although there is no evidence that microorganisms ever existed on Ceres, the finding supports theories that this intriguing dwarf planet, w",
      "The dwarf planet is cold now, but new research paints a picture of Ceres hosting a deep, long-lived energy source that may have maintained habitable conditions in the past. New NASA research has found that Ceres may have had a lasting source of chemical energy: the right types of molecules needed to"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/the-planet-ceres-may-h.jpg",
    "titles": [
      "Ceres may have had long-standing energy to fuel habitability",
      "NASA: Ceres May Have Had Long-Standing Energy to Fuel Habitability"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.934,
      "consensus": 0.591,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.662,
    "summary": "NASA's new research suggests that Ceres, a dwarf planet, may have had a lasting source of chemical energy capable of supporting microbial life by providing the necessary molecules for some microbial metabolisms. While there is no evidence of microorganisms ever living on Ceres, the findings indicate that it might have maintained conditions suitable for habitability in the past due to a deep, long-lived energy source.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: research, support",
    "constructiveness_source": "heuristic",
    "image": {
      "src": "icons/telescope.svg",
      "thumbnail": "icons/telescope.svg",
      "alt": "nasa",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Israel Begins Assault on Gaza City Amid Famine, Faces Global Truce Calls",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Wed, 20 Aug 2025 21:16:15 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "The Guardian"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Attacks come as Israeli-induced famine grips the besieged Strip amid calls for Israel to accept a mediated truce.",
      "Israel says it has begun the first stages of its planned assault to seize Gaza City.",
      "<p>This blog is now closed, you can read more on this story <a href=\"https://www.theguardian.com/world/2025/aug/20/israel-is-killing-prospect-of-peace-in-the-middle-east-says-jordans-foreign-minister\">here</a></p><p><strong>Israel is “killing all prospects” for peace in the Middle East, Jordan’s for"
    ],
    "image_url": "",
    "titles": [
      "Israel pounds Gaza, killing 81, as it begins assault to seize Gaza City",
      "Israel begins planned Gaza City assault as it calls up 60,000 reservists",
      "Israel to call up around 60,000 reservists before planned offensive on Gaza City, says Israeli military official – as it happened"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.94,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.66,
    "summary": "Israel has initiated the first steps of its assault to capture Gaza City amidst a famine in the Strip, attributed to Israeli actions. Concurrently, there are international calls for Israel to agree to a mediated truce. The situation has escalated tensions in the Middle East, with Jordan's Foreign Minister accusing Israel of undermining peace prospects. The ongoing conflict and its developments are covered in further detail in external sources.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic",
    "image": {
      "src": "icons/israel.svg",
      "thumbnail": "icons/israel.svg",
      "alt": "israel flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Vikings Trade Harrison Phillips to Jets in Pick Exchange Deal",
    "domain": "sports",
    "source_domain": "www.nbcsports.com",
    "location": "national",
    "published": "Wed, 20 Aug 2025 23:42:01 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Sportsnet",
      "Yahoo Sports"
    ],
    "domains": [
      "www.twincities.com",
      "www.sportsnet.ca",
      "www.nbcsports.com"
    ],
    "snippets": [
      "The Vikings traded defensive tackle Harrison Phillips and a 2027 seventh-round pick to the Jets on Wednesday, according to multiple reports.",
      "In a stunning move, the Vikings have agreed to trade veteran defensive tackle Harrison Phillips to the New York Jets, a source confirmed to the Pioneer Press. In exchange, the Vikings will get a 2026 sixth-round pick and a 2027 seventh-round pick. To complete the deal the Vikings will also flip a 20",
      "<p>The New York Jets have agreed to terms on a trade for veteran nose tackle Harrison Phillips from the Minnesota Vikings on Wednesday night to bolster their defensive line, a person familiar with the deal told The Associated Press.</p>"
    ],
    "image_url": "",
    "titles": [
      "Jets acquire DT Harrison Phillips in a trade with the Vikings",
      "Vikings trade veteran DT Phillips to Jets",
      "AP Source: Jets trade for veteran nose tackle Harrison Phillips from Vikings"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.989,
      "consensus": 0.611,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.658,
    "summary": "The Minnesota Vikings traded defensive tackle Harrison Phillips and a 2027 seventh-round pick to the New York Jets. In return, the Vikings received a 2026 sixth-round pick and a 2027 seventh-round pick. This trade, confirmed by multiple sources, aims to bolster the Jets' defensive line.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Court Temporarily Halts Deportation Protections for Nepali, Honduran, Nicaraguan",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Wed, 20 Aug 2025 22:19:57 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "The Guardian"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Appeals court pauses an order that had protected status for Nepalese, Hondurans and Nicaraguans.",
      "<p>Administration officials given legal right to move towards deportation of people from Nepal, Honduras and Nicaragua</p><p>A federal appeals court on Wednesday sided with the Trump administration and halted for now a <a href=\"https://www.theguardian.com/us-news/2025/aug/01/judge-tps-temporary-prot"
    ],
    "image_url": "",
    "titles": [
      "US court allows Trump to end temporary protections for 60,000 migrants",
      "US court allows Trump officials to end protected status for 60,000 migrants"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.961,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.657,
    "summary": "A federal appeals court has temporarily halted an order that protected individuals from Nepal, Honduras, and Nicaragua from deportation. This decision allows Trump administration officials to proceed with deportation plans for people from these countries. The current status is a pause on the protective order, pending further legal actions.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic",
    "image": {
      "src": "icons/newspaper.svg",
      "thumbnail": "icons/newspaper.svg",
      "alt": "general",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Messick Shines in MLB Debut Despite Guardians' Extra-Inning Loss",
    "domain": "sports",
    "source_domain": "www.beaconjournal.com",
    "location": "national",
    "published": "Wed, 20 Aug 2025 23:53:10 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Forbes",
      "Yahoo Sports"
    ],
    "domains": [
      "www.beaconjournal.com",
      "www.forbes.com"
    ],
    "snippets": [
      "Guardians prospect Parker Messick shined in his MLB debut on the mound, but the Cleveland bullpen let him down in an extra-inning loss.",
      "Cleveland Guardians newly promoted left-handed starter, Parker Messick had an outstanding debut against the Arizona Diamondbacks."
    ],
    "image_url": "",
    "titles": [
      "Guardians score vs Diamondbacks | Cleveland loses in extras in Parker Messick's MLB debut",
      "MLB Prospect Scouting Report On Cleveland Guardians’ Parker Messick"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.993,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.654,
    "summary": "Parker Messick, a newly promoted left-handed starter for the Cleveland Guardians, had an impressive debut in Major League Baseball against the Arizona Diamondbacks. Despite his strong performance on the mound, the Guardians' bullpen struggled, leading to the team's defeat in extra innings.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic",
    "image": {
      "src": "icons/baseball.svg",
      "thumbnail": "icons/baseball.svg",
      "alt": "mlb",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Democrats End Walkout, Contested Map Advances to State Senate",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Wed, 20 Aug 2025 23:12:29 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "The Guardian"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Vote was held after Democrats returned from two-week walkout to block passage.",
      "<p>Redrawn map fiercely opposed by Democrats now moves to state senate, where it is expected to pass</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/live/2025/aug/20/tulsi-gabbard-security-clearance-donald-trump-administration-us-politics-latest-updates\">US politics – live updates</a></p>"
    ],
    "image_url": "",
    "titles": [
      "Texas Republicans approve controversial Trump-backed congressional map",
      "Texas Republicans pass gerrymandered congressional map requested by Trump"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.979,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.651,
    "summary": "Democrats returned from a two-week walkout to block the passage of a redrawn map, which was fiercely opposed by them. A vote was held, and the map is now moving to the state senate, where it is anticipated to pass. The outcome of the vote indicates that the map is likely to advance despite Democratic opposition.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic",
    "image": {
      "src": "icons/newspaper.svg",
      "thumbnail": "icons/newspaper.svg",
      "alt": "general",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Trump Supports CHIPS Act to Enhance US Semiconductor Production",
    "domain": "technology",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Wed, 20 Aug 2025 19:00:48 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Ars Technica",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "arstechnica.com"
    ],
    "snippets": [
      "The new stake in the tech giant aims to increase US semiconductor chip production.",
      "Trump vowed to kill CHIPS Act. Instead, he’s found a way to salvage it."
    ],
    "image_url": "",
    "titles": [
      "US Senator Bernie Sanders backs Trump plan for government stake in Intel",
      "Trump confirms US is seeking 10% stake in Intel. Bernie Sanders approves."
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.897,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.651,
    "summary": "The new investment in a major technology company is designed to boost semiconductor chip production in the United States. Despite initially opposing the CHIPS Act, former President Donald Trump has shifted his stance and is now working to support the legislation's objectives.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic",
    "image": {
      "src": "icons/usa.svg",
      "thumbnail": "icons/usa.svg",
      "alt": "us flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "New Data from Australia Enhances Understanding of 'Hand of God' Nebula",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Wed, 20 Aug 2025 17:05:03 EDT",
    "source": "Phys.org",
    "sources": [
      "NASA",
      "Phys.org"
    ],
    "domains": [
      "www.nasa.gov",
      "phys.org"
    ],
    "snippets": [
      "In 2009, NASA's Chandra X-ray Observatory released a captivating image: a pulsar and its surrounding nebula that is shaped like a hand. Since then, astronomers have used Chandra and other telescopes to continue to observe this object. Now, new radio data from the Australia Telescope Compact Array (A",
      "In 2009, NASA’s Chandra X-ray Observatory released a captivating image: a pulsar and its surrounding nebula that is shaped like a hand. Since then, astronomers have used Chandra and other telescopes to continue to observe this object. Now, new radio data from the Australia Telescope Compact Array (A"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/x-ray-and-radio-go-han.jpg",
    "titles": [
      "Astronomers combine X-ray and radio data to map pulsar 'hand' nebula",
      "X-ray and Radio go ‘Hand in Hand’ in New Image"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.936,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.642,
    "summary": "In 2009, NASA's Chandra X-ray Observatory unveiled an image of a pulsar and its nebula, resembling a hand. Continuous observations have been made using Chandra and other telescopes. Recently, the Australia Telescope Compact Array provided new radio data on this celestial object, enhancing our understanding of its structure and properties.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic",
    "image": {
      "src": "icons/australia.svg",
      "thumbnail": "icons/australia.svg",
      "alt": "australia flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Judge: Vast Epstein Files Could Be Public Amid Trump Scrutiny",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Wed, 20 Aug 2025 18:57:03 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "CNBC"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "Federal judge says government already has bounty of documents and material regarding Epstein that it could release.",
      "The request for grand jury records came as President Donald Trump came under pressure from supporters and critics alike over his handling of the Epstein files."
    ],
    "image_url": "",
    "titles": [
      "US judge denies bid to unseal Epstein grand jury records",
      "Judge calls Trump DOJ's request to release Epstein grand jury records a 'diversion'"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.896,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.641,
    "summary": "A federal judge stated that the government possesses a significant amount of documents and materials related to Epstein that could be made public. This statement was made amid requests for grand jury records, as President Donald Trump faced scrutiny from both supporters and critics regarding his management of the Epstein files.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic",
    "image": {
      "src": "icons/briefcase.svg",
      "thumbnail": "icons/briefcase.svg",
      "alt": "business",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Fed Officials Prioritize Inflation Over Job Loss Concerns",
    "domain": "business",
    "source_domain": "www.ft.com",
    "location": "global",
    "published": "Wed, 20 Aug 2025 18:52:57 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times",
      "Fortune"
    ],
    "domains": [
      "fortune.com",
      "www.ft.com"
    ],
    "snippets": [
      "‘Some’ members of policy setting board noted that it is inappropriate to wait for clarity before cutting rates",
      "Most Federal Reserve officials said last month that the threat of higher inflation was a greater concern than the potential for job losses."
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F05eeaf63-2832-47d0-91c3-f0f547d39497.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Fed minutes highlight split over effects of Trump’s tariffs on inflation",
      "Fed minutes reveal concern over ‘the effects of higher tariffs’ as central bank left rates unchanged"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.876,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.637,
    "summary": "Most Federal Reserve officials, in their last meeting, expressed that the risk of escalating inflation outweighs the concern over potential job losses. They highlighted the importance of addressing inflation promptly rather than delaying rate cuts until there is more clarity.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic",
    "image": {
      "src": "icons/banknotes.svg",
      "thumbnail": "icons/banknotes.svg",
      "alt": "inflation",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Trump Buys $100M in Bonds After Second Term Inauguration",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Wed, 20 Aug 2025 18:26:11 GMT",
    "source": "CNBC",
    "sources": [
      "The Guardian",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "The U.S. president has purchased hundreds of bonds issued by companies, local governments and school boards.",
      "<p>Forms posted online show Trump made over 600 financial purchases the day after he was inaugurated for second term</p><p><a href=\"https://www.theguardian.com/us-news/donaldtrump\">Donald Trump</a> has bought more than $100m in company, state and municipal bonds since taking office in January, accor"
    ],
    "image_url": "",
    "titles": [
      "Trump has snapped up more than $100 million in bonds since taking office",
      "Trump has bought more than $100m in bonds while president, disclosure shows"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.868,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.636,
    "summary": "After his inauguration for a second term, U.S. President Donald Trump bought more than $100 million in bonds from companies, state governments, and school boards. Forms made public reveal that Trump made over 600 financial transactions the day following his inauguration, indicating significant post-inauguration investment activities.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic",
    "image": {
      "src": "icons/briefcase.svg",
      "thumbnail": "icons/briefcase.svg",
      "alt": "business",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Target CFO Promotion Sparks Customer Backlash, Shift to Competitors",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Wed, 20 Aug 2025 16:43:25 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "CNBC"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "The promotion of the former CFO was not received well customers have shifted to competitors like Walmart.",
      "Investors are looking for signs that the struggling big-box retailer Target is getting back on track."
    ],
    "image_url": "",
    "titles": [
      "Big box retailer Target names new CEO as business struggles",
      "Target shares tumble as retailer picks new CEO, says sales fell again"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.855,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.626,
    "summary": "The promotion of Target's former CFO has led to customer dissatisfaction, resulting in some customers switching to competitors such as Walmart. Investors are now closely monitoring Target for any signs of improvement or recovery from its current struggles.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic",
    "image": {
      "src": "icons/briefcase.svg",
      "thumbnail": "icons/briefcase.svg",
      "alt": "business",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Pixel 10 Series Unveils Gearless Hinge, Drops SIM Card Slot",
    "domain": "technology",
    "source_domain": "techcrunch.com",
    "location": "global",
    "published": "Wed, 20 Aug 2025 16:00:00 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch",
      "Ars Technica"
    ],
    "domains": [
      "arstechnica.com",
      "techcrunch.com"
    ],
    "snippets": [
      "The phone's new gearless hinge allows for a larger outer display with smaller bezels, and the hinge is two times more durable than the one on the Pixel 9 Pro Fold.",
      "The Pixel 10 series arrives with a power upgrade but no SIM card slot."
    ],
    "image_url": "",
    "titles": [
      "Google unveils its $1,799 Pixel 10 Pro Fold",
      "Google unveils Pixel 10 series with improved Tensor G5 chip and a boatload of AI"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.842,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.623,
    "summary": "The Pixel 10 series features a gearless hinge for a larger outer display and improved durability compared to the Pixel 9 Pro Fold. The new phones offer a power upgrade but lack a SIM card slot.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "UK Government Considers Implementing 'Mansion Tax' for Revenue Boost",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 20 Aug 2025 15:45:29 GMT",
    "source": "BBC",
    "sources": [
      "Financial Times",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.ft.com"
    ],
    "snippets": [
      "Reports suggest the government is considering shaking up the property tax system to raise revenue.",
      "UK chancellor examines case for a ‘mansion tax’ that would be technically workable but politically combustible"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/c9e1/live/23085c10-7dad-11f0-abdc-59614a74b023.jpg",
    "titles": [
      "What are Rachel Reeves' options on property tax?",
      "What are Rachel Reeves’ options for raising property taxes?"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.821,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.619,
    "summary": "The government is reportedly exploring changes to the property tax system to increase revenue. The UK chancellor is looking into the feasibility of implementing a 'mansion tax,' which is seen as technically feasible but could face political challenges. The outcome of these considerations is still pending.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic",
    "image": {
      "src": "icons/uk.svg",
      "thumbnail": "icons/uk.svg",
      "alt": "uk flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Google Unveils Pixel 10 and Gemini at Made by Google 2025 Event",
    "domain": "technology",
    "source_domain": "techcrunch.com",
    "location": "global",
    "published": "Wed, 20 Aug 2025 18:48:20 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com"
    ],
    "snippets": [
      "Dive into what we can expect from the Made by Google 2025 event, where the tech giant will debut its Pixel 10 lineup.",
      "Google Gemini was the star yet again at this year's hardware event, brining new features to the second-gen Pixel Buds A-Series and Pro 2."
    ],
    "image_url": "",
    "titles": [
      "Pixel 10, new Gemini features, the Pixel Watch, and everything else announced at the Made by Google 2025 event",
      "Google brings improved Gemini features to its new Pixel Buds"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.893,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.447,
    "summary": "At the Made by Google 2025 event, Google introduced its Pixel 10 lineup alongside showcasing the Google Gemini, which brought new features to the second-gen Pixel Buds A-Series and Pro 2. This event highlighted Google's latest advancements in hardware.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "UCSF Scientists Identify Protein Linked to Brain Aging, Potential Treatment Path",
    "domain": "science",
    "source_domain": "www.sciencedaily.com",
    "location": "global",
    "published": "Wed, 20 Aug 2025 11:27:58 EDT",
    "source": "ScienceDaily",
    "sources": [
      "ScienceDaily"
    ],
    "domains": [
      "www.sciencedaily.com"
    ],
    "snippets": [
      "Scientists at UCSF have uncovered a surprising culprit behind brain aging: a protein called FTL1. In mice, too much FTL1 caused memory loss, weaker brain connections, and sluggish cells. But when researchers blocked it, the animals regained youthful brain function and sharp memory. The discovery sug",
      "Researchers discovered two brain regions that work as a “neural compass,” keeping people oriented in virtual city navigation. These areas tracked direction consistently, hinting at new ways to detect and monitor neurological disorders that cause disorientation."
    ],
    "image_url": "",
    "titles": [
      "Scientists just found a protein that reverses brain aging",
      "Scientists just found the brain’s secret GPS system"
    ],
    "score_components": {
      "magnitude": 0.393,
      "recency": 0.833,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.442,
    "summary": "Scientists at UCSF identified a protein, FTL1, as a key factor in brain aging, causing memory loss and weaker brain connections in mice. Blocking FTL1 reversed these effects, suggesting a potential target for treating age-related cognitive decline. Additionally, researchers found two brain regions acting as a \"neural compass\" for orientation in virtual environments. This discovery could lead to new methods for diagnosing and monitoring neurological disorders that impair navigational skills.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 71 tokens",
    "constructiveness_source": "heuristic",
    "image": {
      "src": "icons/beaker.svg",
      "thumbnail": "icons/beaker.svg",
      "alt": "science",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  }
]