[
  {
    "title": "Bride Honors Great Grandfather with Vintage Recording at Wedding",
    "domain": "general",
    "location": "national",
    "published": "Wed, 18 Jun 2025 20:42:58 -0400",
    "source": "ABC News",
    "sources": [
      "ABC News"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "David Muir reports on the woman who found an old recording of her great grandfather singing decided to save the music for just the right moment – years later during her father-daughter dance."
    ],
    "image_url": "https://s.abcnews.com/images/WNT/250618_wn_ender_hpMain_4x3_384.jpg",
    "titles": [
      "WATCH:  Daughter surprises dad on wedding day with recording of great grandfather singing"
    ],
    "summary": "A woman discovered an old recording of her great grandfather singing and preserved it for a special occasion. She chose to use this recording during the father-daughter dance at her wedding, creating a memorable moment. David Muir reported on this unique story, highlighting the sentimental value of the recording and its impact on the family's celebration.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "While this story is heartwarming and provides some awareness about the importance of family heritage and sentimentality, it doesn't offer any actionable insights, solutions, or deeper understanding of a broader issue. It is a human interest story with limited depth or insight.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.614,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.315
  },
  {
    "title": "Australia Bolsters Diplomatic Presence in Iran, Expands to Azerbaijan",
    "domain": "general",
    "location": "global",
    "published": "Thu, 19 Jun 2025 23:49:24 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "<p>Foreign affairs minister says Australian ambassador to Iran to remain in region and consular staff will be deployed to Azerbaijan . Follow today’s news live</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.com/w4u7jx3\">free app</a> or <a href=\"https://www.theguardian.com/australia-news/series/full-story?CMP=cvau_sfl\">daily news podcast</a></p></li></ul><p><strong>Bragg says ‘better value’ for taxpayers if Coalition part of Chalmers’ productivity roundtable</strong></p><p><strong>Andrew..."
    ],
    "image_url": "https://i.guim.co.uk/img/media/fed24f9c2888177700b385cf353d84b866d09667/545_0_5453_4362/master/5453.jpg?width=140&quality=85&auto=format&fit=max&s=d3e2df78743a9a6fe479625697c9cf23",
    "titles": [
      "Australia news live: Penny Wong announces suspension of Tehran embassy and orders officials to leave Iran; Coalition urges PM to visit Nato summit"
    ],
    "summary": "The Australian Foreign Affairs Minister announced that the Australian ambassador to Iran will stay in the region, and consular staff are set to be deployed to Azerbaijan. This development is part of Australia's ongoing diplomatic efforts in the area. Additionally, there was a mention of a productivity roundtable discussion, suggesting involvement could offer better value for taxpayers, according to Bragg.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful information about Australia's diplomatic strategies and their implications. It gives readers an understanding of international relations and the potential benefits of diplomatic presence. However, it doesn't fully highlight progress or solutions, but it does report on attempts to improve diplomatic relations.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.993,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.448
  },
  {
    "title": "Thai PM Apologizes for Leaked Call with Hun Sen, Eases Diplomatic Tension",
    "domain": "general",
    "location": "global",
    "published": "Thu, 19 Jun 2025 23:46:03 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "<p>In the phone call, Thai prime minister Paetongtarn Shinawatra discusses a border dispute with former Cambodian leader and calls him ‘uncle’</p><p><a href=\"https://www.theguardian.com/world/thailand\">Thailand’</a>s prime minister, <a href=\"https://www.theguardian.com/world/article/2024/aug/16/paetongtarn-shinawatra-thailand-pm-replacement-voting-thaksin-shinawatra\">Paetongtarn Shinawatra</a>, apologised on Thursday for a leaked phone call with former <a href=\"https://www.theguardian.com/world/cambodia\">Cambodian </a>leader Hun Sen that provoked widespread anger and threatened to break up..."
    ],
    "image_url": "https://i.guim.co.uk/img/media/5d565f107d94399209adb987a297c8d9c6ec944e/117_0_2147_1718/master/2147.jpg?width=140&quality=85&auto=format&fit=max&s=40afd6a4cabf888cc80dd8c700e62ce9",
    "titles": [
      "Thai PM apologises over leaked call with Hun Sen as crisis threatens to topple government"
    ],
    "summary": "Thai Prime Minister Paetongtarn Shinawatra apologized for a leaked phone call with former Cambodian leader Hun Sen, where she referred to him as 'uncle.' The conversation, which included discussions on a border dispute, sparked widespread anger and threatened diplomatic relations between Thailand and Cambodia.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs readers about a specific diplomatic incident and its resolution, contributing to an understanding of the dynamics between Thailand and Cambodia. However, it doesn't provide broader insights or solutions, and the focus is more on the controversy than on the resolution or its implications.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.992,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.427
  },
  {
    "title": "Manitoba Faces Rising Pest Threats Amid Warmer Temperatures",
    "domain": "general",
    "location": "national",
    "published": "Thu, 19 Jun 2025 23:41:31 +0000",
    "source": "Global News",
    "sources": [
      "Global News"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "As temperatures rise in Manitoba, so does the risk from pests. Experts warn that pests are growing across the province, bringing a greater threat of lyme disease and more."
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2024/03/GettyImages-1396392842.jpg?quality=85&strip=all",
    "titles": [
      "Manitoba seeing more ticks, mosquitoes due to warmer weather, experts warn"
    ],
    "summary": "In Manitoba, rising temperatures are leading to an increase in pest populations, heightening the risk of Lyme disease and other pest-related threats, according to experts. This trend underscores the growing concern for public health in the province as warmer conditions continue to favor the proliferation of pests.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story informs readers about the rising pest threats in Manitoba due to warmer temperatures, providing a deeper understanding of the situation. However, it does not offer any solutions or strategies to deal with the problem, nor does it delve into the causes or impacts in detail.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.99,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 1.0
    },
    "score": 0.47
  },
  {
    "title": "Eritrea's Leader Fails to Hold Promised Elections Since 1991",
    "domain": "general",
    "location": "global",
    "published": "Thu, 19 Jun 2025 23:31:31 GMT",
    "source": "BBC",
    "sources": [
      "BBC"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "Isaias Afwerki promised elections when he came to power in 1991 but these have still not been held."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/3d69/live/da554580-42e9-11f0-bace-e1270fc31f5e.jpg",
    "titles": [
      "Three decades, one leader - how Eritreans had their hopes dashed"
    ],
    "summary": "Isaias Afwerki, who became the leader of Eritrea in 1991, had initially promised to conduct elections. However, as of now, these elections have not taken place, leaving the pledge unfulfilled.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about the political situation in Eritrea, but it lacks depth or insight. It does not offer any analysis of the implications of this unfulfilled promise, the reasons behind it, or potential solutions to the issue.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.987,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.396
  },
  {
    "title": "Blue Jays Struggle with Pitching Depth Amid Starter's Slump",
    "domain": "general",
    "location": "national",
    "published": "Thu, 19 Jun 2025 23:17:58 +0000",
    "source": "Global News",
    "sources": [
      "Global News"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "The Toronto Blue Jays' pitching depth is teetering — which makes it a bad time for one of their most reliable starters to be struggling."
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/06/c3660521abd6219ce9297b316abed30c0f61fb398be010260e19c81561f98d09.jpg?quality=85&strip=all",
    "titles": [
      "Gausman’s June struggles continue in Jays’ loss"
    ],
    "summary": "The Toronto Blue Jays are facing challenges with their pitching depth, making it a particularly difficult time for one of their most dependable starters to experience performance issues. This situation adds pressure on the team as they navigate through their current roster challenges.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story provides awareness about the Blue Jays' current struggles with their pitching depth. However, it does not provide actionable insights for the reader or discuss potential solutions for the team's challenges, limiting its overall constructiveness.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.982,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 1.0
    },
    "score": 0.458
  },
  {
    "title": "Michael Adenyi Convicted of First-Degree Murder in 2022 Killing",
    "domain": "general",
    "location": "national",
    "published": "Thu, 19 Jun 2025 23:17:35 +0000",
    "source": "Global News",
    "sources": [
      "Global News"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "Micheal Adenyi was found guilty of first-degree murder in the 2022 death of Vanessa Ladouceur, a verdict that comes with the automatic sentence."
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2022/03/vanessa6.jpg?quality=85&strip=all",
    "titles": [
      "Man found guilty of killing Calgary woman sentenced to life in prison"
    ],
    "summary": "Micheal Adenyi was convicted of first-degree murder for the 2022 killing of Vanessa Ladouceur. This conviction carries an automatic sentence.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story offers basic awareness of a crime and its legal outcome, but it doesn't provide any deeper understanding, actionable insights, or progress in terms of solutions or improvements. The story is purely reactive and doesn't increase clarity around systems, causes, trends, or impacts.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.982,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 1.0
    },
    "score": 0.438
  },
  {
    "title": "Evacuees Share Grievances at Saskatoon Event with NDP MLA McPhail",
    "domain": "general",
    "location": "national",
    "published": "Thu, 19 Jun 2025 23:16:29 +0000",
    "source": "Global News",
    "sources": [
      "Global News"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "At a media event in Saskatoon, evacuees joined Saskatchewan NDP MLA Jordan McPhail to share their stories and frustrations."
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/06/sask-ndp-on-wildfires.jpeg?quality=85&strip=all",
    "titles": [
      "Sask. wildfire evacuees demand government accountability for ‘mismanagement’ of crisis"
    ],
    "summary": "At a media event in Saskatoon, evacuees shared their experiences and grievances, accompanied by Saskatchewan NDP MLA Jordan McPhail. They voiced their stories to highlight the challenges they are facing.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story informs readers about the challenges evacuees are facing and provides some context about their situation. However, it doesn't clearly highlight any solutions or improvements, and it doesn't provide actionable insights for readers.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.982,
      "consensus": 0.393,
      "constructiveness": 0.7,
      "proximity": 1.0
    },
    "score": 0.485
  },
  {
    "title": "Kjeldsen, Gonzalez Tied for Lead at Kaulig Companies Championship",
    "domain": "sports",
    "location": "national",
    "published": "Thu, 19 Jun 2025 23:48:31 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Soren Kjeldsen of Denmark and Ricardo Gonzalez of Argentina each shot 3-under 67 on Firestone South to share the lead Thursday after the opening round of the Kaulig Companies Championship, the third major of the year on the PGA Tour Champions.  Stewart Cink, who lost in a four-hole playoff to Tiger Woods at Firestone in 2006 at a World Golf Championship, was poised to take the lead until two bogeys on his final three holes."
    ],
    "image_url": "",
    "titles": [
      "Gonzalez and Kjeldsen share the lead at Firestone in senior tour major"
    ],
    "summary": "Soren Kjeldsen from Denmark and Ricardo Gonzalez from Argentina are tied for the lead after the first round of the Kaulig Companies Championship, the third major of the PGA Tour Champions, each scoring a 3-under 67 at Firestone South. Stewart Cink was close to leading but fell behind due to two bogeys in his last three holes, finishing the round just behind Kjeldsen and Gonzalez.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about the current standings in a sports event. However, it doesn't offer deeper understanding beyond the scores, nor does it provide actionable insights or progress in terms of solutions or improvements. The story is mainly reactive, reporting on the event's outcomes.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.993,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.41
  },
  {
    "title": "7 Patriots Players Face Pressure Ahead of 2025 Training Camp",
    "domain": "sports",
    "location": "national",
    "published": "Thu, 19 Jun 2025 23:46:24 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Here are the seven New England Patriots players facing the most pressure entering 2025 training camp."
    ],
    "image_url": "",
    "titles": [
      "7 Patriots players under most pressure heading into 2025 training camp"
    ],
    "summary": "Seven New England Patriots players are under significant pressure as they enter the 2025 training camp. This situation highlights the team's focus on performance and improvement, though the specific reasons for the pressure on these players and their individual roles or challenges were not detailed.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about the situation of seven players in the New England Patriots team. However, it lacks depth and insight as it does not detail the specific reasons for the pressure on these players, their individual roles, or their challenges.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.992,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.397
  },
  {
    "title": "Belgian Golfer Scores 14th Sub-60 Round in Korn Ferry Tour History",
    "domain": "sports",
    "location": "national",
    "published": "Thu, 19 Jun 2025 23:46:24 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Adrien Dumont de Chassart of Belgium shot an 11-under 59 on Thursday in the Wichita Open for the 14 sub-60 round in Korn Ferry Tour history.  Dumont de Chassart had 12 birdies and a bogey in the morning round at storm-damaged Crestview Country Club, with players allowed to lift, clean and place their golf balls in the fairways because of wet conditions.  “Honestly, with all the rain and storms that they got, I thought the course was in really good shape,” Dumont de Chassart said."
    ],
    "image_url": "",
    "titles": [
      "Adrien Dumont de Chassart shoots 59 in Wichita Open for 14th sub-60 round in Korn Ferry Tour history"
    ],
    "summary": "Adrien Dumont de Chassart from Belgium scored an 11-under 59 at the Wichita Open, marking the 14th sub-60 round in Korn Ferry Tour history. During the event, held at the storm-damaged Crestview Country Club, Dumont de Chassart achieved 12 birdies and one bogey. The tournament allowed players to lift, clean, and place their balls due to wet conditions, which Dumont de Chassart acknowledged, praising the course's condition despite the weather challenges.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful information and context about a significant achievement in golf. It details the player's performance, the conditions of the tournament, and the player's response to these conditions. However, it does not clearly highlight any progress, solutions, or empowering knowledge.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.992,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.44
  },
  {
    "title": "Rita Benson LeBlanc, Heir to Saints, Arrested in South Carolina",
    "domain": "sports",
    "location": "national",
    "published": "Thu, 19 Jun 2025 23:45:24 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Rita Benson LeBlanc, the one-time presumed successor to her grandfather, Tom Benson, as principal owner of the New Orleans Saints, has been arrested in South Carolina."
    ],
    "image_url": "",
    "titles": [
      "Rita Benson LeBlanc, one-time successor to Tom Benson, is arrested in South Carolina"
    ],
    "summary": "Rita Benson LeBlanc, previously considered the likely successor to her grandfather, Tom Benson, for ownership of the New Orleans Saints, was arrested in South Carolina. The details surrounding the arrest, including charges and circumstances, have not been specified in the provided information.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "The story provides basic awareness about the arrest of Rita Benson LeBlanc but lacks depth and insight. The details surrounding the arrest, including charges and circumstances, are not specified, leaving the reader without actionable insights or a deeper understanding.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.992,
      "consensus": 0.393,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.397
  },
  {
    "title": "Tiger Woods Supports Son at Event; Reese's Gesture Sparks Discussion",
    "domain": "sports",
    "location": "national",
    "published": "Thu, 19 Jun 2025 23:43:29 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Tiger Woods was in attendance of his son's major moment.",
      "Chicago Sky head coach Tyler Marsh spoke about Angel Reese's gesture on Thursday.",
      "All eyes on Angel Reese."
    ],
    "image_url": "",
    "titles": [
      "Heartwarming Tiger Woods News Emerges on Thursday",
      "Chicago Sky Coach Reacts to Angel Reese News on Thursday",
      "Chicago Sky Make Angel Reese Request During Second Season"
    ],
    "summary": "Tiger Woods attended a significant event for his son, marking a notable family moment. Meanwhile, Chicago Sky head coach Tyler Marsh discussed Angel Reese's gesture, which has garnered widespread attention. The focus on Reese suggests her actions have made a significant impact in the sports community.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about the events happening in the sports world, specifically in the lives of Tiger Woods and Angel Reese. However, it lacks depth or insight into why these events are significant or the broader implications they might have.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.991,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.41
  },
  {
    "title": "Chiefs Sign 2 Players After Minicamp, Rookie Williams Impresses",
    "domain": "sports",
    "location": "national",
    "published": "Thu, 19 Jun 2025 23:40:58 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "The Chiefs hosted four tryout players at their mandatory minicamp, and they have signed two.",
      "The Kansas City Chiefs' third-round pick Nohl Williams has impressed in mandatory minicamp after some rough days during voluntary OTAs."
    ],
    "image_url": "",
    "titles": [
      "Chiefs agree to terms with two minicamp tryout players",
      "Struggling Chiefs Rookie Finally Impresses at Mandatory Minicamp"
    ],
    "summary": "The Kansas City Chiefs conducted tryouts for four players during their mandatory minicamp and subsequently signed two of them. Additionally, their third-round pick, Nohl Williams, showcased significant improvement and impressed the team during the mandatory minicamp, following a series of challenging performances during the voluntary OTAs.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful information about the Kansas City Chiefs' recent decisions and player performances. It offers insights into the team's strategy and player development, which could be useful for fans or those interested in the sport.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.99,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.44
  },
  {
    "title": "Cormier Urges UFC to Strip Jones of Title for Avoiding Aspinall Fight",
    "domain": "sports",
    "location": "national",
    "published": "Thu, 19 Jun 2025 23:40:24 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "When it comes to not unifying UFC heavyweight title against Tom Aspinall, Daniel Cormier sees through Jon Jones and says it's time to strip him."
    ],
    "image_url": "",
    "titles": [
      "Daniel Cormier sees right through Jon Jones' lack of interest in Tom Aspinall fight"
    ],
    "summary": "Daniel Cormier has called for Jon Jones to be stripped of his UFC heavyweight title for not agreeing to a unification bout against Tom Aspinall. Cormier criticizes Jones's decision, suggesting it undermines the integrity of the championship.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides context about a controversy in the UFC, offering a deeper understanding of the dynamics and politics within the sport. However, it doesn't provide solutions or progress towards resolving the issue.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.99,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.42
  },
  {
    "title": "Traded Players Vargas and Fedde Face Off in White Sox-Cardinals Game",
    "domain": "sports",
    "location": "national",
    "published": "Thu, 19 Jun 2025 23:40:00 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "CHICAGO — Third baseman Miguel Vargas and starter Erick Fedde are linked as part of last year’s three-team trade. The Sox sent Fedde and outfielder Tommy Pham to the St. Louis Cardinals and got Vargas as part of a package from the Dodgers while sending reliever Michael Kopech to Los Angeles. Vargas faced Fedde in a big spot during Game 1 of Thursday’s doubleheader at Rate Field. The teams were ..."
    ],
    "image_url": "",
    "titles": [
      "White Sox drop 7th straight with 5-4 loss to Cardinals in Game 1 of doubleheader"
    ],
    "summary": "In a significant MLB trade last year, the Chicago White Sox acquired third baseman Miguel Vargas from the Dodgers and sent starter Erick Fedde and outfielder Tommy Pham to the St. Louis Cardinals. Additionally, reliever Michael Kopech was traded to the Dodgers. Vargas and Fedde, both involved in this three-team trade, faced each other in Game 1 of Thursday's doubleheader at Rate Field, marking a notable moment between the traded players.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about a significant moment in Major League Baseball, but it doesn't offer much depth or insight beyond that. It does not provide actionable insights for the reader or report on solutions or improvements. It also doesn't increase clarity around systems, causes, trends, or impacts that matter.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.99,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.41
  },
  {
    "title": "Meta Boosts AI Team with Hiring of Daniel Gross and Nat Friedman",
    "domain": "business",
    "location": "national",
    "published": "Thu, 19 Jun 2025 23:55:12 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Meta plans to hire Safe Superintelligence CEO Daniel Gross and former GitHub Nat Friedman to beef up the company's AI team, according to sources."
    ],
    "image_url": "",
    "titles": [
      "Meta tried to buy Ilya Sutskever's $32 billion AI startup, but is now planning to hire its CEO"
    ],
    "summary": "Meta is set to strengthen its AI team by hiring Daniel Gross, CEO of Safe Superintelligence, and Nat Friedman, former CEO of GitHub. This move, according to sources, is part of the company's effort to enhance its capabilities in artificial intelligence.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story informs readers about Meta's strategic move to enhance its artificial intelligence capabilities, providing useful context about the company's direction. However, it doesn't report on specific solutions or improvements, nor does it offer deeper understanding about the impacts or trends in the AI industry.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.995,
      "consensus": 0.393,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.438
  },
  {
    "title": "Inflation Exceeds Economists' Predictions, Excluding Fresh Food",
    "domain": "business",
    "location": "national",
    "published": "Thu, 19 Jun 2025 23:39:18 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "The figure — which strips out costs for fresh food — was higher compared to expectations from economists polled by Reuters."
    ],
    "image_url": "",
    "titles": [
      "Japan's core inflation hits highest level since January 2023, putting pressure on BOJ to raise rates"
    ],
    "summary": "The reported inflation figure, excluding fresh food costs, surpassed the predictions of economists surveyed by Reuters. This indicates a higher-than-expected increase in prices.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful information about current economic trends, specifically inflation, and how it is exceeding predictions. It increases clarity around the impact of inflation, which matters to readers. However, it doesn't report on solutions or improvements to this issue, and it could provide more depth or insight into the causes and systems behind these trends.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.989,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.447
  },
  {
    "title": "AI-Powered Digital Humans Outperform Real Ones in Sales",
    "domain": "business",
    "location": "national",
    "published": "Thu, 19 Jun 2025 23:20:56 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Digital versions of human beings are now able to sell more than real people can, thanks to artificial intelligence, a recent business collaboration showed."
    ],
    "image_url": "",
    "titles": [
      "AI avatars in China just proved they are better influencers. It only took a duo 7 hours to rake in more than $7 million"
    ],
    "summary": "A recent business collaboration has demonstrated that digital versions of humans, powered by artificial intelligence, have the capability to outperform real humans in sales. This development highlights the growing impact of AI on marketing and commerce strategies.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it provides useful insights into the impact of AI on sales and marketing strategies. It highlights an innovation (AI-powered digital humans) and its potential benefits, contributing to the reader's understanding of emerging trends in AI and commerce.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.983,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.456
  },
  {
    "title": "Labour MP Resigns Over Proposed Disability Payment Cuts",
    "domain": "business",
    "location": "global",
    "published": "Thu, 19 Jun 2025 21:39:40 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times",
      "The Guardian"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "Vicky Foxcroft’s move could presage wider rebellion over changes to disability benefits",
      "<p>Vicky Foxcroft says she cannot support changes to disability payments ahead of key vote on welfare bill</p><p>The Labour MP Vicky Foxcroft has resigned as a whip in protest at the government’s <a href=\"https://www.theguardian.com/uk-news/2025/mar/26/labour-mps-condemn-rachel-reevess-unacceptable-welfare-cuts\">welfare plans</a>, saying she will not be able to vote for the cuts to disability payments.</p><p>The government is <a href=\"https://www.theguardian.com/politics/2025/jun/18/uk-benefits-system-could-collapse-if-payments-are-not-cut-liz-kendall-says\">braced for a major rebellion</a> on..."
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F89d9ad58-6666-45c5-a846-0ee7e7365ea8.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Labour whip resigns over planned UK welfare cuts",
      "Labour MP resigns as government whip in protest at benefit cuts"
    ],
    "summary": "Labour MP Vicky Foxcroft resigned from her position as a whip to protest against the government's proposed welfare cuts, specifically opposing reductions to disability payments. Foxcroft's decision highlights her inability to support the contentious changes ahead of a crucial vote on the welfare bill. This move signals potential wider rebellion within the party concerning the welfare plans, indicating significant opposition to the cuts.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story offers a deeper understanding of the political dynamics surrounding the proposed welfare cuts, increasing awareness about the potential impacts of these cuts on disabled individuals. However, it does not provide solutions or progress towards resolving the issue.",
    "score_components": {
      "magnitude": 0.6,
      "recency": 0.949,
      "consensus": 0.682,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.68
  },
  {
    "title": "Asian Firms Hit by Productivity Decline, Workforce Expansion Not Viable",
    "domain": "business",
    "location": "global",
    "published": "Thu, 19 Jun 2025 21:00:00 +0000",
    "source": "Fortune",
    "sources": [
      "Fortune"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Asian firms can no longer hire their way out of a productivity slump. “There are no more people,” Simon Tate, Workday's Asia president, says."
    ],
    "image_url": "https://fortune.com/img-assets/wp-content/uploads/2025/06/GettyImages-1178688550-e1750312549293.jpg?w=2048",
    "titles": [
      "Asian executives are ‘worried about productivity’—and the solution may be giving young workers more say in how things are done"
    ],
    "summary": "Asian companies are facing a productivity decline and can no longer resolve this issue by increasing their workforce. According to Simon Tate, the President of Workday Asia, the region is experiencing a shortage of available workers, indicating that hiring more employees is not a viable solution to improve productivity.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story raises awareness about a significant trend affecting Asian companies, namely the decline in productivity and the shortage of available workers. However, it does not offer actionable insights or report on potential solutions to the problem, limiting its constructiveness.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.936,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.399
  },
  {
    "title": "Shubman Gill Key in India-England Test Series, Career at Turning Point",
    "domain": "business",
    "location": "global",
    "published": "Thu, 19 Jun 2025 18:48:04 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Shubman Gill is the new prince of Indian cricket as his team take on England in a five-match Test series. It might be the making of him."
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/68544445d622f642ead3ee70/0x0.jpg?width=960",
    "titles": [
      "Shubman Gill Must Score Runs In England To Pass Leadership Test"
    ],
    "summary": "Shubman Gill is being highlighted as a significant figure in Indian cricket as his team faces England in a five-match Test series. This series is viewed as a potential turning point in his career, suggesting it could greatly enhance his reputation and standing within the sport.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides some useful information about Shubman Gill's potential impact on the upcoming India-England Test series and his career. However, it doesn't offer any actionable insights or deeper understanding of the sport, nor does it report on solutions or improvements. It does provide some awareness about a key player in a major sport event.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.972,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.416
  },
  {
    "title": "Lakers Sale, Small-Market Finals Boost NBA Expansion Talks",
    "domain": "business",
    "location": "global",
    "published": "Thu, 19 Jun 2025 18:46:12 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "The Lakers' record sale and a small-market NBA Finals collectively bust the door wide-open for league expansion now."
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/6854926dc783f0b84b3fe605/0x0.jpg?width=960",
    "titles": [
      "Lakers Sale Makes NBA Expansion Even Hotter Topic Post-Finals"
    ],
    "summary": "The record sale of the Lakers and the occurrence of a small-market NBA Finals have significantly increased momentum for league expansion. This combination of events demonstrates the financial viability and competitive potential of new teams joining the NBA, setting the stage for discussions on expanding the league.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful information about the potential expansion of the NBA, driven by the Lakers' sale and a small-market NBA Finals. It offers insights into the financial viability and competitive potential of new teams, which could influence decisions related to the sport. However, it doesn't clearly highlight solutions or progress, although it does increase awareness around trends in the NBA.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.971,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.436
  },
  {
    "title": "Netflix's \"KPop Demon Hunters\" Praised for Authentic Fan Culture Portrayal",
    "domain": "business",
    "location": "global",
    "published": "Thu, 19 Jun 2025 18:40:08 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "Netflix's KPop Demon Hunters Director Maggie Kang reveals how they captured K-pop Fan Culture so perfectly in the film — and the official fandom names!"
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/6853438cc41f48672b032965/0x0.jpg?width=960",
    "titles": [
      "‘KPop Demon Hunters’ Director On Getting K-Pop Culture Down"
    ],
    "summary": "Netflix released \"KPop Demon Hunters,\" directed by Maggie Kang, who shared insights into accurately portraying K-pop fan culture in the film. Kang highlighted the research and engagement with fans that went into the depiction, ensuring authenticity. The movie also introduced official fandom names, further engaging with the real-life aspect of K-pop culture. This attention to detail has been a key factor in the film's reception.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive as it provides a deeper understanding of the work that went into accurately portraying K-pop fan culture in the film. It reports on the solutions used to ensure authenticity, such as research and engagement with fans, and highlights the positive impact of these efforts on the film's reception. The story also increases awareness of the importance of authentic representation in media.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.969,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.453
  },
  {
    "title": "Study Challenges Darwin's Paradox on Coral Reefs' Nutrient Preferences",
    "domain": "science",
    "location": "global",
    "published": "Thu, 19 Jun 2025 22:27:54 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/scientists-debunk-long-held-darwins-paradox-myth-about-coral-reefs/\" rel=\"nofollow\" title=\"Scientists Debunk Long-Held “Darwin’s Paradox” Myth About Coral Reefs\"><img alt=\"Vibrant Tropical Marine Life\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Vibrant-Tropical-Marine-Life-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>Most coral reefs do not thrive in nutrient-poor “marine deserts” as once believed, but instead flourish in nutrient-rich waters. Coral reefs are among..."
    ],
    "image_url": "",
    "titles": [
      "Scientists Debunk Long-Held “Darwin’s Paradox” Myth About Coral Reefs"
    ],
    "summary": "Scientists have challenged the long-standing belief known as \"Darwin's Paradox,\" which suggested that coral reefs thrive in nutrient-poor waters. New findings reveal that most coral reefs actually flourish in nutrient-rich environments, overturning previous assumptions about their ecological preferences.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides a deeper understanding of coral reef ecosystems, challenging long-held beliefs and offering new insights. However, it does not provide clear actionable insights for the reader or report on solutions or improvements.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.965,
      "consensus": 0.393,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.425
  },
  {
    "title": "Scientists Break New Ground in Banana Breeding with Genome Mapping Breakthrough",
    "domain": "science",
    "location": "global",
    "published": "Thu, 19 Jun 2025 21:52:53 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/genetic-banana-breeding-breakthrough-helps-crack-century-old-puzzle/\" rel=\"nofollow\" title=\"Genetic Banana Breeding Breakthrough Helps Crack Century-Old Puzzle\"><img alt=\"Ripe Banana\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"437\" src=\"https://scitechdaily.com/images/Ripe-Banana-777x437.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>A new genome mapping model uncovered 62 key trait loci in bananas, overcoming chromosomal barriers and aiding future crop improvement across complex plant genomes. Bananas are a dietary..."
    ],
    "image_url": "",
    "titles": [
      "Genetic Banana Breeding Breakthrough Helps Crack Century-Old Puzzle"
    ],
    "summary": "Scientists have achieved a significant breakthrough in banana breeding by developing a new genome mapping model that has identified 62 key trait loci in bananas. This advancement overcomes previous chromosomal barriers, facilitating future improvements in crop quality and resilience. This discovery is pivotal for enhancing banana varieties and could have broader implications for the genetic improvement of other complex plant genomes.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "The story reports on a significant innovation in banana breeding that could lead to improvements in crop quality and resilience. It provides actionable insights for those in the field of agriculture and genetic research, and increases awareness about the potential for genetic improvement in complex plant genomes.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.954,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.443
  },
  {
    "title": "Discovery of Brain Circuit in Mice Links Sleep Deprivation to Recovery Sleep",
    "domain": "science",
    "location": "global",
    "published": "Thu, 19 Jun 2025 20:00:12 +0100",
    "source": "New Scientist",
    "sources": [
      "New Scientist"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "A newly identified brain circuit in mice may explain why we sleep longer and deeper after being sleep deprived – and lead to new treatments for sleep conditions"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/06/18171900/SEI_256000898.jpg",
    "titles": [
      "Your brain tracks your sleep debt – and now we may know how"
    ],
    "summary": "Researchers have discovered a specific brain circuit in mice that could explain why sleep deprivation leads to longer and deeper periods of sleep to recover. This finding has the potential to pave the way for new treatments targeting sleep disorders by manipulating this brain circuit, offering hope for those suffering from sleep-related conditions.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story offers a deeper understanding of sleep mechanisms and the potential for new treatments for sleep disorders. It does not, however, highlight specific progress or solutions, but it does suggest a potential direction for future research and treatment.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.898,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.428
  },
  {
    "title": "Innovative In-Body CAR T-Cell Therapy Aims to Cut Costs, Ease Access",
    "domain": "science",
    "location": "global",
    "published": "Thu, 19 Jun 2025 20:00:11 +0100",
    "source": "New Scientist",
    "sources": [
      "New Scientist"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Treating types of cancer with CAR T-cell therapy is expensive and inconvenient, but a streamlined approach that creates the therapy within the body could make the intervention cheaper and easier"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/06/19171933/SEI_256117481.jpg",
    "titles": [
      "CAR T-cell therapy could be made in the body of someone with cancer"
    ],
    "summary": "A new streamlined approach to CAR T-cell therapy, which is used to treat certain types of cancer, has been developed to create the therapy directly within the body. This method aims to reduce the high costs and logistical challenges associated with the traditional external cell modification process. By making CAR T-cell therapy more accessible and convenient, this innovation could significantly improve treatment options for cancer patients.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it reports on an innovation in cancer treatment that could potentially improve accessibility and affordability for patients. It provides actionable insights for those in the healthcare field and a deeper understanding of CAR T-cell therapy for readers.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.898,
      "consensus": 0.393,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.439
  },
  {
    "title": "Placenta Key to Human Brain Evolution, Study Suggests",
    "domain": "science",
    "location": "global",
    "published": "Thu, 19 Jun 2025 19:10:01 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "The placenta and the hormones it produces may have played a crucial role in the evolution of the human brain, while also leading to the behavioral traits that have made human societies able to thrive and expand, according to a new hypothesis proposed by researchers from the Universities of Cambridge and Oxford."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2022/placenta.jpg",
    "titles": [
      "Placenta and hormone levels in the womb may have been key drivers in human brain evolution"
    ],
    "summary": "Researchers from the Universities of Cambridge and Oxford propose a hypothesis suggesting that the placenta and its hormones significantly contributed to the evolution of the human brain and the development of behavioral traits that enabled human societies to flourish. This theory highlights the placenta's role in human advancement.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The story provides useful information about a new hypothesis on human brain evolution, contributing to readers' understanding of the topic. However, it does not report on a solution or improvement, and its immediate usefulness may be limited to those with a specific interest in the field.",
    "score_components": {
      "magnitude": 0.059,
      "recency": 0.979,
      "consensus": 0.393,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.445
  },
  {
    "title": "Humpback Whales Blow 'Bubble Rings' at Boats, Sparking Research Inquiry",
    "domain": "science",
    "location": "global",
    "published": "Thu, 19 Jun 2025 17:30:00 GMT",
    "source": "Scientific American",
    "sources": [
      "Scientific American"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMisgFBVV95cUxOVURxVUR3RXZLSF9IRWpFeU5JeTRDUndjZkRjUGZKdzlSZnNpdHFNUVVHbnpJT1RTODdLX2xfdnFHVkoxQWlMSnJvQ0hDVVFsbE9ZaS1RVUF2MldiMUI5a1NvUGxENDlpUnVJbGt2OFROZDBPUDVRRVRtYWhLd3dlYjhSLUpmU0NJc3JnS3l2TlhrNGctb1hMaGU0TXdibW9wb0hwVzN2MElfMEdHQ0hQdkhR?oc=5\" target=\"_blank\">Humpback Whales Are Blowing ‘Bubble Rings’ at Boats. Are They Trying to Communicate?</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Scientific American</font>"
    ],
    "image_url": "",
    "titles": [
      "Humpback Whales Are Blowing ‘Bubble Rings’ at Boats. Are They Trying to Communicate? - Scientific American"
    ],
    "summary": "Humpback whales have been observed blowing 'bubble rings' at boats, sparking curiosity about their behavior. Researchers are investigating whether this action is a form of communication or has another purpose. The current status of this inquiry remains open as scientists continue to study the phenomenon to understand the motives behind the whales' actions.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "While the story does not provide actionable insights or report on progress, it does increase awareness about a unique behavior of humpback whales and the ongoing research to understand it. It contributes to the reader's understanding of the topic, even if the immediate usefulness is limited.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.87,
      "consensus": 0.393,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.396
  },
  {
    "title": "Massive Reforestation Needed to Offset Global Fossil Fuel Emissions",
    "domain": "science",
    "location": "global",
    "published": "Thu, 19 Jun 2025 17:00:20 +0100",
    "source": "New Scientist",
    "sources": [
      "New Scientist"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Trees would have to be planted on a vast proportion of global land mass to offset the carbon dioxide emissions from burning the world’s fossil fuel reserves"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/06/19122454/SEI_256091072.jpg",
    "titles": [
      "Offsetting global fossil fuel stores by planting trees is impossible"
    ],
    "summary": "To offset carbon dioxide emissions from burning all of the world's fossil fuel reserves, a significant portion of global land mass would need to be dedicated to tree planting. This approach emphasizes the extensive scale of reforestation required to counterbalance the environmental impact of fossil fuel consumption.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides a useful understanding of the scale of reforestation needed to offset the environmental impact of fossil fuel consumption. However, it does not report on any specific solutions, improvements, or innovations, nor does it give the reader actionable insights.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.844,
      "consensus": 0.393,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.401
  },
  {
    "title": "LGBTIQ+ Community Faces Unique Challenges in Shared Housing",
    "domain": "science",
    "location": "global",
    "published": "Thu, 19 Jun 2025 16:20:03 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "People who belong to the LGBTIQ+ community say shared housing is fraught with difficulties that go well beyond learning new routines and sharing space with strangers."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/roommate.jpg",
    "titles": [
      "Kicked out for coming out: More than half of LGBTIQ+ roommates face discrimination for their identity, finds study"
    ],
    "summary": "Members of the LGBTIQ+ community face significant challenges in shared housing, which extend beyond the typical issues of adjusting to new routines and living with strangers. These difficulties highlight the unique struggles faced by LGBTIQ+ individuals in communal living situations.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story increases awareness about the unique challenges faced by the LGBTIQ+ community in shared housing situations. However, it does not provide any actionable insights or report on any solutions or improvements. It also lacks depth or insight into the causes or trends behind these challenges.",
    "score_components": {
      "magnitude": 0.039,
      "recency": 0.923,
      "consensus": 0.393,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.396
  }
]