[
  {
    "title": "Supreme Court to Fast-Track Case on Trump's Tariffs After Lower Court Rulings",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Tue, 09 Sep 2025 16:47:28 -0400",
    "source": "NPR",
    "sources": [
      "CNBC",
      "Al Jazeera",
      "Forbes",
      "Axios",
      "NPR",
      "BBC"
    ],
    "domains": [
      "www.forbes.com",
      "www.cnbc.com",
      "www.bbc.com",
      "news.google.com",
      "www.npr.org",
      "www.aljazeera.com"
    ],
    "snippets": [
      "The tariffs have become a flashpoint, with two lower courts declaring them illegal, and the president asking the Supreme Court for reversal as soon as possible.",
      "Two lower courts have said some of President Trump's tariffs are unlawful. Now the Supreme Court has agreed to examine the issue.",
      "It will amount to the biggest test of Trump's presidential authority and his signature economic policy.",
      "The Supreme Court has scheduled to hear the case in November, lightning fast by its typical standards.",
      "<a href=\"https://news.google.com/rss/articles/CBMidkFVX3lxTE02cWN2Yll2Z2Vka3U5am1LaTNfTTVNZ1R6Y3pHYUJ4TktBZFRrTk55U2Y2bWhjMTE2MDNRbmpPa0hIV0xmaXVHOTZDNFhOY3g2eW1mTnppTG1xbTE4Z1hKdnlYUmNvaVRvQ2NjQzNYempYZXZMMkE?oc=5\" target=\"_blank\">Supreme Court will expedite Trump tariff case</a>&nbsp;&nbsp;<font c",
      "A federal appeals court recently ruled that many of President Donald Trump's wide-ranging tariffs in imports from most countries are illegal.",
      "If the Supreme Court lets a lower court’s decision stand, and tariffs are ruled unlawful, companies—and consumers—could start asking that the money they paid be returned."
    ],
    "image_url": "",
    "titles": [
      "Supreme Court agrees to hear challenge to some of Trump's sweeping tariffs",
      "Supreme Court will weigh in on Trump's tariffs. Here's what to know about the case",
      "Supreme Court to decide if Trump's global tariffs are legal",
      "US Supreme Court to decide legality of Trump’s tariffs",
      "Supreme Court will expedite Trump tariff case - Axios",
      "Supreme Court will hear Trump tariffs case on fast track",
      "Supreme Court Will Decide Fate Of Trump’s Tariffs—Here’s What Happens If They’re Overturned"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.93,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.861,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Supreme Court has agreed to expedite a case concerning the legality of some tariffs imposed by President Trump, following rulings by two lower courts that declared them illegal. This case represents a significant test of Trump's presidential authority and his economic policies. The Supreme Court is set to hear the case in November, indicating the urgency of the matter. If the Supreme Court upholds the lower court's decision, companies and consumers could seek refunds for the tariffs paid.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Israel Airstrike Targets Hamas Leaders in Qatar, Sparks International Criticism",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 09 Sep 2025 19:06:52 GMT",
    "source": "BBC",
    "sources": [
      "CNBC",
      "Al Jazeera",
      "LA Times",
      "Financial Times",
      "New York Times",
      "Deutsche Welle",
      "BBC"
    ],
    "domains": [
      "www.nytimes.com",
      "www.cnbc.com",
      "www.ft.com",
      "www.bbc.com",
      "www.latimes.com",
      "www.bbc.co.uk",
      "www.dw.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "The Doha attack signals that Benjamin Netanyahu will press forward hard on all fronts, writes Jeremy Bowen.",
      "Hamas says six people killed in air strike but its leadership team survived.",
      "Multiple explosions were heard in Qatar&#039;s capital Doha, in an attack targeting Hamas leaders including Khalil al-Hayya.",
      "The Israeli military says it attacked Hamas' leadership in Qatar's capital, Doha, where the militant group's political leaders and negotiators are based. Follow DW for more",
      "\"Unilaterally bombing inside Qatar ... does not advance Israel or America's goals,\" White House press secretary Karoline Leavitt said at a press briefing.",
      "US issues rare censure after six killed in strikes on Gulf state",
      "The Gulf nation of Qatar has been trying to negotiate a cease-fire in the conflict. The attack threatened to destabilize those peace efforts.",
      "<p>Israeli leader Benjamin Netanyahu said the strike in Doha, Qatar, was to avenge Oct. 7. \"The days are over when terror leaders can enjoy immunity,\" he said.</p>"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/5aab/live/b97892a0-8db1-11f0-9cf6-cbf3e73ce2b9.jpg",
    "titles": [
      "Bowen: Diplomacy in ruins after Israel strikes Hamas leaders in Qatar",
      "Israel Strikes Hamas In Qatar",
      "Israel attacks Hamas leadership in Qatar: All to know",
      "Israeli military strikes Hamas leaders in Qatar",
      "White House criticizes Israeli strike on Hamas in Qatar",
      "Israel launches attack on Hamas in Qatar",
      "Israel Targeted Hamas Leadership in Qatar Strike",
      "Israel expands campaign beyond Gaza, hitting Hamas leaders in Qatar"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.88,
      "consensus": 1.0,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.836,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Israel conducted an airstrike in Doha, Qatar, targeting senior Hamas leaders, sparking criticism from Qatar, which condemned the attack as 'criminal' and a threat to peace efforts. The U.S. Embassy in Doha responded with a shelter-in-place order. This action marks a significant escalation, as Hamas' exiled leadership, involved in long-standing negotiations with Israel facilitated by Qatar, was targeted.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Macron Appoints Lecornu as PM Amid France's Political Turmoil",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 09 Sep 2025 20:01:29 GMT",
    "source": "BBC",
    "sources": [
      "Al Jazeera",
      "Financial Times",
      "The Guardian",
      "New York Times",
      "Deutsche Welle",
      "BBC"
    ],
    "domains": [
      "www.nytimes.com",
      "www.ft.com",
      "www.bbc.com",
      "www.theguardian.com",
      "www.dw.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "It comes after a vote of confidence ousted François Bayrou after nine months in power.",
      "Sebastien Lecornu, 39, is facing an uphill battle over budget as protests loom in the coming days.",
      "French President Emmanuel Macron has named Defense Minister Sebastien Lecornu as prime minister to replace Francois Bayrou after he was ousted just nine months in office.",
      "New premier will have the tricky task of trying to secure parliamentary approval for a budget",
      "<p>Sébastien Lecornu, a presidential ally, is tasked with bringing France’s divided parties together to pass a budget</p><p></p><p>Sébastien Lecornu, a close ally of Emmanuel Macron, has been appointed prime minister, tasked with consulting France’s divided political parties to try to find a consens",
      "President Emmanuel Macron’s appointment of Sébastien Lecornu, the departing defense minister, after the government collapsed reflects the pressure Mr. Macron faces to get a budget passed."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/4d60/live/c92fcaa0-8da8-11f0-a306-c7044329a9c6.jpg",
    "titles": [
      "Macron names ally Sébastien Lecornu as new French PM",
      "Macron names close ally Sebastien Lecornu as new French PM",
      "France: Macron taps defense minister Lecornu as new prime minister",
      "Macron appoints ally Sébastien Lecornu as France’s prime minister",
      "Emmanuel Macron appoints his third prime minister in a year",
      "Macron Picks Sébastien Lecornu as France’s Next Prime Minister"
    ],
    "score_components": {
      "magnitude": 0.986,
      "recency": 0.897,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.825,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "French President Emmanuel Macron appointed Sébastien Lecornu, the former defense minister and a close ally, as the new prime minister following François Bayrou's removal from office after nine months. Lecornu, 39, faces the immediate challenge of securing parliamentary approval for the government's budget amidst a politically divided France and upcoming protests. His appointment reflects Macron's urgent need to navigate through the country's political divisions and pass a critical budget.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Nepal PM Resigns Amid Protests Over Social Media Ban and Corruption Allegations",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 09 Sep 2025 16:57:48 GMT",
    "source": "BBC",
    "sources": [
      "Deutsche Welle",
      "BBC",
      "New York Times",
      "Washington Post"
    ],
    "domains": [
      "www.washingtonpost.com",
      "www.nytimes.com",
      "www.dw.com",
      "www.bbc.com"
    ],
    "snippets": [
      "KP Sharma Oli steps down amid Nepal's worst unrest in decades, with at least 22 deaths reported in clashes.",
      "Protests continued in Kathmandu on Tuesday despite the lifting of a social media ban, with the houses of several senior politicians reportedly set on fire. Prime Minister KP Sharma Oli has resigned.",
      "Anger had been mounting for years against a Nepali political elite viewed as corrupt and out of touch, and it exploded Tuesday with sudden ferocity.",
      "A day after violent clashes left at least 19 people dead, Prime Minister K.P. Sharma Oli and other ministers quit, with no clear path to assuaging young protesters in the capital."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/f574/live/e3640880-8d96-11f0-9cf6-cbf3e73ce2b9.jpg",
    "titles": [
      "Nepal parliament set on fire after PM resigns over anti-corruption protests",
      "Nepal PM resigns as anti-corruption protests escalate",
      "Nepal’s prime minister resigns and parliament burns amid deadly protests",
      "Nepal’s Prime Minister Resigns as Protesters Set Fire to Leaders’ Houses"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.841,
      "consensus": 0.908,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.767,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Nepal's Prime Minister K.P. Sharma Oli resigned after widespread protests sparked by a social media ban and allegations of government corruption. The demonstrations, largely driven by the country's youth, continued even after the ban was lifted, leading to violent clashes that resulted in at least 19 deaths. The unrest, one of the worst in decades, also saw the federal parliament and the homes of several politicians set on fire. Oli's resignation came in the wake of his cabinet members quitting and no immediate solution to the crisis.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: solution",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Inside the Lines Releases Week 2 Fantasy Football Rankings and Stock Report",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 9 Sep 2025 18:12:12 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports",
      "Forbes"
    ],
    "domains": [
      "www.forbes.com",
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "Weekly individual and composite rankings for each position in PPR and IDP formats.",
      "The Inside the Lines team uses its proven NFL model to break down why our projected rankings for Week 2 differ significantly from the Fantasy Football Today consensus",
      "Fantasy football stock report heading into Week 2, including some players on the rise and some to consider dropping."
    ],
    "image_url": "",
    "titles": [
      "Fantasy football rankings for Week 2",
      "Fantasy football start/sit in Week 2: Bench Jayden Daniels for Dak Prescott? Play DJ Moore over Drake London?",
      "Fantasy Football Stock Report Week 2: 5 Risers And Fallers"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.958,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.753,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Inside the Lines team released Week 2 fantasy football rankings for PPR and IDP formats, using their NFL model to explain deviations from the Fantasy Football Today consensus. Additionally, they provided a stock report highlighting players whose value is increasing and those who might be worth dropping.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Signs Executive Action for Transparency in Pharma Ads",
    "domain": "business",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Tue, 09 Sep 2025 19:26:36 -0400",
    "source": "ABC News",
    "sources": [
      "CNBC",
      "ABC News",
      "MarketWatch"
    ],
    "domains": [
      "www.marketwatch.com",
      "www.cnbc.com",
      "abcnews.go.com"
    ],
    "snippets": [
      "President Trump signed a memorandum Tuesday pressuring pharmaceutical companies to abide by transparency laws in their advertising, particularly on social media.",
      "The Trump administration plans to ensure transparency and accuracy in drug ads, including by increasing the amount of information related to any product risks.",
      "President Donald Trump’s administration on Tuesday rolled out an executive action aimed at limiting direct-to-consumer advertising for pharmaceuticals, with officials saying a recent Hims & Hers Health Inc. ad stood out as an example of what should be prevented."
    ],
    "image_url": "https://s.abcnews.com/images/US/kennedy-hearing-14-ap-gmh-250904_1756996780743_hpMain_4x3t_384.jpg",
    "titles": [
      "Trump signs memorandum pressuring pharma companies to abide by ad laws",
      "Trump signs memo to crack down on direct-to-consumer pharma ads",
      "Trump aims to curb direct-to-consumer ads for drugs. Hims & Hers Health could be targeted."
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.983,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.75,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "President Trump signed an executive action on Tuesday targeting pharmaceutical companies to enforce transparency in their advertising, especially on social media. This move aims to increase the disclosure of product risks in direct-to-consumer ads, as part of the administration's effort to ensure accuracy and transparency. The action was partly motivated by concerns over specific ads, including one by Hims & Hers Health Inc., cited as an example of the type of advertising the administration seeks to regulate.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Israeli-Russian Academic Freed from Iraqi Militia, Safe at US Embassy",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 09 Sep 2025 21:45:29 GMT",
    "source": "BBC",
    "sources": [
      "Al Jazeera",
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "A Princeton student \"tortured for many months\" by Iraqi militia is now in the US embassy, President Trump says.",
      "US President Trump confirms Elizabeth Tsurkov freed after being held by Iraqi group amid spy claims.",
      "<p>Elizabeth Tsurkov, who entered Iraq to do research for Princeton, had gone missing in Iraq in early 2023</p><p>Israeli-Russian academic and Princeton student Elizabeth Tsurkov has been released after being kidnapped by Kata’ib <a href=\"https://www.theguardian.com/world/hezbollah\">Hezbollah</a> an"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/b9cf/live/8413e920-8dc0-11f0-b575-73c6daf55268.jpg",
    "titles": [
      "Abducted Israeli-Russian researcher Elizabeth Tsurkov freed in Iraq",
      "Israeli-Russian researcher freed in Iraq after two years in captivity",
      "Israeli-Russian graduate student freed after 903 days in Hezbollah captivity"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.93,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.74,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Elizabeth Tsurkov, a Princeton student and Israeli-Russian academic, who was kidnapped by Kata’ib Hezbollah in Iraq while conducting research, has been released. President Trump announced she is now safe at the US embassy. Tsurkov, who went missing in early 2023 amid accusations of spying, was reportedly \"tortured for many months\" by the Iraqi militia before her release.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: research",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Supreme Court Halts Order on Trump's Foreign Aid 'Pocket Rescission'",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Tue, 09 Sep 2025 20:42:16 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Axios",
      "Al Jazeera",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "news.google.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Emergency stay granted by court one day after government requests it be allowed to ignore lower court order.",
      "<a href=\"https://news.google.com/rss/articles/CBMifEFVX3lxTFBQN1hoZE9fd0hfWVRIYllZNFdpYU5KcHRDQ2pYNGRoejl2X3BfMHVmaTNrTktLOHFFcUQ2T05JUFRiTlc0eGxrY1F4eVR0NFFXMFQzSTBuY09PemhjQXBqb3JOVHVLbFNzTGtxV1ROZU5GeldJbTZXNFZiNHU?oc=5\" target=\"_blank\">Supreme Court pauses judge's order on Trump foreign aid free",
      "<a href=\"https://news.google.com/rss/articles/CBMihgFBVV95cUxNSmhlSExNemYwX2lHZjJUSkg0NUZROW5RS0F0SHR1THhCSUF3NnZHVUdkME0zYjZmc1RyS0M5bGs4QlBaTDR0WW01MDJVYzVLQmRVeVI4S0dkNzFvWDhpbWVfUkpuaEJ5RFl2TkVGNTdCSVR0d0NuNVJUUUh3X2VHU1paZnhpUQ?oc=5\" target=\"_blank\">Supreme Court lets Trump fire FTC commissione",
      "<a href=\"https://news.google.com/rss/articles/CBMiiAFBVV95cUxPSHBiM25ZczBHcVBvUlRsRFNGMU9EX2NHQmJGWEctSkZXRWdPd2ZxVFQwdEFsSDUyQVpncnBtQmhrS1RMR1NxZ3VDMlhyRkZmZkVoNEUzX3FkUUM4N1ZsdHhYX2hIZVJ5b2NGYjFSak1HTVVPa3lsbzgxRk4xV21sRDc1Yk5NVUp4?oc=5\" target=\"_blank\">Trump appeals foreign aid freeze to Supreme",
      "<p>Trump had stopped foreign aid funds by use of ‘pocket rescission’; aid groups now have until Friday to respond</p><p>The <a href=\"https://www.theguardian.com/us-news/us-supreme-court\">US supreme court</a> on Tuesday temporarily halted a lower court’s order that the <a href=\"https://www.theguardia"
    ],
    "image_url": "",
    "titles": [
      "US Supreme Court paves way for Trump to cut $4bn in foreign aid",
      "Supreme Court pauses judge's order on Trump foreign aid freeze - Axios",
      "Supreme Court lets Trump fire FTC commissioner for now - Axios",
      "Trump appeals foreign aid freeze to Supreme Court - Axios",
      "US supreme court clears way for Trump to ban $5bn in foreign aid"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.929,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.737,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The US Supreme Court granted an emergency stay, pausing a lower court's order related to President Trump's decision to stop foreign aid funds through 'pocket rescission.' This decision comes after the government requested the ability to bypass the lower court's directive. Aid groups have been given until Friday to respond to the Supreme Court's temporary halt.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Cracker Barrel Halts Rebranding After Customer Backlash",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Tue, 09 Sep 2025 19:23:09 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Business Insider",
      "The Guardian"
    ],
    "domains": [
      "www.businessinsider.com",
      "www.theguardian.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "Cracker Barrel's \"Old Country Store\" look is here to stay, the company announced, in the latest walk back of its rebranding initiative.",
      "<p>US southern-style restaurant chain was met with outrage for changing branding to more minimalist style</p><p>Cracker Barrel announced on Tuesday that it’s suspending plans to remodel its restaurants just weeks after reversing a logo change that ignited a political firestorm.</p><p>The 56-year-old",
      "Cracker Barrel said it would stop remodeling its stores. The chain had added lighter-colored walls and streamlined the kitsch at a few locations."
    ],
    "image_url": "",
    "titles": [
      "Cracker Barrel suspends restaurant remodels after logo controversy",
      "Cracker Barrel suspends remodeling plans after backlash over logo change",
      "Cracker Barrel is pausing its restaurant renovations after backlash to its rebrand and new logo"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.885,
      "consensus": 0.789,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.734,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Cracker Barrel has halted its rebranding efforts, including stopping plans to remodel its restaurants and reversing a logo change, after backlash from customers. The 56-year-old US southern-style restaurant chain faced criticism for moving to a more minimalist style. The company's traditional \"Old Country Store\" look will remain unchanged.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: effort, plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Apple Unveils iPhone Air, iPhone 17, and New Watches with Health Alerts",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-09-09T17:00:00-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge",
      "TechCrunch",
      "Ars Technica"
    ],
    "domains": [
      "techcrunch.com",
      "www.theverge.com",
      "arstechnica.com"
    ],
    "snippets": [
      "The iPhone Air and the iPhone 17 fleet of phones took the spotlight during Apple’s “Awe dropping” event. If you weren’t tempted by the new phones, the fact that the entire Apple Watch lineup got refreshed might have been even bigger news to you. Soon, the Apple Watch SE 3, Apple Watch Series 11, and",
      "One perk is the Apple Watch Series 11 can alert you to possible hypertension. Apple says it plans to notify over 1 million people with undiagnosed hypertension in the first year alone.",
      "$799 Ultra Watch 3 will debut alongside the Watch Series 11 and Watch SE 3."
    ],
    "image_url": "",
    "titles": [
      "How to preorder the Apple Watch SE 3, Apple Watch Series 11, and Apple Watch Ultra 3",
      "Apple unveils Apple Watch Series 11, Watch Ultra 3, and Watch SE 3",
      "Apple adds hypertension and sleep-quality monitoring to Watch Ultra 3, Series 11"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.934,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.731,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "At Apple's \"Awe dropping\" event, the iPhone Air, iPhone 17, and a refreshed Apple Watch lineup were announced. The new Apple Watch Series 11 features a hypertension alert system, aiming to notify over 1 million people of undiagnosed hypertension in its first year. Additionally, the $799 Ultra Watch 3 was introduced alongside the Watch Series 11 and Watch SE 3.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "U.S. Informed Before Israel's Strike on Hamas in Qatar, Source Says",
    "domain": "general",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Tue, 09 Sep 2025 18:58:59 GMT",
    "source": "The Guardian",
    "sources": [
      "CityNews",
      "The Guardian",
      "Washington Post"
    ],
    "domains": [
      "www.theguardian.com",
      "ottawa.citynews.ca",
      "www.washingtonpost.com"
    ],
    "snippets": [
      "<p>Hamas says six were killed but its leadership survived the attack, which the US says ‘does not advance Israel or America’s goals’</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/sep/09/israel-gaza-city-evacuation-order-idf-military-offensive-live-updates-middle-east-crisis-late",
      "Qatar says it will continue its efforts to mediate between Israel and Hamas. But diplomats and analysts believe the short term prospects for peace look dim.",
      "The attack in the Qatari capital, Doha, sought to assassinate much of Hamas’s leadership, but the militant group said no senior figures were killed.",
      "DUBAI, United Arab Emirates (AP) — Israel struck the headquarters of Hamas&#8217; political leadership in Qatar on Tuesday as the group&#8217;s top figures gathered to consider a U.S. proposal for a ceasefire in the Gaza Strip. The strike on the territory of a U.S. ally marked a stunning escalation "
    ],
    "image_url": "https://i.guim.co.uk/img/media/52c59e33ee6f6f589155fd0f5fe6e097a37a68bc/125_0_3722_2978/master/3722.jpg?width=140&quality=85&auto=format&fit=max&s=846e55009a8dd32e8c7887c83b7d41de",
    "titles": [
      "Israel launches airstrikes against top Hamas members in Qatar for Gaza ceasefire talks",
      "Israeli strike takes fight with Hamas to Qatar, key intermediary in Gaza talks",
      "Israeli airstrike targets top Hamas leaders, upending ceasefire talks",
      "Israeli strike in Qatar targets Hamas leaders as they weigh Gaza ceasefire proposal"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.878,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.726,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The U.S. was informed before Israel conducted a strike on Hamas in Qatar, described by Doha as a cowardly act and a violation of international law. This information comes from a source familiar with the situation but not authorized to speak publicly. The Pentagon has not commented on the matter.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Nepal PM Resigns Amid Protests Over Social Media Ban and Corruption Allegations",
    "domain": "general",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Tue, 09 Sep 2025 12:50:23 GMT",
    "source": "The Guardian",
    "sources": [
      "New York Times",
      "The Guardian",
      "Washington Post"
    ],
    "domains": [
      "www.theguardian.com",
      "www.nytimes.com",
      "www.washingtonpost.com"
    ],
    "snippets": [
      "<p>KP Sharma Oli resigns as police meet protests with deadly force, leaving 19 dead, and federal parliament is set alight </p><p>Nepal’s prime minister has resigned after some of the worst unrest in decades rocked the country this week, set off by a ban on social media and discontent at political co",
      "The demonstrations in Nepal over government corruption and restrictions to apps such as WhatsApp and Facebook were driven by widespread anger among young people.",
      "The government reversed its ban on Facebook, Instagram and other platforms, which had helped to fuel demonstrations by young people who were also angry about corruption."
    ],
    "image_url": "https://i.guim.co.uk/img/media/7c309db67295fd8b871d12fd602dc8d182c82a5a/765_0_5836_4669/master/5836.jpg?width=140&quality=85&auto=format&fit=max&s=b88fa32e7c5c9a8166fa8112759d1893",
    "titles": [
      "Nepal prime minister quits after deaths at protests sparked by social media ban",
      "At least 19 killed, hundreds injured in protests after Nepal social media ban",
      "Social Media Goes Back Online in Nepal After 19 Are Killed in Protests"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.772,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.701,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Nepal's Prime Minister K.P. Sharma Oli resigned after widespread protests sparked by a social media ban and allegations of government corruption. The demonstrations, largely driven by the country's youth, continued even after the ban was lifted, leading to violent clashes that resulted in at least 19 deaths. The unrest, one of the worst in decades, also saw the federal parliament and the homes of several politicians set on fire. Oli's resignation came in the wake of his cabinet members quitting and no immediate solution to the crisis.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: solution",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Proposes Tariffs on India, China to Pressure Russia on Ukraine Talks",
    "domain": "business",
    "source_domain": "www.ft.com",
    "location": "global",
    "published": "Tue, 09 Sep 2025 21:52:53 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Post",
      "Financial Times"
    ],
    "domains": [
      "www.ft.com",
      "financialpost.com"
    ],
    "snippets": [
      "US president makes extraordinary demand in bid to force Russia to end invasion of Ukraine",
      "President Donald Trump told European officials he’s willing to impose sweeping new tariffs on India and China to push President Vladimir Putin to the negotiating table with Ukraine — but only if EU nations do so as well."
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F28c1c0f4-c92e-4b3f-9883-8e0dc76487a6.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Trump tells EU to hit China and India with 100% tariffs to pressure Putin",
      "Trump Floats New Tariffs on China, India to Squeeze Russia"
    ],
    "score_components": {
      "magnitude": 0.835,
      "recency": 0.932,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.686,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "President Donald Trump has proposed imposing new tariffs on India and China as a strategy to pressure Russia into negotiating with Ukraine. He stated this condition is contingent upon EU nations agreeing to implement similar measures. This move is part of an effort to end Russia's invasion of Ukraine.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Tampa Bay Rays' Wander Franco Detained, Admitted for Mental Health Care",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 9 Sep 2025 19:33:55 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "Suspended Rays shortstop Wander Franco was detained by police on request of his family and admitted into a clinic in the Dominican Republic for mental health issues.",
      "<p>Suspended Tampa Bay Rays shortstop Wander Franco, who was found guilty earlier this year of sexually abusing a minor, was detained by police on Tuesday and admitted into a clinic in the Dominican Republic for mental health issues, according to authorities.</p>"
    ],
    "image_url": "",
    "titles": [
      "Family has Franco admitted to mental health clinic",
      "Wander Franco detained, admitted into clinic for mental health issues"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.986,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.684,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Suspended Tampa Bay Rays shortstop Wander Franco was detained by police in the Dominican Republic and admitted to a clinic for mental health issues, following a request from his family. This comes after Franco was found guilty of sexually abusing a minor earlier in the year.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Blue Jays Place Bichette on 10-Day IL, Recall Loperfido",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 9 Sep 2025 19:33:55 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "The Toronto Blue Jays placed shortstop Bo Bichette on the 10-day injured list Tuesday because of a sprained left knee and recalled outfielder Joey Loperfido from Triple-A Buffalo.",
      "<p>The Toronto Blue Jays will be without one of their stars as they attempt to hold down the AL East lead.</p>"
    ],
    "image_url": "",
    "titles": [
      "AL East-leading Jays place Bichette on 10-day IL",
      "Blue Jays place Bo Bichette on 10-day injured list, recall Joey Loperfido"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.986,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.684,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Toronto Blue Jays have placed shortstop Bo Bichette on the 10-day injured list due to a sprained left knee. In response, they've recalled outfielder Joey Loperfido from Triple-A Buffalo. This move comes as the team aims to maintain their lead in the AL East.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Josh Giddey Secures $100M, 4-Year Deal with Chicago Bulls",
    "domain": "sports",
    "source_domain": "www.sportingnews.com",
    "location": "national",
    "published": "Tue, 09 Sep 2025 23:58:02 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports",
      "Forbes"
    ],
    "domains": [
      "www.forbes.com",
      "www.sportingnews.com"
    ],
    "snippets": [
      "Grading Josh Giddey's new four year, $100 million deal for the Bulls",
      "After months of negotiations, Josh Giddey and the Chicago Bulls have come to terms on a contract for the young point guard."
    ],
    "image_url": "",
    "titles": [
      "Josh Giddey contract grade: Will Bulls guard be worth $100 million over the next four years?",
      "Josh Giddey And Chicago Bulls Agree On $100 Million Contract"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.994,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.679,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Josh Giddey has signed a new four-year, $100 million deal with the Chicago Bulls after lengthy negotiations. The contract marks a significant commitment by the Bulls to the young point guard.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Josh Giddey Re-Signs with Bulls for $100M Over Four Years",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 9 Sep 2025 19:33:55 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "Restricted free agent Josh Giddey has reached agreement on a four-year, $100 million contract to re-sign with the Chicago Bulls.",
      "<p>One of the more intriguing young players in the free-agent market is set to re-sign with the Chicago Bulls.</p>"
    ],
    "image_url": "",
    "titles": [
      "Giddey agrees to 4-year, $100M deal with Bulls",
      "Report: Josh Giddey re-ups with Bulls on four-year, $100M contract"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.986,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.677,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Josh Giddey, a restricted free agent, has agreed to a four-year, $100 million contract to stay with the Chicago Bulls. He is recognized as one of the promising young talents in the free-agent market.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Astros' Luis Garcia Exits Game Early Due to Elbow Injury",
    "domain": "sports",
    "source_domain": "sports.yahoo.com",
    "location": "national",
    "published": "Tue, 09 Sep 2025 23:54:48 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "sports.yahoo.com"
    ],
    "snippets": [
      "Houston Astros right-hander Luis Garcia exited Tuesday’s game at Toronto in the second inning with an apparent injury.  AJ Blubaugh came on to replace Garcia, who was making his second start after sitting out more than two years while recovering from Tommy John surgery.  Garcia threw 27 pitches, 14 ",
      "<p>Starter Luis Garcia left the game in the second inning with an apparent elbow injury in what was just his second start back after a long rehab from Tommy John surgery.</p>"
    ],
    "image_url": "",
    "titles": [
      "Astros RHP Luis Garcia exits start against Blue Jays in 2nd inning with apparent injury",
      "Astros’ Garcia exits start vs. Blue Jays in 2nd inning with apparent injury"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.993,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.654,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Houston Astros pitcher Luis Garcia was removed from a game against Toronto in the second inning due to an apparent elbow injury. This occurred during his second start after a hiatus of over two years for Tommy John surgery recovery. AJ Blubaugh replaced him after Garcia threw 27 pitches.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "US President Regrets Attack Location, Qatar Seeks Diplomatic Gaza Solution",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 09 Sep 2025 22:13:26 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Washington Post"
    ],
    "domains": [
      "www.washingtonpost.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The US president says he feels \"very badly\" about the location of the attack and calls Qatar a \"close ally\".",
      "Qatar’s prime minister said the country would continue to seek a diplomatic resolution to the war in Gaza, despite the strike."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/c3d5/live/7fb263c0-8dc0-11f0-b391-6936825093bd.jpg",
    "titles": [
      "Trump says strike on Doha 'does not advance Israel or America's goals'",
      "Israeli strike targeting Hamas in Qatar ‘does not advance Israel or America’s goals,’ Trump says"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.939,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.653,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The US president expressed regret over the location of an attack, emphasizing Qatar's status as a \"close ally.\" Meanwhile, Qatar's prime minister reaffirmed the country's commitment to pursuing a diplomatic solution to the ongoing war in Gaza, despite recent strikes.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: solution",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Judge Pauses Anthropic's $1.5B Book Piracy Settlement, Cites Misleading Terms",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-09-09T17:45:42-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge",
      "Ars Technica"
    ],
    "domains": [
      "www.theverge.com",
      "arstechnica.com"
    ],
    "snippets": [
      "Anthropic’s $1.5 billion book piracy settlement has been put on pause after the federal judge overseeing the class action case raised concerns about the terms of the agreement. During a hearing this week, Judge William Alsup rejected the settlement over concerns that class action lawyers will create",
      "Feeling “misled,” judge refuses to rubber-stamp Anthropic's proposed settlement."
    ],
    "image_url": "",
    "titles": [
      "Judge puts Anthropic&#8217;s $1.5 billion book piracy settlement on hold",
      "Judge: Anthropic’s $1.5B settlement is being shoved “down the throat of authors”"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.949,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.645,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A federal judge has halted Anthropic's $1.5 billion book piracy settlement, expressing concerns over the terms and feeling misled. Judge William Alsup rejected the proposed agreement during a hearing, pausing the settlement process.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Eagles' Jalen Carter Fined by NFL, Cleared for Super Bowl Rematch",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Tue, 09 Sep 2025 20:57:29 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sports Illustrated"
    ],
    "domains": [
      "news.google.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Carter is eligible to play in Philadelphia's Super Bowl rematch vs. Kansas City in Week 2",
      "<a href=\"https://news.google.com/rss/articles/CBMigAFBVV95cUxPLVlXanhjd1c1SmRwbFZnQW9VN1RMUTJhMC1qRmszQ3Zvdm9SVldCeWNBeGNRXzhjckZMMlUzbUNBN2VKbzlqZzZMZm9fNmJBS1NIRXcwcUNDTWljS25XUDNBLTlrZEVmcVpzeFVKeE5EOGF5QjFpWlNwQmYxRjFkOA?oc=5\" target=\"_blank\">NFL Hands Eagles DT Jalen Carter Hefty Fine for Spitt"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/09/137da570-3e74-4412-b3b7-977a834f7323/carter.jpg",
    "titles": [
      "Jalen Carter fined: Eagles star docked $57K for spitting on Dak Prescott, will not be suspended another game",
      "NFL Hands Eagles DT Jalen Carter Hefty Fine for Spitting at Dak Prescott - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.934,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.642,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Jalen Carter, a defensive tackle for the Philadelphia Eagles, has been fined by the NFL but remains eligible to play in the upcoming Super Bowl rematch against Kansas City in Week 2.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Apple Launches iPhone with A19 Chip, Bigger Battery, and Advanced Camera",
    "domain": "technology",
    "source_domain": "techcrunch.com",
    "location": "global",
    "published": "Tue, 09 Sep 2025 20:18:25 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch",
      "Ars Technica"
    ],
    "domains": [
      "techcrunch.com",
      "arstechnica.com"
    ],
    "snippets": [
      "The iPhone camera has long checked all the boxes for anything that a casual user might need, making a digital camera obsolete for most consumers.",
      "The devices are powered by the new A19 Pro chipset and have a larger battery, Apple said. Plus, it noted that eSIM-only models will have a slightly larger battery as compared to Pro models with physical SIMs.",
      "Aluminum unibody and three-lens \"camera plateau\" give the phone a new look."
    ],
    "image_url": "",
    "titles": [
      "Apple’s creator-centric iPhone 17 Pro will make the vlogging camera obsolete",
      "Apple launches iPhone 17 Pro with major camera upgrades",
      "Apple “started from scratch” to design all-new iPhone 17 Pro and Pro Max"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.921,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.639,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Apple's latest iPhone features an A19 Pro chipset, a larger battery, and an aluminum unibody design with a three-lens camera plateau. The company highlighted that eSIM-only models will have a slightly larger battery than those with physical SIMs. This enhancement continues to make digital cameras unnecessary for casual users, further integrating all necessary photography capabilities into the iPhone.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "AirPods Pro 3 Unveiled: Real-Time Translation, Enhanced Features at $249",
    "domain": "technology",
    "source_domain": "techcrunch.com",
    "location": "global",
    "published": "Tue, 09 Sep 2025 17:45:00 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch",
      "Ars Technica"
    ],
    "domains": [
      "techcrunch.com",
      "arstechnica.com"
    ],
    "snippets": [
      "Get a look at the real-time translation the new AirPods Pro 3 bring to your ears, which you can prompt through a gesture. Powered by Apple Intelligence, it uses noise cancellation to reduce the volume of the speaker to elevate the provided translation to the user. It came as one of several updates t",
      "It’s been three years since Apple refreshed the AirPods Pro line, releasing the Pro 2 model in 2022. The new AirPods Pro will be priced at $249.",
      "Plus upgrades to active noise cancellation and battery life."
    ],
    "image_url": "",
    "titles": [
      "Watch Apple’s AirPod Pro 3 live translation feature in action",
      "AirPods Pro 3 arrive with heart-rate sensing and live translation using Apple Intelligence",
      "Apple introduces AirPods Pro 3 with live translation feature"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.873,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.637,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The new AirPods Pro 3, priced at $249, offers real-time translation through a gesture, utilizing Apple Intelligence and improved noise cancellation to enhance the translation experience for the user. This feature is part of several updates, alongside upgrades to active noise cancellation and battery life, marking Apple's first refresh of the AirPods Pro line in three years since the Pro 2 model in 2022.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Fed Under Pressure to Cut Rates Amid Slowing Economy Predictions for 2025",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Tue, 09 Sep 2025 17:56:25 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Fortune"
    ],
    "domains": [
      "www.cnbc.com",
      "fortune.com"
    ],
    "snippets": [
      "Pressure is on for the Fed to start lowering  rates, with markets expecting a cut at each of the three remaining meetings this year.",
      "\"The revision shows the economy entered 2025 with less momentum than previously understood,” said Bill Adams, Chief Economist at Comerica Bank."
    ],
    "image_url": "",
    "titles": [
      "U.S. economy is worse than thought with 1.2 million fewer jobs — what that means for the Fed",
      "The U.S. economy actually grew by nearly a million fewer jobs than previously thought, and it shows ‘AI is automating away tech jobs,’ economist says"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.859,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.627,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Federal Reserve faces increasing pressure to reduce interest rates, with market anticipations of a cut in each of the year's three remaining meetings. This comes as the economy shows signs of slowing down entering 2025, with less momentum than initially expected, according to Bill Adams, Chief Economist at Comerica Bank.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Apple Launches iPhone 17 with 6.3-inch Screen, Replaces Plus Model",
    "domain": "technology",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Tue, 09 Sep 2025 17:32:39 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMijgFBVV95cUxOTjVLRU51ekNzSEQyUExKb1dGSVNLcmtuUEVBOHFLVTJQaXdlZ2NRUDJVcDBNeDV5WjBQOU9mb1NOeVh6ekdnUjdXMW1MNmhuYXRTVGVlYkltbUxUWHFyTUczZTVGc25qLUR5b0huazdmVmplb2w5aUpzVEpxYWtrWGpac2I4cDRwOE85eXF3?oc=5\" target=\"_blank\">Apple debuts iPhone 17 and thinner ",
      "This replaces the Plus model in the company’s 2025 lineup, following the underperformance of the iPhone 16 Plus last year.",
      "The iPhone 17 has a slightly bigger screen at 6.3 inches as compared to the 6.1-inch screen of the iPhone 16. The display is getting an upgrade with ProMotion."
    ],
    "image_url": "",
    "titles": [
      "Apple debuts iPhone 17 and thinner iPhone Air - Axios",
      "Apple debuts the $999 ultra-thin iPhone Air",
      "Apple launches iPhone 17 with a 120 Hz display"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.852,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.625,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Apple introduced the iPhone 17, featuring a larger 6.3-inch screen and an upgraded ProMotion display, replacing the Plus model in its 2025 lineup due to the iPhone 16 Plus's underperformance.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "House Dems Release Epstein's 50th Birthday Scrapbook with Notable Figures",
    "domain": "business",
    "source_domain": "www.ft.com",
    "location": "global",
    "published": "Tue, 09 Sep 2025 14:15:01 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.ft.com"
    ],
    "snippets": [
      "Document released by House Democrats has apparent contributions from Trump, Clinton, Mandelson and Leon Black",
      "<p>Figures including Donald Trump, Bill Clinton and the UK ambassador to US, Peter Mandelson, apparently contributed</p><p>Democratic politicians have released a 238-page scrapbook given to Jeffrey Epstein as a present on his 50th birthday, with contributions attributed to high-profile figures inclu"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Fd8da0bd8-f072-4af2-8085-1248b6d6f64d.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Who’s who in Jeffrey Epstein’s birthday book",
      "Epstein 50th birthday book: who is in it and what did they say?"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.795,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.614,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "House Democrats released a 238-page scrapbook gifted to Jeffrey Epstein for his 50th birthday, featuring contributions from notable figures like Donald Trump, Bill Clinton, UK Ambassador Peter Mandelson, and Leon Black. This document highlights the connections between Epstein and various high-profile individuals.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Lachlan Murdoch Takes Full Control of Fox and News Corp",
    "domain": "business",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Tue, 09 Sep 2025 06:01:10 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "Forbes"
    ],
    "domains": [
      "www.forbes.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "<p>Eldest son will now be what Rupert Murdoch has described as ‘protector of the conservative voice in the English-speaking world’</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/sep/09/australia-news-live-anthony-albanese-vanuatu-china-pacific-forum-murray-watt-nature-pr",
      "Lachlan Murdoch now holds full control of Fox and News Corp, raising fresh questions about media consolidation and the future of his family's empire."
    ],
    "image_url": "https://i.guim.co.uk/img/media/1e641abe169a7dc8e5a6571b466d416eb2e5ca4a/691_87_1877_1502/master/1877.jpg?width=140&quality=85&auto=format&fit=max&s=82ffe71d3bb5bd8bff5b32778743079f",
    "titles": [
      "Lachlan Murdoch is now in control of News Corp and its Australian newspapers are safe – for now",
      "Lachlan Murdoch’s Control Of Fox And News Corp. Sets The Stage For M&A"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.67,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.599,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Lachlan Murdoch has assumed full control of Fox and News Corp, a move described by Rupert Murdoch as positioning him as the 'protector of the conservative voice in the English-speaking world.' This development prompts discussions on media consolidation and the future direction of the Murdoch family's media empire.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  }
]