[
  {
    "title": "Poland and NATO Allies Shoot Down Russian Drones in Airspace Violation Incident",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Wed, 10 Sep 2025 03:55:39 -0400",
    "source": "NPR",
    "sources": [
      "Financial Times",
      "Forbes",
      "Business Insider",
      "New York Times",
      "Washington Post",
      "NPR",
      "Axios",
      "Deutsche Welle",
      "ABC News",
      "The Guardian"
    ],
    "domains": [
      "www.washingtonpost.com",
      "www.npr.org",
      "www.businessinsider.com",
      "news.google.com",
      "www.ft.com",
      "www.forbes.com",
      "www.dw.com",
      "www.theguardian.com",
      "www.nytimes.com",
      "abcnews.go.com"
    ],
    "snippets": [
      "Poland said Wednesday that it and its NATO allies had shot down Russian drones that violated Polish airspace in what it called an \"act of aggression\" as Russia launched aerial attacks on Ukraine.",
      "NATO member Poland scrambled air defenses in response to a \"huge number of Russian drones\" violating its airspace. The EU said the incursion appeared to be \"intentional.\" DW has the latest.",
      "<a href=\"https://news.google.com/rss/articles/CBMihAFBVV95cUxOUFd1dlpHZ1BCMWNTYU84TVNLOHFnM0I2NjcwN0JJQnExNmxONzJNZldXVnpjX0FmUHhRSHpFdGJWN3BRcTJQa29PMEVQbVpvemNIdWtoMU5Oa1dUY1QwU1JiUGZreXV3OFVIc3BrS3pGNk9UanZucWtVSnkwT0VSejdzMlY?oc=5\" target=\"_blank\">NATO member Poland's military says it shot down ",
      "Military officials in Poland say the country's airspace was \"repeatedly violated by drone-type objects\" in the overnight hours amid Russian strikes on targets in Ukraine.",
      "Prime Minister Donald Tusk accuses Moscow of ‘large-scale provocation’ with incursions",
      "<p>Tusk says that those which posed a threat were shot down as Zelenskyy says incursion sets ‘extremely dangerous precedent for Europe’</p><ul><li><p><a href=\"https://www.theguardian.com/world/2025/sep/10/poland-shoots-down-drones-over-its-territory-amid-russian-attack-on-ukraine-says-military\">Full",
      "<p>Donald Tusk says operation was launched after ‘repeated violations of Polish airspace’</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/sep/10/poland-pm-condemns-repeated-violation-of-airspace-amid-russian-attack-on-ukraine-follow-live\">Follow the latest updates live</a></p></li",
      "The Russian action amounts to an unprecedented violation of Polish airspace and posed “a real threat” to Polish citizens, the Polish military said.",
      "The Polish military called the incursions an “act of aggression.” It said the drones crossed the border during a wave of Russian strikes in Ukraine.",
      "Polish Prime Minister Donald Tusk said the drones posed a “direct threat” to his country and were therefore shot down.",
      "Poland's prime minister said the country's armed forces downed Russian drones that could have posed a threat."
    ],
    "image_url": "",
    "titles": [
      "Poland says it shot down Russian drones that violated its airspace",
      "Poland hits drones in its airspace as Russia attacks Ukraine",
      "NATO member Poland's military says it shot down Russian drones in its airspace - Axios",
      "Poland downs Russian drones as 'huge number' violate airspace, prime minister says",
      "Poland shoots down Russian drones",
      "‘Huge number of Russian drones’ violated our airspace, says Poland’s PM – follow live",
      "Poland shoots down drones over its territory amid Russian attack on Ukraine",
      "Poland says it shot down Russian drones that violated its airspace",
      "Poland Says It Shot Down Russian Drones That Entered Its Airspace",
      "NATO Member Poland Says It Shot Down Russian Drones That Violated Its Airspace",
      "Poland says it shot down Russian drones that repeatedly violated its airspace"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.992,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.873,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Poland and its NATO allies shot down Russian drones after they violated Polish airspace, an action Poland labeled as an \"act of aggression.\" This incident occurred amid Russian aerial attacks on Ukraine, with the Polish military responding to a significant incursion of drones. The EU suggested the intrusion was intentional. Polish Prime Minister Donald Tusk condemned the violation, highlighting the direct threat to Poland and describing it as a large-scale provocation. The situation marks an unprecedented violation of Polish airspace and has been deemed a serious security concern for Europe.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Judge Blocks Trump's Attempt to Fire Fed Governor Cook",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Tue, 09 Sep 2025 23:29:38 -0400",
    "source": "NPR",
    "sources": [
      "Financial Times",
      "Forbes",
      "Business Insider",
      "BBC",
      "CNBC",
      "NPR",
      "ABC News"
    ],
    "domains": [
      "www.npr.org",
      "www.businessinsider.com",
      "www.bbc.com",
      "www.ft.com",
      "www.forbes.com",
      "www.cnbc.com",
      "abcnews.go.com"
    ],
    "snippets": [
      "Federal Reserve Governor Lisa Cook won a round in federal court in her bid to keep her job despite President Trump's effort to fire her.",
      "The judge's ruling is a win for the US Federal Reserve following criticism by the president.",
      "Federal judge blocks Trump's attempt to fire Federal Reserve Governor Lisa Cook.",
      "The Supreme Court is likely to have the final say on whether President Donald Trump has legal cause to remove Lisa Cook from the Federal Reserve.",
      "Ruling allows central bank board member to attend its next rate-setting meeting",
      "The judge said Cook had made a strong argument that her “purported removal was done in violation of the Federal Reserve Act’s ‘for cause’ provision.”",
      "President Donald Trump's historic decision to remove a member of the Federal Reserve board will likely head to the Supreme Court."
    ],
    "image_url": "",
    "titles": [
      "Federal judge blocks Trump from firing Fed Governor Lisa Cook, for now",
      "Trump temporarily blocked from firing Fed governor",
      "Federal judge temporarily blocks Trump's attempt to fire Lisa Cook",
      "Trump blocked from firing Fed Governor Lisa Cook as lawsuit plays out",
      "Judge rules President Trump cannot fire Fed’s Lisa Cook for now",
      "Federal Judge Temporarily Blocks Trump’s Firing Of Fed Governor Lisa Cook",
      "Judge blocks Trump's attempt to fire Lisa Cook from Federal Reserve board, setting up Supreme Court showdown"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.904,
      "consensus": 1.0,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.866,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A federal judge has blocked President Trump's attempt to fire Federal Reserve Governor Lisa Cook, allowing her to retain her position and attend the next rate-setting meeting. The judge ruled that Trump's effort to remove Cook likely violated the Federal Reserve Act's 'for cause' provision. The case, marking a significant challenge to presidential authority over the Federal Reserve, is expected to be ultimately decided by the Supreme Court.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Proposes Tariffs on India, China to Pressure Russia on Ukraine Talks",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Wed, 10 Sep 2025 07:36:11 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Financial Times",
      "CNBC",
      "The Guardian"
    ],
    "domains": [
      "www.cnbc.com",
      "www.ft.com",
      "www.theguardian.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Steep tariffs would be part of joint effort to pressure Russia to end its war on Ukraine, according to reports.",
      "U.S. President Donald Trump has asked the European Union to hit China and India with tariffs of up to 100% over the countries' Russia oil purchases.",
      "US president makes extraordinary demand in bid to force Russia to end invasion of Ukraine",
      "<p>In effort to end Russia’s war in Ukraine, US president proposes tariffs of up to 100% targeting Putin allies and trade partners</p><p>Donald Trump has asked the EU to impose tariffs of up to 100% on India and China as part of an effort to force the Russian president, Vladimir Putin, to end the wa",
      "<p>In effort to end Russia’s war in Ukraine, US president reportedly proposes tariffs of up to 100% targeting Putin allies and trade partners</p><p>Donald Trump has asked the EU to impose tariffs of up to 100% on India and China as part of an effort to force the Russian president, Vladimir Putin, to"
    ],
    "image_url": "",
    "titles": [
      "Trump pushing EU to slap 100% tariffs on China, India, reports say",
      "Trump presses European Union to impose 100% tariffs on India and China to pressure Putin",
      "Trump tells EU to hit China and India with 100% tariffs to pressure Putin",
      "Trump asks EU to impose high tariffs on India and China to put pressure on Russia",
      "Trump reportedly asks EU to impose 100% tariffs on India and China"
    ],
    "score_components": {
      "magnitude": 0.992,
      "recency": 0.985,
      "consensus": 0.908,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.831,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "President Donald Trump has proposed imposing new tariffs on India and China as a strategy to pressure Russia into negotiating with Ukraine. He stated this condition is contingent upon EU nations agreeing to implement similar measures. This move is part of an effort to end Russia's invasion of Ukraine.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Supreme Court to Fast-Track Case on Trump's Tariffs After Lower Court Rulings",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Tue, 09 Sep 2025 16:47:28 -0400",
    "source": "NPR",
    "sources": [
      "Al Jazeera",
      "Financial Times",
      "CNBC",
      "NPR"
    ],
    "domains": [
      "www.cnbc.com",
      "www.ft.com",
      "www.npr.org",
      "www.aljazeera.com"
    ],
    "snippets": [
      "The tariffs have become a flashpoint, with two lower courts declaring them illegal, and the president asking the Supreme Court for reversal as soon as possible.",
      "Two lower courts have said some of President Trump's tariffs are unlawful. Now the Supreme Court has agreed to examine the issue.",
      "The Supreme Court has scheduled to hear the case in November, lightning fast by its typical standards.",
      "A federal appeals court recently ruled that many of President Donald Trump's wide-ranging tariffs in imports from most countries are illegal.",
      "Case marks first test of president’s use of emergency powers to impose policies"
    ],
    "image_url": "",
    "titles": [
      "Supreme Court agrees to hear challenge to some of Trump's sweeping tariffs",
      "Supreme Court will weigh in on Trump's tariffs. Here's what to know about the case",
      "US Supreme Court to decide legality of Trump’s tariffs",
      "Supreme Court will hear Trump tariffs case on fast track",
      "US Supreme Court to consider legality of Trump’s tariffs in November"
    ],
    "score_components": {
      "magnitude": 0.932,
      "recency": 0.787,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.786,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Supreme Court has agreed to expedite a case concerning the legality of some tariffs imposed by President Trump, following rulings by two lower courts that declared them illegal. This case represents a significant test of Trump's presidential authority and his economic policies. The Supreme Court is set to hear the case in November, indicating the urgency of the matter. If the Supreme Court upholds the lower court's decision, companies and consumers could seek refunds for the tariffs paid.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "U.S. Informed Before Israel's Strike on Hamas in Qatar, Source Says",
    "domain": "general",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Tue, 09 Sep 2025 18:58:59 GMT",
    "source": "The Guardian",
    "sources": [
      "Washington Post",
      "New York Times",
      "The Guardian",
      "CityNews"
    ],
    "domains": [
      "www.theguardian.com",
      "www.washingtonpost.com",
      "www.nytimes.com",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "<p>Hamas says six were killed but its leadership survived the attack, which the US says ‘does not advance Israel or America’s goals’</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/sep/09/israel-gaza-city-evacuation-order-idf-military-offensive-live-updates-middle-east-crisis-late",
      "Qatar says it will continue its efforts to mediate between Israel and Hamas. But diplomats and analysts believe the short term prospects for peace look dim.",
      "The attack in the Qatari capital, Doha, sought to assassinate much of Hamas’s leadership, but the militant group said no senior figures were killed.",
      "DUBAI, United Arab Emirates (AP) — Israel struck the headquarters of Hamas&#8217; political leadership in Qatar on Tuesday as the group&#8217;s top figures gathered to consider a U.S. proposal for a ceasefire in the Gaza Strip. The strike on the territory of a U.S. ally marked a stunning escalation ",
      "The Gulf nation of Qatar has been trying to negotiate a cease-fire in the conflict. The attack threatened to destabilize those peace efforts."
    ],
    "image_url": "https://i.guim.co.uk/img/media/52c59e33ee6f6f589155fd0f5fe6e097a37a68bc/125_0_3722_2978/master/3722.jpg?width=140&quality=85&auto=format&fit=max&s=846e55009a8dd32e8c7887c83b7d41de",
    "titles": [
      "Israel launches airstrikes against top Hamas members in Qatar for Gaza ceasefire talks",
      "Israeli strike takes fight with Hamas to Qatar, key intermediary in Gaza talks",
      "Israeli airstrike targets top Hamas leaders, upending ceasefire talks",
      "Israeli strike in Qatar targets Hamas leaders as they weigh Gaza ceasefire proposal",
      "Israel Attempts to Kill Hamas Leadership in Airstrike on Qatar, a Gaza War Mediator"
    ],
    "score_components": {
      "magnitude": 0.932,
      "recency": 0.742,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.752,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The U.S. was informed before Israel conducted a strike on Hamas in Qatar, described by Doha as a cowardly act and a violation of international law. This information comes from a source familiar with the situation but not authorized to speak publicly. The Pentagon has not commented on the matter.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Nepal Protests Turn Violent: 19 Dead, 200 Injured Amid Anti-Corruption Outcry",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Tue, 09 Sep 2025 20:56:31 -0400",
    "source": "NPR",
    "sources": [
      "BBC",
      "NPR",
      "New York Times"
    ],
    "domains": [
      "www.nytimes.com",
      "www.npr.org",
      "www.bbc.com"
    ],
    "snippets": [
      "At least 19 people have been killed in the protests and more than 200 others were admitted to the hospital due to injuries, according to Nepal's Civil Service Hospital.",
      "Fierce protests against corruption and nepotism spiralled into arson and violence on Tuesday.",
      "Protests in Nepal turned  deadly after thousands of youngsters marched against the blocking of social media platforms.",
      "Demonstrators have set fire to government buildings. The military has sent in troops to restore order.",
      "A recent ban on social media brought young people to the streets, but they came filled with grievances that have built up over years."
    ],
    "image_url": "",
    "titles": [
      "What to know about the mass Gen Z protests in Nepal",
      "Nepal protests 'hijacked', Gen Z claim, as army patrols the streets",
      "What we know about anti-corruption protests in Nepal",
      "Explosive Protests in Nepal",
      "The Forces Behind Nepal’s Explosive Gen Z Protests: What to Know"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.858,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.733,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In Nepal, protests against corruption, nepotism, and a social media ban escalated into violence, resulting in at least 19 deaths and over 200 injuries. Demonstrations turned deadly when protestors, primarily young people frustrated by longstanding grievances, resorted to arson, attacking government buildings. The military has been deployed to restore order amidst the chaos.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Novo Nordisk to Cut 9,000 Jobs, Focus on Obesity, Diabetes Meds",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Wed, 10 Sep 2025 07:18:33 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Financial Post",
      "The Guardian"
    ],
    "domains": [
      "www.cnbc.com",
      "www.theguardian.com",
      "financialpost.com"
    ],
    "snippets": [
      "Novo Nordisk, which produces Wegovy and Ozempic, said roughly 9,000 roles would be cut, with 5,000 of these reductions expected in Denmark.",
      "<p>Danish manufacturer of weight-loss and diabetes drugs under pressure from US rival Eli Lilly </p><ul><li><p><a href=\"https://www.theguardian.com/business/live/2025/sep/10/trade-tariffs-eu-trump-ozempic-novo-jobs-markets-business-live-news\">Business live – latest news</a></p></li></ul><p>The maker",
      "FRANKFURT, Germany (AP) &#8212; Danish pharmaceutical company Novo Nordisk, maker of weight-loss drug Wegovy, said Wednesday it would cut 9,000 jobs, 5,000 of them in Denmark, in order to strengthen the company&#8217;s focus on growth opportunities in obesity and diabetes medications. The restructur"
    ],
    "image_url": "",
    "titles": [
      "Wegovy-maker Novo Nordisk to cut around 9,000 jobs",
      "Ozempic maker Novo Nordisk to cut 9,000 jobs amid increased competition",
      "Novo Nordisk, maker of obesity drug Wegovy, to cut 9,000 jobs to sharpen focus, meet competition"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.959,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.729,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Novo Nordisk, a Danish pharmaceutical company, announced it will cut 9,000 jobs, with 5,000 of these in Denmark, to focus on growth in obesity and diabetes medications. This move comes as the company faces competition from US rival Eli Lilly.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Iran, IAEA Sign Deal in Cairo to Renew Nuclear Inspections",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Tue, 09 Sep 2025 15:43:13 -0400",
    "source": "NPR",
    "sources": [
      "New York Times",
      "NPR",
      "Deutsche Welle"
    ],
    "domains": [
      "www.nytimes.com",
      "www.npr.org",
      "www.dw.com"
    ],
    "snippets": [
      "Iran and the International Atomic Energy Agency signed an agreement in Cairo to pave the way for resuming cooperation, including on ways of relaunching inspections of Iran's nuclear facilities.",
      "Iran and the IAEA agreed on a new cooperation framework which could lead to the resumption of nuclear site inspections, largely stalled since Israel then the US attacked Iranian nuclear facilities in June.",
      "Iran has not allowed inspections since its nuclear sites were bombed by Israel and the United States in June, but it hopes to stave off Western economic sanctions."
    ],
    "image_url": "",
    "titles": [
      "Iran and nuclear watchdog sign agreement seeking path to restart cooperation",
      "Iran, UN nuclear watchdog progress on nuclear inspections",
      "Iran and U.N. Watchdog Reach Agreement to Resume Nuclear Inspections"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.769,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.723,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Iran and the International Atomic Energy Agency (IAEA) signed an agreement in Cairo, setting a framework for renewed cooperation and the potential resumption of inspections at Iran's nuclear facilities. This move comes after inspections were largely halted following attacks on these sites by Israel and the United States in June. The agreement aims to facilitate inspections and avert Western economic sanctions against Iran.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Israel Airstrike Targets Hamas Leaders in Qatar, Sparks International Criticism",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 09 Sep 2025 19:06:52 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "LA Times",
      "Deutsche Welle"
    ],
    "domains": [
      "www.latimes.com",
      "www.dw.com",
      "www.bbc.com",
      "www.bbc.co.uk"
    ],
    "snippets": [
      "The Doha attack signals that Benjamin Netanyahu will press forward hard on all fronts, writes Jeremy Bowen.",
      "Hamas says six people killed in air strike but its leadership team survived.",
      "The Israeli military says it attacked Hamas' leadership in Qatar's capital, Doha, where the militant group's political leaders and negotiators are based.",
      "<p>Israeli leader Benjamin Netanyahu said the strike in Doha, Qatar, was to avenge Oct. 7. \"The days are over when terror leaders can enjoy immunity,\" he said.</p>"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/5aab/live/b97892a0-8db1-11f0-9cf6-cbf3e73ce2b9.jpg",
    "titles": [
      "Bowen: Diplomacy in ruins after Israel strikes Hamas leaders in Qatar",
      "Israel Strikes Hamas In Qatar",
      "Israeli military strikes Hamas leaders in Qatar",
      "Israel expands campaign beyond Gaza, hitting Hamas leaders in Qatar"
    ],
    "score_components": {
      "magnitude": 0.887,
      "recency": 0.744,
      "consensus": 0.809,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.722,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Israel conducted an airstrike in Doha, Qatar, targeting senior Hamas leaders, sparking criticism from Qatar, which condemned the attack as 'criminal' and a threat to peace efforts. The U.S. Embassy in Doha responded with a shelter-in-place order. This action marks a significant escalation, as Hamas' exiled leadership, involved in long-standing negotiations with Israel facilitated by Qatar, was targeted.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Apple Launches iPhone with A19 Chip, Bigger Battery, and Advanced Camera",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-09-09T20:05:58-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge",
      "Ars Technica",
      "TechCrunch"
    ],
    "domains": [
      "www.theverge.com",
      "techcrunch.com",
      "arstechnica.com"
    ],
    "snippets": [
      "It’s less noticeable than a thinner profile or trick camera lenses, but Apple is pointing out another upgrade in the iPhone 17 family of phones that it says is part of “the most significant upgrade to memory safety in the history of consumer operating systems.” Explicitly targeting the spyware indus",
      "The devices are powered by the new A19 Pro chipset and have a larger battery, Apple said. Plus, it noted that eSIM-only models will have a slightly larger battery as compared to Pro models with physical SIMs.",
      "Aluminum unibody and three-lens \"camera plateau\" give the phone a new look."
    ],
    "image_url": "",
    "titles": [
      "Apple says the iPhone 17 comes with a massive security upgrade",
      "Apple launches iPhone 17 Pro with major camera upgrades",
      "Apple “started from scratch” to design all-new iPhone 17 Pro and Pro Max"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.843,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.705,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Apple's latest iPhone features an A19 Pro chipset, a larger battery, and an aluminum unibody design with a three-lens camera plateau. The company highlighted that eSIM-only models will have a slightly larger battery than those with physical SIMs. This enhancement continues to make digital cameras unnecessary for casual users, further integrating all necessary photography capabilities into the iPhone.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Man Charged in Fatal Stabbing of Ukrainian Immigrant on NC Train",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Tue, 09 Sep 2025 21:55:44 GMT",
    "source": "Axios",
    "sources": [
      "ABC News",
      "Axios",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "abcnews.go.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMilgFBVV95cUxOOXJOLTAxd1NFRHZ6T25qRzdYc05fUU1hbjVJRkFUd1llZVdhYXVWSmF5d0RuQllFTEplZWxRRjlPZXJhallmZ29leExBeUJ6alg4QnRvNEZqdlZ6ZmJIcUpwMWpEREpva3l1dklaaG9pMDg5ekNZUVpPOVpvdnRyNXJManJ3YTl5bzBCVEtBSHZ3bkZBcnc?oc=5\" target=\"_blank\">Suspect in stabbing deat",
      "The suspect fatally stabbed a Ukrainian immigrant on Charlotte's light rail system late last month.",
      "<p>Charge for Decarlos B Jr, accused of killing Iryna Zarutska in apparent random attack on train, could carry death penalty</p><p>The justice department on Tuesday charged a man accused of fatally stabbing a Ukrainian refugee on a North Carolina commuter train last month with a federal crime that c"
    ],
    "image_url": "",
    "titles": [
      "Suspect in stabbing death of Ukrainian refugee charged with federal crime - Axios",
      "Suspect in Charlotte train stabbing facing federal charges, possible death penalty",
      "Suspect in stabbing of Ukrainian woman in North Carolina charged with federal crime"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.789,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.702,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Decarlos B Jr. has been charged by the justice department with a federal crime for the fatal stabbing of Ukrainian immigrant Iryna Zarutska on a North Carolina commuter train last month. The attack, which appears to be random, could result in the death penalty for the accused.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Apple Unveils iPhone Air, iPhone 17, and New Watches with Health Alerts",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-09-09T17:00:00-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge",
      "Ars Technica",
      "TechCrunch"
    ],
    "domains": [
      "www.theverge.com",
      "techcrunch.com",
      "arstechnica.com"
    ],
    "snippets": [
      "The iPhone Air and the iPhone 17 fleet of phones took the spotlight during Apple’s “Awe dropping” event. If you weren’t tempted by the new phones, the fact that the entire Apple Watch lineup got refreshed might have been even bigger news to you. Soon, the Apple Watch SE 3, Apple Watch Series 11, and",
      "One perk is the Apple Watch Series 11 can alert you to possible hypertension. Apple says it plans to notify over 1 million people with undiagnosed hypertension in the first year alone.",
      "$799 Ultra Watch 3 will debut alongside the Watch Series 11 and Watch SE 3."
    ],
    "image_url": "",
    "titles": [
      "How to preorder the Apple Watch SE 3, Apple Watch Series 11, and Apple Watch Ultra 3",
      "Apple unveils Apple Watch Series 11, Watch Ultra 3, and Watch SE 3",
      "Apple adds hypertension and sleep-quality monitoring to Watch Ultra 3, Series 11"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.79,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.702,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "At Apple's \"Awe dropping\" event, the iPhone Air, iPhone 17, and a refreshed Apple Watch lineup were announced. The new Apple Watch Series 11 features a hypertension alert system, aiming to notify over 1 million people of undiagnosed hypertension in its first year. Additionally, the $799 Ultra Watch 3 was introduced alongside the Watch Series 11 and Watch SE 3.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Heineman's 10th-Inning Hit Secures Blue Jays Win Over Astros",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Wed, 10 Sep 2025 04:04:40 +0000",
    "source": "Global News",
    "sources": [
      "Sportsnet",
      "Global News"
    ],
    "domains": [
      "www.sportsnet.ca",
      "globalnews.ca"
    ],
    "snippets": [
      "Tyler Heineman was still buzzing around the Toronto Blue Jays clubhouse more than 40 minutes after he drove in the winning run in the 10th inning.",
      "<p>Joon Lee joins Evanka Osmak and Ken Reid to discuss the Blue Jays&#8217; gritty win over the Astros, how the win gives perspective despite losing Bo Bichette from the lineup, who will need to step up in his absence, and how Vlad Guerrero Jr. set the tone.</p>"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/5465523aa536e36a7b4d9f5921451b8ce5bbc06c2d78b046c22e04d691005249.jpg?quality=65&strip=all",
    "titles": [
      "Blue Jays lose Bichette, but win thriller",
      "How ‘gritty’ win gives Blue Jays perspective despite losing Bichette"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.915,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.688,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Tyler Heineman drove in the winning run for the Toronto Blue Jays in the 10th inning, securing a victory over the Astros. The win is significant as it comes during a period when the team is without key player Bo Bichette. Discussions on the game highlight the team's resilience and the need for players, including Vlad Guerrero Jr., to step up in Bichette's absence.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Premier League Resumes After International Break and Transfer Window",
    "domain": "sports",
    "source_domain": "onefootball.com",
    "location": "national",
    "published": "Wed, 10 Sep 2025 07:43:00 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Sky Sports",
      "Yahoo Sports"
    ],
    "domains": [
      "www.skysports.com",
      "onefootball.com"
    ],
    "snippets": [
      "The first international break of the season has concluded, as qualification for next summer’s World Cup heated up.Premier League players jetted far and wide to represent their countries with several...",
      "The Scottish Premiership returns from the international break this weekend, but are clubs returning stronger after the end of the transfer window?"
    ],
    "image_url": "",
    "titles": [
      "Five Premier League players who shone in the international break",
      "Which Scottish Premiership clubs are stronger after international break?"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.988,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.653,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The first international break of the season has ended, with Premier League players returning from representing their countries in World Cup qualifiers. The Scottish Premiership is set to resume this weekend, following the conclusion of the international break and the transfer window.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Afghanistan Defeats Hong Kong in Asia Cup Opener",
    "domain": "sports",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Wed, 10 Sep 2025 07:37:13 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Yahoo Sports"
    ],
    "domains": [
      "www.aljazeera.com"
    ],
    "snippets": [
      "Afghanistan begin their Asia Cup campaign with a thrashing of tournament minnows Hong Kong in Abu Dhabi.",
      "Afghanistan begin their Asia Cup campaign with a thrashing of tournament minnows Hong Kong in Abu Dhabi."
    ],
    "image_url": "",
    "titles": [
      "Afghanistan dominate Hong Kong in Asia Cup 2025 cricket opener",
      "Afghanistan dominate Hong Kong in Asia Cup 2025 cricket opener"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.986,
      "consensus": 0.571,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.647,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Afghanistan started their Asia Cup campaign by defeating Hong Kong in Abu Dhabi. The match ended with Afghanistan dominating Hong Kong, showcasing a strong performance. Afghanistan's victory sets a positive tone for their participation in the tournament.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Ward Doubts Alvarez's Strategy Against Crawford in Saturday Fight",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 10 Sep 2025 06:42:38 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Yahoo Sports"
    ],
    "domains": [
      "www.bbc.com"
    ],
    "snippets": [
      "Andre Ward writes for BBC Sport, asking if Saul 'Canelo' Alvarez can find the blueprint to beat Terence Crawford on Saturday.",
      "Andre Ward writes for BBC Sport, asking if Saul 'Canelo' Alvarez can find the blueprint to beat Terence Crawford on Saturday."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/dbe7/live/5c2f3b30-8d98-11f0-b391-6936825093bd.png",
    "titles": [
      "'Losing is not a good look' - Ward breaks down Canelo-Crawford",
      "'Losing is not a good look' - Ward breaks down Canelo-Crawford"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.947,
      "consensus": 0.571,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.646,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Andre Ward questions if Saul 'Canelo' Alvarez can discover the strategy to defeat Terence Crawford in their upcoming fight on Saturday. The article discusses the potential tactics and challenges Alvarez may face.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Inside the Lines Releases Week 2 Fantasy Football Rankings and Stock Report",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 9 Sep 2025 18:12:12 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Weekly individual and composite rankings for each position in PPR and IDP formats.",
      "The Inside the Lines team uses its proven NFL model to break down why our projected rankings for Week 2 differ significantly from the Fantasy Football Today consensus"
    ],
    "image_url": "",
    "titles": [
      "Fantasy football rankings for Week 2",
      "Fantasy football start/sit in Week 2: Bench Jayden Daniels for Dak Prescott? Play DJ Moore over Drake London?"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.81,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.642,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Inside the Lines team released Week 2 fantasy football rankings for PPR and IDP formats, using their NFL model to explain deviations from the Fantasy Football Today consensus. Additionally, they provided a stock report highlighting players whose value is increasing and those who might be worth dropping.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Calgary Flames Extend Goalie Dustin Wolf for Seven Years",
    "domain": "business",
    "source_domain": "www.forbes.com",
    "location": "global",
    "published": "Tue, 09 Sep 2025 21:50:34 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes",
      "NHL"
    ],
    "domains": [
      "www.forbes.com",
      "news.google.com"
    ],
    "snippets": [
      "Calgary Flames GM Craig Conroy continues to lock up his young core, inking goalie Dustin Wolf to a seven-year extension on Tuesday.",
      "<a href=\"https://news.google.com/rss/articles/CBMidkFVX3lxTE1LNUxPNUU4bnUzY2E0WlJQczgxcmlhTWUwVmd4am5ZTnhaeHRDUmRfd3dWWmRHX3V3V0hoVmt4bFVkeUNXZERQbmV0MGVNZ2NBeWFHZlZET3JKaThvZEozTWpZVEh2TjZLcElUVzVmZnlNZ0FHMmc?oc=5\" target=\"_blank\">Flames Re-Sign Dustin Wolf</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">NHL."
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/68c0c74f5e90c5b9d04281db/0x0.jpg?width=960",
    "titles": [
      "NHL Goalie Dustin Wolf Commits To Calgary Flames With 7-Year Extension",
      "Flames Re-Sign Dustin Wolf - NHL.com"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.874,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.64,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Calgary Flames have re-signed goalie Dustin Wolf to a seven-year extension, as announced by GM Craig Conroy. This move is part of Conroy's effort to secure the team's young core for the future.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Packers Re-Sign WR Christian Watson Post-ACL Injury",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Wed, 10 Sep 2025 00:45:38 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sports Illustrated"
    ],
    "domains": [
      "www.cbssports.com",
      "news.google.com"
    ],
    "snippets": [
      "Watson is currently working his way back from a torn ACL he suffered in 2024",
      "<a href=\"https://news.google.com/rss/articles/CBMijAFBVV95cUxPaXI1cnJYeDU1ZWtaTG03MUJrX0xjNkZhZURwcW14MmxuS2N6NGVzSW81cFNnMmpGZDQ1RjJRS0xlckJPNzFQOGRzemF1NXVhenI3U0Z2SzlLenJmQVdlOV8xeEFnWkgxV2ZuaGZFOXQycGdhQmk0ZTZjVXBPQVFsNEc3c2ZKd3ktTVdQcg?oc=5\" target=\"_blank\">Packers Re-Sign WR Christian Watson t",
      "<a href=\"https://news.google.com/rss/articles/CBMihAFBVV95cUxNM1ZSWjlKUmE0ZWljSGZFM0I1d1g5ZGRIOXVUZjRPLVp1SWI2Rlc1bFpBODRTWTd4OWZhaXRtcnE0MU1ua3g1NnRwcXJMSmI1VVpGM29ONlF1enFHYm5QMFRLTGJqaTdILVdqV3JVTkxIdzVLSmZGdkZCeTJoZFJISDV1MWE?oc=5\" target=\"_blank\">Life Is About Choices; Did Packers Make One With"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/10/53bd857e-62bb-41e5-a542-044cd7fafbd0/watson.jpg",
    "titles": [
      "Christian Watson contract: Packers reward WR with one-year extension amid recovery from torn ACL, per report",
      "Packers Re-Sign WR Christian Watson to Extension As He Rehabs From Torn ACL - Sports Illustrated",
      "Life Is About Choices; Did Packers Make One With Christian Watson Contract? - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.854,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.636,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Green Bay Packers have re-signed wide receiver Christian Watson as he recovers from a torn ACL sustained in 2024. This move reaffirms the team's commitment to Watson despite his injury.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: sustain",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Signs Executive Action for Transparency in Pharma Ads",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Tue, 09 Sep 2025 22:45:32 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "MarketWatch"
    ],
    "domains": [
      "www.cnbc.com",
      "www.marketwatch.com"
    ],
    "snippets": [
      "The Trump administration plans to ensure transparency and accuracy in drug ads, including by increasing the amount of information related to any product risks.",
      "President Donald Trump’s administration on Tuesday rolled out an executive action aimed at limiting direct-to-consumer advertising for pharmaceuticals, with officials saying a recent Hims & Hers Health Inc. ad stood out as an example of what should be prevented."
    ],
    "image_url": "",
    "titles": [
      "Trump signs memo to crack down on direct-to-consumer pharma ads",
      "Trump aims to curb direct-to-consumer ads for drugs. Hims & Hers Health could be targeted."
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.803,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.633,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "President Trump signed an executive action on Tuesday targeting pharmaceutical companies to enforce transparency in their advertising, especially on social media. This move aims to increase the disclosure of product risks in direct-to-consumer ads, as part of the administration's effort to ensure accuracy and transparency. The action was partly motivated by concerns over specific ads, including one by Hims & Hers Health Inc., cited as an example of the type of advertising the administration seeks to regulate.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Kyle Schwarber Hits 50th HR, Joins Ryan Howard in Phillies History",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Wed, 10 Sep 2025 01:46:48 +0000",
    "source": "CBS Sports",
    "sources": [
      "Sportsnet",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Schwarber's seventh-inning blast came off the bat at 110.4 mph and went 437 feet to center",
      "<p>Watch as Philadelphia Phillies outfielder Kyle Schwarber launches his 50th home run of the season against the New York Mets to join Ryan Howard as the second player in franchise history to reach that milestone.</p>",
      "<p>Phillies designated hitter Kyle Schwarber reached 50 homers in a season for the first time in his career when he hit a three-run shot Tuesday night against the New York Mets.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/10/578b73fe-3b0d-4747-9d06-092aaae8b961/schwarber-50-imagn.png",
    "titles": [
      "Phillies' Kyle Schwarber hits 50th home run of season, becomes second in franchise history to accomplish feat",
      "Schwarber cranks 50th home run to drive in three runs for Phillies",
      "Phillies’ Kyle Schwarber hits 50th HR, Suarez strikes out 12 in win over Mets"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.873,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.63,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Philadelphia Phillies outfielder Kyle Schwarber hit his 50th home run of the season in a game against the New York Mets, becoming the second player in franchise history, alongside Ryan Howard, to reach this milestone. Schwarber's three-run homer, which marked the first time he has hit 50 homers in a season, came off the bat at 110.4 mph and traveled 437 feet to center field.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Supreme Court Fast-Tracks Case on Trump Tariffs",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Tue, 09 Sep 2025 21:52:19 GMT",
    "source": "Axios",
    "sources": [
      "CNBC",
      "Axios"
    ],
    "domains": [
      "www.cnbc.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMidkFVX3lxTE02cWN2Yll2Z2Vka3U5am1LaTNfTTVNZ1R6Y3pHYUJ4TktBZFRrTk55U2Y2bWhjMTE2MDNRbmpPa0hIV0xmaXVHOTZDNFhOY3g2eW1mTnppTG1xbTE4Z1hKdnlYUmNvaVRvQ2NjQzNYempYZXZMMkE?oc=5\" target=\"_blank\">Trump tariff case gets fast tracked by Supreme Court</a>&nbsp;&nbsp;",
      "The Supreme Court has not indicated when it might rule on a request by the Trump administration to decide quickly on whether many new tariffs are legal."
    ],
    "image_url": "",
    "titles": [
      "Trump tariff case gets fast tracked by Supreme Court - Axios",
      "Potential Trump tariff refund bill could top $1 trillion as Supreme Court fight looms"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.788,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.627,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Supreme Court is fast-tracking a case regarding the legality of new tariffs introduced by the Trump administration. However, there is no indication yet of when a ruling might be made.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Robinhood to Launch \"Copy Trading\" Feature, Eyes Social Media Rivals",
    "domain": "sports",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Wed, 10 Sep 2025 00:31:50 GMT",
    "source": "Axios",
    "sources": [
      "Fortune",
      "Axios"
    ],
    "domains": [
      "fortune.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMieEFVX3lxTFB5dHhfVzB2Tk1nVUdibGdfM1E3OG5TRl9fQnNpZVYwR0FMX05TVTBmbnhLbG81aVVJVWdwMnA4MGNiMkZDaHd3WDZ3dGNuZDhjX3RteHRVcnR3Q1k0OThsNk9PcjVoX25mSE9UV1pYRUEydjNPMVoxTw?oc=5\" target=\"_blank\">Robinhood takes on Reddit and X with new social media platform</a",
      "Robinhood is launcing a version of \"copy trading\" next year that will require users to verify the information."
    ],
    "image_url": "",
    "titles": [
      "Robinhood takes on Reddit and X with new social media platform - Axios",
      "Robinhood says its latest product will fix social media trading"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.833,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.622,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Robinhood is set to launch a \"copy trading\" feature in the coming year, which will necessitate user verification of information. This move positions Robinhood in competition with platforms like Reddit and X in the social media space.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Klarna IPO Priced at $40, Valuation Hits $15 Billion",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Wed, 10 Sep 2025 00:46:58 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "MarketWatch"
    ],
    "domains": [
      "www.cnbc.com",
      "www.marketwatch.com"
    ],
    "snippets": [
      "Klarna priced its IPO at $40 a share, an offering that values the company at about $15 billion.",
      "Klarna’s IPO priced at $40 late Tuesday, well above its expected range of $35 to $37."
    ],
    "image_url": "",
    "titles": [
      "Klarna prices IPO at $40, above online lender's expected range",
      "Klarna prices IPO well above expected range, raising $1.37 billion"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.837,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.622,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Klarna's IPO was priced at $40 per share, valuing the company at around $15 billion, exceeding the expected range of $35 to $37. This successful pricing indicates strong investor interest in the company.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Judge Pauses Anthropic's $1.5B Book Piracy Settlement, Cites Misleading Terms",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-09-09T17:45:42-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge",
      "Ars Technica"
    ],
    "domains": [
      "www.theverge.com",
      "arstechnica.com"
    ],
    "snippets": [
      "Anthropic’s $1.5 billion book piracy settlement has been put on pause after the federal judge overseeing the class action case raised concerns about the terms of the agreement. During a hearing this week, Judge William Alsup rejected the settlement over concerns that class action lawyers will create",
      "Feeling “misled,” judge refuses to rubber-stamp Anthropic's proposed settlement."
    ],
    "image_url": "",
    "titles": [
      "Judge puts Anthropic&#8217;s $1.5 billion book piracy settlement on hold",
      "Judge: Anthropic’s $1.5B settlement is being shoved “down the throat of authors”"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.803,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.616,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A federal judge has halted Anthropic's $1.5 billion book piracy settlement, expressing concerns over the terms and feeling misled. Judge William Alsup rejected the proposed agreement during a hearing, pausing the settlement process.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Apple Launches iPhone 17 with 6.3-inch Screen, Replaces Plus Model",
    "domain": "technology",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Tue, 09 Sep 2025 22:37:44 GMT",
    "source": "Axios",
    "sources": [
      "TechCrunch",
      "Axios"
    ],
    "domains": [
      "techcrunch.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMijgFBVV95cUxOTjVLRU51ekNzSEQyUExKb1dGSVNLcmtuUEVBOHFLVTJQaXdlZ2NRUDJVcDBNeDV5WjBQOU9mb1NOeVh6ekdnUjdXMW1MNmhuYXRTVGVlYkltbUxUWHFyTUczZTVGc25qLUR5b0huazdmVmplb2w5aUpzVEpxYWtrWGpac2I4cDRwOE85eXF3?oc=5\" target=\"_blank\">Apple debuts iPhone 17 and thinner ",
      "This replaces the Plus model in the company’s 2025 lineup, following the underperformance of the iPhone 16 Plus last year.",
      "The iPhone 17 has a slightly bigger screen at 6.3 inches as compared to the 6.1-inch screen of the iPhone 16. The display is getting an upgrade with ProMotion."
    ],
    "image_url": "",
    "titles": [
      "Apple debuts iPhone 17 and thinner iPhone Air - Axios",
      "Apple debuts the $999 ultra-thin iPhone Air",
      "Apple launches iPhone 17 with a 120 Hz display"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.8,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.615,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Apple introduced the iPhone 17, featuring a larger 6.3-inch screen and an upgraded ProMotion display, replacing the Plus model in its 2025 lineup due to the iPhone 16 Plus's underperformance.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "AirPods Pro 3 Unveiled: Real-Time Translation, Enhanced Features at $249",
    "domain": "technology",
    "source_domain": "techcrunch.com",
    "location": "global",
    "published": "Tue, 09 Sep 2025 17:45:00 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch",
      "Ars Technica"
    ],
    "domains": [
      "techcrunch.com",
      "arstechnica.com"
    ],
    "snippets": [
      "Get a look at the real-time translation the new AirPods Pro 3 bring to your ears, which you can prompt through a gesture. Powered by Apple Intelligence, it uses noise cancellation to reduce the volume of the speaker to elevate the provided translation to the user. It came as one of several updates t",
      "Plus upgrades to active noise cancellation and battery life."
    ],
    "image_url": "",
    "titles": [
      "Watch Apple’s AirPod Pro 3 live translation feature in action",
      "Apple introduces AirPods Pro 3 with live translation feature"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.738,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.61,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The new AirPods Pro 3, priced at $249, offers real-time translation through a gesture, utilizing Apple Intelligence and improved noise cancellation to enhance the translation experience for the user. This feature is part of several updates, alongside upgrades to active noise cancellation and battery life, marking Apple's first refresh of the AirPods Pro line in three years since the Pro 2 model in 2022.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Asian Stocks Mixed, Wall Street Rally Stalls Amid Global Uncertainty",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Wed, 10 Sep 2025 06:00:00 GMT",
    "source": "Bloomberg",
    "sources": [
      "Bloomberg"
    ],
    "domains": [
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMilAFBVV95cUxNNkNyNy1sRmVjdjA1bUNQczdPajBkbVFsX2lqa05kVzlzN0Q3b190djQ4NFBVVVhaSkRLVWp2akpGazdRTnlnaHFEdnJRbFpiZ2E4ejVxQ1NIMTFsTkYtV2M0ODd5WWJ3bURJcUp5ZzlvN0Z6NFRySkxwZGRTazIxVHdqVXBCaGF6VDg3cVBxS3JKQzV5?oc=5\" target=\"_blank\">Asian Stocks Fluctuate as U",
      "<a href=\"https://news.google.com/rss/articles/CBMilAFBVV95cUxOSk1fN3hiaHktbjM4b2FYYUNrZWFETzRBcFh6THZXTm4zdFdqVk1jWk5sSWlScGhrYVVGS2dHTkZSSVdBUXlGZmxsemVEMjdQY05lZUVuUEwzbUZLaXhPS2RsVHlVY1pIekpCeFR6WWdPMTZ2cTlqTnhTWWRGa1M3TnFiUWlGYnJUYVhKLXY0dEUybUtr?oc=5\" target=\"_blank\">Wall Street Rally Stalls Af"
    ],
    "image_url": "",
    "titles": [
      "Asian Stocks Fluctuate as US Jobs Outlook Cools: Markets Wrap - Bloomberg.com",
      "Wall Street Rally Stalls After US Jobs Markdown: Markets Wrap - Bloomberg.com"
    ],
    "score_components": {
      "magnitude": 0.393,
      "recency": 0.933,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.462,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Asian stocks showed mixed performance with fluctuations observed across the market, while a rally on Wall Street experienced a stall. The varied movements in the stock markets reflect ongoing adjustments and reactions to global financial conditions. The current status indicates a period of uncertainty and variability in stock market performances.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]