[
  {
    "title": "Trump Begins Second UK State Visit, Hosted by King Charles and Queen Camilla",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 17 Sep 2025 15:33:34 GMT",
    "source": "BBC",
    "sources": [
      "Financial Times",
      "Deutsche Welle",
      "CNBC",
      "New York Times",
      "Al Jazeera",
      "BBC"
    ],
    "domains": [
      "www.nytimes.com",
      "www.bbc.com",
      "www.cnbc.com",
      "www.ft.com",
      "www.aljazeera.com",
      "www.dw.com"
    ],
    "snippets": [
      "A coalition of more than 50 groups have organised a march in central London against the visit.",
      "The visit comes as both the US and UK leaders face fallout over the furore surrounding Jeffrey Epstein.",
      "US President Donald Trump is receiving an unprecedented welcome in the UK with King Charles at Windsor. Meanwhile, thousands are expected to take part in protests against the visit. Follow DW for the latest.",
      "We'll be adding the best pictures of day two as President Donald Trump's state visit unfolds, so check back for further updates.",
      "Jeffrey Epstein affair will hang heavily over trip after Sir Keir Starmer’s sacking of Lord Peter Mandelson",
      "The president and first lady will be hosted by King Charles III and Queen Camilla at Windsor Castle. Mr. Trump will also meet the prime minister at his country residence, Chequers.",
      "As President Trump arrived in Britain on Tuesday night, protesters unveiled visual stunts aimed at highlighting his ties to Jeffrey Epstein, while a march was planned for Wednesday.",
      "The president and the first lady will be hosted at Windsor Castle by King Charles III and Queen Camilla."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/6f3d/live/6d42e080-93d2-11f0-9615-e74228fdb702.jpg",
    "titles": [
      "Thousands protest against Trump's second UK state visit",
      "Trump’s second state visit to the UK filled with royal pomp, protests",
      "Trump meets King Charles in historic second UK state visit",
      "From royal pomp to Epstein embarrassment: Trump's UK state visit in pictures",
      "Pomp and protest: Donald Trump starts second UK state visit",
      "President Trump’s State Visit to the UK: What to Know",
      "Trump’s Second U.K. State Visit Draws Protests",
      "President Trump’s 2nd U.K. State Visit: What’s on the Agenda"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.966,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.843,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Donald Trump arrived in the UK for a historic second state visit, during a sensitive time for the UK government. He and the First Lady are hosted by King Charles III and Queen Camilla at Windsor Castle, and will also visit the Prime Minister's residence, Chequers. The visit features displays of royal and military pageantry.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "EU Proposes Sanctions on Israeli Ministers, Faces Approval Hurdles",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 17 Sep 2025 15:00:04 GMT",
    "source": "BBC",
    "sources": [
      "Al Jazeera",
      "The Guardian",
      "Deutsche Welle",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.theguardian.com",
      "www.aljazeera.com",
      "www.dw.com"
    ],
    "snippets": [
      "Despite the forceful language, the measures appear unlikely to pass and have been condemned by Israel.",
      "The European Commission also proposes sanctions on &#039;extremist ministers&#039; in the Israeli government and violent settlers.",
      "The EU proposed curbing trade with Israel and placing sanctions on Israeli far-right ministers. Israel opened an exit route out of Gaza City for 48 hours after launching a ground offensive. DW rounds up the latest.",
      "<p>EU executive also seeks sanctions on two Israeli ministers, but may struggle to secure majority approval required </p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/sep/17/israel-gaza-offensive-middle-east-latest-news-updates\">Middle East crisis – live updates</a></p></li><li><p>"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/948b/live/cfb67210-93cb-11f0-84c8-99de564f0440.jpg",
    "titles": [
      "EU proposes curbs on trade with Israel over Gaza war",
      "EU proposes suspension of trade concessions with Israel over Gaza war",
      "Middle East updates: EU proposes Israel sanctions over Gaza",
      "European Commission calls for freezing of free trade with Israel over Gaza"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.955,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.787,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The EU has proposed reducing trade with Israel and imposing sanctions on far-right Israeli ministers, alongside penalties for violent settlers. However, these measures face significant opposition and are unlikely to be approved. Concurrently, Israel has facilitated a temporary exit route from Gaza City for 48 hours following a ground offensive. The European Commission's proposals include sanctions on two Israeli ministers, but achieving the necessary majority for approval remains uncertain.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Navalnaya Urges Labs to Release Navalny Poison Test Results",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 17 Sep 2025 12:49:38 GMT",
    "source": "BBC",
    "sources": [
      "Washington Post",
      "Al Jazeera",
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.washingtonpost.com",
      "www.aljazeera.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Yulia Navalnaya is urging the two laboratories she says found her husband was poisoned to release their findings.",
      "Yulia Navalnaya urges two laboratories in different countries to release analyses of smuggled samples.",
      "Two labs tested samples from Navalny that were smuggled out of Russia and concluded he had been poisoned, his wife said. Official cause of death cited disease.",
      "<p>Yulia Navalnaya says tests by two laboratories on samples smuggled out of Russia show her husband was killed by poison</p><p>Yulia Navalnaya, the widow of the Russian opposition leader Alexei Navalny, said that two foreign laboratories had confirmed her husband was poisoned, after tests on biolog"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/ef8e/live/60e75040-93d3-11f0-9cf6-cbf3e73ce2b9.jpg",
    "titles": [
      "Tests show Navalny was poisoned in jail, his widow says",
      "Alexey Navalny’s wife says lab tests show he was poisoned before death",
      "Navalny’s widow says new lab evidence proves he was poisoned in prison",
      "Widow of Alexei Navalny says lab tests confirm he was poisoned in prison"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.913,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.772,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Yulia Navalnaya has called on two laboratories, which conducted tests on samples smuggled out of Russia, to publicly release their findings. These tests, according to her, confirm that her husband, Russian opposition leader Alexei Navalny, was poisoned. Despite these claims, the official cause of his death has been cited as disease.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Katia Lindor Performs Anthem at Mets Game, Inspires Francisco's Home Run",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Wed, 17 Sep 2025 11:07:17 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet",
      "Yahoo Sports"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com",
      "people.com"
    ],
    "snippets": [
      "Katia Lindor minored in music at St. Mary's University in Texas and is a classically trained violinist.",
      "The New York Mets star later went on to hit a home run in the memorable game on Tuesday, Sept. 16",
      "<p>Tim Micallef brings you the latest edition of Central Sixty, featuring the Lindor family and Francisco getting fired up watching as his wife, Katia, plays the national anthem on violin ahead of the Mets game.</p>"
    ],
    "image_url": "",
    "titles": [
      "Francisco Lindor homers shortly after wife, Katia, performs national anthem on violin",
      "Francisco Lindor Gets Emotional While Watching Wife Katia Perform National Anthem",
      "Lindor family fired up as wife Katia plays national anthem on violin"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.977,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.757,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Katia Lindor, a classically trained violinist who minored in music at St. Mary's University in Texas, performed the national anthem on the violin at a New York Mets game. Her husband, Mets star Francisco Lindor, was inspired by her performance and hit a home run in the game on Tuesday, Sept. 16. The event was featured on Tim Micallef's Central Sixty, highlighting the Lindor family's special moment.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Israel Continues Gaza Offensive Amid Global Critique",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 17 Sep 2025 15:55:43 GMT",
    "source": "BBC",
    "sources": [
      "New York Times",
      "Al Jazeera",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.aljazeera.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "Israel says its aim is to defeat up to 3,000 Hamas fighters who remain there, but the offensive has drawn international condemnation.",
      "This is what Palestinians in Gaza City are facing as Israeli forces relentlessly bomb the area.",
      "We bring together pieces of Times journalism to help you understand the big picture."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/d9d9/live/80a613e0-93a5-11f0-84c8-99de564f0440.jpg",
    "titles": [
      "Thousands of Palestinians flee as Israeli troops push into Gaza City",
      "Palestinians under relentless attack as Israel steps up Gaza City assault",
      "Israel’s Push Into Gaza City"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.974,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.739,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Israel's military offensive in Gaza City, aimed at defeating approximately 3,000 Hamas fighters, continues amidst international condemnation. The operation has led to relentless bombing in the area, impacting Palestinians living there.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Beijing Seeks Chip Independence, Bans Nvidia AI Chips Amid US Tech Rivalry",
    "domain": "technology",
    "source_domain": "www.ft.com",
    "location": "global",
    "published": "Wed, 17 Sep 2025 15:02:45 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times",
      "Ars Technica",
      "The Verge"
    ],
    "domains": [
      "www.theverge.com",
      "www.ft.com",
      "arstechnica.com"
    ],
    "snippets": [
      "Beijing steps up efforts to boost semiconductor independence and compete with US",
      "Alibaba, ByteDance, and other Chinese technology companies are barred from purchasing Nvidia’s latest AI chips custom-made for China, the Financial Times reported on Wednesday. The Cyberspace Administration of China banned buying and testing the RTX Pro 6000D chips, despite companies having ordered ",
      "China steps up efforts to boost semiconductor independence, compete with US."
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Fed2d1316-1c29-4ea2-a8de-dad48e04a69c.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "China bans tech companies from buying Nvidia’s AI chips",
      "Nvidia’s AI chips are no longer welcome in China",
      "China blocks sale of Nvidia AI chips"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.956,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.735,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Beijing is intensifying its push for semiconductor independence to compete with the US, following a ban by the Cyberspace Administration of China on Alibaba, ByteDance, and other tech companies from purchasing or testing Nvidia's RTX Pro 6000D AI chips, specifically designed for the Chinese market. This move underscores the escalating tech rivalry between China and the US.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Supply Ship to ISS Faces Engine Trouble; NASA Studies Bone Loss in Space",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Wed, 17 Sep 2025 10:50:03 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org",
      "Ars Technica",
      "NASA"
    ],
    "domains": [
      "arstechnica.com",
      "www.nasa.gov",
      "phys.org"
    ],
    "snippets": [
      "A newly launched supply ship has run into engine trouble that is preventing it from reaching the International Space Station.",
      "The problem arose early Tuesday when the spacecraft's main engine shut down earlier than expected.",
      "NASA astronaut Zena Cardman processes bone cell samples inside the Kibo laboratory module&#8217;s Life Science Glovebox on Aug. 28, 2025, as part of an experiment that tests how microgravity affects bone-forming and bone-degrading cells and explore potential ways to prevent bone loss. This research "
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/engine-trouble-forces.jpg",
    "titles": [
      "Engine trouble forces Northrop Grumman to delay supply delivery to International Space Station",
      "A record supply load won’t reach the International Space Station as scheduled",
      "Space Station Science"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.972,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.731,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A newly launched supply ship destined for the International Space Station encountered engine trouble early Tuesday, preventing it from reaching its target. The spacecraft's main engine shut down prematurely. Meanwhile, NASA astronaut Zena Cardman is conducting an experiment aboard the ISS to study the effects of microgravity on bone cells, aiming to find ways to prevent bone loss in space.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Waymo Partners with Lyft for Robotaxi Launch in Nashville",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Wed, 17 Sep 2025 14:52:11 GMT",
    "source": "CNBC",
    "sources": [
      "TechCrunch",
      "Fortune",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "techcrunch.com",
      "fortune.com"
    ],
    "snippets": [
      "Waymo has teamed up with Uber to launch robotaxis in several U.S. markets, and is now joining forces with Lyft to launch in Nashville.",
      "The robotaxi giant is keeping options open on who it wants to work with as it attempts to scale its service around the country.",
      "Waymo is tapping an old partner, Lyft, to launch a robotaxi service in Nashville."
    ],
    "image_url": "",
    "titles": [
      "Lyft shares pop on Waymo deal to bring robotaxis to Nashville next year",
      "Waymo says it will partner with Lyft for a robotaxi debut in Nashville next year",
      "Lyft and Waymo are partnering to bring robotaxis to Nashville"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.952,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.727,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Waymo, a leading robotaxi company, is expanding its services in the U.S. by partnering with Lyft to launch a robotaxi service in Nashville. This move comes after Waymo teamed up with Uber for launches in several U.S. markets, indicating the company's strategy to collaborate with multiple partners to scale its service nationwide.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Global Heating Causes 2/3 of Europe's Summer Heat Deaths: Study",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Wed, 17 Sep 2025 10:01:23 +0000",
    "source": "Al Jazeera",
    "sources": [
      "New York Times",
      "Al Jazeera",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.aljazeera.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "Study covering 854 European cities finds that officially reported heat deaths remain &#039;significantly underestimated&#039;.",
      "Three times as many people in cities and towns died from severe heat as would have done in a world without human-caused warming, scientists said.",
      "<p>Researchers from Imperial College London say 16,500 deaths caused by hot weather brought on by greenhouse gases</p><p>Human-made global heating caused two in every three heat deaths in Europe during this year’s scorching summer, an early <a href=\"https://www.imperial.ac.uk/media/imperial-college/"
    ],
    "image_url": "",
    "titles": [
      "Did climate change cause 16,500 extra deaths in Europe this summer?",
      "Climate Change’s Toll in Europe This Summer: Thousands of Extra Deaths",
      "Human-made global warming ‘caused two in three heat deaths in Europe this summer’"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.879,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.723,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A study by Imperial College London found that human-made global heating was responsible for two-thirds of the heat deaths in Europe during the summer, totaling 16,500 fatalities. This research highlights the impact of greenhouse gases on increasing temperatures in European cities.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: research",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Ben & Jerry's Co-Founder Resigns Over Advocacy Restrictions",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Wed, 17 Sep 2025 13:02:42 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "Financial Post",
      "CNBC"
    ],
    "domains": [
      "news.google.com",
      "www.cnbc.com",
      "financialpost.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMif0FVX3lxTE93TVpES1FKdDRRSGJHSjgyV3hZWFFEa1JhdjdhNWhQakRBUDVhLUdNeXBJcG9hR0dhc2EwdEFZamNXb2p3YmhuaHM0dlBfSWMtLUpkQlc3ZnQta181MmxRZFVfWFNYX2QxcmlYUFg4akRGY0owUEtnVFVMTlRsYTA?oc=5\" target=\"_blank\">Ben & Jerry's co-founder resigns, says parent company \"s",
      "Greenfield dubbed the decision \"painful\" but said that the Unilever had silenced the company's ability to speak up on global issues.",
      "'I can no longer, in good conscience, and after 47 years, remain an employee of Ben &#38; Jerry’s,' says Jerry Greenfield"
    ],
    "image_url": "",
    "titles": [
      "Ben & Jerry's co-founder resigns, says parent company \"silenced\" activism - Axios",
      "Ben & Jerry's co-founder Jerry Greenfield quits over social activism row with Unilever",
      "Ben & Jerry’s co-founder quits, says Unilever ‘silenced’ activism"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.917,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.72,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Ben & Jerry's co-founder, Jerry Greenfield, resigned after 47 years, citing Unilever's restriction on the company's advocacy on global issues as the reason for his departure. Greenfield described the decision as \"painful\" but necessary due to a conflict of conscience.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Union Expands Campaign Against CRA Staffing Cuts",
    "domain": "general",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Wed, 17 Sep 2025 14:51:55 +0000",
    "source": "Global News",
    "sources": [
      "CityNews",
      "Global News"
    ],
    "domains": [
      "globalnews.ca",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "The \"Canada on Hold\" campaign was launched last month with a focus on CRA call centres but has now been expanded to draw attention to staffing cuts across the agency.",
      "The federal union representing workers at the Canada Revenue Agency has started the second phase of its online campaign denouncing staffing cuts. The &#8220;Canada on Hold&#8221; campaign was launched last month with a focus on CRA call centres but has now been expanded to draw attention to staffing"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/Canadian-Revenue-Agency-CRA.jpg?quality=65&strip=all",
    "titles": [
      "Federal union expands campaign against Canada Revenue Agency cuts",
      "Federal union expands campaign denouncing cuts at Canada Revenue Agency"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.972,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.706,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The federal union representing Canada Revenue Agency workers expanded its \"Canada on Hold\" campaign, initially launched to highlight issues in CRA call centres, to protest staffing cuts across the agency. This second phase of the campaign aims to draw wider attention to the impacts of these cuts.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Bank of Canada Cuts Key Rate to 2.5%, Shifts Focus to Economy",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Wed, 17 Sep 2025 13:51:03 +0000",
    "source": "Global News",
    "sources": [
      "CityNews",
      "Global News"
    ],
    "domains": [
      "globalnews.ca",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "The Bank of Canada cut its key interest rate Wednesday by 25 basis points to 2.5 per cent, and this marks the first cut by the central bank since March.",
      "The Bank of Canada cut its benchmark interest rate by a quarter point on Wednesday as the central bank worries less about inflation risks and more about a slowing economy. The Bank of Canada’s policy rate now stands at 2.5 per cent, breaking a streak of three consecutive holds since March. Governor "
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/06/b7a244ddeaed3e13b616fd4fe5ec502e7707dce15e34c546867c6a8d0a0de0e7.jpg?quality=65&strip=all",
    "titles": [
      "Bank of Canada delivers 1st interest rate cut since March",
      "Bank of Canada cuts key interest rate to 2.5% as U.S. tariff risks shift"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.952,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.695,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Bank of Canada reduced its key interest rate by 25 basis points to 2.5% on Wednesday, marking its first cut since March. This decision reflects a shift in focus from inflation concerns to worries about a slowing economy, ending a period of three consecutive rate holds.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Alleged Gunman Claims Responsibility for Charlie Kirk's Shooting in Texts",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 17 Sep 2025 00:44:45 GMT",
    "source": "BBC",
    "sources": [
      "Axios",
      "Global News",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "globalnews.ca",
      "news.google.com"
    ],
    "snippets": [
      "\"You're joking, right????\" the roommate responds in one message after the alleged gunman tells him he did it, according to court documents.",
      "<a href=\"https://news.google.com/rss/articles/CBMihgFBVV95cUxOdTdqLWg2bERRNHRxREszaTRNN2xlMTNPR3Uta1EtOE1RVkluRHoxTXJRWVlLOC10SGRoeDlGc05Tcmt6YlJGcHhNaEdJUVBpOUM3amZKVXF2b3NiVE5PRzNaUHBhR09pVEVwUkNiTTlSTjVwWWNKZk1jRTRxV2l5WnRKVEJ5dw?oc=5\" target=\"_blank\">READ: Text messages Charlie Kirk's suspected ",
      "Jeff Gray, Utah County attorney, read out an alleged text exchange Tuesday that took reportedly took place on the day that Charlie Kirk was shot and killed."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/81a6/live/b6b5e9c0-934f-11f0-84c8-99de564f0440.jpg",
    "titles": [
      "Read the text messages between Charlie Kirk accused and roommate",
      "READ: Text messages Charlie Kirk's suspected shooter sent before arrest - Axios",
      "Read the alleged text exchange between Tyler Robinson and his roommate"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.71,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.686,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Court documents reveal a text exchange where an alleged gunman claims responsibility for the shooting of Charlie Kirk. The roommate responded in disbelief. Utah County attorney Jeff Gray disclosed the messages during a reading, indicating the conversation occurred on the day Kirk was fatally shot.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UN Commission Accuses Israel of Genocide in Gaza; Israel Denies Claims",
    "domain": "general",
    "source_domain": "www.bbc.co.uk",
    "location": "global",
    "published": "Tue, 16 Sep 2025 18:26:00 GMT",
    "source": "BBC",
    "sources": [
      "Washington Post",
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.washingtonpost.com",
      "www.theguardian.com",
      "www.bbc.co.uk"
    ],
    "snippets": [
      "Israel rejects UN Commission finding that it is committing genocide in Gaza.",
      "<p>Human rights experts and crossbench politicians call on Labor to ‘put its money where its mouth is’ and apply similar sanctions on Israel as on Russia</p><ul><li><p>Get our <a href=\"https://www.theguardian.com/email-newsletters?CMP=cvau_sfl\">breaking news email</a>, <a href=\"https://app.adjust.co",
      "Israel rejected the conclusions, which echo those of a growing group of governments and human rights organizations.",
      "<p>The UN commission of inquiry’s report makes it almost impossible for Israel – and its allies – to maintain the narrative that criticism of it is part of an antisemitic plot</p><p>The conclusion of a UN commission of inquiry that <a href=\"https://www.theguardian.com/world/2025/sep/16/israel-commit"
    ],
    "image_url": "https://ichef.bbci.co.uk/images/ic/240x135/p0l7jnbt.jpg",
    "titles": [
      "Israel Committing Genocide in Gaza Says UN Commission",
      "Albanese urged to end ‘double standard’ on Israel after UN commission finds genocide occurring in Gaza",
      "U.N. commission finds that Israel committed genocide in Gaza",
      "Now the UN says Israel is committing genocide in Gaza, too. How can western governments still refuse to act? | Steve Crawshaw"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.622,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.675,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A UN commission has concluded that Israel is committing genocide in Gaza, a finding Israel rejects. This report aligns with the views of some governments and human rights organizations, challenging the narrative that criticism of Israel is antisemitic. Human rights experts and politicians are urging for sanctions on Israel similar to those on Russia.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Taylor Townsend Apologizes for Remarks on Chinese Food",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Wed, 17 Sep 2025 10:59:34 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "American tennis star Taylor Townsend has apologized \"from the bottom of my heart\" for making disparaging comments about Chinese food on social media.",
      "<p>American tennis star Taylor Townsend has apologized “from the bottom of my heart” for making disparaging comments about Chinese food.</p>"
    ],
    "image_url": "",
    "titles": [
      "Townsend apologizes for criticizing Chinese food",
      "American tennis star Taylor Townsend apologizes for comments about Chinese food"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.975,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.675,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "American tennis star Taylor Townsend has issued a heartfelt apology for her disparaging remarks about Chinese food on social media. Townsend expressed regret and apologized sincerely.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Matthew Tkachuk Out Until December After Surgery",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Wed, 17 Sep 2025 10:59:34 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "Florida Panthers forward Matthew Tkachuk is expected to be sidelined until December while he recovers from offseason surgery to deal with a sports hernia and torn adductor muscle, general manager Bill Zito said Wednesday.",
      "<p>The Florida Panthers expect forward Matthew Tkachuk to be sidelined until December while he recovers from offseason surgery to deal with a sports hernia and torn adductor muscle, general manager Bill Zito said Wednesday.</p>"
    ],
    "image_url": "",
    "titles": [
      "Panthers' Tkachuk expected to be out until Dec.",
      "Panthers expect Tkachuk to be out until December after surgery"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.975,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.675,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Florida Panthers forward Matthew Tkachuk is expected to be out of action until December as he recovers from offseason surgery for a sports hernia and torn adductor muscle, according to general manager Bill Zito.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Blue Jays' Bichette Out for Season with Knee Injury, Not Worst-Case Scenario",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Wed, 17 Sep 2025 08:27:37 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "All of the important fantasy spin and actionable takeaways resulting from the latest baseball news.",
      "<p>The Toronto Blue Jays won&#8217;t see their star shortstop back in the regular season, but they can still breathe a sigh of relief knowing they escaped the worst-case scenario.</p>"
    ],
    "image_url": "",
    "titles": [
      "Bichette, Neto to miss rest of regular season",
      "Blue Jays’ Bo Bichette out for regular season, could return for playoffs"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.925,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.665,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Bo Bichette, the major's leading hitter in hits and doubles, has a sprained PCL in his left knee, sidelining him for the remainder of the regular season. Despite this setback, the Toronto Blue Jays view the situation positively, as it is not the worst-case scenario for their star shortstop.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "McDavid Uncertain About Oilers Future Beyond 2025-26 Season",
    "domain": "sports",
    "source_domain": "www.sportingnews.com",
    "location": "national",
    "published": "Wed, 17 Sep 2025 15:41:24 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports",
      "Sportsnet"
    ],
    "domains": [
      "www.sportingnews.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Oilers superstar Connor McDavid remains noncommittal on his future in Edmonton beyond 2025-26, entering a contract year.",
      "<p>Watch a clip from 32 Thoughts: The Podcast with Connor McDavid, discussing his contract extension with the Oilers, and more.</p>"
    ],
    "image_url": "",
    "titles": [
      "Connor McDavid says future in Edmonton &quot;remains to be seen&quot; beyond 2025-26",
      "Oilers’ McDavid says future beyond ’25-26 ‘still remains to be seen’"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.989,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.66,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Connor McDavid, the Oilers superstar, has not made a clear decision about his future with the team beyond the 2025-26 season, which will be his contract year. This was discussed during an episode of 32 Thoughts: The Podcast, where McDavid talked about his potential contract extension with the Oilers among other topics.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Wightman Wins Silver for GB in Tokyo 1500m, Kerr Injured and Last",
    "domain": "sports",
    "source_domain": "www.independent.co.uk",
    "location": "national",
    "published": "Wed, 17 Sep 2025 15:51:16 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports",
      "The Guardian"
    ],
    "domains": [
      "www.independent.co.uk",
      "www.theguardian.com"
    ],
    "snippets": [
      "In a dramatic 1500m final, Wightman was dramatically pipped on the line by Isaac Nader but still brought home GB’s first medal of the Championships in Tokyo",
      "<ul><li><p>Silver medal for GB but injured Josh Kerr finishes last</p></li><li><p>Just 0.02sec second separates first from second</p></li></ul><p>We have seen some extraordinary men’s 1500m finals in recent years. Put Tokyo down as another stone-cold classic. Most expected a shootout between Britain"
    ],
    "image_url": "",
    "titles": [
      "Why Jake Wightman has no regrets over agonising World Championship silver medal",
      "Jake Wightman pipped on line as Isaac Nader surges to 1500m World Championship gold"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.992,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.653,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In the Tokyo Championships' 1500m final, Wightman secured Great Britain's first medal by finishing second, narrowly losing to Isaac Nader by just 0.02 seconds. Despite the high expectations for a competitive race, Josh Kerr, another GB contender, finished last due to an injury. This event is marked as another memorable moment in the history of men’s 1500m finals.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Elliott Buys $2B Stake in Workday, Aims to Boost AI Focus",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Wed, 17 Sep 2025 14:55:44 GMT",
    "source": "CNBC",
    "sources": [
      "MarketWatch",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "www.marketwatch.com"
    ],
    "snippets": [
      "Elliott Investment Management announced it a $2 billion stake in Workday.",
      "Workday’s stock has underperformed this year, but Elliott Management has taken a stake in the software maker and the company is doubling down on its AI initiatives."
    ],
    "image_url": "",
    "titles": [
      "Workday stock climbs as activist investor Elliott takes $2 billion stake",
      "Workday has just drawn an activist investor. Is it the catalyst the workplace-software stock needs?"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.953,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.653,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Elliott Investment Management has acquired a $2 billion stake in software company Workday, which has seen its stock underperform this year. Following the investment, Workday is intensifying its focus on artificial intelligence initiatives.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Khalil Mack Suffers Elbow Injury, Out for Weeks but Not Season-Ending",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Wed, 17 Sep 2025 14:53:35 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sportsnet"
    ],
    "domains": [
      "www.cbssports.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Mack suffered the injury during the first half of Monday's game against the Raiders",
      "<p>Khalil Mack appears to have avoided a worst-case scenario. The Los Angeles Chargers edge rusher&#8217;s left elbow injury is not season-ending, though it will still keep him out weeks, NFL Network&#8217;s Ian Rapoport reported on Wednesday.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/17/01690a5b-afe9-48eb-a837-30638fd4b26e/khalil-mack-chargers.jpg",
    "titles": [
      "Khalil Mack injury: Chargers edge rusher will miss 'a few weeks' after suffering dislocated elbow, per report",
      "Report: Chargers’ Khalil Mack out weeks with elbow injury"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.973,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.65,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Los Angeles Chargers edge rusher Khalil Mack injured his left elbow in the first half of Monday's game against the Raiders. Reports from NFL Network's Ian Rapoport indicate that while Mack's injury is serious enough to sideline him for weeks, it is not season-ending.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "\"Belly Chooses in 'The Summer I Turned Pretty' Season 3 Finale\"",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 17 Sep 2025 11:42:48 GMT",
    "source": "BBC",
    "sources": [
      "Forbes",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.forbes.com"
    ],
    "snippets": [
      "Spoiler warning: The much-anticipated final episode reveals how the talked-about TV show's plot ends.",
      "\"The Summer I Turned Pretty\" Season 3 finale has arrived, and Belly finally decides between Conrad and Jeremiah. Here's how the series ends and what the final scene means for the future."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/cbc9/live/e793fd20-83ff-11f0-bd2b-c9a8fb561af5.jpg",
    "titles": [
      "The Summer I Turned Pretty reaches emotional climax",
      "‘The Summer I Turned Pretty’ Finale Ending Explained—Who Does Belly Choose?"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.892,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.633,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "\"The Summer I Turned Pretty\" Season 3 finale concludes with Belly making a definitive choice between Conrad and Jeremiah, resolving the central romantic conflict of the series. The final episode's outcome and implications for the characters' futures are addressed, marking the end of the show's storyline.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "\"Animated Short 'Debut: A KPOP Demon Hunters Story' Rated PG by MPA\"",
    "domain": "business",
    "source_domain": "www.forbes.com",
    "location": "global",
    "published": "Wed, 17 Sep 2025 11:18:36 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes"
    ],
    "domains": [
      "www.forbes.com"
    ],
    "snippets": [
      "An animated short called “Debut: A KPOP Demon Hunters Story” was given a PG rating by the Motion Picture Association on Wednesday, though plot details and a release date remain unclear.",
      "A new filing says that a KPop Demon Hunters short film may be heading to Netflix soon, if the document in question is accurate."
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/68a8754d9a2bc1d25a4eda05/0x0.jpg?width=960",
    "titles": [
      "A New ‘KPop Demon Hunters’ Short Film Could Be On The Way",
      "A Netflix ‘KPop Demon Hunters’ Short Film Has Been Rated For Release"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.981,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.464,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Motion Picture Association rated an animated short, \"Debut: A KPOP Demon Hunters Story,\" as PG. While plot details and a release date are not specified, a recent filing suggests it might be released on Netflix. The current status of its distribution or premiere date remains unconfirmed.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]