[
  {
    "title": "US-Proposed Peace Plan for Gaza Gains Support, Uncertainty Remains",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 30 Sep 2025 06:12:28 GMT",
    "source": "BBC",
    "sources": [
      "Deutsche Welle",
      "The Guardian",
      "Al Jazeera",
      "BBC",
      "Washington Post"
    ],
    "domains": [
      "www.theguardian.com",
      "www.aljazeera.com",
      "www.dw.com",
      "www.washingtonpost.com",
      "www.bbc.com"
    ],
    "snippets": [
      "European and Middle Eastern leaders have welcomed a new US peace plan for Gaza, as President Donald Trump warned Hamas to accept it.",
      "The Palestinian Authority joins regional leaders in welcoming the US president&#039;s 20-point peace plan to end war in Gaza.",
      "Donald Trump revealed a proposed plan to end the war in Gaza during Israeli Prime Minister Benjamin Netanyahu's visit to the White House. What exactly is in the 20-point plan?",
      "<p>Plan calls for immediate end to war between Israel and Hamas but lacks detail on how key points will be executed</p><p>The White House peace plan for Gaza proposes an immediate end to the devastating war between Israel and Hamas that has raged in the coastal territory for nearly two years, while ",
      "<p>The US president has won regional backing, but Hamas’s response and Israel’s intentions leave the outcome in doubt</p><p>At first glance, the 20-point plan outlined by President Trump and agreed by Benjamin Netanyahu appears more likely to end the two-year conflict in Gaza than anything we have s",
      "Hamas has not commented on President Donald Trump’s ceasefire proposal, which Netanyahu said would include the release of all Israeli hostages but keep Israeli forces in most of Gaza."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/43b9/live/c404dca0-9dc0-11f0-92db-77261a15b9d2.jpg",
    "titles": [
      "Trump's 20-point peace plan in full",
      "How Arab nations, rest of the world reacted to Trump’s Gaza peace plan",
      "What is Donald Trump's 20-point plan to end Gaza war?",
      "What’s in Trump’s 20-point peace plan for Gaza?",
      "Trump’s plan for Gaza is ambitious but peace is far from guaranteed",
      "Netanyahu tries to sell Trump’s Gaza peace plan to a skeptical right wing"
    ],
    "score_components": {
      "magnitude": 0.964,
      "recency": 0.864,
      "consensus": 0.995,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.829,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Palestinian Authority and regional leaders have endorsed a 20-point peace plan proposed by US President Trump to end the two-year conflict in Gaza. The plan, supported by Benjamin Netanyahu, aims to bring peace, but the responses from Hamas and the intentions of Israel remain uncertain, casting doubt on the plan's effectiveness.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: plan, support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "YouTube Settles Trump Lawsuit for $24.5M Over Account Suspension",
    "domain": "technology",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Tue, 30 Sep 2025 03:27:14 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Deutsche Welle",
      "Axios",
      "Al Jazeera",
      "CNBC",
      "Ars Technica",
      "The Verge"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.theverge.com",
      "www.dw.com",
      "arstechnica.com",
      "www.cnbc.com",
      "news.google.com"
    ],
    "snippets": [
      "Video platform settles lawsuit filed in response to Trump&#039;s suspension over the January 6, 2021, riot at US Capitol.",
      "After Meta and X, Google has also settled the lawsuit brought on by the US President. However, YouTube's settlement does not constitute an admission of liability.",
      "<a href=\"https://news.google.com/rss/articles/CBMif0FVX3lxTE91QkZKM0YyVnFuZWxIV3N4U1Ewb2s0ampyMnk4VG1UMzBieVlFWmlSdHJ1OVdJZmUyc3BpcFpXU29Ha0pfTmJmZlJsRm51SjBraTBBQ3hSZkRBT1piRUhxVF9VTjdxYUdMVXktX0NfRW9kMGRQb2VBTTgwWDZZTEk?oc=5\" target=\"_blank\">YouTube to pay Trump $22 million for suspending his acco",
      "YouTube has agreed to pay $24.5 million to settle a lawsuit involving the suspension of President Donald Trump's account in 2021.",
      "YouTube has settled a lawsuit President Donald Trump filed against the company in 2021, according to The Wall Street Journal. Trump filed sweeping lawsuits against Google-owned YouTube, Meta (then Facebook), and X (then Twitter) after he was suspended from the platforms, and now all three companies ",
      "Alphabet settles with Trump instead of fighting lawsuit over January 6 suspension."
    ],
    "image_url": "",
    "titles": [
      "YouTube to pay $24.5m to settle lawsuit over Trump’s account suspension",
      "YouTube to pay $24.5 million to settle Trump lawsuit",
      "YouTube to pay Trump $22 million for suspending his account after Jan. 6 riot - Axios",
      "YouTube agrees to pay Trump $24.5 million to settle lawsuit over suspended account",
      "YouTube caves to Trump with $24.5 million settlement",
      "Trump obtains another settlement as YouTube agrees to pay $24.5 million"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.833,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.817,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "YouTube has agreed to pay $24.5 million to settle a lawsuit filed by President Donald Trump, stemming from the suspension of his account after the January 6, 2021 Capitol riot. This agreement resolves the legal dispute over the platform's decision to block Trump in the aftermath of the Capitol attack.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Indonesia School Collapse Kills 3, Injures 100 During Prayer",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 30 Sep 2025 09:22:04 GMT",
    "source": "BBC",
    "sources": [
      "Deutsche Welle",
      "Al Jazeera",
      "BBC",
      "New York Times"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.bbc.com",
      "www.nytimes.com",
      "www.dw.com"
    ],
    "snippets": [
      "The rescue was temporarily halted on Tuesday as authorities say the building is at risk of further collapse.",
      "A school building collapsed during prayer time in Indonesia killing several students and injuring dozens.",
      "The Islamic school building collapsed while dozens of young students were attending afternoon prayers. Rescuers continue their race to find survivors and recover bodies buried in the rubble.",
      "At least three children were killed and about 100 injured after an Islamic boarding school collapsed during a prayer service, officials said."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/ffeb/live/546bf270-9dd9-11f0-9f23-2534d63ace40.jpg",
    "titles": [
      "Three dead, dozens trapped after Indonesian school collapses on students",
      "Dozens trapped in deadly Indonesia school collapse",
      "Indonesia school collapse: Rescuers race to save survivors",
      "Dozens of Students Are Missing After School Collapses in Indonesia"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.923,
      "consensus": 0.908,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.791,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A school building in Indonesia collapsed during prayer time, resulting in at least three children dead and approximately 100 injured. The incident occurred at an Islamic boarding school. Rescue efforts were temporarily halted due to the risk of further collapse as authorities and rescuers work to find survivors and recover bodies.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump's Gaza Cease-Fire Plan Draws Mixed Reactions, Netanyahu Threatens Action",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 29 Sep 2025 20:46:24 GMT",
    "source": "BBC",
    "sources": [
      "Axios",
      "The Guardian",
      "Al Jazeera",
      "BBC",
      "New York Times"
    ],
    "domains": [
      "www.theguardian.com",
      "www.aljazeera.com",
      "www.nytimes.com",
      "www.bbc.com",
      "news.google.com"
    ],
    "snippets": [
      "The deal proposes an end to military operations, a release of Israeli hostages by Hamas and the immediate delivery of aid to Gaza.",
      "They say they have, but on Gaza&#039;s security and long-term governance, Netanyahu appears to differ from the plan.",
      "<a href=\"https://news.google.com/rss/articles/CBMifEFVX3lxTE9aSVhtd2RYb01zVU9QY256RGtvTmZ0blNiYVg0XzJPTEhCVEF0WkZxWnNPa0E2ZUhjR3FPQmdrX3UwbVNIeDEzNVhvbi1jeFV6MzhQVnJrMkxuRUZXWURDRk5XNk5MX0tCSExTRnB0YW4zSWxWRHhXTzRQQWk?oc=5\" target=\"_blank\">Netanyahu endorses Trump plan to end Gaza war</a>&nbsp;&nbsp",
      "<p>The Israeli PM threatens to ‘finish the job’ if Hamas does not agree. Plus, do AI ‘actors’ pose an existential threat to their human counterparts?</p><p>Good morning.</p><p>President Donald Trump and the Israeli prime minister, Benjamin Netanyahu, <a href=\"https://www.theguardian.com/world/2025/s",
      "In President Trump’s plan, Prime Minister Benjamin Netanyahu got almost everything he hoped for in the end, despite mounting international isolation."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/d1c0/live/69bc5330-9dd5-11f0-b741-177e3e2c2fc7.jpg",
    "titles": [
      "Watch: Trump and Netanyahu outline plan to end war in Gaza",
      "Have Trump and Netanyahu really agreed on a Gaza peace plan? Key takeaways",
      "Netanyahu endorses Trump plan to end Gaza war - Axios",
      "First Thing: Trump and Netanyahu tell Hamas to accept Gaza peace plan or face consequences",
      "With New U.S. Proposal to End Gaza War, a Rare Moment of Triumph for Netanyahu"
    ],
    "score_components": {
      "magnitude": 0.964,
      "recency": 0.71,
      "consensus": 0.995,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.788,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "President Trump's proposal for a cease-fire in Gaza received mixed reactions, with some leaders welcoming it as a new chapter. However, Israeli Prime Minister Netanyahu threatened military action against Hamas if they reject the deal, indicating a potential divergence on the plan's implications for Gaza's future security and governance.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "US Faces Potential Government Shutdown Over Funding Crisis",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Tue, 30 Sep 2025 05:03:00 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "Deutsche Welle",
      "ABC News"
    ],
    "domains": [
      "www.npr.org",
      "abcnews.go.com",
      "www.dw.com"
    ],
    "snippets": [
      "A federal shutdown will impact people across the United States. NPR's network of member stations explains how these effects will be felt nationwide.",
      "The United States is facing yet another government shutdown. What happens and who is impacted when the government can't pay its bills? And could the Trump administration use it as an excuse for more layoffs?",
      "The federal government is hurtling toward a possible shutdown Tuesday night."
    ],
    "image_url": "",
    "titles": [
      "Here's what a government shutdown could affect around the country",
      "What does a US government shutdown actually mean?",
      "What could a potential government shutdown mean for the economy?"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.936,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.756,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The United States is on the brink of a federal government shutdown due to funding issues, which could have widespread effects across the country. NPR's member stations detail the nationwide impacts, including potential layoffs. The current status is that the government may shut down by Tuesday night if a resolution is not reached.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "VP Vance Warns of Shutdown Amid Funding Deal Dispute, Coal Policy Looms",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Tue, 30 Sep 2025 05:33:37 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Axios",
      "Al Jazeera",
      "Financial Times"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.ft.com",
      "news.google.com"
    ],
    "snippets": [
      "Congressional Democrats and Republicans failed to reach a spending deal after meeting with US President Donald Trump.",
      "<a href=\"https://news.google.com/rss/articles/CBMimgFBVV95cUxQNUxnUXRpSVRLdlZPY0gzS3NxeTBqZFBNS1ltY0JIUnJXZ1Btemp5MGZOUXlUVy0wRXAzNGZoUGVPQS15Qy1ZYkJUWHZoaXA5NFNtTmRGNEJfajZJRjRGb191Tlh3c1N5YXE1VDhDRDNPNzhwYVFydmVYRUQzMlhJZmpMX2JmZzVmSmw4S3d1TkYySVk2REZnUDlR?oc=5\" target=\"_blank\">Trump, Democrats le",
      "Federal funding set to run out on Wednesday morning unless lawmakers reach agreement"
    ],
    "image_url": "",
    "titles": [
      "VP Vance blames Democrats for looming US government shutdown",
      "Trump, Democrats leave meeting without deal to avoid government shutdown - Axios",
      "Vance warns US government is ‘headed to a shutdown’"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.87,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.728,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "After a meeting with congressional leaders, Vice President Vance indicated a potential government shutdown due to disagreements over a short-term funding deal, particularly Democrats' demand for an extension of enhanced Obamacare subsidies. Federal funding is set to expire on Wednesday unless an agreement is reached. Concurrently, Trump officials plan to announce policies to increase coal output.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Frank Founder Sentenced to 7 Years for Defrauding JPMorgan Chase",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Tue, 30 Sep 2025 09:01:59 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "CNBC",
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com",
      "www.cnbc.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMijgFBVV95cUxQNXljdkdjNnJfS1hfRXdIWDVGX3RTdHMwelVPbFhTSmhid3hmb1ZwUmMyUC10UDFfQ2JDWUJ1aW5KNkNUOW1rWk1aSEdtc2lHNmd4TnBILUZHbm14UER0MVgxdFF6NzdpQW5QcXR6UXBKZndLQnVUSjhWdXpLUXJoM3NlLUctNVVjdnV1akxn?oc=5\" target=\"_blank\">Charlie Javice sentenced to 7 years",
      "Charlie Javice, founder of college financial aid platform Frank, was arrested in 2023 on charges she defrauded JPMorgan Chase in the sale of the fintech firm.",
      "The fintech startup had been acquired by JPMorgan Chase in 2021 for $175 million. The bank later accused Frank of lying about its customer base."
    ],
    "image_url": "",
    "titles": [
      "Charlie Javice sentenced to 7 years in prison for defrauding JP Morgan - Axios",
      "Startup founder Charlie Javice sentenced to 7 years in prison for defrauding JPMorgan Chase",
      "Frank founder Charlie Javice sentenced to 7 years in prison for defrauding JPMorgan Chase"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.916,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.72,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Charlie Javice, the founder of the fintech startup Frank, was sentenced to 7 years in prison for defrauding JPMorgan Chase during the company's sale for $175 million in 2021. Javice was arrested in 2023 after the bank accused her of falsely inflating Frank's customer base.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Dolphins Receiver Suffers Season-Ending Knee Injury vs. Jets",
    "domain": "sports",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Tue, 30 Sep 2025 05:06:59 +0000",
    "source": "Al Jazeera",
    "sources": [
      "CBS Sports",
      "Al Jazeera",
      "ESPN"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "The Miami Dolphins wide receiver suffered what is believed to be a season-ending injury against the New York Jets.",
      "What is the Dolphins WR's outlook for a dislocated knee, the on-field impact of his absence and his future in Miami.",
      "Hill is apparently making the best of a rough situation"
    ],
    "image_url": "",
    "titles": [
      "Dolphins’ Tyreek Hill suffers severe knee injury against Jets in NFL",
      "Tyreek Hill injury FAQ: Recovery timetable, his NFL future and how Dolphins will adapt",
      "Tyreek Hill injury: Dolphins wideout 'in good spirits' despite devastating knee injury vs. Jets"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.862,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.719,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A Miami Dolphins wide receiver sustained a dislocated knee in a game against the New York Jets, likely ending his season. Despite the setback, he remains positive about his situation. The injury impacts the team's on-field performance and raises questions about his future with the Dolphins.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: sustain",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Afghanistan Faces Nationwide Blackout as Taliban Cuts Fibre-Optics",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 30 Sep 2025 08:24:05 GMT",
    "source": "BBC",
    "sources": [
      "Deutsche Welle",
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "www.bbc.com",
      "www.theguardian.com",
      "www.dw.com"
    ],
    "snippets": [
      "For many women, the internet was their last resource. An internet shutdown threatens to end this.",
      "On orders from the ruling Taliban, Afghanistan's telecommunications authorities have capped fiber optic internet access. It is unclear how long telephone and cellular networks will be affected, or to what degree.",
      "<p>Telecoms disrupted nationwide after authorities cut fibre-optic connections in several provinces to prevent ‘vice’</p><p>A huge communications blackout has hit Afghanistan after Taliban authorities began severing fibre-optic connections in several provinces to prevent “vice”.</p><p>“A nationwide "
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/062c/live/847c5980-9dc7-11f0-92db-77261a15b9d2.jpg",
    "titles": [
      "Afghan women lose their 'last hope' as Taliban shuts down internet",
      "Afghanistan: Taliban shuts down internet indefinitely",
      "Afghanistan hit by communications blackout after Taliban shuts internet"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.905,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.718,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Afghanistan is experiencing a nationwide communications blackout after the Taliban ordered the cutting of fibre-optic connections to prevent \"immorality,\" affecting phone and internet services. The extent and duration of the disruption to telephone and cellular networks remain unclear. This follows an internet shutdown in several provinces two weeks prior, aimed at stopping \"immoral acts.\"",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Typhoon Bualoi Kills 13 in Vietnam, Leaves 2M Without Power",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Tue, 30 Sep 2025 07:26:59 +0000",
    "source": "Al Jazeera",
    "sources": [
      "New York Times",
      "Al Jazeera",
      "The Guardian"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.nytimes.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "The deadly storm forces tens of thousands to evacuate and destroys thousands of homes.",
      "<p>Vietnamese authorities say typhoon was the most devastating storm to hit the country this year</p><p>The death toll from Typhoon Bualoi in south-east Asia has risen to more than 30 as heavy rains continued to lash the region.</p><p>In Vietnam, authorities said 19 people had been killed and 21 wer",
      "At least 13 people were killed and dozens more injured in central Vietnam, where 2 million were without power. Bualoi’s deadly path had started with 10 deaths in the Philippines."
    ],
    "image_url": "",
    "titles": [
      "Typhoon Bualoi kills dozens in Vietnam and Philippines",
      "Typhoon Bualoi death toll rises to at least 30 across Vietnam, Thailand and Philippines",
      "Typhoon Bualoi Slams Into Central Vietnam, Adding to Death Toll"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.905,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.718,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Typhoon Bualoi hit Vietnam's coast earlier than predicted, causing significant destruction and at least 13 deaths in central Vietnam, with dozens injured. The storm, which previously resulted in 10 deaths in the Philippines, left 2 million people without power in Vietnam. Authorities are evacuating thousands and warning of flash floods and landslides.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Bruce Bochy to Leave Rangers' Manager Role, Offered Front Office Position",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Tue, 30 Sep 2025 01:09:05 +0000",
    "source": "CBS Sports",
    "sources": [
      "Sportsnet",
      "CBS Sports",
      "Sports Illustrated"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.cbssports.com",
      "news.google.com"
    ],
    "snippets": [
      "Texas said Bochy has been offered a front office advisory role",
      "<a href=\"https://news.google.com/rss/articles/CBMikgFBVV95cUxOc3lVSktUWlY3WmRpQTNHaVRsZUZRTWRQN1c5ekhpeGZLSFNBY0hWSERVMVpUUW9MQkF4SEY5WjdpdFRwYkNwLVB2b05kak9BSkFweXBxODEwbFIxc0pQcFNtWTBJMm5NSGNxdEV5WEJmRHNUajZGV25idG4xaG1wa3E3MHdsdm91RmxweEI3M3hoQQ?oc=5\" target=\"_blank\">Rangers Moving on From Bruce ",
      "<a href=\"https://news.google.com/rss/articles/CBMigAFBVV95cUxQUnpUT0hEQ1oyZXM5UTZOS3J0ZEFzdDR5b3cyQzZjdV9BazdZUFBMNG8yc2tPVGNKUmhjTlZUcXVHTFlKOHJUb25VdlZINWxyRzZ5eWZVMmcxQThoYXZfenBwM2JrRDlONUNicjBMNFFtU244SVZFaFJxMzBEZjJFRw?oc=5\" target=\"_blank\">‘I’m Following’—Man Utd Manager Target Speaks Out on ",
      "<p>The Texas Rangers announced on Monday that manager Bruce Bochy, who led the team to a World Series in 2023, won&#8217;t return as the team&#8217;s manager in 2026.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/30/4ddc4248-e3fe-4bea-837b-c9b662a5a7f2/bochy-getty.png",
    "titles": [
      "Bruce Bochy out as Rangers manager after three seasons, 2023 World Series title",
      "Rangers Moving on From Bruce Bochy As Manager After Three Seasons - Sports Illustrated",
      "‘I’m Following’—Man Utd Manager Target Speaks Out on Red Devils Interest - Sports Illustrated",
      "Bruce Bochy won’t return as Rangers manager in 2026"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.794,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.696,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Texas Rangers announced that Bruce Bochy, who managed the team to a World Series win in 2023, will not return as manager in 2026. Instead, Bochy has been offered a front office advisory role with the Rangers.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Madagascar Protests: 22 Dead, President Dissolves Government",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-09-29T23:54:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "New York Times",
      "Deutsche Welle",
      "The Guardian"
    ],
    "domains": [
      "www.nytimes.com",
      "www.theguardian.com",
      "www.dw.com"
    ],
    "snippets": [
      "At least 22 people were killed after protests broke out power cuts, water shortages and widespread poverty. The youth-led protesters named their movement Gen Z.",
      "<p>Demonstrations over water and power cuts inspired by ‘gen-Z’ protests elsewhere have left at least 22 dead, says UN</p><p><a href=\"https://www.theguardian.com/world/madagascar\">Madagascar</a>’s president, Andry Rajoelina, has dissolved the government after youth-led protests over water and power ",
      "Andry Rajoelina, the leader of the island nation in Africa, acknowledged grievances over power cuts and water shortages that have drawn thousands of young people to the streets."
    ],
    "image_url": "",
    "titles": [
      "Madagascar president fires government after Gen Z protests",
      "Madagascar’s president dissolves government amid youth-led protests",
      "Madagascar’s President Dissolves Government Amid Deadly Protests"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.774,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.692,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "In Madagascar, protests led by the youth movement \"Gen Z\" over severe water and power shortages and escalating poverty resulted in at least 22 fatalities, as reported by the UN. The widespread demonstrations prompted President Andry Rajoelina to dissolve the government in response to the crisis.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "MLB Experts Predict Postseason Series Winners Amid Team Health Concerns",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 30 Sep 2025 07:26:00 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "Which will be the last team standing in October? Our MLB experts predict which teams will win each series of the postseason.",
      "No team is fully healthy by the time October rolls around"
    ],
    "image_url": "",
    "titles": [
      "2025 MLB playoffs: Our predictions from the wild cards to the World Series",
      "2025 MLB playoffs: The eight injuries that could have the biggest impact on the World Series chase"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.984,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.687,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "MLB experts have made predictions on which teams will win each series of the postseason, acknowledging that no team is fully healthy by October. The outcome of these predictions and the actual winners of the postseason series remain to be seen as the competition progresses.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: progress",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Canada Labels Bishnoi Gang as Terrorist, Seizes Assets",
    "domain": "general",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Mon, 29 Sep 2025 17:38:05 GMT",
    "source": "The Guardian",
    "sources": [
      "CityNews",
      "Global News",
      "The Guardian"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "www.theguardian.com",
      "globalnews.ca"
    ],
    "snippets": [
      "<p>Canadian government accuses the Lawrence Bishnoi gang of being involved in murder of prominent Sikh activist Hardeep Singh Nijjar near Vancouver</p><p>Canada’s federal government has announced that a powerful and ruthless Indian gang which uses “murder, shootings and arson” to extort and intimida",
      "Public Safety Minister Gary Anandasangaree announced the designation in a news release Monday, saying it will help Canadian security, intelligence and police agencies.",
      "Canada has listed the Bishnoi gang as a terrorist entity, following calls from Conservative and NDP politicians. The listing bars Canadians from financing or aiding the group led by Lawrence Bishnoi, the gang&#8217;s leader in India, who has reportedly coordinated criminal activities from a cellphon"
    ],
    "image_url": "https://i.guim.co.uk/img/media/3e6fe0d491a575c5d505001e91132d96e7268bf4/686_275_1130_904/master/1130.jpg?width=140&quality=85&auto=format&fit=max&s=5327c73a69e1f37027804a86d5765837",
    "titles": [
      "Canada designates Indian gang linked to high-profile killings as terrorist entity",
      "B.C. government welcomes Canada listing India-based Bishnoi gang as terrorist entity",
      "Canada lists the Bishnoi gang as a terrorist entity"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.665,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.68,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Canada has officially designated the India-based Bishnoi gang as a terrorist entity, led by Lawrence Bishnoi. This action enables Canadian authorities to seize property and freeze accounts associated with the gang. The decision follows advocacy from Conservative and NDP politicians, aiming to prevent Canadians from financially supporting or assisting the group's criminal activities.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Flames Beat Kraken 2-1 in Shootout at Pre-Season Game",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Tue, 30 Sep 2025 05:09:15 +0000",
    "source": "Global News",
    "sources": [
      "Sportsnet",
      "Global News"
    ],
    "domains": [
      "www.sportsnet.ca",
      "globalnews.ca"
    ],
    "snippets": [
      "Matvei Gridin and Morgan Frost scored in the shootout and netminder Dustin Wolf took care of the rest as the Calgary Flames edged the Seattle Kraken 2-1 in NHL pre-season action at Climate Pledge Arena on Monday.",
      "<p>Watch as 2024 first-round pick Matvei Gridin scores the shootout winner for the Calgary Flames.</p>"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/66acc8b2c205e7163f50bad7c41a7d6edd1eeb9147bbd8758049b9a1965f1b89.jpg?quality=65&strip=all",
    "titles": [
      "Wolf shines as Flames beat Kraken in shootout",
      "Flames’ Gridin snipes shootout winner vs. Kraken"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.863,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.678,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "In an NHL pre-season game at Climate Pledge Arena, the Calgary Flames defeated the Seattle Kraken 2-1 in a shootout. Matvei Gridin and Morgan Frost scored for the Flames during the shootout, with Gridin netting the winning goal. Goalie Dustin Wolf secured the victory by stopping shots from the Kraken.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Wales Recalls Aaron Ramsey as Captain for World Cup Qualifier and England Friend",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 30 Sep 2025 11:51:56 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Yahoo Sports"
    ],
    "domains": [
      "www.bbc.com"
    ],
    "snippets": [
      "Wales recall captain Aaron Ramsey for October's World Cup qualifier against Belgium and friendly with England.",
      "Wales recall captain Aaron Ramsey for October's World Cup qualifier against Belgium and friendly with England."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/3980/live/7142f9b0-9d4e-11f0-9e5e-c7b443a2076d.jpg",
    "titles": [
      "Wales recall Ramsey for Belgium and England games",
      "Wales recall Ramsey for Belgium and England games"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.972,
      "consensus": 0.571,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.668,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Wales has decided to recall Aaron Ramsey as captain for the upcoming World Cup qualifier against Belgium and a friendly with England in October. Ramsey's return marks an important development for the national team as they prepare for these crucial matches.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Arunachal Tribes Protest Against Mega-Dam Amid India-China Water Tensions",
    "domain": "science",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Tue, 30 Sep 2025 10:53:32 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Phys.org"
    ],
    "domains": [
      "www.aljazeera.com",
      "phys.org"
    ],
    "snippets": [
      "Tribes in Arunachal Pradesh state fear displacement as the dam is planned as a response to China&#039;s upstream project.",
      "On a football field ringed by misty mountains, the air rang with fiery speeches as tribesmen protested a planned mega-dam—India's latest move in its contest with China over Himalayan water."
    ],
    "image_url": "",
    "titles": [
      "Tribesmen in India’s northeast protest mega-dam plan to counter China",
      "India plans mega-dam to counter China water fears"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.973,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.664,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In Arunachal Pradesh, India, tribes are protesting against a planned mega-dam, fearing displacement. This dam is India's response to China's upstream project, highlighting tensions over Himalayan water resources. The protest took place on a football field surrounded by mountains, with tribesmen delivering impassioned speeches against the project.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Mourinho Praises Chelsea's Champions League Chances Under Maresca",
    "domain": "sports",
    "source_domain": "thefootballfaithful.com",
    "location": "national",
    "published": "Tue, 30 Sep 2025 11:35:00 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Sports Illustrated",
      "Yahoo Sports"
    ],
    "domains": [
      "thefootballfaithful.com",
      "news.google.com"
    ],
    "snippets": [
      "Jose Mourinho believes Chelsea have the “potential” to win the Champions League after getting “back on track” under manager Enzo Maresca. The Special One returns to Stamford Bridge with Benfi...",
      "<a href=\"https://news.google.com/rss/articles/CBMiiwFBVV95cUxQMm9yX1NMb3VweDZwSG9RczQ4dmp4RjB1b0hLVjBZRENId0QxeWdhRUc5SWlzOEpfMDR6WHNsa1M2cEpZYmZtVmVpTzAydkNIWlZNLUNha0V0SVZNbVNIZGZpYkphVGppeFk5aFFBX3ctdWRIUVhXU3VRYjRMcUNvY0drem9iTDAza2xR?oc=5\" target=\"_blank\">‘The Biggest One’—Jose Mourinho Makes B"
    ],
    "image_url": "",
    "titles": [
      "Jose Mourinho backs Chelsea to compete for Champions League",
      "‘The Biggest One’—Jose Mourinho Makes Bold Chelsea Claim Before Champions League Reunion - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.987,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.659,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Jose Mourinho, currently managing Benfica, praised Chelsea's potential to win the Champions League, crediting their improvement to manager Enzo Maresca. He made these comments as he prepares to return to Stamford Bridge with his team.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Broncos Overwhelm Bengals with 512 Yards in Monday Night Victory",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Tue, 30 Sep 2025 11:44:23 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sports Illustrated"
    ],
    "domains": [
      "www.cbssports.com",
      "news.google.com"
    ],
    "snippets": [
      "SportsLine's model simulated Detroit vs. Cleveland 10,000 times and revealed its MLB picks for Tuesday afternoon's American League Wild Card Game 1 matchup at Progressive Field in Cleveland",
      "The SportsLine Projection Model has revealed its Cincinnati Bengals vs. Denver Broncos picks on Monday Night Football",
      "The SportsLine projection model has revealed its New York vs. Miami picks for the first Week 4 Monday Night Football game",
      "SportsLine expert Emory Hunt has revealed his New York Jets vs. Miami Dolphins picks in AFC East matchup on Monday Night Football",
      "<a href=\"https://news.google.com/rss/articles/CBMingFBVV95cUxNenJnbmtKNS01Ul93ZnlrNXMzclVSdG1LNXRSNDJWMERVS0tXTXNQdU9jcnBjNE1TNmlZSXprWkZEYW1EbFlQWHViWXBIME0wc1FodG1mOTBBTGEwSjZKMlhFSEdVaDEwUDYxdmJmdVQ0bm83dFpSNDZGVWQwd2JUYnRibWVoMVBlWDRXa3VXbkY4WE93dFNQNjN2RXlWUQ?oc=5\" target=\"_blank\">Bengals vs. B"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/21/cb809fd0-cfa3-4206-9b98-26329d8524dc/tigers-imagn.png",
    "titles": [
      "Tigers vs. Guardians prediction, odds, start time: 2025 MLB picks, best bets for AL Wild Card Game 1 by model",
      "Bengals vs. Broncos prediction, odds, line, time: 2025 NFL Week 4 Monday Night Football picks by proven model",
      "Dolphins vs. Jets prediction, odds, start time: 2025 NFL Week 4 Monday Night Football picks from proven model",
      "Jets vs. Dolphins prediction, odds, time: 2025 NFL Week 4 Monday Night Football picks from expert on 18-9 roll",
      "Bengals vs. Broncos: Three Bold Predictions for Week 4 ‘Monday Night Football' - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.99,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.653,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Denver Broncos defeated the Cincinnati Bengals in Monday Night Football at Empower Field at Mile High in Denver. Denver's offense amassed 512 yards, including 186 rushing yards, leading to a significant victory. This game also marked the Broncos having a player rush for over 100 yards, contributing to their dominant performance against the Bengals.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Rookie Quinshon Judkins Recommended as Week 5 Fantasy Football Target",
    "domain": "business",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Tue, 30 Sep 2025 11:40:23 +0000",
    "source": "CBS Sports",
    "sources": [
      "Forbes",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "www.forbes.com"
    ],
    "snippets": [
      "Here's who you should be targeting ahead of your Week 5 matchups",
      "Quinshon Judkins has come out of the gates on fire. For the 36th pick in the 2025 NFL Draft, talent was never the question...."
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2023/10/12/b5d79dc8-02ed-401a-b4d7-89441617c8c4/darius-slayton-usatsi-cbs.jpg",
    "titles": [
      "Fantasy Football Week 5 Waiver Wire: Darius Slayton should see plenty of targets with Malik Nabers out",
      "Fantasy Football Week 5: Flex Rankings (RB,WR,TE)"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.989,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.653,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Quinshon Judkins, the 36th pick in the 2025 NFL Draft, has had a strong start to the season. He is recommended as a key player to target for Week 5 fantasy football matchups, highlighting his significant talent and early performance success.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "NFL Week 4: Updated Power Rankings for All 32 Teams Released",
    "domain": "sports",
    "source_domain": "broncoswire.usatoday.com",
    "location": "national",
    "published": "Tue, 30 Sep 2025 11:30:51 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports",
      "Bleacher Report"
    ],
    "domains": [
      "broncoswire.usatoday.com",
      "news.google.com"
    ],
    "snippets": [
      "Following their 'MNF' win, the Broncos jumped six spots in NFL power rankings.",
      "<a href=\"https://news.google.com/rss/articles/CBMiiAFBVV95cUxNeDlvc3BTUmtjOEtWSGpCaVNoaFRGS1RRUmlJRkY2dmVsSE9mSHRxMEdWS2VaME1HTWNlcGFpQjdLTXFsRVN6R2I3NHZpZUQ0SmRYQUR4cktVcVhLOXU3eGo0MEZ0dXBscGFFZGY2X1BsYzNyZ1Bhb29ZTFJMeU9Sbm93eWh4WDd0?oc=5\" target=\"_blank\">B/R Experts Week 5 NFL Power Rankings</a>&n"
    ],
    "image_url": "",
    "titles": [
      "NFL power rankings: See where the Broncos rank after Week 4",
      "B/R Experts Week 5 NFL Power Rankings - Bleacher Report"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.985,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.652,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Week 4 of the 2025 NFL season has concluded, and updated power rankings for all 32 teams have been released. This ranking sorts the teams from best to worst based on their performance up to this point in the season. For detailed rankings and analysis, refer to the provided link.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Opera Introduces AI-Powered Browser Neon at $19.90/Month",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-09-30T04:00:00-04:00",
    "source": "The Verge",
    "sources": [
      "TechCrunch",
      "The Verge"
    ],
    "domains": [
      "techcrunch.com",
      "www.theverge.com"
    ],
    "snippets": [
      "A limited number of people will get to try out Opera’s AI browser, Neon, starting today for $19.90 per month.&#160; The Norwegian software company first announced the “agentic browser” in May, but details were sparse. Now, we know that Opera Neon includes different AI agents that are tailored to spe",
      "Neon will write code snippets, includes an agent that will do tasks for you, and handles repeatable prompts."
    ],
    "image_url": "",
    "titles": [
      "Opera launches its AI browser, but you&#8217;ll have to pay to try it",
      "Opera launches its AI-centric Neon browser"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.916,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.645,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Opera has launched its AI-powered browser, Neon, available to a limited number of users for $19.90 per month. Announced in May, Neon features AI agents that can write code snippets, perform tasks, and manage repeatable prompts, aiming to enhance user productivity and browsing experience.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Economic Data Release at Risk Amid Congressional Spending Deadlock",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 30 Sep 2025 08:18:21 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Financial Times"
    ],
    "domains": [
      "www.ft.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Funding will be cut off unless Republicans and Democrats can agree a way forward on a spending bill.",
      "Key economic data would be delayed if lawmakers fail to break funding deadlock"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/5096/live/f6627200-9d40-11f0-973f-51ea2fc41b54.jpg",
    "titles": [
      "Why the US government might shut down and when it might happen",
      "What happens if the US government shuts down?"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.903,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.636,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Funding for key economic data is at risk as Republicans and Democrats struggle to agree on a spending bill. If no resolution is reached, the release of crucial economic information could be delayed.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "California Enacts AI Transparency Law, Mandates Safety Disclosures",
    "domain": "technology",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Mon, 29 Sep 2025 21:02:11 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMiekFVX3lxTE1ETDZIR1NSbnh6aGFSclI0b0d0cENGOWFscDQ0RWRSR01yZ1c4Y0tGdkN6UVU2M0lhX3l4c0JBMlJmMFI2WTFsMElDcVQ3STQ2X0pfcG41bEh6TmhzZ0haVC1yTGpmUVBGQXJKcXhsdksxcjlRcWU2Ry1n?oc=5\" target=\"_blank\">Newsom signs major California AI bill</a>&nbsp;&nbsp;<font colo",
      "SB 53 requires large AI labs – including OpenAI, Anthropic, Meta, and Google DeepMind – to be transparent about safety protocols. It also ensures whistleblower protections for employees at those companies."
    ],
    "image_url": "",
    "titles": [
      "Newsom signs major California AI bill - Axios",
      "California Governor Newsom signs landmark AI safety bill SB 53"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.714,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.605,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "California Governor Gavin Newsom signed Senate Bill 53, the \"Transparency in Frontier Artificial Intelligence Act,\" into law. Authored by Sen. Scott Wiener, the legislation mandates large AI labs like OpenAI, Anthropic, Meta, and Google DeepMind to disclose their safety protocols and provides whistleblower protections for their employees. This landmark bill aims to increase transparency in the AI industry.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "OpenAI Adds Parental Controls to ChatGPT, Aiming to Curb Harmful Content",
    "domain": "technology",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Mon, 29 Sep 2025 19:46:59 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMic0FVX3lxTE1zaEFuNXVrdGFLd0RLY29oRm8zSkNqanl0UEcxb01sU2ZBbXhfei1XZFRmYmNwRUFqVVVaOXFDaWFDbjJLVWtGS1J1R0tobjdZRnFNVVRhQkVRaGRzRjVzdXlha19DTzBVcWVKVXFNaDhDbk0?oc=5\" target=\"_blank\">How OpenAI's new ChatGPT parental controls work</a>&nbsp;&nbsp;<font col",
      "The new safety features come after numerous incidents of ChatGPT validating users' delusional thinking instead of redirecting harmful conversations -- including the death of a teenage boy by suicide."
    ],
    "image_url": "",
    "titles": [
      "How OpenAI's new ChatGPT parental controls work - Axios",
      "OpenAI rolls out safety routing system, parental controls on ChatGPT"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.695,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.601,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "OpenAI introduced new parental controls for ChatGPT on the web, with mobile updates expected soon. These controls aim to limit or eliminate content such as sexual roleplay and image generation. This update follows incidents where ChatGPT was criticized for not adequately handling harmful conversations, including a case linked to a teenager's suicide.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "EA Acquired by PIF, Silver Lake, and Affinity for $55 Billion",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Mon, 29 Sep 2025 20:02:06 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Ars Technica"
    ],
    "domains": [
      "arstechnica.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "Electronic Arts said it has agreed to be acquired by PIF, Silver Lake and Affinity Partners in an all-cash deal worth $55 billion.",
      "Investors will receive $210 per share, well above the stock's all-time high."
    ],
    "image_url": "",
    "titles": [
      "EA going private in $55 billion deal that will pay shareholders $210 a share",
      "It’s official: EA is selling to private equity in $55 billion deal"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.699,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.595,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Electronic Arts announced its acquisition by PIF, Silver Lake, and Affinity Partners in a deal valued at $55 billion. Investors are set to receive $210 per share in cash, surpassing the stock's historical peak.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Anthropic's Claude Model Outshines OpenAI, Google in Coding Tests",
    "domain": "technology",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Mon, 29 Sep 2025 17:36:22 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "Ars Technica"
    ],
    "domains": [
      "arstechnica.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMieEFVX3lxTE1SMkpRU0ZzVks1d2Vrd0xqeTFSYTZoakwxSWlkV0JkRzl6c1owZ2k0cTVnYzQyTUxLV3Z0dHNiLWNfQV9iYkswX1A1U0pqbm8ydmpyRnF0Y2RuRWhfSGhOQUZWaG43QlljTmx2eFdrRzdNQzRjQXVYcg?oc=5\" target=\"_blank\">Anthropic's latest Claude model can work for 30 hours on its own<",
      "Latest Claude model beats OpenAI and Google on coding tests."
    ],
    "image_url": "",
    "titles": [
      "Anthropic's latest Claude model can work for 30 hours on its own - Axios",
      "Anthropic says its new AI model “maintained focus” for 30 hours on multistep tasks"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.665,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.595,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Anthropic has developed the latest Claude model, outperforming OpenAI and Google on coding tests. The model can operate autonomously for 30 hours. This advancement showcases the model's capabilities in the field of artificial intelligence.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Anthropic Unveils Claude Sonnet 4.5 AI, Masters Coding with Business Focus",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Mon, 29 Sep 2025 17:00:01 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "Claude Sonnet 4.5 is better at coding, using computers and meeting practical business needs.",
      "Anthropic says its new AI model is robust enough to build production-ready applications, rather than just prototypes."
    ],
    "image_url": "",
    "titles": [
      "Anthropic launches Claude Sonnet 4.5, its latest AI model that's 'more of a colleague'",
      "Anthropic launches Claude Sonnet 4.5, its best AI model for coding"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.656,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.593,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Anthropic introduced Claude Sonnet 4.5, an AI model they claim is the best for coding tasks, emphasizing its practical business applications. It autonomously coded a chat app similar to Slack or Teams, producing 11,000 lines of code in 30 hours. The company highlights the model's capability to create production-ready applications, marking a significant advancement in applied artificial intelligence.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Special Committee Probes Auto Parts Group Collapse, Examines Financing",
    "domain": "business",
    "source_domain": "www.ft.com",
    "location": "global",
    "published": "Tue, 30 Sep 2025 11:25:13 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times"
    ],
    "domains": [
      "www.ft.com"
    ],
    "snippets": [
      "Special committee investigating auto parts group’s financing also examines whether collateral was ‘commingled’",
      "Car parts group’s collapse has left creditors and others exposed — but some spied an opportunity in the chaos"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F80bb7b68-69fa-4623-a6d2-39f0633b207b.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "First Brands bankruptcy probe examines if invoices were pledged multiple times",
      "First Brands bankruptcy: the losers — and winners"
    ],
    "score_components": {
      "magnitude": 0.393,
      "recency": 0.963,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.468,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A special committee is investigating the collapse of an auto parts group, focusing on its financing and whether collateral was improperly mixed. The group's failure has negatively affected creditors and others, though some see potential benefits amid the turmoil.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]