[
  {
    "title": "Trump to Nominate Heritage Foundation Economist as BLS Commissioner",
    "domain": "general",
    "location": "national",
    "published": "Mon, 11 Aug 2025 19:50:34 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "Axios",
      "MarketWatch",
      "CNBC",
      "The Guardian"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "President Trump plans to tap an economist from the conservative Heritage Foundation to oversee the Bureau of Labor Statistics. He fired the previous leader after a disappointing jobs report.",
      "<a href=\"https://news.google.com/rss/articles/CBMif0FVX3lxTE9yNXNQcUpRYTkwc3VRRlgyTzZzSmJrYjFMSjJDRmJKdDVCYVlITF81bGZlQWRRVk1xbWFBM3IzMGF5b3lYdkZmZUd2QUp0Z091d3g1RGRXcV9fQ0JseEJUZUQ1YWRjQ1VrTUVlTkVkR2hSaXBzS1d4akhQMjI3RXc?oc=5\" target=\"_blank\">Trump names Heritage's E.J. Antoni to lead Bureau of Lab",
      "President Trump, who claimed former BLS Commissioner Erika McEntarfer manipulated jobs data, said Antoni would release \"honest and accurate\" numbers.",
      "<p>EJ Antoni, longtime critic of Bureau of Labor Statistics, nominated to replace Erika McEntarfer, who Trump fired</p><p>Donald Trump has announced he is nominating EJ Antoni, the chief economist at the conservative Heritage Foundation, as the next commissioner of the Bureau of Labor Statistics.</p",
      "<p>EJ Antoni nominated to take over from Erika McEntarfer, who was fired by Trump earlier this month</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/2025/aug/11/trump-washington-dc-crime\">Trump vows to ‘clean up’ DC crime despite sharp drop in violence</a></p></li></ul><p><strong>Donald T",
      "President Donald Trump said late Monday he plans to nominate E.J. Antoni, the chief economist of the conservative Heritage Foundation, to become commissioner of the Bureau of Labor Statistics."
    ],
    "image_url": "",
    "titles": [
      "Trump taps conservative economist to lead statistics agency",
      "Trump names Heritage's E.J. Antoni to lead Bureau of Labor Statistics - Axios",
      "Trump says he's nominating E.J. Antoni as Bureau of Labor Statistics commissioner",
      "Trump nominates Heritage Foundation economist as labor statistics chief",
      "Trump nominates chief economist at rightwing Heritage Foundation to lead Bureau of Labor Statistics – live",
      "Trump picks conservative economist E.J. Antoni to lead Bureau of Labor Statistics"
    ],
    "score_components": {
      "magnitude": 0.92,
      "recency": 0.994,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.846,
    "summary": "President Donald Trump announced his intention to nominate E.J. Antoni, a chief economist at the conservative Heritage Foundation, as the new commissioner of the Bureau of Labor Statistics (BLS). This decision follows Trump's firing of the previous commissioner, Erika McEntarfer, citing dissatisfaction with a recent jobs report and accusing her of manipulating data. Trump asserts that Antoni will provide \"honest and accurate\" employment data.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 66 tokens"
  },
  {
    "title": "Nvidia, AMD to Pay US 15% Revenue from AI Chip Sales in China",
    "domain": "general",
    "location": "national",
    "published": "Mon, 11 Aug 2025 13:04:57 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "TechCrunch",
      "Deutsche Welle",
      "New York Times",
      "Ars Technica"
    ],
    "domains": [
      "general",
      "technology"
    ],
    "snippets": [
      "The president said that Nvidia would pay the government in exchange for easing export restrictions — and that he'd initially asked for a larger cut.",
      "The US government began issuing artificial intelligence chip export licenses after the revenue-sharing deal, despite security concerns.",
      "In a highly unusual arrangement with President Trump, the companies are expected to kick 15 percent of what they make in China to the U.S. government.",
      "The global AI chip race narrative used to be about U.S. national security, but apparently now it's about tariffs: Nvidia and AMD have agreed to pay the U.S. government 15% of the revenue they make from sales of high-end AI chips to China in exchange for licenses to sell those chips in the country, t",
      "The deal won’t resolve national security concerns."
    ],
    "image_url": "",
    "titles": [
      "Trump says Nvidia will hand the U.S. 15% of its H20 chip sales to China",
      "Nvidia, AMD to pay US 15% of AI chip sales to China",
      "U.S. Government to Take Cut of Nvidia and AMD A.I. Chip Sales to China",
      "Nvidia, AMD may sell high-end AI chips to China if they pay US a cut",
      "Trump strikes “wild” deal making US firms pay 15% tax on China chip sales"
    ],
    "score_components": {
      "magnitude": 0.94,
      "recency": 0.863,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.827,
    "summary": "Nvidia and AMD have agreed to pay the U.S. government 15% of their revenue from sales of high-end AI chips in China. This agreement, part of a deal with President Trump, allows them to obtain licenses to export these chips despite ongoing national security concerns. The arrangement, which diverges from the usual national security narrative to a revenue-sharing model, was confirmed after the U.S. began issuing export licenses following negotiations. The deal does not address the underlying national security issues.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 84 tokens"
  },
  {
    "title": "Trump to Discuss Ukraine War End with Putin in Alaska Summit",
    "domain": "general",
    "location": "national",
    "published": "Mon, 11 Aug 2025 14:15:08 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "Axios",
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "President Trump says he thinks Russian President Vladimir Putin is ready to end his war on Ukraine, but he will use a Friday summit to \"feel out\" his counterpart.",
      "The US president says talks with Putin on Friday will be a \"feel-out meeting\" aimed at urging Russia to end the war in Ukraine.",
      "<a href=\"https://news.google.com/rss/articles/CBMiekFVX3lxTE5qUV9GWDRudDU5ckp3Qzk1LWZmZ1pnVG9QSFBnS2V5QUNmY05PbFhjaXpvWnFjRGV2NzVxU181VFp4RVctbnFjUmJfZVFhc1ljZUV5SkpSeVdLUEw5TWVaNTFwVFBFeTRaamZIeEhxb3BTYno3azJYdTRR?oc=5\" target=\"_blank\">Trump says he and Putin will discuss Ukraine's future borders</",
      "<p>US president gives details on Alaska meeting and expresses frustration with Zelenskyy’s conditions for any peace deal</p><p>Donald Trump has confirmed that he and Vladimir Putin will discuss “land swapping” when they meet on Friday in Alaska for a <a href=\"https://www.theguardian.com/world/2025/a"
    ],
    "image_url": "",
    "titles": [
      "Trump says he will 'feel out' Putin in Alaska on ending the war in Ukraine",
      "Trump says he will try to get back territory for Ukraine in talks with Putin",
      "Trump says he and Putin will discuss Ukraine's future borders - Axios",
      "Trump says he and Putin will discuss ‘land swapping’ at Ukraine war summit"
    ],
    "score_components": {
      "magnitude": 0.96,
      "recency": 0.885,
      "consensus": 0.935,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.822,
    "summary": "President Trump plans to use a summit in Alaska on Friday to discuss the potential end of the war in Ukraine with Russian President Vladimir Putin. Trump mentioned the meeting would serve as a \"feel-out meeting\" to urge Russia towards peace and will include discussions on Ukraine's future borders, specifically the possibility of \"land swapping.\" This announcement follows Trump's expression of frustration with Ukrainian President Zelenskyy's conditions for a peace deal.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 75 tokens"
  },
  {
    "title": "Trump Extends Tariff Pause on Chinese Imports for 90 Days",
    "domain": "business",
    "location": "global",
    "published": "Mon, 11 Aug 2025 20:35:12 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Axios",
      "Al Jazeera",
      "Forbes",
      "CNBC"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "US President Donald Trump signed an extension just before midnight in Beijing, when the pause was to expire.",
      "<a href=\"https://news.google.com/rss/articles/CBMicEFVX3lxTE9FNnZTQUw0dlRTUjdpTmpCTmRfWHJnbnNGTEtsVjhwVEdRaTRjOXVjV0FsbGFxQXVnUVJ1NHl1Sl85WmpxZERIeVFxRXo0Vk9wZFFoZW5xZ1ZMYnFNN1NRMjJXdU9ieElRbXZZS3VpMFU?oc=5\" target=\"_blank\">U.S., China extend tariff pause another 90 days</a>&nbsp;&nbsp;<font color=\"",
      "President Donald Trump has signed an executive order that will prevent U.S. tariffs on Chinese goods from spiking for another 90 days.",
      "Steep tariffs against Chinese imports to the U.S. were expected to rise Tuesday when a 90-day pause expired."
    ],
    "image_url": "",
    "titles": [
      "US to extend China tariff pause another 90 days",
      "U.S., China extend tariff pause another 90 days - Axios",
      "Trump extends China tariff deadline by 90 days",
      "Trump Pauses China Tariffs Another 90 Days"
    ],
    "score_components": {
      "magnitude": 0.94,
      "recency": 0.929,
      "consensus": 0.985,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.811,
    "summary": "President Donald Trump signed an executive order extending the pause on increasing tariffs against Chinese imports for another 90 days, just before the previous pause was set to expire at midnight in Beijing. This action prevents the expected rise in tariffs that was scheduled for Tuesday.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 46 tokens"
  },
  {
    "title": "Al Jazeera Reporter and Colleagues Killed in Israeli Airstrike in Gaza",
    "domain": "general",
    "location": "global",
    "published": "Mon, 11 Aug 2025 17:16:51 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Deutsche Welle",
      "LA Times",
      "Al Jazeera",
      "New York Times"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "Sharif was killed when Israel targeted a tent used by media in northern Gaza, alongside six others, Al Jazeera said.",
      "Israel has killed nearly 270 journalists and media workers since it launched its war on Gaza.",
      "Anas al-Sharif, a reporter previously threatened by Israel, and four colleagues were killed in an Israeli airstrike.",
      "Officials accused Anas al-Sharif of being a Hamas operative posing as a reporter. Al Jazeera says he and the other four victims all worked for the network.",
      "<p>Al Jazeera reporter Anas al-Sharif, 28, drew millions of followers on social media and emerged as one of the top voices in the Arab world for his chronicling of the war in Gaza.</p>"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/a03b/live/5b0875e0-76d8-11f0-a20f-3b86f375586a.jpg",
    "titles": [
      "Who was Anas al-Sharif, prominent Gaza journalist killed by Israel?",
      "Here are the names of the journalists Israel killed in Gaza",
      "Israel kills Al Jazeera journalist Anas al-Sharif in Gaza",
      "Who Were the Al Jazeera Journalists Killed in an Israeli Strike in Gaza?",
      "Prominent Al Jazeera journalist among several killed in Israeli strike on Gaza press tent"
    ],
    "score_components": {
      "magnitude": 0.96,
      "recency": 0.849,
      "consensus": 0.988,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.803,
    "summary": "Anas al-Sharif, a 28-year-old Al Jazeera reporter with a significant social media following, and four colleagues were killed in an Israeli airstrike targeting a media tent in northern Gaza. Israel has accused al-Sharif of being a Hamas operative, a claim disputed by Al Jazeera. This incident is part of a broader conflict in which nearly 270 journalists and media workers have been killed since Israel launched its war on Gaza.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 74 tokens"
  },
  {
    "title": "Trump to Deploy National Guard, Control D.C. Police Amid Crime Concerns",
    "domain": "general",
    "location": "global",
    "published": "Mon, 11 Aug 2025 19:31:16 GMT",
    "source": "BBC",
    "sources": [
      "Axios",
      "BBC",
      "Deutsche Welle",
      "The Guardian",
      "LA Times",
      "Al Jazeera",
      "CNBC",
      "Financial Times"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "The president also takes control of the city's police force, as the mayor rejects his claims of a crime wave.",
      "President Trump says he will deploy hundreds of troops to Washington DC to address crime there.",
      "And how JD Vance’s English holiday is causing havoc in the Cotswolds",
      "US President Donald Trump said he is taking control of Washington, DC’s police force and deploying the National Guard.",
      "US President Donald Trump claimed the city had been taken over by criminals and gangs. But police statistics show that violent crimes have decreased significantly in recent years.",
      "<a href=\"https://news.google.com/rss/articles/CBMiiwFBVV95cUxQakxHQVgzZ19lVkx0YVpKYVlud28zb0F0bmh3UGlRU1ZRenNzNmVKNXpFcmE3NE56RjNTRklVTktLU0RSR2dfaVY5UlZMZUlORWFwWWlsNWJ0SnpkQ1V5cUt6QzZ0LWN0UDZlVUNHX2xOWXlyUFBpYzhsNm8yMmdSeS1Tc2FpU2ExTlZv?oc=5\" target=\"_blank\">Trump to deploy National Guard to D.C. ",
      "Trump in a social media post on Sunday declared that \"the Homeless\" in Washington, D.C., will \"have to move out.\"",
      "Mayor Muriel Bowser acknowledges crime ‘spike’ in 2023 but says there has been a sharp decline since",
      "<p>President claims US capital ‘overtaken by violent gangs and bloodthirsty criminals … and homeless people’</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/live/2025/aug/11/donald-trump-washington-crime-homelessness-redistricting-tariffs-us-politics-news-live-updates\">US politics – live ",
      "<p>Trump is invoking Section 740 of the District of Columbia Home Rule Act that places the Metropolitan Police Department under direct federal control.</p>"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/8608/live/ea34de40-76ef-11f0-a20f-3b86f375586a.jpg",
    "titles": [
      "Trump deploys National Guard to Washington DC and pledges crime crackdown",
      "Is crime in Washington DC 'out of control', as Trump claims?",
      "Americanswers…on 5 Live! Why is Donald Trump deploying the National Guard to Washington DC?",
      "Trump to deploy National Guard to Washington DC",
      "Trump announces National Guard deployment in Washington DC",
      "Trump to deploy National Guard to D.C. and federalize city police - Axios",
      "Trump puts Washington, DC, police under federal control, deploys National Guard",
      "Trump deploys National Guard in Washington over ‘safety emergency’",
      "Trump seizes control of Washington DC police and deploys national guard",
      "Trump expands L.A. military tactics by sending National Guard to Washington, D.C."
    ],
    "score_components": {
      "magnitude": 0.92,
      "recency": 0.89,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.8,
    "summary": "President Donald Trump announced plans to deploy the National Guard and take control of Washington D.C.'s Metropolitan Police Department, citing concerns over crime and homelessness. Despite Trump's claims of the city being \"overtaken\" by criminals and gangs, police statistics indicate a significant decrease in violent crimes in recent years. D.C.'s mayor has criticized the comparison to a war-torn country as exaggerated and misleading. Trump's actions are based on invoking section 740 of the District of Columbia Home Rule Act.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 86 tokens"
  },
  {
    "title": "Explosion at Pennsylvania Steel Plant Kills One, Leaves One Missing",
    "domain": "general",
    "location": "global",
    "published": "Mon, 11 Aug 2025 21:00:30 GMT",
    "source": "BBC",
    "sources": [
      "Axios",
      "BBC",
      "Business Insider",
      "Al Jazeera",
      "The Guardian",
      "ABC News"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "A search and rescue operation is underway for another person who is unaccounted for, while the cause of the explosion is unknown.",
      "The massive US Steel coking plant is the largest such facility in North America.",
      "<a href=\"https://news.google.com/rss/articles/CBMikgFBVV95cUxOQU5KNWZuU24yWHJjSGdnVFNOR2YyMFpTZ3BlRXc1cG8tRlZ5QkdXYU9ldW5yN0R4UFdTZHJ4Y0hQLU5MODhEaC1tMkl4WnVid05sSlVfbWZXeFQ3Z3dVZ1dYbjNRM196cVBzb0htOUdtSDBNMGxsbnh3VS13SzNwV0k3WElfVU9ZWW8tMV9JcVVHQQ?oc=5\" target=\"_blank\">Explosions at U.S. Steel plan",
      "One person has died, one is unaccounted for and 10 are injured following an explosion at a Pennsylvania steel plant on Monday, local police said.",
      "<p>Two people missing and several injured as rescue operation under way at coking facility in Clairton</p><p>One person has died and two are believed to be unaccounted for after an explosion at a US Steel plant in <a href=\"https://www.theguardian.com/us-news/pennsylvania\">Pennsylvania</a>, near Pitt",
      "The explosion took place at the US Steel Clairton Coke Works plant, located south of Pittsburgh, Pennsylvania."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/fa12/live/e3c29490-76df-11f0-ab13-2ffa12a7899c.jpg",
    "titles": [
      "US Steel plant explosion in Pennsylvania leaves one dead and 10 injured",
      "One dead, dozens injured in steel plant explosion in Pennsylvania",
      "Explosions at U.S. Steel plant leave 1 dead, 10 injured - Axios",
      "WATCH:  One dead, 10 injured in explosion at Pennsylvania steel plant, officials say",
      "Explosion ‘like thunder’ at Pennsylvania US Steel plant leaves at least one dead",
      "1 dead, 1 missing after explosion at US Steel plant in Pennsylvania"
    ],
    "score_components": {
      "magnitude": 0.9,
      "recency": 0.918,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.799,
    "summary": "An explosion at the US Steel Clairton Coke Works plant in Pennsylvania resulted in one death, one person missing, and 10 injuries. The incident occurred south of Pittsburgh at North America's largest coking facility. The cause of the explosion is currently unknown, and a search and rescue operation is underway for the missing individual.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 55 tokens"
  },
  {
    "title": "Australia to Recognize Palestinian State at UN, Aligns with Allies",
    "domain": "general",
    "location": "global",
    "published": "2025-08-11T11:18:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Axios",
      "Deutsche Welle",
      "New York Times",
      "Washington Post"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "Despite widespread international recognition of Palestine as a state, many Western nations say they will only endorse Palestinian statehood as part of a comprehensive peace agreement with Israel.",
      "<a href=\"https://news.google.com/rss/articles/CBMiekFVX3lxTE1YQzZidTlNWnRPYWN4SjRTOGZNYVlLeWtWcUFkN0M0UVdLZEF5UGo4cWpSR3g5Z0IxanYwNTA5OEVlMG9naVlGZld6Wjg2dGlkZWxMbEdlandZU0NXaTlNUHF4NjZnVEdnRjJXU1FiU1dIbkZ2LVlBc2ln?oc=5\" target=\"_blank\">Australia will recognize a Palestinian state, PM Albanese says<",
      "Anger over Israel’s conduct in Gaza has left it increasingly isolated as key allies move toward declarations of Palestinian statehood.",
      "Canberra is the latest U.S. ally to announce such a move in the face of growing global outrage over the dire humanitarian situation in Gaza.",
      "After similar announcements by France, Britain and Canada, Australia said it would act at the United Nations General Assembly session next month."
    ],
    "image_url": "",
    "titles": [
      "Which countries recognize Palestinian statehood?",
      "Australia will recognize a Palestinian state, PM Albanese says - Axios",
      "Here are countries that recognize a Palestinian state — or may do so soon",
      "Australia to recognize a Palestinian state, joining France, Canada and U.K.",
      "Australia to Recognize Palestinian Statehood"
    ],
    "score_components": {
      "magnitude": 0.9,
      "recency": 0.765,
      "consensus": 0.935,
      "constructiveness": 0.053,
      "proximity": 0.5
    },
    "score": 0.757,
    "summary": "Australia, led by Prime Minister Anthony Albanese, has announced it will recognize a Palestinian state at the upcoming UN General Assembly. This decision aligns with actions by France, Canada, and the UK, and comes amid international concerns over the humanitarian situation in Gaza. Albanese highlighted that a two-state solution offers the best hope for ending the conflict and suffering in the region. New Zealand is also considering a similar stance, with a decision expected soon.",
    "constructiveness_score": 0.053,
    "constructiveness_reason": "1 constructive keywords out of 76 tokens"
  },
  {
    "title": "Trump Critiques Intel CEO's Ties, Plans Collaboration",
    "domain": "business",
    "location": "global",
    "published": "Mon, 11 Aug 2025 17:46:39 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Business Insider",
      "Al Jazeera",
      "Fortune"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "US President Trump said last week that Intel’s CEO Lip-Bu Tan was &#039;highly conflicted&#039; due to ties with Chinese firms.",
      "Last week, President Donald Trump called Intel CEO Lip-Bu Tan \"highly CONFLICTED\" on Truth Social. On Monday, he posted calling Tan a \"success.\"",
      "\"Mr. Tan and my Cabinet members are going to spend time together, and bring suggestions to me during the next week.\""
    ],
    "image_url": "",
    "titles": [
      "Trump meets with Intel CEO after calling for his ouster",
      "Trump praises Intel's CEO, days after calling for him to resign",
      "Trump says Intel CEO has ‘amazing story,’ sets Cabinet talks"
    ],
    "score_components": {
      "magnitude": 0.82,
      "recency": 0.876,
      "consensus": 0.897,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.736,
    "summary": "Last week, US President Donald Trump labeled Intel CEO Lip-Bu Tan as \"highly conflicted\" due to connections with Chinese companies, expressing his concerns on Truth Social. However, Trump later referred to Tan as a \"success\" and announced plans for Tan and Cabinet members to collaborate and bring forward suggestions to him in the coming week.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 56 tokens"
  },
  {
    "title": "Exclusive: GitHub CEO to step down - Axios",
    "domain": "technology",
    "location": "national",
    "published": "Mon, 11 Aug 2025 15:30:33 GMT",
    "source": "Axios",
    "sources": [
      "TechCrunch",
      "Axios",
      "Ars Technica"
    ],
    "domains": [
      "general",
      "technology"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMibEFVX3lxTE1EeklEczZkc1JFa1BWRjZGbmF5ZG1QbGFHWDJEQkxWWTQ3MVpxeDluMnFFbVE3b2dtcHJFaXZUUUE3d3VoUWRtMXdIUEtjVXBlbmJEN21WX2pVa180QU1ydkQyS0NoTFN5bzJDcA?oc=5\" target=\"_blank\">Exclusive: GitHub CEO to step down</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Axios</fo",
      "The move comes as GitHub is facing growing competition from companies like Google and Cursor over AI tools for programmers.",
      "Microsoft bought GitHub for $7.5 billion in 2018."
    ],
    "image_url": "",
    "titles": [
      "Exclusive: GitHub CEO to step down - Axios",
      "GitHub CEO to step down",
      "GitHub will be folded into Microsoft proper as CEO steps down"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.818,
      "consensus": 0.897,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.718,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 7 tokens"
  },
  {
    "title": "Paramount Secures Exclusive Rights to UFC Broadcasts in $7.7B Deal",
    "domain": "business",
    "location": "national",
    "published": "Mon, 11 Aug 2025 14:50:50 GMT",
    "source": "Axios",
    "sources": [
      "Forbes",
      "Axios",
      "CNBC"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMie0FVX3lxTE5hR3hXUnpTRnJhVTRWTFhmRURjT0VPM1JabUNaYkZRako4ZVFEZkV1YVRlRGhoc0JWUmxVdVRFLXZmSjR1Z0dBWnpHTUg1aHRSd0VWNVdFR01SX0stYWoxT0hNOXFBNmNPQnRfTHREMl84cEtRVEE3V0YtSQ?oc=5\" target=\"_blank\">UFC, Paramount strike new deal for $7.7 billion over 7 years<",
      "The Paramount deal will eliminate the pay-per-view model used by ESPN in its current UFC deal, making all events available for no extra charge on Paramount+.",
      "UFC's CEO reveals why he wanted David Ellison's muscle behind his MMA giant, why pay-per-view events no longer work, and what a potential UFC fight at the White House would look like on CBS."
    ],
    "image_url": "",
    "titles": [
      "UFC, Paramount strike new deal for $7.7 billion over 7 years - Axios",
      "Paramount buys UFC rights in $7.7 billion, 7-year deal in first major move post-Skydance merger",
      "Dana White On How UFC Landed Its Blockbuster $7.7 Billion Streaming Deal With Paramount"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.807,
      "consensus": 0.897,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.716,
    "summary": "Paramount has entered a seven-year, $7.7 billion agreement to become the exclusive U.S. broadcaster of Ultimate Fighting Championship (UFC) events, starting in 2026. This deal, the first major agreement following Paramount's merger with Skydance, will see UFC events move from ESPN to Paramount+, eliminating the current pay-per-view model and making all events available at no additional cost to subscribers.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 65 tokens"
  },
  {
    "title": "Colombian Senator and Presidential Candidate Dies After Rally Shooting",
    "domain": "general",
    "location": "global",
    "published": "Mon, 11 Aug 2025 16:18:58 GMT",
    "source": "The Guardian",
    "sources": [
      "New York Times",
      "The Guardian",
      "Washington Post"
    ],
    "domains": [
      "general"
    ],
    "snippets": [
      "<p>Rightwing presidential hopeful, who had been in hospital in Bogotá since shooting, has died aged 39</p><p>Miguel Uribe, the Colombian senator and presidential hopeful who was shot in the head at a campaign event in June, has died, his wife has confirmed.</p><p>Uribe, an opposition candidate with ",
      "Miguel Uribe Turbay, a Colombian senator, was shot at a campaign event in Bogotá in June and had been in intensive care since.",
      "Mr. Uribe, a presidential hopeful, was shot in June at a campaign rally in Bogotá in an attack that shocked the nation."
    ],
    "image_url": "https://i.guim.co.uk/img/media/dba05eca61c929868d8050514dec191c1e42d8da/1227_485_4804_3844/master/4804.jpg?width=140&quality=85&auto=format&fit=max&s=09935376532a1dd7c4c0574c449bb2ca",
    "titles": [
      "Colombian senator Miguel Uribe dies after June campaign shooting",
      "Colombian presidential hopeful dies after being shot at campaign event",
      "Miguel Uribe, Colombian Senator Shot at Campaign Event, Dies at 39"
    ],
    "score_components": {
      "magnitude": 0.82,
      "recency": 0.832,
      "consensus": 0.847,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.715,
    "summary": "Miguel Uribe Turbay, a rightwing presidential candidate and Colombian senator, died at the age of 39 after being shot in the head at a campaign rally in Bogotá in June. Despite undergoing multiple surgeries and intensive care, Uribe succumbed to his injuries two months post-attack. His death has shocked the nation.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 52 tokens"
  },
  {
    "title": "Caitlin Clark's Recovery Progresses; Still Sidelined from Practice",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 11 Aug 2025 19:11:35 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Fever coach Stephanie White said Monday that All-Star guard Caitlin Clark is progressing from an injured right groin but still is not practicing.",
      "<p>Indiana Fever coach Stephanie White said Monday that All-Star guard Caitlin Clark is progressing from an injured right groin but still is not practicing.</p>"
    ],
    "image_url": "",
    "titles": [
      "Clark progressing, still not practicing with Fever",
      "Caitlin Clark making progress in recovery from groin injury but still not practicing with Fever"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.981,
      "consensus": 0.632,
      "constructiveness": 0.085,
      "proximity": 0.75
    },
    "score": 0.69,
    "summary": "Indiana Fever coach Stephanie White provided an update on All-Star guard Caitlin Clark, stating that she is improving from a right groin injury but has not yet returned to practice. Clark's recovery progress is ongoing, and she remains sidelined as she works towards full fitness.",
    "constructiveness_score": 0.085,
    "constructiveness_reason": "1 constructive keywords out of 47 tokens"
  },
  {
    "title": "Ottawa Senators Secure Land for New Downtown Arena at LeBreton Flats",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 11 Aug 2025 19:51:38 EDT",
    "source": "Sportsnet",
    "sources": [
      "Sportsnet",
      "CityNews"
    ],
    "domains": [
      "general",
      "sports"
    ],
    "snippets": [
      "<p>A new downtown arena for the Ottawa Senators has sometimes seemed like a more distant hope than a Stanley Cup. On Monday, one of those dreams took a leap forward. </p>",
      "OTTAWA — The Ottawa Senators are one step closer to having a new arena in the city&#8217;s downtown core. The Senators and the National Capital Commission have agreed on the sale of 4.5 hectares (11 acres) of land at LeBreton Flats for the project. The agreement of purchase and sale with Capital Spo"
    ],
    "image_url": "https://www.sportsnet.ca/wp-content/uploads/2025/08/lebreton-flats.jpg",
    "titles": [
      "Senators’ land purchase in LeBreton Flats gives optimism for downtown arena",
      "Ottawa Senators, NCC finalize land deal for new arena at LeBreton Flats"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.994,
      "consensus": 0.682,
      "constructiveness": 0.123,
      "proximity": 0.5
    },
    "score": 0.684,
    "summary": "The Ottawa Senators have made significant progress toward building a new arena in Ottawa's downtown area by agreeing with the National Capital Commission on the purchase of 4.5 hectares (11 acres) of land at LeBreton Flats. This development moves the team closer to realizing the long-discussed project, marking a key milestone in the efforts to secure a new venue for the team.",
    "constructiveness_score": 0.123,
    "constructiveness_reason": "2 constructive keywords out of 65 tokens"
  },
  {
    "title": "Cristiano Ronaldo and Georgina Rodriguez Announce Engagement",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 11 Aug 2025 17:35:50 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Cristiano Ronaldo's bride-to-be Georgina Rodriguez revealed her engagement to the soccer star with a post showing her ring on Instagram.",
      "<p>Soccer great Cristiano Ronaldo and his long-term partner Georgina Rodriguez are engaged.</p>"
    ],
    "image_url": "",
    "titles": [
      "Cristiano Ronaldo, Georgina Rodriguez share engagement news with dazzling ring",
      "Cristiano Ronaldo, partner Georgina Rodriguez announce engagement"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.948,
      "consensus": 0.632,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.668,
    "summary": "Soccer star Cristiano Ronaldo's partner, Georgina Rodriguez, announced their engagement on Instagram by sharing a photo of her engagement ring. The couple, who have been together for a long time, are now engaged.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 34 tokens"
  },
  {
    "title": "Trump Orders Federal Control of D.C. Police, Deploys National Guard",
    "domain": "business",
    "location": "national",
    "published": "Mon, 11 Aug 2025 16:49:47 -0400",
    "source": "ABC News",
    "sources": [
      "Forbes",
      "ABC News"
    ],
    "domains": [
      "general",
      "business"
    ],
    "snippets": [
      "President Donald Trump announced that he is placing the D.C. Metropolitan Police Department under federal control and deploying the National Guard \"to help re-establish law, order and public safety.”",
      "Trump can only legally take control of Washington D.C.’s police force for 30 days without congressional approval."
    ],
    "image_url": "https://s.abcnews.com/images/GMA/250811_abc_social_trump_takes_control_of_dc_police_hpMain_4x3_384.jpg",
    "titles": [
      "WATCH:  Trump puts DC police department under federal control, deploys National Guard",
      "Can Trump Legally Control D.C.’s Police Department And Deploy National Guard? What To Know"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.933,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.659,
    "summary": "President Donald Trump has declared that the D.C. Metropolitan Police Department will be placed under federal control, with the National Guard also deployed to restore law, order, and public safety. This action is legally permissible for a duration of 30 days without the need for congressional approval.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 48 tokens"
  },
  {
    "title": "Yates Unveils Top 100 Fantasy Football Rankings; Casale Ranks College Teams",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 11 Aug 2025 14:20:28 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Field Yates provides his top 100 for the upcoming fantasy football season.",
      "SportsLine college football expert Thomas Casale has two teams in his top tier for his preseason power rankings"
    ],
    "image_url": "",
    "titles": [
      "PPR rankings: Top 100 for 2025",
      "College football betting power rankings: Proven expert shares top teams ahead of 2025 season"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.886,
      "consensus": 0.632,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.655,
    "summary": "Field Yates has released his top 100 rankings for the upcoming fantasy football season. Meanwhile, SportsLine's Thomas Casale has identified two teams in the top tier of his preseason college football power rankings. The rankings provide insights into potential player performance and team strengths as fans gear up for the upcoming seasons.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 53 tokens"
  },
  {
    "title": "Ty Simpson Named Alabama's Starting QB for 2025 Season",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 11 Aug 2025 23:49:51 +0000",
    "source": "CBS Sports",
    "sources": [
      "Yahoo Sports",
      "CBS Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "The redshirt junior has won the quarterback competition in Tuscaloosa for the first time in his career",
      "Simpson is expected to be named Alabama’s starting quarterback for the 2025 season, multiple sources tell BamaOnLine.",
      "Through the Alabama quarterback competition, one name has remained a constant. Coaches have continually spoken highly of Ty Simpson and now, it is going to be Simpson as QB1, per On3’s Pete Nakos. Head coach Kalen DeBoer has officially made the decision. Simpson beat out Austin Mack and Keelon Russe",
      "The Alabama football team was informed Monday, Aug. 11 that Ty Simpson would be the starting QB vs. FSU."
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/07/31/03d28b67-9ebe-4407-ab1b-653f3d66a868/tysimpson.png",
    "titles": [
      "Alabama expected to name Ty Simpson starting QB: Veteran earns long-awaited chance to run Crimson Tide offense",
      "Alabama expected to name Ty Simpson as its starting quarterback for 2025 season",
      "Alabama names Ty Simpson starting quarterback ahead of 2025 season",
      "Ty Simpson named starting quarterback for Alabama football: Sources"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.994,
      "consensus": 0.632,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.652,
    "summary": "Ty Simpson has been officially named Alabama's starting quarterback for the 2025 season, winning the position for the first time in his career. After a competitive process, Head Coach Kalen DeBoer announced the decision, choosing Simpson over Austin Mack and Keelon Russe. The Alabama football team was informed of Simpson's new role on Monday, Aug. 11, ahead of their game against FSU.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 64 tokens"
  },
  {
    "title": "Detroit Lions' Norris Back, Enters Concussion Protocol After Injury",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 11 Aug 2025 23:36:07 +0000",
    "source": "CBS Sports",
    "sources": [
      "Sportsnet",
      "CBS Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "The team plans to ease Norris back into football activities",
      "<p>Detroit Lions safety Morice Norris, who was taken off the field in an ambulance late in a pre-season game last week, is in concussion protocol and doing well, coach Dan Campbell said Monday.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/08/10/5fa947d2-998e-48bf-a595-d3c5ab4a8ede/norris.jpg",
    "titles": [
      "Morice Norris injury: Lions safety in concussion protocol but 'doing well' after scary hit vs. Falcons",
      "Lions’ Norris, who left game in ambulance, in concussion protocol"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.989,
      "consensus": 0.632,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.651,
    "summary": "Detroit Lions safety Morice Norris, who suffered a serious injury during a preseason game and was taken off the field in an ambulance, is now back with the team and has entered concussion protocol. According to Coach Dan Campbell, Norris is \"doing well\" following the incident.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 46 tokens"
  },
  {
    "title": "Dolphins' Mattison Out for Season, Team Signs Replacement RB",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 11 Aug 2025 22:48:43 +0000",
    "source": "CBS Sports",
    "sources": [
      "Sports Illustrated",
      "CBS Sports"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "Miami's running back suffered a season-ending injury in the first preseason game",
      "<a href=\"https://news.google.com/rss/articles/CBMijgFBVV95cUxPcHJ0X0NsenlmUlFid3lab3pDbU5LT2FST3pDSHNlVFBJUHFqYTJSQ1FwOEdJbzFMVFk3NFRMeXJHSTQwN0JaTklQYmRXNlVibnM1b3Q0cmJoeVcwU2xRYVlKazhxaDFpSnhxZFJVNjZEMWlMUkZDSC1ZR1ZfWVdmZ0FlRGVZVE9DelBtOEpR?oc=5\" target=\"_blank\">Dolphins Lose RB Alexander Mattison",
      "<a href=\"https://news.google.com/rss/articles/CBMieEFVX3lxTFA3YzVzOVRkcXNfejZLNU0tMm9PMmtsdWtuM3FhaTRTVFdSZGxCcWNObTh2TG9NdUdpVVZGaThpeGZjSFd0UGtPZHd3SXNQQ3dXQ0NJaURhRDBNbG1vTmJ4elNUeXZkaUV0Smg4c1ZMVVRqOTNDV2pEQg?oc=5\" target=\"_blank\">Dolphins Find New Running Back After Losing Alexander Mattison fo"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/08/11/b0b21f66-49fe-4b5e-8436-80ba5ebb978c/mattison.jpg",
    "titles": [
      "Dolphins RB Alexander Mattison placed on season-ending injured reserve after neck surgery",
      "Dolphins Lose RB Alexander Mattison for 2025 After He Suffered Preseason Neck Injury - Sports Illustrated",
      "Dolphins Find New Running Back After Losing Alexander Mattison for 2025 Season - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.973,
      "consensus": 0.632,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.648,
    "summary": "Miami Dolphins' running back Alexander Mattison suffered a season-ending injury during the team's first preseason game. As a result, the Dolphins have found a new running back to replace him. The team is making adjustments to cope with the loss as they prepare for the upcoming season.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 49 tokens"
  },
  {
    "title": "Trump Meets Intel CEO to Discuss Chip Manufacturing Woes",
    "domain": "business",
    "location": "national",
    "published": "Mon, 11 Aug 2025 22:11:59 GMT",
    "source": "CNBC",
    "sources": [
      "Financial Times",
      "CNBC"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "President Trump said Monday that he met with Intel CEO Lip-Bu Tan, days after calling on the chipmaker to resign.",
      "Lip-Bu Tan to offer ‘suggestions’ on how government can work with group as it struggles with chip manufacturing"
    ],
    "image_url": "",
    "titles": [
      "Trump flip-flops on Intel CEO, calls him 'success' days after demanding resignation",
      "Trump softens stance on Intel boss after demanding resignation"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.941,
      "consensus": 0.632,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.648,
    "summary": "President Trump met with Intel CEO Lip-Bu Tan to discuss the company's struggles in chip manufacturing. During the meeting, Tan offered suggestions on how the government could assist the industry. This comes shortly after Trump publicly called for Tan's resignation.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 43 tokens"
  },
  {
    "title": "NFL Rookies, Free Agents Shine in Preseason Debut",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 11 Aug 2025 11:30:28 EST",
    "source": "ESPN",
    "sources": [
      "Sports Illustrated",
      "ESPN"
    ],
    "domains": [
      "sports"
    ],
    "snippets": [
      "How did rookies and top free agent acquisitions fare in the NFL's first full preseason week?",
      "<a href=\"https://news.google.com/rss/articles/CBMimwFBVV95cUxQdWNMelNPY3k5dUJudjNtd2NvemQyVFI0ZXBzMkhWTnprMWs4THdfVWtRQ182eXMxLTV0UDZIMEdLWDZfZnpmS0dvZmluWF8wTzlKbUZDZFVXWndqaXZLRFNOSG5RdG9URmM0Vk9tWkZ3OUNzM1dMd0k1Q0NMWmxDdzFvVWEzbVRiUlB0U29mbjNSeHVZUG1ia2c4NA?oc=5\" target=\"_blank\">How Tyler Shough’"
    ],
    "image_url": "",
    "titles": [
      "NFL preseason Week 1 takeaways: Tyler Shough's debut a mixed bag for Saints",
      "How Tyler Shough’s Performance in Preseason Debut Impacts Saints QB Battle - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.835,
      "consensus": 0.632,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.645,
    "summary": "In the NFL's first full preseason week, rookies and top free agent acquisitions showcased their talents, with varying degrees of success. Specific performances, such as that of Tyler Shough, were highlighted, indicating a focus on individual achievements and potential impacts on their teams. The overall assessment of these players' performances provides insights into their readiness for the regular season and their potential contribution to their teams' successes.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 68 tokens"
  },
  {
    "title": "Asian Stocks Poised for Quiet Start Amid Wall Street Caution",
    "domain": "business",
    "location": "global",
    "published": "Mon, 11 Aug 2025 22:17:05 GMT",
    "source": "Bloomberg",
    "sources": [
      "Bloomberg",
      "Financial Post"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMilAFBVV95cUxQVnRRSlFTS0l2Snp4bVFfbXlRa0ttMDl2U1B3SnlueXlsbTE1SV9odTBHTHl6ZjE4MG0yajBORlQtMHBLT290Y29wSzFBQ1dDSE02d3Y0YmxxcXlKYlhiR1ZVcjJ6UXlMSC1VUE9WRWNyS2JHa2tYUjVhbGh2c1hhbzk0MG1xeHJmOVlkemRBczIxN29C?oc=5\" target=\"_blank\">Asian Stocks Look Subdued A",
      "Asian stocks were poised for a subdued open, weighed down by a risk-off mood on Wall Street ahead of a key inflation report likely to shape the Federal Reserve’s path on interest rates."
    ],
    "image_url": "",
    "titles": [
      "Asian Stocks Look Subdued Ahead of US Inflation: Markets Wrap - Bloomberg.com",
      "Asian Stocks Look Subdued Ahead of US Inflation: Markets Wrap"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.942,
      "consensus": 0.632,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.641,
    "summary": "Asian stocks are expected to have a quiet start due to a cautious sentiment on Wall Street before a crucial inflation report that could influence the Federal Reserve's interest rate decisions. The outcome of the report will likely impact market movements.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 42 tokens"
  },
  {
    "title": "Revel shutters rideshare business, pivots to EV charging",
    "domain": "technology",
    "location": "global",
    "published": "2025-08-11T15:04:26-04:00",
    "source": "The Verge",
    "sources": [
      "TechCrunch",
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Revel is shutting down its ridehail business, citing heightened competition from rideshare leaders like Uber and Lyft. The company, which began as an electric moped business before shifting to rideshare, plans to pivot to electric vehicle charging. “At the end of the day, rideshare is a very competi",
      "Revel has abandoned its small Uber and Lyft competitor four years after it started, and is looking to sell or return its bright-blue Tesla and Kia EVs."
    ],
    "image_url": "",
    "titles": [
      "Revel shutters rideshare business, pivots to EV charging",
      "Revel shuts down its ride-hail business to focus on EV charging"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.9,
      "consensus": 0.632,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.633,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 8 tokens"
  },
  {
    "title": "ESPN and Fox Launch Bundled Streaming in October, Offering $10 Monthly Savings",
    "domain": "business",
    "location": "national",
    "published": "Mon, 11 Aug 2025 18:36:28 GMT",
    "source": "CNBC",
    "sources": [
      "Fortune",
      "CNBC"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "ESPN and Fox will offer their upcoming direct-to-consumer streaming services as a bundle beginning in October.",
      "You can save $10 a month by signing up for this bundle, instead of ESPN’s and Fox’s separate stand-alone services, debuting in August."
    ],
    "image_url": "",
    "titles": [
      "ESPN, Fox to bundle upcoming streaming services for $39.99 a month",
      "Disney adds to sports streaming war chest with ESPN/Fox bundle priced at $39.99 per month"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.873,
      "consensus": 0.632,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.628,
    "summary": "Starting in October, ESPN and Fox will provide a bundled direct-to-consumer streaming service. This bundle will allow subscribers to save $10 monthly compared to signing up for the separate stand-alone services, which are set to launch in August.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 41 tokens"
  },
  {
    "title": "NASA's Lunar Trailblazer Mission Lost After Launch",
    "domain": "science",
    "location": "global",
    "published": "Mon, 11 Aug 2025 10:57:49 EDT",
    "source": "ScienceDaily",
    "sources": [
      "ScienceDaily",
      "SciTechDaily"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "NASA’s Lunar Trailblazer, a mission designed to create high-resolution maps of water on the Moon, ended after losing contact with the spacecraft just one day after its February 26 launch. Despite extensive global efforts to reestablish communication, the small satellite’s misaligned solar arrays pre",
      "<a href=\"https://scitechdaily.com/nasas-lunar-trailblazer-moon-mission-lost-just-a-day-after-launch/\" rel=\"nofollow\" title=\"NASA’s Lunar Trailblazer Moon Mission Lost Just a Day After Launch\"><img alt=\"NASA Lunar Trailblazer in Orbit\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"437\" src=\"ht"
    ],
    "image_url": "",
    "titles": [
      "How NASA’s Lunar Trailblazer was lost before reaching the Moon",
      "NASA’s Lunar Trailblazer Moon Mission Lost Just a Day After Launch"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.826,
      "consensus": 0.632,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.625,
    "summary": "NASA's Lunar Trailblazer mission, aimed at mapping water on the Moon, was declared lost a day after its launch. Despite initial success, contact with the spacecraft was unexpectedly lost, and recovery efforts have since failed, marking an early end to the mission.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 43 tokens"
  },
  {
    "title": "Reddit will block the Internet Archive",
    "domain": "technology",
    "location": "global",
    "published": "2025-08-11T13:00:00-04:00",
    "source": "The Verge",
    "sources": [
      "Ars Technica",
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Reddit says that it has caught AI companies scraping its data from the Internet Archive’s Wayback Machine, so it’s going to start blocking the Internet Archive from indexing the vast majority of Reddit. The Wayback Machine will no longer be able to crawl post detail pages, comments, or profiles; ins",
      "The Internet Archive confirmed it's in ongoing discussions with Reddit after block."
    ],
    "image_url": "",
    "titles": [
      "Reddit will block the Internet Archive",
      "Reddit blocks Internet Archive to end sneaky AI scraping"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.862,
      "consensus": 0.632,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.625,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 6 tokens"
  },
  {
    "title": "Bone Fragments Solve 1959 Mystery of Meteorologist's Disappearance",
    "domain": "science",
    "location": "global",
    "published": "Mon, 11 Aug 2025 09:05:51 GMT",
    "source": "BBC",
    "sources": [
      "New Scientist",
      "BBC"
    ],
    "domains": [
      "science",
      "general"
    ],
    "snippets": [
      "His brother tells BBC News that he had lost hope he would ever be found.",
      "Bone fragments found on King George Island have been identified as Dennis \"Tink\" Bell, a British meteorologist who fell into a crevasse in 1959"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/2179/live/854f9a60-763b-11f0-a975-cb151ca452f4.jpg",
    "titles": [
      "British man who perished in Antarctic glacier found 65 years later",
      "Lost researcher's remains found on Antarctic glacier after 66 years"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.716,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.609,
    "summary": "In 1959, British meteorologist Dennis \"Tink\" Bell fell into a crevasse on King George Island. For decades, his fate remained unknown. Recently, bone fragments discovered on the island have been conclusively identified as Bell's, according to his brother's statement to BBC News. This discovery finally resolves the long-standing mystery of Bell's disappearance, providing closure to his family.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 61 tokens"
  },
  {
    "title": "Dream Unlimited, CentreCourt Issue Forward-Looking Statement on Toronto Ops",
    "domain": "business",
    "location": "national",
    "published": "Mon, 11 Aug 2025 22:32:50 +0000",
    "source": "Financial Post",
    "sources": [
      "Financial Post"
    ],
    "domains": [
      "business"
    ],
    "snippets": [
      "This press release contains forward-looking information that is based upon assumptions and is subject to risks and uncertainties as indicated in the cautionary note contained within this press release. TORONTO &#8212; DREAM UNLIMITED CORP. (TSX: DRM) (“Dream”) and CentreCourt Developments (“CentreCo"
    ],
    "image_url": "",
    "titles": [
      "Dream Unlimited Corp. and CentreCourt Partner on Major Purpose-Built Rental Development in Downtown Toronto"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.967,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.532,
    "summary": "Dream Unlimited Corp. and CentreCourt Developments have issued a press release containing forward-looking information based on assumptions, which is subject to risks and uncertainties as noted in their cautionary statement. The announcement pertains to their operations in Toronto.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 39 tokens"
  },
  {
    "title": "Seoul-based Datumo raises $15.5M to take on Scale AI, backed by Salesforce",
    "domain": "technology",
    "location": "global",
    "published": "Mon, 11 Aug 2025 23:00:00 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Datumo began as an AI data labeling company and now wants to help businesses build safer AI with tools and data that enable testing, monitoring, and improving their models — without requiring technical expertise."
    ],
    "image_url": "",
    "titles": [
      "Seoul-based Datumo raises $15.5M to take on Scale AI, backed by Salesforce"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.977,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.491,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 14 tokens"
  },
  {
    "title": "Ancient Coins Reveal Long-Distance Trade in Southeast Asia",
    "domain": "science",
    "location": "global",
    "published": "Mon, 11 Aug 2025 19:00:01 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Archaeologists have analyzed more than 200 coins from the first millennium AD mainland Southeast Asia, revealing long-distance economic connections across the region which facilitated extensive trade and cultural interaction."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/ancient-rising-sun-coi.jpg",
    "titles": [
      "Ancient 'Rising Sun' coins show connections from Bangladesh to Vietnam"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.977,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.484,
    "summary": "Archaeologists studying over 200 coins from the first millennium AD in mainland Southeast Asia have discovered evidence of long-distance economic connections. This finding indicates that extensive trade and cultural interactions were facilitated across the region during this period.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 39 tokens"
  },
  {
    "title": "Canadian Firm Experiments with Mining Waste for CO2 Capture",
    "domain": "science",
    "location": "global",
    "published": "Mon, 11 Aug 2025 22:04:44 +0100",
    "source": "New Scientist",
    "sources": [
      "New Scientist"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "A carbon dioxide removal company in Canada is experimenting with ways to treat mining waste to capture and store more CO2"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/08/11202206/SEI_261841944.jpg",
    "titles": [
      "Microwaving rocks could help mining operations pull CO2 out of the air"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.938,
      "consensus": 0.393,
      "constructiveness": 0.073,
      "proximity": 0.5
    },
    "score": 0.483,
    "summary": "A Canadian carbon dioxide removal company is conducting experiments on treating mining waste to enhance CO2 capture and storage. This initiative aims to reduce atmospheric carbon levels by leveraging the byproducts of mining operations. The current status of this innovative approach is in the experimental phase, focusing on practical applications and effectiveness in carbon sequestration.",
    "constructiveness_score": 0.073,
    "constructiveness_reason": "1 constructive keywords out of 55 tokens"
  },
  {
    "title": "NASA Partners with Firms to Boost Spacecraft Orbit Technology",
    "domain": "science",
    "location": "global",
    "published": "Mon, 11 Aug 2025 19:55:09 +0000",
    "source": "NASA",
    "sources": [
      "NASA"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "To drive the development of key space-based capabilities for the United States, NASA is exploring an opportunity to demonstrate technology to raise a spacecraft&#8217;s orbit to a higher altitude. Two American companies – Cambrian Works of Reston, Virginia, and Katalyst Space Technologies of Flagsta"
    ],
    "image_url": "",
    "titles": [
      "NASA Explores Industry Possibilities to Raise Swift Mission’s Orbit"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.916,
      "consensus": 0.393,
      "constructiveness": 0.098,
      "proximity": 0.5
    },
    "score": 0.481,
    "summary": "NASA is advancing U.S. space capabilities by testing technology to elevate spacecraft orbits, partnering with Cambrian Works from Reston, Virginia, and Katalyst Space Technologies from Flagstaff. This initiative aims to enhance the operational range and efficiency of future space missions.",
    "constructiveness_score": 0.098,
    "constructiveness_reason": "1 constructive keywords out of 41 tokens"
  },
  {
    "title": "That viral video of a ‘deactivated’ Tesla Cybertruck is a fake",
    "domain": "technology",
    "location": "global",
    "published": "2025-08-11T18:03:39-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Did Tesla remotely deactivate a Cybertruck in the middle of a highway because the owner featured it in an unauthorized music video? The story already seemed highly unlikely, and on Monday afternoon, Tesla tweeted about the video, saying, “This is fake – that’s not our screen. Tesla does NOT disable "
    ],
    "image_url": "",
    "titles": [
      "That viral video of a ‘deactivated’ Tesla Cybertruck is a fake"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.958,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.48,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 11 tokens"
  },
  {
    "title": "Boar’s Head to reopen plant as mold and funky meat problems pop up elsewhere",
    "domain": "technology",
    "location": "global",
    "published": "Mon, 11 Aug 2025 22:02:15 +0000",
    "source": "Ars Technica",
    "sources": [
      "Ars Technica"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Inspection reports of other Boar's Head plants do not bode well."
    ],
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2024/08/GettyImages-2164656717-1152x648.jpg",
    "titles": [
      "Boar’s Head to reopen plant as mold and funky meat problems pop up elsewhere"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.957,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.48,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 15 tokens"
  },
  {
    "title": "AOL announces September shutdown for dial-up Internet after 34 years",
    "domain": "technology",
    "location": "global",
    "published": "Mon, 11 Aug 2025 20:17:38 +0000",
    "source": "Ars Technica",
    "sources": [
      "Ars Technica"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "Around 175,000 households still use dial-up Internet in the US."
    ],
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2024/11/aol_login_hero-1152x648.jpg",
    "titles": [
      "AOL announces September shutdown for dial-up Internet after 34 years"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.923,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.48,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 11 tokens"
  },
  {
    "title": "Morning Routine Unfolds at Charles de Gaulle Airport Terminal 2E",
    "domain": "science",
    "location": "global",
    "published": "Mon, 11 Aug 2025 16:02:41 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "It is 7.30am at Terminal 2E at Charles de Gaulle airport near Paris, and in the line leading to the security gates, an executive is removing his belt with a mechanical gesture, a mother is taking baby bottles out of her bag, and a tourist is sighing as he unties his shoes. Everyone is moving forward"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2024/tying-shoes.jpg",
    "titles": [
      "Why do we agree to take off our shoes at the airport?"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.918,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.479,
    "summary": "At 7:30 am at Charles de Gaulle airport's Terminal 2E, passengers, including an executive, a mother, and a tourist, are preparing for security checks by removing belts, taking baby bottles out of bags, and untying shoes, respectively. The scene depicts a typical morning at the airport as travelers comply with security protocols.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 54 tokens"
  },
  {
    "title": "Slow Ventures cuts first check from $60M creator fund into woodworking founder",
    "domain": "technology",
    "location": "global",
    "published": "Mon, 11 Aug 2025 22:00:00 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "technology"
    ],
    "snippets": [
      "This marks the first investment for Slow’s $60 million Creator Fund since its launch in February. The fund looks to help creators launch businesses, under the belief that what made them successful influencers is what can also make them a good founder."
    ],
    "image_url": "",
    "titles": [
      "Slow Ventures cuts first check from $60M creator fund into woodworking founder"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.956,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.479,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 12 tokens"
  },
  {
    "title": "Study Shows Long-Term Impact of Offensive Ads on Discriminated Groups",
    "domain": "science",
    "location": "global",
    "published": "Mon, 11 Aug 2025 15:37:04 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Time plays a key role in consumer behavior, especially concerning the purchasing patterns of vulnerable groups in society who have been ridiculed in offensive and discriminatory ads. Ben-Gurion University researcher Dr. Enav Friedmann examined the long-term reactions of consumers from discriminated "
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2022/advertising-2.jpg",
    "titles": [
      "Discriminatory ads can paradoxically increase brand preference among targeted groups"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.91,
      "consensus": 0.393,
      "constructiveness": 0.066,
      "proximity": 0.5
    },
    "score": 0.477,
    "summary": "Dr. Enav Friedmann from Ben-Gurion University conducted a study on the long-term consumer reactions of discriminated groups to offensive ads. The research highlights the significant impact of time on purchasing patterns among these vulnerable groups, revealing that such ads can deeply affect consumer behavior. This study underscores the importance of understanding the consequences of discriminatory advertising on affected communities.",
    "constructiveness_score": 0.066,
    "constructiveness_reason": "1 constructive keywords out of 61 tokens"
  },
  {
    "title": "Water Deemed Essential for Life Beyond Earth in Habitability Studies",
    "domain": "science",
    "location": "global",
    "published": "Mon, 11 Aug 2025 15:43:04 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "science"
    ],
    "snippets": [
      "Water is essential for life on Earth. So, the liquid must be a requirement for life in other worlds. For decades, scientists' definition of habitability on other planets has rested on this assumption."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/planets-without-water.jpg",
    "titles": [
      "Planets without water could still produce certain liquids, a new study finds"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.912,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.471,
    "summary": "Scientists have long believed that water is crucial for life on Earth and likely a requirement for life on other planets. This assumption has guided the definition of habitability on other worlds for many years.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 35 tokens"
  }
]