[
  {
    "title": "Bengals Trade for QB Joe Flacco from Browns to Boost Offense",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 7 Oct 2025 19:13:01 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports",
      "Sports Illustrated",
      "Sportsnet"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com",
      "news.google.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "The Bengals turned to their division rivals for a much-needed solution at quarterback, acquiring Joe Flacco in a trade with the Browns.",
      "Watson is recovering from a second Achilles rupture he suffered in January",
      "<a href=\"https://news.google.com/rss/articles/CBMihAFBVV95cUxQWE9GRl93d3E1ZjFtVnUwQ1JDS2t3cnBOSk5MX2V5Z0cxUGlXYThHcnBVYktzT2phRzJLTml1THlldXdrc2c0UFktcWhEeldleEFLWG13RWtoU1FlY0RFOFdvNUthX19QdFNQVFFFZ1VGeDdpX2lyRDR1S2JFUUJWUXA2YlQ?oc=5\" target=\"_blank\">Browns to Trade Joe Flacco to Quarterback-Needy ",
      "<p>The Cincinnati Bengals are adding a veteran option at quarterback.</p>"
    ],
    "image_url": "",
    "titles": [
      "QB-needy Bengals land Flacco in Browns trade",
      "Joe Flacco traded to Bengals: Does Deshaun Watson factor into Browns' future plans at QB?",
      "Browns to Trade Joe Flacco to Quarterback-Needy Bengals - Sports Illustrated",
      "Bengals acquire QB Joe Flacco in trade with Browns"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.979,
      "consensus": 0.908,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.82,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Cincinnati Bengals have traded with the Cleveland Browns to acquire veteran quarterback Joe Flacco, aiming to improve their struggling offense. This move is expected to impact the team's rookie quarterback and brings a seasoned player into the Bengals' lineup.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: improve",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "OMB: 2019 Back Pay Law Doesn't Cover Furloughed Workers Amid Shutdown",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Tue, 07 Oct 2025 13:16:25 -0400",
    "source": "NPR",
    "sources": [
      "The Guardian",
      "CNBC",
      "Axios",
      "NPR"
    ],
    "domains": [
      "www.cnbc.com",
      "news.google.com",
      "www.npr.org",
      "www.theguardian.com"
    ],
    "snippets": [
      "A new draft White House memo suggests a 2019 law signed by President Trump that guarantees that federal employees get paid after a shutdown ends would not apply to furloughed workers.",
      "<a href=\"https://news.google.com/rss/articles/CBMiiAFBVV95cUxPUS1lYl9GYkRZTWZLaTRhZ0dCMjg1SGJXUUpzdVpoUzdCTjB6VFpuUmpEX2lLMF82N0xtdURXZFY1aUtnZmZQN2FhWUc4ZjY1UWRsNldxaDJ3ZW9VZHJyU2xOeHFVUHliZXJ3OE1zY00tOVRjY1J5cnp6aWRObXhXakY3RFhwQktj?oc=5\" target=\"_blank\">Congress erupts over \"lawless\" Trump threat",
      "<a href=\"https://news.google.com/rss/articles/CBMihAFBVV95cUxQeTdNcElLQ2hOX1pDXzdzZktyX2t2M2lheUM5YlMxZ0sxODRybHJWMXpaeW1OU3EzbWp4ZFRhYjcwV0lYY1lsTkhDdEtpeGx3Z2FTM3RJMUpPRUJ0MTZsYVlJMUtxU2pucWlLbXBtY1NPRWNDODZjNDlkdXZjd1hxUWRYRjQ?oc=5\" target=\"_blank\">Scoop: White House memo says furloughed federal ",
      "<p>OMB argues an amendment to a 2019 act would not guarantee furloughed workers post-shutdown pay</p><p>The White House’s office of management and budget (OMB) is arguing that federal workers who are furloughed amid the ongoing government shutdown are not entitled to back pay.</p><p>In a draft memo ",
      "As the federal shutdown stretches on, furloughed federal workers face the threat of not receiving back pay, despite a 2019 law that requires it."
    ],
    "image_url": "",
    "titles": [
      "White House floats no back pay for some furloughed federal workers despite 2019 law",
      "Congress erupts over \"lawless\" Trump threat not to pay back furloughed federal workers - Axios",
      "Scoop: White House memo says furloughed federal workers aren't entitled to backpay - Axios",
      "White House says furloughed federal workers not entitled to back pay amid shutdown",
      "Furloughed federal workers face threat of no back pay from shutdown, despite 2019 law requiring it"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.865,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.794,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The White House's Office of Management and Budget (OMB) contends that a 2019 law ensuring federal employees receive back pay after a shutdown does not apply to furloughed workers. This interpretation has sparked controversy amid the ongoing government shutdown, leaving furloughed federal employees at risk of not getting back pay as previously guaranteed by the 2019 legislation.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "2025 Nobel Prize in Physics Awarded for Quantum Tech Advances",
    "domain": "science",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Tue, 07 Oct 2025 06:17:37 -0400",
    "source": "NPR",
    "sources": [
      "New Scientist",
      "Deutsche Welle",
      "Ars Technica",
      "NPR"
    ],
    "domains": [
      "www.newscientist.com",
      "www.dw.com",
      "arstechnica.com",
      "www.npr.org"
    ],
    "snippets": [
      "The Nobel committee said that the laureates' work provides opportunities to develop \"the next generation of quantum technology, including quantum cryptography, quantum computers, and quantum sensors.\"",
      "John Clarke, Michel Devoret and John Martinis have won the 2025 physics Nobel Prize for their work in quantum mechanics. It is the second Nobel Prize to be awarded this year.",
      "The 2025 Nobel prize in physics has gone to John Clarke, Michel Devoret and John Martinis, whose work has led to the development of today's quantum computers",
      "John Clarke, Michel H. Devoret, and John Martinis built an electrical circuit-based oscillator on a microchip."
    ],
    "image_url": "",
    "titles": [
      "The Nobel Prize for physics is awarded for discoveries in quantum mechanical tunneling",
      "Nobel Prize in physics goes to US-based trio for discoveries in quantum mechanics",
      "Nobel prize for physics goes to trio behind quantum computing chips",
      "2025 Nobel Prize in Physics awarded for macroscale quantum tunneling"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.748,
      "consensus": 0.908,
      "constructiveness": 0.2,
      "proximity": 0.75
    },
    "score": 0.784,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "John Clarke, Michel Devoret, and John Martinis were awarded the 2025 Nobel Prize in Physics for their pioneering work in quantum mechanics, specifically advancing the development of quantum technology, including quantum computers, cryptography, and sensors. Their research has been crucial in demonstrating how quantum mechanics' properties can have practical applications in technology. The Royal Swedish Academy of Sciences in Stockholm announced the award, highlighting the trio's contributions as foundational to digital technology's future.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: development, research",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "McGregor Ineligible for UFC Till March 2026 After Missing Drug Tests",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 07 Oct 2025 19:34:45 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "Sportsnet",
      "Yahoo Sports",
      "BBC"
    ],
    "domains": [
      "www.sportingnews.com",
      "www.sportsnet.ca",
      "www.bbc.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Conor McGregor accepts an 18-month ban for violating the UFC's anti-doping policy, the organisation says.",
      "Irish superstar Conor McGregor has been handed an 18-month suspension for violating the UFC’s anti-doping policy.",
      "<ul><li><p>Former champion missed three tests last year</p></li><li><p>Irishman could return for 2026 bout at White House</p></li></ul><p>Conor McGregor has been handed an 18-month suspension for violating the UFC’s anti-doping policy after missing three attempted tests last year, Combat Sports Anti",
      "<p>Conor McGregor will be ineligible to compete in any UFC event until March 2026.</p>"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/f691/live/485c2570-a3b2-11f0-9871-a159926144cf.jpg",
    "titles": [
      "Conor McGregor given 18-month ban for missing drug tests",
      "Conor McGregor cops 18-month ban for violating UFC’s anti-doping policy",
      "Conor McGregor given 18-month ban for breaking UFC’s anti-doping rules",
      "McGregor accepts 18-month UFC sanction for anti-doping violation"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.889,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.767,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Conor McGregor, after missing three drug tests in 2024 on June 13, September 19, and September 20, will be ineligible to compete in UFC events until March 2026, despite his suspension ending before the UFC White House card next summer.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Ravens Trade Oweh to Chargers for Gilman, Draft Picks",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 7 Oct 2025 19:13:01 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports",
      "Sports Illustrated"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com",
      "news.google.com"
    ],
    "snippets": [
      "The Ravens traded slumping pass rusher Odafe Oweh and a 2027 seventh-round pick to the Chargers on Tuesday in exchange for safety Alohi Gilman and a fifth-round pick in 2026, sources told ESPN's Adam Schefter.",
      "The Harbaugh brothers pull off a trade",
      "<a href=\"https://news.google.com/rss/articles/CBMif0FVX3lxTE1WbGtRMVZiR0xIYWxuaFN1Q3BJLVdONWl3b1dPS2dhTm1vbTJENEZCcUtZQjVGZnhSTkFqTXFnNDZpRE9rbEtPWW9YSWlkY2J1WEFnYnVjU2pFc1I5ZEtBU3VIalFUbGFwdWt1MzVIaWc4ZjZvM1NkZjBoQVR6YWM?oc=5\" target=\"_blank\">Sliding Ravens Trade Linebacker Odafe Oweh to Chargers</",
      "<a href=\"https://news.google.com/rss/articles/CBMiggFBVV95cUxPcjIxRUZfLUJtcFNPWE51YjdmSTBrVHJBR1N4TTltY2RFcGczTjkwM3ZQUmJVWm9JZ2pZWC02cTgzQnVhWHUyakVxaFdVN2NrMjhMS0UtWWg1UVN3VC1DWlVWSFMtUTFxWDlpQVBxbWpNUUFiY1dpZUxQV19MSmFPRkFB?oc=5\" target=\"_blank\">Chargers trade for Ravens pass-rusher Odafe Oweh</a"
    ],
    "image_url": "",
    "titles": [
      "Ravens shake up D, trade Oweh for Bolts' Gilman",
      "Ravens trade EDGE Odafe Oweh to Chargers for safety Alohi Gilman, late-round pick swap",
      "Sliding Ravens Trade Linebacker Odafe Oweh to Chargers - Sports Illustrated",
      "Chargers trade for Ravens pass-rusher Odafe Oweh - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.979,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.758,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Baltimore Ravens have traded pass rusher Odafe Oweh and a 2027 seventh-round draft pick to the Los Angeles Chargers. In return, the Ravens received safety Alohi Gilman and a 2026 fifth-round pick. This trade was reported by ESPN's Adam Schefter.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Jerry Jones Considers Appealing Fine for Accidental Obscene Gesture",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 7 Oct 2025 19:13:01 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Forbes",
      "CBS Sports"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com",
      "www.forbes.com"
    ],
    "snippets": [
      "Cowboys owner Jerry Jones has been fined $250,000 by the NFL for his \"inadvertent\" obscene gesture toward fans at MetLife Stadium on Sunday.",
      "The Cowboys' owner may appeal the fine",
      "Social media videos of Jones at the Cowboys-Jets matchup on Sunday appeared to show the owner flashing his middle finger at fans before pointing at them."
    ],
    "image_url": "",
    "titles": [
      "Cowboys' Jones fined $250K by NFL for gesture",
      "Jerry Jones fined $250,000 for 'unfortunate gesture' to Jets fans during Cowboys' Week 5 win",
      "Cowboys Owner Jerry Jones Fined $250,000 For Flashing Middle Finger"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.979,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.758,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Dallas Cowboys owner Jerry Jones stated his obscene gesture towards fans at MetLife Stadium was accidental, intending a \"thumbs up\" during a 37-22 win over the New York Jets. Jones may appeal the fine imposed for the incident.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Blue Jays Seek ALCS Spot With Sweep Against Yankees in ALDS Game 3",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Tue, 07 Oct 2025 20:07:41 +0000",
    "source": "CBS Sports",
    "sources": [
      "CityNews",
      "CBS Sports",
      "Sportsnet"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "www.cbssports.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Find best bets and props for the biggest games in sports on Tuesday from the SportsLine Inside the Line team's model and top CBS Sports experts",
      "<p>The Toronto Blue Jays look to sweep the New York Yankees when they visit the Bronx for Game 3 of the ALDS on Tuesday. Live coverage on Sportsnet and Sportsnet+ begins at 8 p.m. ET / 5 p.m. PT, or follow along with our live tracker.</p>",
      "<p>Toronto Blue Jays pitcher Shane Bieber sits down with Caleb Joseph ahead of his Game 3 start against the New York Yankees to discuss the magnitude of the situation and his experience pitching in the postseason.</p>",
      "The Toronto Blue Jays are one win away from advancing to their first American League Championship Series (ALCS) since 2016. After two emphatic victories at Rogers Centre, the Jays carry a commanding 2-0 series lead into Yankee Stadium tonight, where Shane Bieber will take the mound against New York&"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/10/01/c22beea8-c9c5-4fca-93d7-d2ed1641dc81/getty-carlos-rodon-yankees.jpg",
    "titles": [
      "Today's top games to watch, best bets, odds: Blue Jays vs. Yankees in Game 3 of ALDS, CFB and more",
      "ALDS on Sportsnet: Blue Jays vs. Yankees, Game 3",
      "Bieber looking to pitch Blue Jays into ALCS with Game 3 win over Yankees",
      "Blue Jays eye ALDS sweep: What to know before Game 3 vs. Yankees"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.918,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.727,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Toronto Blue Jays aim to complete a sweep against the New York Yankees in Game 3 of the ALDS at Yankee Stadium. With a 2-0 series lead, a win would advance them to their first ALCS since 2016. Pitcher Shane Bieber is set to start for the Blue Jays. Live coverage is scheduled for 8 p.m. ET on Sportsnet.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Supreme Court Reviews State Power on Conversion Therapy Bans",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Tue, 07 Oct 2025 21:13:28 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Axios",
      "LA Times"
    ],
    "domains": [
      "www.latimes.com",
      "www.aljazeera.com",
      "news.google.com"
    ],
    "snippets": [
      "The high court&#039;s conservative justices express concern the ban might infringe upon therapists&#039; freedom of speech.",
      "<a href=\"https://news.google.com/rss/articles/CBMie0FVX3lxTE9pUDdzNk1lRmdZU1J0bEZxU0thZXo5ZHh6Z0VsMHd0bU5feU9sTEtLN0RXRHRKSlFUTE9kU3lpb28tajRnQVlMZ3haVTJWOHIzZFE3T3NJUFpOaV9tcFY1SW9QTjIyb1pqV2JFZmpaQS1SV0wwZmFCcjJFYw?oc=5\" target=\"_blank\">Supreme Court seems skeptical of conversion therapy ban</a>&n",
      "<a href=\"https://news.google.com/rss/articles/CBMihwFBVV95cUxOeFV5Q0JvZFFfYmdGV1hpd0VWdTBhTXpQU3gwaVZyMWxVQ1A4ejVHc21fbFhnTVR3OFE1ZlVUOTcxakRVWHdqOVBlUnMzMUhBZzRoVzJEa1paWUhsRnRFa1BTMmtPXzZIbEprQ1M1WjdmYUVXZHBtakFWaG5zQTVRVDA1cE9mSHc?oc=5\" target=\"_blank\">Supreme Court weighs case on conversion ther",
      "<p>California and 20 other states that forbid licensed counselors to practice 'conversion therapy' face a free-speech challenge.</p>"
    ],
    "image_url": "",
    "titles": [
      "Conservative-led US Supreme Court seems wary of ‘conversion therapy’ ban",
      "Supreme Court seems skeptical of conversion therapy ban - Axios",
      "Supreme Court weighs case on conversion therapy for youth - Axios",
      "Supreme Court sees a free-speech problem with laws that ban 'conversion therapy' for minors"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.939,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.725,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Supreme Court is reviewing a case that examines if states have the authority to regulate conversations between counselors and clients, specifically focusing on the legality of conversion therapy bans. This case has ignited a conflict between conservative Christian groups and the LGBTQ+ community, with significant implications for both freedom of speech and the rights of LGBTQ+ individuals. The outcome is pending.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Tesla Launches Cheaper Model Y and 3, Prices Start at $36,990",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Tue, 07 Oct 2025 20:12:16 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "TechCrunch",
      "Forbes"
    ],
    "domains": [
      "www.forbes.com",
      "www.aljazeera.com",
      "techcrunch.com"
    ],
    "snippets": [
      "The electric carmaker’s new model comes as part of efforts to address slumping sales.",
      "Elon Musk has said his automaker would sell an affordable Model Y, as “people don’t have enough money in the bank account to buy it” despite high demand.",
      "The long-awaited cheaper Model 3 and Model Y are finally here, but they start at $36,990 and $39,990, respectively -- just a few thousand dollars less than Tesla's current offerings."
    ],
    "image_url": "",
    "titles": [
      "Tesla unveils new lower-cost Model Y amid rising competition",
      "Tesla Unveils Cheaper Model Y And Model 3—Countering Tax Credit Loss",
      "Tesla reveals slightly cheaper ‘standard’ versions of the Model 3 and Model Y"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.919,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.721,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Elon Musk announced Tesla will sell more affordable versions of the Model Y to meet high demand, acknowledging the current price is too high for many consumers. The cheaper trims of the Model Y and Model 3 are now available, starting at $39,990 and $36,990, respectively. These prices, while lower, remain closer to $40,000, slightly missing the mass-market target price of under $30,000 that investors hoped for.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Mayor-Elect of Herdecke Stabbed; Chancellor Condemns Attack",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 07 Oct 2025 18:18:08 GMT",
    "source": "BBC",
    "sources": [
      "Al Jazeera",
      "New York Times",
      "BBC"
    ],
    "domains": [
      "www.nytimes.com",
      "www.aljazeera.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Chancellor Friedrich Merz says \"we fear for the life\" of Iris Stalzer, a newly-elected mayor in the western town of Herdecke.",
      "Chancellor Friedrich Merz condemns &#039;heinous attack&#039; after Iris Stalzer, mayor-elect of Herdecke, stabbed.",
      "Iris Stalzer, the incoming mayor of Herdecke, was found stabbed in her home, officials said. It was initially unclear whether it had been a targeted attack."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/c101/live/7a1022d0-a37e-11f0-928c-71dbb8619e94.jpg",
    "titles": [
      "German mayor critically injured in stabbing attack, police say",
      "German mayor-elect gravely wounded in stabbing attack",
      "Mayor-Elect in Critical Condition After Stabbing in Western Germany"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.865,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.71,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Iris Stalzer, the mayor-elect of Herdecke, was stabbed in her home. Chancellor Friedrich Merz condemned the attack as heinous. The motive behind the stabbing is currently unclear, including whether it was a targeted attack.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "McGregor Ineligible for UFC Till March 2026 After Missing Drug Tests",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 7 Oct 2025 19:13:01 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Conor McGregor received an 18-month suspension from UFC anti-doping program Combat Sports Anti-Doping (CSAD) on Tuesday.",
      "McGregor's suspension ends before the UFC White House card next summer"
    ],
    "image_url": "",
    "titles": [
      "McGregor suspended 18 months for missed tests",
      "Conor McGregor suspended 18 months for UFC anti-doping violation"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.979,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.676,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Conor McGregor, after missing three drug tests in 2024 on June 13, September 19, and September 20, will be ineligible to compete in UFC events until March 2026, despite his suspension ending before the UFC White House card next summer.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "EU Plans to Double UK Steel Tariff, Matching Trump's Rates",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 07 Oct 2025 23:30:18 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "The EU is the destination for 78% of steel products made in the UK for overseas markets.",
      "<p>Starmer says UK in discussions with EU over Brussels plan to double import tariff to 50%, which unions warn could kill UK steel industry</p><p>The EU has announced it will match Donald Trump’s steel tariffs, doubling levies on imports to 50% in a decision condemned as “an existential threat” to t"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/6663/live/eca51250-a38e-11f0-96cf-a52f331e209a.jpg",
    "titles": [
      "EU steel tariff hike threatens 'biggest ever crisis' for UK industry",
      "EU plan to match Trump steel tariffs spurs ‘existential threat’ to UK steel industry"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.964,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.672,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The EU, receiving 78% of the UK's overseas steel exports, plans to double its import tariff to 50%, matching former US President Trump's rates. UK's Labour leader, Starmer, confirms discussions with the EU about this increase, which unions fear could devastate the UK steel industry.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Troops Enter Chicago Amid Legal Battles with City and State",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Tue, 07 Oct 2025 22:56:37 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "The Guardian"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Troops arrive despite active legal challenges from Chicago and the state of Illinois in the courts.",
      "<p>Military presence comes after judge declined to block troops from entering, following lawsuit filed by city and state</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/live/2025/oct/07/donald-trump-national-guard-pam-bondi-mark-carney-government-shutdown-us-politics-live-news-updates\">US"
    ],
    "image_url": "",
    "titles": [
      "US National Guard troops arrive in Illinois as Trump escalates crackdown",
      "Texas national guard troops arrive in Chicago amid Trump’s crackdown"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.973,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.66,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Troops have arrived in Chicago despite ongoing legal challenges from both the city and the state of Illinois. This development follows a judge's decision not to prevent the military's entry, a decision made in the context of a lawsuit brought by Chicago and Illinois.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: development",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Israel-Hamas Negotiations Begin in Egypt Amid Mourning",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Tue, 07 Oct 2025 20:36:31 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "New York Times"
    ],
    "domains": [
      "www.nytimes.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Donald Trump says a Middle East peace deal is “very close,” while pledging US security guarantees for Gaza.",
      "As Israelis brace for a day of mourning and commemoration, negotiators for Israel and Hamas met with mediators in Egypt to hash out an end to the war."
    ],
    "image_url": "",
    "titles": [
      "Trump: US-Israel ‘very close to making a deal’ on Gaza peace plan",
      "Israel and Hamas Meet in Egypt to Discuss Gaza Peace Plan"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.927,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.657,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Negotiators from Israel and Hamas have begun indirect talks in Sharm El-Sheikh, Egypt, aimed at ending the Israel-Gaza war. The talks, urged by Trump to proceed quickly, coincide with a day of mourning in Israel. The negotiations are facilitated by mediators in an effort to reach a resolution.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Macron Under Pressure Amid French Government Collapse and Debt Concerns",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Tue, 07 Oct 2025 22:58:47 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Deutsche Welle"
    ],
    "domains": [
      "www.dw.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "President Emmanuel Macron under pressure as parliamentary paralysis persists.",
      "The collapse of yet another French government over its inability to bring austerity measures through parliament is raising fears that the debt of the EU's second-largest economy is spinning out of control."
    ],
    "image_url": "",
    "titles": [
      "How to fix France’s deepening political crisis?",
      "Could France's political turmoil spark eurozone debt crisis?"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.974,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.657,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "President Emmanuel Macron faces increased pressure due to ongoing parliamentary paralysis, following the collapse of another French government. This failure to pass austerity measures has heightened concerns over the control of the EU's second-largest economy's debt.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Amazon's Prime Big Deal Days Sale Offers Discounts on Top Tech",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-10-07T19:42:40-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge",
      "Ars Technica"
    ],
    "domains": [
      "arstechnica.com",
      "www.theverge.com"
    ],
    "snippets": [
      "Amazon’s October Prime Day sale (aka Prime Big Deal Days) is finally here, and we’ve collected the best deals we could find on everything from noise-canceling headphones and robot vacuums to 4K OLED TVs. The majority of our recommendations have been thoroughly tested by&#160;Verge&#160;writers and e",
      "At long last, Amazon’s October Prime Day event has begun — and as expected, it’s packed with a slew of notable Apple deals. If you don’t want to wait until Black Friday or Cyber Monday to score a discount, the current promo is a great opportunity to save, as Amazon is offering steep discounts on [&#",
      "The day has finally come for a home theater overhaul. Perhaps you’re looking for a low-cost replacement that offers more features and a sharper design. Or maybe your gaze is set upon massive OLED TVs with all the fixings. Regardless, the Prime Big Deal Days sale is here, with deals from noteworthy T",
      "Day one of Prime Big Deal Days is here, and while there are plenty of big-ticket discounts, not everyone is looking to shell out a bunch of cash (myself included). The good news is you don’t have to spend a fortune to score something good during the two-day event, which ends Thursday, October 9th, a",
      "It may be October, but the holidays will be here before you know it. Amazon’s fall Prime Day event is here, offering Prime subscribers a great opportunity to save on holiday decorations before the holiday rush kicks off. Right now, you can pick up the Philips Hue Festavia string lights at one of its",
      "We've got deals on keyboards, laptops, accessories, and all kinds of stuff!"
    ],
    "image_url": "",
    "titles": [
      "The 194 best October Prime Day deals",
      "The 25 best fall Prime Day deals on AirPods, iPads, and other Apple gear",
      "The best October Prime Day deals on TVs, soundbars, and more — up to 50% off",
      "We handpicked 30 October Prime Day deals you can get for under $25",
      "Philips Hue customizable string lights are up to $125 off for October Prime Day",
      "It’s Prime Day 2025 part two, and here are the best deals we could find"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.989,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.653,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Amazon's Prime Big Deal Days sale is currently underway, offering significant discounts on a wide range of products, including noise-canceling headphones, robot vacuums, 4K OLED TVs, laptops, keyboards, and various accessories. Many items on sale have been tested and recommended by Verge writers, ensuring quality picks for consumers looking to upgrade their tech and home theater setups.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Cardinals Fine Coach Gannon $100K for Actions Toward RB Demercado",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Tue, 07 Oct 2025 23:25:48 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sportsnet"
    ],
    "domains": [
      "www.cbssports.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "The coach was irate after Demercado dropped the ball before crossing the goal line",
      "<p>The Cardinals have reportedly fined head coach Jonathan Gannon $100,000 for his actions toward running back Emari Demercado on Sunday, per ESPN&#8217;s Adam Schefter.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/10/07/fac6ecda-edf8-4bc5-8bac-3ee54d570e14/untitled-design-35.png",
    "titles": [
      "Cardinals fining coach Jonathan Gannon $100,000 for sideline incident with Emari Demercado, per report",
      "Report: Cardinals fine HC Jonathan Gannon for sideline altercation with RB"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.983,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.652,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Cardinals fined head coach Jonathan Gannon $100,000 for his actions directed at running back Emari Demercado after Demercado dropped the ball before crossing the goal line, according to ESPN's Adam Schefter.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Bettman Hesitant on NHL Olympic Break, Sees Value in Participation",
    "domain": "sports",
    "source_domain": "sports.yahoo.com",
    "location": "national",
    "published": "Tue, 07 Oct 2025 23:16:47 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Sportsnet",
      "Yahoo Sports"
    ],
    "domains": [
      "www.sportsnet.ca",
      "sports.yahoo.com"
    ],
    "snippets": [
      "NHL Commissioner Gary Bettman isn't the biggest fan of taking a nearly three-week break in the middle of the season so players can participate in the Milan-Cortina Olympics.  Bettman spoke at the season-opening game Tuesday between the Florida Panthers — who raised their second consecutive Stanley C",
      "<p>NHL Commissioner Gary Bettman isn&#8217;t the biggest fan of taking a nearly three-week break in the middle of the season so players can participate in the Milan-Cortina Olympics.</p>\n<p>That said, he obviously sees the value.</p>"
    ],
    "image_url": "",
    "titles": [
      "NHL's Bettman sees value in the Olympic break, especially coming off 4 Nations success last season",
      "Bettman sees value in Olympic break, especially coming off 4 Nations success"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.98,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.651,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "NHL Commissioner Gary Bettman expressed reservations about pausing the season for nearly three weeks for the Milan-Cortina Olympics but acknowledged the value of participation. His comments were made during the season-opening game.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Israel Commemorates 2nd Anniversary of Hamas Attacks Amid Ceasefire Talks",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Tue, 07 Oct 2025 20:11:46 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "The Guardian"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Israelis held vigils to mark two since the Hamas-led October 7 attack on Israel.",
      "The Gaza war has lasted two years – are Israel and the US ready to end it now?",
      "<p>Commemorations held in kibbutzim whose members were killed or kidnapped as Tel Aviv rally to call for hostages’ release</p><p>Israelis gathered across the country on Tuesday to mark the second anniversary of the 7 October attack, in which Hamas-led militants killed about 1,200 people and took 251"
    ],
    "image_url": "",
    "titles": [
      "Israelis mark two years since October 7 with tributes to loved ones",
      "Two years after October 7: Israel’s reckoning",
      "Israelis gather to mark two years since 7 October Hamas attack that killed 1,200"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.919,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.646,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Israelis marked the second anniversary of the Hamas-led attacks on 7 October, which resulted in approximately 1,200 deaths and 251 kidnappings. Commemorations took place across the country, including rallies in Tel Aviv advocating for the release of hostages still held in Gaza. Concurrently, ceasefire negotiations are underway in Egypt as fighting persists.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Badenoch Pledges Deficit Reduction if Conservatives Win Next UK Election",
    "domain": "business",
    "source_domain": "www.ft.com",
    "location": "global",
    "published": "Tue, 07 Oct 2025 23:01:15 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Post",
      "Financial Times"
    ],
    "domains": [
      "financialpost.com",
      "www.ft.com"
    ],
    "snippets": [
      "Leader will pitch Conservatives as the party of spending control with pledge to drive down Britain’s deficit",
      "Kemi Badenoch will vow to cut the UK deficit if the Conservatives win the next general election, as she seeks to recover her party’s claim to sound stewardship of the economy."
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F60d3b051-844b-48b4-812a-982254abbb3d.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Badenoch tries to revive Tory fortunes with plan to boost UK economy",
      "Badenoch Vows to Slash UK Deficit as Tories Focus on Economy"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.955,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.646,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Kemi Badenoch, a Conservative leader, has pledged to reduce the UK's deficit if her party wins the next general election. This move aims to reassert the Conservatives' reputation for economic management.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Hackers Steal Data on 8,000 Children from Kido Nursery, Two Arrested",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 07 Oct 2025 21:11:42 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Hackers were said to have stolen the photographs, names and addresses of about 8,000 children.",
      "<p>Hackers stole names and photos of 8,000 children from Kido nursery chain and posted 10 profiles with threat to publish more</p><p>A man and a boy have been arrested in connection with an alleged cyber-attack on a set of nurseries in Greater London.</p><p>The man, 22, and boy, 17, were arrested on"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/1f3f/live/028105e0-a3ba-11f0-b741-177e3e2c2fc7.jpg",
    "titles": [
      "Two arrested over cyber-attack on nursery chain",
      "Man and teenage boy arrested over cyber-attack on London nurseries"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.919,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.639,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Hackers reportedly stole photos, names, and addresses of 8,000 children from the Kido nursery chain, posting 10 profiles online with threats to release more. A 22-year-old man and a 17-year-old boy have been arrested in Greater London in connection with the cyber-attack.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Tesla Launches More Affordable Model Y and Model 3 Variants",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Tue, 07 Oct 2025 21:07:08 GMT",
    "source": "CNBC",
    "sources": [
      "Business Insider",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "www.businessinsider.com"
    ],
    "snippets": [
      "Tesla's Model Y standard SUV is priced just under $40,000 and Model 3 standard sedan around $37,000.",
      "On Tuesday, the EV giant unveiled the long-awaited budget-friendly version of the Model Y, along with a cheaper Model 3."
    ],
    "image_url": "",
    "titles": [
      "Tesla prices Model Y standard below $40,000, debuting more affordable vehicle",
      "Tesla reveals its long-awaited more affordable models: the $36,990 Model 3 Standard and $39,990 Model Y Standard"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.918,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.639,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Tesla introduced a more affordable version of the Model Y SUV, priced just under $40,000, and a cheaper Model 3 sedan at approximately $37,000. These budget-friendly options were unveiled on Tuesday, expanding Tesla's electric vehicle offerings to a wider market.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Global Trade Surges in H1 2025 Amid Tariff Concerns",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Tue, 07 Oct 2025 16:46:27 GMT",
    "source": "CNBC",
    "sources": [
      "New York Times",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "Global trade volumes rose sharply in the first half of 2025 as businesses front-loaded imports ahead of higher tariffs.",
      "The World Trade Organization said trade growth had proved more resilient in 2025 than expected, but would slow next year as result of President Trump’s tariffs."
    ],
    "image_url": "",
    "titles": [
      "WTO hikes global trade forecast for 2025 — but next year doesn't look so good",
      "Global Trade Growth to Slow Sharply Next Year, W.T.O. Says"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.838,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.63,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "In the first half of 2025, global trade volumes increased significantly as businesses accelerated imports in anticipation of higher tariffs. The World Trade Organization noted that trade growth in 2025 was more resilient than anticipated. However, it is expected to decelerate in the following year due to the implementation of tariffs by President Trump.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Filmmaker Says Late Father Would Disapprove of \"TikTok Slop\" AI Content",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 07 Oct 2025 15:51:39 GMT",
    "source": "BBC",
    "sources": [
      "Forbes",
      "BBC"
    ],
    "domains": [
      "www.forbes.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The filmmaker said it is not what her dad, who died in 2014, would have wanted.",
      "Zelda Williams Williams’ post highlighted one of the ghoulish consequences of generative AI, and its ability to churn out photorealistic video—the emergence of digital necromancy."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/6ba0/live/e26fba40-a38b-11f0-9d41-9dadd041fb76.jpg",
    "titles": [
      "Robin Williams' daughter pleads for people to stop sending AI videos of her dad",
      "Robin Williams’ Daughter Condemns AI-Generated Videos Of Her Father"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.822,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.626,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A filmmaker commented that her father, who passed away in 2014, would not have approved of \"TikTok slop,\" a term referring to low-quality content produced by artificial intelligence and widely shared on social media platforms.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Lenders to Pay £8.2 Billion in Major Compensation Scheme",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 07 Oct 2025 16:46:25 GMT",
    "source": "BBC",
    "sources": [
      "Financial Times",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.ft.com"
    ],
    "snippets": [
      "Lenders could pay out £8.2bn in compensation, which is less than the FCA had previously estimated.",
      "Lower than expected FCA figure is still set to be one of the industry’s biggest compensation schemes"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/c2e9/live/20610b80-a399-11f0-b741-177e3e2c2fc7.jpg",
    "titles": [
      "Millions of drivers could receive £700 payout over car finance mis-selling scandal",
      "Banks to pay out £11bn for UK car finance mis-selling scandal, says regulator"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.838,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.623,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Lenders are expected to pay out £8.2 billion in compensation, a figure lower than the Financial Conduct Authority's (FCA) initial estimate. Despite this reduction, it remains one of the largest compensation schemes in the industry's history.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Intercontinental Invests $2B in Polymarket, Stock Rises 3% in Premarket",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Tue, 07 Oct 2025 14:38:00 GMT",
    "source": "CNBC",
    "sources": [
      "Fortune",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "fortune.com"
    ],
    "snippets": [
      "Intercontinental Exchange rose more than 3% in the premarket after the company announced it took a $2 billion stake in prediction markets platform Polymarket.",
      "The investment follows a previous venture round that reportedly valued the prediction market at more than $1 billion."
    ],
    "image_url": "",
    "titles": [
      "NYSE-owner Intercontinental Exchange rises after it takes $2 billion stake in Polymarket",
      "New York Stock Exchange parent company invests $2 billion in Polymarket at $9 billion valuation"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.802,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.615,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Intercontinental Exchange announced a $2 billion investment in Polymarket, a prediction markets platform founded by Shayne Coplan. Following the announcement, Intercontinental's stock rose over 3% in premarket trading.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]