[
  {
    "title": "Trump Delays TikTok Ban Amid Claims of Election Benefit; White House Joins App",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Wed, 20 Aug 2025 04:41:09 +0000",
    "source": "Al Jazeera",
    "sources": [
      "The Verge",
      "Deutsche Welle",
      "The Guardian",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.theguardian.com",
      "www.dw.com",
      "www.theverge.com"
    ],
    "snippets": [
      "The new account comes as Trump has three times delayed implementing a &#039;sell or ban&#039; law for the Chinese-owned app.",
      "The popular China-based video sharing app has been facing a US ban over security concerns, although President Donald Trump has continued to extend the deadline.",
      "<p>US president was concerned over app’s Chinese ownership, but has softened after believing it won him 2024 election</p><p>The White House launched an official TikTok account on Tuesday, as Donald Trump continues to permit the Chinese-owned platform to operate in the US despite a law requiring its ",
      "While it was President Joe Biden who signed the law that would force  ByteDance to sell its stake in TikTok or face a ban, it’s his successor, Donald Trump, who has yet to fulfill his promise of arranging a deal to keep TikTok running, legally, in the United States. The current deadline for a deal ["
    ],
    "image_url": "",
    "titles": [
      "Trump’s White House takes to TikTok as deadline looms to ban platform",
      "US: White House launches official TikTok account",
      "White House launches official TikTok account after Trump vowed ban in 2020",
      "The White House just joined TikTok"
    ],
    "score_components": {
      "magnitude": 0.932,
      "recency": 0.931,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.789,
    "summary": "Despite security concerns over its Chinese ownership, TikTok continues to operate in the U.S. after President Donald Trump delayed implementing a law signed by his predecessor, Joe Biden, which mandates ByteDance to sell its stake in TikTok or face a ban. Trump, who has postponed the decision three times, has softened his stance towards the app, believing it contributed to his 2024 election success. Meanwhile, the White House has launched an official TikTok account, indicating a further shift in the administration's approach to the platform.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 87 tokens",
    "image": {
      "src": "icons/newspaper.svg",
      "thumbnail": "icons/newspaper.svg",
      "alt": "general",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Salah Wins PFA Player of the Year for Record Third Time; Caldentey Honored",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 19 Aug 2025 21:19:52 GMT",
    "source": "BBC",
    "sources": [
      "Yahoo Sports",
      "The Guardian",
      "Al Jazeera",
      "Sky Sports",
      "BBC"
    ],
    "domains": [
      "www.skysports.com",
      "www.bbc.com",
      "www.aljazeera.com",
      "onefootball.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Liverpool winger Mohamed Salah says it is \"something I'll never forget and take for granted\" after becoming the first player to receive three PFA Player of the Year awards.",
      "The Liverpool star is the first three-time winner of the annual award, given to the best player in English football.",
      "Mohamed Salah has been named as the winner of the PFA Players’ Player of the Year for the 2024/25 season.The Liverpool winger has been recognised with English football’s greatest individual honour...",
      "<ul><li><p>Liverpool forward wins honour for the third time</p></li><li><p>Caldentey award follows stellar season for Arsenal</p></li></ul><p>Liverpool’s Mohamed Salah and Arsenal’s Mariona Caldentey have won the 2025 awards for the Professional Footballers’ Association players’ player of the year.<",
      "Liverpool star Mohamed Salah has won a record third PFA Men's Player of the Year award, with Arsenal's Mariona Caldentey collecting the women's accolade."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/bd9f/live/28f44a10-7d41-11f0-a34f-318be3fb0481.jpg",
    "titles": [
      "'The hunger makes me want more' - Salah wins third PFA award",
      "Mo Salah wins record third PFA Player of the Year award",
      "The players with the most PFA Player of the Year awards",
      "Prolific Salah and Caldentey rewarded with PFA player of the year awards",
      "Salah, Caldentey scoop 2024/25 PFA Player of the Year awards"
    ],
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.782,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.786,
    "summary": "Liverpool's Mohamed Salah won the Professional Footballers' Association men's Player of the Year award for a record third time. Aston Villa's Morgan Rogers was named young player of the year. On the women's side, Arsenal's Mariona Caldentey received the Player of the Year award, with teammate Olivia Smith securing the young player award. These accolades follow exceptional seasons for both Salah and Caldentey with their respective clubs.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 72 tokens",
    "image": {
      "src": "icons/newspaper.svg",
      "thumbnail": "icons/newspaper.svg",
      "alt": "general",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "EU-US Summit Sparks Talks on Ukraine Security; Trump Rules Out US Troops",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 19 Aug 2025 23:22:36 GMT",
    "source": "BBC",
    "sources": [
      "Deutsche Welle",
      "BBC",
      "The Guardian",
      "Axios"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com",
      "www.dw.com",
      "news.google.com"
    ],
    "snippets": [
      "There are inherent contradictions in the idea of the guarantees meant to prevent Russia from attacking Ukraine again.",
      "After the EU-US summit on Russia's war against Ukraine, a debate is underway in Germany about security guarantees and what role Germany should play going forward.",
      "<a href=\"https://news.google.com/rss/articles/CBMihAFBVV95cUxQWVl3WkF0ekN3Sk9Sdk1wNDRwT2pSZC0wVXh6UmN1UFctWnMtVU9pWXJFWUFyZmNMcmlncDRTY1ZPNHhvUmQxb2RKMlVBU1ltdmdDQTJ2TWZUczRoRWhESTF5QUI4di1lRjF0UjhZMmZUYWZEb3VDODhlMF9JcjhSbDItNmU?oc=5\" target=\"_blank\">MAGA isolationists brace for details of Ukraine ",
      "<a href=\"https://news.google.com/rss/articles/CBMiigFBVV95cUxQdGxFQkY4cV9qNEFqU0ZjZ2ZQMV8wUF91cm11S3dBNUJZOGpSanptSVVFWWRfc3B6dElNWXBKUTk5ZVpldV9UdlA1NHAwekNlVXFFVHJ0LW0wUjBFdW1BZVpNa2pYZ1htcEk2TXNwZWtOelhvQk1LaE0wa2FiTEdSb2lVR2NqTVF3cEE?oc=5\" target=\"_blank\">Rubio to lead Ukraine security guarantee",
      "<p>US president suggests he may be willing to provide air power to help enforce potential peace deal with Putin</p><p>Donald Trump has ruled out sending US troops to Ukraine to enforce a potential peace deal with Vladimir Putin, tempering a <a href=\"https://www.theguardian.com/world/2025/aug/19/euro"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/ebf2/live/1d685620-7d53-11f0-83cc-c5da98c419b8.jpg",
    "titles": [
      "What security guarantees for Ukraine would actually mean",
      "Ukraine security guarantees: What is Germany's role?",
      "MAGA isolationists brace for details of Ukraine security guarantees - Axios",
      "Rubio to lead Ukraine security guarantees talks, with Trump promising air support - Axios",
      "Trump rules out sending US troops to Ukraine as part of security guarantees"
    ],
    "score_components": {
      "magnitude": 0.952,
      "recency": 0.816,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.773,
    "summary": "After the EU-US summit on Russia's war against Ukraine, discussions are ongoing in Germany regarding its role in providing security guarantees to prevent future Russian aggression against Ukraine. Senator Marco Rubio is set to lead efforts on Ukraine's security guarantees. Amidst these developments, former President Donald Trump has indicated that European countries will provide security guarantees to Ukraine, in coordination with the U.S., but ruled out sending U.S. troops to enforce any potential peace deal with Russia. Trump also warned of a \"rough situation\" for Putin if he does not cooper",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 96 tokens",
    "image": {
      "src": "icons/usa.svg",
      "thumbnail": "icons/usa.svg",
      "alt": "us flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Air Canada Ends Strike with Tentative Deal, Flights to Resume Tuesday",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Tue, 19 Aug 2025 11:25:59 -0400",
    "source": "NPR",
    "sources": [
      "Washington Post",
      "NPR",
      "The Guardian",
      "CityNews"
    ],
    "domains": [
      "www.washingtonpost.com",
      "www.npr.org",
      "ottawa.citynews.ca",
      "www.theguardian.com"
    ],
    "snippets": [
      "The flight attendants' union said a new agreement guarantees members will be paid for work performed while planes are on the ground, resolving one of the major issues that drove the strike.",
      "<p>Strike over wages and ground work has cancelled travel for 500,000 people worldwide</p><p>Air Canada flight attendants say they have reached a “tentative” deal with the airline to end a strike over wages and ground work that has cancelled travel for half a million people worldwide.</p><p>Roughly ",
      "Air Canada flights will resume Tuesday evening, it said. Details were sparse on the tentative deal between the company and its flight attendants union, CUPE.",
      "Air Canada flights are back in the air after attendants and the airline reached a tentative agreement earlier Tuesday. The union representing Air Canada&#8217;s 10,000 flight attendants confirmed its members would return to work, ending a disruptive strike that grounded thousands of flights and stra"
    ],
    "image_url": "",
    "titles": [
      "Air Canada flights slowly resume after flight attendants agree to end their strike",
      "Air Canada flight attendants reach ‘tentative’ deal with airline to end strike",
      "Air Canada to resume flights after making deal to end cabin crew strike",
      "Strike over: Air Canada flights resume after attendants, airline reach tentative agreement"
    ],
    "score_components": {
      "magnitude": 0.932,
      "recency": 0.706,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.769,
    "summary": "Air Canada and its flight attendants' union have reached a tentative agreement, ending a strike that began on Saturday over wages and unpaid ground work. The strike, which affected 500,000 travelers worldwide, led to the grounding of thousands of flights. The new deal ensures that flight attendants will be paid for work performed on the ground, addressing a key grievance. Flights are set to resume Tuesday evening, though specific details of the agreement remain undisclosed.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 76 tokens",
    "image": {
      "src": "icons/canada.svg",
      "thumbnail": "icons/canada.svg",
      "alt": "canada flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "FDA Warns Against Radioactive Shrimp at Walmart",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Wed, 20 Aug 2025 01:18:08 -0400",
    "source": "NPR",
    "sources": [
      "Business Insider",
      "NPR",
      "Axios"
    ],
    "domains": [
      "www.npr.org",
      "www.businessinsider.com",
      "news.google.com"
    ],
    "snippets": [
      "The risk from the recalled shrimp is \"quite low,\" said Donald Schaffner, a food safety expert at Rutgers University. Cesium-137 is a byproduct of nuclear reactions.",
      "<a href=\"https://news.google.com/rss/articles/CBMigAFBVV95cUxONnpYWGhSNEpCYXlnblVRVm9ZWkZCbUFudk1SbU9taEpYLXc4NnhtTlhhREd2SkNGRDdrZHJ0bXhlMkV0VC1semFXazBuT3BaS3dUNjd0QjE4MWJCMzYtaWMxSUZaV0NrSGF2VDFQOHRVVjV3MDFrX1BqZzh2Y3JaSw?oc=5\" target=\"_blank\">FDA warns public about eating radioactive shrimp from",
      "The FDA is warning shoppers not to eat the Great Value raw frozen shrimp sold at Walmart after detecting possible radioactive contamination.",
      "The FDA warns that a shipment of frozen shrimp meant for Walmart tested positive for radioactive poisoning."
    ],
    "image_url": "",
    "titles": [
      "Walmart recalls frozen shrimp over potential radioactive contamination",
      "FDA warns public about eating radioactive shrimp from Walmart - Axios",
      "'Throw it away,' says the FDA to shoppers who may have bought Walmart shrimp exposed to radioactive contamination",
      "Please let me eat the radioactive shrimp from Walmart"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.943,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.757,
    "summary": "The FDA has issued a warning against consuming a batch of frozen shrimp sold at Walmart, found to be contaminated with Cesium-137, a radioactive isotope. The contamination was detected in shipping containers and a sample of breaded shrimp imported from Indonesia.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 42 tokens",
    "image": {
      "src": "icons/briefcase.svg",
      "thumbnail": "icons/briefcase.svg",
      "alt": "business",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Richardson's Agent Disappointed After Colts Name Jones Starting QB",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Wed, 20 Aug 2025 01:27:06 EST",
    "source": "ESPN",
    "sources": [
      "Sports Illustrated",
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.cbssports.com",
      "www.espn.com",
      "news.google.com"
    ],
    "snippets": [
      "Anthony Richardson Sr.'s agent reacted with disappointment with the Colts' decision to name Daniel Jones the starting quarterback and said he's unsure of his client's future with the team.",
      "Jones was named the Colts starting QB on Tuesday over Richardson",
      "<a href=\"https://news.google.com/rss/articles/CBMilAFBVV95cUxQZU1MWHdHSlBnYTNVSnB4LUl2YlYyYVlsYXAwOUtTQWtyY0hJck9DRDBCeFI1V3FxcUNsM1FSV0FlNWNRRERuUGMzMTZfdmV6dXhDUTEyN2Q3cWt2cHpPMDRITjRBeldna0JiYmdkWUQ4R3k4U3BYREdkekZ6OEdPdDRRb01HT0FlM2IwdVZpRmlWbm9k?oc=5\" target=\"_blank\">Anthony Richardson's Agent "
    ],
    "image_url": "",
    "titles": [
      "Agent unsure of Richardson's future with Colts",
      "Anthony Richardson's agent says there is 'lots to discuss' with Colts after team names Daniel Jones starter",
      "Anthony Richardson's Agent Sends Strong Message to Colts After Daniel Jones Decision - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.946,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.751,
    "summary": "Anthony Richardson Sr.'s agent expressed disappointment following the Colts' decision to name Daniel Jones as the starting quarterback. He indicated uncertainty about Richardson's future with the team and mentioned that there is \"a lot to discuss\" with the Colts, as reported to ESPN.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 45 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Julio César Chávez Jr. Deported to Mexico, Faces Crime Charges",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Wed, 20 Aug 2025 01:27:06 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "LA Times",
      "ESPN"
    ],
    "domains": [
      "www.latimes.com",
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "Julio César Chávez Jr., 39, arrested days after his fight with Jake Paul, has been deported to Mexico, where he's wanted for alleged cartel ties, following his detention in the U.S. for allegedly overstaying his visa and lying on a green card application.",
      "Chávez was deported to Mexico on charges of cartel involvement, including arms and drug trafficking",
      "<p>Julio César Chávez Jr., son of the legendary Mexican boxer, has been deported to Mexico, where authorities say he faces charges of organized crime affiliation and arms trafficking.</p>"
    ],
    "image_url": "",
    "titles": [
      "Chávez deported to Mexico for alleged cartel ties",
      "Former champion Julio César Chávez Jr. deported to Mexico, jailed after ICE arrest in Los Angeles",
      "Boxer Julio César Chávez Jr. deported to Mexico"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.946,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.751,
    "summary": "Julio César Chávez Jr., 39, was deported to Mexico after being detained in the U.S. for visa issues and allegedly lying on a green card application. In Mexico, he faces charges related to organized crime, including arms and drug trafficking. This legal action follows shortly after his fight with Jake Paul.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 52 tokens",
    "image": {
      "src": "icons/mexico.svg",
      "thumbnail": "icons/mexico.svg",
      "alt": "mexico flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Canada's Little League Team Eliminated by Aruba, 6-1",
    "domain": "sports",
    "source_domain": "www.sportingnews.com",
    "location": "national",
    "published": "Wed, 20 Aug 2025 07:00:01 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.sportingnews.com"
    ],
    "snippets": [
      "The right pitcher went viral early in the Little League World Series.",
      "<p>When Canada&#8217;s entry at the Little League World Series reflects on what could have been in Tuesday&#8217;s 6-1 elimination loss to Aruba, the fourth inning will undoubtedly be at the top of the list.</p>"
    ],
    "image_url": "",
    "titles": [
      "Who is Lin Chin-Tse? Meet flamethrowing Chinese Taipei pitcher who throws over 80 mph at Little League World Series",
      "Aruba eliminates Canada at Little League World Series"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.977,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.7,
    "summary": "A pitcher from Canada's team at the Little League World Series gained viral attention early in the tournament. However, the team faced a 6-1 elimination loss to Aruba. The game's pivotal moment came in the fourth inning, which will be a significant point of reflection for the team as they consider what might have been done differently.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 60 tokens",
    "image": {
      "src": "icons/canada.svg",
      "thumbnail": "icons/canada.svg",
      "alt": "canada flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Raducanu and Alcaraz Exit US Open Mixed Doubles in First Round",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 19 Aug 2025 21:53:29 GMT",
    "source": "BBC",
    "sources": [
      "Sky Sports",
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.skysports.com",
      "www.bbc.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Emma Raducanu and Carlos Alcaraz might have lost in the revamped US Open mixed doubles - but they win the hearts of the New York crowd.",
      "<p>Starry pairings enjoy magic moments but mixed fortunes while specialists retain pride in ‘reimagined’ doubles</p><p>After many long months of discussion and anticipation, the doubles partnership between Emma Raducanu and Carlos Alcaraz came and went in the blink of an eye in a well‑populated Arth",
      "Jack Draper won the battle of the British No 1s as he and playing partner Jessica Pegula beat Emma Raducanu and Carlos Alcaraz in the first round of the US Open's revamped, star-studded mixed doubles competition."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/6254/live/5d098c00-7d39-11f0-b6c9-e1728577c12d.jpg",
    "titles": [
      "Raducanu & Alcaraz out as polarising US Open mixed doubles starts",
      "Alcaraz and Raducanu bulldozed by Draper and Pegula in revamped US Open mixed doubles | Tumaini Carayol",
      "Raducanu, Alcaraz out with Draper into semi-finals of US Open mixed doubles"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.791,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.695,
    "summary": "Emma Raducanu and Carlos Alcaraz, despite being a highly anticipated duo, were eliminated in the first round of the US Open's revamped mixed doubles competition. They faced defeat against Jack Draper and Jessica Pegula. However, their participation and the event's star-studded lineup captivated the New York crowd, highlighting the mixed fortunes in the tournament's new format.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 60 tokens",
    "image": {
      "src": "icons/usa.svg",
      "thumbnail": "icons/usa.svg",
      "alt": "us flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Isak Accuses Newcastle United of Broken Promises, Seeks Exit",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 19 Aug 2025 20:21:56 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "www.bbc.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Alexander Isak says promises have been \"broken\" by Newcastle United and \"the relationship can't continue\" as he looks to force through an exit this summer.",
      "The player broke his silence, and his current club swiftly responded",
      "<ul><li><p>‘The relationship cannot continue,’ striker says</p></li><li><p>Attending PFA awards on Tuesday ‘didn’t feel right’</p></li></ul><p>Alexander Isak’s standoff with Newcastle threatened to descend into outright civil war on Tuesday night as the Sweden striker accused his club of breaking pr"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/5dfd/live/7d3e64d0-7d1d-11f0-b8e7-2dc6f436f923.jpg",
    "titles": [
      "'Broken promises' - what's going on with Isak, Newcastle and Liverpool?",
      "Alexander Isak transfer saga: Liverpool target says promises were 'broken' and 'trust is lost' with Newcastle",
      "‘Trust is lost’: Isak accuses Newcastle of broken promises in transfer drama"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.766,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.69,
    "summary": "Alexander Isak has publicly accused Newcastle United of breaking promises, stating that their relationship cannot continue, signaling his desire to leave the club this summer. His comments highlight a significant rift between the player and the club, which has escalated tensions. Newcastle United has responded to Isak's claims, but the details of their response were not specified in the provided content. This dispute came to light as Isak expressed discomfort in attending the PFA awards, underlining the depth of his discontent with the club.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 85 tokens",
    "image": {
      "src": "icons/newspaper.svg",
      "thumbnail": "icons/newspaper.svg",
      "alt": "general",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "U.K. drops ‘back door’ demand for Apple user data, U.S. intel chief says",
    "domain": "technology",
    "source_domain": "www.washingtonpost.com",
    "location": "global",
    "published": "Tue, 19 Aug 2025 19:21:57 +0000",
    "source": "Washington Post",
    "sources": [
      "Washington Post",
      "TechCrunch",
      "Ars Technica"
    ],
    "domains": [
      "www.washingtonpost.com",
      "techcrunch.com",
      "arstechnica.com"
    ],
    "snippets": [
      "Director of National Intelligence Tulsi Gabbard said the British government order “would have enabled access to the protected encrypted data of American citizens.”",
      "Tulsi Gabbard said that President Donald Trump and Vice President JD Vance also participated in the negotiations with the U.K. government over its once-secret demand to Apple.",
      "UK previously demanded that Apple break encryption to aid government spying."
    ],
    "image_url": "",
    "titles": [
      "U.K. drops ‘back door’ demand for Apple user data, U.S. intel chief says",
      "US spy chief says UK has dropped its Apple backdoor demand",
      "Trump admin says it convinced UK to drop demand for Apple backdoor"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.766,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.69,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 15 tokens",
    "image": {
      "src": "icons/usa.svg",
      "thumbnail": "icons/usa.svg",
      "alt": "u s flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Saints Extend QB Battle; Colts Name Season Starter",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Wed, 20 Aug 2025 01:27:06 EST",
    "source": "ESPN",
    "sources": [
      "Sports Illustrated",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "news.google.com"
    ],
    "snippets": [
      "The Saints are taking their quarterback decision down to the wire, with coach Kellen Moore saying they want to continue the competition between Tyler Shough and Spencer Rattler through next week.",
      "<a href=\"https://news.google.com/rss/articles/CBMijwFBVV95cUxOVV8yaFFBaHR4R2RHdnlFQ2hZUjl6RGd3V1FiclFOVTlIMGdhQlJDRERVVk9iUjJDeXNUMkluTXprSWtkbjRETlhmVV9DbnRoMkZyWWFZRFJyVjJWX18tMzZBSzByb3JZZ3ViYlF5bGRHYk5YSGtPQXZnblJmMk9wV2hwVHJGbHVHMG1fLWl0TQ?oc=5\" target=\"_blank\">Kellen Moore Relays Important Upd",
      "<a href=\"https://news.google.com/rss/articles/CBMiiwFBVV95cUxQSlhsV1k4VFVSbzV0WkhOeWthdjdnT29Yb05vVHlZN2dxN1d6Vnpud0h1elF5cDByY3RTQTdKcWRIV1BXdEtUbnRkcXpHY0VoNnpSUHBld0NUU0Q2VDJTN3E0RmZuazBET0pLOWJtekZYVHNPc3hJcWtHLWVJU1VrcjQ1TTk0djVzRDlj?oc=5\" target=\"_blank\">Former Detroit Lions Quarterback Signs "
    ],
    "image_url": "",
    "titles": [
      "Saints QB competition to continue, Moore says",
      "Kellen Moore Relays Important Update in Saints' Quarterback Competition - Sports Illustrated",
      "Former Detroit Lions Quarterback Signs With 49ers - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.946,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.676,
    "summary": "The New Orleans Saints are prolonging the quarterback competition between Tyler Shough and Spencer Rattler, with coach Kellen Moore aiming to finalize the decision next week. Meanwhile, the Indianapolis Colts have chosen their starting quarterback for the season opener.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 39 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Six Fighters Earn UFC Contracts in First Two Weeks of DWCS",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Wed, 20 Aug 2025 02:07:39 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "In just two weeks six contracts have been handed out at 'DWCS.\"",
      "<p>Dana White was pleased with the results on Week 2 of the Contender Series, with four fights ending with a knockout and all five winners rewarded with UFC contracts.</p>"
    ],
    "image_url": "",
    "titles": [
      "'Dana White's Contender Series' Week 2: Four KOs, five contracts awarded",
      "Four knockouts on Week 2 of Dana White’s Contender Series"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.959,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.672,
    "summary": "Over the first two weeks of the 'Dana White's Contender Series' (DWCS), six contracts have been awarded to fighters. In the second week, Dana White expressed satisfaction as four out of five fights concluded with knockouts. Consequently, all five winners from Week 2 were granted UFC contracts, highlighting a successful series of matches.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 54 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Mariners' Robles Suspended 10 Games for Bat Incident, Plans to Appeal",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Wed, 20 Aug 2025 01:27:06 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "Victor Robles has received a 10-game suspension and an undisclosed fine for throwing his bat at a Triple-A pitcher Sunday.",
      "<p>The Seattle Mariners outfielder was suspended 10 games by MLB on Tuesday for throwing his bat at a pitcher in a triple-A game on Sunday.</p>"
    ],
    "image_url": "",
    "titles": [
      "Robles suspended 10 games, fined for bat heave",
      "Mariners’ Robles suspended 10 games for throwing bat at pitcher in rehab game"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.946,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.669,
    "summary": "The Seattle Mariners outfielder, Robles, has been suspended for 10 games by Major League Baseball (MLB) for throwing his bat at a pitcher during a triple-A game on Sunday. Robles is expected to appeal the suspension, which is required to be served at the major league level.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 48 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Rory McIlroy Buys 1,100 Masters Flags to Celebrate Augusta Win",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Wed, 20 Aug 2025 01:27:06 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "Rory McIlroy said he took all 1,100 pin flags from the Masters Shop after winning at Augusta National in April. \"I've waited 17 years to sign that flag in the middle, and I will never complain about doing it.\"",
      "McIlroy said he will 'never get sick' of signing flags to commemorate his Masters win"
    ],
    "image_url": "",
    "titles": [
      "Rory: Took home 1,100 Masters flags after win",
      "Rory McIlroy says he took home 1,100 pin flags from The Masters Shop after completing career grand slam"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.946,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.669,
    "summary": "After winning the Masters at Augusta National in April, Rory McIlroy acquired all 1,100 pin flags from the Masters Shop, expressing his deep appreciation for the victory. He highlighted the significance of the win by stating his eagerness to sign the flags, a task he views as a privilege rather than a burden, despite the large number. McIlroy's comments reflect his fulfillment and pride in achieving a long-awaited milestone in his golfing career.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 76 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Vienna Chosen to Host Eurovision 2026, Marks Third Time",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-08-20T06:41:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.dw.com"
    ],
    "snippets": [
      "Austria's capital will host the next European Song Contest, organizers have announced. Vienna last hosted the extravaganza in 2015 and 1967.",
      "<p>Final of 70th edition of competition to be held on 16 May at the Wiener Stadthalle, Austria’s largest indoor arena</p><p>Vienna has been chosen to host the Eurovision song contest 2026, the world’s biggest live televised music event, Austria’s public broadcaster announced, with the final set for "
    ],
    "image_url": "",
    "titles": [
      "Eurovision: Vienna to host European Song Contest 2026",
      "Vienna announced as host city for Eurovision song contest 2026"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.97,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.649,
    "summary": "Vienna, Austria, has been selected to host the Eurovision Song Contest 2026, marking the city's third time hosting the event, following previous occasions in 2015 and 1967. The final of the competition's 70th edition will take place on May 16 at the Wiener Stadthalle, Austria's largest indoor arena. This announcement was made by Austria's public broadcaster, highlighting the city's readiness to host the world's biggest live televised music event once again.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 77 tokens",
    "image": {
      "src": "icons/newspaper.svg",
      "thumbnail": "icons/newspaper.svg",
      "alt": "general",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "John Wall Announces Retirement After 11-Year NBA Career",
    "domain": "sports",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Wed, 20 Aug 2025 06:36:43 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Sportsnet",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Wall, the No 1 NBA draft pick in 2010, is best known for his spectacular point guard play with the Washington Wizards.",
      "<p>Five-time All-Star and 11-year veteran John Wall announced his retirement from the NBA via Instagram on Tuesday.</p>"
    ],
    "image_url": "",
    "titles": [
      "John Wall, NBA All-Star, announces retirement after 11 seasons",
      "Five-time All-Star John Wall announces retirement from NBA"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.969,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.649,
    "summary": "John Wall, the No. 1 NBA draft pick in 2010 and a five-time All-Star known for his time with the Washington Wizards, announced his retirement from professional basketball after an 11-year career. The announcement was made through his Instagram account on Tuesday.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 45 tokens",
    "image": {
      "src": "icons/basketball.svg",
      "thumbnail": "icons/basketball.svg",
      "alt": "nba",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "July Inflation Rise Dims Hopes for Bank of England Rate Cut",
    "domain": "business",
    "source_domain": "www.ft.com",
    "location": "global",
    "published": "Wed, 20 Aug 2025 06:01:33 GMT",
    "source": "Financial Times",
    "sources": [
      "The Guardian",
      "Financial Times"
    ],
    "domains": [
      "www.theguardian.com",
      "www.ft.com"
    ],
    "snippets": [
      "Economists say figure casts doubt on prospect of further BoE rate cuts this year",
      "<p>Fuel and air fares also pushed up annual July rate, making interest rate cuts less likely this year</p><ul><li><p><a href=\"https://www.theguardian.com/money/2025/aug/20/rail-fares-in-england-rise-next-year\">Rail fares in England expected to rise by 5.8% next year</a></p></li><li><p><a href=\"https"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Fbea6e338-6475-4ca4-ad55-1fed1742deee.png?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "UK inflation rises more than expected to 3.8% in July",
      "UK inflation rises by more than expected to 3.8% amid higher food prices"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.937,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.649,
    "summary": "Economists believe the increase in the annual July rate, influenced by higher costs for fuel and air fares, casts doubt on the likelihood of the Bank of England reducing interest rates this year. Additionally, rail fares in England are projected to rise by 5.8% next year, further contributing to the economic outlook. This combination of factors suggests that interest rate cuts are less probable in the current year.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 69 tokens",
    "image": {
      "src": "icons/uk.svg",
      "thumbnail": "icons/uk.svg",
      "alt": "england flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Microsoft workers occupy HQ in protest against company’s ties to Israeli military",
    "domain": "technology",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Wed, 20 Aug 2025 02:03:12 GMT",
    "source": "The Guardian",
    "sources": [
      "The Verge",
      "The Guardian"
    ],
    "domains": [
      "www.theverge.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "<p>Employees outraged by report Azure platform used by Israel to store surveillance data collected on Palestinians</p><p>Dozens of Microsoft employees occupied the company’s east campus in Redmond, Washington to protest against what they say is the use of its software by the Israeli military to carr",
      "On Tuesday, a group of current and former Microsoft employees, as well as community members, took over a plaza at Microsoft's headquarters in Redmond, Washington, as part of a No Azure for Apartheid protest. They declared the area a \"Liberated Zone\" encampment and said they had changed its name from"
    ],
    "image_url": "https://i.guim.co.uk/img/media/796ca46d994a55a8357ff808c9c0270b5c34a3a7/426_0_3335_2668/master/3335.jpg?width=140&quality=85&auto=format&fit=max&s=db98d681cf83387afe0535d087395dfe",
    "titles": [
      "Microsoft workers occupy HQ in protest against company’s ties to Israeli military",
      "Microsoft employees occupy headquarters in protest of Israel contracts"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.863,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.642,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 13 tokens",
    "image": {
      "src": "icons/israel.svg",
      "thumbnail": "icons/israel.svg",
      "alt": "israeli flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Fireball Lights Up Southern Japan's Sky in Celestial Event",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 20 Aug 2025 05:12:32 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The skies above southern Japan were illuminated late on Tuesday evening after dust or asteroid fragments burnt up in the atmosphere.",
      "Livestream cameras captured the moment a blazing fireball lit up the night sky across southern Japan."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/24b8/live/0c833ac0-7d83-11f0-a34f-318be3fb0481.jpg",
    "titles": [
      "Watch: Moment fireball lights up night sky in Japan",
      "Blazing fireball lights up the night sky in Japan"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.921,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.639,
    "summary": "Late Tuesday evening, southern Japan witnessed a spectacular celestial event when dust or asteroid fragments entered the atmosphere and ignited, creating a brilliant fireball. This phenomenon was captured live by cameras, lighting up the night sky across the region.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 39 tokens",
    "image": {
      "src": "icons/japan.svg",
      "thumbnail": "icons/japan.svg",
      "alt": "japan flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Nvidia Strikes Deal with U.S. to Sell AI Chips in China, Offers Govt 15% Share",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Tue, 19 Aug 2025 20:10:14 GMT",
    "source": "CNBC",
    "sources": [
      "TechCrunch",
      "CNBC"
    ],
    "domains": [
      "techcrunch.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "Nvidia last week struck a deal with the U.S. government to resume selling products in China, in exchange for giving it a 15% cut of the sales.",
      "Nvidia is apparently putting together a new AI chip meant for sale in China that's half as powerful as its flagship B300 Blackwell GPU. The new chip would be more powerful than the H20 GPUs the company is currently allowed to sell in the country."
    ],
    "image_url": "",
    "titles": [
      "Nvidia says it's evaluating a 'variety of products' after report of new AI chip for China",
      "Nvidia said to be developing new, more powerful AI chip for sale in China"
    ],
    "score_components": {
      "magnitude": 0.795,
      "recency": 0.763,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.629,
    "summary": "Nvidia has reached an agreement with the U.S. government to continue its sales in China, offering the government a 15% share of these sales. As part of this deal, Nvidia is developing a new AI chip for the Chinese market, which will be half as powerful as its leading B300 Blackwell GPU but still surpasses the capabilities of the H20 GPUs currently permitted for sale in China.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 68 tokens",
    "image": {
      "src": "icons/usa.svg",
      "thumbnail": "icons/usa.svg",
      "alt": "u s flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "NASA's Webb Telescope Discovers New Moon Around Uranus",
    "domain": "science",
    "source_domain": "www.newscientist.com",
    "location": "global",
    "published": "Tue, 19 Aug 2025 19:20:15 +0100",
    "source": "New Scientist",
    "sources": [
      "New Scientist",
      "Phys.org"
    ],
    "domains": [
      "www.newscientist.com",
      "phys.org"
    ],
    "snippets": [
      "The James Webb Space Telescope has discovered a new moon that is small and dim in orbit around Uranus. The discovery brings the planet's total to 29, and scientists say there are probably more to be found",
      "Using NASA's James Webb Space Telescope, a team led by the Southwest Research Institute (SwRI) has identified a previously unknown moon orbiting Uranus, expanding the planet's known satellite family to 29. The detection was made during a Webb observation on Feb. 2, 2025."
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/08/19180356/SEI_262644933.jpg",
    "titles": [
      "New moon discovered orbiting Uranus is its smallest one",
      "Webb discovers a new moon orbiting Uranus"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.75,
      "consensus": 0.591,
      "constructiveness": 0.078,
      "proximity": 0.5
    },
    "score": 0.613,
    "summary": "NASA's James Webb Space Telescope, operated by a team from the Southwest Research Institute, discovered a new moon orbiting Uranus on February 2, 2025. This discovery increases Uranus's total number of known moons to 29. Scientists believe there may be more moons yet to be found around the planet.",
    "constructiveness_score": 0.078,
    "constructiveness_reason": "1 constructive keywords out of 51 tokens",
    "image": {
      "src": "icons/telescope.svg",
      "thumbnail": "icons/telescope.svg",
      "alt": "nasa",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "LIVE:  ABC News Live",
    "domain": "technology",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Tue, 19 Aug 2025 13:28:30 -0400",
    "source": "ABC News",
    "sources": [
      "The Verge",
      "ABC News"
    ],
    "domains": [
      "www.theverge.com",
      "abcnews.go.com"
    ],
    "snippets": [
      "24/7 coverage of breaking news and live events",
      "While it didn’t feature much of Silksong outside of a brief tease — though there’s plenty more coming very soon — the main event for Gamescom, Opening Night Live, did have plenty to show off during its two hour runtime. Much of it was expected and teased ahead of time, including fresh looks at Call "
    ],
    "image_url": "https://s.abcnews.com/images/Live/abc_news_live-abc-ml-250210_1739199021469_hpMain_4x3t_384.jpg",
    "titles": [
      "LIVE:  ABC News Live",
      "All the news from Gamescom Opening Night Live 2025"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.737,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.602,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 4 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Eight Sleep raises $100 million, preps retail stores - Axios",
    "domain": "technology",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Tue, 19 Aug 2025 14:15:02 GMT",
    "source": "Axios",
    "sources": [
      "TechCrunch",
      "Axios"
    ],
    "domains": [
      "techcrunch.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMibEFVX3lxTE0xZjNzdjJHRHEteERvZm5adTc3bGtpeDJDd21yRms2aDdPOXZDaTY2ZlBWQUVrdVhvV1dxcFZvcnRaUXJSb25BS1h0OGVhUlBRd2pjRE1QY0FHQk5UZGVoQm1CWFk5eDVsaUNYdQ?oc=5\" target=\"_blank\">Eight Sleep raises $100 million, preps retail stores</a>&nbsp;&nbsp;<font color=\"",
      "The sleep tech company raised  from HSG, Valor Equity Partners, Founders Fund, Y Combinator, and big F1 names like Charles Leclerc and Zak Brown."
    ],
    "image_url": "",
    "titles": [
      "Eight Sleep raises $100 million, preps retail stores - Axios",
      "Eight Sleep raises $100M to expand its AI-powered sleep tech"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.675,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.597,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 9 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Here are the best Apple Watch deals available right now",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-08-19T19:38:41-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "www.theverge.com"
    ],
    "snippets": [
      "In September, Apple launched its latest smartwatch, introducing the Apple Watch Series 10 alongside a black rendition of the Apple Watch Ultra 2. Each wearable has its own pros and cons, as does the second-gen Apple Watch SE, but the introduction of Apple’s newest wearables also means there are now ",
      "We’re in an age where you can realistically delegate tasks to smart hunks of metal, whether it’s a self-driving car or a robot that can clean on your behalf. Most of us probably won’t be able to afford the helpful sentient humanoids being developed in our lifetimes, but robot vacuums are an affordab",
      "While the best iPad deals usually land during major sale events like Black Friday and Amazon Prime Day,&#160;many great iPad deals are available outside of those times. The day-to-day discounts come and go like changing winds, so there’s often some amount to be saved, particularly on Apple’s most af"
    ],
    "image_url": "",
    "titles": [
      "Here are the best Apple Watch deals available right now",
      "Here are the best robot vacuum deals available right now",
      "The best iPad deals you can get right now"
    ],
    "score_components": {
      "magnitude": 0.393,
      "recency": 0.838,
      "consensus": 0.35,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.523,
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story is constructive as it provides actionable insights to readers who are interested in purchasing an Apple Watch. It can help them make informed decisions about where and when to buy to get the best deal.",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Study: Early Maltreatment Delays Child Development, Infants Most at Risk",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Wed, 20 Aug 2025 03:00:01 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "phys.org"
    ],
    "snippets": [
      "Research shows that early childhood maltreatment is associated with significant delays in social and cognitive development. Unfortunately, according to the United States Department of Health and Human Services, children under age one face the highest risk of maltreatment, particularly neglect."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2023/foster-care.jpg",
    "titles": [
      "Q&A: Foster care timing may affect children's school performance"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.977,
      "consensus": 0.35,
      "constructiveness": 0.178,
      "proximity": 0.5
    },
    "score": 0.481,
    "summary": "Research indicates that early childhood maltreatment leads to notable delays in social and cognitive development. The United States Department of Health and Human Services reports that children under one year old are at the greatest risk for maltreatment, with neglect being the most common form.",
    "constructiveness_score": 0.178,
    "constructiveness_reason": "2 constructive keywords out of 45 tokens",
    "image": {
      "src": "icons/beaker.svg",
      "thumbnail": "icons/beaker.svg",
      "alt": "science",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "U.S. States Ban or Limit AI Therapy Services Amid Safety Concerns",
    "domain": "business",
    "source_domain": "www.forbes.com",
    "location": "global",
    "published": "Wed, 20 Aug 2025 03:15:00 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes"
    ],
    "domains": [
      "www.forbes.com"
    ],
    "snippets": [
      "Some U.S. states are enacting laws to ban or heavily restrict AI-driven therapy. Nevada has done so. I cover both the good and bad involved. An AI Insider scoop."
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/68a50b91e53dac959421eae7/0x0.jpg?width=960",
    "titles": [
      "Nevada Enacts New Law To Shut Down The Use Of AI For Mental Health But Sizzling Loopholes Might Exist"
    ],
    "score_components": {
      "magnitude": 0.393,
      "recency": 0.982,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.471,
    "summary": "Several U.S. states, including Nevada, have implemented laws to either ban or significantly limit AI-driven therapy services. This legislative movement aims to address concerns surrounding the efficacy and safety of using artificial intelligence in mental health care. The decision reflects a broader debate on the benefits and drawbacks of integrating AI into therapeutic practices.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 56 tokens",
    "image": {
      "src": "icons/usa.svg",
      "thumbnail": "icons/usa.svg",
      "alt": "u s flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Volunteers Still Clearing Debris in North Sea 6 Years After Shipping Incident",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Wed, 20 Aug 2025 02:36:32 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "phys.org"
    ],
    "snippets": [
      "Volunteer Dutch divers are still fishing debris from the North Sea six years after a disastrous shipping accident."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/volunteers-clean-up-th.jpg",
    "titles": [
      "Dutch divers still haul up debris six years after container spill"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.969,
      "consensus": 0.35,
      "constructiveness": 0.095,
      "proximity": 0.5
    },
    "score": 0.471,
    "summary": "Six years after a catastrophic shipping incident, volunteer divers in the Netherlands continue to remove debris from the North Sea. This ongoing effort highlights the long-term environmental impact of the accident and the dedication of the volunteers to mitigate its effects.",
    "constructiveness_score": 0.095,
    "constructiveness_reason": "1 constructive keywords out of 42 tokens",
    "image": {
      "src": "icons/beaker.svg",
      "thumbnail": "icons/beaker.svg",
      "alt": "science",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "European Stocks Open Lower Amid Global Market Uncertainty",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Wed, 20 Aug 2025 07:24:08 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com"
    ],
    "snippets": [
      "European stocks opened lower on Wednesday as global market sentiment wavered."
    ],
    "image_url": "",
    "titles": [
      "European defense stocks extend losses on resurging hopes for Ukraine ceasefire"
    ],
    "score_components": {
      "magnitude": 0.393,
      "recency": 0.965,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.468,
    "summary": "European stocks started the day down on Wednesday amid uncertain global market sentiment. Investors are cautious due to various economic factors. The outcome of the day's trading will depend on how these factors evolve throughout the day.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 38 tokens",
    "image": {
      "src": "icons/chart-up.svg",
      "thumbnail": "icons/chart-up.svg",
      "alt": "stocks",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Concerns Rise Over Slowing Economic Growth in China",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Wed, 20 Aug 2025 07:20:14 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com"
    ],
    "snippets": [
      "From data to social chatter, worries about slower growth in China are picking up."
    ],
    "image_url": "",
    "titles": [
      "CNBC's The China Connection newsletter: New bets, old worries"
    ],
    "score_components": {
      "magnitude": 0.393,
      "recency": 0.963,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.468,
    "summary": "Concerns about slower economic growth in China are increasing, with data and social media discussions reflecting these worries. The country's economic performance and future outlook are being closely monitored by experts and the public.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 35 tokens",
    "image": {
      "src": "icons/china.svg",
      "thumbnail": "icons/china.svg",
      "alt": "china flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Hyperkin’s DualSense-inspired Xbox controller is finally launching this fall",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-08-20T03:30:00-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "www.theverge.com"
    ],
    "snippets": [
      "There’s good news if you’re an Xbox gamer who’s longingly stared at the sleeker design of Sony’s DualSense controller for the PlayStation 5. After revealing the final form of its Competitor gamepad at CES 2025, Hyperkin has announced it will be available sometime in October for $49.99 in black and w"
    ],
    "image_url": "",
    "titles": [
      "Hyperkin’s DualSense-inspired Xbox controller is finally launching this fall"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.987,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.465,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 11 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Complaint Alleges Alberta Energy Firms Misled on Net-Zero Goals",
    "domain": "business",
    "source_domain": "financialpost.com",
    "location": "national",
    "published": "Wed, 20 Aug 2025 04:05:54 +0000",
    "source": "Financial Post",
    "sources": [
      "Financial Post"
    ],
    "domains": [
      "financialpost.com"
    ],
    "snippets": [
      "A complaint filed with Alberta's market watchdog says the two energy companies misled investors over net-zero commitments"
    ],
    "image_url": "",
    "titles": [
      "Cenovus, Enbridge accused of ‘greenwashing’ under securities law in what may be a first for Canada"
    ],
    "score_components": {
      "magnitude": 0.393,
      "recency": 0.919,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.459,
    "summary": "A complaint has been filed with Alberta's market watchdog, alleging that two energy companies have misled investors about their commitments to achieving net-zero emissions. The complaint accuses the companies of not accurately representing their efforts or plans to reach net-zero goals, potentially misleading stakeholders about their environmental impact and sustainability practices.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 54 tokens",
    "image": {
      "src": "icons/briefcase.svg",
      "thumbnail": "icons/briefcase.svg",
      "alt": "business",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "\"Ghost\" Proteins Found in Long COVID Patients Offer New Insights",
    "domain": "science",
    "source_domain": "scitechdaily.com",
    "location": "global",
    "published": "Wed, 20 Aug 2025 04:30:43 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "scitechdaily.com"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/scientists-detect-ghost-proteins-that-could-explain-long-covid/\" rel=\"nofollow\" title=\"Scientists Detect “Ghost” Proteins That Could Explain Long COVID\"><img alt=\"Blood DNA Forming Inside Test Tube\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"http"
    ],
    "image_url": "",
    "titles": [
      "Scientists Detect “Ghost” Proteins That Could Explain Long COVID"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.927,
      "consensus": 0.35,
      "constructiveness": 0.059,
      "proximity": 0.5
    },
    "score": 0.459,
    "summary": "Scientists have identified \"ghost\" proteins in the blood of long COVID patients, potentially offering insight into the condition's underlying mechanisms. These proteins, not typically present in healthy individuals, could explain the persistent and diverse symptoms experienced by long COVID sufferers. This discovery opens new avenues for understanding and treating long COVID, marking a significant step forward in the ongoing research into the condition's effects and causes.",
    "constructiveness_score": 0.059,
    "constructiveness_reason": "1 constructive keywords out of 68 tokens",
    "image": {
      "src": "icons/beaker.svg",
      "thumbnail": "icons/beaker.svg",
      "alt": "science",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Scientists Struggle to Grasp Historical Biodiversity Changes",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Wed, 20 Aug 2025 02:01:47 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "phys.org"
    ],
    "snippets": [
      "Despite growing concern about biodiversity loss due to the ongoing biodiversity and climate crises, scientists have relatively little understanding of the pace and complexity of biodiversity change over the preceding millennia."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/exploring-long-term-co.jpg",
    "titles": [
      "Exploring long-term, complex biodiversity change in Scotland's landscapes"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.957,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.459,
    "summary": "Scientists are facing challenges in understanding the historical pace and complexity of biodiversity change despite concerns over current biodiversity and climate crises. This lack of knowledge hinders efforts to address the issue effectively.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 33 tokens",
    "image": {
      "src": "icons/beaker.svg",
      "thumbnail": "icons/beaker.svg",
      "alt": "science",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Genetic Mutation Found to Impair Lethal Cancers, May Lead to New Treatments",
    "domain": "science",
    "source_domain": "scitechdaily.com",
    "location": "global",
    "published": "Wed, 20 Aug 2025 04:05:37 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "scitechdaily.com"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/this-tiny-genetic-glitch-is-crippling-some-of-the-deadliest-cancers/\" rel=\"nofollow\" title=\"This Tiny Genetic Glitch Is Crippling Some of the Deadliest Cancers\"><img alt=\"Nanoparticles Destruction of Cancer Cell\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\""
    ],
    "image_url": "",
    "titles": [
      "This Tiny Genetic Glitch Is Crippling Some of the Deadliest Cancers"
    ],
    "score_components": {
      "magnitude": 0.393,
      "recency": 0.919,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.459,
    "summary": "Researchers have identified a small genetic mutation that significantly impairs some of the most lethal cancers. This discovery, highlighted in the study published on SciTechDaily, could pave the way for new treatments targeting these mutations, offering hope for improved cancer therapy outcomes.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 42 tokens",
    "image": {
      "src": "icons/beaker.svg",
      "thumbnail": "icons/beaker.svg",
      "alt": "science",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "30-Year Study Links French Fries to Higher Diabetes Risk",
    "domain": "science",
    "source_domain": "scitechdaily.com",
    "location": "global",
    "published": "Wed, 20 Aug 2025 03:40:05 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "scitechdaily.com"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/what-a-30-year-study-just-found-about-your-french-fries-and-diabetes/\" rel=\"nofollow\" title=\"What a 30-Year Study Just Found About Your French Fries and Diabetes\"><img alt=\"French Fries Salt\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"437\" src=\"https://sci"
    ],
    "image_url": "",
    "titles": [
      "What a 30-Year Study Just Found About Your French Fries and Diabetes"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.911,
      "consensus": 0.35,
      "constructiveness": 0.063,
      "proximity": 0.5
    },
    "score": 0.457,
    "summary": "A 30-year study has found a link between the consumption of French fries and an increased risk of developing diabetes. The research, which tracked dietary habits and health outcomes over three decades, indicates that regular intake of French fries contributes to a higher likelihood of this condition. This study emphasizes the importance of dietary choices in the prevention and management of diabetes.",
    "constructiveness_score": 0.063,
    "constructiveness_reason": "1 constructive keywords out of 63 tokens",
    "image": {
      "src": "icons/france.svg",
      "thumbnail": "icons/france.svg",
      "alt": "french flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Investors Accuse Cenovus, Enbridge of Overstating Net Zero Efforts",
    "domain": "business",
    "source_domain": "financialpost.com",
    "location": "national",
    "published": "Wed, 20 Aug 2025 04:45:15 +0000",
    "source": "Financial Post",
    "sources": [
      "Financial Post"
    ],
    "domains": [
      "financialpost.com"
    ],
    "snippets": [
      "The group Investors for Paris Compliance has accused Cenovus and Enbridge of overstating their efforts to reach net zero."
    ],
    "image_url": "",
    "titles": [
      "Greenwashing Complaint Filed Against Canadian Fossil Fuel Companies"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.932,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.454,
    "summary": "Investors for Paris Compliance accused Cenovus and Enbridge of overstating their net zero efforts. The group claims the companies' plans lack transparency and ambition. Cenovus and Enbridge have defended their commitments, stating they align with climate goals. The outcome of the accusations is pending further investigation and response from the companies.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 51 tokens",
    "image": {
      "src": "icons/briefcase.svg",
      "thumbnail": "icons/briefcase.svg",
      "alt": "business",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Scientists Unravel Mystery of Blazar's Neutrino Emissions with VLBA Imaging",
    "domain": "science",
    "source_domain": "www.sciencedaily.com",
    "location": "global",
    "published": "Tue, 19 Aug 2025 23:38:34 EDT",
    "source": "ScienceDaily",
    "sources": [
      "ScienceDaily"
    ],
    "domains": [
      "www.sciencedaily.com"
    ],
    "snippets": [
      "A mysterious blazar that baffled scientists for years has been unraveled. VLBA imaging revealed a toroidal magnetic field powering a jet aimed at Earth, explaining how it can unleash neutrinos and gamma rays despite its sluggish appearance."
    ],
    "image_url": "",
    "titles": [
      "Astronomers discover a hidden engine inside space’s “Eye of Sauron”"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.911,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.45,
    "summary": "Scientists have solved the mystery of a blazar, previously puzzling due to its seemingly sluggish nature, by using VLBA imaging. They discovered a toroidal magnetic field is driving a jet directly at Earth, enabling the blazar to emit neutrinos and gamma rays. This finding clarifies how the blazar functions despite its deceptive appearance.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 53 tokens",
    "image": {
      "src": "icons/beaker.svg",
      "thumbnail": "icons/beaker.svg",
      "alt": "science",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Deel scores a lawsuit win, but not against Rippling",
    "domain": "technology",
    "source_domain": "techcrunch.com",
    "location": "global",
    "published": "Tue, 19 Aug 2025 22:47:51 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com"
    ],
    "snippets": [
      "While Deel is calling this a \"Rippling-aligned\" suit, it's not the lawsuit filed by Rippling involving an alleged corporate spy."
    ],
    "image_url": "",
    "titles": [
      "Deel scores a lawsuit win, but not against Rippling"
    ],
    "score_components": {
      "magnitude": 0.413,
      "recency": 0.823,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.447,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 9 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Top pediatricians buck RFK Jr.’s anti-vaccine meddling on COVID shot guidance",
    "domain": "technology",
    "source_domain": "arstechnica.com",
    "location": "global",
    "published": "Tue, 19 Aug 2025 22:39:36 +0000",
    "source": "Ars Technica",
    "sources": [
      "Ars Technica"
    ],
    "domains": [
      "arstechnica.com"
    ],
    "snippets": [
      "The American Academy of Pediatrics recommends children under age 2 get vaccinated."
    ],
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2021/10/GettyImages-1232871329-1152x648.jpeg",
    "titles": [
      "Top pediatricians buck RFK Jr.’s anti-vaccine meddling on COVID shot guidance"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.821,
      "consensus": 0.35,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.432,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 13 tokens",
    "image": {
      "src": "icons/beaker.svg",
      "thumbnail": "icons/beaker.svg",
      "alt": "vaccine",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  }
]