[
  {
    "title": "Florida Lawmakers to Vote on Ending School Vaccine Mandates",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Wed, 03 Sep 2025 15:16:08 -0400",
    "source": "NPR",
    "sources": [
      "Ars Technica",
      "The Guardian",
      "NPR",
      "CNBC",
      "Al Jazeera"
    ],
    "domains": [
      "arstechnica.com",
      "www.aljazeera.com",
      "www.npr.org",
      "www.theguardian.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "Florida lawmakers will vote whether to repeal a law that requires children to receive vaccines for polio, diphtheria, measles, and mumps before entering school.",
      "Critics warn Florida&#039;s plan to scrap vaccine mandates risks public health, calling it a &#039;disaster in the making&#039;.",
      "The move would make Florida the first U.S. state to withdraw from mandates credited with boosting vaccination rates and preventing infectious disease outbreaks.",
      "<p>Joseph Ladapo, a long-time vaccine skeptic, says that every state vaccine requirement would be repealed</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/live/2025/sep/03/donald-trump-immigration-tariffs-epstein-us-politics-live-news-updates\">US politics live – latest updates</a></p></li",
      "Exposing vulnerable people to vaccine-preventable disease is just part of life, Ladapo said."
    ],
    "image_url": "",
    "titles": [
      "Florida working to end vaccine mandates",
      "Florida top doctor pushes end to vaccine mandates, likens them to ‘slavery’",
      "Florida to become first state to end all vaccine mandates, including in schools",
      "Florida to end vaccine mandates for children as state’s surgeon general likens them to ‘slavery’",
      "In win for infectious diseases, Florida to end all school vaccine requirements"
    ],
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.902,
      "consensus": 0.995,
      "constructiveness": 0.2,
      "proximity": 0.75
    },
    "score": 0.855,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Florida lawmakers are set to vote on repealing a law mandating vaccines for schoolchildren against diseases like polio and measles. Critics label the plan a public health risk, while Florida could become the first state to eliminate such mandates. Joseph Ladapo, known for his vaccine skepticism, supports the repeal, stating exposure to vaccine-preventable diseases is a part of life.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: plan, support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Lisbon Funicular Derailment Kills 15, Injures 18 in Tragic Accident",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 03 Sep 2025 21:52:01 GMT",
    "source": "BBC",
    "sources": [
      "Washington Post",
      "The Guardian",
      "New York Times",
      "Deutsche Welle",
      "BBC",
      "Al Jazeera"
    ],
    "domains": [
      "www.dw.com",
      "www.aljazeera.com",
      "www.bbc.com",
      "www.washingtonpost.com",
      "www.theguardian.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "Lisbon's mayor says the capital is in mourning, adding it was a \"tragic moment for the city\".",
      "Crash of the historic Elevador da Gloria funicular is one of Lisbon’s deadliest transport accidents in years.",
      "At least 15 people were killed and 18 more were injured when a funicular derailed in the Portuguese capital.",
      "<p>Mayor of Lisbon speaks of ‘tragic day’, as government declares day of mourning for Thursday</p><p>At least 15 people have been killed after Lisbon’s Gloria funicular railway car derailed and crashed on Wednesday, an emergency medical service spokesperson has said.</p><p>Authorities said some fore",
      "Lisbon’s funiculars — a type of cable car running on rails up and down a steep slope — are a popular tourist destination in the city.",
      "The funicular line, one of three in Lisbon, is a popular tourist attraction."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/7884/live/2428b480-8903-11f0-9cf6-cbf3e73ce2b9.jpg",
    "titles": [
      "At least 15 dead after Lisbon's historic funicular derails",
      "At least 15 killed as funicular railcar derails in Portugal’s Lisbon",
      "Portugal: At least 15 dead in Lisbon funicular accident",
      "At least 15 people killed after funicular railway in Lisbon derails",
      "15 killed, 18 injured after Lisbon’s popular Glória funicular derails",
      "At Least 15 Dead After Lisbon Funicular Derails and Crashes, Officials Say"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.933,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.837,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A funicular derailment in Lisbon resulted in at least 15 deaths and 18 injuries, marking one of the city's deadliest transport accidents in years. The incident involved the historic Elevador da Gloria, a popular tourist attraction. Lisbon's mayor declared it a tragic moment for the city, and a day of mourning has been announced.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Judge Rules Trump Admin Unlawfully Froze Harvard Grants; White House to Appeal",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Wed, 03 Sep 2025 19:52:10 -0400",
    "source": "NPR",
    "sources": [
      "Forbes",
      "NPR",
      "CNBC",
      "BBC"
    ],
    "domains": [
      "www.cnbc.com",
      "www.npr.org",
      "www.forbes.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The ruling is a legal victory for Harvard but the White House says it will appeal the decision.",
      "A judge ruled the government violated the Ivy League college's free speech rights when it froze $2.6bn.",
      "The Trump administration in April froze grants to Harvard University over concerns about antisemitism on the Ivy League campus and other concerns.",
      "Harvard is the only prestigious university that has sued over antisemitism allegations lobbed by the Trump administration after on-campus pro-Palestinian protests in 2024."
    ],
    "image_url": "",
    "titles": [
      "Trump administration illegally froze billions in Harvard funds, judge rules",
      "Judge overturns Trump administration funding cuts to Harvard",
      "Judge voids $2.2 billion Harvard funding freeze by Trump administration",
      "Trump Administration’s $2.2 Billion Harvard Funding Freeze Ruled Unconstitutional"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.993,
      "consensus": 0.908,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.83,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A judge ruled that the Trump administration unlawfully violated Harvard University's free speech rights by freezing $2.6 billion in grants due to concerns over antisemitism and other issues. This decision marks a legal win for Harvard, which is the only Ivy League school to sue the administration following allegations of antisemitism after pro-Palestinian protests on campus. However, the White House has announced plans to appeal the ruling.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Anisimova Defeats Swiatek in US Open Quarters, Advances to Semis",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 03 Sep 2025 22:40:26 GMT",
    "source": "BBC",
    "sources": [
      "Sportsnet",
      "The Guardian",
      "ESPN",
      "Sky Sports",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.sportsnet.ca",
      "www.theguardian.com",
      "www.espn.com",
      "www.skysports.com"
    ],
    "snippets": [
      "Amanda Anisimova avenges her Wimbledon final loss to Iga Swiatek with a stunning performance to beat the second seed and reach the US Open semi-finals.",
      "Amanda Anisimova upset Iga Swiatek 6-4, 6-3 in the US Open quarterfinals Wednesday, less than two months after losing to the six-time Grand Slam champion in the Wimbledon final by a 6-0, 6-0 score.",
      "<ul><li><p>American beats Polish rival 6-4, 6-3 to make semi-finals</p></li><li><p>Meeting with Karolina Muchova or Naomi Osaka up next</p></li></ul><p>Amanda Anisimova conjured the performance of her career on Wednesday afternoon in New York, banishing the ghosts of her Wimbledon nightmare with a s",
      "Amanda Anisimova stunned Iga Swiatek to avenge her Wimbledon final defeat and book a place in the semi-finals of the US Open.",
      "<p>Amanda Anisimova upset Iga Swiatek 6-4, 6-3 in the US Open quarterfinals Wednesday, less than two months after losing to the six-time Grand Slam champion in the Wimbledon final by a 6-0, 6-0 score.</p>"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/32c5/live/3421b900-8911-11f0-9cf6-cbf3e73ce2b9.jpg",
    "titles": [
      "Anisimova stuns Swiatek to avenge heavy Wimbledon final defeat",
      "Anisimova avenges Wimbledon loss, stuns Swiatek",
      "Anisimova gains revenge for Wimbledon by beating Swiatek to make US Open last four",
      "Anisimova stuns Swiatek to avenge Wimbledon final humiliation",
      "Anisimova upsets Swiatek in US Open quarterfinals to avenge Wimbledon loss"
    ],
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.949,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.819,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Amanda Anisimova defeated Iga Swiatek 6-4, 6-3 in the US Open quarterfinals, avenging her Wimbledon final loss to Swiatek. This victory marks a significant turnaround for Anisimova, who had previously been defeated 6-0, 6-0 by Swiatek at Wimbledon. Anisimova's win secures her a spot in the US Open semi-finals, where she will face either Karolina Muchova or Naomi Osaka.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Putin, Xi Discuss Immortality Through Organ Transplants in Leaked Chat",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 03 Sep 2025 16:51:50 GMT",
    "source": "BBC",
    "sources": [
      "Financial Times",
      "Ars Technica",
      "The Guardian",
      "New York Times",
      "BBC"
    ],
    "domains": [
      "arstechnica.com",
      "www.bbc.com",
      "www.theguardian.com",
      "www.ft.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "The Chinese and Russian leaders have been in power for 13 and 25 years respectively, with neither expressing any intention of stepping down.",
      "Chinese premier noted predictions that humans could live to 150 in this century",
      "<p>Live footage of private conversation between Russian president and Chinese leader aired at Beijing military parade</p><p>The authoritarian strongmen Vladimir Putin and Xi Jinping have mused on how organ transplants might lead to immortality, during a brief exchange of small talk caught on a hot m",
      "Medical advances and geopolitics collide for two septuagenarian leaders who have suggested that their time in office is far from over.",
      "What do warmongers and strongmen chat about? Living forever, of course."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/3c95/live/c9b9a960-88ed-11f0-9cf6-cbf3e73ce2b9.jpg",
    "titles": [
      "Hot mic catches Xi and Putin discussing organ transplants and immortality",
      "Putin tells Xi organ transplants could offer immortality",
      "Hot mic catches Putin and Xi discussing organ transplants and immortality",
      "In a ‘Hot Mic’ Moment, Xi and Putin Muse About Immortality and Organ Transplants",
      "Putin: “Immortality” coming soon through continuous organ transplants"
    ],
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.841,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.797,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "During a Beijing military parade, a live broadcast captured a private conversation between Russian President Vladimir Putin and Chinese Premier Xi Jinping, who have been in power for 25 and 13 years respectively. They speculated on the possibility of living forever through organ transplants, amidst discussions on medical advances and their prolonged tenures in office. This exchange highlights their interest in immortality and suggests their intention to remain in power indefinitely.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Rayner Refers Herself to Ethics Adviser Over £800K Tax Error",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 03 Sep 2025 21:10:28 GMT",
    "source": "BBC",
    "sources": [
      "Al Jazeera",
      "New York Times",
      "Financial Times",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.aljazeera.com",
      "www.bbc.co.uk",
      "www.ft.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "The deputy prime minister says she has referred herself for an ethics probe by the PM's adviser.",
      "How did the housing secretary pay the wrong amount of stamp duty?",
      "Angela Rayner denies she wanted to dodge the extra tax, adding that she made a &#039;mistake&#039; following legal advice.",
      "Labour politician refers herself to government’s ethics adviser over £800,000 Hove flat",
      "Angela Rayner, the deputy to Prime Minister Keir Starmer, said the property tax underpayment was a mistake related to care arrangements for her disabled son."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/8699/live/79ceb060-88cc-11f0-9cf6-cbf3e73ce2b9.png",
    "titles": [
      "Rayner admits underpaying tax on £800,000 Hove flat as Starmer backs her",
      "Angela Rayner Admits Underpaying Tax",
      "UK deputy PM admits underpaying tax as opposition seeks her dismissal",
      "UK deputy prime minister Angela Rayner admits underpaying tax",
      "Angela Rayner, UK’s Deputy Prime Minister, Admits Underpaying Tax"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.92,
      "consensus": 0.928,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.778,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Angela Rayner, Deputy Prime Minister under Keir Starmer, has referred herself to the government's ethics adviser due to an £800,000 underpayment in property tax for a Hove flat, attributing the mistake to care arrangements for her disabled son. This action puts her position at risk, as confirmed by her public statement.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "American Eagle Sees Surge in Sales, Credits Sweeney and Kelce Campaigns",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Wed, 03 Sep 2025 20:19:18 GMT",
    "source": "CNBC",
    "sources": [
      "Business Insider",
      "MarketWatch",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "www.marketwatch.com",
      "www.businessinsider.com"
    ],
    "snippets": [
      "American Eagle said its Sydney Sweeney campaign is its best ever, leading to positive gains in new customers, sales and foot traffic.",
      "American Eagle stock surged as the company reported that Sydney Sweeney's jeans campaign and Travis Kelce's new collection were successes.",
      "Shares of American Eagle soared on Wednesday after the clothing retailer forecast same-store sales that were better than expected, and said recent promotional campaigns starring actress Sydney Sweeney and NFL player Travis Kelce had boosted fall-season demand."
    ],
    "image_url": "",
    "titles": [
      "American Eagle stock soars 20% as retailer says Sydney Sweeney campaign is 'best' to date, beats earnings",
      "American Eagle's stock is soaring as Sydney Sweeney and Travis Kelce's star power jolts sales",
      "American Eagle says Sydney Sweeney ad campaign ‘is not going anywhere’ after uptick in demand"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.903,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.759,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "American Eagle reported significant positive impacts from its promotional campaigns featuring Sydney Sweeney and Travis Kelce, including an increase in new customers, sales, and foot traffic. The company's stock surged following the announcement of better-than-expected same-store sales forecasts, attributed to the successful marketing efforts.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Israel Plans to Annex West Bank Lands, Excludes Major Palestinian Cities",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 03 Sep 2025 23:37:50 GMT",
    "source": "BBC",
    "sources": [
      "Financial Times",
      "New York Times",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.ft.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "The warning came after a far-right Israeli minister unveiled a proposal for the annexation of four-fifths of the occupied territory.",
      "Emirati foreign ministry’s warning is strongest sign of frustration with Israel since accords signed in 2020",
      "Bezalel Smotrich said Israel should take over most of the territory, partly in response to growing international moves to recognize a Palestinian state."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/34ef/live/5abf8120-890f-11f0-9cf6-cbf3e73ce2b9.jpg",
    "titles": [
      "UAE warns Israel that annexing West Bank would cross 'red line'",
      "Israeli annexation of the West Bank would be ‘red line’ for UAE",
      "Far-right Israeli Minister Calls for West Bank Annexation"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.968,
      "consensus": 0.789,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.757,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Israeli Finance Minister Bezalel Smotrich announced plans for Israel to annex \"maximum territory\" in the West Bank, excluding six large Palestinian cities. This move is partly in response to international efforts recognizing a Palestinian state. Smotrich revealed these plans at a press conference in Jerusalem, showcasing a map of the proposed annexations.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: effort, plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Judge Rules Trump Admin Unlawfully Cut $2.2B Funding to Harvard",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Wed, 03 Sep 2025 23:14:13 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Deutsche Welle",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.aljazeera.com",
      "www.dw.com"
    ],
    "snippets": [
      "The decision is a victory for the Ivy League university, which has been locked in a months-long feud with Trump.",
      "Harvard has scored a legal victory against the White House as a federal judge overturned the Trump administration's decision to cut the university's funding by billions of dollars.",
      "<p>Decision marks major victory for school after White House accused it of not addressing harassment of Jewish students</p><p>A federal judge on Wednesday ruled Donald <a href=\"https://www.theguardian.com/us-news/trump-administration\">Trump’s administration</a> unlawfully terminated about $2.2bn in "
    ],
    "image_url": "",
    "titles": [
      "US judge rules Trump unlawfully cut Harvard University research grants",
      "US judge rules Trump unlawfully canceled Harvard's grants",
      "Trump unlawfully cancelled $2.2bn in Harvard research grants, judge rules"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.98,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.75,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A federal judge ruled that the Trump administration unlawfully terminated approximately $2.2 billion in funding to Harvard University, marking a significant legal victory for the institution. This decision comes after a prolonged dispute, where the White House accused Harvard of failing to address harassment of Jewish students. The ruling overturns the administration's funding cut, supporting Harvard's stance in the feud.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Newsmax Sues Fox News for Antitrust, Alleges Monopoly in Conservative Market",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Wed, 03 Sep 2025 14:14:43 -0400",
    "source": "NPR",
    "sources": [
      "Business Insider",
      "NPR",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "www.npr.org",
      "www.businessinsider.com"
    ],
    "snippets": [
      "Right-wing TV news outlet Newsmax sued Fox News on antitrust grounds, alleging the conservative media powerhouse had illegally sought to suppress its smaller rival's growth in cable news.",
      "Newsmax filed a lawsuit accusing conservative news giant Fox News of suppressing its right-leaning competitors.",
      "In a new antitrust lawsuit, Newsmax accuses Fox Corp. and its Fox News network of holding a monopoly in the \"right-leaning pay TV news market.\""
    ],
    "image_url": "",
    "titles": [
      "In a brawl over right-wing TV, Newsmax sues Fox News",
      "Newsmax sues Fox News for allegedly abusing monopoly power",
      "Newsmax hits Fox News with an antitrust lawsuit, accusing it of hogging the right-wing market"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.883,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.738,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Newsmax has filed an antitrust lawsuit against Fox News, accusing the larger conservative network of illegally trying to suppress its growth in the right-leaning cable news market. The suit claims Fox News is maintaining a monopoly in this sector.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Deputy PM Rayner Admits to Stamp Duty Error, Faces Ethics Review",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 03 Sep 2025 23:14:23 GMT",
    "source": "BBC",
    "sources": [
      "Financial Times",
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com",
      "www.ft.com"
    ],
    "snippets": [
      "Angela Rayner's admission that she underpaid stamp duty on her flat in Hove dominates Thursday's papers.",
      "Deputy prime minister faces hefty stamp duty bill as she waits for government ethics adviser to rule on affair",
      "<p>Deputy prime minister expresses regret over mistake that led to underpayment of stamp duty on £800,000 flat</p><p>Angela Rayner is battling for her political survival after she admitted underpaying stamp duty on her £800,000 seaside flat and referred herself to the ministerial ethics adviser afte"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/b50e/live/134310d0-891b-11f0-b391-6936825093bd.jpg",
    "titles": [
      "Rayner 'clings on' as she 'fights for political survival'",
      "Angela Rayner fights for political survival after property tax admission",
      "Rayner battling for political survival after referring herself to ethics adviser"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.96,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.729,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Angela Rayner, the Deputy Prime Minister, admitted to underpaying stamp duty on her £800,000 flat in Hove and has referred herself to the government's ethics adviser. She expressed regret over the mistake and now faces a hefty bill. The affair dominates headlines as Rayner battles for her political survival.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Ottawa Senators Unveil New Red Third Jersey for Select Games",
    "domain": "sports",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Wed, 03 Sep 2025 21:33:15 GMT",
    "source": "NHL",
    "sources": [
      "NHL",
      "Sportsnet",
      "Ottawa Citizen"
    ],
    "domains": [
      "ottawacitizen.com",
      "news.google.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMickFVX3lxTE1jZDd1UVhfcnNreWZ1REptWjN6YzlPTFVmek9keGQtaUFMSVF4LXJOMEhYbHp5T1pRdDBhU21PUnN4WWtOZUVacHpkNW9KZ1hkZm10cmFuN1B1V01oUUdOVlJIa1RQaFhmMG5IdzJyVXpMZw?oc=5\" target=\"_blank\">Senators unveil red third jerseys for this season</a>&nbsp;&nbsp;<font co",
      "<p>The Ottawa Senators will have a new look for select games this season.</p>",
      "The Ottawa Senators have returned to red. The Senators finally unveiled their much-anticipated third jersey on Wednesday during Media Day at the Canadian Tire Centre and fans are pleased by the club&#8217;s new look. The red-themed hockey sweater also has gold and black trim. There is a logo with th"
    ],
    "image_url": "",
    "titles": [
      "Senators unveil red third jerseys for this season - NHL.com",
      "Senators announce new red third jersey for 2025-26 season",
      "Ottawa Senators unveil new fiery third jersey for 2025-26 NHL season"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.927,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.729,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Ottawa Senators introduced a new red third jersey with gold and black trim, featuring a logo, during Media Day at the Canadian Tire Centre. This addition to their attire will be worn in select games this season, receiving positive feedback from fans.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "SportsLine Expert Advises on Week 2 College Football, Highlights Michigan-Oklaho",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Wed, 3 Sep 2025 09:32:59 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "Yahoo Sports",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com",
      "www.nbcsports.com"
    ],
    "snippets": [
      "This week's odds and FPI predictions for Michigan-Oklahoma and every Top 25 matchup.",
      "SportsLine CFB expert Thomas Casale breaks down which Week 2 college football bets you should place now, and which you should wait and see",
      "No. 15 Michigan at No. 18 Oklahoma haven’t met since the Orange Bowl following the 1975 season."
    ],
    "image_url": "",
    "titles": [
      "College football betting lines: Michigan heads to Oklahoma in ranked showdown",
      "College football Week 2 betting: Expert shares bets to make now or to wait on, including Michigan vs. Oklahoma",
      "College football Week 2: No. 15 Michigan visits No. 18 Oklahoma in matchup of storied programs"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.801,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.722,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "This week, SportsLine CFB expert Thomas Casale provided betting advice for Week 2 college football, including the Top 25 matchups. Notably, the game between No. 15 Michigan and No. 18 Oklahoma is highlighted, marking their first meeting since the 1975 Orange Bowl.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Auger-Aliassime Beats de Minaur to Reach US Open Semifinals",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 03 Sep 2025 21:17:52 GMT",
    "source": "BBC",
    "sources": [
      "Sportsnet",
      "CityNews",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.sportsnet.ca",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "Felix Auger-Aliassime deals further Grand Slam quarter-final heartbreak to Alex de Minaur with a battling victory to reach the US Open last four.",
      "<p>The Canadian knocked off No. 8 seed Alex de Minaur of Australia 4-6, 7-6, 7-5, 7-6 to reach the semifinals of the Grand Slam tournament. </p>",
      "<p>Canada&#8217;s Felix Auger-Aliassime explains his mentality to persevere through a long match against Alex de Minaur and his focus on preparing for the US Open semifinals. </p>",
      "<p>Watch as Canada&#8217;s Felix Auger-Aliassime defeats Australia&#8217;s Alex de Minaur after a four-hour bout to advance to the US Open semifinals.</p>",
      "Félix Auger-Aliassime has passed another big test at the US Open. The Canadian knocked off No. 8 seed Alex de Minaur of Australia 4-6, 7-6 (7), 7-5, 7-6 (4) to reach the semifinal of the Grand Slam tournament. It is the first time since 2021 that Auger-Aliassime, who improved to 3-1 against de Minau"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/96ca/live/419ed1c0-8903-11f0-8f95-05be11896326.jpg",
    "titles": [
      "'It wasn't pretty' - Auger-Aliassime digs deep to reach US Open semis",
      "Canada’s Auger-Aliassime rallies in final set to seal US Open semifinal appearance",
      "‘It’s not over’: Canada’s Auger-Aliassime focused on US Open semifinals",
      "Auger-Aliassime upsets de Minaur to advance to US Open semifinals",
      "Canada’s Félix Auger-Aliassime punches ticket to US Open semifinal"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.922,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.721,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Félix Auger-Aliassime defeated No. 8 seed Alex de Minaur 4-6, 7-6, 7-5, 7-6 to reach the US Open semifinals after a four-hour match. This victory marks Auger-Aliassime's advancement to his first Grand Slam semifinal since 2021, improving his head-to-head record against de Minaur to 3-1.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "NFL's Goodell Open to Taylor Swift Super Bowl Show, No Talks Confirmed",
    "domain": "sports",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Wed, 03 Sep 2025 14:26:32 GMT",
    "source": "Axios",
    "sources": [
      "Sportsnet",
      "Axios",
      "Sky Sports"
    ],
    "domains": [
      "news.google.com",
      "www.sportsnet.ca",
      "www.skysports.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMigAFBVV95cUxQRWszbkRXT2VqTHRSV2F4a215WmktenVNVjZMa211STlRNEpveEw5X2JJdnRhbjR4VE81R0d3eUZhakdyVWM2dGtqMy1WQkczSGtoLXdvbTlWaF9maXB6Z195VUhQZEZ0MlVZbjA0ano3Ri1NaWpzeTZ2VWs4clVaYw?oc=5\" target=\"_blank\">Taylor Swift Super Bowl halftime not ruled out by NFL",
      "The tantalising prospect of Taylor Swift performing at the Super Bowl half-time show in February is a 'maybe', according to NFL commissioner Roger Goodell.",
      "<p>Appearing on the TODAY show Wednesday morning, NFL commissioner Roger Goodell addressed the possibility of pop star Taylor Swift performing the halftime show at Super Bowl LX.</p>"
    ],
    "image_url": "",
    "titles": [
      "Taylor Swift Super Bowl halftime not ruled out by NFL commissioner - Axios",
      "Taylor Swift to play Super Bowl show? NFL commissioner says 'maybe'",
      "Goodell says Taylor Swift performing Super Bowl halftime show a ‘maybe’"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.799,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.697,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "NFL Commissioner Roger Goodell did not confirm any official discussions regarding Taylor Swift performing at the Super Bowl halftime show but expressed that the NFL would be thrilled to have her. Despite the lack of confirmation, fan speculation is high, with some pointing to cryptic references in Swift's work as hints she might be the next performer.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Giants' Chapman Suspended, Adames and Devers Fined After On-Field Altercation",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Wed, 3 Sep 2025 19:31:23 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Giants third baseman Matt Chapman has been suspended one game for pushing Rockies pitcher Kyle Freeland, while Freeland and San Francisco's Willy Adames and Rafael Devers also were fined.",
      "Devers had to wait until after the fight to finish his home run trot"
    ],
    "image_url": "",
    "titles": [
      "Chapman suspended for Giants-Rockies scuffle",
      "Matt Chapman suspended, Kyle Freeland, others fined over Giants-Rockies brawl following Rafael Devers home run"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.986,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.677,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Matt Chapman, Giants third baseman, received a one-game suspension for pushing Rockies pitcher Kyle Freeland. Additionally, Willy Adames and Rafael Devers, both from San Francisco, were fined for their involvement in the incident. Following the altercation, Rafael Devers completed his home run trot.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Red Sox Rookie Roman Anthony on Injured List with Oblique Tightness",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Wed, 3 Sep 2025 19:31:24 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "The Red Sox put rookie sensation Roman Anthony on the injured list Wednesday after the outfielder experienced left oblique tightness in Tuesday's win over the Cleveland Guardians.",
      "<p>The Boston Red Sox will be without one of their emerging stars for the stretch run. </p>"
    ],
    "image_url": "",
    "titles": [
      "Red Sox's Anthony likely out for regular season",
      "Red Sox’s Roman Anthony expected to miss rest of regular season with oblique injury"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.986,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.677,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Boston Red Sox placed rookie outfielder Roman Anthony on the injured list due to left oblique tightness experienced during Tuesday's victory over the Cleveland Guardians. This move sidelines one of the team's rising stars as they approach the season's critical final games.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Clippers Investigated for Alleged $28M Salary Cap Breach with Leonard",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Wed, 3 Sep 2025 19:31:24 EST",
    "source": "ESPN",
    "sources": [
      "Sports Illustrated",
      "ESPN"
    ],
    "domains": [
      "news.google.com",
      "www.espn.com"
    ],
    "snippets": [
      "The Clippers reportedly have been accused of circumventing the NBA's salary cap by paying $28 million to Kawhi Leonard for a \"no-show job.\"",
      "<a href=\"https://news.google.com/rss/articles/CBMidkFVX3lxTE5zQmQ1S3A3Wk12S2o1dzliWktlRUZIaldSWTVzT2I2NzV5WFNQTk1CRjNWNm9ZbTRiMUd5YjAtT0dLYWE4REw4RFpqWHBoOTk2TjBJczRLNmZFYWZOYi1Dc0VDS1JvRFlkN0JhaDlzTWhUUUZoSEE?oc=5\" target=\"_blank\">Breaking Down Clippers’ Potential Punishments Over Kawhi Leonard Sal",
      "<a href=\"https://news.google.com/rss/articles/CBMiekFVX3lxTE5OWVUwcC1sSHFwVU5tMzVyUHg4dUpwc1RjOXZVa3Y5emdVTU9rR1BPS3RabHJZNXZzUUtTSHF0WDAyZkpxbXRsMkxzRWtZVVlwUUFoZWYza3FDTFFhV1puTE9hcV9MR2kyZXhaVFdCWm44aHQ2Szg5QnZn?oc=5\" target=\"_blank\">Report: Clippers, Kawhi Leonard Used Fraudulent Tree Company to",
      "<a href=\"https://news.google.com/rss/articles/CBMimgFBVV95cUxNNkZCRjMzaTdlRnFoWEQwZTVRZS10Y2ZZTzJaRHUzOXRQcmg2VVZ3aGhHazljV0dIMVBYdHF0ZUw2YnZxcVB0YXRtenJSWDJ0T0NGcTVleGlUa0hvWUh4VWtuOUtnTjdWRnNuUzdYS3FVNG5XNHdILTFiQmliYU1ndm11UjNQaWFvbEVZUi1xSXZtcEdXNzltUnFB?oc=5\" target=\"_blank\">Stephen A. Smith Ri"
    ],
    "image_url": "",
    "titles": [
      "Report: Clippers skirted cap with Kawhi payment",
      "Breaking Down Clippers’ Potential Punishments Over Kawhi Leonard Salary Cap Report - Sports Illustrated",
      "Report: Clippers, Kawhi Leonard Used Fraudulent Tree Company to Circumvent Salary Cap - Sports Illustrated",
      "Stephen A. Smith Rips Kawhi Leonard Over No-Show Tree Company Job Report - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.986,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.677,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Los Angeles Clippers are under investigation for allegedly circumventing the NBA's salary cap rules by providing Kawhi Leonard with a $28 million payment for a \"no-show job.\" Reports suggest the involvement of a fraudulent tree company in the scheme. The current status of the investigation and potential punishments for the Clippers and Leonard remain under review by the NBA.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "China Marks WWII Anniversary with Military Parade, Showcases New Missile",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Wed, 03 Sep 2025 04:52:30 GMT",
    "source": "Axios",
    "sources": [
      "Washington Post",
      "Axios",
      "New York Times"
    ],
    "domains": [
      "news.google.com",
      "www.washingtonpost.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMif0FVX3lxTFByYkJtMVo1Rko5TWlueXY1VDIxY2JNS0ZKQUNibU9fSHlJQU1kNHlHUWNvNjVMM2stVHpUNHI4YnN1aGdMR1ZjUkxuR2ZQLTRNZUVnT09peWc1Q1ZUZlU3WG5SaDVZeEpoalEyeHdxMDNyeWRjYkZydjUxT2FaRFE?oc=5\" target=\"_blank\">Photos: Xi, flanked by Putin and Kim, hosts China's larg",
      "As Xi Jinping declared China as a nation “never intimidated by bullies,” President Trump urged him to acknowledge the United States’ support in winning World War II.",
      "China used a parade of fighter jets, missiles and goose-stepping troops to honor the country’s wartime sacrifice and issue a defiant warning to rivals."
    ],
    "image_url": "",
    "titles": [
      "Photos: Xi, flanked by Putin and Kim, hosts China's largest-ever military parade - Axios",
      "China’s Xi, flanked by Putin and Kim, shows off ‘new generation’ weapons",
      "China’s Military Parade, in Photos: Xi Unveils New Weapons Alongside Putin and Kim"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.655,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.675,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "China held a significant military parade in Tiananmen Square, Beijing, commemorating 80 years since Japan's WWII surrender, attended by President Xi Jinping, North Korea's Kim Jong Un, and Russia's Vladimir Putin. This marked the first public appearance together for the three leaders. The event showcased China's military capabilities, including the unveiling of the DF-5C intercontinental strategic nuclear missile. The parade served both as a remembrance of wartime sacrifices and a demonstration of China's growing military strength.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Speaker, WH Oppose Bipartisan Push for Epstein Files; Trump Faces Pressure",
    "domain": "business",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Wed, 03 Sep 2025 17:19:48 -0400",
    "source": "ABC News",
    "sources": [
      "ABC News",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "abcnews.go.com"
    ],
    "snippets": [
      "Speaker Mike Johnson and the White House are opposing a bipartisan push to compel the DOJ to release all the files related to Jeffrey Epstein.",
      "President Donald Trump faces growing calls in Congress to release the Epstein files, which related to his former friend Jeffrey Epstein and Ghislaine Maxwell."
    ],
    "image_url": "https://s.abcnews.com/images/Politics/trump-nawrocki-08-gty-jef-250903_1756915869799_hpMain_4x3t_384.jpg",
    "titles": [
      "Trump calls Epstein files 'irrelevant' as Massie petition picks up steam",
      "Trump calls Epstein files a distraction from his success as victims call for their release"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.942,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.66,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Speaker Mike Johnson and the White House are opposing a bipartisan effort in Congress urging the DOJ to release all files related to Jeffrey Epstein. Meanwhile, President Donald Trump is facing increasing demands from lawmakers to disclose the Epstein documents, which concern his former associate Jeffrey Epstein and Ghislaine Maxwell.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "TUC Chief Urges Chancellor to Consider Taxes on Banks, Gambling in Budget",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Wed, 03 Sep 2025 23:48:04 GMT",
    "source": "BBC",
    "sources": [
      "Financial Times",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.ft.com"
    ],
    "snippets": [
      "TUC boss Paul Nowak says the chancellor should not take \"anything off the table\" ahead of November Budget.",
      "TUC head says ministers must show they are ‘on the side of working people’ with levies on banks and gambling sector"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/54af/live/3d469d60-8912-11f0-8787-73db7d3c375e.jpg",
    "titles": [
      "Union group urges Reeves to consider wealth taxes",
      "Trade unions urge Reeves to fend off Reform UK with wealth taxes"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.971,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.659,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "TUC General Secretary Paul Nowak urged the Chancellor not to exclude any options in the upcoming November Budget. He emphasized the need for the government to demonstrate support for working people by imposing taxes on the banking and gambling sectors.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Disney Pays $10M to Settle FTC Child Data Complaint",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Wed, 03 Sep 2025 17:54:18 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMimAFBVV95cUxONjVBMnFibGNBS2lXMzhOdWl0WFlhcFgtWldqZ2ZPVkFRUHJqeWtGajZFSnoyVTdXTFZwWmh1UnZUSzhXODAyWFlOOHB2UHNUUWM0OE5jQnZHMjByVXlCRnJ4b3c0SFBMMFlKeS1adk1rMkhZLWROazV2QUtCck5rQ2xIUjBSVzB6MlhXcGRKQzBWUkJxOHFfSw?oc=5\" target=\"_blank\">Exclusive: Disney wil",
      "Disney to pay $10 million to settle FTC complaint over unlawful collection of children's personal data."
    ],
    "image_url": "",
    "titles": [
      "Exclusive: Disney will pay $10M to settle children's privacy lawsuit with FTC - Axios",
      "Disney to pay $10 million to settle FTC complaint over collection of children's personal data on YouTube"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.859,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.634,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Disney has agreed to pay $10 million to settle an FTC complaint regarding the unauthorized collection of children's personal data. The settlement resolves allegations that Disney's subsidiary, Playdom, violated the Children's Online Privacy Protection Act.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Jupiter's Auroras Brightest in Solar System, Moons Contribute",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Wed, 03 Sep 2025 14:19:03 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org",
      "NASA"
    ],
    "domains": [
      "science.nasa.gov",
      "phys.org"
    ],
    "snippets": [
      "Jupiter hosts the brightest and most spectacular auroras in the solar system. Near its poles, these shimmering lights offer a glimpse into how the planet interacts with the solar wind and moons swept by Jupiter's magnetic field.",
      "Jupiter hosts the brightest and most spectacular auroras in the Solar System. Near its poles, these shimmering lights offer a glimpse into how the planet interacts with the solar wind and moons swept by Jupiter’s magnetic field. Unlike Earth’s northern lights, the largest moons of Jupiter create the"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/juno-finds-last-aurora.jpg",
    "titles": [
      "Juno finds final missing auroral signature from Jupiter's largest moons",
      "Juno Detected the Final Missing Auroral Signature from Jupiter’s Four Largest Moons"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.885,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.632,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Jupiter has the solar system's brightest auroras, primarily around its poles. These lights reveal the planet's interaction with solar wind and its moons affected by its magnetic field. Unlike Earth's auroras, Jupiter's largest moons contribute to this phenomenon, offering unique insights into its magnetic environment.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Google Unveils New Updates for Android and Pixel Devices",
    "domain": "technology",
    "source_domain": "techcrunch.com",
    "location": "global",
    "published": "Wed, 03 Sep 2025 18:00:00 +0000",
    "source": "TechCrunch",
    "sources": [
      "Ars Technica",
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com",
      "arstechnica.com"
    ],
    "snippets": [
      "Google announced on Wednesday that it's bringing a slew of new features to the Android ecosystem and Pixel devices.",
      "Google's latest updates include a smattering of features for Pixels and other Android phones."
    ],
    "image_url": "",
    "titles": [
      "Google brings Material 3 Expressive to Pixel 6 and newer devices, along with other features",
      "Google’s Material 3 Expressive UI rolls out to Pixel 6 and newer"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.879,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.631,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Google announced new updates for the Android ecosystem and Pixel devices on Wednesday, introducing a variety of features aimed at enhancing user experience across Pixels and other Android phones.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]