[
  {
    "title": "Gunman Kills 4, Injures 8 at Michigan Church; Shot Dead by Police",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sun, 28 Sep 2025 12:15:31 -0400",
    "source": "NPR",
    "sources": [
      "Fortune",
      "NPR",
      "Deutsche Welle",
      "The Guardian",
      "CityNews",
      "ABC News",
      "BBC",
      "Al Jazeera"
    ],
    "domains": [
      "www.npr.org",
      "fortune.com",
      "abcnews.go.com",
      "www.dw.com",
      "ottawa.citynews.ca",
      "www.bbc.com",
      "www.theguardian.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Multiple people were shot at a Mormon church in Michigan that was then set on fire, authorities said Sunday. The shooter was killed by police.",
      "Hundreds of people were attending a Sunday service when the attacker drove a vehicle into the church and opened fire, police say.",
      "At least eight others injured in shooting and fire in Grand Blanc Township, and suspect shot dead by police.",
      "A man killed at least four people and injured several others in a shooting at the Church of Jesus Christ of Latter-day Saints in Grand Blanc, Michigan, before dying in a shootout with police, officials said.",
      "Multiple people were shot Sunday at the Church of Latter Day Saints in Grand Blanc, Michigan, police said.",
      "<p>Church allegedly set ablaze by gunman on weekend when shooting attacks also took place in North Carolina, Texas and New Orleans</p><p>At least four people were killed and eight others injured after a gunman opened fire at a Mormon church in <a href=\"https://www.theguardian.com/us-news/michigan\">M",
      "GRAND BLANC TOWNSHIP, Mich. (AP) — A gunman opened fire inside a Church of Jesus Christ of Latter-day Saints chapel in Michigan during a Sunday service and set the building ablaze, killing at least two people and injuring eight others before police shot him, authorities said. Hundreds of people were",
      "The FBI is leading the investigation and considered it an “act of targeted violence,” said Ruben Coleman, a special agent in charge for the bureau."
    ],
    "image_url": "",
    "titles": [
      "Attack at a Mormon church in Michigan leaves at least 4 dead, 8 injured",
      "Four killed in shooting and arson attack at Mormon church in Michigan",
      "US shooter kills at least four at Mormon church in Michigan",
      "US: At least 4 dead in shooting at Mormon church",
      "4 dead, 8 injured in Michigan church shooting and fire set by gunman: Police",
      "At least four dead and eight injured after shooting at Mormon church in Michigan",
      "2 people dead and 8 wounded in a shooting and fire at a Michigan church, police say",
      "Gunman in truck smashes into Michigan church and opens fire, killing at least 4 and injuring 8"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.78,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.831,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A gunman attacked the Church of Jesus Christ of Latter-day Saints in Grand Blanc, Michigan, during a Sunday service, killing at least four and injuring eight others before being shot dead by police. The assailant drove into the church, opened fire on attendees, and set the building on fire. The incident, described by the FBI as an \"act of targeted violence,\" occurred amidst several other shooting attacks across the U.S.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "NYC Mayor Adams Suspends Campaign Amid Funding Issues, Crowded Race",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sun, 28 Sep 2025 17:54:55 +0000",
    "source": "Al Jazeera",
    "sources": [
      "CNBC",
      "Al Jazeera",
      "The Guardian",
      "Financial Times",
      "Business Insider"
    ],
    "domains": [
      "www.ft.com",
      "www.businessinsider.com",
      "www.cnbc.com",
      "www.theguardian.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Adams bows out, leaving the race between Democrat Zohran Mamdani and former New York Governor Andrew Cuomo.",
      "President Donald Trump has suggested that NYC Mayor Eric Adams and Curtis Sliwa, the Republican nominee, should both drop out of the race.",
      "Democratic socialist Zohran Mamdani and Andrew Cuomo will now face off in city’s November poll",
      "<p>New York City mayor abandons faltering bid to win re-election in social media video set to strains of song My Way</p><p>The mayor of <a href=\"https://www.theguardian.com/us-news/new-york\">New York City</a>, <a href=\"https://www.theguardian.com/us-news/eric-adams\">Eric Adams</a>, announced on Sund",
      "Adams announced his departure on Sunday in an eight-minute video on X, saying media speculation and lack of funding influenced his decision."
    ],
    "image_url": "",
    "titles": [
      "Eric Adams says he is dropping out of New York City mayoral race",
      "Eric Adams drops out of New York City mayoral race",
      "New York mayor Eric Adams abandons re-election bid",
      "Eric Adams drops out of New York City mayoral race",
      "Eric Adams drops out of the New York mayor's race weeks ahead of the election"
    ],
    "score_components": {
      "magnitude": 0.964,
      "recency": 0.808,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.798,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "New York City Mayor Eric Adams has suspended his re-election campaign, citing media speculation and funding issues. His withdrawal sets up a race between Democrat Zohran Mamdani, Republican Curtis Sliwa, and former Governor Andrew Cuomo, running as an independent. Adams made the announcement through a social media video. President Trump had suggested both Adams and Sliwa should drop out. The election is set for November.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Senators Secure 2-0 Pre-Season Win Against Devils",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sun, 28 Sep 2025 23:41:33 +0000",
    "source": "Global News",
    "sources": [
      "Ottawa Citizen",
      "Global News",
      "Sportsnet"
    ],
    "domains": [
      "globalnews.ca",
      "www.sportsnet.ca",
      "ottawacitizen.com"
    ],
    "snippets": [
      "Stephen Halliday scored on the power play and Olle Lycksell scored into an empty net as the Ottawa Senators defeated the New Jersey Devils 2-0 in NHL pre-season action on Sunday at the Videotron Centre.",
      "<p>Stephen Halliday scored on the power play and Olle Lycksell scored into an empty net as the Ottawa Senators defeated the New Jersey Devils 2-0 in NHL pre-season action on Sunday at the Videotron Centre.</p>",
      "Rookie centre Stephen Halliday scored the third-period winner as the Senators picked up their second victory of the pre-season"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/5ee59b15d0a74103bbd3509d2c16e975c33e42411b2fa0a44b19f3473754a80d.jpg?quality=65&strip=all",
    "titles": [
      "Ullmark nets shutout as Senators beat Devils 2-0",
      "Ullmark nets shutout as Senators beat Devils",
      "Takeaways: Linus Ullmark makes 14 stops in Ottawa Senators' victory over Devils"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.911,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.783,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Stephen Halliday and Olle Lycksell scored for the Ottawa Senators in a 2-0 win against the New Jersey Devils during an NHL pre-season game on Sunday at the Videotron Centre. Halliday's goal came in the third period on a power play, securing the Senators' second pre-season victory. Lycksell's goal was scored into an empty net.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Moldova's Pro-European Party Leads Election Amid Russia Interference Claims",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 29 Sep 2025 00:11:53 GMT",
    "source": "BBC",
    "sources": [
      "Financial Post",
      "Deutsche Welle",
      "Financial Times",
      "BBC"
    ],
    "domains": [
      "www.ft.com",
      "www.bbc.com",
      "www.dw.com",
      "financialpost.com"
    ],
    "snippets": [
      "The vote was seen as critical for Moldova's EU path, and President Maia Sandu warned the country's future was in danger.",
      "Moldovans voted in a high-stakes election to decide whether the country moves closer to the European Union or Russia. Follow DW for more.",
      "Overseas votes may boost Maia Sandu’s ruling party after officials accused Russia of underhand tactics before poll",
      "Moldova’s ruling pro-European party was on track to win re-election, keeping the country on the path to European Union membership and raising the risk of an escalation in tensions with Russia.",
      "Moldova’s ruling pro-European party was on track to win the most votes in a parliamentary election Sunday that was marred by allegations of wide-spread Russian meddling."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/2fc3/live/79042050-9c47-11f0-82b3-31d97f4e1ffa.jpg",
    "titles": [
      "Pro-EU party in Moldova wins election mired in claims of Russian interference",
      "Moldova election: Pro-EU party takes decisive lead",
      "Pro-EU party leads in Moldova’s parliamentary election",
      "Moldova’s Pro-EU Party Set to Win Election in Rebuff of Russia",
      "Moldova’s Pro-EU Party Set to Win Most Votes in Election"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.902,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.777,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Moldova's pro-European ruling party leads with 46% of the vote in a parliamentary election marked by allegations of Russian interference. The election is pivotal for deciding whether Moldova aligns more closely with the EU or Russia. The outcome could see President Maia Sandu's party retaining its majority, amid a high-stakes vote influenced by overseas ballots and accusations against Russia.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Blue Jays Win AL East Title, Kirk Hits 2 HRs in 13-4 Victory Over Rays",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Mon, 29 Sep 2025 01:14:37 +0000",
    "source": "Global News",
    "sources": [
      "CityNews",
      "Global News",
      "Sportsnet"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "globalnews.ca",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Blue Jays manager John Schneider was only 20 seconds into his post-game speech Sunday when he was drowned out by his roaring players and doused in champagne.",
      "Alejandro Kirk hit two homers and drove in six runs to power the Blue Jays to a 13-4 victory over the Tampa Bay Rays on Sunday to give Toronto its first American League East Division title since 2015.",
      "<p>For the first time in a decade, the Toronto Blue Jays are AL East champions.</p>",
      "<p>For the first time in a decade, the Toronto Blue Jays are back atop the American League East.</p>",
      "<p>Watch as John Schneider gives an impassioned speech to the Blue Jays after clinching the AL East division title before the team popped their celebratory champagne in the clubhouse.</p>",
      "<p>Toronto Blue Jays stars Alejandro Kirk, George Springer and manager John Schneider speak with Sportsnet&#8217;s Hazel Mae immediately after clinching the team&#8217;s first AL East title since 2015.</p>",
      "TORONTO – Six months of grinding to qualify for the meaningful games of the seventh are over and this&#160;Toronto Blue Jays&#160;season spent walking through a dream continues, with the chance to push back the awakening deep into October.&#160; An American League East title, the club’s first since "
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/b2296baf516a6ce31fbf6e507300f3362189c81b55f415341b8fa20bc5c636e1.jpg?quality=65&strip=all",
    "titles": [
      "Jays beat Rays to take East, earn bye to ALDS",
      "Blue Jays beat Rays 13-4, take East title",
      "Blue Jays beat Rays to clinch first AL East title since 2015",
      "‘A wagon’: Sports world reacts to Blue Jays winning AL East title",
      "Blue Jays pop champagne in locker room after clinching AL East title",
      "Blue Jays’ Schneider, Kirk and Springer speak after clinching AL East title",
      "Blue Jays beat Rays to clinch first AL East title since 2015"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.941,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.775,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Alejandro Kirk led the Toronto Blue Jays to a 13-4 win over the Tampa Bay Rays with two home runs, securing their first AL East title since 2015. The victory in their regular-season finale was highlighted by Kirk's first career grand slam. George Springer and Addison Barger also contributed with home runs. This triumph marks the team's notable return to the top of the American League East after a decade.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Calgary Stampeders Acquire Lorenzo Mauldin IV from Ottawa Redblacks",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sun, 28 Sep 2025 22:39:08 +0000",
    "source": "Global News",
    "sources": [
      "Ottawa Citizen",
      "Global News",
      "Sportsnet"
    ],
    "domains": [
      "globalnews.ca",
      "www.sportsnet.ca",
      "ottawacitizen.com"
    ],
    "snippets": [
      "The Calgary Stampeders acquired all-star American defensive lineman Lorenzo Mauldin IV on Sunday in a trade with the Ottawa Redblacks.",
      "<p>The Calgary Stampeders acquired all-star American defensive lineman Lorenzo Mauldin IV on Sunday in a trade with the Ottawa Redblacks.</p>",
      "The Calgary Stampeders acquired all-star American defensive lineman Lorenzo Mauldin IV on Sunday in a trade with the Ottawa Redblacks. Ottawa got a fourth-round pick in the 2026 Canadian Football League draft in return. The Redblacks have a 4-10 record this season, which is the worst record among th"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/35f544e9af9cb37edc23a029a411c340477b8d6f03ee5b12fd023f39dc225093.jpg?quality=65&strip=all",
    "titles": [
      "Stampeders get all-star Lorenzo Mauldin IV",
      "Stampeders get all-star Lorenzo Mauldin IV in trade with Redblacks",
      "Redblacks trade all-star Lorenzo Mauldin IV to Stampeders"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.891,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.765,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Calgary Stampeders traded for all-star American defensive lineman Lorenzo Mauldin IV from the Ottawa Redblacks on Sunday, exchanging a fourth-round pick in the 2026 CFL draft. The trade comes as the Redblacks hold a 4-10 season record, the lowest in the league.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Bad Bunny to Headline 2026 Super Bowl Halftime Show",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sun, 28 Sep 2025 23:12:18 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Forbes",
      "CBS Sports"
    ],
    "domains": [
      "www.forbes.com",
      "www.espn.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Puerto Rican superstar Bad Bunny will headline the Apple Music Super Bowl halftime show from Levi's Stadium on Feb. 8 in Santa Clara, California.",
      "Bad Bunny, a three-time Grammy Award winner, is the most-streamed artist in the world",
      "Check out the list of artists who've taken the stage in the history of the iconic event",
      "Get to know who is Bad Bunny before he performs at the NFL's 2026 Super Bowl LX Halftime Show that could mark a politically charged moment."
    ],
    "image_url": "",
    "titles": [
      "Bad Bunny to headline Super Bowl halftime show",
      "Bad Bunny selected to perform during 2026 Super Bowl LX halftime show",
      "Full list of every Super Bowl halftime performer in history: Bad Bunny to headline show in 2026",
      "Bad Bunny To Play 2026 Super Bowl LX Halftime Show: All The Details"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.98,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.758,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Puerto Rican artist Bad Bunny, a three-time Grammy winner and the world's most-streamed artist, is set to headline the Apple Music Super Bowl Halftime Show at Levi's Stadium in Santa Clara, California, on Feb. 8. His performance at the 2026 Super Bowl LX could be a significant, potentially politically charged event.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Lamar Jackson Injured in Ravens' 37-20 Loss to Chiefs",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sun, 28 Sep 2025 22:51:05 EST",
    "source": "ESPN",
    "sources": [
      "Sports Illustrated",
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "www.espn.com",
      "news.google.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Baltimore Ravens quarterback Lamar Jackson sustained a hamstring injury in the third quarter of his team's 37-20 loss to the Kansas City Chiefs on Sunday at Arrowhead Stadium, and coach John Harbaugh had no update during his postgame media availability.",
      "Jackson is questionable to return as his team trails by 17 points entering the fourth quarter",
      "<a href=\"https://news.google.com/rss/articles/CBMifkFVX3lxTE96Rno0NDRNUFk1NTRXZTNPbWRBMjNrSzlGWjVpM0ZEdF9UU1luWV9HZTdfVkJaQ1NPRUxxaU1hd2ZGTkFENzV5RGRQQUdlcEd6WVk3d01iNVdaYnJDeXJYMERWS1NvRlE4MlZCcnpEcjJrSzdKMmVhS0E3ME5Wdw?oc=5\" target=\"_blank\">Lamar Jackson Exits Ravens-Chiefs With Hamstring Injury</"
    ],
    "image_url": "",
    "titles": [
      "Jackson injures hamstring as Ravens fall to 1-3",
      "Lamar Jackson injury: Ravens quarterback exits Week 4 game against Chiefs with hamstring injury",
      "Lamar Jackson Exits Ravens-Chiefs With Hamstring Injury - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.973,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.756,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Lamar Jackson, quarterback for the Baltimore Ravens, left the game with a hamstring injury in the third quarter during a 37-20 loss to the Kansas City Chiefs at Arrowhead Stadium. Coach John Harbaugh provided no update on Jackson's condition postgame. Jackson's status was listed as questionable for return as the Ravens faced a 17-point deficit entering the fourth quarter.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Phoenix Mercury Overcomes Deficit to Reach WNBA Finals",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sun, 28 Sep 2025 22:51:05 EST",
    "source": "ESPN",
    "sources": [
      "Sportsnet",
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "The Phoenix Mercury overcame a 13-point, fourth-quarter deficit to defeat the short-handed Minnesota Lynx 86-81 in Game 4 on Sunday to advance to the WNBA Finals for the first time since 2021, and in that round, they'll take on Indiana or Las Vegas.",
      "Alyssa Thomas had 23 points, 10 assists and 8 rebounds",
      "Phoenix punched its ticket to the WNBA Finals on Sunday",
      "<p>Alyssa Thomas scored 23 points, DeWanna Bonner made two key 3-pointers in the fourth quarter and the Phoenix Mercury overcame a 13-point deficit in the final period to beat the short-handed Minnesota Lynx 86-81 in Game 4 on Sunday night and advance to the WNBA Finals for the first time since 2021"
    ],
    "image_url": "",
    "titles": [
      "Mercury oust short-handed Lynx, reach Finals",
      "WNBA playoffs: Phoenix Mercury fend off short-handed Minnesota Lynx in Game 4 to reach WNBA Finals",
      "WNBA playoff bracket, where to watch: Schedule, scores, TV channel as Mercury eliminate Lynx to reach Finals",
      "Mercury overcome 13-point deficit, beat Lynx to advance to WNBA Finals"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.973,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.756,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Phoenix Mercury rallied from a 13-point fourth-quarter deficit to defeat the Minnesota Lynx 86-81 in Game 4, advancing to the WNBA Finals for the first time since 2021. Alyssa Thomas led with 23 points, 10 assists, and 8 rebounds, while DeWanna Bonner contributed crucial fourth-quarter 3-pointers. They will face either Indiana or Las Vegas in the Finals.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Anthony Stolarz Secures 4-Year, $15M Deal with Toronto Maple Leafs",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sun, 28 Sep 2025 19:07:34 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "NHL",
      "Sportsnet"
    ],
    "domains": [
      "globalnews.ca",
      "www.sportsnet.ca",
      "news.google.com"
    ],
    "snippets": [
      "Goalie Anthony Stolarz and the Toronto Maple Leafs have agreed to a four-year contract extension.",
      "<a href=\"https://news.google.com/rss/articles/CBMikwFBVV95cUxPRGNCc2ZOOWZmNE9oQzBob0NkTFpNUjZ5aFdGZlI4cHI4c0FRTXJoWDBQdEE0SFJYYkJRQzR6QnZubl8wcGtleGs0M2tvOUtjOTVQZ04zV2NWRzY3eFpkU3o2dmpBQVYtdnFUay1HMnZZVnlNa3o5RXc5RW5INldzeGhPSkNDQm0zVzJFRmhYbnJmSVU?oc=5\" target=\"_blank\">Stolarz signs 4-year, $15 mi",
      "<p>Anthony Stolarz has agreed to the biggest pay day of his life, and it still may be a bargain for the Toronto Maple Leafs.</p>"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/bf7a3286377e0a5839a285ffdce045e381f0b808bcacf3e801dd6e6e4377e00b.jpg?quality=65&strip=all",
    "titles": [
      "Stolarz signs four-year extension with Maple Leafs",
      "Stolarz signs 4-year, $15 million contract with Maple Leafs - NHL.com",
      "Maple Leafs agree to four-year contract extension with goalie Anthony Stolarz"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.828,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.752,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Anthony Stolarz has signed a four-year, $15 million contract extension with the Toronto Maple Leafs, securing his position as a goalie for the team. This agreement reflects the team's commitment to Stolarz as a key player in their lineup.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Denmark Bans Civilian Drones Amid Security Concerns, Closes Airports",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sun, 28 Sep 2025 14:57:47 +0000",
    "source": "Al Jazeera",
    "sources": [
      "The Guardian",
      "Deutsche Welle",
      "Global News",
      "Al Jazeera"
    ],
    "domains": [
      "globalnews.ca",
      "www.dw.com",
      "www.theguardian.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Drone sorties over past week have caused the temporary closures of several Danish airports, raising security concerns.",
      "Denmark is closing its entire airspace to civilian drones. The ban comes as the Nordic country prepares to host European leaders after a flurry of suspicious drone activity in recent days.",
      "<p>The ban on civilian unmanned flights will last until Friday and comes as heads of EU governments gather amid spate of drone incursions</p><p>Danish authorities have said drones were seen at several military sites overnight and announced that all civilian use of the unmanned aircraft will be banne",
      "This is the latest unexplained drone activity after several sightings, including over five Danish airports last week."
    ],
    "image_url": "",
    "titles": [
      "Denmark bans drone flights after latest drone sightings at military bases",
      "Denmark bans civil drones after more sightings",
      "Denmark bans drones ahead of European summits amid further sightings at military sites",
      "Denmark reports new drone sightings over army bases, NATO ups surveillance"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.759,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.748,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Recent drone activity, including sightings over five Danish airports, has prompted Denmark to temporarily close several airports and raise security concerns. Ahead of two European leaders' summits, the Danish government announced a ban on all civilian drone flights this week, especially after drones were observed at military sites. This measure aims to enhance security amid the unexplained drone incursions.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Steelers' Skylar Thompson Robbed, Incident Under Investigation",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sun, 28 Sep 2025 22:28:35 +0000",
    "source": "CBS Sports",
    "sources": [
      "Sports Illustrated",
      "Sportsnet",
      "CBS Sports"
    ],
    "domains": [
      "news.google.com",
      "www.cbssports.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "The incident occurred on Friday night",
      "<a href=\"https://news.google.com/rss/articles/CBMikgFBVV95cUxOY3pnZXdpc05lcFdITUxrSWJZdlFZWFJwNlMySTEzYmZQQWptcWtpbzVTaVItMHEtaWxEb0F6X2NFV1ViUGduZUpzZi1SNHBiX1BWQ1VrcnAzWTl1b21yeGhjbmpsSFcyOVlwWWE4Um9kQVZpOWhlQUZ4VTFhWUdZY0dHMnF6MEpmMjJaWHFDU2ZVQQ?oc=5\" target=\"_blank\">Steelers Backup QB Skylar Tho",
      "<p>The Pittsburgh Steelers confirmed that backup quarterback Skylar Thompson was involved in an incident Friday night after a report that the player had been robbed.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/28/712765b0-dcfc-41c0-9624-8e947217816a/thompson.jpg",
    "titles": [
      "Steelers QB Skylar Thompson jumped, robbed in Ireland, suffers minor injuries",
      "Steelers Backup QB Skylar Thompson Sustained Minor Injuries in Ireland Robbery - Sports Illustrated",
      "Report: Steelers backup QB Skylar Thompson robbed in Dublin"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.888,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.714,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Pittsburgh Steelers confirmed that backup quarterback Skylar Thompson was involved in an incident on Friday night, following reports that he was robbed. The current status of the situation is under investigation.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Stowaway Found Dead in Plane's Landing Gear in North Carolina",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sun, 28 Sep 2025 17:48:33 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "ABC News"
    ],
    "domains": [
      "www.npr.org",
      "abcnews.go.com"
    ],
    "snippets": [
      "Police say maintenance workers discovered the body Sunday morning after the plane landed from Europe.",
      "A stowaway was found dead Sunday in the landing gear of an American Airlines flight that arrived in North Carolina from Europe, according to police."
    ],
    "image_url": "",
    "titles": [
      "Stowaway found dead in landing gear of American Airlines flight in Charlotte",
      "Stowaway found dead inside landing gear of an American Airlines flight"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.876,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.655,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A stowaway was found dead in the landing gear of an American Airlines flight from Europe upon its arrival in North Carolina on Sunday, police reported. Maintenance workers discovered the body that morning.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Karearea Named New Zealand's Bird of the Year Amid Controversy-Free Contest",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-09-29T03:18:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "The Guardian",
      "Deutsche Welle"
    ],
    "domains": [
      "www.dw.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "The threatened karearea, New Zealand's fastest bird, was crowned Bird of the Year. There are between roughly 5,000 to 8,000 karearea left.",
      "<p>The country’s fastest bird has taken out the top prize in a scandal-free year for the annual poll</p><p>New Zealand’s fastest bird, capable of flying 200km/h in its pursuit of prey, has been crowned bird of the year – a long-running annual competition that has previously been a lightning rod for "
    ],
    "image_url": "",
    "titles": [
      "New Zealand's only falcon wins annual bird election",
      "Threatened kārearea falcon wins New Zealand’s 2025 bird of the year"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.982,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.651,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The karearea, New Zealand's fastest bird capable of speeds up to 200km/h, was named Bird of the Year. With an estimated population of 5,000 to 8,000, this recognition comes in a year free from the controversies that have marked previous competitions.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Moldova's Pro-European Party Leads Election Amid Russia Interference Claims",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sun, 28 Sep 2025 22:14:08 +0000",
    "source": "Al Jazeera",
    "sources": [
      "The Guardian",
      "Al Jazeera"
    ],
    "domains": [
      "www.theguardian.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Moldovans await the results of a closely-watched parliamentary election, amid claims of Russian interference.",
      "<p>PAS leads with 46% of vote in ballot that will decide whether country steers closer to EU or Russia</p><p>Moldova’s ruling pro-European party is on course to retain its parliamentary majority after Sunday’s pivotal election, seen as a test of the president’s push to keep the country of 2.4 millio"
    ],
    "image_url": "",
    "titles": [
      "Moldova’s pro-EU party takes lead in election as vote counting under way",
      "Moldova’s pro-European party on course to retain majority in key election"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.884,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.639,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Moldova's pro-European ruling party leads with 46% of the vote in a parliamentary election marked by allegations of Russian interference. The election is pivotal for deciding whether Moldova aligns more closely with the EU or Russia. The outcome could see President Maia Sandu's party retaining its majority, amid a high-stakes vote influenced by overseas ballots and accusations against Russia.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Four Killed, Ten Shot at Michigan Church; Governor Whitmer Condemns Violence",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Mon, 29 Sep 2025 00:56:15 GMT",
    "source": "Axios",
    "sources": [
      "Global News",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "globalnews.ca"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMif0FVX3lxTE5NcHRocmd0LUd6V0hvM29zeWFtN3V3cUVYa012VFdGeFhBV3hYUU9aWndYTXRtMFYxcHBndVNITnI3LXl6SWtIUk5NdVlwYXBnd0liZDlTNUhTZlpoSVFNT0R3VjFjbVRxLU5BSUR1OFE1ZmtRMkNSX1NaRm1jRjQ?oc=5\" target=\"_blank\">Ten shot, 4 killed at Michigan church and fire set \"deli",
      "Michigan Gov. Gretchen Whitmer said that her heart is breaking for the Grand Blanc community. “Violence anywhere especially in a place of worship, is unacceptable,” she said."
    ],
    "image_url": "",
    "titles": [
      "Ten shot, 4 killed at Michigan church and fire set \"deliberately,\" police say - Axios",
      "Suspect named, 2 dead, 8 injured in Michigan church shooting, police say"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.916,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.638,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In Grand Blanc, Michigan, a tragic incident occurred where ten people were shot, and four were killed at a church, followed by an arson attack. Governor Gretchen Whitmer expressed her deep sorrow for the community, emphasizing that violence, particularly in places of worship, is unacceptable.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Tropical Storm Imelda Expected to Become Hurricane, May Veer Away from US",
    "domain": "general",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Sun, 28 Sep 2025 23:51:18 GMT",
    "source": "Axios",
    "sources": [
      "The Guardian",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMihAFBVV95cUxOTFctdTV3VXBqN01IR05vbnhTMWw4MnhrdWgwOEROQUl0MXM4Y3dXVzMwRGlpVXBIZUc5OEtUNmdJdWs4OHBVblFSaHRvTWtuVDFfSG9rNXdldkxsbVBUZUpCRi1PcUxnNk1faEtZd1FFQTRBR1ItYnZ0bmt3U0xjUFJHdVY?oc=5\" target=\"_blank\">Tropical Storm Imelda forms, expected to threate",
      "<p>Forecast track could take storm, which caused disruption in Bahamas and Cuba, away from US east coast</p><p>Tropical Storm Imelda formed on Sunday and was expected to become a hurricane on a forecast track that could take it away from the US east coast in the coming days. The storm was causing di"
    ],
    "image_url": "",
    "titles": [
      "Tropical Storm Imelda forms, expected to threaten Carolinas with heavy rains - Axios",
      "Tropical Storm Imelda forming and expected to become hurricane"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.895,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.634,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Tropical Storm Imelda formed on Sunday and is anticipated to become a hurricane. Its forecasted path suggests it might move away from the US east coast. Previously, Imelda caused disruptions in the Bahamas and Cuba.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Shares, Then Deletes Fake Fox News Clip on Miracle Tech",
    "domain": "business",
    "source_domain": "www.forbes.com",
    "location": "global",
    "published": "Sun, 28 Sep 2025 17:01:54 -0400",
    "source": "Forbes",
    "sources": [
      "The Verge",
      "Forbes"
    ],
    "domains": [
      "www.forbes.com",
      "www.theverge.com"
    ],
    "snippets": [
      "Some conspiracy theorists have popularized the fictional technology, which they believe holds miracle cures.",
      "Donald Trump is no stranger to outlandish conspiracies or strange social media posts. But, by any measure, his post on Saturday night was particularly bizarre. The president posted (and later removed) a clip on Truth Social of a fake Fox News segment with Lara Trump detailing the White House’s annou"
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/68d9a1f2b357c926da4283c1/0x0.jpg?width=960&precrop=2680%2C1508%2Cx0%2Cy147",
    "titles": [
      "Trump Deletes Post Referencing Bizarre ‘Medbed’ Conspiracy Theory",
      "Trump posts, then pulls bizarre AI video promoting MedBed conspiracy"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.862,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.634,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Former President Donald Trump shared and then removed a fake Fox News clip on Truth Social, involving a fictional technology claimed by some conspiracy theorists to offer miracle cures. The post, featuring Lara Trump discussing the White House's announcement of the technology, was notably strange even by Trump's standards for engaging with outlandish conspiracy theories.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Taliban Releases US Citizen, Fifth American Freed This Year",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sun, 28 Sep 2025 19:28:56 +0000",
    "source": "Al Jazeera",
    "sources": [
      "The Guardian",
      "Al Jazeera"
    ],
    "domains": [
      "www.theguardian.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Amiri is the fifth US citizen held by the Taliban government in Afghanistan to be freed this year.",
      "<p>Secretary of state Marco Rubio welcomes release as ‘important step forward’ as Taliban seek to normalise relations with US</p><p>The Taliban on Sunday freed a US citizen from an Afghan prison, weeks after they said they had reached an agreement with US envoys on a prisoner exchange as part of an "
    ],
    "image_url": "",
    "titles": [
      "Taliban releases US citizen Amir Amiri after Qatari mediation",
      "US citizen Amir Amiry freed by Taliban in Afghanistan"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.834,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.632,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Taliban released a US citizen from an Afghan prison, marking the fifth American freed this year. Secretary of State Marco Rubio hailed the release as a significant progress in efforts to normalize relations between the US and the Taliban. This comes after an agreement on a prisoner exchange was reached with US envoys.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Government Shutdown Looms, Stocks Stay Resilient in September",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Sun, 28 Sep 2025 16:50:28 GMT",
    "source": "Axios",
    "sources": [
      "MarketWatch",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "www.marketwatch.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMifEFVX3lxTE5iWldBRFA4eWd0VkFPZHdBcTg4bFh0N2xxUTZ4NWdTajN6RGYzOGQ4dDlNU2V2dG5raXhjWTJENUlybF9fM280RnJhXzFHcmMxNkh0YmZ4OXpkMDdxSXFGcTJqOExrcjZkUzh0a2FIY01oWlBnWXUxY2w3ODg?oc=5\" target=\"_blank\">No one wants to shoulder the government shutdown blame</a>&n",
      "Stocks are defying their typical weakness in September — but it isn’t October yet"
    ],
    "image_url": "",
    "titles": [
      "No one wants to shoulder the government shutdown blame - Axios",
      "The last thing the stock market wants right now is a government shutdown. Here’s why."
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.774,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.617,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Amid concerns over a potential government shutdown, no party is willing to take the blame for the impasse. Meanwhile, contrary to usual trends, stock markets have shown resilience in September, although the situation could change with the arrival of October.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Pogačar Wins Men's Road Race World Title Again in Rwanda",
    "domain": "business",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Sun, 28 Sep 2025 16:53:01 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "Forbes"
    ],
    "domains": [
      "www.forbes.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "<ul><li><p>Pogacar reclaims rainbow jersey he won last year</p></li><li><p>Remco Evenepoel second, Ireland’s Ben Healy third</p></li></ul><p>Tadej Pogacar lit up Kigali’s climbs with a trademark long-range attack to claim a second consecutive men’s road race world title on Sunday.</p><p>There was an",
      "Tadej Pogačar became the first rider to win the Tour de France and World Championship Road race in consecutive seasons on Sunday in Kigali, Rwanda."
    ],
    "image_url": "https://i.guim.co.uk/img/media/6f1c6605bc7cb4416400b7907e51d6f19abdd846/613_0_6133_4907/master/6133.jpg?width=140&quality=85&auto=format&fit=max&s=25b79da1f104e6a324d0f49808ba8cd8",
    "titles": [
      "Unstoppable Tadej Pogacar defends men’s road race world title in Rwanda",
      "Tadej Pogačar Defends Road World Championship Title In Solo Victory"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.774,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.617,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Tadej Pogačar won the men's road race world title for the second consecutive year in Kigali, Rwanda, with a long-range attack. He became the first rider to win both the Tour de France and the World Championship Road race in consecutive seasons. Remco Evenepoel finished second, and Ireland’s Ben Healy came in third.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Gov Backs Carmaker with £1.5bn Loan After Cyber-Attack Halts Production",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 28 Sep 2025 15:38:20 GMT",
    "source": "BBC",
    "sources": [
      "Financial Times",
      "BBC"
    ],
    "domains": [
      "www.ft.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Liam Byrne spoke after the government announced it was backing a £1.5bn loan to the company, and warned cyber-attacks could become more common.",
      "Carmaker receives official backing after cyber attack that has halted production"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/d262/live/65281cd0-9c5b-11f0-b66e-67a4632b8ff2.jpg",
    "titles": [
      "Jaguar Land Rover may need more than £1.5bn government loan guarantee, MP says",
      "‘Moral hazard’ warning after £1.5bn government loan guarantee for JLR"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.754,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.616,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The government has supported a carmaker with a £1.5bn loan following a cyber-attack that stopped production. Liam Byrne highlighted the incident as a warning that cyber-attacks may increase in frequency.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Russia Deploys Kamikaze Drones in Kyiv After Zelensky-Trump Meeting",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sun, 28 Sep 2025 13:44:37 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Washington Post",
      "Al Jazeera"
    ],
    "domains": [
      "www.washingtonpost.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Russia has launched a heavy attack on Ukraine with hundreds of kamikaze drones hitting residential buildings in Kyiv.",
      "Russia’s missile and drone attack came days after Ukrainian President Volodymyr Zelensky’s meeting with President Donald Trump at the U.N. General Assembly."
    ],
    "image_url": "",
    "titles": [
      "Heavy Russian drone attack kills at least four in Ukraine’s capital Kyiv",
      "Four dead as massive Russian attack hits Kyiv, other Ukrainian cities"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.74,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.61,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Russia launched a significant attack on Ukraine, employing hundreds of kamikaze drones targeting residential areas in Kyiv. This aggressive action followed shortly after Ukrainian President Volodymyr Zelensky's meeting with President Donald Trump at the U.N. General Assembly.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "PM Starmer Labels Farage's Immigration Policy \"Racist\" Amid Poll Concerns",
    "domain": "business",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-09-28T11:52:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "Financial Times"
    ],
    "domains": [
      "www.ft.com",
      "www.dw.com"
    ],
    "snippets": [
      "British Prime Minister Keir Starmer has called for discipline within his center-left Labour Party as polls show Nigel Farage's anti-immigration Reform UK party well ahead.",
      "UK prime minister calls key Reform policy ‘racist’ as he focuses fire on Nigel Farage’s party"
    ],
    "image_url": "",
    "titles": [
      "Keir Starmer urges Labour to unite against Reform UK",
      "Starmer urges Labour to unite for ‘fight of our lives’ ahead of conference"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.712,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.597,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "British Prime Minister Keir Starmer criticized Nigel Farage's Reform UK party's main anti-immigration policy as \"racist.\" Starmer emphasized the need for discipline within his center-left Labour Party amid polls indicating Farage's party is leading.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]