[
  {
    "title": "Thousands Attend Charlie Kirk Memorial; Trump Praises Him as Martyr",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sun, 21 Sep 2025 17:44:09 -0400",
    "source": "NPR",
    "sources": [
      "Financial Times",
      "Deutsche Welle",
      "NPR",
      "The Guardian",
      "Al Jazeera"
    ],
    "domains": [
      "www.theguardian.com",
      "www.aljazeera.com",
      "www.ft.com",
      "www.npr.org",
      "www.dw.com"
    ],
    "snippets": [
      "Crowds filled a stadium in Arizona to remember the right-wing activist Charlie Kirk.",
      "President Donald Trump praises Kirk as an &#039;American martyr&#039; in his address at the Arizona service.",
      "Donald Trump is scheduled to speak at the memorial service for the slain conservative activist Charlie Kirk. Plus, a new $100,000 fee for visa applications for skilled workers in the US sparks confusion. Follow DW.",
      "Trump and senior figures in his administration to speak at an event that has the hallmarks of a state funeral",
      "<p>President delivers mix of eulogy and campaign speech while JD Vance calls Kirk ‘martyr for the Christian faith’</p><p></p><p>Tens of thousands gathered in Arizona on Sunday for a public memorial to honor <a href=\"https://www.theguardian.com/us-news/charlie-kirk-shooting\">Charlie Kirk</a>, the rig"
    ],
    "image_url": "",
    "titles": [
      "Photos: Tens of thousands of supporters attend memorial for Charlie Kirk in Arizona",
      "Trump joins thousands at memorial for right-wing US activist Charlie Kirk",
      "US updates: Charlie Kirk memorial underway in Arizona",
      "Thousands gather in Arizona at memorial service for Charlie Kirk",
      "Trump pays tribute to Charlie Kirk as tens of thousands attend memorial"
    ],
    "score_components": {
      "magnitude": 0.984,
      "recency": 0.951,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.858,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Tens of thousands attended a memorial in Arizona for Charlie Kirk, a right-wing activist. President Donald Trump, who spoke at the event, praised Kirk as an 'American martyr.' The service, resembling a state funeral, included eulogies and campaign speeches, with figures like JD Vance calling Kirk a 'martyr for the Christian faith.'",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Notes Ellison, Dell in TikTok Deal; US to Dominate Board, Control Algorith",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 21 Sep 2025 21:35:04 GMT",
    "source": "BBC",
    "sources": [
      "Fortune",
      "CNBC",
      "Financial Times",
      "CityNews",
      "Axios",
      "The Guardian",
      "TechCrunch",
      "Al Jazeera",
      "Global News",
      "BBC",
      "Forbes"
    ],
    "domains": [
      "techcrunch.com",
      "globalnews.ca",
      "www.theguardian.com",
      "www.aljazeera.com",
      "www.cnbc.com",
      "www.forbes.com",
      "fortune.com",
      "ottawa.citynews.ca",
      "news.google.com",
      "www.ft.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Oracle chairman Larry Ellison and Dell founder Michael Dell are also both involved, the president tells Fox News.",
      "Murdoch will be part of a group of US investors - including Trump allies - trying to take over TikTok&#039;s US operations.",
      "<a href=\"https://news.google.com/rss/articles/CBMiZ0FVX3lxTE1ZREhDMGtuaTBVeGFEbWpNTENhUnlFOVVGbE9qRGg4WU1qYkVOUV9oUzJmZ0haOUlaTEIzeHNEdVNKaTBhUG9oTjRXNnEyQjlZMF9UX2ZONEJ6Y25yNXN2Mk5CYXN4bU0?oc=5\" target=\"_blank\">Rupert Murdoch, Michael Dell part of U.S. TikTok buyer group, Trump says</a>&nbsp;&nbsp;",
      "President Donald Trump also said that Larry Ellison and Michael Dell are also likely to be involved in the TikTok deal.",
      "US president says Rupert and Lachlan will join the computer pioneer as well as Oracle’s Larry Ellison to buy shares from China’s ByteDance",
      "<p>US president tells Fox News ‘a man named Lachlan is involved … that’s a very unusual name, Lachlan Murdoch’</p><p>Rupert Murdoch and his son Lachlan Murdoch will probably be involved in the effort to<strong> </strong>buy <a href=\"https://www.theguardian.com/technology/tiktok\">TikTok</a> in the US",
      "Rupert Murdoch and Michael Dell were revealed by U.S. President Donald Trump as being part of a potential deal to acquire control of TikTok in America.",
      "Trump hinted the Murdoch heir might play a role in the deal to avoid shutting the app down in the U.S.",
      "The Trump administration has been talking up a potential TikTok deal this weekend, with President Donald Trump telling Fox News on Sunday that Rupert Murdoch and his son Lachlan are \"probably\" going to be involved.",
      "The White House announced on Saturday that the US operations of TikTok will be majority-owned and controlled by American investors.",
      "President Donald Trump said prominent billionaires – including media mogul Rupert Murdoch and tech founder Michael Dell – could be part of a deal in which the U.S. will take control of the social video platform TikTok. Trump namedropped the 94-year-old Murdoch and his son Lachlan Murdoch, the head o"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/090f/live/87a858f0-9720-11f0-84c8-99de564f0440.jpg",
    "titles": [
      "Murdochs likely to be involved in US TikTok deal, Trump says",
      "Trump says Lachlan Murdoch part of proposed TikTok deal",
      "Rupert Murdoch, Michael Dell part of U.S. TikTok buyer group, Trump says - Axios",
      "Trump says Murdochs are potential TikTok deal partners",
      "Murdochs and Michael Dell part of TikTok buyer group, says Trump",
      "Trump says Rupert and Lachlan Murdoch likely part of US TikTok deal",
      "Trump says US TikTok deal could include Rupert Murdoch, Michael Dell",
      "Lachlan Murdoch Might Be Involved In TikTok Deal, Trump Says",
      "Trump says Lachlan and Rupert Murdoch might invest in TikTok deal",
      "Trump suggests Murdochs will have role in new TikTok deal",
      "Trump reveals Murdochs and Dell could potentially take part in TikTok deal"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.928,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.836,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "President Donald Trump mentioned Larry Ellison and Michael Dell's potential involvement in the TikTok deal. The White House press secretary announced that in the restructured TikTok, Americans will occupy six out of seven board seats, and control over the app's algorithm will be in U.S. hands.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UK Formally Recognizes Palestine as State, Draws Israel's Criticism",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sun, 21 Sep 2025 05:38:17 -0400",
    "source": "NPR",
    "sources": [
      "Fortune",
      "Financial Times",
      "Deutsche Welle",
      "NPR",
      "Axios",
      "The Guardian",
      "Financial Post",
      "Al Jazeera",
      "New York Times",
      "BBC",
      "Washington Post"
    ],
    "domains": [
      "www.theguardian.com",
      "www.aljazeera.com",
      "fortune.com",
      "financialpost.com",
      "www.washingtonpost.com",
      "news.google.com",
      "www.ft.com",
      "www.bbc.com",
      "www.npr.org",
      "www.dw.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "The designation from U.S. allies follows U.K. Prime Minister Keir Starmer's meeting with President Trump last week.",
      "Canada, Australia and Portugal also announced the move on Sunday, with Israeli PM Benjamin Netanyahu accusing leaders of giving a \"huge reward to terrorism\".",
      "Prime Minister Starmer says the move will \"revive the hope of peace\" but Israel says it is \"nothing but a reward for jihadist Hamas\".",
      "Recognition of Palestine from Canada, Australia comes in coordination with UK, ahead of UN General Assembly meeting.",
      "Portugal has also recognized Palestinian statehood, as international pressure on Israel mounts over the war in Gaza. The announcements come ahead of a key week at the UN General Assembly. DW has more.",
      "<a href=\"https://news.google.com/rss/articles/CBMiekFVX3lxTFBFbkY3Skk2YnFfT1B0eTlIUVFEbm1rWnMyQWZ3bWZkd1p6VjhTaUI2TzRlbmRhRGJDQXBiU1FwTGN5QUxHNHczMmUwanE4VW5OTGpyN2JyUDhOa3NXMHZ3R3k3b3Z6T3lVdGFHMnlMbUd0ang4aUw3dGdB?oc=5\" target=\"_blank\">UK, Canada and Australia formally recognize Palestinian state</",
      "Move comes as Israel intensifies military action in Gaza and expansion of settlements in occupied West Bank",
      "<p>Move comes as Anthony Albanese tries to secure meeting with Donald Trump and amid warnings that recognition could spark ‘punitive measures’ from the US</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/sep/22/australia-news-live-anthony-albanese-new-york-israel-palestine",
      "The three major U.S. allies reversed decades of unwillingness to accept Palestinians as a sovereign nation until their conflict with Israel was settled.",
      "The moves came just before the annual U.N. General Assembly, increasing pressure on Israel and putting key allies at odds with the Trump administration.",
      "More than 145 countries already recognize a Palestinian state, including more than a dozen in Europe.",
      "Canada, the UK and Australia have formally recognized a Palestinian state, joining a growing global consensus and pushing ahead with a policy that has drawn criticism from US President Donald Trump.",
      "Anger over Israel’s war in Gaza has left it increasingly isolated, as Britain, Canada and Australia all announced they were recognizing a Palestinian state."
    ],
    "image_url": "",
    "titles": [
      "U.K., Canada and Australia recognize a Palestinian state, despite U.S. opposition",
      "UK formally recognises Palestinian state",
      "Watch: Keir Starmer says UK recognises Palestinian state",
      "Canada, Australia, Portugal join UK in recognising Palestinian statehood",
      "UK, Canada and Australia recognize Palestinian state",
      "UK, Canada and Australia formally recognize Palestinian state - Axios",
      "UK, Canada and Australia recognise Palestine as an independent state",
      "Australia joins UK and Canada in formally recognising Palestinian state",
      "U.K., Canada, Australia recognize Palestine as a state, breaking with U.S.",
      "Britain, Australia, Canada and Portugal Recognize a Palestinian State",
      "Canada joins Britain and Australia in recognizing a Palestinian state despite opposition from the U.S.",
      "UK, Canada Recognize Palestinian State in Break With Trump",
      "Here are countries that recognize a Palestinian state — or may do so soon"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.739,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.823,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The UK, under Prime Minister Keir Starmer, has formally recognized Palestine as an independent state. This decision, described as symbolic, comes 70 years after the British mandate in Palestine ended and Israel was created. Starmer believes this will \"revive the hope of peace,\" though Israel criticizes it as a \"reward for jihadist Hamas.\"",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Cowboys' CeeDee Lamb Injures Ankle, Exits Game Against Bears",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sun, 21 Sep 2025 19:10:15 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet",
      "CBS Sports",
      "Yahoo Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "www.bloggingtheboys.com",
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "Cowboys receiver CeeDee Lamb twisted his left ankle on a carry in the first quarter of Sunday's loss at Chicago.",
      "Lamb got hurt on the Cowboys' opening possession",
      "﻿We will see what CeeDee Lamb's status is for next week",
      "<p>Dallas Cowboys star receiver CeeDee Lamb left Sunday&#8217;s game against the Chicago Bears because of an ankle injury.</p>"
    ],
    "image_url": "",
    "titles": [
      "WR Lamb injures ankle as Cowboys lose to Bears",
      "CeeDee Lamb injury update: Cowboys star receiver ruled out after injuring ankle against Bears",
      "Adding injury to insult: CeeDee Lamb ankle update after an embarrassing loss",
      "Cowboys’ Lamb leaves game against Bears after injuring ankle on run"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.98,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.817,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Dallas Cowboys receiver CeeDee Lamb injured his left ankle during the first quarter of Sunday's game against the Chicago Bears, leading to his exit from the game. The injury occurred on the Cowboys' opening possession. Lamb's status for future games is currently uncertain.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Cardinals' James Conner Injured, Carted Off Field in Loss to 49ers",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sun, 21 Sep 2025 19:10:15 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "Cardinals running back James Conner was carted off the field with a right ankle injury in the third quarter of Sunday's 16-15 loss to the 49ers.",
      "Players from both teams gathered around Conner after his injury to show support",
      "<p>Arizona Cardinals running back James Conner was taken off the field on a cart with a right ankle injury in the third quarter of Sunday&#8217;s game against the San Francisco 49ers.</p>"
    ],
    "image_url": "",
    "titles": [
      "Cardinals RB Conner carted off with ankle injury",
      "Cardinals' James Conner suffers gruesome lower-body injury against 49ers",
      "Cardinals’ James Conner carted off field with ankle injury against 49ers"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.98,
      "consensus": 0.789,
      "constructiveness": 0.2,
      "proximity": 0.75
    },
    "score": 0.778,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "James Conner, Arizona Cardinals running back, sustained a right ankle injury during the third quarter of a game against the San Francisco 49ers, leading to him being carted off the field. The incident occurred during a 16-15 loss for the Cardinals. Teammates and opponents alike showed their support for Conner following the injury.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: support, sustain",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Toronto Blue Jays Secure Playoff Berth After Defeating Royals 8-5",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sun, 21 Sep 2025 21:30:39 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sportsnet",
      "Global News"
    ],
    "domains": [
      "www.cbssports.com",
      "globalnews.ca",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Toronto is headed to the postseason for the third time in four years",
      "The Toronto Blue Jays officially clinched a playoff berth after defeating the Kansas City Royals 8-5 on Sunday.",
      "<p>The Toronto Blue Jays are headed to the post-season for the 11th time in franchise history.</p>",
      "<p>Brad Fay and Joe Siddall discuss how the Blue Jays clinched a post-season berth after a four-game losing streak, and how they relied on the depth of this roster, which has been their strength and identity all season long.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/21/39f449f0-e69f-4269-80b1-ac4d945394c8/blue-jays-imagn-1.png",
    "titles": [
      "Blue Jays clinch MLB playoff berth, still targeting AL East division title and American League's best record",
      "Blue Jays clinch playoff spot with win over Royals",
      "Blue Jays clinch post-season berth with win over Royals",
      "Blue Jays lean on depth to snap their slump and clinch playoff berth"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.946,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.776,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Toronto Blue Jays have clinched a playoff berth for the 11th time in franchise history and for the third time in four years after defeating the Kansas City Royals 8-5. This victory came following a four-game losing streak, showcasing the team's depth and resilience, which have been pivotal to their success this season.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Najee Harris Suffers Serious Achilles Injury in Game Against Broncos",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sun, 21 Sep 2025 19:10:15 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "Chargers running back Najee Harris suffered what preliminary tests revealed was an Achilles injury during Sunday's 23-20 win against the Denver Broncos, coach Jim Harbaugh said after the game.",
      "The injury doesn't look good for Harris and the Chargers",
      "<p>Los Angeles Chargers running back Najee Harris hurt his left ankle on a non-contact play in the second quarter Sunday against the Denver Broncos.</p>"
    ],
    "image_url": "",
    "titles": [
      "Chargers' Harris dealing with injury to Achilles",
      "Najee Harris injury update: Chargers RB injured Achilles vs. Broncos, Jim Harbaugh confirms",
      "Chargers’ Najee Harris injures ankle during non-contact play vs. Broncos"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.98,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.775,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Najee Harris, running back for the Los Angeles Chargers, sustained an Achilles injury during a game against the Denver Broncos, as confirmed by coach Jim Harbaugh. The injury occurred in the second quarter on a non-contact play. Preliminary tests indicate it's serious, impacting Harris and the Chargers' lineup.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: sustain",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Praises Kirk at Memorial, Widow Forgives Gunman; Musk Appears",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sun, 21 Sep 2025 05:00:00 -0400",
    "source": "NPR",
    "sources": [
      "Axios",
      "Forbes",
      "NPR",
      "Business Insider"
    ],
    "domains": [
      "www.businessinsider.com",
      "www.forbes.com",
      "news.google.com",
      "www.npr.org"
    ],
    "snippets": [
      "At a service focused on Kirk's conservative Christian faith, President Trump described the late 31-year-old as the \"greatest evangelist for American liberty\" as Kirk's widow forgave the alleged gunman.",
      "<a href=\"https://news.google.com/rss/articles/CBMieEFVX3lxTFBJLVJlb2hyTEJaMVp1TDZxWWxNTE94bnh1WWJqWmFieXJBbFlMYWlZQ1FKNDdSWXRnYXlVckp0T2ZZcDFUWGNCbXlWd0E1d3dnU3JHZWh2MWZSSEs2QTBISDZ5aURDVFNhcHpleGdZaEo0amR4bTlJTA?oc=5\" target=\"_blank\">Photos: Scenes from Charlie Kirk's memorial service</a>&nbsp;&nbs",
      "At Charlie Kirk's memorial, Elon Musk and Donald Trump were seen together for the first time since their public fall out over Trump's spending bill.",
      "Erika Kirk, the slain activist’s widow who took over as CEO of Turning Point USA, also addressed the crowd of mourners at State Farm Stadium."
    ],
    "image_url": "",
    "titles": [
      "Trump calls Charlie Kirk 'martyr now for American freedom' at memorial service",
      "Photos: Scenes from Charlie Kirk's memorial service - Axios",
      "Elon Musk and Donald Trump were seen publicly together for the first time since May at Charlie Kirk's memorial service",
      "Charlie Kirk Memorial: Trump Says He’ll Award Kirk Presidential Medal Of Freedom"
    ],
    "score_components": {
      "magnitude": 0.932,
      "recency": 0.729,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.774,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "At Charlie Kirk's memorial service, President Trump praised the late activist as the \"greatest evangelist for American liberty\" and his widow, Erika Kirk, forgave the alleged gunman. Erika, now CEO of Turning Point USA, spoke to mourners at State Farm Stadium. The event also marked the first public appearance together of Trump and Elon Musk since their disagreement over a spending bill.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Martinelli's Late Goal Earns Arsenal 1-1 Draw with Man City",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 21 Sep 2025 19:00:23 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian",
      "Al Jazeera",
      "Sky Sports"
    ],
    "domains": [
      "www.theguardian.com",
      "www.aljazeera.com",
      "www.bbc.com",
      "www.skysports.com"
    ],
    "snippets": [
      "Watch Premier League highlights as substitute Gabriel Martinelli scores in stoppage time to earn Arsenal a draw against Man City at the Emirates.",
      "Manchester City sought to defend an early Erling Haaland goal, but Gabriel Martinelli came off the bench to equalise.",
      "All the football updates as Arsenal equalise in stoppage time to draw with Manchester City at London&#039;s Emirates Stadium.",
      "<p>For Arsenal, it felt as if all hope had left the stadium. Mikel Arteta had started with the dial turned towards caution but, by the time the board went up to show seven minutes of stoppage time, the manager had torn off the handbrake, sending on attacking substitutes, praying that one of his fini",
      "Gabriel Martinelli came off the bench and scored a 93rd-minute equaliser to salvage a 1-1 draw for Arsenal against Manchester City at the Emirates Stadium."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/482f/live/76ce38b0-9711-11f0-9cf6-cbf3e73ce2b9.jpg",
    "titles": [
      "Martinelli snatches late draw for Arsenal against Man City",
      "Arsenal snatch 1-1 draw with Manchester City with late Martinelli goal",
      "Arsenal vs Manchester City 1-1: Premier League – as it happened",
      "Martinelli breaks Manchester City resistance to earn late Arsenal point",
      "Martinelli's 93rd-minute lob rescues draw for Arsenal against Man City"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.88,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.765,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Gabriel Martinelli scored a 93rd-minute equalizer as a substitute, securing a 1-1 draw for Arsenal against Manchester City at the Emirates Stadium. Manchester City had led with an early goal from Erling Haaland. The match saw Arsenal's manager, Mikel Arteta, adopt an aggressive strategy in the final moments, leading to Martinelli's crucial goal.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Mitchell Leads Fever to Victory Over Aces in WNBA Semifinal Game 1",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sun, 21 Sep 2025 19:46:01 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports",
      "Yahoo Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "sports.yahoo.com",
      "www.espn.com"
    ],
    "snippets": [
      "Kelsey Mitchell and Indiana stunned Las Vegas in Game 1. What's next for both teams in the WNBA semifinals?",
      "Kelsey Mitchell, who finished in fifth place in MVP voting, scored the second-most points in Fever playoff history on Sunday",
      "LAS VEGAS — The Aces said they spent about 90 percent of practice Saturday focused on defense, knowing what offensive firepower awaited them in the Indiana Fever.It still wasn’t enough. Indiana had its way with No. 2 seed Las Vegas, shooting 50 percent from the field in an 89-73 win, its second cons"
    ],
    "image_url": "",
    "titles": [
      "How the Fever stunned the Aces and stole Game 1 in the WNBA semifinals",
      "WNBA playoffs: Indiana Fever stun Las Vegas Aces behind Kelsey Mitchell's 34 points in Game 1 of semifinals",
      "Indiana Fever make WNBA semifinals statement with 1-0 series lead at Las Vegas Aces"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.992,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.76,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Kelsey Mitchell led the Indiana Fever to an 89-73 victory over the Las Vegas Aces in Game 1 of the WNBA semifinals, scoring the second-most points in Fever playoff history. Despite the Aces focusing 90% of their practice on defense, Indiana shot 50% from the field, stunning the No. 2 seed Las Vegas.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Israeli Drone Strike Kills 5 in Lebanon, Gaza Strikes Claim 40 Lives",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sun, 21 Sep 2025 20:48:37 +0000",
    "source": "Al Jazeera",
    "sources": [
      "CityNews",
      "The Guardian",
      "Al Jazeera"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "www.theguardian.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Israel says Hezbollah member killed in strike, but Lebanon says attack is a &#039;crime against civilians&#039;.",
      "<p>Military steps up Gaza City takeover campaign as high-rise towers targeted and residents ordered to leave</p><p>Israeli strikes killed at least 40 people in Gaza on Sunday, including 19 women and children, as well as five people in Lebanon.</p><p>At least 14 people were killed in a single strike ",
      "BEIRUT (AP) — An Israeli drone strike in southern Lebanon killed five people Sunday, including three children, Lebanon&#8217;s Health Ministry said. Two others were wounded, including the mother in the family. The Israeli military said it was targeting a Hezbollah militant, and that he “operated fro"
    ],
    "image_url": "",
    "titles": [
      "US children among five killed in Israeli drone strike on southern Lebanon",
      "At least 40 killed in Gaza and five in Lebanon in Israeli strikes",
      "Israeli drone strike kills 5, including 3 children, in southern Lebanon"
    ],
    "score_components": {
      "magnitude": 0.887,
      "recency": 0.933,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.744,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "An Israeli drone strike in southern Lebanon killed five people, including three children, as per Lebanon's Health Ministry. Israel claims it targeted a Hezbollah militant. Concurrently, Israeli strikes in Gaza resulted in 40 deaths, including 19 women and children, with at least 14 killed in a single strike. Lebanon has condemned the attack as a crime against civilians, while Israel intensifies its Gaza City takeover, targeting high-rise buildings and ordering evacuations.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "A'ja Wilson Wins WNBA MVP Again, First to Claim Title Four Times",
    "domain": "sports",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sun, 21 Sep 2025 13:32:26 -0400",
    "source": "NPR",
    "sources": [
      "Sportsnet",
      "Forbes",
      "NPR"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.forbes.com",
      "www.npr.org"
    ],
    "snippets": [
      "Wilson, a 6-foot-4 center for the Las Vegas Aces, has dominated this year. In her eighth season, she finished in the top five in points, rebounds, blocks and steals.",
      "Las Vegas Aces' A'ja Wilson was awarded 2025 WNBA MVP, her fourth win in eight seasons. Wilson stands as the only player in league history to win the award four times.",
      "<p>Las Vegas Aces star A&#8217;ja Wilson is in a class by herself, winning the WNBA MVP for an unprecedented fourth time.</p>"
    ],
    "image_url": "",
    "titles": [
      "A'ja Wilson snags a record fourth WNBA MVP",
      "Las Vegas Aces A’ja Wilson Sets New Standard, Wins Fourth MVP",
      "Aces’ Aja Wilson named WNBA MVP, becomes first four-time winner"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.871,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.743,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A'ja Wilson has been named the WNBA's MVP for the second consecutive year, marking her as the league's first four-time MVP. This achievement highlights her continued excellence and record-breaking performance in women's basketball.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UK Approves Gatwick's £2.2bn Expansion for 100K More Flights Annually",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 21 Sep 2025 20:49:06 GMT",
    "source": "BBC",
    "sources": [
      "Financial Times",
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "www.ft.com",
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "There has been strong opposition against the airport wanting to use its northern runway.",
      "<p>Heidi Alexander approves expansion to allow 100,000 more flights a year</p><p>Gatwick airport’s £2.2bn second runway plan has been given the go-ahead by the transport secretary, Heidi Alexander.</p><p>With the privately financed project, the West Sussex hub is aiming to increase its capacity by 1",
      "Prime minister backs growth-creating projects in London area despite environmental objections"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/7630/live/6ef857a0-9712-11f0-9cf6-cbf3e73ce2b9.jpg",
    "titles": [
      "Gatwick second runway plan approved by transport secretary",
      "Gatwick given green light for £2.2bn second runway plan",
      "UK government approves second runway at Gatwick airport"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.914,
      "consensus": 0.789,
      "constructiveness": 0.2,
      "proximity": 0.5
    },
    "score": 0.74,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The UK Transport Secretary, Heidi Alexander, has approved Gatwick Airport's £2.2bn plan for expanding its northern runway, allowing 100,000 additional flights annually. This decision, supported by the Prime Minister, aims to boost growth in the London area, despite facing significant environmental objections. The project is privately financed and seeks to increase the West Sussex hub's capacity.",
    "constructiveness_score": 0.2,
    "constructiveness_reason": "keywords: plan, support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Aaron Rodgers Surpasses Favre with 509th TD, Critiques Team Performance",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sun, 21 Sep 2025 22:26:34 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sportsnet",
      "Sky Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "www.sportsnet.ca",
      "www.skysports.com"
    ],
    "snippets": [
      "Rodgers takes over sole possession of fourth on the TD list and is sixth in career yards",
      "Pittsburgh Steelers quarterback Aaron Rodgers threw his 509th TD, moving to 4th all-time, in their game against the New England Patriots.",
      "<p>Aaron Rodgers doesn&#8217;t think the Steelers did nearly enough with the chances they had with the ball against the Patriots.</p>",
      "<p>Watch as Pittsburgh Steelers’ Aaron Rodgers connects with DK Metcalf in the end zone for his 509th career passing touchdown, surpassing Brett Favre for the fourth most passing touchdowns of all time.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/21/0e9dc063-785f-4aa3-bc94-4ba20be3777e/untitled-design-2025-09-21t112000-521.png",
    "titles": [
      "Steelers' Aaron Rodgers passes former Packers teammate Brett Favre on NFL's career touchdown pass list",
      "Rodgers passes Favre for 4th on all-time touchdown list",
      "Rodgers passes Favre on all-time TDs list in win over Patriots",
      "Aaron Rodgers passes Favre for fourth most TDs in NFL history with 509"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.965,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.73,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Aaron Rodgers, quarterback for the Pittsburgh Steelers, threw his 509th career touchdown pass, surpassing Brett Favre to take sole possession of fourth place on the all-time passing touchdowns list. Despite this milestone, Rodgers expressed dissatisfaction with the team's performance in their game against the New England Patriots.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Cyberattack Hits Major European Airports, Causes Delays and Cancellations",
    "domain": "general",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Sun, 21 Sep 2025 12:34:51 -0400",
    "source": "ABC News",
    "sources": [
      "ABC News",
      "CityNews",
      "CNBC"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "www.cnbc.com",
      "abcnews.go.com"
    ],
    "snippets": [
      "A cyberattack targeting check-in and boarding systems has disrupted air traffic at several major European airports",
      "Brussels Airport said it expected heavy disruption and flight cancellations into Sunday as a result of the cyberattack.",
      "BRUSSELS (AP) — Fallout from a cyberattack that disrupted check-in systems at several European airports extended into a second full day on Sunday, as passengers faced dozens of canceled and delayed flights — and the impact poised to worsen for at least one major airport. Brussels Airport, seemingly "
    ],
    "image_url": "https://s.abcnews.com/images/International/wirestory_29b6d890baf7ac3a22f0f2b2f169b890_4x3_384.jpg",
    "titles": [
      "Cyberattack disrupts check-in systems at major European airports",
      "What we know about the cyberattack that hit major European airports",
      "Airport cyberattack disrupts more flights across Europe"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.854,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.715,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A cyberattack disrupted check-in and boarding systems at several major European airports, including Heathrow, Brussels, and Berlin's Brandenburg, causing delays and cancellations. The attack targeted a service provider used by these airports, leading to a reliance on manual processes. Despite the disruptions, the impact on travelers was described as limited, but the incident highlighted security vulnerabilities in airport systems.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "NATO Jets Track Russian Plane Over Baltic Amid Ignored Contact Attempts",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sun, 21 Sep 2025 15:56:28 +0000",
    "source": "Al Jazeera",
    "sources": [
      "The Guardian",
      "Global News",
      "Al Jazeera"
    ],
    "domains": [
      "globalnews.ca",
      "www.theguardian.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "German air force says its &#039;quick reaction alert force&#039; was ordered by NATO to investigate plane in neutral airspace.",
      "<p>Russian Il-20M reconnaissance plane ignored requests to make contact, in latest of what are seen as provocative acts by Kremlin</p><p>Two German Eurofighter jets <a href=\"https://www.spiegel.de/ausland/ostsee-russisches-militaerflugzeug-loest-alarmstart-von-eurofightern-aus-a-178ec37b-61dc-48b4-8",
      "German and Swedish fighter jets tracked an unidentified Russian surveillance plane that military officials say was flying over the Baltic Sea on Sunday."
    ],
    "image_url": "",
    "titles": [
      "Germany scrambles jets after Russia military aircraft flies over Baltic Sea",
      "German jets scrambled after Russian military plane flies over Baltic Sea",
      "Russian surveillance planes tracked over Baltic Sea, military officials say"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.843,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.712,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "NATO ordered German air force's quick reaction alert force to investigate a Russian Il-20M reconnaissance plane flying in neutral airspace over the Baltic Sea after it ignored contact requests. German and Swedish fighter jets tracked the aircraft, marking another incident in a series of what are considered provocative acts by the Kremlin.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Cyber Incident at Collins Aerospace Disrupts European Flights",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 21 Sep 2025 16:29:24 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "TechCrunch",
      "The Guardian"
    ],
    "domains": [
      "techcrunch.com",
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The issue affecting check-in and baggage systems caused hundreds of delays and cancellations on Saturday.",
      "<p>Zaventem asks airlines to cancel half of Monday departures, while most of Heathrow flights expected to operate </p><p>Hundreds of thousands of passengers at Heathrow and Berlin airports faced flight delays on Sunday after a <a href=\"https://www.theguardian.com/uk-news/2025/sep/20/heathrow-airport",
      "Travelers at major European airports including Heathrow, Brussels, and Berlin faced significant delays this weekend following what Collins Aerospace described as a “cyber-related incident.”"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/5616/live/42744a10-96c0-11f0-90f2-5f87cb020b24.jpg",
    "titles": [
      "Heathrow warns of second day of disruption after cyber-attack",
      "Disruption continues at Heathrow, Brussels and Berlin airports after cyber-attack",
      "Hundreds of flights delayed at Heathrow and other airports after apparent cyberattack"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.835,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.704,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A cyber-related incident by Collins Aerospace led to major disruptions at European airports, including Heathrow, Brussels, and Berlin, causing hundreds of flight delays and cancellations over the weekend. Zaventem Airport requested airlines to cancel half of Monday's departures, though most of Heathrow's flights were expected to operate normally.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Thousands Attend Charlie Kirk Memorial; Musk Joins Trump",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 21 Sep 2025 23:40:46 GMT",
    "source": "BBC",
    "sources": [
      "Fortune",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "fortune.com"
    ],
    "snippets": [
      "Tens of thousands of people gathered at State Farm Stadium for Charlie Kirk's memorial in Glendale, Arizona.",
      "Before Trump took the stage to address the crowd, Musk went up to the president where he was sitting and sat down in an empty seat next to him."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/28ea/live/04cb42a0-9746-11f0-84c8-99de564f0440.jpg",
    "titles": [
      "Watch: Moments from Kirk's memorial service",
      "‘For Charlie’ — Trump and Elon Musk reunite at Kirk’s memorial service, months after stunning feud that appeared to end alliance"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.97,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.656,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Tens of thousands attended a memorial for Charlie Kirk at State Farm Stadium in Glendale, Arizona. Before Donald Trump spoke to the crowd, Elon Musk approached and sat next to him, taking an empty seat.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Administration to Endorse Leucovorin for Autism Treatment",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Sun, 21 Sep 2025 21:32:54 GMT",
    "source": "CNBC",
    "sources": [
      "The Guardian",
      "CNBC"
    ],
    "domains": [
      "www.theguardian.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "Federal health officials also are expected to highlight leucovorin as a potential autism treatment, according to The Washington Post.",
      "<p>Washington Post says announcement imminent despite guidelines showing drug – known as paracetamol elsewhere - is safe for pregnant women to take</p><p>Donald Trump’s <a href=\"https://www.theguardian.com/us-news/trump-administration\">administration</a> is on Monday expected to tie pregnant women’s"
    ],
    "image_url": "",
    "titles": [
      "Trump administration reportedly plans to link autism to Tylenol use during pregnancy",
      "Trump officials reportedly set to tie Tylenol to autism risk"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.928,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.648,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Federal health officials are expected to endorse leucovorin as a potential autism treatment, as per The Washington Post. Despite guidelines indicating the safety of paracetamol (known as leucovorin elsewhere) for pregnant women, this announcement is anticipated to come from Donald Trump's administration on Monday.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Browns Upset Packers 13-10; Judkins, Szmyt Seal Win",
    "domain": "business",
    "source_domain": "www.forbes.com",
    "location": "global",
    "published": "Sun, 21 Sep 2025 17:23:55 -0400",
    "source": "Forbes",
    "sources": [
      "Sportsnet",
      "Forbes"
    ],
    "domains": [
      "www.forbes.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "The Green Bay Packers suffered a stunning 13-10 loss to Cleveland on Sunday.",
      "The Green Bay Packers had one of their worst performances of the Matt LaFleur-era Sunday and suffered a shocking 13-10 loss to Cleveland.",
      "<p>Rookie Quinshon Judkins ran for 94 yards on 18 carries and scored his first career touchdown before Andre Szmyt drilled a 55-yard game-winning field goal as the Cleveland Browns upset the Green Bay Packers 13-10.</p>"
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/68d06c47733a0f59c13a85ab/0x0.jpg?width=960",
    "titles": [
      "By The Numbers: Cleveland Browns 13, Green Bay Packers 10",
      "The Good, Bad And A Lot Of Ugly From The Green Bay Packers’ Loss To The Cleveland Browns",
      "NFL Highlights: Browns 13, Packers 10"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.944,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.644,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Green Bay Packers faced a surprising defeat against the Cleveland Browns with a final score of 13-10 on Sunday. This loss is highlighted as one of the team's poorest performances under coach Matt LaFleur. Key moments included rookie Quinshon Judkins running for 94 yards and scoring his first career touchdown, followed by Andre Szmyt securing the victory for Cleveland with a 55-yard field goal.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump to Nominate Halligan as Virginia Chief Prosecutor, Urges Legal Action",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sun, 21 Sep 2025 06:06:39 -0400",
    "source": "NPR",
    "sources": [
      "Fortune",
      "NPR"
    ],
    "domains": [
      "fortune.com",
      "www.npr.org"
    ],
    "snippets": [
      "President Donald Trump said Saturday that he would be nominating senior White House aide Lindsey Halligan to serve as the top federal prosecutor for the Virginia office that was thrown into turmoil when its U.S. attorney was pushed out Friday.",
      "The announcement came as Trump pressed Attorney General Pam Bondi to move forward with pursuing cases against some of his political opponents."
    ],
    "image_url": "",
    "titles": [
      "Trump nominates White House aide to be top US prosecutor for office probing Letitia James",
      "Trump nominates White House aide to replace U.S. attorney who was forced out after failing to prosecute president’s adversaries"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.746,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.636,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "President Donald Trump announced his intention to nominate Lindsey Halligan, a senior White House aide, as the chief federal prosecutor for the Virginia office, following the recent ousting of its U.S. attorney. Concurrently, Trump has urged Attorney General Pam Bondi to advance legal actions against his political adversaries.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Hints for NYT Strands Puzzle and Connections Game Now Online",
    "domain": "business",
    "source_domain": "www.forbes.com",
    "location": "global",
    "published": "Sun, 21 Sep 2025 19:00:18 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes"
    ],
    "domains": [
      "www.forbes.com"
    ],
    "snippets": [
      "Looking for help with today's NYT Strands puzzle? Here's an extra hint to help you uncover the right words, as well as all of today's answers and Spangram.",
      "Looking for some help with today's NYT Connections? Some hints and the answers for today's game are right here."
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/661994c1a11cd45a738c205f/0x0.jpg?width=960",
    "titles": [
      "NYT Strands Today: Hints, Spangram And Answers For Monday, September 22nd — ‘Find An Opening’",
      "Today’s NYT ‘Connections’ Hints And Answers For Sunday, September 21st"
    ],
    "score_components": {
      "magnitude": 0.373,
      "recency": 0.976,
      "consensus": 0.35,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.473,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Hints and solutions for today's New York Times Strands puzzle and Connections game are available online. These resources offer extra help for players seeking to uncover the right words in Strands and solve the Connections game, providing both hints and complete answers.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: solution",
    "constructiveness_source": "heuristic"
  }
]