[
  {
    "title": "U.S. to limit annual COVID vaccines to at-risk groups, older people",
    "domain": "general",
    "location": "national",
    "published": "Tue, 20 May 2025 15:54:52 +0000",
    "source": "Global News",
    "sources": [
      "Global News"
    ],
    "snippets": [
      "Annual COVID-19 shots for healthy younger adults and children will no longer be routinely approved under a major new vaccine policy shift unveiled Tuesday."
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/04/2866230445aeca9165ae6439b33b96fd3403c63512530ea70a34de8f490ee62e_0d6a00.jpg?quality=85&strip=all",
    "titles": [
      "U.S. to limit annual COVID vaccines to at-risk groups, older people"
    ],
    "summary": "A new policy announced on Tuesday states that annual COVID-19 vaccinations will not be routinely recommended for healthy younger adults and children. This marks a significant change in the approach to COVID-19 vaccine administration for these age groups.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful information about a significant policy change regarding COVID-19 vaccine distribution, helping readers understand who will be prioritized for annual shots. However, it does not report on solutions or progress, nor does it provide a deep understanding of the reasons behind the decision.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.998,
      "consensus": 0.2,
      "constructiveness": 0.7
    },
    "score": 0.565,
    "normalized_score": 6.78
  },
  {
    "title": "N.S. to cover cost of shingles vaccine for residents 65 and older starting end of May",
    "domain": "general",
    "location": "national",
    "published": "Tue, 20 May 2025 15:50:36 +0000",
    "source": "Global News",
    "sources": [
      "Global News"
    ],
    "snippets": [
      "The Nova Scotia government will begin covering the cost of the shingles vaccine as of May 28 for residents aged 65 and older."
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2016/12/gbc150424immune_tnb_4.jpg?quality=85&strip=all",
    "titles": [
      "N.S. to cover cost of shingles vaccine for residents 65 and older starting end of May"
    ],
    "summary": "Starting May 28, the Nova Scotia government will cover the cost of the shingles vaccine for residents aged 65 and older. This initiative aims to reduce the incidence and severity of shingles among the elderly population in the province.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is constructive as it provides actionable information for Nova Scotia residents who are 65 and older. It also reports on a solution to reduce the incidence and severity of shingles among the elderly population, contributing to the reader's understanding of public health initiatives.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.997,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.585,
    "normalized_score": 9.0
  },
  {
    "title": "RFK Jr pressed on defunded medical research in tense Senate hearing – live",
    "domain": "general",
    "location": "global",
    "published": "Tue, 20 May 2025 15:47:14 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "snippets": [
      "<p>Trump’s health secretary earlier called for other nations to withdraw from the World Health Organization</p><p>These are challenging days for <strong>Florida</strong> governor <strong>Ron DeSantis</strong>, the man who <a href=\"https://www.theguardian.com/us-news/2024/jan/21/ron-desantis-republican-presidential-candidate-dropped-out-analysis\">would have been king</a>. Barely two and a half years since his landslide re-election and anointment as “DeFuture” of the Republican party in a <a href=\"https://nypost.com/cover/november-9-2022/\">fawning New York Post cover</a>, he stands isolated from the national political stage, feuding with his once blindingly loyal Florida legislature, and limping towards the finish line of his second term with an uncertain pathway beyond.</p><p>It has been, in the view of many analysts, a fall of stunning velocity and magnitude. And while few are willing to completely rule out a comeback for a 46-year-old politician who was the darling of the Republican hard right until he dared to challenge <strong>Donald Trump</strong> for his party’s 2024 presidential nomination, it is also clear that everything has changed.</p><p>He’s lost the ability to push things through. He’s lost that luster he had that at one time seemed like he could do no wrong in Republican conservative circles. He’s definitely come back down to earth and some of it is his own doing because if you govern with an autocratic style, that doesn’t usually make you a lot of allies.</p> <a href=\"https://www.theguardian.com/us-news/live/2025/may/20/donald-trump-plane-qatar-immigration-marco-rubio-republicans-democrats-us-politics-live-news-updates\">Continue reading...</a>",
      "<p>Trump’s health secretary earlier called for other nations to withdraw from the World Health Organization</p><p>These are challenging days for <strong>Florida</strong> governor <strong>Ron DeSantis</strong>, the man who <a href=\"https://www.theguardian.com/us-news/2024/jan/21/ron-desantis-republican-presidential-candidate-dropped-out-analysis\">would have been king</a>. Barely two and a half years since his landslide re-election and anointment as “DeFuture” of the Republican party in a <a href=\"https://nypost.com/cover/november-9-2022/\">fawning New York Post cover</a>, he stands isolated from the national political stage, feuding with his once blindingly loyal Florida legislature, and limping towards the finish line of his second term with an uncertain pathway beyond.</p><p>It has been, in the view of many analysts, a fall of stunning velocity and magnitude. And while few are willing to completely rule out a comeback for a 46-year-old politician who was the darling of the Republican hard right until he dared to challenge <strong>Donald Trump</strong> for his party’s 2024 presidential nomination, it is also clear that everything has changed.</p><p>He’s lost the ability to push things through. He’s lost that luster he had that at one time seemed like he could do no wrong in Republican conservative circles. He’s definitely come back down to earth and some of it is his own doing because if you govern with an autocratic style, that doesn’t usually make you a lot of allies.</p> <a href=\"https://www.theguardian.com/us-news/live/2025/may/20/donald-trump-plane-qatar-immigration-marco-rubio-republicans-democrats-us-politics-live-news-updates\">Continue reading...</a>"
    ],
    "image_url": "https://i.guim.co.uk/img/media/7e4808d0254082a4dee2d061dad2b9eb14b57349/213_0_1656_1325/master/1656.jpg?width=140&quality=85&auto=format&fit=max&s=a851451efafa65b82128d89699bda602",
    "titles": [
      "RFK Jr pressed on defunded medical research in tense Senate hearing – live",
      "RFK Jr pressed on defunded medical research in tense Senate hearing – live"
    ],
    "summary": "Florida Governor Ron DeSantis, once celebrated as the future of the Republican Party after a landslide re-election, is now facing significant political challenges. His feud with the Florida legislature and a diminished ability to influence policy mark a sharp decline from his previous high standing. Despite his past popularity among conservative circles, his autocratic governing style has cost him allies, leading to isolation on the national political stage. Analysts note DeSantis's fall from grace but do not completely dismiss the possibility of a political comeback.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness about the political challenges faced by Florida Governor Ron DeSantis, but it does not provide deep insights or actionable information. The story also lacks a focus on solutions, improvements, or attempts to solve problems.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.996,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.544,
    "normalized_score": 4.44
  },
  {
    "title": "Israel says ‘external pressure will not divert’ it after UK pauses trade talks – Israel-Gaza war live",
    "domain": "general",
    "location": "global",
    "published": "Tue, 20 May 2025 15:46:05 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "snippets": [
      "<p>Israel foreign ministry spokesperson accuses Britain of ‘anti-Israel obsession’ after UK pauses trade talks over blockade of Gaza</p><p><strong>Philippe Lazzarini</strong>, the commissioner-general of <strong>Unrwa</strong>, the UN agency that supports Palestinian refugees, <a href=\"https://www.euronews.com/my-europe/2025/05/20/trump-can-use-influence-to-fully-lift-gaza-aid-blockade-unrwa-chief-tells-euronews\">has been speaking to Euronews</a>.</p><p>He said US President <strong>Donald Trump</strong> has the unique power to force Israeli prime minister <strong>Benjamin Netanyahu</strong> to “change the situation” in Gaza.</p><p><em>I do believe that President Donald Trump has the necessary influence to change the situation in Gaza and make sure that the siege be lifted and that the population get access to the assistance it deserves.</em></p><p><em>It’s an outrage that we are confronted by a situation of starvation when it comes to Gaza. It’s a completely fabricated one. We are in a situation where hunger and food are being weaponised for political and military purposes…</em></p><p><em>What is needed in Gaza is a massive, unhindered, uninterrupted assistance of supply to make sure that we are reversing the trend of the spreading hunger.</em></p> <a href=\"https://www.theguardian.com/world/live/2025/may/20/israel-gaza-hamas-aid-middle-east-crisis-live-news-updates\">Continue reading...</a>"
    ],
    "image_url": "https://i.guim.co.uk/img/media/6b5bcdd74ba50b4139200e86196f3404df4b02c3/1015_625_4808_3846/master/4808.jpg?width=140&quality=85&auto=format&fit=max&s=5de9330b3589ca176cbd2a4a6847b464",
    "titles": [
      "Israel says ‘external pressure will not divert’ it after UK pauses trade talks – Israel-Gaza war live"
    ],
    "summary": "The UK has paused trade talks with Israel, citing concerns over the blockade of Gaza, leading to accusations from an Israeli foreign ministry spokesperson of an 'anti-Israel obsession.' Meanwhile, UNRWA Commissioner-General Philippe Lazzarini highlighted the severe humanitarian situation in Gaza, attributing the crisis to the blockade. He emphasized the potential influence of US President Donald Trump in persuading Israeli Prime Minister Benjamin Netanyahu to lift the siege, allowing for necessary aid and addressing the hunger crisis.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful context about the ongoing conflict between Israel and Gaza, as well as the international response. It offers insights into the political dynamics and the humanitarian crisis in Gaza. However, it does not highlight any potential solutions or progress towards resolving the issues.",
    "score_components": {
      "magnitude": 0.409,
      "recency": 0.995,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.562,
    "normalized_score": 6.44
  },
  {
    "title": "A Simple Accident review – Jafar Panahi takes us on a nightmare trip into a land of bribes and brutality",
    "domain": "general",
    "location": "global",
    "published": "Tue, 20 May 2025 15:45:01 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian"
    ],
    "snippets": [
      "<p><strong>Cannes film festival</strong> <br />An unfortunate encounter with a dog sets off a chain of surreal, grotesque events that expose the corruption and tyranny at the heart of Iran</p><p>Jafar Panahi is the veteran Iranian auteur and democracy campaigner who continues to get arrested and imprisoned, to endure film-making bans and defy the law, finding loopholes through which his movies can be made and shown abroad. And the Iranian authorities, tensely and hypocritically aware of world scrutiny and indeed the soft-power prestige still to be accrued from Panahi’s eminence, appear (almost) to tolerate it.</p><p>Now Panahi has come to Cannes with what might be his most emotionally explicit film yet: a film about state violence and revenge, about the pain of tyranny that co-exists with ostensible everyday normality. There are macabre stabs of satire, black comedy and horror-farce, and the movie almost looks like an Iranian dissident tribute to Weekend at Bernie’s or even Hitchcock’s The Trouble With Harry.</p> <a href=\"https://www.theguardian.com/film/2025/may/20/a-simple-accident-review-jafar-panahi-iran\">Continue reading...</a>"
    ],
    "image_url": "https://i.guim.co.uk/img/media/e132033f583e3febd10f9e53583dc7514379a40c/992_0_2699_2160/master/2699.jpg?width=140&quality=85&auto=format&fit=max&s=0d4330cce885b7b318e552d09d670d49",
    "titles": [
      "A Simple Accident review – Jafar Panahi takes us on a nightmare trip into a land of bribes and brutality"
    ],
    "summary": "Jafar Panahi, a renowned Iranian filmmaker and democracy advocate, has presented a new film at the Cannes Film Festival that delves into the themes of state violence and tyranny in Iran through a blend of satire, black comedy, and horror-farce. Despite facing arrests, imprisonments, and bans on filmmaking, Panahi continues to produce and showcase his work internationally, exploiting loopholes to bypass Iranian restrictions. His latest offering criticizes the corruption within Iran, using a surreal narrative that begins with a dog-related incident. This film is seen as Panahi's most emotionally",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides a deep understanding of the political and social issues in Iran through the lens of a filmmaker. It increases awareness about the state violence, tyranny, and corruption in Iran. However, it does not offer actionable insights or report on solutions to these issues.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.995,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.574,
    "normalized_score": 7.78
  },
  {
    "title": "Bold college football predictions for 2025: A jumbled SEC race, offense leads way at Penn State",
    "domain": "sports",
    "location": "national",
    "published": "Tue, 20 May 2025 15:56:45 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports"
    ],
    "snippets": [
      "Parity threatens to reign supreme in the SEC, offense is the name of the game at Penn State, plus what to make of Florida State and a potentially deep Big 12"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/05/20/2f5d2cf1-d1ff-4002-b805-9d0d05b82805/gettyimages-2171629413.jpg",
    "titles": [
      "Bold college football predictions for 2025: A jumbled SEC race, offense leads way at Penn State"
    ],
    "summary": "The SEC is experiencing a high level of parity, suggesting a more competitive landscape. Penn State is focusing heavily on offensive strategies. Meanwhile, Florida State's performance and the depth of the Big 12 conference are also under scrutiny, indicating a potentially interesting season for college football with these dynamics in play.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness about the dynamics and strategies in college football, specifically within the SEC and Penn State. It may be useful for fans or those involved in the sport, but it does not provide deeper insights or highlight any significant progress or innovation.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.998,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.525,
    "normalized_score": 2.33
  },
  {
    "title": "Notre Dame hires alum Pat Garrity to first-of-its-kind role overseeing both men's and women's basketball teams",
    "domain": "sports",
    "location": "national",
    "published": "Tue, 20 May 2025 15:53:51 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports"
    ],
    "snippets": [
      "The 1998 ND alumnus will be the general manager for both programs, as Notre Dame readies for the next major phase of college athletics"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/05/20/592e3c94-f6f5-4fb0-9419-b01b10417a28/patgarritynotredamegm-1.jpg",
    "titles": [
      "Notre Dame hires alum Pat Garrity to first-of-its-kind role overseeing both men's and women's basketball teams"
    ],
    "summary": "A 1998 Notre Dame alumnus has been appointed as the general manager for both of the university's athletic programs. This move comes as Notre Dame prepares for a significant upcoming phase in college athletics.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about a significant change in the management of Notre Dame's athletic programs. However, it does not delve into the implications of this move or provide insights into how it might affect the teams' performance or the university's athletics culture.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.997,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.535,
    "normalized_score": 3.44
  },
  {
    "title": "Angels at Athletics prediction: Odds, expert picks, starting pitchers, betting trends, and stats for May 20",
    "domain": "sports",
    "location": "national",
    "published": "Tue, 20 May 2025 15:52:16 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "snippets": [
      "Los Angeles Angels of Anaheim at Athletics Game Preview"
    ],
    "image_url": "",
    "titles": [
      "Angels at Athletics prediction: Odds, expert picks, starting pitchers, betting trends, and stats for May 20"
    ],
    "summary": "The Los Angeles Angels of Anaheim are set to play against the Athletics. This game preview covers the upcoming matchup, detailing the teams' current standings, key players, and potential strategies. It sets the stage for what is expected to be a competitive game, highlighting the strengths and weaknesses of both teams. The outcome of this game will contribute to their overall season performance.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "The story offers a detailed preview of an upcoming game, providing readers with actionable insights into the teams' standings, key players, and potential strategies. It could be more constructive if it explored the broader trends or impacts in the sport or the teams' seasons.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.997,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.555,
    "normalized_score": 5.67
  },
  {
    "title": "PODCAST: MVG vs Aspinall and the phenomenal form of Humphries and Littler!",
    "domain": "sports",
    "location": "global",
    "published": "Tue, 20 May 2025 15:51:00 BST",
    "source": "Sky Sports",
    "sources": [
      "Sky Sports"
    ],
    "snippets": [
      "The panel preview the crunch match between Michael van Gerwen and Nathan Aspinall and look at the phenomenal form of Luke Humphries and Luke Littler."
    ],
    "image_url": "https://e1.365dm.com/24/12/1920x1080/skysports-darts-podcast-love-the-darts_6765465.png?20241203161513",
    "titles": [
      "PODCAST: MVG vs Aspinall and the phenomenal form of Humphries and Littler!"
    ],
    "summary": "The panel discussed the anticipated match between Michael van Gerwen and Nathan Aspinall, highlighting its significance in the competition. Additionally, they examined the exceptional performances of Luke Humphries and Luke Littler, noting their remarkable form in recent matches. This analysis sets the stage for upcoming contests and acknowledges the standout players.",
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story increases awareness of key players and matches in the competition, offering some depth and insight into their performances. However, it lacks a focus on solutions, improvements, or innovations in the sport, and it does not provide a broader context for understanding the significance of these players' form.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.997,
      "consensus": 0.2,
      "constructiveness": 0.7
    },
    "score": 0.545,
    "normalized_score": 4.56
  },
  {
    "title": "Ange Postecoglou confirms huge Tottenham injury blow for Europa League final",
    "domain": "sports",
    "location": "national",
    "published": "Tue, 20 May 2025 15:49:33 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports"
    ],
    "snippets": [
      "Midfielder Lucas Bergvall will miss the match against Manchester United on Wednesday"
    ],
    "image_url": "",
    "titles": [
      "Ange Postecoglou confirms huge Tottenham injury blow for Europa League final"
    ],
    "summary": "Midfielder Lucas Bergvall is set to miss the upcoming match against Manchester United on Wednesday due to unspecified reasons. This development affects his team's lineup for the game.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story provides basic awareness about a player's absence in an upcoming match, but it doesn't offer any deeper insight or understanding. It doesn't explain the implications of this development or provide any actionable insights for the reader.",
    "score_components": {
      "magnitude": 0.339,
      "recency": 0.996,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.504,
    "normalized_score": 0.0
  },
  {
    "title": "New grads are nervous about negotiating their salaries—an expert’s tips for doing it effectively",
    "domain": "business",
    "location": "national",
    "published": "Tue, 20 May 2025 15:58:56 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "snippets": [
      "According to an April survey by banking app Chime, 54% of new grads said they find salary negotiation to be \"more painful than breaking up with a partner.\""
    ],
    "image_url": "",
    "titles": [
      "New grads are nervous about negotiating their salaries—an expert’s tips for doing it effectively"
    ],
    "summary": "A survey conducted by Chime in April revealed that 54% of new graduates find the process of salary negotiation to be more challenging and painful than ending a romantic relationship. This highlights the significant stress and discomfort associated with financial discussions for those entering the workforce.",
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story clearly highlights a problem (new graduates' discomfort with salary negotiation) and offers solutions (expert tips for effective negotiation). It increases awareness about a trend and provides actionable insights for readers, particularly new graduates entering the workforce.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.998,
      "consensus": 0.2,
      "constructiveness": 0.9
    },
    "score": 0.585,
    "normalized_score": 9.0
  },
  {
    "title": "Top Stock Movers Now: Viking, Moderna, Uber Technologies, and More",
    "domain": "business",
    "location": "global",
    "published": "Tue, 20 May 2025 15:56:53 GMT",
    "source": "Investopedia",
    "sources": [
      "Investopedia"
    ],
    "snippets": [
      "<figure><img alt=\"Stefan Sauer / picture alliance via Getty Images Shares of cruise operators dropped when Viking Holdings reported fewer passengers than expected in the first quarter.\" src=\"https://www.investopedia.com/thmb/PAuRmX_s_8pgRjl2H1XdS72EdHA=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2215144680-f2f9cf95568b4d6693a60fab9ab09c48.jpg\" title=\"The \" /><figcaption><i><p>Stefan Sauer / picture alliance via Getty Images</p> Shares of cruise operators dropped when Viking Holdings reported fewer passengers than expected in the first quarter.</i></figcaption></figure><br /><h3>Key Takeaways</h3><ul><li>U.S. equities were down at midday as tech and travel shares fell.</li><li>Airbnb ordered by Spanish authorities to take down 66,000 listings there.</li><li>Moderna shares soared following a decision by the Food and Drug Administration about approving COVID-19 vaccine boosters.</li></ul><br /><br /><p>U.S. equities were lower at midday, dragged by tech and travel stocks. The <a href=\"https://www.investopedia.com/terms/d/djia.asp\">Dow Jones Industrial Average</a>, <a href=\"https://www.investopedia.com/terms/s/sp500.asp\">S&amp;P 500</a>, and <a href=\"https://www.investopedia.com/terms/n/nasdaq.asp\">Nasdaq</a> were all lower.</p><p>Shares of cruise operators dropped when Viking Holdings (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;VIK\">VIK</a>) reported fewer passengers than expected in the first quarter.</p><p>Airbnb (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;ABNB\">ABNB</a>) shares fell after Spanish officials ordered the vacation rental site to take down 66,000 listings, accusing it of violating housing rules.</p><p>Shares of power provider AES (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;AES\">AES</a>) tumbled on a downgrade and price target cut from Jefferies, which raised concerns about future demand for renewable energy. </p><p>Moderna (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;MRNA\">MRNA</a>) was the best-performing stock in the S&amp;P 500 as the <a href=\"https://www.investopedia.com/terms/f/fda.asp\">Food and Drug Administration (FDA)</a> set new guidelines for approving COVID-19 vaccine boosters for healthy people.</p><p>Uber Technologies (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;UBER\">UBER</a>) shares traded at a record high after JPMorgan analysts raised the price target for the ride-share company, citing upbeat comments from executives and the outlook for its position in the autonomous vehicle (AV) technology market.</p><p>Also hitting an all-time high were shares of Amer Sports (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;AS\">AS</a>). The athletic apparel and equipment manufacturer topped profit and sales forecasts and boosted its outlook on higher sales of its running shoes. Amer Sports also said its performance will continue to grow despite U.S. tariffs. </p><p>Oil futures declined. Gold prices and the yield on the 10-year Treasury note rose. The U.S. dollar lost ground to the euro, pound, and yen. Most major cryptocurrencies traded lower.<br /></p><figure><img alt=\"TradingView\" src=\"https://www.investopedia.com/thmb/kbIS_Vi45BjUSfg1ZRBoo_9lh2U=/fit-in/640x480/MRNA_2025-05-20_11-35-01-3aae363ce5344b1f98daf64b4a916951.png\" title=\"MRNA\" /><figcaption><i><p>TradingView</p></i></figcaption></figure>"
    ],
    "image_url": "https://www.investopedia.com/thmb/PAuRmX_s_8pgRjl2H1XdS72EdHA=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2215144680-f2f9cf95568b4d6693a60fab9ab09c48.jpg",
    "titles": [
      "Top Stock Movers Now: Viking, Moderna, Uber Technologies, and More"
    ],
    "summary": "U.S. equities declined midday, influenced by a drop in tech and travel stocks, including a significant fall in cruise operator shares after Viking Holdings reported lower than expected passenger numbers in Q1. Airbnb faced regulatory challenges in Spain, being ordered to remove 66,000 listings for housing rule violations. Moderna's stock surged following FDA's new guidelines on COVID-19 vaccine boosters for healthy individuals. Uber Technologies and Amer Sports reached record highs, attributed to positive analyst outlooks and strong financial performance, respectively. Meanwhile, oil futures f",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides useful information about current trends in the stock market, including specific companies' performances and influencing factors. However, it lacks a clear focus on solutions or improvements, and it doesn't provide actionable insights for readers beyond basic awareness.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.998,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.555,
    "normalized_score": 5.67
  },
  {
    "title": "Home Depot checks the most important boxes for investors despite earnings miss",
    "domain": "business",
    "location": "national",
    "published": "Tue, 20 May 2025 15:48:46 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "snippets": [
      "Shares of the home improvement retailer bucked the broader market decline in Tuesday's session."
    ],
    "image_url": "",
    "titles": [
      "Home Depot checks the most important boxes for investors despite earnings miss"
    ],
    "summary": "In Tuesday's trading session, shares of a home improvement retailer experienced an increase, contrasting with the overall market trend, which saw a decline.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "The story provides useful information for investors, offering some insight into the performance of a major retailer. However, it lacks detail on the specific reasons for the increase in shares and doesn't provide any solution or innovation that would make it more constructive.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.996,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.554,
    "normalized_score": 5.56
  },
  {
    "title": "As student loan delinquencies spike, borrowers risk 'potential spillovers' with other late payments, NY Fed says",
    "domain": "business",
    "location": "national",
    "published": "Tue, 20 May 2025 15:45:27 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "snippets": [
      "Millions of borrowers who are late on their student loan payments are at risk of falling behind on other debts, the New York Fed says."
    ],
    "image_url": "",
    "titles": [
      "As student loan delinquencies spike, borrowers risk 'potential spillovers' with other late payments, NY Fed says"
    ],
    "summary": "The New York Federal Reserve has reported that millions of borrowers who are currently behind on their student loan payments are also at risk of defaulting on additional debts. This situation indicates a potential financial strain on these individuals, highlighting concerns about their broader financial stability.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story offers a deeper understanding of the potential financial strain on individuals with student loan debt, increasing awareness around a significant societal issue. However, it does not provide actionable insights for the affected individuals or report on any potential solutions to the problem.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.995,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.574,
    "normalized_score": 7.78
  },
  {
    "title": "FDA outlines stricter Covid vaccine booster approval standards for healthy people",
    "domain": "business",
    "location": "national",
    "published": "Tue, 20 May 2025 15:42:44 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "snippets": [
      "The FDA recommended different standards of evidence for approval based on patients' risk of getting severely sick from Covid."
    ],
    "image_url": "",
    "titles": [
      "FDA outlines stricter Covid vaccine booster approval standards for healthy people"
    ],
    "summary": "The FDA has issued new guidelines recommending varying levels of evidence for COVID-19 treatment approvals, based on the severity of patients' risk. This approach aims to streamline the approval process by adjusting the evidence required for treatments, depending on whether patients are at a high risk of becoming severely ill from COVID-19.",
    "constructiveness_score": 1.0,
    "constructiveness_reason": "This story clearly highlights a solution to a problem (streamlining the COVID-19 treatment approval process) and provides empowering knowledge for readers to understand the varying levels of evidence required for treatment approvals. It contributes meaningfully to the reader's understanding and decision-making.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.995,
      "consensus": 0.2,
      "constructiveness": 1.0
    },
    "score": 0.594,
    "normalized_score": 10.0
  },
  {
    "title": "Rats Are Spreading a Deadly Disease in Boston",
    "domain": "science",
    "location": "global",
    "published": "Tue, 20 May 2025 15:06:39 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/rats-are-spreading-a-deadly-disease-in-boston/\" rel=\"nofollow\" title=\"Rats Are Spreading a Deadly Disease in Boston\"><img alt=\"Rat in Pipe\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Rat-in-Pipe-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>Researchers studied rodent behavior to understand the relationships between different populations and how their movements contribute to the spread of leptospirosis. Urban rats are on the move, and they may be carrying more than just a nuisance. According to a new six-year study led by Tufts University, rats migrating through cities are spreading a harmful [...]"
    ],
    "image_url": "",
    "titles": [
      "Rats Are Spreading a Deadly Disease in Boston"
    ],
    "summary": "A six-year study by Tufts University has found that urban rats in Boston are spreading leptospirosis, a deadly disease. The research focused on rodent behavior and how their movements between populations contribute to disease transmission.",
    "constructiveness_score": 0.6,
    "constructiveness_reason": "This story provides valuable information about a health risk in a specific location, potentially prompting readers to take precautions. However, it doesn't offer solutions or specific actions to mitigate the problem, nor does it provide an in-depth understanding of the system or cause behind the disease transmission.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.986,
      "consensus": 0.2,
      "constructiveness": 0.6
    },
    "score": 0.551,
    "normalized_score": 5.22
  },
  {
    "title": "Young Adults See Alarming Spike in 14 Types of Cancer, NIH Report Reveals",
    "domain": "science",
    "location": "global",
    "published": "Tue, 20 May 2025 14:41:32 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/young-adults-see-alarming-spike-in-14-types-of-cancer-nih-report-reveals/\" rel=\"nofollow\" title=\"Young Adults See Alarming Spike in 14 Types of Cancer, NIH Report Reveals\"><img alt=\"Biological Cancer Disease Cells\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Biological-Cancer-Disease-Cells-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>Although cancer incidence rates are rising, overall cancer deaths among young people have not increased. Researchers at the National Institutes of Health (NIH) have uncovered some important trends in cancer cases across the United States. Between 2010 and 2019, they found that 14 types of cancer became more common among people under the age of [...]"
    ],
    "image_url": "",
    "titles": [
      "Young Adults See Alarming Spike in 14 Types of Cancer, NIH Report Reveals"
    ],
    "summary": "A National Institutes of Health (NIH) report has found a significant increase in 14 types of cancer among young adults in the United States from 2010 to 2019. Despite this rise in incidence rates, the overall death rate from cancer in this age group has not increased.",
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story raises awareness about a significant health trend among young adults, but it doesn't provide actionable insights or deeper understanding of the causes behind the increase. It also lacks information about potential solutions or preventative measures, limiting its constructive value.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.981,
      "consensus": 0.2,
      "constructiveness": 0.5
    },
    "score": 0.54,
    "normalized_score": 4.0
  },
  {
    "title": "Bird Flu Is Now Killing Cats at a 90% Fatality Rate – Experts Warn It Could Jump to Humans",
    "domain": "science",
    "location": "global",
    "published": "Tue, 20 May 2025 14:16:21 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/bird-flu-is-now-killing-cats-at-a-90-fatality-rate-experts-warn-it-could-jump-to-humans/\" rel=\"nofollow\" title=\"Bird Flu Is Now Killing Cats at a 90% Fatality Rate – Experts Warn It Could Jump to Humans\"><img alt=\"Poultry Doctor Avian Bird Flu\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"518\" src=\"https://scitechdaily.com/images/Poultry-Doctor-Avian-Bird-Flu-777x518.jpg\" style=\"display: block; margin: auto; margin-bottom: 5px;\" width=\"777\" /></a>The first major global review of bird flu in cats reveals an emerging threat of a potential human pandemic. Spring is here, birds are on the move, and a new threat is spreading alongside them: bird flu (H5N1). This virus is changing fast and could be on the path to becoming a human pandemic. Scientists [...]"
    ],
    "image_url": "",
    "titles": [
      "Bird Flu Is Now Killing Cats at a 90% Fatality Rate – Experts Warn It Could Jump to Humans"
    ],
    "summary": "A global review has identified a significant threat from bird flu (H5N1), which is now killing cats with a 90% fatality rate and may potentially jump to humans, raising concerns about a human pandemic. The virus is evolving rapidly, with increased bird migrations in spring facilitating its spread.",
    "constructiveness_score": 0.3,
    "constructiveness_reason": "While the story raises awareness about a potential health threat, it leans towards sensationalism with its focus on high fatality rates and the possibility of a human pandemic. It doesn't provide actionable insights, solutions, or a deeper understanding of the situation, making it less constructive.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.975,
      "consensus": 0.2,
      "constructiveness": 0.3
    },
    "score": 0.518,
    "normalized_score": 1.56
  },
  {
    "title": "Ancient Maltese temples may have been schools for celestial navigation",
    "domain": "science",
    "location": "global",
    "published": "Tue, 20 May 2025 13:00:28 +0100",
    "source": "New Scientist",
    "sources": [
      "New Scientist"
    ],
    "snippets": [
      "The alignment of some megalithic temples in Malta suggests they may have been used to teach sailors how to navigate by the stars"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/05/19162550/SEI_252119276.jpg",
    "titles": [
      "Ancient Maltese temples may have been schools for celestial navigation"
    ],
    "summary": "Recent studies of megalithic temples in Malta indicate their alignment could have served an educational purpose, specifically teaching sailors navigation by the stars. This finding sheds light on the potential use of these ancient structures beyond religious or ceremonial functions, suggesting a practical application in maritime navigation training.",
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful insights and deeper understanding of the potential use of ancient Maltese temples. It doesn't directly offer actionable insights or solutions, but it does increase awareness about historical systems and their impacts.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.943,
      "consensus": 0.2,
      "constructiveness": 0.8
    },
    "score": 0.558,
    "normalized_score": 6.0
  },
  {
    "title": "Wild spinach offers path to breed disease resistance into cultivated varieties",
    "domain": "science",
    "location": "global",
    "published": "Tue, 20 May 2025 11:59:03 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "snippets": [
      "Several varieties of wild spinach that originated in Central Asia show resistance to a destructive soil-borne pathogen that beleaguers growers of spinach seed in the Pacific Northwest—a finding that can be used to breed hardier crops."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/wild-spinach-offers-pa.jpg",
    "titles": [
      "Wild spinach offers path to breed disease resistance into cultivated varieties"
    ],
    "summary": "Researchers have discovered that certain wild spinach varieties from Central Asia are resistant to a harmful soil-borne pathogen affecting spinach seed production in the Pacific Northwest. This discovery provides valuable information for breeding more resilient spinach crops.",
    "constructiveness_score": 1.0,
    "constructiveness_reason": "This story clearly highlights a solution to a problem (disease in spinach crops), provides actionable insights for future crop breeding, and increases awareness about the potential of wild varieties in improving cultivated crops. It contributes meaningfully to the reader’s understanding and decision-making in the field of agriculture.",
    "score_components": {
      "magnitude": 0.389,
      "recency": 0.943,
      "consensus": 0.2,
      "constructiveness": 1.0
    },
    "score": 0.579,
    "normalized_score": 8.33
  }
]