[
  {
    "title": "Afghanistan Earthquake Kills 600, Injures 1,300 Near Pakistan Border",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Mon, 01 Sep 2025 02:52:38 -0400",
    "source": "NPR",
    "sources": [
      "Axios",
      "ABC News",
      "Washington Post",
      "New York Times",
      "Phys.org",
      "NPR",
      "The Guardian",
      "Al Jazeera",
      "Global News",
      "CityNews"
    ],
    "domains": [
      "globalnews.ca",
      "www.nytimes.com",
      "www.aljazeera.com",
      "abcnews.go.com",
      "news.google.com",
      "ottawa.citynews.ca",
      "phys.org",
      "www.theguardian.com",
      "www.npr.org",
      "www.washingtonpost.com"
    ],
    "snippets": [
      "The 6.0 magnitude quake late Sunday hit a series of towns in the province of Kunar, near the city of Jalalabad in neighboring Nangahar province, causing extensive damage.",
      "Magnitude 6.1 tremor hits eastern provinces of Kunar and Nangarhar, and government spokesman warns toll could rise.",
      "<a href=\"https://news.google.com/rss/articles/CBMiggFBVV95cUxQc05iRnZ2aGFBbVQ2aTJPZ05wNkd2U2VVbTUtV1Q2QWZYZ09xVkNncXhMWVIwNzRlWklZaUVWcEFuSDA0a2Y0aTdJX2xJaFpYbUFlSlpwSnFnR2UxRmQzYmJIUVg5Wnh1blFrVF9lN1V2VVZteHczVExCdnVoZDJ4OGdn?oc=5\" target=\"_blank\">Hundreds killed after 6.0-magnitude earthquake stri",
      "The strong earthquake struck about 17 miles east of Jalalabad, near the border with Pakistan, according to preliminary data from the U.S. Geological Survey.",
      "<p>Rescuers try to reach people trapped under mud and debris while hampered by destroyed roads and steep terrain</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/sep/01/afghanistan-earthquake-live-hundreds-after-shallow-quake-strikes-countrys-east-state-media-reports\">Afghanistan e",
      "The 6.0-magnitude earthquake that hit Jalalabad injured 2,800 others, the Taliban-run government said. The quake was felt as far as neighboring Pakistan.",
      "The quake, near the border with Pakistan, injured more than 2,500 people in mountainous areas that rescue workers took hours to reach.",
      "Hundreds of people were killed and more than 2,500 were injured, according to the Taliban government, and the death toll was expected to rise.",
      "The quake at 11:47 p.m. local time was centered 27 kilometers (17 miles) east-northeast of Jalalabad, the U.S. Geological Survey said.",
      "Desperate Afghans clawed through rubble in search of missing loved ones after a strong earthquake killed some 800 people and injured more than 2,500 in eastern Afghanistan, according to figures provided Monday by the Taliban government.",
      "KABUL, Afghanistan (AP) — Desperate Afghans clawed through rubble in search of missing loved ones after a strong earthquake killed some 800 people and injured more than 2,500 in eastern Afghanistan, according to figures provided Monday by the Taliban government. The 6.0 magnitude quake late Sunday h"
    ],
    "image_url": "",
    "titles": [
      "An earthquake devastates eastern Afghanistan, killing more than 800 people",
      "At least 800 people killed as earthquake hits eastern Afghanistan",
      "Hundreds killed after 6.0-magnitude earthquake strikes Afghanistan - Axios",
      "Hundreds killed as 6.0 magnitude earthquake strikes Afghanistan, officials say",
      "Magnitude-6 earthquake in eastern Afghanistan kills more than 800",
      "More than 800 dead after earthquake hits eastern Afghanistan, Taliban say",
      "Afghanistan Earthquake Leaves More Than 800 Dead",
      "What to Know About the Earthquake in Afghanistan",
      "Earthquake in eastern Afghanistan kills 800, injures 2,500",
      "An earthquake destroys villages in eastern Afghanistan and kills 800 people, with 2,500 injured",
      "Earthquake in eastern Afghanistan destroys villages and kills 800 people, with 2,500 injured"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.823,
      "consensus": 1.0,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.85,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A magnitude 6.0 earthquake struck eastern Afghanistan near Jalalabad and the Pakistan border late Sunday, killing over 600 people and injuring more than 1,300, as reported by the Taliban-run Interior Ministry. The quake caused extensive damage across the mountainous provinces of Kunar and Nangahar, destroying several villages. The death toll is expected to rise as rescue efforts continue.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "EU Commission Plane Lands with Maps Amid Suspected Russian GPS Jamming",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 01 Sep 2025 12:16:54 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Deutsche Welle",
      "New York Times",
      "Financial Times",
      "CNBC"
    ],
    "domains": [
      "www.nytimes.com",
      "www.cnbc.com",
      "www.dw.com",
      "www.bbc.com",
      "www.ft.com"
    ],
    "snippets": [
      "The European Commission said the plane's navigation was disrupted in Bulgaria on Sunday.",
      "Ursula von der Leyen's flight en route to Bulgaria was targeted with navigation interference, which the EU says was possibly deliberately done by Russia.",
      "The European Union said Russia was suspected of jamming the GPS system of a plane carrying European Commission President Ursula von der Leyen to Bulgaria.",
      "Officials suspect jamming operation forced jet carrying European Commission president to land in Bulgaria using paper maps",
      "The Bulgarian authorities believe that Russia disrupted navigation signals that would have been used by a plane carrying Ursula von der Leyen, European officials said."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/30c8/live/b0bf99f0-8722-11f0-95ce-ab02c3c61297.jpg",
    "titles": [
      "EU chief von der Leyen's plane hit by suspected Russian GPS jamming",
      "EU chief plane hit by suspected Russian GPS jamming",
      "Plane carrying EU leader hit with suspected Russian GPS interference",
      "Von der Leyen’s plane hit by suspected Russian GPS interference",
      "Russia Suspected of Jamming GPS for E.U. Leader’s Plane, Officials Say"
    ],
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.903,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.81,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The European Commission reported that a plane carrying President Ursula von der Leyen to Bulgaria experienced navigation disruption due to suspected GPS jamming on Sunday. The EU and Bulgarian authorities suspect Russia was behind the interference, which forced the aircraft to land using paper maps. The situation is under investigation.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Erik ten Hag Sacked by Bayer Leverkusen After Just 62 Days",
    "domain": "sports",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Mon, 01 Sep 2025 11:52:02 +0000",
    "source": "Al Jazeera",
    "sources": [
      "ESPN",
      "Sportsnet",
      "Deutsche Welle",
      "Al Jazeera"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.aljazeera.com",
      "www.dw.com",
      "www.espn.com"
    ],
    "snippets": [
      "Erik ten Hag now holds the unwanted record of breaking the previous mark for a coach of five matches before dismissal.",
      "Former Manchester United head coach Erik ten Hag has been sacked by Bayer Leverkusen after only 62 days in charge and one defeat.",
      "Former Manchester United manager Erik ten Hag has been sacked by Bayer Leverkusen after just two games in charge, the club has confirmed.",
      "<p>Erik ten Hag lasted three games at Bayer Leverkusen.</p>"
    ],
    "image_url": "",
    "titles": [
      "Ten Hag sacked by Bayer Leverkusen after two Bundesliga games in charge",
      "Bundesliga: Leverkusen sack coach ten Hag after two games",
      "Ten Hag fired by Leverkusen after just 3 games",
      "Leverkusen fires Erik ten Hag as coach after three games"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.914,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.772,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Erik ten Hag was sacked by Bayer Leverkusen after a brief tenure, lasting between two to three games, marking one of the shortest managerial stints at the club. This follows his departure from Manchester United, with his time at Leverkusen spanning only 62 days before his dismissal.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "China Pledges $280M in Aid to SCO Members at Tianjin Summit",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Mon, 01 Sep 2025 04:57:10 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "New York Times",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "www.nytimes.com",
      "www.npr.org"
    ],
    "snippets": [
      "Chinese President Xi Jinping is hosting a high-profile summit with leaders from Russia, North Korea and India gathering among others in a challenge to U.S. influence.",
      "A viral photo of Modi, Xi and Putin at the SCO summit highlights shifting power, unresolved tensions and the limits of global alliances.",
      "It is unclear if the SCO summit will pave the way for any breakthroughs in easing tensions, though Beijing has sought to cast itself as a global peacemaker.",
      "Their display of friendship in China was aimed at projecting an alternative to U.S. global leadership, even as serious differences among them remain."
    ],
    "image_url": "",
    "titles": [
      "China's Xi hosts Putin and Modi at Shanghai Cooperation Organization summit",
      "Behind the smiles with Putin, Modi and Xi at China summit",
      "China's Xi urges AI cooperation, rejects ‘Cold War mentality’ at SCO summit",
      "Xi, Putin and Modi Try to Signal Unity at China Summit"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.86,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.758,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "At a summit in Tianjin, the Chinese leader pledged $280 million in aid to members of the Shanghai Cooperation Organisation (SCO). The contribution aims to support the SCO, but it remains uncertain if this will lead to significant breakthroughs in reducing tensions among member states. Beijing is positioning itself as a global peacemaker through this gesture.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Florida State Linebacker Critically Injured in Shooting in Havana, Florida",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 1 Sep 2025 10:11:46 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.espn.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Florida State freshman linebacker Ethan Pritchard is hospitalized in critical but stable condition after suffering a gunshot wound Sunday night in Havana, Florida.",
      "Pritchard is a freshman linebacker for the Seminoles",
      "<ul><li><p>Player was shot inside car while visiting family</p></li><li><p>Freshman listed as in critical but stable condition </p></li></ul><p>A Florida State linebacker is in critical but stable condition after being shot while visiting family, the Seminoles said on Monday.</p><p>Ethan Pritchard, "
    ],
    "image_url": "",
    "titles": [
      "FSU freshman shot, in critical but stable condition",
      "Florida State LB Ethan Pritchard injured in shooting, hospitalized in critical but stable condition",
      "Florida State linebacker Ethan Pritchard in intensive care after being shot"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.959,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.754,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Florida State freshman linebacker Ethan Pritchard is in critical but stable condition after being shot Sunday night in Havana, Florida, while visiting family. He was inside a car at the time of the incident.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "2025 NFL Fantasy Insights: Breakouts, Busts, and Draft Strategy Revealed",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 1 Sep 2025 10:11:17 EST",
    "source": "ESPN",
    "sources": [
      "Yahoo Sports",
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "www.on3.com",
      "www.espn.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Weekly individual and composite rankings for each position in PPR and IDP formats, as well as Eric Karabell's superflex ranks.",
      "SportsLine simulated the NFL season 10,000 times and revealed its 2025 Fantasy football breakouts for 2025 Fantasy football draft prep",
      "SportsLine simulated the new NFL season 10,000 times and identified Fantasy football busts 2025 to fade during your Fantasy football draft prep",
      "Another week of Kentucky high school football means a fresh batch of statewide rankings. We’re now officially two weeks into the 2025 season. The Trinity Shamrocks continue to hold down the number one spot as the unanimous top team in the Bluegrass. For the second straight week, all 10 of KSR’s vote"
    ],
    "image_url": "",
    "titles": [
      "🏈 Fantasy football PPR rankings for Week 1",
      "Fantasy football rankings 2025: Breakouts, top picks from model that nailed Jayden Daniels' big season",
      "Fantasy football rankings 2025: Busts from model that was all over Raheem Mostert's tough season",
      "KSR’s 2025 Kentucky High School Football Top 25 Rankings: Week 2"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.959,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.754,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "SportsLine conducted 10,000 simulations of the new NFL season, providing insights for 2025 Fantasy football including breakouts, busts, and overall draft strategy. Additionally, weekly rankings for both PPR and IDP formats, along with Eric Karabell's superflex ranks, are available to assist with draft preparation and season planning.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Afghanistan Earthquake Kills 600, Injures 1,300 Near Pakistan Border",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 01 Sep 2025 15:49:43 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Deutsche Welle",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.bbc.com",
      "www.dw.com"
    ],
    "snippets": [
      "Hundreds of people are thought to have died in the quake, which struck in a mountainous eastern region.",
      "Entire villages have been destroyed by an earthquake in Afghanistan that has killed more than 800 people.",
      "“This is one of the most remote and also one of the most  poor parts of Afghanistan.”",
      "Authorities say more than 800 people have died as floods and rubble hinder rescue efforts.",
      "The shallow earthquake in eastern Afghanistan has destroyed several villages, causing widespread damage."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/02b1/live/b09a6ca0-874c-11f0-9cf6-cbf3e73ce2b9.jpg",
    "titles": [
      "What we know about Afghanistan earthquake - and what we don't",
      "Video: What we know about Afghanistan’s earthquake",
      "“Access is difficult” to areas in Afghanistan affected by earthquake",
      "Deadly earthquake hits Afghanistan: What we know so far",
      "Afghanistan: Hundreds killed after strong earthquake"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.972,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.741,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A magnitude 6.0 earthquake struck eastern Afghanistan near Jalalabad and the Pakistan border late Sunday, killing over 600 people and injuring more than 1,300, as reported by the Taliban-run Interior Ministry. The quake caused extensive damage across the mountainous provinces of Kunar and Nangahar, destroying several villages. The death toll is expected to rise as rescue efforts continue.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Liverpool, Newcastle Agree on Record British Transfer for Isak",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 01 Sep 2025 00:04:11 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC",
      "Sportsnet",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.bbc.com",
      "www.sportsnet.ca",
      "www.theguardian.com"
    ],
    "snippets": [
      "Liverpool agree British transfer record fee of £125m to sign striker Alexander Isak from Newcastle United.",
      "The Premier League champions&#039; signing of the Swedish international closes the summer&#039;s most drawn-out transfer saga.",
      "<ul><li><p>Striker to undergo medical after British record fee agreed</p></li><li><p>Loyalty payment could take deal to as high as £130m </p></li></ul><p>Alexander Isak is close to joining Liverpool after Newcastle accepted a British-record £125m fee for the striker.</p><p>The Sweden international w",
      "<p>One of the more dramatic and long-winded transfer sagas in recent memory appears to have finally come to an end. </p>"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/237f/live/06632f90-8712-11f0-8539-299a7a7c0d9c.jpg",
    "titles": [
      "Liverpool agree British record £125m fee for Isak",
      "Isak signs with Liverpool from Newcastle for record British fee: Report",
      "Liverpool agree £125m deal to sign Alexander Isak from Newcastle on deadline day",
      "Reports: Liverpool land Alexander Isak after Newcastle accept record fee"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.7,
      "consensus": 0.908,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.739,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Alexander Isak's transfer saga concludes as Liverpool and Newcastle United reach a British-record agreement for his move. This deal, finalizing before the transfer deadline, marks the end of Isak's recent efforts to leave Newcastle.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Warren Anticipated to Play Key Role for Pittsburgh This Season",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Mon, 01 Sep 2025 15:36:44 +0000",
    "source": "CBS Sports",
    "sources": [
      "Yahoo Sports",
      "Sportsnet",
      "CBS Sports"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.behindthesteelcurtain.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Warren is expected to have a significant role for Pittsburgh this season",
      "The Pittsburgh Steelers have locked down their starting running back",
      "<p>The Pittsburgh Steelers are committing to their starting running back.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/01/acf8aca3-c178-4a53-8796-1855f2bd228b/jaylen-warren-getty.jpg",
    "titles": [
      "Jaylen Warren contract: Steelers RB agrees to two-year extension, eyes more touches in new-look backfield",
      "Steelers RB Jaylen Warren contract extension details emerge",
      "Steelers sign running back Jaylen Warren to two-year extension, per agent"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.988,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.734,
    "summary_source": "snippet",
    "summary_reason": "retry_exhausted",
    "summary": "Warren is expected to have a significant role for Pittsburgh this season",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UK Records Warmest Summer Ever, Joins Japan and South Korea",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Mon, 01 Sep 2025 15:22:19 GMT",
    "source": "BBC",
    "sources": [
      "Phys.org",
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "www.bbc.com",
      "phys.org",
      "www.theguardian.com"
    ],
    "snippets": [
      "Provisional Met Office figures show that it has been the warmest summer on record - meaning the UK's five hottest summers have all occurred since 2000.",
      "<p>Mean temperature over June, July and August was 16.1C as country endured four heatwaves</p><p>The UK has seen its hottest summer on record, the Met Office has said, after the country sweltered under four heatwaves in a single season.</p><p>The mean temperature for meteorological summer, which enc",
      "Japan and South Korea sweltered this year through the hottest summers since records began, their weather agencies said Monday."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/2186/live/96ee8ab0-8734-11f0-9ea1-07d888221746.jpg",
    "titles": [
      "Summer 2025 confirmed as UK's hottest on record",
      "UK experienced its hottest summer on record in 2025, Met Office says",
      "Japan, South Korea endure hottest summer on record"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.963,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.729,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The UK experienced its warmest summer on record with a mean temperature of 16.1C, marked by four heatwaves, according to the Met Office. This summer joins the UK's five hottest summers, all occurring since 2000. Similarly, Japan and South Korea reported their hottest summers ever, as confirmed by their respective weather agencies.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "September Entertainment: New Books, TV Series, and Netflix Classics",
    "domain": "business",
    "source_domain": "www.newscientist.com",
    "location": "global",
    "published": "Mon, 01 Sep 2025 11:00:27 +0100",
    "source": "New Scientist",
    "sources": [
      "Business Insider",
      "New Scientist",
      "Forbes"
    ],
    "domains": [
      "www.forbes.com",
      "www.newscientist.com",
      "www.businessinsider.com"
    ],
    "snippets": [
      "Authors including literary heavyweight Ian McEwan and big hitters John Scalzi, Yume Kitasei and Cixin Liu have new sci-fi novels out this month",
      "September is packed with new and returning TV shows, from \"Tulsa King\" and \"Beauty in Black\" to \"Wednesday,\" \"Only Murders in the Building\" and more. Here’s what to stream this month.",
      "Some of the best movies coming to Netflix in September are classics like \"Idiocracy\" and \"E.T.\" You can also stream the whole \"Shrek\" series."
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/09/01094251/sei263477766.jpg",
    "titles": [
      "The best new science fiction books of September 2025",
      "The Best New TV Shows Streaming In September 2025 On Netflix, Hulu And More",
      "The 10 best movies to stream on Netflix in September"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.879,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.72,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "September brings a wave of new entertainment options. Notable authors Ian McEwan, John Scalzi, Yume Kitasei, and Cixin Liu are releasing new sci-fi novels. TV enthusiasts can look forward to new and returning series including \"Tulsa King,\" \"Beauty in Black,\" \"Wednesday,\" and \"Only Murders in the Building.\" Netflix is adding classics to its lineup, with \"Idiocracy,\" \"E.T.,\" and the entire \"Shrek\" series available for streaming.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Judge Halts Deportation of Guatemalan Children by U.S. Government",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sun, 31 Aug 2025 21:20:53 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "Axios",
      "New York Times"
    ],
    "domains": [
      "www.nytimes.com",
      "news.google.com",
      "www.npr.org"
    ],
    "snippets": [
      "As a U.S. federal judge blocked the deportation of unaccompanied Guatemalan children, the government of Guatemala says in a statement it suggested the U.S. return its children to their home country.",
      "A federal district judge issued a temporary restraining order after the U.S. attempted to deport hundreds of unaccompanied Guatemalan children without proper immigration proceedings.",
      "<a href=\"https://news.google.com/rss/articles/CBMikAFBVV95cUxQTjhWc3lTc0cwU09qZDl0WWxENWFtbXlwdUwxVEZWeWk3dW5CemVJTjhfQXRjNllNeFBGb1lrTlhIM3VCbU9rbkNaNXVTeEZwYXlyTTJYWFlESUY2WVE1SndXVGpiZTdQeEpHVldKdHQyLVBmUGFhVGs5cTkybkh2Wjd6czdBYlBSZHc0RjUtbkk?oc=5\" target=\"_blank\">Judge halts deportation of hundr",
      "The temporary block ended another last-minute flurry of legal action over the Trump administration’s immigration crackdown."
    ],
    "image_url": "",
    "titles": [
      "Guatemala says it suggested that U.S. send its unaccompanied migrant children home",
      "Hundreds of unaccompanied Guatemalan children can stay in the U.S. for now, judge says",
      "Judge halts deportation of hundreds of Guatemalan children - Axios",
      "Judge Halts U.S. Effort to Deport Guatemalan Children as Planes Sit on Tarmac"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.734,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.719,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A federal judge issued a temporary restraining order, halting the U.S. government's attempt to deport hundreds of unaccompanied Guatemalan children without proper immigration proceedings. This decision, made by District Judge Sparkle Sooknanan, comes after a legal complaint on behalf of 10 children, temporarily preventing these deportations for at least 14 days as the legal process continues. This move interrupts the Trump administration's broader immigration crackdown efforts.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Blue Jays Add Kiner-Falefa, Tate to Roster for Reds Series",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Mon, 01 Sep 2025 15:47:51 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "Sportsnet"
    ],
    "domains": [
      "globalnews.ca",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Infielder Isiah Kiner-Falefa and right-hander Dillon Tate will both be active for Monday's opener against the Cincinnati Reds, the Toronto Blue Jays announced.",
      "<p>Infielder Isiah Kiner-Falefa and right-handed pitcher Dillon Tate have been added to the team&#8217;s major league roster and will be active for the series opener against the Cincinnati Reds, the team announced Monday. </p>"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/b8c928045fbb9b31f6780e777b52e1a65dc5505573024615a89001b29364b321.jpg?quality=65&strip=all",
    "titles": [
      "Jays use extra roster spots on Kiner-Falefa, Tate",
      "Blue Jays use September roster spots on Isiah Kiner-Falefa, Dillon Tate"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.992,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.703,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Toronto Blue Jays announced that infielder Isiah Kiner-Falefa and right-handed pitcher Dillon Tate have been added to the major league roster. Both will be active for the team's series opener against the Cincinnati Reds on Monday.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Rudy Giuliani Hospitalized After Car Accident in New Hampshire",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sun, 31 Aug 2025 16:32:47 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "Deutsche Welle",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "www.dw.com",
      "www.npr.org"
    ],
    "snippets": [
      "Former New York City Mayor Rudy Giuliani has been hospitalized with a broken vertebra after a car accident in New Hampshire, according to his spokesperson.",
      "Former New York Mayor Rudy Giuliani's vehicle was \"struck from behind at high speed,\" his team said. The ex-Trump lawyer is reportedly in good spirits but will remain hospitalized.",
      "The former New York City mayor was taken to a trauma center with a fractured thoracic vertebrae, as well as lacerations and contusions, from a car accident."
    ],
    "image_url": "",
    "titles": [
      "Rudy Giuliani hospitalized with broken vertebra after car accident, spokesperson says",
      "Rudy Giuliani seriously injured in car accident",
      "Rudy Giuliani hospitalized with serious injuries after New Hampshire car accident"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.664,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.695,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Former New York City Mayor Rudy Giuliani, 81, was hospitalized after his car was struck from behind in a high-speed accident in New Hampshire. He suffered a fractured thoracic vertebra, along with lacerations and contusions. Giuliani, who was assisting a domestic violence victim at the time, is in good spirits but will remain hospitalized for his injuries.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Premier League Clubs Rush for Last-Minute Deals as Transfer Window Closes",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 1 Sep 2025 11:45:26 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.espn.com"
    ],
    "snippets": [
      "The summer transfer window closes today and all the big Premier League clubs will be busy in some way. Transfer Talk has the latest news, gossip and rumors.",
      "<ul><li><p><a href=\"https://www.theguardian.com/football/2025/sep/01/manchester-city-to-sell-ederson-to-fenerbahce-if-they-land-gianluca-donnarumma-psg\">City chase Donnarumma</a> | <a href=\"https://www.theguardian.com/football/2025/sep/01/liverpool-agree-125m-deal-to-sign-alexander-isak-from-newcast"
    ],
    "image_url": "",
    "titles": [
      "LIVE: Transfer deadline day news, updates: Liverpool close on Isak, Guéhi",
      "Transfer deadline day: Guéhi move hits snag; Isak, Jackson and Wissa deals agreed – live"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.991,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.678,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The summer transfer window is closing today, with major Premier League clubs making last-minute deals. Manchester City is pursuing Gianluca Donnarumma and may sell Ederson to Fenerbahce if successful. Meanwhile, Liverpool has agreed to a £125 million deal to sign Alexander Isak from Newcastle. These moves highlight the active participation of top clubs in the transfer market as the deadline approaches.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Donald Picks Six from Winning Team for Ryder Cup Roster",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 1 Sep 2025 10:11:17 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sky Sports"
    ],
    "domains": [
      "www.espn.com",
      "www.skysports.com"
    ],
    "snippets": [
      "Europe captain Luke Donald filled out his 12-man roster for this month's Ryder Cup with six players who helped the team win back the trophy in Rome two years ago.",
      "Luke Donald has named six of Europe's victorious 2023 Ryder Cup team as his captain's picks to complete his line-up for this year's contest in New York."
    ],
    "image_url": "",
    "titles": [
      "Donald picks familiar names for Ryder Cup team",
      "Donald selects experience as Europe's six Ryder Cup picks revealed"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.959,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.672,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Europe captain Luke Donald has selected six players from the 2023 Ryder Cup-winning team to complete his 12-man roster for this year's tournament in New York. The picks aim to replicate the success of the previous victory in Rome.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Chiefs, All-Pro McDuffie Unlikely to Agree on Extension Before Season",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Mon, 1 Sep 2025 10:11:17 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "The Chiefs and Trent McDuffie, their top cornerback, are not expected to agree to a multiyear contract extension before the start of the season.",
      "The one-time All-Pro cornerback is set to earn just $2.6 million this year"
    ],
    "image_url": "",
    "titles": [
      "Sources: Chiefs, McDuffie don't reach extension",
      "Chiefs top CB Trent McDuffie not expected to sign contract extension ahead of 2025 season, per report"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.959,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.672,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Kansas City Chiefs and cornerback Trent McDuffie are unlikely to reach a multiyear contract extension before the season begins. McDuffie, an All-Pro, is slated to earn $2.6 million this year.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Global News Outlets Demand Protection for Gaza Journalists",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Mon, 01 Sep 2025 04:58:57 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.npr.org"
    ],
    "snippets": [
      "More than 250 news outlets around the world have signed onto an appeal that calls for the protection of Palestinian journalists in Gaza, and for press to have independent access to the territory.",
      "Media outlets have staged a front page protest to highlight the killings of more than 200 journalists in 22 months."
    ],
    "image_url": "",
    "titles": [
      "Media outlets demand Israel grant access to Gaza, halt attacks on journalists there",
      "More than 250 media outlets protest over Israel murdering Gaza journalists"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.86,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.652,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Over 250 global news outlets have united in a call for the protection of Palestinian journalists in Gaza and for independent press access to the area. This movement also protests the deaths of over 200 journalists in 22 months, emphasizing the need for safety and freedom for the press in conflict zones.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Quiet on Labor Day; Kennedy Jr. Reforms Health Policies",
    "domain": "business",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Mon, 01 Sep 2025 09:44:17 -0400",
    "source": "ABC News",
    "sources": [
      "ABC News",
      "CNBC"
    ],
    "domains": [
      "abcnews.go.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "President Donald Trump begins the week with a clear public schedule on Labor Day.",
      "Health and Human Services Secretary Robert F. Kennedy Jr. has taken measures to overhaul federal health agencies and change U.S. immunization policies."
    ],
    "image_url": "https://s.abcnews.com/images/US/trump-blog-main_1756718429529_hpMain_4x3t_384.jpg",
    "titles": [
      "Trump admin live updates: Trump urges companies to 'justify' success of COVID drugs",
      "Trump tells drugmakers to 'justify the success' of Covid meds after FDA limits vaccine approval"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.95,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.652,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "President Donald Trump had no public events scheduled on Labor Day. Meanwhile, Health and Human Services Secretary Robert F. Kennedy Jr. is implementing reforms in federal health agencies and altering U.S. immunization policies.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "EU Commission President's Plane Jammed Over Bulgaria, Lands Safely",
    "domain": "business",
    "source_domain": "fortune.com",
    "location": "global",
    "published": "Mon, 01 Sep 2025 12:42:33 +0000",
    "source": "Fortune",
    "sources": [
      "Fortune",
      "CityNews"
    ],
    "domains": [
      "fortune.com",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "The plane landed safely and Ursula von der Leyen will continue her planned tour of the European Union’s nations bordering Russia and Belarus, a spokesperson said.",
      "SOFIA, Bulgaria (AP) — A plane carrying European Commission President Ursula von der Leyen was hit by GPS jamming over Bulgaria in a suspected Russian operation, a spokesperson said Monday. The plane landed safely at Plovdiv airport in central Bulgaria and von der Leyen will continue her planned tou"
    ],
    "image_url": "https://fortune.com/img-assets/wp-content/uploads/2025/07/GettyImages-2221570523-e1753191822130.jpg?w=2048",
    "titles": [
      "Russia suspected of jamming navigation on European Commission president’s plane, official says",
      "Russia is suspected of jamming navigation on EU leader’s plane above Bulgaria, official says"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.93,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.641,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A plane carrying European Commission President Ursula von der Leyen experienced GPS jamming over Bulgaria, suspected to be a Russian operation. Despite this, the plane safely landed at Plovdiv airport. Von der Leyen will proceed with her tour of EU nations bordering Russia and Belarus, as planned.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Jones Moves to No. 10 in Reshuffle, Tim Allan Joins Team",
    "domain": "business",
    "source_domain": "www.ft.com",
    "location": "global",
    "published": "Mon, 01 Sep 2025 10:57:17 GMT",
    "source": "Financial Times",
    "sources": [
      "Financial Times",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "www.ft.com"
    ],
    "snippets": [
      "Treasury minister Darren Jones to move to Number 10 role, while Blair-era media adviser Tim Allan brought in",
      "<p>Departures and new hires expected to give PM more direct oversight on delivery of key government priorities</p><p>A reshuffle on the Monday morning before parliament returned from recess had been long rumoured, but many in Westminster had expected a shake-up of junior ministers rather than Downin"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F3adbac77-7112-4653-89ef-c02199258ff2.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Starmer announces major Downing Street shake-up",
      "Downing Street shake-up: who’s in and who’s out at No 10"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.878,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.631,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Darren Jones, a Treasury minister, is transitioning to a role at Number 10, and Tim Allan, a media adviser from the Blair era, is being brought into the team. This move is part of a reshuffle aimed at providing the Prime Minister with more direct oversight of key government priorities. The reshuffle occurred on the Monday morning as Parliament returned from recess, surprising many who anticipated changes among junior ministers rather than Downing Street's senior positions.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]