[
  {
    "title": "Australia bans children under 16 from using social media apps",
    "domain": "general",
    "source_domain": "dw.com",
    "location": "global",
    "published": "2025-12-09T16:10:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "BBC",
      "Reuters",
      "The Guardian",
      "New York Times"
    ],
    "domains": [
      "dw.com",
      "bbc.co.uk",
      "news.google.com",
      "theguardian.com",
      "nytimes.com"
    ],
    "snippets": [
      "The world is watching as Australia becomes the first country to ban under-16s from social media. Adults support it but children consider the ban an attack on their rights, which will isolate some of the most vulnerable.",
      "The world’s first social media ban for under 16’s starts this week – will it succeed?",
      "Australia's social media ban for children takes effect in world first Reuters",
      "Australia social media ban set to take effect, sparking a global crackdown Reuters",
      "Accounts held by users under 16 must be removed on apps that include TikTok, Facebook, Instagram, X, YouTube, Snapchat, Reddit, Kick, Twitch and Threads under ban How is Australia’s social media ban affecting you and your family? The social media ban explained: everything you need to know Australia",
      "The measure is one of the most sweeping efforts in the world to safeguard children from the harms of the platforms.",
      "The country is barring children under 16 from social media, with a sweeping federal law that is one of the first attempts at a nationwide regulation."
    ],
    "image_url": "",
    "titles": [
      "Australia social media ban: Children feel isolated, ignored",
      "Will a social media ban for Australian teens work?",
      "Australia's social media ban for children takes effect in world first - Reuters",
      "Australia social media ban set to take effect, sparking a global crackdown - Reuters",
      "Australia’s world-first social media ban begins as millions of children and teens lose access to accounts",
      "Australia’s Social Media Ban for People Under 16 Takes Effect",
      "How Australia’s Social Media Ban for Children Will Work"
    ],
    "url": "https://www.dw.com/en/australia-social-media-ban-children-feel-isolated-ignored/a-75075938?maca=en-rss-en-top-1022-rdf",
    "alternate_urls": [
      "https://www.bbc.co.uk/sounds/play/w3ct71cz?at_medium=RSS&at_campaign=rss",
      "https://news.google.com/rss/articles/CBMipwFBVV95cUxORmFnS3c0U1dLUTJlb3VrNHhiU3ZBQl9PRVI4Sk9YVE5kRzhNM2czc1pwYXhRUDA4TG5BamVzazVUaS1MSmN1eW5VR2FWNVU0bmxLZU8ybzBuYWpTWm1obXlYM1ljMnI5eXAyOEhzbUlOQXpTYzgxUWx2Z0RTUzZhRXNhQkxhaU1rbmNrMFhtN0NsemVSZ3ZsMlZyanl3VThaZnlMZ1E3OA?oc=5",
      "https://news.google.com/rss/articles/CBMixgFBVV95cUxNSFdyeG9ZRmhEUlRxRXJNV09KbHkwV21fQ3NKckk1dkRxRWlDejZaR0pYMHd1dXlHa0tFdEZETVMtQ3RXUEsxYmpUMVF3QkJqaWVxd1dnSElzWkxPVXExT2I2SEN5MDdRdDlHUGpQV2xsNFl4NGE0TjA5em51TG5CQl81dG1UYXNfN1hVR3B2bmdwbWJ2RUFZZFJOU1g4THlOMnc5dEJXSzVraXJJOUVZX3BmVC1SN3MzRm5aTWxvcFdlN3FfV1E?oc=5",
      "https://www.theguardian.com/australia-news/2025/dec/09/australia-under-16-social-media-ban-begins-apps-listed",
      "https://www.nytimes.com/2025/12/09/world/asia/australia-social-media-ban-under-16.html",
      "https://www.nytimes.com/2025/12/07/world/asia/australia-social-media-ban-how-what.html"
    ],
    "location_scope": "global",
    "link": "https://www.dw.com/en/australia-social-media-ban-children-feel-isolated-ignored/a-75075938?maca=en-rss-en-top-1022-rdf",
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.894,
      "consensus": 0.995,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.88,
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story provides useful insights into the impact of social media bans on children’s mental health. It increases awareness about a significant issue, but it doesn't report on any solutions or improvements.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Australia has enacted a federal law banning children under 16 from using social media platforms, including TikTok, Facebook, Instagram, X, YouTube, Snapchat, Reddit, Kick, Twitch, and Threads. The law, which took effect this week, requires accounts held by users under 16 to be removed. Supporters say it aims to protect children, while critics argue it may isolate vulnerable youths. This is the world’s first nationwide social media ban for under-16s.",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "Court gives former Janjaweed leader 20 years for war crimes",
    "domain": "general",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Tue, 09 Dec 2025 19:16:10 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Deutsche Welle",
      "Reuters",
      "CBC News"
    ],
    "domains": [
      "aljazeera.com",
      "dw.com",
      "news.google.com",
      "cbc.ca"
    ],
    "snippets": [
      "The ICC sentenced ex-Janjaweed militia leader Ali Muhammad Ali Abd-Al-Rahman to 20 years in prison for war crimes.",
      "Judges at the International Criminal Court sentenced a leader of the Sudanese Janjaweed militia in Darfur to 20 years in prison. Muhammad Ali Abd Al-Rahman was convicted of war crimes and crimes against humanity.",
      "ICC sentences Darfur Janjaweed militia leader to 20 years Reuters",
      "Judges at the International Criminal Court sentenced a leader of the feared Sudanese Janjaweed militia to 20 years imprisonment Tuesday for war crimes and crimes against humanity committed in the catastrophic conflict in Darfur more than two decades ago."
    ],
    "image_url": "",
    "titles": [
      "Sudan militia leader sentenced to 20 years for war crimes by ICC",
      "ICC sentences Sudan Janjaweed leader to 20 years in prison",
      "ICC sentences Darfur Janjaweed militia leader to 20 years - Reuters",
      "ICC sentences Sudanese militia leader to 20 years in prison for Darfur atrocities"
    ],
    "url": "https://www.aljazeera.com/video/newsfeed/2025/12/9/sudan-militia-leader-sentenced-to-20-years-for-war-crimes-by-icc?traffic_source=rss",
    "alternate_urls": [
      "https://www.dw.com/en/icc-sentences-sudan-janjaweed-leader-to-20-years-in-prison/a-75077572?maca=en-rss-en-top-1022-rdf",
      "https://news.google.com/rss/articles/CBMinAFBVV95cUxQVEgybDJxMWFpbXJkYWFLbmRJWFJrb1daa2wzaUFlNmloWnRCZmpINlhqYnhoZ3N3MDlrMU9sY1MwdkU3MHJ4dW9kdXpscDM2My1LZG0wTkZObnY2SS1YR2NXcDhMeVNfaG1Na0R2emw5WVVieUlZc2lOcVR0aEVPdHhlOW94dWdUVG9FcFJCUktja0hLX1dtNmNHVWw?oc=5",
      "https://www.cbc.ca/news/world/international-criminal-court-sudanese-leader-9.7008390?cmp=rss"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/video/newsfeed/2025/12/9/sudan-militia-leader-sentenced-to-20-years-for-war-crimes-by-icc?traffic_source=rss",
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.974,
      "consensus": 0.908,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.861,
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story is constructive as it informs readers about the outcome of a significant international justice case, contributing to their understanding of global accountability mechanisms. However, it doesn't explicitly highlight solutions or improvements.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The International Criminal Court has sentenced former Janjaweed militia leader Ali Muhammad Ali Abd-Al-Rahman to 20 years in prison for war crimes and crimes against humanity committed during the Darfur conflict over 20 years ago. The verdict was delivered on December 9, 2025.",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "Ukraine plans to send new peace plan to United States",
    "domain": "politics",
    "source_domain": "dw.com",
    "location": "global",
    "published": "2025-12-09T11:56:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "Axios",
      "The Guardian",
      "CBC News",
      "Associated Press"
    ],
    "domains": [
      "dw.com",
      "news.google.com",
      "theguardian.com",
      "cbc.ca"
    ],
    "snippets": [
      "The Ukrainian leader said an updated peace plan may be sent to Washington on Wednesday. It comes during Zelenskyy's visit to Italy, where he has met with Pope Leo XIV and PM Meloni. DW has more.",
      "U.S. pushes Zelensky for swift yes on peace plan: Ukrainian officials Axios",
      "This blog is now closed, you can read more on this story here Oh, and a little warning shot from EU’s Kallas: “If we go into the fight [of] pointing fingers, I mean, we can also point a lot of fingers [on] what is wrong in America, but this is not the way we work , we are not going to meddle with th",
      "Ukrainian President Volodymyr Zelenskyy said Ukraine and its European partners will soon be ready to present to the U.S. \"refined documents\" on a peace plan to end the nearly four-year war with Russia, though it is not yet clear how amenable Washington will be to the changes.",
      "Zelenskyy meets in London with European allies on the US peace plan and Ukrainian security AP News",
      "Trump says Russia has \"upper hand\" as U.S. pressures Zelensky on peace plan Axios"
    ],
    "image_url": "",
    "titles": [
      "Ukraine's Zelenskyy ready to send revised peace plan to US",
      "U.S. pushes Zelensky for swift yes on peace plan: Ukrainian officials - Axios",
      "Ukraine and Europe will be ready to present ‘refined’ peace plan to US ‘in near future’, Zelenskyy says – as it happened",
      "Zelenskyy, buoyed by European allies, ready to present revised peace plan to U.S.",
      "Zelenskyy meets in London with European allies on the US peace plan and Ukrainian security - AP News",
      "Trump says Russia has \"upper hand\" as U.S. pressures Zelensky on peace plan - Axios"
    ],
    "url": "https://www.dw.com/en/ukraine-s-zelenskyy-ready-to-send-revised-peace-plan-to-us/live-75074027?maca=en-rss-en-top-1022-rdf",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMifkFVX3lxTFBDWE9wQzhIaUYzN3BXRWN2TFZmRXlib3N4TE1Cb3liYTkwc0tVVHVHVVREZ3d3NUh1VHA4MC00eUI4Y0NHZWIycVp2aEpLNXdWQTdvTG9kdmRYYzhqd2sta1FWX3VWT1RIeFgtX3Y5dFpLbmdmcTVOc1hhbGNOQQ?oc=5",
      "https://www.theguardian.com/world/live/2025/dec/09/ukraine-russia-lithuania-czech-republic-france-europe-latest-news-updates",
      "https://www.cbc.ca/news/world/ukraine-zelenskyy-italy-peace-plan-9.7008356?cmp=rss",
      "https://news.google.com/rss/articles/CBMiowFBVV95cUxPT0hZbG54TGppaUttclB5MmJNajliaXBBTmFZOHBhaC13b3pFamJyb2NGbVhyQkJORU1PZ25BcVVROHR2Q016ZUxYMnB5N2V2MDl6SnNPRXRmVjdnNG9zYjA4WVZnVjVFVmJ0a3pMeHMzQmUwZmlmT29JbkFpUTZSelBBU1hWeHBqVl9SYXpNcGFSUS13bjJXTGc5MmxsOHNyUnJj?oc=5",
      "https://news.google.com/rss/articles/CBMiiAFBVV95cUxPYzhrYW5lakoxMU90LXFYTjlsdzR1Wm10cFFINkdZR0hlS3hOVG1sTGhick13TC05RGRHUnFLVDlMTDBjV2xoYllJc0d5OEFDQ05GT3Y1NGw4VURlTkRzcnc2LW5hYUNfakFUbW9JNkNRUTVZcjJfZEdCN0FLYUVqZTZGSjkyR0hX?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.dw.com/en/ukraine-s-zelenskyy-ready-to-send-revised-peace-plan-to-us/live-75074027?maca=en-rss-en-top-1022-rdf",
    "score_components": {
      "magnitude": 0.984,
      "recency": 0.795,
      "consensus": 0.975,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.859,
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story informs readers about Ukraine's efforts to maintain peace, which is a solution to ongoing conflict. However, without more context or details about the plan, it doesn't fully empower readers with knowledge.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Ukrainian President Volodymyr Zelenskyy announced that an updated peace plan to end the nearly four-year war with Russia may be sent to Washington on Wednesday. This follows meetings with European leaders, including the Pope and Italy's Prime Minister Meloni. The U.S. is urging Ukraine for a swift response on the plan, and Ukraine is preparing refined documents with its European partners for U.S. review.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Lithuania declares emergency after balloons from Belarus enter",
    "domain": "politics",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Tue, 09 Dec 2025 13:00:59 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "BBC",
      "Reuters",
      "New York Times",
      "CBC News",
      "Bloomberg",
      "Associated Press"
    ],
    "domains": [
      "aljazeera.com",
      "bbc.com",
      "news.google.com",
      "nytimes.com",
      "cbc.ca"
    ],
    "snippets": [
      "Move comes with concern rife that Minsk, alongside ally Russia, is using hybrid warfare and testing NATO.",
      "Prime Minister Inga Ruginiene says the \"hybrid attack\" poses a real risk to national security and civil aviation.",
      "Lithuania declares state of emergency over balloons from Belarus Reuters",
      "Hundreds of weather balloons sent to Lithuania this year have disrupted flights and stirred alarm in a sabotage campaign against a NATO state.",
      "Lithuania's government on Tuesday declared a national emergency over security risks posed by meteorological balloons sent from Russia-allied Belarus that have violated its airspace in recent weeks, while the Belarusian leader called for negotiations on border tensions and said his country \"does not",
      "Lithuania Declares State of Emergency Over Balloons from Belarus Bloomberg.com",
      "Lithuania declares national emergency over security risks posed by balloons from Belarus AP News"
    ],
    "image_url": "",
    "titles": [
      "Lithuania declares state of emergency over smuggler balloons from Belarus",
      "Lithuania declares emergency situation over Belarus balloons",
      "Lithuania declares state of emergency over balloons from Belarus - Reuters",
      "Lithuania Declares National Emergency Over Suspicious Balloons From Belarus",
      "Lithuania declares national emergency over balloons entering airspace from Belarus",
      "Lithuania Declares State of Emergency Over Balloons from Belarus - Bloomberg.com",
      "Lithuania declares national emergency over security risks posed by balloons from Belarus - AP News"
    ],
    "url": "https://www.aljazeera.com/news/2025/12/9/lithuania-declares-state-of-emergency-over-smuggler-balloons-from-belarus?traffic_source=rss",
    "alternate_urls": [
      "https://www.bbc.com/news/articles/c39pr3d10wlo?at_medium=RSS&at_campaign=rss",
      "https://news.google.com/rss/articles/CBMiqwFBVV95cUxOZTkxTEJmaG9HMXQxY04xcW5fYmxTUG1PRzU3eUFEZ214aDlzc3BEWVI0aHFIMDVLSU1WZU0xdmdta3ExSXNURF9vWnFySC1CRVdyeFVWdEdQY3ZiUmFHdXYzSDk3c082aUUxM1lpWmVWaURNSDhKcWxhWUFrWXFMWkMzSUhVNUdVZjQzWllBZkRqUnVEVjZJdW92M0lDTzFJRGRUSVl1YVNfTUU?oc=5",
      "https://www.nytimes.com/2025/12/09/world/europe/lithuania-belarus-balloons-emergency.html",
      "https://www.cbc.ca/news/world/lithuania-belarus-tensions-balloons-9.7008452?cmp=rss",
      "https://news.google.com/rss/articles/CBMitgFBVV95cUxPdVN5OGZGNUxYUkV0ZEIyZThJQkM2LVVIeXBZZjhsQ2UzbFdvMlNObnc0M25jT2lQWHQweldhV0RyZVpTdVBUMUhaTjYxOXh0anhjdUwwd3ZfMmhIaDRScENfOHlLaXlKV0FrZXJnTXZ5TUtqb1BjMFozYnV5dWlEZHR4ZkNoMUVwd0VEc2tvNXhIZ2JlMXNNSnhOVUY4b0FxZzVTcUt0a2VDWmx6N25jSXRHQ1RtUQ?oc=5",
      "https://news.google.com/rss/articles/CBMiqAFBVV95cUxQYlMtRXZta1FoVUp2bHk2QXBYQkVjWjZITW11UEFOY21xNXYwV0RkMkZWUzdyWmdMRjE3eERsSFlzZnJtM29OWnM3azVsZ09OUS1Ic2RBbGs3NFZIZjdKWmFFdXZwTkI4aDlIeHB5allSbUZfSWtrSENhaTd4SlBLV0laNFh2Vm53Q1VjRTZlbS00OXhXa0tQV0pIN05KQUpQT1o4aGNVaks?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2025/12/9/lithuania-declares-state-of-emergency-over-smuggler-balloons-from-belarus?traffic_source=rss",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.819,
      "consensus": 1.0,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.846,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story brings awareness to an international issue between Lithuania and Belarus, but it doesn't provide any actionable insights, solutions, or deeper understanding of the issue.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "On December 9, 2025, Lithuania declared a national state of emergency after hundreds of meteorological balloons sent from Belarus violated its airspace, disrupting flights and raising security concerns. Prime Minister Inga Ruginiene described the incidents as a \"hybrid attack\" threatening national security and civil aviation. Belarusian authorities called for negotiations regarding border tensions.",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Judge allows release of grand jury records in Maxwell case",
    "domain": "business",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Tue, 09 Dec 2025 18:55:26 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Axios",
      "CNBC",
      "CBC News",
      "The Guardian",
      "Bloomberg",
      "Forbes",
      "Associated Press"
    ],
    "domains": [
      "bbc.com",
      "news.google.com",
      "cnbc.com",
      "cbc.ca",
      "theguardian.com",
      "forbes.com"
    ],
    "snippets": [
      "In his ruling, Judge Paul Engelmayer cited a new law passed last month requiring the release of files on Jeffrey Epstein.",
      "Judge orders release of Ghislaine Maxwell grand jury records Axios",
      "Jeffrey Epstein, a former friend of President Donald Trump, killed himself in jail in August 2019, weeks after being arrested on child sex trafficking charges.",
      "A U.S. judge on Tuesday cleared the Justice Department to release grand jury documents in the criminal case against Jeffrey Epstein associate Ghislaine Maxwell, who is in prison for sex trafficking underage girls with the deceased financier.",
      "Records could be made public within 10 days under new Epstein Files Transparency Act The justice department can publicly release investigative materials from a sex-trafficking case against Ghislaine Maxwell , the longtime confidant of Jeffrey Epstein , a federal judge said on Tuesday. Judge Paul A E",
      "Judge Says DOJ Can Release Maxwell Grand Jury Materials Bloomberg.com",
      "Maxwell had argued the files’ release would cause “severe” harm to her effort for a second trial.",
      "Justice Department can unseal Ghislaine Maxwell sex trafficking case records, judge says AP News"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/9cf8/live/177cc340-d514-11f0-bf05-2725f8fc0dac.jpg",
    "titles": [
      "Judge rules Ghislaine Maxwell grand jury records can be unsealed",
      "Judge orders release of Ghislaine Maxwell grand jury records - Axios",
      "Judge unseals Ghislaine Maxwell grand jury materials, citing Epstein files act",
      "U.S. judge allows release of Ghislaine Maxwell grand jury documents in Epstein case",
      "Justice department can release Ghislaine Maxwell court materials, judge says",
      "Judge Says DOJ Can Release Maxwell Grand Jury Materials - Bloomberg.com",
      "Ghislaine Maxwell’s Grand Jury Materials Will Be Released, Judge Rules",
      "Justice Department can unseal Ghislaine Maxwell sex trafficking case records, judge says - AP News"
    ],
    "url": "https://www.bbc.com/news/articles/cn8e2kvzen7o?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiiwFBVV95cUxNSXdLS09HbUM0Rk5ya0RYUlZkUjIxVkVObXd6R01JTEZlSWJlbE1oeE9PbkFKMldDRHFaZHR0bEstbHRPWE9kSC1sUERTVG96ZldlWVVDYk56MDZDQkhEcUdvN3hGUFRJZ3JaQlFDZ1VwQkxwYUJkQUVaMkJxVGFQLUtmM3ZkbEhkNHFv?oc=5",
      "https://www.cnbc.com/2025/12/09/ghislaine-maxwell-jeffrey-epstein-trump-grand-jury.html",
      "https://www.cbc.ca/news/world/judge-release-epstein-grand-jury-documents-9.7008577?cmp=rss",
      "https://www.theguardian.com/us-news/2025/dec/09/ghislaine-maxwell-epstein-court-files-doj",
      "https://news.google.com/rss/articles/CBMitgFBVV95cUxQU3RwaEU3eVBtUUt2by02emFoT2M1cEo1ckY1MS1TbmstREt2Y3ZETWxaM08wY2NfUlFfQzVwcDlUdjVqX0l4MGFyOVZENDJVcm5rakI4dV81T3ZPc0ZGb2pyX0dITmxNOURaLUQyd2Q4STg0bWowZjJwajMtOXc2bHg1cDJ3TFNRcXRqM3JnUGNDbFhYZDFyaHFCZmkwRkcwVmhrTV83OVBtT1FuY1ZXMXVYMDRwQQ?oc=5",
      "https://www.forbes.com/sites/alisondurkee/2025/12/09/ghislaine-maxwells-grand-jury-materials-will-be-released-judge-rules/",
      "https://news.google.com/rss/articles/CBMipwFBVV95cUxNam03N0pyOXpuYzdYbTlZUEN0OE9VbzljVF9fbkc0bmkxTTJJRTBndVB4Q3NyR0dhXzM5OUN1bFp4UnZuT0F0MjNjQVl1MmRRdnVPWVpKZWlXQXFqMmlkM3B1OENSb3NjQzVRc3lPQWpBc3pfczFDdFRPM09ZdXJxZ2xUTXlVZjZfN0x6MmJWYTBZSlVUdWp1cmdwWFkyRDhzeDQtOTIwWQ?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/news/articles/cn8e2kvzen7o?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.965,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.839,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "A federal judge has authorized the U.S. Justice Department to release grand jury records from the criminal case against Ghislaine Maxwell, who is imprisoned for sex trafficking underage girls with Jeffrey Epstein. The decision follows a new law requiring the release of Epstein-related files. The records may be made public within 10 days. Maxwell had opposed the release, citing concerns about her legal efforts.",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "US lets Nvidia sell AI chips to some buyers in China",
    "domain": "business",
    "source_domain": "cnbc.com",
    "location": "national",
    "published": "Tue, 09 Dec 2025 12:50:35 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC",
      "Bloomberg",
      "Forbes",
      "Investopedia",
      "The Guardian",
      "Associated Press"
    ],
    "domains": [
      "cnbc.com",
      "news.google.com",
      "forbes.com",
      "theguardian.com"
    ],
    "snippets": [
      "Nvidia received the green light from the U.S. to sell its advanced H200 chip to China. But there are questions over whether Beijing will allow this to happen.",
      "Nvidia Wins Trump’s Approval to Sell H200 AI Chips in China Bloomberg.com",
      "Trump said he informed China the U.S. will allow NVIDIA to export its H200 products to \"approved customers in China.\"",
      "Nvidia Wins Trump's Approval to Sell H200 AI Chips to China, But There's a Catch Investopedia",
      "Commerce department finalising deal to allow H200 chips to be sold to China as strict Biden-era restrictions relaxed Donald Trump has cleared the way for Nvidia to begin selling its powerful AI computer chips to China, marking a win for the chip maker and its CEO, Jensen Huang, who has spent months",
      "Trump approves sale of more advanced Nvidia computer chips used in AI to China AP News"
    ],
    "image_url": "",
    "titles": [
      "Nvidia can sell the more advanced H200 AI chip to China — but will Beijing want them?",
      "Nvidia Wins Trump’s Approval to Sell H200 AI Chips in China - Bloomberg.com",
      "Nvidia Shares Fall After Trump Allows Sale Of AI Chips To China",
      "Nvidia Wins Trump's Approval to Sell H200 AI Chips to China, But There's a Catch - Investopedia",
      "Trump clears way for Nvidia to sell powerful AI chips to China",
      "Trump approves sale of more advanced Nvidia computer chips used in AI to China - AP News"
    ],
    "url": "https://www.cnbc.com/2025/12/09/nvidia-can-sell-h200-ai-chip-to-china-but-will-beijing-want-them.html",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiswFBVV95cUxNREU5eEdSX0NfSk1hVDV5cVBSVVdwQnd1R2o1V3NtUGxwSTVtVkdjYnJISGtjUmo4b1BBeG9DOGJraDh1NXdhQ2M3UWY0LWZEVEwyaVZ4cGhkRE8ydmt1TXlSMl9XaW5EdURvZHU2d3FxX3NSbGZISndZRHdmVDVHenRaTXVoYnBYVGFfQXpwUmFTa3FrWTFoQVBZdl9uckhwSWdhLXJDSDJacFdZazI4MXdKdw?oc=5",
      "https://www.forbes.com/sites/siladityaray/2025/12/09/nvidia-shares-fall-after-trump-allows-sale-of-ai-chips-to-china/",
      "https://news.google.com/rss/articles/CBMivgFBVV95cUxQLTl4Y1lyTXhHalBBbXREN3BMYlFyOHBXekI2NjFYSmpZcjU1YUVaWlRVdHN0ZERMQTFiaVZVeTQ4bW16dmxjaVBwUFl6Rm80VmpSdWMxaVhFWUExOW11QmlOU3NMZUtuRDNwaFNjWjdNVUF1NmtvZzJ3WExRSlNOQjNSUkNJQVh1M0ZZa1U1U1JPdExDV3BfcGotWWctNkludmQzZ0VCWkZpUUlXdFRwTENzb052X29QcFhpZU5n?oc=5",
      "https://www.theguardian.com/technology/2025/dec/08/trump-nvidia-ai-chips-china",
      "https://news.google.com/rss/articles/CBMilwFBVV95cUxNU3djVXVCUTQ0Yjk5MXFXSU1rVkNwZkI1UmdRWTc3ZTd1SFF6cWc4UTZXbnd0TG5adTMzRDlMcF9jMWNMN3d0OTVVY2FfYXQ4cmJuN0NVWTFfZks5LUw4RTEtVE5uV3dJWlkyWHZ2YjJfX1A2QkRmbzNhOVNvVjBpVXhWaUtXajRMZ29VZ3hRWGFUbU9PR1Fv?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.cnbc.com/2025/12/09/nvidia-can-sell-h200-ai-chip-to-china-but-will-beijing-want-them.html",
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.815,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.794,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The U.S. has approved Nvidia to sell its advanced H200 AI chips to approved customers in China, following a decision by Donald Trump to relax previous restrictions. The Commerce Department is finalizing the deal. However, it remains uncertain if Chinese authorities will permit the imports. The move marks a significant development for Nvidia after months of negotiations.",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "Microsoft plans big investment in AI cloud services in India",
    "domain": "business",
    "source_domain": "dw.com",
    "location": "global",
    "published": "2025-12-09T17:42:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "Reuters",
      "Bloomberg",
      "TechCrunch"
    ],
    "domains": [
      "dw.com",
      "news.google.com",
      "techcrunch.com"
    ],
    "snippets": [
      "CEO Nadella confirmed the tech giant's biggest ever investment in Asia following a meeting with Indian Prime Minister Modi. Microsoft is also set to invest over $5 billion in Canada.",
      "Microsoft to invest $17.5 billion in India, CEO Nadella says Reuters",
      "Microsoft unveils $23 billion in new AI investments with big focus on India Reuters",
      "Microsoft to Invest $17.5 Billion in India for AI Cloud Services Bloomberg.com",
      "The latest is Microsoft's largest investment in Asia."
    ],
    "image_url": "",
    "titles": [
      "India: Microsoft announces $17.5 billion AI investment",
      "Microsoft to invest $17.5 billion in India, CEO Nadella says - Reuters",
      "Microsoft unveils $23 billion in new AI investments with big focus on India - Reuters",
      "Microsoft to Invest $17.5 Billion in India for AI Cloud Services - Bloomberg.com",
      "Microsoft to invest $17.5B in India by 2029 as AI race accelerates"
    ],
    "url": "https://www.dw.com/en/india-microsoft-announces-17-5-billion-ai-investment/a-75080144?maca=en-rss-en-top-1022-rdf",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMioAFBVV95cUxQQXMzMXZjMEZpVmdldzVGWVItWmxBSE4yeXZ1VjRJcnptR1FvUzRFeXFUenhScmdyZzUyQjNES1BnLWdFak5Yc1hhSFl5NzlJeUxobkhBcDdSZm9Tdzd3S3V0eUs2QWhIZk5xR25SdTJIeWFud0hHUGRGYmlNVWJ0R29qUjF5QU90UlFGc1RiMFVPR1VXUHpSeGhrbFFZOGhr?oc=5",
      "https://news.google.com/rss/articles/CBMirAFBVV95cUxPQ3RicG55ZUZQRGtxU2JsTHhXRzhwcXlia0ZfcW1lYjlwdDN1VkFnN2NiaGpmRGV1UFIwTlJYWFZrdDJYbzJsNmdSblBxNWl1ZWJDRFE1M21ubkFEWFVJaHpWM2Z0ejBBbkxFSjNwWi1lMGIyNDVMUlUxbjFMLWVOeC1QcFZaZnNLY3FSdkR4dmNXaFRJTkx6cm83RXdBLUYzcEZNVlJBLUZ5OXBj?oc=5",
      "https://news.google.com/rss/articles/CBMitAFBVV95cUxOSHpDNEthYmVCYnduYjVvQ2p3N3BxVndFMDVRUWE4RVdXc2VreFk2azlMYVRnMzVOWkNVR3JDUXNyRXNVNVc5SGZsX1paSEVvNkRtWGRNN1VVajN2b2g3cGxmcS1VSTZvclM5U0xPYnBNc2NDQ0dyWGI3SDF5dU1oNWJBMERZTW50b1luVjFqVnZENXVpTXR3Mkt5cGJ2bl9TWldzOUxqNjBOX3ZNSmVqZ1I2eTM?oc=5",
      "https://techcrunch.com/2025/12/09/microsoft-to-invest-17-5b-in-india-by-2029-as-ai-race-accelerates/"
    ],
    "location_scope": "global",
    "link": "https://www.dw.com/en/india-microsoft-announces-17-5-billion-ai-investment/a-75080144?maca=en-rss-en-top-1022-rdf",
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.933,
      "consensus": 0.888,
      "constructiveness": 0.017,
      "proximity": 0.5
    },
    "score": 0.783,
    "constructiveness_score": 0.017,
    "constructiveness_reason": "keywords (1): investment; semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Microsoft CEO Satya Nadella announced a $17.5 billion investment in India focused on AI cloud services, marking the company's largest investment in Asia. The announcement followed Nadella's meeting with Indian Prime Minister Modi. Microsoft also plans to invest over $5 billion in Canada as part of its global AI expansion.",
    "is_trending": true,
    "trending_score": 0.75
  },
  {
    "title": "Anne Longfield chosen to lead grooming gangs inquiry in UK",
    "domain": "general",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Tue, 09 Dec 2025 19:23:54 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "bbc.com",
      "theguardian.com"
    ],
    "snippets": [
      "Baroness Anne Longfield will chair the three-year inquiry which has been beset by problems.",
      "Peer named as chair of national inquiry, which is expected to cover England and Wales, after long-delayed search UK politics live – latest updates The former children’s commissioner Anne Longfield will chair the national grooming gangs inquiry in what will be a “moment of reckoning” for the nation,"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/5e2a/live/c36324a0-d506-11f0-a892-01d657345866.jpg",
    "titles": [
      "Grooming gangs inquiry to be led by former children's commissioner Anne Longfield",
      "Former children’s commissioner Anne Longfield to chair grooming gangs inquiry"
    ],
    "url": "https://www.bbc.com/news/articles/ckgk2pj2ygko?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://www.theguardian.com/uk-news/2025/dec/09/ex-childrens-commissioner-anne-longfield-to-chair-grooming-gangs-inquiry"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/news/articles/ckgk2pj2ygko?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.978,
      "consensus": 0.591,
      "constructiveness": 0.9,
      "proximity": 0.5
    },
    "score": 0.772,
    "constructiveness_score": 0.9,
    "constructiveness_reason": "This story is highly constructive as it reports on a solution to a social problem and empowers readers with the knowledge of who is leading the inquiry. It contributes to the reader's understanding of how such issues are being addressed.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Baroness Anne Longfield, former children’s commissioner, has been appointed to chair the national grooming gangs inquiry covering England and Wales. The inquiry, which has faced significant delays and challenges, is set to run for three years. Longfield’s appointment follows a prolonged search for a chair.",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Juventus win 5 0 as more Champions League games begin",
    "domain": "politics",
    "source_domain": "cbssports.com",
    "location": "national",
    "published": "Tue, 09 Dec 2025 17:22:01 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "The Guardian",
      "Yahoo Sports"
    ],
    "domains": [
      "cbssports.com",
      "theguardian.com",
      "sports.yahoo.com"
    ],
    "snippets": [
      "UCL action continues with Matchday 6 starting on Tuesday, and you can see it all on Paramount+",
      "⚽ Champions League updates from the 8pm GMT kick-off ⚽ Live scores | David Squires on Salah | Follow us at Bluesky It’s a great fixture to look forward to. Like I said yesterday when people asked, not that many did, I told them how well Inter have started the season, that they made two of the last t",
      "⚽ Champions League updates from the 8pm GMT kick-offs ⚽ Live scores | Follow us at Bluesky | And you can mail Niall ⚽ Tottenham’s Pride flag moved on ‘security grounds’ Barcelona (4-3-3): Joan García; Koundé, Cubarsí, Gerard, Balde; Eric García, Pedri, Fermín López; Yamal, Lewandowski, Raphinha (c).",
      "⚽ Champions League updates from the 8pm GMT kick-off ⚽ Live scores | Follow us on Bluesky | And email Sarah Arsenal have had an up and down season but they won their last match against Liverpool. Have a read of the report: In the early kick-off today Juventus have beaten St Polten 5-0 with Cristiana",
      "Inter Milan president Beppe Marotta hailed Liverpool ahead of tonight’s mouth-watering Champions League clash.Speaking to Sky Sport via FCInterNews, Marotta praised the Reds despite their troubled p..."
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/11/02/8f9c1c4a-b5f3-4a00-8f76-56d2247059ca/ucl.jpg",
    "titles": [
      "UEFA Champions League schedule: League phase matchups Liverpool head to Inter, Man City at Real Madrid",
      "Inter v Liverpool: Champions League – live",
      "Atalanta v Chelsea, Tottenham v Slavia Prague, and more: Champions League – live",
      "Arsenal v FC Twente: Women’s Champions League – live",
      "Inter Milan Vs Liverpool – Nerazzurri President Heaps Praise On Fierce Champions League Rivals: “Always A Dangerous Opponent”"
    ],
    "url": "https://www.cbssports.com/soccer/news/uefa-champions-league-schedule-league-phase-scores-matchups-results-league-phase/",
    "alternate_urls": [
      "https://www.theguardian.com/football/live/2025/dec/09/inter-v-liverpool-champions-league-live",
      "https://www.theguardian.com/football/live/2025/dec/09/champions-league-atalanta-chelsea-tottenham-slavia-prague-and-more-live",
      "https://www.theguardian.com/football/live/2025/dec/09/arsenal-v-fc-twente-womens-champions-league-live",
      "https://sports.yahoo.com/articles/inter-milan-vs-liverpool-nerazzurri-195000269.html"
    ],
    "location_scope": "national",
    "link": "https://www.cbssports.com/soccer/news/uefa-champions-league-schedule-league-phase-scores-matchups-results-league-phase/",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.924,
      "consensus": 0.789,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.763,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "While this story provides basic awareness about upcoming football matches, it doesn't offer any deeper insights, solutions, or understanding of the sport or the teams involved.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Matchday 6 of the UEFA Champions League begins on Tuesday, with several key fixtures scheduled for the 8pm GMT kick-offs. Juventus defeated St. Pölten 5-0 in an early match. Inter Milan president Beppe Marotta praised Liverpool ahead of their upcoming match. Barcelona and Arsenal are also set to play, with Barcelona’s starting lineup announced. Live coverage is available on Paramount+.",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "British soldier dies in accident during test in Ukraine",
    "domain": "business",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Tue, 09 Dec 2025 19:16:33 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian",
      "Financial Times"
    ],
    "domains": [
      "bbc.com",
      "theguardian.com",
      "ft.com"
    ],
    "snippets": [
      "He died in an accident away from Ukraine's front lines on Tuesday, the Ministry of Defence says.",
      "Ministry says Briton, who has not publicly been named, was injured while observing a test, away from the frontline A member of the UK armed forces died on Tuesday morning after an accident in Ukraine, believed to be the first time a serving member of the British military has been killed in the count",
      "Serviceman was killed away from enemy lines during test of ‘new defensive capability’"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/6388/live/f6bf2180-d526-11f0-91b8-6599f03647f2.jpg",
    "titles": [
      "Member of UK armed forces dies in accident in Ukraine",
      "Member of UK armed forces killed in ‘tragic accident’ in Ukraine, says MoD",
      "British soldier dies in Ukraine after ‘tragic accident’"
    ],
    "url": "https://www.bbc.com/news/articles/c3e07kxey74o?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://www.theguardian.com/world/2025/dec/09/member-uk-armed-forces-killed-accident-ukraine-mod",
      "https://www.ft.com/content/0dddb71e-a472-4bb0-a844-07c87e8ea6ff"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/news/articles/c3e07kxey74o?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.974,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.76,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "A member of the UK armed forces died in Ukraine on Tuesday, December 9, 2025, during an accident while observing a test of a new defensive capability, according to the Ministry of Defence. The incident occurred away from the front lines, and the serviceman has not been publicly named. This is believed to be the first death of a serving British military member in Ukraine.",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "Supreme Court reviews old campaign finance law in new case",
    "domain": "politics",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Tue, 09 Dec 2025 19:30:30 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Forbes"
    ],
    "domains": [
      "aljazeera.com",
      "forbes.com"
    ],
    "snippets": [
      "Conservative justices mull overturning 2001 ruling as campaign finance reform faces challenges in the US Supreme Court.",
      "The case was brought in part by Vice President J.D. Vance, before he entered the White House."
    ],
    "image_url": "",
    "titles": [
      "US top court weighs rollback of limits on party campaign spending",
      "Supreme Court Weighs Abolishing Key Campaign Spending Limit—Why Republicans Stand To Gain"
    ],
    "url": "https://www.aljazeera.com/news/2025/12/9/us-top-court-weighs-rollback-of-limits-on-party-campaign-spending?traffic_source=rss",
    "alternate_urls": [
      "https://www.forbes.com/sites/alisondurkee/2025/12/09/supreme-court-weighs-abolishing-key-campaign-spending-limit-why-republicans-stand-to-gain/"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2025/12/9/us-top-court-weighs-rollback-of-limits-on-party-campaign-spending?traffic_source=rss",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.981,
      "consensus": 0.591,
      "constructiveness": 0.7,
      "proximity": 0.5
    },
    "score": 0.759,
    "constructiveness_score": 0.7,
    "constructiveness_reason": "This story provides useful information about the ongoing legal processes in the US Supreme Court, which could potentially impact future campaign spending. However, without more context or analysis, it does not offer a comprehensive understanding of the implications or potential solutions.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The US Supreme Court is considering overturning a 2001 decision related to campaign finance reform. The case was initiated in part by J.D. Vance prior to his tenure as Vice President. Conservative justices have expressed interest in revisiting existing regulations, but no final ruling has been issued.",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Man arrested after shooting of New York Jets player",
    "domain": "sports",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Tue, 09 Dec 2025 14:25:12 -0500",
    "source": "ABC News",
    "sources": [
      "ABC News",
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "abcnews.go.com",
      "espn.com",
      "sportsnet.ca"
    ],
    "snippets": [
      "A suspect in the Nov. 16 shooting of New York Jets player Kris Boyd has been arrested and charged with attempted murder.",
      "A 20-year-old Bronx man has been arrested and charged with attempted murder in the November shooting of New York Jets player Kris Boyd.",
      "A Bronx man has been charged with attempted murder in the shooting of New York Jets’ player Kris Boyd, police announced Tuesday."
    ],
    "image_url": "https://s.abcnews.com/images/US/boyd-gty-er-251127_1764276079179_hpMain_4x3t_384.jpg",
    "titles": [
      "Suspect in shooting of Jets player Kris Boyd arrested and charged: Officials",
      "Bronx man charged in shooting of Jets' Boyd",
      "Bronx man charged in shooting of New York Jets’ Kris Boyd"
    ],
    "url": "https://abcnews.go.com/US/suspect-shooting-jets-player-kris-boyd-arrested-charged/story?id=128236666",
    "alternate_urls": [
      "https://www.espn.com/nfl/story/_/id/47257417/police-arrest-20-year-old-suspect-shooting-jets-boyd"
    ],
    "location_scope": "national",
    "link": "https://abcnews.go.com/US/suspect-shooting-jets-player-kris-boyd-arrested-charged/story?id=128236666",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.978,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.749,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.09; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "A 20-year-old Bronx man has been arrested and charged with attempted murder in connection with the November 16 shooting of New York Jets player Kris Boyd. Police announced the arrest on Tuesday. The investigation is ongoing.",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "Judge says Trump ban on offshore wind projects was illegal",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Tue, 09 Dec 2025 18:09:12 GMT",
    "source": "Axios",
    "sources": [
      "Axios",
      "Bloomberg",
      "CNBC"
    ],
    "domains": [
      "news.google.com",
      "cnbc.com"
    ],
    "snippets": [
      "Trump offshore wind halt illegal, judge rules Axios",
      "Trump Ban on Wind Energy Projects Ruled Illegal by US Judge Bloomberg.com",
      "Seventeen states led by New York Attorney General Letitia James sued Trump in May to overturn the president's ban.",
      "Orsted Shares Advance After Trump Wind Ban Ruled Illegal Bloomberg.com"
    ],
    "image_url": "",
    "titles": [
      "Trump offshore wind halt illegal, judge rules - Axios",
      "Trump Ban on Wind Energy Projects Ruled Illegal by US Judge - Bloomberg.com",
      "Trump ban on wind power projects overturned by federal judge",
      "Orsted Shares Advance After Trump Wind Ban Ruled Illegal - Bloomberg.com"
    ],
    "url": "https://news.google.com/rss/articles/CBMifEFVX3lxTFA2eEhpS0pUTi1YZk45TmZfSEpxNkdjdXhzWWJ3NHlCbXBRd3ZoeXVZLTVZQjNHQlJyal9tWEY0VWVQM1g2ckJ2aHV0YjlyUExjTEZuVWZmVjRrdlpvMDg1djVQdlEzejZLT0lWZEozZUxOVjJ2TXp4WEgxcnA?oc=5",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMirwFBVV95cUxPZnYyZ2p0SEREaG5VS0k0RHVfcnZtelh4dEJfUXk3OUZaNVQyREM5MzdZamY5cG92Q0VWNVJfY0JXUi10ZEZsQk8tM3BzVFdqUEtoRVI3azhpaEVFUGJ1aUN4ZTN4V2U2Y3FINGhlMFdJS3Q4OEVwWDhDWWFyTnhTWFZ1LWdRU1pzcUE5V19aN0dySUJteDhKUkdnWUt3cjZRWWtKaG1BRUVOUjVEdTZB?oc=5",
      "https://www.cnbc.com/2025/12/08/trump-ban-on-wind-power-projects-overturned-by-federal-judge.html",
      "https://news.google.com/rss/articles/CBMitAFBVV95cUxNb0NLSmhuRXZWMXpjRFRIdWRoMUd1X2g5ajFqRFgxdDRzbTVOdndjWnNYQUdyNDZya1JuV1M1TGR1QmZsREcwUFRSaHRQcno4X043UVIzZkpDZGlabmNYZTRsN3pIdkVRd0NWVXJ5NmgyY2Q5RmFNZmtaa0szUllpSXlZXzRVZUpkTDVzUHVPa0stbVRZdUJVMWpLSHREaWcxdDEtWWdCNGhfb1ZSYmhPaUxGR3c?oc=5"
    ],
    "location_scope": "national",
    "link": "https://news.google.com/rss/articles/CBMifEFVX3lxTFA2eEhpS0pUTi1YZk45TmZfSEpxNkdjdXhzWWJ3NHlCbXBRd3ZoeXVZLTVZQjNHQlJyal9tWEY0VWVQM1g2ckJ2aHV0YjlyUExjTEZuVWZmVjRrdlpvMDg1djVQdlEzejZLT0lWZEozZUxOVjJ2TXp4WEgxcnA?oc=5",
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.944,
      "consensus": 0.769,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.741,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "A U.S. judge has ruled that former President Trump's ban on offshore wind energy projects was illegal. The decision comes after seventeen states, led by New York Attorney General Letitia James, sued to overturn the ban. Following the ruling, shares of wind energy company Orsted rose. The court's decision invalidates the ban, allowing offshore wind projects to proceed.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Gianni Infantino accused of breaking Fifa rules after peace prize",
    "domain": "politics",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Tue, 09 Dec 2025 19:20:12 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "bbc.com",
      "theguardian.com"
    ],
    "snippets": [
      "Gianni Infantino is accused of breaking Fifa rules by a campaign group after giving United States President Donald Trump a peace prize.",
      "Complaint from FairSquare calls for investigation Infantino awarded Trump peace prize at World Cup draw The Fifa president, Gianni Infantino, has been accused of breaching his organisation’s rules on political neutrality in relation to the US president, Donald Trump. Infantino and Trump have formed"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/ab88/live/25dad410-d530-11f0-91b8-6599f03647f2.jpg",
    "titles": [
      "Fifa accused of breaching own rules with Trump award",
      "Gianni Infantino accused of breaking Fifa rules with Trump’s peace prize"
    ],
    "url": "https://www.bbc.com/sport/football/articles/c04vq6ldv6lo?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://www.theguardian.com/football/2025/dec/09/gianni-infantino-donald-trump-fifa-peace-prize"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/sport/football/articles/c04vq6ldv6lo?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.976,
      "consensus": 0.591,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.738,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about a controversy involving Fifa and Trump. However, it lacks depth and does not provide the reader with a deeper understanding of the issue, or any potential solutions or improvements.",
    "constructiveness_source": "gpt",
    "summary_source": "snippet",
    "summary_reason": "invalid_roles",
    "headline_source": "gpt",
    "summary": "Gianni Infantino is accused of breaking Fifa rules by a campaign group after giving United States President Donald Trump a peace prize.",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Philip Rivers joins Colts practice squad after Daniel Jones injury",
    "domain": "sports",
    "source_domain": "cbssports.com",
    "location": "national",
    "published": "Tue, 09 Dec 2025 18:09:31 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Bleacher Report",
      "Sports Illustrated"
    ],
    "domains": [
      "cbssports.com",
      "news.google.com"
    ],
    "snippets": [
      "Rivers joins the Indianapolis practice squad",
      "Philip Rivers Reportedly to Visit Colts After Daniel Jones Injury, Puzzles NFL Fans Bleacher Report",
      "Colts to Bring Former NFL QB Philip Rivers in for Workout After Losing Daniel Jones Sports Illustrated"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/12/09/59b0e6db-b3a8-4bb0-a097-b689f0fcda2a/pr.jpg",
    "titles": [
      "Colts sign 44-year-old QB Philip Rivers in wake of Daniel Jones' season-ending injury",
      "Philip Rivers Reportedly to Visit Colts After Daniel Jones Injury, Puzzles NFL Fans - Bleacher Report",
      "Colts to Bring Former NFL QB Philip Rivers in for Workout After Losing Daniel Jones - Sports Illustrated"
    ],
    "url": "https://www.cbssports.com/nfl/news/indianapolis-colts-qb-philip-rivers-visit-daniel-jones-injury/",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiwgFBVV95cUxQdFZoc290cmljUWduSWZDMU4tVEdxQ3o1RnZkTV83eVM1cE5RR3Zmbm5vRW5ENzc5clVDNmUtdnYtM0RnSUp6ZnA3QUJMNWQ4d1RxSHJBODYxTmpPd1RLcXM2eF85ZFVXbWtkVGJrWlNfV1dwYlp3MzA0M1BfY2huWGtwc1J4cG50dEx4d292LTN3dE5DNWY1cE9xZy1yV1U3WHZOT3lmaGxlRkFRNDlZTnM0b3c1TUZCZTJieFU2TFpQdw?oc=5",
      "https://news.google.com/rss/articles/CBMijwFBVV95cUxOZ0lJZi1oLThZMHFZMHdnX1VYZ2Qwdko5eHJydld5eVJQNjN3ODZpeklBMGJXUE5HY2hBY09vdlphMzNCbTFscVVTZFhBTk1WZzkzMndkUnpFMEJ3WGxlWlJXdFRYOUF1Rk5RR1BFZ21uNGhaSERKSHZaOG9qLVVCMU5pLW9zUUtGLVdYclB4NA?oc=5"
    ],
    "location_scope": "national",
    "link": "https://www.cbssports.com/nfl/news/indianapolis-colts-qb-philip-rivers-visit-daniel-jones-injury/",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.945,
      "consensus": 0.769,
      "constructiveness": 0.03,
      "proximity": 0.5
    },
    "score": 0.738,
    "constructiveness_score": 0.03,
    "constructiveness_reason": "actions: sign; semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Former NFL quarterback Philip Rivers is set to visit the Indianapolis Colts and participate in a workout following an injury to quarterback Daniel Jones. The Colts have also added Rivers to their practice squad. The move has drawn attention and surprise among NFL fans.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Judge lets public see Jeffrey Epstein grand jury files",
    "domain": "general",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Tue, 09 Dec 2025 18:42:21 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Reuters"
    ],
    "domains": [
      "aljazeera.com",
      "news.google.com"
    ],
    "snippets": [
      "While Judge Paul Engelmayer approved the Justice Department's request, he warned there are few new details in the files.",
      "US judge allows release of Epstein-related grand jury documents Reuters"
    ],
    "image_url": "",
    "titles": [
      "US judge approves bid to unseal Epstein grand jury documents",
      "US judge allows release of Epstein-related grand jury documents - Reuters"
    ],
    "url": "https://www.aljazeera.com/news/2025/12/9/us-judge-approves-bid-to-unseal-epstein-grand-jury-documents?traffic_source=rss",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiqAFBVV95cUxNbnJla0trYjJaWG5uaHQwQUp5NW9ZeDFmRDZYckNlaVU1ZkE2UHlZZ3FscHpSV3ZXY0xCNm1jM2RrYWxHNmZnS3Rod2FIc19tbHR1anZLbm5MazdFX2g4TmlybHNscHdfbVRZQUVkWkZrSUI1NjJIdHBDOXJwb2pjNGtXMDJzZEhXOG1reFNDZGZMek9ENkdXRTlKYllqSVYxZm1lNUVjakg?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2025/12/9/us-judge-approves-bid-to-unseal-epstein-grand-jury-documents?traffic_source=rss",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.959,
      "consensus": 0.591,
      "constructiveness": 0.6,
      "proximity": 0.5
    },
    "score": 0.736,
    "constructiveness_score": 0.6,
    "constructiveness_reason": "While this story does not provide solutions or progress, it does offer some useful information about the legal proceedings related to the Epstein case. It could potentially increase the reader's understanding of the legal system and the process of unsealing grand jury documents.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "A U.S. judge, Paul Engelmayer, has approved the Justice Department's request to release grand jury documents related to Jeffrey Epstein. The judge noted that the files contain few new details. The decision allows public access to the documents, but significant new information is not expected.",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Lawsuit tries to stop Netflix from buying Warner Bros Discovery",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Tue, 09 Dec 2025 17:43:07 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "The Guardian",
      "MarketWatch"
    ],
    "domains": [
      "news.google.com",
      "theguardian.com",
      "marketwatch.com"
    ],
    "snippets": [
      "Netflix faces consumer class action over $72 billion Warner Bros deal Reuters",
      "Lawsuit argues that proposed deal threatens to reduce competition in US subscription video-on-demand market Netflix has been hit with a consumer lawsuit seeking to block the online video giant’s planned $72bn acquisition of Warner Bros Discovery’s studio and streaming businesses. The proposed class",
      "Some analysts view Netflix’s move to acquire Warner Bros. as a sign that it is worried about the growing strength of YouTube and TikTok among younger viewers."
    ],
    "image_url": "",
    "titles": [
      "Netflix faces consumer class action over $72 billion Warner Bros deal - Reuters",
      "Netflix faces consumer class-action lawsuit over $72bn Warner Bros deal",
      "Is Netflix’s massive $83 billion Warner Bros. Discovery deal actually a sign of weakness?"
    ],
    "url": "https://news.google.com/rss/articles/CBMivgFBVV95cUxPLVlDZG8zMmt5SV9VS3J4M2JiNEZQbWg2bnREbTlWcnprUS1rSXpOTU1Nb09RQm00ZzAzd19RTm54WURZVEp6cDB5ZTYwcThhN0VuQnNSRUcyQWlLeXRoZUU0Mk1TVlpuRWI2VGJYUUpzcjRuUjVzNDR4ZGJ4VGQ4SlR5SUJZb2FXM1Y4ZUVUQjhWelo2eEs2c1BZS3Zna1Z4cnFrVV9RUG5tNzIxdTVrSmRFVUxCV2RNaHNhMEx3?oc=5",
    "alternate_urls": [
      "https://www.theguardian.com/business/2025/dec/09/netflix-consumer-lawsuit-warner-bros-deal",
      "https://www.marketwatch.com/story/is-netflixs-massive-83-billion-warner-bros-discovery-deal-actually-a-sign-of-weakness-cea85350?mod=mw_rss_topstories"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMivgFBVV95cUxPLVlDZG8zMmt5SV9VS3J4M2JiNEZQbWg2bnREbTlWcnprUS1rSXpOTU1Nb09RQm00ZzAzd19RTm54WURZVEp6cDB5ZTYwcThhN0VuQnNSRUcyQWlLeXRoZUU0Mk1TVlpuRWI2VGJYUUpzcjRuUjVzNDR4ZGJ4VGQ4SlR5SUJZb2FXM1Y4ZUVUQjhWelo2eEs2c1BZS3Zna1Z4cnFrVV9RUG5tNzIxdTVrSmRFVUxCV2RNaHNhMEx3?oc=5",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.933,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.736,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "A consumer class action lawsuit has been filed to block Netflix’s proposed $72 billion acquisition of Warner Bros Discovery’s studio and streaming businesses. The lawsuit argues the deal would reduce competition in the U.S. subscription video-on-demand market. The legal action seeks to prevent the merger from proceeding.",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "Tony Blair will not join Trump Gaza peace council plan",
    "domain": "politics",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Tue, 09 Dec 2025 18:16:58 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "The Guardian"
    ],
    "domains": [
      "aljazeera.com",
      "theguardian.com"
    ],
    "snippets": [
      "Blair was the only figure named for the board when Donald Trump announced a 20-point plan to end Israel's war on Gaza.",
      "Former UK leader loses out on key role in transitional authority after objections from Arab and Muslim nations Tony Blair will not occupy a key position on Donald Trump’s Gaza “peace council” after Arab and Muslim nations were reported to have objected to the involvement of the former UK prime minis"
    ],
    "image_url": "",
    "titles": [
      "Tony Blair ruled out of Trump’s proposed Gaza ‘peace board’: Report",
      "Tony Blair reportedly dropped from Trump’s Gaza ‘board of peace’ shortlist"
    ],
    "url": "https://www.aljazeera.com/news/2025/12/9/tony-blair-ruled-out-of-trumps-proposed-gaza-peace-board-report?traffic_source=rss",
    "alternate_urls": [
      "https://www.theguardian.com/politics/2025/dec/08/tony-blair-reportedly-dropped-from-donald-trump-gaza-board-of-peace-shortlist"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2025/12/9/tony-blair-ruled-out-of-trumps-proposed-gaza-peace-board-report?traffic_source=rss",
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.948,
      "consensus": 0.591,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.735,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "The story provides some awareness about international politics and the ongoing conflict in Gaza, but it lacks depth and doesn't offer any solutions or progress towards resolving the issue.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Former UK Prime Minister Tony Blair will not take a key role on Donald Trump’s proposed Gaza “peace council” after Arab and Muslim nations objected to his involvement. Blair was initially the only named figure on the board for Trump’s 20-point plan to end Israel's war on Gaza. The council's final composition remains undecided.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "China sells more goods worldwide even with US trade tariffs",
    "domain": "general",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Tue, 09 Dec 2025 14:28:39 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Washington Post"
    ],
    "domains": [
      "aljazeera.com",
      "washingtonpost.com"
    ],
    "snippets": [
      "Donald Trump’s trade tariffs have failed to hold back China's export dominance, which scaled new heights in November.",
      "Chinese exports to the United States continued to crater last month, but the drop was made up by booming sales in Southeast Asia and Europe."
    ],
    "image_url": "",
    "titles": [
      "How did China’s trade surplus hit $1 trillion?",
      "Despite Trump tariffs, China’s global trade surplus tops $1 trillion"
    ],
    "url": "https://www.aljazeera.com/news/2025/12/9/how-did-chinas-trade-surplus-hit-1-trillion?traffic_source=rss",
    "alternate_urls": [
      "https://www.washingtonpost.com/world/2025/12/08/china-trade-surplus-record/"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2025/12/9/how-did-chinas-trade-surplus-hit-1-trillion?traffic_source=rss",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.853,
      "consensus": 0.591,
      "constructiveness": 0.8,
      "proximity": 0.5
    },
    "score": 0.731,
    "constructiveness_score": 0.8,
    "constructiveness_reason": "This story could provide useful insights into economic trends and the factors contributing to China's trade surplus. It could help readers understand the global trade system and China's role within it. However, without knowing the content, it's unclear if it offers solutions or highlights progress.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Despite U.S. trade tariffs imposed by Donald Trump, China's overall exports reached record levels in November 2025. While exports to the United States declined, China offset these losses with increased sales to Southeast Asia and Europe, maintaining its strong position in global trade.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Nobel Institute cancels press talk with Machado before ceremony",
    "domain": "general",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Tue, 09 Dec 2025 19:11:54 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Reuters"
    ],
    "domains": [
      "aljazeera.com",
      "news.google.com"
    ],
    "snippets": [
      "The institute said the press conference - which has not been rescheduled - had been cancelled.",
      "Nobel Institute calls off Machado press conference ahead of Peace Prize ceremony Reuters"
    ],
    "image_url": "",
    "titles": [
      "Nobel Institute calls off Machado press conference ahead of award ceremony",
      "Nobel Institute calls off Machado press conference ahead of Peace Prize ceremony - Reuters"
    ],
    "url": "https://www.aljazeera.com/news/2025/12/9/nobel-institute-calls-off-machado-press-conference-ahead-of-award-ceremony?traffic_source=rss",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMitwFBVV95cUxNQmVyY01YOTZCT0tmMEF1blZoYzhYQlVSRVN3X3BZSEdWaXFPazVXUkxxY05EVHlpanc5TVFxLXRCaDNyMHhDYnBCTHNFYmR1RnJzVzMzQ3JDYk5qSVRtSGNJT1JOU0tBNWdjRXVsQmt3b2xCRm80SGFJd05uUENnR0N1Ylo3SEhzOWM5NVM1UXdyUVJHczV6TEloNkxFZnpHcmF6VkJPWmwySXFITnFBXzMxakFIcnc?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2025/12/9/nobel-institute-calls-off-machado-press-conference-ahead-of-award-ceremony?traffic_source=rss",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.972,
      "consensus": 0.591,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.73,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story offers basic awareness about a development related to the Nobel Institute, but does not provide deep insights or actionable information. It does not report on solutions, improvements, or innovations, nor does it increase clarity around systems, causes, trends, or impacts that matter.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The Nobel Institute has cancelled a scheduled press conference with Machado ahead of the Peace Prize ceremony. The institute has not announced a new date for the event. No reason for the cancellation has been provided. The ceremony is still set to proceed as planned.",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Alphonso Davies plays for Bayern again after knee injury",
    "domain": "sports",
    "source_domain": "cbc.ca",
    "location": "national",
    "published": "Tue, 09 Dec 2025 13:03:57 EST",
    "source": "CBC News",
    "sources": [
      "CBC News",
      "Sportsnet"
    ],
    "domains": [
      "cbc.ca",
      "sportsnet.ca"
    ],
    "snippets": [
      "Alphonso Davies is back in Bayern Munich's game-day squad to face Sporting Lisbon in the Champions League for the first time in nearly nine months after a serious knee injury.",
      "Alphonso Davies is back in Bayern Munich’s game-day squad to face Sporting Lisbon in the Champions League for the first time in nearly nine months after a serious knee injury."
    ],
    "image_url": "",
    "titles": [
      "Canadian left back Alphonso Davies back on Bayern Munich bench after knee injury",
      "Alphonso Davies returns to action for Bayern after lengthy absence"
    ],
    "url": "https://www.cbc.ca/sports/soccer/alphonso-davies-return-knee-injury-bayern-munich-champions-league-9.7008908?cmp=rss",
    "alternate_urls": [],
    "location_scope": "national",
    "link": "https://www.cbc.ca/sports/soccer/alphonso-davies-return-knee-injury-bayern-munich-champions-league-9.7008908?cmp=rss",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.942,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.721,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Alphonso Davies has returned to Bayern Munich’s game-day squad for their Champions League match against Sporting Lisbon, marking his first appearance in nearly nine months following a serious knee injury.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "UK praises Europe after Trump criticizes handling of Ukraine war",
    "domain": "politics",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Tue, 09 Dec 2025 19:30:47 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "New York Times"
    ],
    "domains": [
      "bbc.com",
      "nytimes.com"
    ],
    "snippets": [
      "The UK praises Europe's \"strength\" after Trump says countries fail to control migration or take action to end the Ukraine war.",
      "Despite pressure from the Trump administration, Mr. Zelensky, after meeting with European leaders who vowed continued support in the war, said Ukraine’s position on territory had not changed."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/b7d5/live/d32317c0-d514-11f0-9fb5-5f3a3703a365.jpg",
    "titles": [
      "Trump criticises 'decaying' European countries and 'weak' leaders",
      "Trump Criticizes Zelensky as Ukraine Peace Talks Drag On With European Leaders"
    ],
    "url": "https://www.bbc.com/news/articles/clydlwldkvko?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://www.nytimes.com/2025/12/08/world/europe/zelensky-ukraine-war-peace-talks-europe-london.html"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/news/articles/clydlwldkvko?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.981,
      "consensus": 0.591,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.719,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "While this story might increase awareness about the political opinions of a prominent figure, it lacks depth or insight. It does not provide any actionable insights or deeper understanding for readers, nor does it report on any solutions, improvements, or innovations.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The UK commended Europe's response after former U.S. President Trump criticized European countries for their handling of migration and the Ukraine war. Following meetings with European leaders who pledged ongoing support, Ukrainian President Zelensky stated that Ukraine’s stance on its territorial integrity remains unchanged.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Brigitte Macron filmed using insult for feminist protesters in Paris",
    "domain": "politics",
    "source_domain": "theguardian.com",
    "location": "global",
    "published": "Tue, 09 Dec 2025 19:22:03 GMT",
    "source": "The Guardian",
    "sources": [
      "The Guardian",
      "New York Times"
    ],
    "domains": [
      "theguardian.com",
      "nytimes.com"
    ],
    "snippets": [
      "French first lady was filmed calling women who had disrupted Paris theatre show by Ary Abittan ‘sales connes’ French celebrities and politicians on the left have expressed outrage after Brigitte Macron was filmed using a derogatory and sexist slur to describe feminist protesters at a theatre show in",
      "Brigitte Macron used a slur to criticize protesters who had interrupted a show by a French comedian accused of rape in 2021, in a case that was dismissed."
    ],
    "image_url": "https://i.guim.co.uk/img/media/0e8f4d5bfe590a83cb3edffb9595f1c945c0a9b5/151_0_1329_1063/master/1329.jpg?width=140&quality=85&auto=format&fit=max&s=0873147c687041db259c6b1131543473",
    "titles": [
      "Brigitte Macron criticised after using sexist slur against feminist protesters",
      "Brigitte Macron’s Slur Against Feminist Protesters Prompts an Outcry in France"
    ],
    "url": "https://www.theguardian.com/world/2025/dec/09/brigitte-macron-filmed-slur-feminist-protesters-paris",
    "alternate_urls": [
      "https://www.nytimes.com/2025/12/09/world/europe/france-brigitte-macron-feminists-slur.html"
    ],
    "location_scope": "global",
    "link": "https://www.theguardian.com/world/2025/dec/09/brigitte-macron-filmed-slur-feminist-protesters-paris",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.977,
      "consensus": 0.591,
      "constructiveness": 0.3,
      "proximity": 0.5
    },
    "score": 0.718,
    "constructiveness_score": 0.3,
    "constructiveness_reason": "This story raises awareness about sexism and the importance of respectful dialogue, but it does not provide any in-depth information or actionable insights.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Brigitte Macron was filmed using a derogatory term to describe feminist protesters who disrupted a Paris theatre show by comedian Ary Abittan, who had faced but was cleared of rape charges in 2021. The incident has sparked criticism from French celebrities and left-wing politicians.",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Court orders new trial for baseball player Wander Franco",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Tue, 9 Dec 2025 14:31:05 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "espn.com",
      "sportsnet.ca"
    ],
    "snippets": [
      "An appeals court in the Dominican Republic on Tuesday ordered a new trial for Tampa Bay Rays shortstop Wander Franco, who was convicted earlier this year of sexually abusing a minor.",
      "An appeals court in the Dominican Republic on Tuesday ordered a new trial for Tampa Bay Rays shortstop Wander Franco, who was convicted earlier this year of sexually abusing a minor and had received a two-year suspended sentence."
    ],
    "image_url": "",
    "titles": [
      "Dominican court orders new trial for Rays' Franco",
      "Dominican court orders new trial for Rays’ Franco in sexual abuse case"
    ],
    "url": "https://www.espn.com/espn/story/_/id/47255818/dominican-court-orders-new-trial-rays-wander-franco",
    "alternate_urls": [],
    "location_scope": "national",
    "link": "https://www.espn.com/espn/story/_/id/47255818/dominican-court-orders-new-trial-rays-wander-franco",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.981,
      "consensus": 0.591,
      "constructiveness": 0.068,
      "proximity": 0.75
    },
    "score": 0.715,
    "constructiveness_score": 0.068,
    "constructiveness_reason": "actions: trial; semantic: pos_sim=0.20, neg_sim=0.00; semantic_boost=0.05; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "An appeals court in the Dominican Republic has ordered a new trial for Tampa Bay Rays shortstop Wander Franco, who was convicted earlier in 2025 of sexually abusing a minor and had received a two-year suspended sentence. The previous conviction has been set aside, and the case will be retried.",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Police let top IRA agent commit crimes and blocked probes",
    "domain": "general",
    "source_domain": "aljazeera.com",
    "location": "global",
    "published": "Tue, 09 Dec 2025 16:49:19 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "The Guardian"
    ],
    "domains": [
      "aljazeera.com",
      "theguardian.com"
    ],
    "snippets": [
      "British security services allowed a top spy in the IRA to continue committing serious crimes, police report finds.",
      "Nine-year investigation paints highly critical picture of agency’s handling of double agent Who was Stakeknife? MI5 mole at the heart of IRA Britain’s security services allowed a top agent inside the IRA to commit murders and then impeded a police investigation into the affair, according to a damnin"
    ],
    "image_url": "",
    "titles": [
      "UK’s MI5 protected IRA agent who committed murders, police report finds",
      "MI5 impeded inquiry into Stakeknife agent who murdered for IRA, says official report"
    ],
    "url": "https://www.aljazeera.com/news/2025/12/9/uks-mi5-protected-ira-agent-who-committed-murders-police-report-finds?traffic_source=rss",
    "alternate_urls": [
      "https://www.theguardian.com/uk-news/2025/dec/09/mi5-impeded-inquiry-double-agent-ira-stakeknife-official-report"
    ],
    "location_scope": "global",
    "link": "https://www.aljazeera.com/news/2025/12/9/uks-mi5-protected-ira-agent-who-committed-murders-police-report-finds?traffic_source=rss",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.91,
      "consensus": 0.591,
      "constructiveness": 0.5,
      "proximity": 0.5
    },
    "score": 0.712,
    "constructiveness_score": 0.5,
    "constructiveness_reason": "This story provides basic awareness about the actions of MI5 and its relationship with the IRA. However, it lacks depth and doesn't offer insights into the broader implications of this revelation or how it might impact future policy or actions.",
    "constructiveness_source": "gpt",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "A police report released on December 9, 2025, found that British security services allowed a top IRA agent, known as Stakeknife, to commit serious crimes, including murders, while acting as a double agent. The nine-year investigation concluded that agencies also obstructed police efforts to investigate these offenses.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Edwin Díaz to join Dodgers with record new contract",
    "domain": "business",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Tue, 9 Dec 2025 14:31:05 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "espn.com",
      "sportsnet.ca"
    ],
    "snippets": [
      "The Dodgers got the best closer on the free agent market, reaching a three-year, $69 million deal with former Mets reliever Edwin Diaz, sources told ESPN.",
      "ORLANDO, Fla. — Closer Edwin Díaz has agreed to a contract with the World Series champion Los Angeles Dodgers, a person familiar with the negotiations told The Associated Press. The person spoke on condition of anonymity Tuesday because the agreement was subject to a successful physical. Per ESPN’s Jeff Passan , the three-year deal is worth $69 million, which sets a new AAV record for relievers. A three-time All-Star who turns 32 on March 22, Díaz joins a Dodgers bullpen that struggled last season, causing the team to shift rookie starter Roki Sasaki to closer in the post-season. Los Angeles..."
    ],
    "image_url": "",
    "titles": [
      "Sources: Dodgers, closer Diaz reach $69M deal",
      "Report: Star closer Edwin Diaz agrees to three-year, $69M deal with Dodgers"
    ],
    "url": "https://www.espn.com/mlb/story/_/id/47256988/source-dodgers-reach-deal-former-mets-closer-edwin-diaz",
    "alternate_urls": [],
    "location_scope": "national",
    "link": "https://www.espn.com/mlb/story/_/id/47256988/source-dodgers-reach-deal-former-mets-closer-edwin-diaz",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.981,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.708,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Former Mets reliever Edwin Díaz has agreed to a three-year, $69 million contract with the Los Angeles Dodgers, according to multiple sources. The deal, pending a physical, sets a new annual salary record for a relief pitcher. Díaz, a three-time All-Star, will join the Dodgers' bullpen, which struggled last season.",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Experts share new fantasy football player rankings for Week 15",
    "domain": "sports",
    "source_domain": "espn.com",
    "location": "national",
    "published": "Tue, 9 Dec 2025 14:19:38 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "espn.com",
      "cbssports.com"
    ],
    "snippets": [
      "Weekly individual and composite rankings for each position in PPR and IDP formats, as well as Eric Karabell's superflex ranks.",
      "Trying to decide between a couple of closely ranked players this week? Eric Karabell is here to help.",
      "SportsLine's model reveals its Week 15 Fantasy football projections, PPR rankings, start-sit advice for sites like CBS Sports, ESPN and Yahoo"
    ],
    "image_url": "",
    "titles": [
      "Rankings for Week 15",
      "Flex and superflex rankings for Week 15",
      "Fantasy football rankings, projections, lineups, sleepers and streamers for Week 15 from proven NFL model"
    ],
    "url": "https://www.espn.com/fantasy/football/story/_/page/FFWeeklyPlayerRank25main-46028352/fantasy-football-rankings-2025-nfl-week-qb-rb-wr-te-dst",
    "alternate_urls": [
      "https://www.espn.com/fantasy/football/story/_/id/46104825/fantasy-football-superflex-rankings-2025-qb-rb-wr-te",
      "https://www.cbssports.com/fantasy/football/news/fantasy-football-rankings-projections-lineups-sleepers-streamers-week-15/"
    ],
    "location_scope": "national",
    "link": "https://www.espn.com/fantasy/football/story/_/page/FFWeeklyPlayerRank25main-46028352/fantasy-football-rankings-2025-nfl-week-qb-rb-wr-te-dst",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.976,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.706,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0 (<6 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Fantasy football experts, including Eric Karabell, have released updated individual and composite player rankings for Week 15 in PPR and IDP formats. SportsLine's model also provides projections and start-sit advice for platforms such as CBS Sports, ESPN, and Yahoo to help managers make lineup decisions.",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "Europe checks if Google treats YouTube creators fairly in search",
    "domain": "business",
    "source_domain": "dw.com",
    "location": "global",
    "published": "2025-12-09T12:05:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "Bloomberg",
      "TechCrunch"
    ],
    "domains": [
      "dw.com",
      "news.google.com",
      "techcrunch.com"
    ],
    "snippets": [
      "An antitrust investigation by the European Commission aims to see how Google uses — and pays for — YouTube videos and the other content used to feed AI-generated search results.",
      "EU Opens Google Antitrust Probe Over AI Use of Online Content Bloomberg.com",
      "The European Commission is investigating Google over its AI summaries."
    ],
    "image_url": "",
    "titles": [
      "EU opens antitrust inquiry over Google's AI search summaries",
      "EU Opens Google Antitrust Probe Over AI Use of Online Content - Bloomberg.com",
      "EU launches antitrust probe into Google’s AI search tools"
    ],
    "url": "https://www.dw.com/en/eu-opens-antitrust-inquiry-over-google-s-ai-search-summaries/a-75075325?maca=en-rss-en-top-1022-rdf",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMisgFBVV95cUxOOEtjcHBXUGY5d3pmaFlPazUwVEFPYU5uZFpiT2F2OFdBVGRqamVza2hDZHR5aTRMbGNubjRqU0poNGZpRGc3ZURVUmNfSElWQlNhLWtNTEhxZ1NURFhkaWNGanRITDZlWU5ndE13MVRoSHhjekc2QzBfbm5wSnBqX202RDBFdjBzUlh5QmNzREI4QldraUJmRXpPYmxlc3I2dklrRVYyNThEM2xKbXdUU2hn?oc=5",
      "https://techcrunch.com/2025/12/09/eu-launches-antitrust-probe-into-googles-ai-search-tools/"
    ],
    "location_scope": "global",
    "link": "https://www.dw.com/en/eu-opens-antitrust-inquiry-over-google-s-ai-search-summaries/a-75075325?maca=en-rss-en-top-1022-rdf",
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.798,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.701,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The European Commission has launched an antitrust investigation into Google, focusing on how the company uses and compensates creators for YouTube videos and other online content in its AI-generated search results. The probe aims to determine whether Google's practices comply with EU competition rules. The investigation is ongoing.",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Arsenal player joins Champions League squad for next game",
    "domain": "sports",
    "source_domain": "sports.yahoo.com",
    "location": "national",
    "published": "Tue, 09 Dec 2025 19:55:00 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports",
      "Sports Illustrated"
    ],
    "domains": [
      "sports.yahoo.com",
      "news.google.com"
    ],
    "snippets": [
      "On the agenda for today:11:15 CET: final training session14:00 CET: press conference with Niko Kovac and Julian Brandt at SIGNAL IDUNA PARK15:30 CET: Bodø/Glimt press conference at SIGNAL IDUNA PARK+...",
      "UEFA Champions League Predictions: Matchday 12/9 Sports Illustrated",
      "Max Dowman Replaced in Champions League Squad by Forgotten Arsenal Man Sports Illustrated"
    ],
    "image_url": "",
    "titles": [
      "UEFA Champions League: the ticker for the game against Bodø/Glimt",
      "UEFA Champions League Predictions: Matchday 12/9 - Sports Illustrated",
      "Max Dowman Replaced in Champions League Squad by Forgotten Arsenal Man - Sports Illustrated"
    ],
    "url": "https://sports.yahoo.com/articles/uefa-champions-league-ticker-game-195500640.html",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMiiAFBVV95cUxQUTRJaG5XQ3VzN213a2kxOG5uU2xrQVlPQkhNc0oweU04WENXaWM3Y0RNM28yUHY4RlhHaVVSdjdkSWdheFQtVXdDNkF2cmkyTTNGSEFCUVkwanFzcUc5UElVNUVLaHBIT09RU2pSSkU4aEY5VGNYSmJlb003SHdMbEhEeWlYTng5?oc=5",
      "https://news.google.com/rss/articles/CBMilAFBVV95cUxPMV9zSWV5NElmWFVBZE1wcXJMR2I3NXZMVGRwNElhcURjbFdBWnlUQ0k1eHp6S3A5WUY0cFVWREtuU2lkek5hQnhmMHlLZkhpdDNqWmVJY3Q0ZDVTcWpLbFYxektvUjFmM3NmU1k3dWxBS3lRQzg2by1ySlhRMXpkNDVMRW9id1lxTm9XR29RQjdLc3NH?oc=5"
    ],
    "location_scope": "national",
    "link": "https://sports.yahoo.com/articles/uefa-champions-league-ticker-game-195500640.html",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.992,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.692,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "On December 9, 2025, UEFA Champions League events at SIGNAL IDUNA PARK include a final training session, followed by press conferences with Niko Kovac, Julian Brandt, and representatives from Bodø/Glimt. Additionally, Max Dowman has been replaced in the Champions League squad by a previously overlooked Arsenal player.",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Red Sox trade Vaughn Grissom to Los Angeles Angels",
    "domain": "sports",
    "source_domain": "sports.yahoo.com",
    "location": "national",
    "published": "Tue, 09 Dec 2025 19:57:54 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports",
      "Sportsnet"
    ],
    "domains": [
      "sports.yahoo.com",
      "sportsnet.ca"
    ],
    "snippets": [
      "Vaughn Grissom couldn't stay healthy in Boston.",
      "The Boston Red Sox are trading Vaughn Grissom to the Los Angeles Angels, ESPN’s Jeff Passan reported on Tuesday."
    ],
    "image_url": "",
    "titles": [
      "Red Sox trade former Braves standout Vaughn Grissom to Angels after disappointing tenure in Boston",
      "Angels acquire infielder Vaughn Grissom from Red Sox"
    ],
    "url": "https://sports.yahoo.com/mlb/breaking-news/article/red-sox-trade-former-braves-standout-vaughn-grissom-to-angels-after-disappointing-tenure-in-boston-195754906.html",
    "alternate_urls": [],
    "location_scope": "national",
    "link": "https://sports.yahoo.com/mlb/breaking-news/article/red-sox-trade-former-braves-standout-vaughn-grissom-to-angels-after-disappointing-tenure-in-boston-195754906.html",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.993,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.687,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "The Boston Red Sox are trading Vaughn Grissom to the Los Angeles Angels, according to ESPN's Jeff Passan. Grissom struggled with injuries during his time in Boston. The trade was reported on December 9, 2025.",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Real Madrid faces injuries before big match with Manchester City",
    "domain": "sports",
    "source_domain": "sports.yahoo.com",
    "location": "national",
    "published": "Tue, 09 Dec 2025 19:45:00 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports",
      "Sports Illustrated"
    ],
    "domains": [
      "sports.yahoo.com",
      "news.google.com"
    ],
    "snippets": [
      "Real Madrid star Aurélien Tchouaméni has on Tuesday made clear his frustration with the level of recent performance being put forth by Xabi Alonso’s squad.This of course comes fresh off another da...",
      "Kylian Mbappe Sparks Major Real Madrid Injury Scare Before Crucial Man City Clash Sports Illustrated",
      "Real Madrid Reportedly Handed Yet Another Injury Blow Ahead Of Manchester City Trip Sports Illustrated"
    ],
    "image_url": "",
    "titles": [
      "Real Madrid star critical of teammates before Man City",
      "Kylian Mbappe Sparks Major Real Madrid Injury Scare Before Crucial Man City Clash - Sports Illustrated",
      "Real Madrid Reportedly Handed Yet Another Injury Blow Ahead Of Manchester City Trip - Sports Illustrated"
    ],
    "url": "https://sports.yahoo.com/articles/real-madrid-star-critical-teammates-194500874.html",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMimAFBVV95cUxOYzBHSkVNdGxmY3l3a3Y1MldteXZmUkR2VVNZcXV2UHB0TzF4eVJiVGM1XzVrTjBfbnFDUDd3UVQxQzM0ckJ5R2JVdGVmeVR5dkZfeUVpejIwb0N4OHFUd0tuckFaT215eTFqYm1wUzY3aEZsNzhRSlZvSk5jZFIyazA3VlNSRWIzTG5FRFcyRHpWWl9QeS1ocw?oc=5",
      "https://news.google.com/rss/articles/CBMi2wFBVV95cUxPbFRuNnZDbWEyeFlFMEtnUzE4OUdVdlc5dVlqb3FicEw2Ukt1NjExUUhoYW0zaUtmTDBOY2tYT1drXzdjeWxBN0lSeTRTX3Utb2JqNjBrQWZLM2hHekFzeDViV2Uyc0ZWaGRFZHQxZzUyQmFZOE1MSkdRRXUzMHRXekd1NUZVM000Q2xBZjJaT0lwVDRGaUZOWG13ZzZaR2g5bDdocmJlOHdORUlhbmhaQVNFcWZJQUtnTlpRLXdiYmI4Z2FCV1ZCcXZER3Vmdi0xNGt4QllYOTJyWG8?oc=5"
    ],
    "location_scope": "national",
    "link": "https://sports.yahoo.com/articles/real-madrid-star-critical-teammates-194500874.html",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.987,
      "consensus": 0.591,
      "constructiveness": 0.022,
      "proximity": 0.5
    },
    "score": 0.687,
    "constructiveness_score": 0.022,
    "constructiveness_reason": "semantic: pos_sim=0.09, neg_sim=0.00; semantic_boost=0.02; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Real Madrid midfielder Aurélien Tchouaméni has expressed frustration with the team's recent performances under Xabi Alonso. The club is also facing injury concerns, with Kylian Mbappé reportedly sparking a major injury scare ahead of their upcoming match against Manchester City. These issues come as Real Madrid prepares for a crucial fixture.",
    "is_trending": true,
    "trending_score": 0.5
  },
  {
    "title": "Elephant scientist Iain Douglas Hamilton dies at age 83",
    "domain": "science",
    "source_domain": "nytimes.com",
    "location": "global",
    "published": "Tue, 09 Dec 2025 19:05:58 +0000",
    "source": "New York Times",
    "sources": [
      "New York Times",
      "The Guardian"
    ],
    "domains": [
      "nytimes.com",
      "theguardian.com"
    ],
    "snippets": [
      "Born into an aristocratic British family, he turned his empathy and knowledge of the world’s largest land mammals to the cause of saving them from poachers.",
      "Conservationist who devoted his life to the study and preservation of the African elephant The British scientist Iain Douglas-Hamilton, who has died aged 83, became the world’s leading authority on the behaviour of African elephants and played a vital part in ensuring their conservation. His efforts"
    ],
    "image_url": "",
    "titles": [
      "Iain Douglas-Hamilton, Who Studied, and Protected, Elephants, Dies at 83",
      "Iain Douglas-Hamilton obituary"
    ],
    "url": "https://www.nytimes.com/2025/12/09/world/africa/iain-douglas-hamilton-dead.html",
    "alternate_urls": [
      "https://www.theguardian.com/science/2025/dec/09/iain-douglas-hamilton-obituary"
    ],
    "location_scope": "global",
    "link": "https://www.nytimes.com/2025/12/09/world/africa/iain-douglas-hamilton-dead.html",
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.97,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.686,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "gpt",
    "summary_reason": "",
    "headline_source": "gpt",
    "summary": "Iain Douglas-Hamilton, a British conservationist and scientist, has died at age 83. He was recognized as a leading authority on African elephant behavior and dedicated his life to their study and preservation. His work significantly contributed to protecting elephants from poaching and advancing global conservation efforts.",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Climate: 2025 likely second hottest on record, EU scientists say",
    "domain": "science",
    "source_domain": "dw.com",
    "location": "global",
    "published": "2025-12-09T10:03:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "Reuters",
      "Scientific American"
    ],
    "domains": [
      "dw.com",
      "news.google.com"
    ],
    "snippets": [
      "This year is expected to match 2023 as one of the warmest on record, second only to 2024, EU scientists warn. They cite greenhouse gas emissions from fossil fuels as the main cause of global warming.",
      "2025 will be world's second or third-hottest year on record, EU scientists say Reuters",
      "2025 Likely to Tie for Second-Hottest Year on Record Scientific American"
    ],
    "image_url": "",
    "titles": [
      "Climate: 2025 likely second hottest on record, EU scientists say",
      "2025 will be world's second or third-hottest year on record, EU scientists say - Reuters",
      "2025 Likely to Tie for Second-Hottest Year on Record - Scientific American"
    ],
    "url": "https://www.dw.com/en/climate-2025-likely-second-hottest-on-record-eu-scientists-say/a-75072441?maca=en-rss-en-top-1022-rdf",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMixwFBVV95cUxQWHNoNlgwTEJvTEVMNGxBOGpsQW8wTVQ2eFBySG5QcE52eWtVZ2xaSFNMNW9zUDBnZk45dW5fSVVyRE5feVFRYWtHZDhKU0Y0NjRmeDg1Q0QxMHh0LVQtR3ZJcU5YSF9JZmhxRU9STndmeXp5YkdxeDlaRXlkdWdUbjJCWElvXzVuOW8tSjhsamc0NEgwZFlxR2Q4WWw4RHJXOGlQMlEyUWF2emd4TmZ2azhDVVNsWGFaT3R5U2VHVHYtVzMydzFz?oc=5",
      "https://news.google.com/rss/articles/CBMinAFBVV95cUxNNldfdGxEeTlmUV9Ga25DYTVVOVg1RDBlRUxkNFRsRXZyYlpxbjlPeUM4MndEV2FqSVc4UU0ydWRYc0xybnFFS3Y5SmhHeGJ4X3J4V2ZxUUVpZ3JLOGZBSm5Mbk9fcEI1aXp4SllORXJQblB1RWZUWm8zNG5TYnR3eko5UDQ5OW5RZ3Utd3Z4dWZEVE1NMU50cGczREU?oc=5"
    ],
    "location_scope": "global",
    "link": "https://www.dw.com/en/climate-2025-likely-second-hottest-on-record-eu-scientists-say/a-75072441?maca=en-rss-en-top-1022-rdf",
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.754,
      "consensus": 0.769,
      "constructiveness": 0.022,
      "proximity": 0.5
    },
    "score": 0.68,
    "constructiveness_score": 0.022,
    "constructiveness_reason": "semantic: pos_sim=0.09, neg_sim=0.00; semantic_boost=0.02; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "skipped",
    "summary_reason": "skipped_due_to_budget",
    "headline_source": "",
    "summary": "",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Google Photos&#8217; new video editor makes it more like Capcut",
    "domain": "science",
    "source_domain": "theverge.com",
    "location": "global",
    "published": "2025-12-09T13:01:00-05:00",
    "source": "The Verge",
    "sources": [
      "The Verge",
      "TechCrunch"
    ],
    "domains": [
      "theverge.com",
      "techcrunch.com"
    ],
    "snippets": [
      "The Google Photos app on Android and iOS is getting a video editing overhaul with a redesigned editor, templates for highlight reels, and options for adding custom text overlays and music to individual videos. Highlight reels, which automatically cut together a video featuring selected photos and vi",
      "Google Photos' new update helps make editing video reels in the app quicker, such as new templates that already add music and text to clips."
    ],
    "image_url": "",
    "titles": [
      "Google Photos&#8217; new video editor makes it more like Capcut",
      "Google Photos launches new video editing tools"
    ],
    "url": "https://www.theverge.com/news/840690/google-photos-video-editing-highlight-reel-updates",
    "alternate_urls": [
      "https://techcrunch.com/2025/12/09/google-photos-launches-new-video-editing-tools/"
    ],
    "location_scope": "global",
    "link": "https://www.theverge.com/news/840690/google-photos-video-editing-highlight-reel-updates",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.941,
      "consensus": 0.591,
      "constructiveness": 0.05,
      "proximity": 0.5
    },
    "score": 0.676,
    "constructiveness_score": 0.05,
    "constructiveness_reason": "semantic: pos_sim=0.20, neg_sim=0.00; semantic_boost=0.05; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "skipped",
    "summary_reason": "skipped_due_to_budget",
    "headline_source": "",
    "summary": "",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "How to watch one of the year's best meteor showers, the Geminids",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Tue, 09 Dec 2025 13:30:42 EST",
    "source": "Phys.org",
    "sources": [
      "Phys.org",
      "Associated Press"
    ],
    "domains": [
      "phys.org",
      "news.google.com"
    ],
    "snippets": [
      "It's time for one of the strongest meteor showers of the year.",
      "How to watch one of the year’s best meteor showers, the Geminids AP News"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/how-to-watch-one-of-th.jpg",
    "titles": [
      "How to watch one of the year's best meteor showers, the Geminids",
      "How to watch one of the year’s best meteor showers, the Geminids - AP News"
    ],
    "url": "https://phys.org/news/2025-12-year-meteor-showers-geminids.html",
    "alternate_urls": [
      "https://news.google.com/rss/articles/CBMinAFBVV95cUxOLWVKSU5BNFJJa29yMUFtUUJyWlEtY25CVTFRUC0wZTRsOXhDclNfZE1EemxLOXJKa1hLcUpvcnhXeGxGTUJaVHF4dW9sTWJnQ212dzJqV1N4TExvLUh6emU4bDZzWEhTLW5Oc1M4SkxKdS1BbmV0YXVDUm4tWVBpLTV6MVdMTDFFZUMxN083c25KOVo3c3h6Tmw3VnU?oc=5"
    ],
    "location_scope": "global",
    "link": "https://phys.org/news/2025-12-year-meteor-showers-geminids.html",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.954,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.675,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.60 (<20 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "skipped",
    "summary_reason": "skipped_due_to_budget",
    "headline_source": "",
    "summary": "",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Sprites Over Château de Beynac",
    "domain": "science",
    "source_domain": "nasa.gov",
    "location": "global",
    "published": "Tue, 09 Dec 2025 18:24:11 +0000",
    "source": "NASA",
    "sources": [
      "NASA",
      "NASA EO"
    ],
    "domains": [
      "nasa.gov"
    ],
    "snippets": [
      "A flash of lightning, and then—something else. High above a storm, a crimson figure blinks in and out of existence. If you see it, you are a lucky witness of a sprite, one of the least-understood electrical phenomena in Earth’s upper atmosphere. Sprites occur at some 50 miles (80 kilometers) altitud",
      "A flash of lightning, and then—something else. High above a storm, a crimson figure blinks in and out of existence. If you see it, you are a lucky witness of a sprite, one of the least-understood electrical phenomena in Earth’s upper atmosphere."
    ],
    "image_url": "",
    "titles": [
      "Sprites Over Château de Beynac"
    ],
    "url": "https://www.nasa.gov/image-article/sprites-over-chateau-de-beynac/",
    "alternate_urls": [
      "https://www.nasa.gov/image-detail/nasa-december-2025-3456x2234/"
    ],
    "location_scope": "global",
    "link": "https://www.nasa.gov/image-article/sprites-over-chateau-de-beynac/",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.951,
      "consensus": 0.571,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.67,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0 (<6 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "skipped",
    "summary_reason": "skipped_due_to_budget",
    "headline_source": "",
    "summary": "",
    "is_trending": false,
    "trending_score": 0.25
  },
  {
    "title": "Accenture, Anthropic strike multi-year partnership to boost AI adoption - Reuters",
    "domain": "science",
    "source_domain": "news.google.com",
    "location": "global",
    "published": "Tue, 09 Dec 2025 14:25:45 GMT",
    "source": "Reuters",
    "sources": [
      "Reuters",
      "TechCrunch"
    ],
    "domains": [
      "news.google.com",
      "techcrunch.com"
    ],
    "snippets": [
      "Accenture, Anthropic strike multi-year partnership to boost AI adoption Reuters",
      "The two companies are launching the Accenture Anthropic Business Group to bring Anthropic's AI to Accenture's employees."
    ],
    "image_url": "",
    "titles": [
      "Accenture, Anthropic strike multi-year partnership to boost AI adoption - Reuters",
      "Anthropic and Accenture sign multi-year AI strategic partnership"
    ],
    "url": "https://news.google.com/rss/articles/CBMisgFBVV95cUxPY0xiUzdOdmllSUlzOUtvaXlUNUtSLXZGZS1QQ3FtNlFJZkViR2pxN2ltZVpPUG42LThmSmE2RmQ3RmJzRy15Vk02blktNTNHbjdJS08wd3hBeGxocktwYmFiWUxBRS1JS1I3aFYtWGVaS1pCandNSlp6ZFBIMjlpSXJsLTREVldUT1pEdzlaWEM3M2hLX2VHUjFOU3RGckFQZGZXakpLMWhDc3Q0eFQ1WVNn?oc=5",
    "alternate_urls": [
      "https://techcrunch.com/2025/12/09/anthropic-and-accenture-sign-multi-year-ai-strategic-partnership/"
    ],
    "location_scope": "global",
    "link": "https://news.google.com/rss/articles/CBMisgFBVV95cUxPY0xiUzdOdmllSUlzOUtvaXlUNUtSLXZGZS1QQ3FtNlFJZkViR2pxN2ltZVpPUG42LThmSmE2RmQ3RmJzRy15Vk02blktNTNHbjdJS08wd3hBeGxocktwYmFiWUxBRS1JS1I3aFYtWGVaS1pCandNSlp6ZFBIMjlpSXJsLTREVldUT1pEdzlaWEM3M2hLX2VHUjFOU3RGckFQZGZXakpLMWhDc3Q0eFQ1WVNn?oc=5",
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.852,
      "consensus": 0.591,
      "constructiveness": 0.017,
      "proximity": 0.5
    },
    "score": 0.658,
    "constructiveness_score": 0.017,
    "constructiveness_reason": "keywords (1): partnership; semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "skipped",
    "summary_reason": "skipped_due_to_budget",
    "headline_source": "",
    "summary": "",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Pompeii building site reveals how the Romans made concrete",
    "domain": "science",
    "source_domain": "newscientist.com",
    "location": "global",
    "published": "Tue, 09 Dec 2025 16:00:36 +0000",
    "source": "New Scientist",
    "sources": [
      "New Scientist",
      "Ars Technica"
    ],
    "domains": [
      "newscientist.com",
      "arstechnica.com"
    ],
    "snippets": [
      "Excavations of a workshop that was buried in Pompeii almost 2000 years ago have given archaeologists unique insights into Roman construction techniques and the longevity of the empire’s concrete",
      "Latest results from a recently discovered ancient Roman construction site confirm earlier findings."
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/12/09101702/SEI_276904159.jpg",
    "titles": [
      "Pompeii building site reveals how the Romans made concrete",
      "Pompeii construction site confirms recipe for Roman concrete"
    ],
    "url": "https://www.newscientist.com/article/2507648-pompeii-building-site-reveals-how-the-romans-made-concrete/?utm_campaign=RSS%7CNSNS&utm_source=NSNS&utm_medium=RSS&utm_content=home",
    "alternate_urls": [
      "https://arstechnica.com/science/2025/12/study-confirms-romans-used-hot-mixing-to-make-concrete/"
    ],
    "location_scope": "global",
    "link": "https://www.newscientist.com/article/2507648-pompeii-building-site-reveals-how-the-romans-made-concrete/?utm_campaign=RSS%7CNSNS&utm_source=NSNS&utm_medium=RSS&utm_content=home",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.89,
      "consensus": 0.591,
      "constructiveness": 0.017,
      "proximity": 0.5
    },
    "score": 0.657,
    "constructiveness_score": 0.017,
    "constructiveness_reason": "actions: build; semantic: pos_sim=0.00, neg_sim=0.00; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "skipped",
    "summary_reason": "skipped_due_to_budget",
    "headline_source": "",
    "summary": "",
    "is_trending": false,
    "trending_score": 0.0
  },
  {
    "title": "Red Bull adviser Marko to leave team after 20 years",
    "domain": "general",
    "source_domain": "bbc.com",
    "location": "global",
    "published": "Tue, 09 Dec 2025 15:03:14 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "bbc.com",
      "theguardian.com"
    ],
    "snippets": [
      "Red Bull announce motorsport adviser Helmut Marko will leave the team after 20 years at the end of 2025.",
      "Austrian key to Vettel and Verstappen world title wins ‘Now is the right moment,’ says influential 82-year-old Red Bull’s influential auto racing adviser Helmut Marko is retiring from his role at the age of 82, ending a 20-year stint in which he helped Sebastian Vettel and Max Verstappen develop int"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/6b74/live/72148380-d512-11f0-8c34-47e3c8a54b31.jpg",
    "titles": [
      "Red Bull adviser Marko to leave team after 20 years",
      "Red Bull F1 adviser Helmut Marko retires after successful 20-year stint"
    ],
    "url": "https://www.bbc.com/sport/formula1/articles/cpwk1e752ego?at_medium=RSS&at_campaign=rss",
    "alternate_urls": [
      "https://www.theguardian.com/sport/2025/dec/09/red-bull-f1-adviser-helmut-marko-retires"
    ],
    "location_scope": "global",
    "link": "https://www.bbc.com/sport/formula1/articles/cpwk1e752ego?at_medium=RSS&at_campaign=rss",
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.867,
      "consensus": 0.591,
      "constructiveness": 0.022,
      "proximity": 0.5
    },
    "score": 0.651,
    "constructiveness_score": 0.022,
    "constructiveness_reason": "semantic: pos_sim=0.09, neg_sim=0.00; semantic_boost=0.02; length_penalty=0.35 (<12 tokens)",
    "constructiveness_source": "heuristic",
    "summary_source": "skipped",
    "summary_reason": "skipped_due_to_budget",
    "headline_source": "",
    "summary": "",
    "is_trending": false,
    "trending_score": 0.0
  }
]