[
  {
    "title": "Air Canada Flight Attendants Strike, 600+ Flights Canceled Amid Wage Dispute",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sat, 16 Aug 2025 08:48:06 -0400",
    "source": "NPR",
    "sources": [
      "New York Times",
      "Deutsche Welle",
      "ABC News",
      "Global News",
      "BBC",
      "Financial Post",
      "Al Jazeera",
      "Washington Post",
      "NPR"
    ],
    "domains": [
      "financialpost.com",
      "www.nytimes.com",
      "abcnews.go.com",
      "www.npr.org",
      "www.washingtonpost.com",
      "globalnews.ca",
      "www.bbc.com",
      "www.dw.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "More than 10,000 Air Canada flight attendants went on strike after a deadline to reach a deal passed, leaving travelers around the world stranded and scrambling during the peak summer travel season.",
      "Air Canada advises passengers not to go to the airport unless they have tickets on other airlines.",
      "The strike could disrupt travel plans for more than 100,000 passengers.",
      "More than 100,000 passengers from across the world have been left stranded after Air Canada's staff strike over pay.",
      "Air Canada's planes are grounded after more than 10,000 Air Canada flight attendants walked off the job after a deadline to reach a deal passed",
      "The employees are demanding, in part, wage parity with smaller domestic airlines, a union spokesman said. More than 600 flights have been canceled.",
      "Ahead of the work stoppage, the airline said it had canceled most of the 700 flights that it directly operates, which carry about 130,000 people each day.",
      "Air Canada cancels all mainline flights as over 10,000 flight attendants strike, stranding passengers worldwide and affecting 130,000 daily amid stalled contract talks.",
      "Over 10K Air Canada flight attendants strike, grounding flights and limiting rebooking as experts urge travellers to prep backups, check insurance, and expect delays.",
      "Passengers around the world are feeling the effects after the union representing more than 10,000 flight attendants with Air Canada announced its members were walking off the job after it was unable to reach an eleventh-hour deal with the airline. The strike officially began just before 1 a.m. ET on",
      "You were planning to catch a flight and the dreaded text pops up on your phone: your flight has been cancelled. Now what? More than 10,000 Air Canada flight attendants are off the job after a strike deadline passed Saturday without a deal. The airline had already cancelled 500 flights on Friday in a"
    ],
    "image_url": "",
    "titles": [
      "Air Canada suspends operations as flight attendants go on strike",
      "What to know as Air Canada grounds flights and attendants strike",
      "Hundreds of flights grounded as Air Canada cabin staff go on strike",
      "Air Canada suspends flights after cabin staff go on strike",
      "Air Canada suspends operations as flight attendants go on strike",
      "Air Canada cancels hundreds of flights as attendants go on strike",
      "Air Canada’s Flight Attendants Begin Strike, Crippling the Airline",
      "Air Canada flight attendants on strike, airline’s flights cancelled",
      "Marooned by Air Canada flight attendant strike? Here are your options",
      "Air Canada flight attendants on strike, airline’s flights cancelled",
      "Marooned by Air Canada flight attendant strike? Here are your options"
    ],
    "score_components": {
      "magnitude": 0.94,
      "recency": 0.933,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.841,
    "summary": "Air Canada's 10,500 flight attendants initiated a strike on Saturday, leading to the cancellation of over 600 flights and affecting around 130,000 passengers daily during the holiday peak season. This action came after failed wage negotiations between the airline and the union, which sought parity with smaller domestic airlines. The strike began just before 1 a.m. ET, impacting all Air Canada and Air Canada Rouge flights.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 70 tokens",
    "image": {
      "src": "icons/canada.svg",
      "thumbnail": "icons/canada.svg",
      "alt": "canada flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Commanders Activate WR Terry McLaurin from Injury List",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sat, 16 Aug 2025 11:09:43 EST",
    "source": "ESPN",
    "sources": [
      "Sports Illustrated",
      "Yahoo Sports",
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "news.google.com",
      "www.espn.com",
      "sports.yahoo.com"
    ],
    "snippets": [
      "The Commanders have activated wide receiver Terry McLaurin off the physically unable to perform list.",
      "The move is reportedly unrelated to McLaurin's contract negotiations.",
      "<a href=\"https://news.google.com/rss/articles/CBMijAFBVV95cUxNbTRIak5uOEJUbmEyeHQwdHVOcTZzd1dqUmVOZnJudzc2SHN1LVJsOXNzWGNDT0lZWG9EMHpPLW1wVFZsU1Y4YVVDU0tDdnZLSGl2VjhVVEl6TDlqd05NNndrbHdDY1RMYXhKU3RFWFM2TGtaMXR2N3U3VFU5blpZY3lzMnlybFpGS2ROcw?oc=5\" target=\"_blank\">Terry McLaurin to Come Off PUP List A",
      "<p>The Washington Commanders activated Terry McLaurin off the physically unable to perform list on Saturday amid lingering contract extension talks with the All-Pro wide receiver.</p>"
    ],
    "image_url": "",
    "titles": [
      "Commanders activate WR McLaurin off PUP list",
      "Commanders activate Terry McLaurin off PUP list, All-Pro receiver's contract situation still up in the air",
      "Terry McLaurin to Come Off PUP List Amid Contract Squabble With Commanders - Sports Illustrated",
      "Commanders activate Terry McLaurin off PUP list, contract talks linger"
    ],
    "score_components": {
      "magnitude": 0.9,
      "recency": 0.98,
      "consensus": 0.985,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.832,
    "summary": "The Washington Commanders have activated wide receiver Terry McLaurin from the physically unable to perform list. This move is said to be unrelated to ongoing contract negotiations with McLaurin. The activation indicates McLaurin is now cleared to participate in team activities.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 41 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Hurricane Erin Becomes First Major Hurricane of 2025, Targets Caribbean",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sat, 16 Aug 2025 08:34:53 -0400",
    "source": "NPR",
    "sources": [
      "CityNews",
      "Axios",
      "Deutsche Welle",
      "NPR",
      "Phys.org"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "phys.org",
      "www.npr.org",
      "www.dw.com",
      "news.google.com"
    ],
    "snippets": [
      "Erin strengthened into a powerful Category 4 hurricane in the Caribbean on Saturday and continues to intensify, the National Hurricane Center said.",
      "Erin is the Atlantic season's first hurricane and is set to escalate over the weekend though the threat of direct impacts in the Bahamas and along the east coast of the US appears to be receding.",
      "<a href=\"https://news.google.com/rss/articles/CBMidEFVX3lxTFAwT1JJWGEtcDZvcElXSEtjS0xDY3VDY29udE93TTRONUpIN0FRT1hDOC1wR0E3SkJiN1ZDMzRNamdEeWw4SlJlLVBYUzk3SnozSDBGa1QtRkozUHFzanFHbTl0ODRlaW0zRnNVZjFSdmVDRDlJ?oc=5\" target=\"_blank\">Erin becomes 2025's first major hurricane as storm intensifies</a>&nbsp",
      "Hurricane Erin gained strength Friday as it churned in the Atlantic Ocean and bore down on the Caribbean, where it could bring heavy rain to the Virgin Islands and Puerto Rico.",
      "SAN JUAN, Puerto Rico (AP) — Hurricane Erin exploded in strength to a Category 5 storm in the Caribbean on Saturday, rapidly powering up from a tropical storm in a single day, the National Hurricane Center said. While the compact hurricane&#8217;s center wasn&#8217;t expected to hit land, it threate"
    ],
    "image_url": "",
    "titles": [
      "Hurricane Erin becomes a Category 4 in the Caribbean as the region braces for flooding",
      "Hurricane Erin intensifies into a Category 5 storm",
      "Erin becomes 2025's first major hurricane as storm intensifies - Axios",
      "Hurricane Erin intensifies in Atlantic, eyes Caribbean",
      "Hurricane Erin explodes in strength to a Category 5 storm in the Caribbean"
    ],
    "score_components": {
      "magnitude": 0.9,
      "recency": 0.929,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.826,
    "summary": "Hurricane Erin has intensified to become the first major hurricane of 2025. The storm is currently located in the Atlantic Ocean and is heading towards the Caribbean. It is expected to bring heavy rainfall to the Virgin Islands and Puerto Rico.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 41 tokens",
    "image": {
      "src": "icons/newspaper.svg",
      "thumbnail": "icons/newspaper.svg",
      "alt": "general",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "High Costs Lead Canadians to Rethink Domestic Travel Plans",
    "domain": "general",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sat, 16 Aug 2025 14:00:03 +0000",
    "source": "Global News",
    "sources": [
      "CityNews",
      "Financial Post",
      "Global News"
    ],
    "domains": [
      "financialpost.com",
      "globalnews.ca",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "Canadians are finding domestic travel increasingly unaffordable, with high costs for flights, rentals, and hotels forcing some to scale back plans or stay closer to home.",
      "FREDERICTON &#8212; In September 2024, Natasha Beitman Brener and her husband decided to take a three-week vacation to Canada&#8217;s East Coast. Beitman Brener, a lawyer in Kingston, Ont., spent about six months planning the trip, looking at various options to stay in Prince Edward Island, Nova Sco",
      "FREDERICTON — In September 2024, Natasha Beitman Brener and her husband decided to take a three-week vacation to Canada&#8217;s East Coast. Beitman Brener, a lawyer in Kingston, Ont., spent about six months planning the trip, looking at various options to stay in Prince Edward Island, Nova Scotia an"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/08/bfa8e34a6834d6db9eb8248a477b50a1abbc1d80452c40ad3eba66db6c3605fe.jpg?quality=65&strip=all",
    "titles": [
      "Skipping the U.S. and taking a vacation to East Coast this year? It will cost you.",
      "Skipping the U.S. and taking a vacation to East Coast this year? It will cost you.",
      "Skipping the U.S. and taking a vacation to East Coast this year? It will cost you."
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.957,
      "consensus": 0.897,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.796,
    "summary": "Canadians are increasingly finding domestic travel unaffordable due to high costs associated with flights, rentals, and hotels. This trend has led some, like Natasha Beitman Brener from Kingston, Ontario, to reconsider their vacation plans. Despite six months of planning for a three-week trip to Canada's East Coast in September 2024, the financial burden has forced individuals and families to either scale back their travel plans or opt to stay closer to home.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 74 tokens",
    "image": {
      "src": "icons/newspaper.svg",
      "thumbnail": "icons/newspaper.svg",
      "alt": "general",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Trump-Putin Talks in Alaska End Without Ukraine Ceasefire Agreement",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 16 Aug 2025 01:50:10 GMT",
    "source": "BBC",
    "sources": [
      "Al Jazeera",
      "Financial Times",
      "BBC",
      "New York Times",
      "Washington Post"
    ],
    "domains": [
      "www.ft.com",
      "www.nytimes.com",
      "www.washingtonpost.com",
      "www.bbc.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Three BBC correspondents at the meeting in Alaska assess what we learned about the two leaders and what's next for the war.",
      "The anticipated meeting between Donald Trump and Vladimir Putin ended without a ceasefire deal in Ukraine.",
      "Warm welcome for Russia&#039;s Putin at meeting with US President Donald Trump in Alaska, but no deal on ending Ukraine war.",
      "Truncated talks end without ceasefire despite US president’s warm welcome for Russian leader",
      "An immediate ceasefire to the war in Ukraine had long been a bedrock demand by the U.S., Ukraine and their European allies.",
      "President Trump’s failure to reach an accord on Ukraine only made his warm welcome for the Russian leader more striking.",
      "President Trump gave President Vladimir Putin a warm public reception, effectively ending his diplomatic isolation over the past three years for his invasion of Ukraine. But Mr. Putin did not agree to stop the war."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/e06a/live/bbdafac0-7a78-11f0-ab3e-bd52082cd0ae.jpg",
    "titles": [
      "No ceasefire, no deal: What summit means for Trump, Putin and Ukraine",
      "Trump-Putin summit ends with no ceasefire deal",
      "Trump, Putin end short summit without ceasefire deal in Ukraine",
      "Trump fails to secure Ukraine deal at Alaska summit with Putin",
      "Trump drops ceasefire demand for Ukraine war after summit with Putin",
      "At Trump’s Summit, No Deal on Ukraine, and No Consequence for Putin",
      "Trump and Putin Put on a Show in Summit, but No Ukraine Deal Emerges"
    ],
    "score_components": {
      "magnitude": 0.96,
      "recency": 0.727,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.781,
    "summary": "President Trump and Russian President Vladimir Putin met at a military base outside Anchorage, Alaska, where they discussed the ongoing war in Ukraine. Despite a warm welcome from Trump, the talks concluded without reaching a ceasefire or any agreement to end the conflict. The meeting ended Trump's diplomatic isolation of Putin over the Ukraine invasion but failed to produce a solid outcome on stopping the war. Additionally, Trump spoke with Ukraine's President Volodymyr Zelensky, who plans to visit Washington. The lack of a decisive agreement on Ukraine was noted as a significant aspect of th",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 97 tokens",
    "image": {
      "src": "icons/ukraine.svg",
      "thumbnail": "icons/ukraine.svg",
      "alt": "ukraine flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Cloudburst in Pakistan and India Causes Flash Floods, 185 Dead",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 16 Aug 2025 06:53:55 GMT",
    "source": "BBC",
    "sources": [
      "Deutsche Welle",
      "BBC",
      "New York Times",
      "Al Jazeera"
    ],
    "domains": [
      "www.nytimes.com",
      "www.aljazeera.com",
      "www.dw.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The majority of deaths were recorded in Pakistan's mountainous Khyber Pakhtunkhwa area.",
      "Rescue efforts intensify in flood-hit villages as thousands remain stranded and death toll rises across Pakistan.",
      "Floods triggered by cloudbursts and monsoon rains have killed around 400 people, with many more still missing, officials say. Rescue workers are desperately searching for survivors among the muddy debris.",
      "The country has endured heavier rain during monsoon seasons, which scientists have attributed to climate change. The authorities said that at least 194 people died on Friday."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/82f6/live/7becf7b0-7a82-11f0-83cc-c5da98c419b8.jpg",
    "titles": [
      "Flash floods kill more than 300 in Pakistan and Pakistan-administered Kashmir",
      "Flash floods wreak havoc in northern Pakistan",
      "Flash floods kill hundreds in Pakistan, India",
      "Flash Floods in Pakistan Kill at Least 150 People in a Single Day"
    ],
    "score_components": {
      "magnitude": 0.9,
      "recency": 0.808,
      "consensus": 0.985,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.773,
    "summary": "A massive cloudburst in north-west Pakistan has resulted in flash floods, killing at least 157 people, with the majority of fatalities occurring in the Khyber Pakhtunkhwa area. The incident also caused deadly flooding and landslides in neighboring India. Rescue operations are ongoing for those still missing. The region has experienced heavier monsoon rains, which scientists link to climate change. The total death toll reported by authorities on Friday reached at least 185.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 73 tokens",
    "image": {
      "src": "icons/india.svg",
      "thumbnail": "icons/india.svg",
      "alt": "india flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Trump Shifts to Seek Peace in Ukraine After Putin Talks, Ditching Ceasefire Plan",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sat, 16 Aug 2025 14:21:10 +0000",
    "source": "Al Jazeera",
    "sources": [
      "The Guardian",
      "Forbes",
      "Al Jazeera"
    ],
    "domains": [
      "www.theguardian.com",
      "www.forbes.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Trump changes his position on Ukraine saying he prefers peace accord as opposed to ceasefire after Alaska talks.",
      "<p>Ukrainian president to make first return to White House since infamous row with Trump in February</p><ul><li><p><a href=\"https://www.theguardian.com/world/live/2025/aug/16/putin-trump-summit-alaska-us-europe-ukraine-security-guarantees-zelenskyy-latest-news-updates\">Putin-Trump summit – latest up",
      "Trump said after meeting with Putin in Alaska the “best way” to end Russia’s war with Ukraine is “to go directly to a peace agreement,” and not a “mere ceasefire agreement.”"
    ],
    "image_url": "",
    "titles": [
      "Trump set to meet Ukraine’s Zelenskyy after ‘successful’ talks with Putin",
      "Zelenskyy to meet Trump on Monday after Putin summit briefing",
      "Trump Will Meet Zelensky In D.C. Monday After Alaska Meeting With Putin"
    ],
    "score_components": {
      "magnitude": 0.86,
      "recency": 0.964,
      "consensus": 0.897,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.768,
    "summary": "After discussions with Putin in Alaska, Trump has shifted his stance on the Ukraine conflict, now advocating for a peace agreement rather than a ceasefire. This comes as the Ukrainian President plans a return visit to the White House, marking his first since a notable disagreement with Trump in February. Trump's new position emphasizes seeking a comprehensive resolution to Russia's war with Ukraine.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 65 tokens",
    "image": {
      "src": "icons/ukraine.svg",
      "thumbnail": "icons/ukraine.svg",
      "alt": "ukraine flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Trump, Putin Hold Talks in Alaska; No Ukraine Deal Reached",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sat, 16 Aug 2025 01:19:28 +0000",
    "source": "Al Jazeera",
    "sources": [
      "CNBC",
      "Axios",
      "Al Jazeera"
    ],
    "domains": [
      "www.cnbc.com",
      "news.google.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "US President Donald Trump says he and Russian President Vladimir Putin made progress during talks in Alaska.",
      "<a href=\"https://news.google.com/rss/articles/CBMid0FVX3lxTFB0cXYwRk5TMmY5VEVCdnhRNTBwYlRJRzQ5NDh3NEF4U19uTm5iSFlfUHRNUlozb0VXb3l2bXFBa0RveVcway1LSTVjQUNqZGNMak5xTk1jckFQQlMtTjdpd2hqcW9JM2k2aEEwUHJKRG5Gejhoa0c4?oc=5\" target=\"_blank\">Trump: Putin summit productive but \"we didn't get there\" on Ukraine",
      "Following the Friday meeting Trump said, \"There's no deal until there's a deal.\""
    ],
    "image_url": "",
    "titles": [
      "‘We didn’t get there’ says Trump, after Putin Ukraine meeting falls short",
      "Trump: Putin summit productive but \"we didn't get there\" on Ukraine deal - Axios",
      "Trump hails meeting with Putin as 'productive' after talks over Ukraine fail to reach a breakthrough"
    ],
    "score_components": {
      "magnitude": 0.86,
      "recency": 0.735,
      "consensus": 0.897,
      "constructiveness": 0.091,
      "proximity": 0.5
    },
    "score": 0.731,
    "summary": "US President Donald Trump and Russian President Vladimir Putin held talks in Alaska, which Trump described as productive. However, despite making progress, Trump stated that no agreement was reached concerning Ukraine, summarizing the outcome with, \"There's no deal until there's a deal.\"",
    "constructiveness_score": 0.091,
    "constructiveness_reason": "1 constructive keywords out of 44 tokens",
    "image": {
      "src": "icons/ukraine.svg",
      "thumbnail": "icons/ukraine.svg",
      "alt": "ukraine flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "US-Russia Talks End Without Ceasefire; Putin Invites US Leader to Moscow",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 16 Aug 2025 05:01:19 GMT",
    "source": "BBC",
    "sources": [
      "Washington Post",
      "BBC",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.washingtonpost.com",
      "www.bbc.com"
    ],
    "snippets": [
      "With no ceasefire and an invitation to Moscow, the US and Russia's meeting yields more questions than answers.",
      "The US leader cut a subdued figure after the meeting, which failed to achieve its primary goal – an end to Russia&#039;s war.",
      "President Donald Trump dropped his demand for an immediate ceasefire in Ukraine after meeting with Russian President Vladimir Putin. Here are five takeaways from the Alaska summit and its aftermath."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/4419/live/35fdd590-7a77-11f0-ab3e-bd52082cd0ae.jpg",
    "titles": [
      "Five key takeaways after the Alaska summit",
      "‘No deal’ at Trump-Putin meeting: Key takeaways from Alaska summit",
      "Key takeaways from Trump’s summit with Putin and dramatic ceasefire reversal"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.777,
      "consensus": 0.897,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.71,
    "summary": "The US-Russia meeting concluded without reaching its main objective of ending Russia's war, leaving many unresolved issues. Despite the lack of a ceasefire, Russian President Vladimir Putin extended an invitation to the US leader for a future meeting in Moscow. The outcome of the summit has been characterized by more questions than answers, with the US leader appearing subdued post-meeting.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 63 tokens",
    "image": {
      "src": "icons/usa.svg",
      "thumbnail": "icons/usa.svg",
      "alt": "us flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Air Canada Strike Cancels Flights, Affects 130,000 Daily",
    "domain": "business",
    "source_domain": "financialpost.com",
    "location": "national",
    "published": "Sat, 16 Aug 2025 10:11:00 +0000",
    "source": "Financial Post",
    "sources": [
      "CityNews",
      "Financial Post"
    ],
    "domains": [
      "financialpost.com",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "Air Canada flights are cancelled after thousands of flight attendants began a strike early Saturday morning. The company says the work stoppage means all Air Canada and Air Canada Rouge flights would be cancelled amid the work stoppage. Around 130,000 customers will be affected each day that the str",
      "Air Canada flights are cancelled after thousands of flight attendants began a strike early Saturday morning. The company says the work stoppage means all Air Canada and Air Canada Rouge flights would be cancelled amid the work stoppage. Around 130,000 customers will be affected each day that the str"
    ],
    "image_url": "",
    "titles": [
      "Were you planning to fly Air Canada? What you need to know about the strike",
      "Were you planning to fly Air Canada? What you need to know about the strike"
    ],
    "score_components": {
      "magnitude": 0.74,
      "recency": 0.884,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.706,
    "summary": "Thousands of Air Canada flight attendants started a strike early Saturday, leading to the cancellation of all Air Canada and Air Canada Rouge flights. The company stated that approximately 130,000 customers would be affected daily by the work stoppage.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 40 tokens",
    "image": {
      "src": "icons/canada.svg",
      "thumbnail": "icons/canada.svg",
      "alt": "canada flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Bournemouth's Semenyo Thanks Fans After Racial Abuse; Man Arrested",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sat, 16 Aug 2025 11:09:44 EST",
    "source": "ESPN",
    "sources": [
      "Sky Sports",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.skysports.com"
    ],
    "snippets": [
      "Semenyo has thanked the \"football family\" for the support he received after being subjected to alleged racist abuse during Bournemouth's loss at Liverpool.",
      "A 47-year-old man from Liverpool has been arrested after Bournemouth forward Antoine Semenyo reported being racially abused during the first game of the Premier League season, Merseyside Police said."
    ],
    "image_url": "",
    "titles": [
      "Arrest made for alleged racist abuse at EPL match",
      "Man arrested following alleged racist abuse towards Semenyo"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.981,
      "consensus": 0.682,
      "constructiveness": 0.083,
      "proximity": 0.75
    },
    "score": 0.695,
    "summary": "Antoine Semenyo, Bournemouth forward, expressed gratitude for the support after facing alleged racial abuse during a match against Liverpool. A 47-year-old man from Liverpool was arrested in connection to the incident, reported by Merseyside Police. The abuse occurred during the Premier League season's opening game.",
    "constructiveness_score": 0.083,
    "constructiveness_reason": "1 constructive keywords out of 48 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "UFC 319: Experts Predict du Plessis vs. Chimaev, Betting Advice Available",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sat, 16 Aug 2025 10:00:51 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Former UFC fighters and analysts give predictions for UFC 319 main event. Ian Parker provides betting advice.",
      "SportsLine's Daniel Vithlani reveals his picks for the UFC 319: Du Plessis vs. Chimaev fight card from the United Center in Chicago on Saturday"
    ],
    "image_url": "",
    "titles": [
      "Expert picks, best bets for UFC 319",
      "UFC 319 odds, props, predictions, fight card: Du Plessis vs. Chimaev picks, best bets by proven MMA expert"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.957,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.689,
    "summary": "Former UFC fighters and analysts have shared their predictions for the UFC 319 main event, focusing on the matchup between Dricus du Plessis and Khamzat Chimaev. Ian Parker has offered betting advice for the event. The latest odds, prop bets, expert picks, and predictions for UFC 319, which is set to take place in Chicago, are now available for enthusiasts looking to place wagers on the fights.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 67 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Kelsey Plum Says Controversial Team Clark Remarks Were \"A Bad Joke\"",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sat, 16 Aug 2025 11:09:43 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Sparks guard Kelsey Plum said on Sue Bird's podcast that her remarks after the All-Star Game about members of Team Clark not being present for the \"Pay Us What You Owe Us\" T-shirt meeting were \"a really bad joke\" about the players being hungover.",
      "Plum caused a stir last month with her comments about Team Clark"
    ],
    "image_url": "",
    "titles": [
      "Plum: ASG jab at Team Clark 'a really bad joke'",
      "Kelsey Plum clarifies WNBA All-Star Game jab toward Team Clark, laments 'bad joke' amid CBA negotiations"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.98,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.686,
    "summary": "Kelsey Plum, a guard for the Sparks, clarified on Sue Bird's podcast that her previous comments about Team Clark members missing a meeting for \"Pay Us What You Owe Us\" T-shirts were meant as a joke, suggesting they were hungover. Her initial remarks had caused controversy. Plum now describes those comments as \"a really bad joke.\"",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 58 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Jaguars to Exercise Caution with Travis Hunter Against Saints",
    "domain": "sports",
    "source_domain": "sports.yahoo.com",
    "location": "national",
    "published": "Sat, 16 Aug 2025 15:44:56 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "sports.yahoo.com"
    ],
    "snippets": [
      "The Jacksonville Jaguars plan to be cautious with two-way star Travis Hunter in their preseason game at New Orleans on Sunday.  Although coach Liam Coen said Saturday that starters would play against the Saints, the Jaguars declined to commit to getting Hunter on the field after he sustained an uppe",
      "<p>The Jacksonville Jaguars plan to be cautious with two-way star Travis Hunter in their pre-season game at New Orleans on Sunday.</p>"
    ],
    "image_url": "",
    "titles": [
      "Jaguars are taking a cautious approach with 2-way star Travis Hunter in preseason game at the Saints",
      "Jaguars taking cautious approach with Travis Hunter in pre-season game vs. Saints"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.993,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.671,
    "summary": "The Jacksonville Jaguars have decided to exercise caution with Travis Hunter for their preseason game against the New Orleans Saints, following an upper body injury he sustained. Despite Coach Liam Coen's statement that starters would play, the team has not confirmed Hunter's participation in the game.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 48 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Alejandro Kirk Shines, Leads Blue Jays to Victory Over Rangers",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sat, 16 Aug 2025 03:36:54 +0000",
    "source": "Global News",
    "sources": [
      "Sportsnet",
      "Global News"
    ],
    "domains": [
      "www.sportsnet.ca",
      "globalnews.ca"
    ],
    "snippets": [
      "Alejandro Kirk's late-game heroics resulted in three deafening ovations from the 42,260 inside the Rogers Centre on Friday.",
      "<p>When Alejandro Kirk steals a base, you know things are going well for the Toronto Blue Jays.</p>"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/08/8e5dddbca367144d9ef1999c2ebb2a2a49ea35371198440a4a8452c06dbacbdd.jpg?quality=65&strip=all",
    "titles": [
      "Kirk plays hero, steals first base in Jays’ win",
      "Blue Jays’ Alejandro Kirk records first career stolen base in dramatic win"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.771,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.67,
    "summary": "Alejandro Kirk led the Toronto Blue Jays to a thrilling moment against the Texas Rangers, drawing three loud ovations from 42,260 fans at the Rogers Centre. Kirk's performance included a pivotal two-run single off Rangers reliever Phil Maton, giving the Blue Jays a lead. Additionally, he achieved his first career stolen base during the same inning, highlighting a standout game that significantly contributed to the team's success on that day.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 74 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Hurricane Erin Intensifies to Category 4, Threatens East Coast",
    "domain": "business",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Sat, 16 Aug 2025 11:49:41 -0400",
    "source": "ABC News",
    "sources": [
      "Forbes",
      "ABC News"
    ],
    "domains": [
      "www.forbes.com",
      "abcnews.go.com"
    ],
    "snippets": [
      "Erin has become the first hurricane of the Atlantic season with strong waves and rip currents possible along the East Coast of the United States as early as next week.",
      "Hurricane Erin has explosively intensified to a Category 4 storm and may not be done yet. Here's the latest."
    ],
    "image_url": "https://s.abcnews.com/images/US/hurricane-erin-02-ht-jt-250816_1755350072963_hpMain_4x3t_384.jpg",
    "titles": [
      "Hurricane Erin tracker: Storm strengthens to Category 5",
      "Hurricane Erin Explosively Strengthening - Close To Category 5"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.994,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.664,
    "summary": "Hurricane Erin has rapidly intensified into a Category 4 storm, becoming the first hurricane of the Atlantic season. Strong waves and rip currents are expected along the East Coast of the United States next week. The storm's future intensity and path remain uncertain.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 44 tokens",
    "image": {
      "src": "icons/briefcase.svg",
      "thumbnail": "icons/briefcase.svg",
      "alt": "business",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "2025 Fantasy Football Guide Outlines Top Picks, Breakout Stars",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sat, 16 Aug 2025 14:10:22 +0000",
    "source": "CBS Sports",
    "sources": [
      "Yahoo Sports",
      "CBS Sports"
    ],
    "domains": [
      "athlonsports.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "SportsLine's 2025 Fantasy football draft guide includes Fantasy football auction values, keeper advice, mock drafts and more",
      "In 2025, these breakout players are ready to ascend to the next level in fantasy football and force all gamers to take notice!  Last year's top NFL draft pick, Williams translated his game well enough, all things considered.  The offseason coaching change brings former Detroit Lions offensive coordi"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/08/16/1beb6014-a6fa-42a2-87f2-712e14ab2ea0/r-j-harvey-broncos-getty-images.jpg",
    "titles": [
      "2025 Fantasy football draft prep: Rankings, guide, strategy, rookie advice, top 150 players via NFL insiders",
      "Fantasy Football Breakout Players You Must Draft in 2025"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.96,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.657,
    "summary": "SportsLine released its 2025 Fantasy Football Draft Guide, featuring auction values, keeper advice, and mock drafts. It highlights breakout players poised for significant impact, including last year's top NFL draft pick, Williams, who has adapted well to the professional level. The guide also notes the potential impact of a coaching change, with a former Detroit Lions offensive coordinator taking over, suggesting a strategic shift that could influence player performance and fantasy football dynamics.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 74 tokens",
    "image": {
      "src": "icons/football.svg",
      "thumbnail": "icons/football.svg",
      "alt": "football",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Procter & Gamble: From 1837 Ohio Merger to Global Household Name",
    "domain": "business",
    "source_domain": "financialpost.com",
    "location": "national",
    "published": "Sat, 16 Aug 2025 10:02:02 +0000",
    "source": "Financial Post",
    "sources": [
      "CityNews",
      "Financial Post"
    ],
    "domains": [
      "financialpost.com",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "COLUMBUS &#8212; In 1837, two brothers-in-law living in Ohio &#8212; one a candle maker, the other a soap maker &#8212; merged their businesses to form what later became the multinational juggernaut Procter &#038; Gamble. Nearly two centuries later, the company &#8212; which makes everything from to",
      "COLUMBUS — In 1837, two brothers-in-law living in Ohio — one a candle maker, the other a soap maker — merged their businesses to form what later became the multinational juggernaut Procter &#38; Gamble. Nearly two centuries later, the company — which makes everything from toothpaste to diapers — cou"
    ],
    "image_url": "",
    "titles": [
      "Ohioans came out strong for Trump — now they’re bracing for his tariffs",
      "Ohioans came out strong for Trump — now they’re bracing for his tariffs"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.881,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.642,
    "summary": "In 1837, two brothers-in-law in Ohio, a candle maker and a soap maker, merged their businesses, creating what would grow into the multinational corporation Procter & Gamble. Nearly two centuries on, P&G has expanded its product line to include a wide range of household items such as toothpaste and diapers.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 52 tokens",
    "image": {
      "src": "icons/briefcase.svg",
      "thumbnail": "icons/briefcase.svg",
      "alt": "business",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "ASU Develops NasRED: Rapid Test Detects COVID, Ebola, HIV from a Blood Drop",
    "domain": "science",
    "source_domain": "www.sciencedaily.com",
    "location": "global",
    "published": "Fri, 15 Aug 2025 23:54:52 EDT",
    "source": "ScienceDaily",
    "sources": [
      "ScienceDaily",
      "SciTechDaily"
    ],
    "domains": [
      "www.sciencedaily.com",
      "scitechdaily.com"
    ],
    "snippets": [
      "Arizona State University scientists have unveiled NasRED, a revolutionary one-drop blood test that can detect diseases like COVID-19, Ebola, HIV, and Lyme with incredible speed and precision. Using gold nanoparticles to spot microscopic disease markers, the device delivers results in just 15 minutes",
      "<a href=\"https://scitechdaily.com/2-one-drop-blood-test-detects-hidden-diseases-in-15-minutes/\" rel=\"nofollow\" title=\"$2 One-Drop Blood Test Detects Hidden Diseases in 15 Minutes\"><img alt=\"Artistic Illustration of Gold Nanoparticles Detecting Disease Proteins\" class=\"webfeedsFeaturedVisual wp-post-"
    ],
    "image_url": "",
    "titles": [
      "A $2 gold nanotech test that detects deadly diseases in minutes",
      "$2 One-Drop Blood Test Detects Hidden Diseases in 15 Minutes"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.776,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.621,
    "summary": "Arizona State University scientists have developed NasRED, a groundbreaking blood test capable of detecting diseases such as COVID-19, Ebola, HIV, and Lyme disease quickly and accurately. This innovative test, which requires just a single drop of blood, utilizes gold nanoparticles to identify tiny disease markers, providing results in as little as 15 minutes.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 54 tokens",
    "image": {
      "src": "icons/beaker.svg",
      "thumbnail": "icons/beaker.svg",
      "alt": "science",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Trump, Putin Hold Summit in Alaska on Ukraine, European Security",
    "domain": "business",
    "source_domain": "www.nytimes.com",
    "location": "global",
    "published": "Fri, 15 Aug 2025 19:47:26 +0000",
    "source": "New York Times",
    "sources": [
      "Bloomberg",
      "New York Times"
    ],
    "domains": [
      "www.nytimes.com",
      "news.google.com"
    ],
    "snippets": [
      "The delegations include top diplomatic, military and economic officials, a sign that the U.S. and Russia will discuss more than the war in Ukraine.",
      "<a href=\"https://news.google.com/rss/articles/CBMihgFBVV95cUxNaWF6R1JKMmhRSHpLYllrY3hzeE1kdHlHVlJMRE9vaTVzT2dDODBvaks4OHExVFFWVS1WTDhzbjg3MmI3ZHZabDU0c2t3Z0xXMW1IMkcyWXpNUGJ3RlA3N20xOENZcFQ0eTN3NlpFNEdTVTFsQklaNTlndjBYWTdKMEVvdFRvZw?oc=5\" target=\"_blank\">Trump-Putin Summit Live News: Latest on War i"
    ],
    "image_url": "https://static01.nyt.com/images/2025/08/15/us/politics/15putin-trump-delegations-diptych/15putin-trump-delegations-diptych-mediumSquareAt3X.jpg",
    "titles": [
      "Who’s Attending the Trump-Putin Meeting in Alaska",
      "Trump-Putin Summit Live News: Latest on War in Ukraine at Alaska Meeting - Bloomberg.com"
    ],
    "score_components": {
      "magnitude": 0.76,
      "recency": 0.655,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.618,
    "summary": "U.S. President Donald Trump is meeting with Russian President Vladimir Putin in Alaska for a summit aimed at addressing the war in Ukraine and European security. The meeting, involving top diplomatic, military, and economic officials from both nations, indicates a broad discussion agenda beyond the conflict. The outcome could significantly influence the direction of the Ukraine war and the overall security landscape in Europe.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 65 tokens",
    "image": {
      "src": "icons/ukraine.svg",
      "thumbnail": "icons/ukraine.svg",
      "alt": "ukraine flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Liverpool Wins 4-2 Against Bournemouth Amid Tributes and Racial Abuse Report",
    "domain": "sports",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Fri, 15 Aug 2025 22:10:18 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Sportsnet",
      "Al Jazeera"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Bournemouth fight back from two down but Liverpool secure late win on emotional Anfield night.",
      "<p>Defending champion Liverpool launched the Premier League with a dramatic 4-2 win over Bournemouth at Anfield on Friday in an emotionally charged match featuring tributes to Diogo Jota and a player reporting racial abuse.</p>"
    ],
    "image_url": "",
    "titles": [
      "Liverpool avoid late Bournemouth scare to win Premier League opener",
      "Late goals, Jota tributes, racism claim as Liverpool wins Premier League opener"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.688,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.61,
    "summary": "Liverpool began their Premier League title defence with a 4-2 victory over Bournemouth at Anfield, in a match marked by tributes to former player Diogo Jota. The game, which was emotionally charged, saw Liverpool secure the win with late goals from Federico Chiesa and Mohamed Salah. The night was also notable for an incident of a player reporting racial abuse.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 61 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Sen. Hawley Launches Investigation into Meta, Urges Document Preservation",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Fri, 15 Aug 2025 18:23:51 GMT",
    "source": "CNBC",
    "sources": [
      "TechCrunch",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "techcrunch.com"
    ],
    "snippets": [
      "Sen. Josh Hawley called on Meta CEO Mark Zuckerberg to preserve relevant materials, including emails.",
      "“Is there anything - ANYTHING - Big Tech won’t do for a quick buck?” Hawley wrote in a post on X announcing the investigation."
    ],
    "image_url": "",
    "titles": [
      "Sen. Hawley to probe Meta AI bot policies for children following damning report",
      "Sen. Hawley to probe Meta after report finds its AI chatbots flirt with kids"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.623,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.59,
    "summary": "Sen. Josh Hawley has initiated an investigation into Meta, requesting CEO Mark Zuckerberg to retain all pertinent documents, such as emails. Hawley's inquiry was announced via a post on X, where he questioned the extent of Big Tech's actions for financial gain.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 44 tokens",
    "image": {
      "src": "icons/briefcase.svg",
      "thumbnail": "icons/briefcase.svg",
      "alt": "business",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Air Canada Strike Update Scheduled in Mississauga on August 16",
    "domain": "business",
    "source_domain": "financialpost.com",
    "location": "national",
    "published": "Sat, 16 Aug 2025 12:43:16 +0000",
    "source": "Financial Post",
    "sources": [
      "Financial Post"
    ],
    "domains": [
      "financialpost.com"
    ],
    "snippets": [
      "TORONTO &#8212; Representatives from the Air Canada Component of CUPE and CUPE National will be available today to provide an update on the Air Canada strike/lockout. WHERE: Fuschia Room, 2nd floor, Alt Hotel, 6080 Viscount Rd, Mississauga, ON L4V 0A1 WHEN: August 16, 10:00AM WHO: Wesley Lesosky, Pr"
    ],
    "image_url": "",
    "titles": [
      "CUPE to Share Update on Air Canada Strike/Lockout"
    ],
    "score_components": {
      "magnitude": 0.44,
      "recency": 0.932,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.539,
    "summary": "Representatives from the Air Canada Component of CUPE and CUPE National will update on the Air Canada strike/lockout at Alt Hotel in Mississauga, ON, on August 16 at 10:00 AM. Wesley Lesosky will be present. The outcome of the meeting and any decisions made are pending.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 48 tokens",
    "image": {
      "src": "icons/canada.svg",
      "thumbnail": "icons/canada.svg",
      "alt": "canada flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "MADD Canada Hosts Tribute for Victims of Impaired Driving in West St. Paul",
    "domain": "business",
    "source_domain": "financialpost.com",
    "location": "national",
    "published": "Sat, 16 Aug 2025 11:03:10 +0000",
    "source": "Financial Post",
    "sources": [
      "Financial Post"
    ],
    "domains": [
      "financialpost.com"
    ],
    "snippets": [
      "WEST ST. PAUL, Manitoba, Aug. 16, 2025 (GLOBE NEWSWIRE) &#8212; Today, MADD Canada is holding a ceremony to pay tribute to victims who have been killed and those who have suffered injuries as a result of crashes involving alcohol, cannabis and/or other drugs. The ceremony will be held at MADD Canada"
    ],
    "image_url": "",
    "titles": [
      "MADD Canada Honours Victims at Manitoba Memorial Monument Ceremony"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.9,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.525,
    "summary": "MADD Canada is hosting a ceremony in West St. Paul to honor victims of crashes involving alcohol, cannabis, or drugs. The event aims to remember those killed or injured in such incidents. The ceremony signifies a tribute to those affected by impaired driving.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 43 tokens",
    "image": {
      "src": "icons/canada.svg",
      "thumbnail": "icons/canada.svg",
      "alt": "canada flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Putin: Comprehensive Peace Agreement Needed to End Ukraine Conflict",
    "domain": "business",
    "source_domain": "fortune.com",
    "location": "global",
    "published": "Sat, 16 Aug 2025 15:17:44 +0000",
    "source": "Fortune",
    "sources": [
      "Fortune"
    ],
    "domains": [
      "fortune.com"
    ],
    "snippets": [
      "Putin has repeatedly said only a full peace deal could halt the war he ordered in February 2022, which has left tens of thousands dead and widespread destruction in Ukraine."
    ],
    "image_url": "https://fortune.com/img-assets/wp-content/uploads/2025/08/GettyImages-2229503980-e1755356958277.jpg?w=2048",
    "titles": [
      "Trump moves away from Ukraine war ceasefire demand and seeks peace deal, echoing Putin’s stance"
    ],
    "score_components": {
      "magnitude": 0.44,
      "recency": 0.983,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.499,
    "summary": "Russian President Vladimir Putin has stated that only a comprehensive peace agreement could end the conflict in Ukraine, which he initiated in February 2022. The war has resulted in the deaths of tens of thousands of people and extensive destruction across Ukraine.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 42 tokens",
    "image": {
      "src": "icons/ukraine.svg",
      "thumbnail": "icons/ukraine.svg",
      "alt": "ukraine flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Global Plastic Pollution Pact Faces Delay Amid Procedural Hurdles",
    "domain": "science",
    "source_domain": "www.wired.com",
    "location": "global",
    "published": "Sat, 16 Aug 2025 12:52:00 +0000",
    "source": "Wired",
    "sources": [
      "Wired"
    ],
    "domains": [
      "www.wired.com"
    ],
    "snippets": [
      "Procedural hurdles yet again foil progress on a global agreement to end plastic pollution."
    ],
    "image_url": "https://media.wired.com/photos/689f7d12c3f125e0b5761c08/master/pass/panama-2.jpg",
    "titles": [
      "UN Plastics Treaty Talks Once Again End in Failure"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.935,
      "consensus": 0.393,
      "constructiveness": 0.186,
      "proximity": 0.5
    },
    "score": 0.494,
    "summary": "Efforts to reach a global agreement to tackle plastic pollution face delays due to procedural obstacles. Despite ongoing discussions, progress has been hindered. The current status indicates that challenges persist in achieving a comprehensive plan to address the issue on a global scale.",
    "constructiveness_score": 0.186,
    "constructiveness_reason": "2 constructive keywords out of 43 tokens",
    "image": {
      "src": "icons/beaker.svg",
      "thumbnail": "icons/beaker.svg",
      "alt": "science",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Anthropic says some Claude models can now end ‘harmful or abusive’ conversations",
    "domain": "technology",
    "source_domain": "techcrunch.com",
    "location": "global",
    "published": "Sat, 16 Aug 2025 15:50:05 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com"
    ],
    "snippets": [
      "Anthropic says new capabilities allow its latest AI models to protect themselves by ending abusive conversations."
    ],
    "image_url": "",
    "titles": [
      "Anthropic says some Claude models can now end ‘harmful or abusive’ conversations"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.994,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.487,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 12 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Rice University Enhances Phonon Interference, Sets Sensitivity Record",
    "domain": "science",
    "source_domain": "www.sciencedaily.com",
    "location": "global",
    "published": "Sat, 16 Aug 2025 11:28:40 EDT",
    "source": "ScienceDaily",
    "sources": [
      "ScienceDaily"
    ],
    "domains": [
      "www.sciencedaily.com"
    ],
    "snippets": [
      "Rice University scientists have discovered a way to make tiny vibrations, called phonons, interfere with each other more strongly than ever before. Using a special sandwich of silver, graphene, and silicon carbide, they created a record-breaking effect so sensitive it can detect a single molecule wi"
    ],
    "image_url": "",
    "titles": [
      "Scientists just made vibrations so precise they can spot a single molecule"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.987,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.486,
    "summary": "Rice University researchers have developed a method to significantly enhance the interference between tiny vibrations known as phonons. By constructing a layered material composed of silver, graphene, and silicon carbide, they achieved a sensitivity level capable of detecting a single molecule. This breakthrough marks a record-setting advancement in the field.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 51 tokens",
    "image": {
      "src": "icons/beaker.svg",
      "thumbnail": "icons/beaker.svg",
      "alt": "science",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "The Pixel 9 Pro Fold is $600 off ahead of the new model’s debut",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-08-16T10:23:27-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "www.theverge.com"
    ],
    "snippets": [
      "Some people like to stay on the cutting edge of technology. If that’s you, you already know that Google is going to officially unveil its Pixel 10 phones (including a new Fold) during its August 20th event. But if you’re someone who prefers to use these opportunities to save on last-gen tech, you’ve"
    ],
    "image_url": "",
    "titles": [
      "The Pixel 9 Pro Fold is $600 off ahead of the new model’s debut"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.965,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.481,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 15 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "A brazen attack on air safety is underway — here’s what’s at stake",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-08-16T08:00:00-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "www.theverge.com"
    ],
    "snippets": [
      "At the end of July, the National Transportation Safety Board (NTSB) convened a three-day public hearing to investigate January's mid-air collision over Washington, DC that killed 67 people. After the hearing, two conclusions were inescapable. First, the disaster should have been prevented by existin"
    ],
    "image_url": "",
    "titles": [
      "A brazen attack on air safety is underway — here’s what’s at stake"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.918,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.479,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 14 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Dead Take’s best scares come from real-life performances",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-08-16T09:00:00-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "www.theverge.com"
    ],
    "snippets": [
      "Dead Take, the second game from Tales of Kenzera: Zau developer Surgent Studios, is a quiet horror game where the monster is ambition and the lengths a person will go for stardom. Like a lot of horror games, Dead Take relies on jumpscares to get the heart pumping. But playing this game, my deepest, "
    ],
    "image_url": "",
    "titles": [
      "Dead Take’s best scares come from real-life performances"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.937,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.476,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 10 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "How a mysterious particle could explain the Universe’s missing antimatter",
    "domain": "technology",
    "source_domain": "arstechnica.com",
    "location": "global",
    "published": "Sat, 16 Aug 2025 11:15:17 +0000",
    "source": "Ars Technica",
    "sources": [
      "Ars Technica"
    ],
    "domains": [
      "arstechnica.com"
    ],
    "snippets": [
      "New experiments focused on understanding the enigmatic neutrino may offer insights."
    ],
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2023/06/cube1CROP-1152x648.jpg",
    "titles": [
      "How a mysterious particle could explain the Universe’s missing antimatter"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.904,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.476,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 11 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "New Studies Predict Unique San Andreas Quakes, Unravel Universe's Shape",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Sat, 16 Aug 2025 08:30:01 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "phys.org"
    ],
    "snippets": [
      "Based on simulations, researchers report that the next big earthquake along the San Andreas fault is unlikely to resemble previous quakes. Researchers at the intersection of algebra, geometry, particle physics and cosmology are making headway in describing the shape of the universe. And common food "
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/saturday-citations-a-n-1.jpg",
    "titles": [
      "Saturday Citations: A new category of supernovas; neurons beat machine learning; depression and vitiligo"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.928,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.474,
    "summary": "Researchers have conducted simulations indicating that future earthquakes along the San Andreas fault may differ significantly from past events. Additionally, experts combining algebra, geometry, particle physics, and cosmology are advancing our understanding of the universe's shape.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 37 tokens",
    "image": {
      "src": "icons/beaker.svg",
      "thumbnail": "icons/beaker.svg",
      "alt": "science",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Bryozoans in Mediterranean Threatened by Acidification and Warming",
    "domain": "science",
    "source_domain": "www.sciencedaily.com",
    "location": "global",
    "published": "Sat, 16 Aug 2025 06:08:48 EDT",
    "source": "ScienceDaily",
    "sources": [
      "ScienceDaily"
    ],
    "domains": [
      "www.sciencedaily.com"
    ],
    "snippets": [
      "Mediterranean bryozoans, including the “false coral,” are showing alarming changes in structure and microbiomes under acidification and warming. Field studies at volcanic CO₂ vents reveal that these stressors combined sharply reduce survival, posing risks to marine ecosystems."
    ],
    "image_url": "",
    "titles": [
      "The ocean’s fragile fortresses are crumbling under climate pressure"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.883,
      "consensus": 0.393,
      "constructiveness": 0.077,
      "proximity": 0.5
    },
    "score": 0.473,
    "summary": "Field studies in the Mediterranean have found that bryozoans, known as \"false coral,\" are experiencing significant changes in structure and microbiomes due to acidification and warming. Research conducted at volcanic CO₂ vents indicates that these environmental stressors drastically lower the survival rates of bryozoans, which could pose serious risks to marine ecosystems.",
    "constructiveness_score": 0.077,
    "constructiveness_reason": "1 constructive keywords out of 52 tokens",
    "image": {
      "src": "icons/beaker.svg",
      "thumbnail": "icons/beaker.svg",
      "alt": "science",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Eco-Friendly Wood Stoves May Emit Harmful Pollutants, Scientists Warn",
    "domain": "science",
    "source_domain": "scitechdaily.com",
    "location": "global",
    "published": "Sat, 16 Aug 2025 09:12:40 +0000",
    "source": "SciTechDaily",
    "sources": [
      "SciTechDaily"
    ],
    "domains": [
      "scitechdaily.com"
    ],
    "snippets": [
      "<a href=\"https://scitechdaily.com/scientists-warn-your-eco-friendly-wood-stove-may-be-releasing-toxic-pollutants/\" rel=\"nofollow\" title=\"Scientists Warn: Your “Eco-Friendly” Wood Stove May Be Releasing Toxic Pollutants\"><img alt=\"Wood Stove\" class=\"webfeedsFeaturedVisual wp-post-image\" height=\"496\" "
    ],
    "image_url": "",
    "titles": [
      "Scientists Warn: Your “Eco-Friendly” Wood Stove May Be Releasing Toxic Pollutants"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.866,
      "consensus": 0.393,
      "constructiveness": 0.108,
      "proximity": 0.5
    },
    "score": 0.472,
    "summary": "Scientists have issued warnings that eco-friendly wood stoves may emit harmful pollutants, contradicting their perceived environmental benefits. Research highlights the potential release of toxic substances from these stoves, challenging their status as a cleaner heating option.",
    "constructiveness_score": 0.108,
    "constructiveness_reason": "1 constructive keywords out of 37 tokens",
    "image": {
      "src": "icons/beaker.svg",
      "thumbnail": "icons/beaker.svg",
      "alt": "science",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Skyrmionic Textures Boost Spintronics and Quantum Tech Advances",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Sat, 16 Aug 2025 07:30:02 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "phys.org"
    ],
    "snippets": [
      "Topological spin textures, spatially organized patterns linked to the intrinsic angular momentum of particles, have proved to be highly advantageous for the development of spintronics and quantum technologies. One of the most studied among these textures are skyrmionic textures, which are two-dimens"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/topological-spin-textu.jpg",
    "titles": [
      "Topological spin textures: Scientists use micro-structured materials to control light propagation"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.908,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.47,
    "summary": "Researchers have discovered that topological spin textures, specifically skyrmionic textures, are highly beneficial for advancing spintronics and quantum technologies. These textures, patterns related to particles' intrinsic angular momentum, are two-dimensional and have been the focus of extensive study for their potential to enhance technology in these fields.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 48 tokens",
    "image": {
      "src": "icons/atom.svg",
      "thumbnail": "icons/atom.svg",
      "alt": "quantum",
      "credit": "Tabler",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Study: Adjusting Walking Style Eases Osteoarthritis Pain, Matches Medication",
    "domain": "science",
    "source_domain": "www.sciencedaily.com",
    "location": "global",
    "published": "Sat, 16 Aug 2025 05:45:52 EDT",
    "source": "ScienceDaily",
    "sources": [
      "ScienceDaily"
    ],
    "domains": [
      "www.sciencedaily.com"
    ],
    "snippets": [
      "A groundbreaking study has found that a simple change in walking style can ease osteoarthritis pain as effectively as medication—without the side effects. By adjusting foot angle, participants reduced knee stress, slowed cartilage damage, and maintained the change for over a year."
    ],
    "image_url": "",
    "titles": [
      "One small walking adjustment could delay knee surgery for years"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.876,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.47,
    "summary": "A study revealed that adjusting the walking style by changing foot angle can significantly alleviate osteoarthritis pain, matching the effectiveness of medication but without adverse effects. Participants experienced reduced knee stress and slower cartilage damage, maintaining these improvements for more than a year.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 43 tokens",
    "image": {
      "src": "icons/beaker.svg",
      "thumbnail": "icons/beaker.svg",
      "alt": "science",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Winklevoss twins’ crypto company Gemini files for IPO",
    "domain": "technology",
    "source_domain": "techcrunch.com",
    "location": "global",
    "published": "Sat, 16 Aug 2025 00:16:43 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com"
    ],
    "snippets": [
      "Another crypto company is headed for the public markets."
    ],
    "image_url": "",
    "titles": [
      "Winklevoss twins’ crypto company Gemini files for IPO"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.719,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.432,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 8 tokens",
    "image": {
      "src": "icons/bitcoin.svg",
      "thumbnail": "icons/bitcoin.svg",
      "alt": "crypto",
      "credit": "Simple Icons",
      "license": "CC0-1.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Laura Loomer and the limits of posting everything",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-08-15T19:36:49-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "www.theverge.com"
    ],
    "snippets": [
      "For all the power she wields with the White House's affairs, Laura Loomer does not have the traditional tools that her rivals in the MAGA influencer industrial complex have - the highest follower count, the most political power, the most internet platforms, etc. But the fact remains that she's the i"
    ],
    "image_url": "",
    "titles": [
      "Laura Loomer and the limits of posting everything"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.709,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.43,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 8 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "SpaceX reveals why the last two Starships failed as another launch draws near",
    "domain": "technology",
    "source_domain": "arstechnica.com",
    "location": "global",
    "published": "Fri, 15 Aug 2025 20:20:24 +0000",
    "source": "Ars Technica",
    "sources": [
      "Ars Technica"
    ],
    "domains": [
      "arstechnica.com"
    ],
    "snippets": [
      "\"SpaceX can now proceed with Starship Flight 10 launch operations under its current license.\""
    ],
    "image_url": "https://cdn.arstechnica.net/wp-content/uploads/2025/08/ship37staticfire-1152x648.jpg",
    "titles": [
      "SpaceX reveals why the last two Starships failed as another launch draws near"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.662,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.428,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 13 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  }
]