[
  {
    "title": "Flotilla to Gaza, Including Greta Thunberg, Intercepted by Israel",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Thu, 02 Oct 2025 16:24:50 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "The Guardian",
      "Al Jazeera",
      "New York Times",
      "Washington Post"
    ],
    "domains": [
      "www.washingtonpost.com",
      "www.nytimes.com",
      "www.theguardian.com",
      "www.aljazeera.com",
      "www.npr.org"
    ],
    "snippets": [
      "As Israel intercepted the aid ships, an airstrike also killed at least one aid worker in Gaza.",
      "Several boats from the Global Sumud Flotilla arrived at Israel’s Ashdod port on Thursday flying Palestinian flags.",
      "<p>Activists from Global Sumud flotilla including Greta Thunberg arrested as final boat is presumed intercepted in Palestinian waters</p><p>Israel says it has stopped a pro-Palestinian flotilla carrying aid from reaching Gaza, with its navy intercepting all but one of the vessels trying to breach th",
      "Israel said its navy intercepted all but one of the boats in the Global Sumud Flotilla, an international convoy that was attempting to break the siege of Gaza.",
      "The boats were part of a flotilla, carrying Greta Thunberg and other activists, that was organized to break Israel’s blockade and protest the war.",
      "The Israeli government said it had detained activists who were trying to take humanitarian aid to the blockaded enclave."
    ],
    "image_url": "",
    "titles": [
      "Israel intercepts aid flotilla headed for Gaza",
      "Intercepted Gaza flotilla boats arrive at Israel’s Ashdod port",
      "Israel stops 41 boats in aid flotilla with one ‘still sailing strong’",
      "Israel intercepts Gaza aid flotilla, detains Thunberg and other activists",
      "Israel Intercepts Boats Headed to Gaza With Humanitarian Aid",
      "Israel Detains Activists After Intercepting Flotilla Headed to Gaza: What to Know"
    ],
    "score_components": {
      "magnitude": 0.964,
      "recency": 0.85,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.831,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The Global Sumud Flotilla, aiming to break Israel's blockade of Gaza and deliver aid, has faced challenges as 13 of its boats were intercepted. The flotilla, which includes activist Greta Thunberg, continues its mission toward the Palestinian enclave despite these setbacks.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Terror Attack at Manchester Synagogue on Yom Kippur Kills Two",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 01:33:57 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "Financial Times",
      "Al Jazeera",
      "Deutsche Welle",
      "New York Times",
      "BBC"
    ],
    "domains": [
      "www.nytimes.com",
      "www.dw.com",
      "www.theguardian.com",
      "www.bbc.com",
      "www.aljazeera.com",
      "www.bbc.co.uk",
      "www.ft.com"
    ],
    "snippets": [
      "Two Jewish people were killed in a car and stabbing attack at Heaton Park Hebrew Congregation Synagogue in Manchester on the holiest day in the Jewish religious calendar.",
      "Keir Starmer says Britain must defeat rising antisemitic hatred.",
      "Residents in UK&#039;s Crumpsall say they are shocked after a car and knife attack near synagogue kills two people.",
      "Authorities in the UK are investigating what they described as a terrorist incident outside a synagogue in Manchester.",
      "UK police have confirmed the identity of a man who was shot by police after attacking a synagogue in Manchester. Three other people have been arrested in connection with what police have called a 'terrorist incident.\"",
      "Police say the perpetrator is a British citizen of Syrian descent after Starmer denounces terrorist incident",
      "<p>Witnesses screamed ‘he’s got a bomb’ and ‘shoot him’ before suspect was killed by armed police</p><p>Worshippers had arrived early for a special morning service at Heaton Park shul in north Manchester. It was Yom Kippur, the holiest day in the Jewish calendar, and rabbi Daniel Walker was leading ",
      "In the hours after an attack, a blanket of fear and grief fell over synagogues and Jewish community centers across the country.",
      "<p>North of England editor Josh Halliday reports from the scene of the attack on Heaton Park Hebrew Congregation synagogue, in which two people were killed and three others seriously injured, in what appears to be the worst antisemitic incident in the UK in living memory</p><p>On Thursday morning at"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/f3c3/live/f10ff160-9fbb-11f0-b741-177e3e2c2fc7.jpg",
    "titles": [
      "What we know about the attack: Worshippers helped stop suspect entering synagogue",
      "Manchester Synagogue Attack: What We Know So Far",
      "Shock and disbelief as Manchester community reels from synagogue attack",
      "What we know about deadly UK synagogue attack",
      "Manchester: 2 killed in synagogue car, knife attack",
      "Two killed in attack at Manchester synagogue",
      "Six minutes of terror: how Manchester synagogue attack unfolded",
      "Manchester Synagogue Attack Fuels Fears of Antisemitism in Britain",
      "The Manchester synagogue terror attack – Today in Focus Extra"
    ],
    "score_components": {
      "magnitude": 0.986,
      "recency": 0.926,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.83,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A terrorist attack occurred outside the Heaton Park Hebrew Congregation synagogue in Manchester, England, on Yom Kippur, Judaism's holiest day. A man rammed a car into pedestrians and stabbed others, resulting in two fatalities and several serious injuries. The attacker was shot dead by police within minutes. Prime Minister Keir Starmer described the incident as \"appalling\" and left a European summit in Copenhagen early in response. UK authorities have increased security at Jewish sites following the attack. Two additional suspects were arrested in connection with the incident.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Red Wings Beat Maple Leafs 3-1 in Pre-Season Game",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Fri, 03 Oct 2025 01:54:35 +0000",
    "source": "Global News",
    "sources": [
      "NHL",
      "Global News",
      "Sportsnet"
    ],
    "domains": [
      "globalnews.ca",
      "news.google.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Anthony Stolarz was stellar with 40 saves, Auston Matthews opened the scoring with a power-play goal but it wasn't enough as the Toronto Maple Leafs gave up three third-period goals to fall 3-1 to the Detroit Red Wings in pre-season action on Thursday.",
      "<a href=\"https://news.google.com/rss/articles/CBMiggFBVV95cUxNMWRndGlzT3VzTzd2eFk2WG54SVprWWZXUXZjRmdCRDFQTFJsZTVGZTludmRjbTlSUGNaWWN4cHpNeVNQc0U2TGFNWkhyY3pVdzZ6YXdrNmd4eWUzT21QME9TLXl3c0RmTTNnMUZNWnNrcmc0ZVlueXNEMGp3ZUZfTnlR?oc=5\" target=\"_blank\">Red Wings trim preseason roster to 28</a>&nbsp;&nbs",
      "<p>Alex DeBrincat and Dylan Larkin each scored, Cam Talbot made 18 saves on the night, and the Detroit Red Wings took a 3-1 win over the Toronto Maple Leafs in pre-season action.</p>"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/10/0334b4bda60ce972e9f645b336a1a4fcbd1c00237f5c0ce9794795d63cae6908.jpg?quality=65&strip=all",
    "titles": [
      "Leafs fall 3-1 to Red Wings in pre-season action",
      "Red Wings trim preseason roster to 28 - NHL.com",
      "NHL Pre-Season Highlights: Red Wings 3, Maple Leafs 1"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.953,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.777,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Anthony Stolarz made 40 saves and Auston Matthews scored a power-play goal, but the Toronto Maple Leafs lost 3-1 to the Detroit Red Wings in a pre-season game. The Red Wings scored three goals in the third period, with Alex DeBrincat and Dylan Larkin among the scorers. Cam Talbot contributed with 18 saves for Detroit.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "FDA Approves Low-Cost Generic Abortion Pill Amid Mixed Reactions",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Thu, 02 Oct 2025 23:45:38 -0400",
    "source": "NPR",
    "sources": [
      "NPR",
      "Axios",
      "The Guardian"
    ],
    "domains": [
      "news.google.com",
      "www.npr.org",
      "www.theguardian.com"
    ],
    "snippets": [
      "Drugmaker Evita Solutions announced on its website that the Food and Drug Administration signed off on its low-cost form of the pill, which is approved to end pregnancies through 10 weeks.",
      "<a href=\"https://news.google.com/rss/articles/CBMigwFBVV95cUxPUTNLODBzOTJZNnpQRjJSV2wyY3BObGs2dXdfYmdyZFQtYjNSVDByanJCLWNDMkRabTJDUFdMWTc5WlVlS1Utc3MzUFBKNFZvS3BkZklLVGNrOHNiN1VseGFkRENyUU5RUWxLdXdOazlNZmZ1R3JkZjZKNWwtTTZ1VWRfYw?oc=5\" target=\"_blank\">Conservatives rage after FDA approves generic abo",
      "<p>Abortion rights supporters hail win for evidence-backed medicine as Evita Solutions’ generic version of mifepristone given approval</p><p>In a move that has left anti-abortion advocates reeling, the US Food and Drug Administration (FDA) quietly approved a request to manufacture a new abortion pil"
    ],
    "image_url": "",
    "titles": [
      "FDA approves another generic abortion pill, prompting outrage from conservatives",
      "Conservatives rage after FDA approves generic abortion drug - Axios",
      "Anti-abortion groups furious as FDA approves generic abortion pill"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.99,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.77,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The FDA approved Evita Solutions' low-cost generic version of mifepristone, a pill approved to end pregnancies through 10 weeks. This decision was celebrated by abortion rights supporters as a victory for evidence-based medicine, while drawing criticism from conservatives.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: solution",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Yankees Beat Red Sox 2-1, Advance to ALDS Against Blue Jays",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Thu, 2 Oct 2025 23:40:39 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Global News",
      "Sportsnet"
    ],
    "domains": [
      "globalnews.ca",
      "www.espn.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "The entire LDS field is set! Here's how every showdown stacks up.",
      "The New York Yankees will face the Toronto Blue Jays in an American League Division Series after dispatching the archrival Boston Red Sox in a Wild Card Series.",
      "The New York Yankees will face the Toronto Blue Jays in an American League Division Series after defeating the archrival Boston Red Sox 4-0 to win their wild-card series 2-1.",
      "<p>Arden Zwelling joins Evanka Osmak and Ken Reid to set up the Blue Jays&#8217; ALDS matchup against the Yankees, who we should expect to start Game 1 for both teams, New York&#8217;s improved defence, who gets left off Toronto&#8217;s ALDS roster, and more.</p>"
    ],
    "image_url": "",
    "titles": [
      "Yankees or Blue Jays? Cubs or Brewers? First look at every division series matchup",
      "Blue Jays to face division rival Yankees in ALDS",
      "NewsAlert: Blue Jays to face Yankees in ALDS",
      "Breaking down top storylines ahead of Blue Jays vs. Yankees ALDS tilt"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.989,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.766,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The New York Yankees advanced to the American League Division Series (ALDS) to face the Toronto Blue Jays after winning their wild-card series against the Boston Red Sox 2-1, with a final game score of 4-0. Discussions are ongoing about game strategies, including starting pitchers for Game 1, the Yankees' defense improvements, and roster decisions for the Blue Jays.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "US President, Budget Director Discuss Shutdown on Day 2 Amid Firing Warnings",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Thu, 02 Oct 2025 16:58:02 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Financial Times",
      "ABC News",
      "Axios"
    ],
    "domains": [
      "www.aljazeera.com",
      "abcnews.go.com",
      "news.google.com",
      "www.ft.com"
    ],
    "snippets": [
      "The US presidents meets with the White House budget director as the shutdown continues into a second day, amid impasse.",
      "<a href=\"https://news.google.com/rss/articles/CBMifkFVX3lxTE9PYjBKVmVrX1NqVnhsbTZhRk1mVldpSllvQldrQksyOEdkUC1yRm5UdWtwMkRfRV9xRDRxbVBKVS1QdFI2MnJxaFVMOUczN0kxQnkzVlFiS1FmQWgwcWRkU1lzVHptUmVvRWgtV2xvR0tZSzJrLW9xaUNpaDZwQQ?oc=5\" target=\"_blank\">\"Keep fighting\": Democratic lawmakers squeezed on governm",
      "<a href=\"https://news.google.com/rss/articles/CBMikwFBVV95cUxPYTh3VTFKSEYxa3hFRVpxN2xuang0cHJGNHVmSkVfaWtKU3F5Y2MtUFVGWndNRGN1d2o4VzdmVFBQTjd5azNYRU1fV2dIeTNKNWp1MWVRWjZleVB4cWFNdWNuamg4U3VpLXlsd253ZERBT2p3R19fNlR0SHducTFCcElKalFOcUtrZDExY3pyZkplSkk?oc=5\" target=\"_blank\">Trump admin uses government ",
      "The White House also said the prospect of mass firings of federal workers was \"very real.\"",
      "Democrats accuse White House of using closure as cover for project to shrink government"
    ],
    "image_url": "",
    "titles": [
      "Trump threatens to cut ‘Democratic agencies’ amid government shutdown",
      "\"Keep fighting\": Democratic lawmakers squeezed on government shutdown - Axios",
      "Trump admin uses government sites to blame Democrats for shutdown - Axios",
      "Trump openly threatens to use shutdown to target Democrats for cuts",
      "Trump threatens permanent spending cuts as US shutdown continues"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.791,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.754,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "The US President met with the White House budget director as the government shutdown entered its second day due to a stalemate. During this period, the White House warned of a \"very real\" risk of mass firings among federal workers. Democrats have accused the administration of using the shutdown as an opportunity to reduce the size of the government.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Munich Airport Halts Flights Amid Drone Sightings, Affects Oktoberfest",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-10-03T02:36:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "New York Times",
      "Deutsche Welle",
      "The Guardian"
    ],
    "domains": [
      "www.dw.com",
      "www.theguardian.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "The disruption comes as Munich hosts its world-famous Oktoberfest beer festival, which runs until Sunday. Last week, Denmark and Norway closed airports due to drones.",
      "<p>The German airport was forced to suspend operations, in the latest drone disruption to European aviation</p><p>Drone sightings over Munich airport on Thursday evening forced air traffic control to suspend operations, leading to the cancellation of 17 flights and disrupting travel for nearly 3,000",
      "The airport in Germany was the latest in Europe to shut because of drone sightings that officials have blamed on Russia, which has denied the accusations."
    ],
    "image_url": "",
    "titles": [
      "Germany: Drone sightings disrupt Munich airport",
      "Munich drone sightings force airport to cancel flights in latest Europe disruption",
      "Flights Halted at Munich Airport After Drone Sightings"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.967,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.737,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Munich airport suspended operations due to drone sightings on Thursday evening, affecting the Oktoberfest beer festival. This led to 17 flight cancellations and disrupted nearly 3,000 travelers. This incident is part of a series of drone disruptions in European aviation, with officials blaming Russia, which has denied the accusations.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Administration Cancels 300+ Clean Energy Awards, Targets Democrat States",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Fri, 03 Oct 2025 00:38:47 GMT",
    "source": "CNBC",
    "sources": [
      "New York Times",
      "CNBC",
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com",
      "www.nytimes.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "The Energy Department's cancellations of projects directly affected 16 states won by Kamala Harris in the 2024 presidential election.",
      "The cuts largely affect Democratic-led states as the two parties fight over the shutdown of the federal government.",
      "The Trump administration canceled over 300 awards related to clean energy on October 1. The states most affected by the cuts voted for Democrat presidential candidate Kamala Harris."
    ],
    "image_url": "",
    "titles": [
      "Shutdown fallout: Energy Dept. axes billions for green projects in blue states",
      "Energy Dept. Cancels $7.5 Billion for Hundreds of Projects, Mostly in Blue States",
      "Department of Energy cancels $7.5B of clean energy projects in mostly blue states"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.909,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.736,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "On October 1, the Trump administration canceled more than 300 clean energy awards, predominantly impacting Democratic-led states. This action comes amid a broader political conflict between the two parties regarding the federal government shutdown. The states most affected by these cancellations had supported Democratic presidential candidate Kamala Harris.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Admin Claims \"Armed Conflict\" Justifies Strikes on Venezuelan Drug Boats",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Thu, 02 Oct 2025 21:05:49 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "The Guardian",
      "Washington Post"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.washingtonpost.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Memo reported by US media shows Trump justification for strikes on alleged drug smugglers experts say likely illegal.",
      "<p>Administration attempts to justify strikes on alleged Venezuelan drug boats by claiming US under ‘armed attack’</p><p>The Trump administration is trying to justify strikes on alleged Venezuelan drug boats by advancing a novel legal theory that the US is now in a “non-international armed conflict”",
      "President Donald Trump has determined the U.S. is in “armed conflict” with drug cartels who are distributing narcotics, according to a notification to Congress."
    ],
    "image_url": "",
    "titles": [
      "Trump memo says US in ‘non-international armed conflict’ with cartels",
      "Trump officials push claim that US in ‘armed conflict’ with drug cartels",
      "U.S. in ‘armed conflict’ with drug cartels, Trump tells Congress"
    ],
    "score_components": {
      "magnitude": 0.887,
      "recency": 0.862,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.73,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Trump administration has attempted to justify strikes on alleged Venezuelan drug boats by claiming the U.S. is in a \"non-international armed conflict\" with drug cartels, based on a novel legal theory. This justification, aimed at allowing military action against narcotics distributors, has been reported by US media and critiqued by experts as likely illegal. President Trump has notified Congress of this determination, framing it as a response to an \"armed attack\" by drug cartels on the United States.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Apple Pulls ICEBlock App Over Safety Concerns, Following DOJ Demands",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Fri, 03 Oct 2025 02:08:00 GMT",
    "source": "Axios",
    "sources": [
      "Business Insider",
      "CNBC",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "www.cnbc.com",
      "www.businessinsider.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMib0FVX3lxTE9Eb3BJYnU3dk5GR1lkQjdRaGNTR0Jub3lkeXloUFJrUVdqU2VGNU84RHFBQVRhVlIxZ29BOW1CMS1uNjRrOUV0QzItNnp4OEZCU3h5NXRBQlhFNGFBQUZocVo0b29zN2FVQU91S1FSdw?oc=5\" target=\"_blank\">Apple drops ICE tracking apps from its store after Trump DOJ demand</a>&nbsp;",
      "Joshua Aaron has said he created ICEBlock after seeing the Trump administration's deportation efforts, which he said evoked events in Nazi Germany.",
      "Apple on Thursday removed the immigration enforcement tracking app, ICEBlock, from the App Store, citing \"safety risks.\""
    ],
    "image_url": "",
    "titles": [
      "Apple drops ICE tracking apps from its store after Trump DOJ demand - Axios",
      "Apple removes ICE tracking apps after Trump AG pressure",
      "Apple removes ICEBlock app from App Store"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.937,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.724,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Apple removed the ICEBlock app, designed to track immigration enforcement activities, from its App Store, citing safety concerns. This action follows demands from the Trump-era Department of Justice. The app's creator, Joshua Aaron, developed ICEBlock in response to the Trump administration's deportation policies, which he compared to events in Nazi Germany.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Newsom Warns CA Universities Against Trump's Funding Compact",
    "domain": "business",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Thu, 02 Oct 2025 22:21:23 GMT",
    "source": "The Guardian",
    "sources": [
      "LA Times",
      "The Guardian",
      "Forbes"
    ],
    "domains": [
      "www.theguardian.com",
      "www.forbes.com",
      "www.latimes.com"
    ],
    "snippets": [
      "<p>Governor Gavin Newsom urges schools not to sign ‘radical agreement’ to cuts to departments, students and speech</p><p>Any California universities that sign the Trump administration’s proposed “Compact for Academic Excellence in Higher Education” will “instantly” lose their state funding, Californ",
      "<p>The White House asked nine major universities, including USC, to commit to President Trump's political priorities in exchange for more favorable access to federal money. Gov. Gavin Newsom said California colleges that comply will have state funding taken away.</p>",
      "Newsom’s threat comes as the Trump administration has threatened to pull funding from several universities across the U.S. if they do not agree to make changes aligned with the president’s agenda."
    ],
    "image_url": "https://i.guim.co.uk/img/media/979e317e5490bb651f3ae6c4e0894bae953927b0/147_0_4297_3438/master/4297.jpg?width=140&quality=85&auto=format&fit=max&s=437a1296eceadc1b81e241ecdeea0392",
    "titles": [
      "California vows to ‘instantly’ cut funding to universities that cave to Trump ‘compact’",
      "Newsom threatens to cut state funding to universities that sign Trump's political compact",
      "Newsom Says California Will Cut Funds For ‘Sell-Out Universities’ Complying With Trump Education Crackdown"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.867,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.724,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Governor Gavin Newsom warned California universities against signing the Trump administration's \"Compact for Academic Excellence in Higher Education,\" which ties federal funding to the commitment to the President's political priorities. Newsom stated that any university agreeing to this would immediately lose state funding. This directive particularly targets nine major universities, including USC, emphasizing the administration's attempt to align higher education with specific political goals.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Terror Attack at Manchester Synagogue on Yom Kippur Kills Two",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 00:49:03 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "The Guardian",
      "Washington Post"
    ],
    "domains": [
      "www.theguardian.com",
      "www.washingtonpost.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Jihad Al-Shamie, a 35-year-old British man of Syrian descent, is named as the synagogue attacker.",
      "<p>Police say Jihad Al-Shamie, a British citizen of Syrian descent, was behind car and knife attack that left three people seriously injured</p><p>Police have shot dead a terrorist who killed two people and seriously injured three others in an attack at a synagogue in Manchester on Yom Kippur, the h",
      "Officers fatally shot a man who had rammed a car into some people and stabbed others outside the Heaton Park Hebrew Congregation, police said."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/3d24/live/ee9ed3b0-9fa2-11f0-92db-77261a15b9d2.jpg",
    "titles": [
      "Police name Manchester attacker who killed two at synagogue",
      "Manchester attack: two killed and three injured after terrorist drives into grounds of synagogue and stabs worshippers",
      "Two killed in attack at synagogue on Yom Kippur in England"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.912,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.719,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A terrorist attack occurred outside the Heaton Park Hebrew Congregation synagogue in Manchester, England, on Yom Kippur, Judaism's holiest day. A man rammed a car into pedestrians and stabbed others, resulting in two fatalities and several serious injuries. The attacker was shot dead by police within minutes. Prime Minister Keir Starmer described the incident as \"appalling\" and left a European summit in Copenhagen early in response. UK authorities have increased security at Jewish sites following the attack. Two additional suspects were arrested in connection with the incident.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump to Discuss Agency Cuts with Budget Director Vought",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Thu, 02 Oct 2025 13:49:17 GMT",
    "source": "Axios",
    "sources": [
      "CNBC",
      "Axios",
      "The Guardian"
    ],
    "domains": [
      "news.google.com",
      "www.cnbc.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMihgFBVV95cUxQLURNREVuNHRwS0tzX2ZsSzZjOE1TN2FjR2MyMzBZUkEwRHhrVFBkRlJhM0lTalNPa3R4dHk4eGY0cEZqN3ZGYzlxOE9GWHNIQW00cXFfQVJFT0ZQNmVWemx2M0RscXN0cHpxNUxvQmI2eEhFQm5tT0hVYnpOVGlQS29HRmtUZw?oc=5\" target=\"_blank\">\"Unprecedented opportunity\": Trump, Vought to",
      "Trump in a Truth Social post said he will meet with Office of Management and Budget Director Russell Vought to discuss cutting agencies.",
      "<p>Republicans and Democrats engage in war of words as White House also uses impasse to cut government spending</p><p>As the <a href=\"https://www.theguardian.com/us-news/us-federal-government-shutdown-2025\">US government shutdown</a> stretched into its second day, <a href=\"https://www.theguardian.co"
    ],
    "image_url": "",
    "titles": [
      "\"Unprecedented opportunity\": Trump, Vought to decide which \"Democrat\" agencies to cut - Axios",
      "Trump touts shutdown as 'unprecedented opportunity' to cut more Democratic priorities",
      "Trump sees ‘unprecedented opportunity’ to punish Democrats as shutdown enters day two"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.725,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.699,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Former President Trump announced on Truth Social that he plans to meet with Office of Management and Budget Director Russell Vought to discuss reducing government agencies. The outcome of the meeting and any subsequent actions are yet to be determined.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Tesla Hikes Lease Prices Amid Record Q3 Deliveries, Tax Credit Expiry",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Thu, 02 Oct 2025 16:32:59 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "CNBC",
      "Axios"
    ],
    "domains": [
      "www.cnbc.com",
      "www.aljazeera.com",
      "news.google.com"
    ],
    "snippets": [
      "Analysts expect sales by the electric automaker to slump in the months ahead.",
      "<a href=\"https://news.google.com/rss/articles/CBMib0FVX3lxTE1kanBtZU5jREtadjBQYm1GUG9PZG9JOUFiVkhDM2N5Tk9yOURCOTgtYlRaektiU05Gc0t4TUtpZklaWWlhUHJRVEFZc2RTRGZiZzlaNktmaVAxVTFXWFhycmVwZGpHaS1SRl9IcHZvYw?oc=5\" target=\"_blank\">Tesla hikes lease prices as EV tax credit expires</a>&nbsp;&nbsp;<font color=",
      "Tesla's third-quarter deliveries got a boost as some consumers rush to buy electric vehicles before a federal tax credit expired."
    ],
    "image_url": "",
    "titles": [
      "Tesla sales jump as buyers scramble before EV tax credit expires",
      "Tesla hikes lease prices as EV tax credit expires - Axios",
      "Tesla deliveries rise 7% before EV tax credits expire"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.784,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.694,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Tesla increased its lease prices following a surge in third-quarter deliveries, with 497,000 vehicles delivered as consumers rushed to purchase electric vehicles before the expiration of a $7,500 federal tax credit on September 30. This expiration motivated buyers and contributed to Tesla's sales growth.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Schlittler Sets Yankees Record, Strikes Out 12 in Win Over Red Sox",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Thu, 2 Oct 2025 23:23:43 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "Rookie right-hander Cam Schlittler struck out 12 as he shut down Boston with 100 mph heat, and the Yankees took advantage of a pair of misplays in a four-run fourth inning to beat the Red Sox 4-0 on Thursday.",
      "<p>Watch as New York Yankees rookie Cam Schlittler records his 11th strikeout in his post-season debut, the most in franchise history.</p>",
      "<p>At just 24 years old, Cam Schlittler is already etching his name in MLB history books.</p>"
    ],
    "image_url": "",
    "titles": [
      "Schlittler dazzles as Yankees eliminate Red Sox",
      "Schlittler punches out Abreu to set new Yankees record",
      "Yankees’ Cam Schlittler makes MLB history in start vs. Red Sox"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.983,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.684,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Rookie right-hander Cam Schlittler led the New York Yankees to a 4-0 victory over the Boston Red Sox, striking out 12 with his 100 mph pitches. During the game, the Yankees capitalized on two misplays by the Red Sox in the fourth inning. In his postseason debut, Schlittler set a franchise record with 11 strikeouts, marking a significant milestone in his career at just 24 years old.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Cubs Beat Padres 3-1, Advance to NL Division Series Against Brewers",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Thu, 2 Oct 2025 23:23:43 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "The Cubs held off a ninth-inning rally by the Padres for a clinching 3-1 victory Thursday night that sends them to the NL Division Series against the Brewers.",
      "<p>The Chicago Cubs downed the San Diego Padres in Game 3 of the wild-card round on Thursday to advance in the MLB playoffs, setting up a best-of-five against the Milwaukee Brewers.</p>"
    ],
    "image_url": "",
    "titles": [
      "Cubs quash Padres' threat in 9th to make NLDS",
      "Cubs down Padres in Game 3 to reach NLDS vs. Brewers"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.983,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.684,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Chicago Cubs defeated the San Diego Padres 3-1 on Thursday night, overcoming a ninth-inning rally to advance to the NL Division Series. They will face the Milwaukee Brewers in a best-of-five series.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Nevada Supreme Court Rules Against NFL in Jon Gruden Case",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Thu, 2 Oct 2025 23:23:43 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Thursday's unanimous ruling by the Nevada Supreme Court means the last option for the NFL is to appeal to the U.S. Supreme Court, which sources told ESPN is likely.",
      "Gruden sued the NFL and Roger Goodell in November 2021"
    ],
    "image_url": "",
    "titles": [
      "Nev. court rejects NFL plea for Gruden rehearing",
      "Jon Gruden vs. NFL lawsuit: Nevada Supreme Court rejects league's petition in latest legal win for ex-coach"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.983,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.684,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Nevada Supreme Court ruled unanimously on Thursday against the NFL in a case involving Jon Gruden, who sued the NFL and Commissioner Roger Goodell in November 2021. This decision leaves the NFL with the option to appeal to the U.S. Supreme Court, a step sources told ESPN is likely.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Broberg Leads Blues to 7-1 Pre-Season Victory Over Senators",
    "domain": "sports",
    "source_domain": "www.sportsnet.ca",
    "location": "national",
    "published": "Thu, 02 Oct 2025 23:22:42 EDT",
    "source": "Sportsnet",
    "sources": [
      "Ottawa Citizen",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "ottawacitizen.com"
    ],
    "snippets": [
      "<p>Philip Broberg had two goals and one assist, Robert Thomas added a goal and two assists and the St. Louis Blues hammered the Ottawa Senators 7-1.</p>",
      "The Ottawa Senators have six days to get their act together. The good news for the Senators is that the results of pre-season games are meaningless, but they were no match for the St. Louis Blues in a 7-1 loss on Thursday night at the Enterprise Center. Coming off a 5-0 loss to the Montreal [&#8230;"
    ],
    "image_url": "https://www.sportsnet.ca/wp-content/uploads/2025/10/Zetterlund.jpg",
    "titles": [
      "Zetterlund scores Senators’ lone goal in rough pre-season loss to Blues",
      "Takeaways: Ottawa Senators pre-season struggles continue with loss to the St. Louis Blues"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.982,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.658,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Philip Broberg led the St. Louis Blues with two goals and one assist in a dominant 7-1 victory over the Ottawa Senators. Robert Thomas also contributed significantly with a goal and two assists. The match took place at the Enterprise Center, marking another significant loss for the Senators following a 5-0 defeat to Montreal. Despite the pre-season context, indicating the results do not count towards regular season standings, the Senators face a critical period of reassessment before their next game.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Gateway Church Founder Admits to 1980s Sexual Abuse of Minor",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 03:09:37 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "New York Times"
    ],
    "domains": [
      "www.nytimes.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Robert Morris, who founded one of the largest megachurches, sexually abused a  12-year-old girl.",
      "Robert Morris, the founder of Gateway Church, which has one of the nation’s largest congregations, admitted to sexually abusing a child in the 1980s."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/066e/live/e58e7fc0-a004-11f0-8b2d-71b866b24f78.jpg",
    "titles": [
      "Texas megachurch pastor pleads guilty to child abuse",
      "Texas Megachurch Pastor Pleads Guilty to Child Sex Abuse"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.958,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.647,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Robert Morris, founder of Gateway Church, a major US megachurch, admitted to sexually abusing a 12-year-old girl in the 1980s. This admission has brought significant attention to his actions and the church.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Diddy Claims Transformation Ahead of Sentencing, Faces 11 Years",
    "domain": "general",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 00:35:29 GMT",
    "source": "The Guardian",
    "sources": [
      "CityNews",
      "The Guardian"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "www.theguardian.com"
    ],
    "snippets": [
      "<p>Music mogul, facing up to 11 years in prison, says he is a new man and ‘I no longer care about the money or the fame’</p><p>Facing up to 11 years in prison at his sentencing on Friday, <a href=\"https://www.theguardian.com/music/diddy\">Sean “Diddy” Combs</a> told a federal judge that he has experi",
      "NEW YORK (AP) — On the eve of his sentencing, Sean “Diddy” Combs wrote a federal judge Thursday proclaiming himself to be a new man after realizing that he was “broken to my core.&#8221; Combs, 55, told Judge Arun Subramanian that with his mind clear of drugs and alcohol after a year in jail, he [&#"
    ],
    "image_url": "https://i.guim.co.uk/img/media/d4c96da37ed4c2b19515c1239174b30bfeee9cc1/227_222_2769_2217/master/2769.jpg?width=140&quality=85&auto=format&fit=max&s=2b84f5194a36d4ccda0dd93dc633ba83",
    "titles": [
      "Combs pleads with judge in letter before sentencing, saying he was ‘reborn’ in jail",
      "On eve of sentencing, Combs tells judge he has been ‘reborn,’ asks for mercy"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.908,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.644,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Sean \"Diddy\" Combs, facing up to 11 years in prison, declared to a judge that he has changed, emphasizing his lack of interest in money or fame. On the eve of his sentencing, Combs, 55, stated he had become a new man after a year in jail, now free from drugs and alcohol. He expressed this transformation in a letter to Judge Arun Subramanian.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "SportsLine's Hartstein Predicts Week 5 NFL Game: SF vs. LA Rams",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Thu, 02 Oct 2025 23:33:34 +0000",
    "source": "CBS Sports",
    "sources": [
      "Yahoo Sports",
      "CBS Sports"
    ],
    "domains": [
      "www.nbcsports.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "SportsLine expert Larry Hartstein has revealed his picks for San Francisco vs. Los Angeles Rams in the Week 5 NFL matchup from SoFi Stadium in Inglewood, Calif.",
      "The 49ers are beat up."
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/23/fd65de5b-f5be-49e3-8ae7-25a62954e94c/template-pic.jpg",
    "titles": [
      "Thursday Night Football prediction, odds, spread, bets, line: Rams vs. 49ers picks from expert on 25-10 roll",
      "Thursday Night Football: Mac Jones, 49ers outlast Rams in OT, winning 26-23"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.907,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.636,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Larry Hartstein, a SportsLine expert, has made his predictions for the Week 5 NFL game between San Francisco and the Los Angeles Rams at SoFi Stadium in Inglewood, California. The outcome of his picks has not been disclosed in the information provided.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "SportsLine Predicts Yankees-Red Sox Wild Card Winner; Padres-Cubs Battle for NLD",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Thu, 02 Oct 2025 22:10:52 +0000",
    "source": "CBS Sports",
    "sources": [
      "Yahoo Sports",
      "CBS Sports"
    ],
    "domains": [
      "www.timesunion.com",
      "www.pinstripealley.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "SportsLine's model simulated Boston vs. New York 10,000 times and revealed its MLB picks for Thursday's American League Wild Card Game 3 matchup at Yankee Stadium in New York",
      "Major League Baseball's top rivals met 13 times during the regular season, with the Red Sox winning nine of those games",
      "The rookie authored the greatest postseason debut for a pitcher in Yankee history to lead them past the Red Sox."
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/30/502b0cbc-3743-45bd-9e2c-c0b7653b2b1e/aaron-judge-new-york-yankees-imagn-images-8.jpg",
    "titles": [
      "Red Sox vs. Yankees prediction, odds, time: 2025 MLB picks, best bets for AL Wild Card Game 3 by top model",
      "Yankees shutout Red Sox in Game 3 to win Wild Card Series",
      "Yankees beat Red Sox, win Wild Card Series behind rookie Cam Schlittler’s masterpiece"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.882,
      "consensus": 0.611,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.636,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "SportsLine simulated the Boston vs. New York MLB American League Wild Card Game 3 at Yankee Stadium 10,000 times, providing predictions for the outcome. Meanwhile, rookies will face off in this crucial winner-take-all game. Concurrently, the Padres and Cubs are set to determine who advances to the NLDS in Game 3, available on Sportsnet 360 or Sportsnet+ at 5 p.m. ET. The Yankees and Red Sox also vie for a spot in the ALDS, with their game being broadcast on Sportsnet, accompanied by a live tracker.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Yom Kippur Attack by British Man of Syrian Descent Leaves 2 Dead, 3 Injured",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 03 Oct 2025 00:14:58 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "New York Times"
    ],
    "domains": [
      "www.nytimes.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Two killed and four remain in hospital after a man, shot dead by police, carried out the attack.",
      "The counterterrorism police named the assailant as Jihad al-Shamie, 35, a British citizen of Syrian descent. He was shot dead by the police after killing two people and injuring three others in an attack on Yom Kippur."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/0502/live/6c036900-9fc2-11f0-b73e-e715acbd6a10.jpg",
    "titles": [
      "Heroes stopped attacker getting inside synagogue",
      "Attacker at British Synagogue Is Identified"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.901,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.635,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A man named Jihad al-Shamie, 35, of Syrian descent and a British citizen, attacked people on Yom Kippur, resulting in two deaths and three injuries. He was subsequently shot dead by police. Four individuals are hospitalized following the incident, which is now under investigation by counterterrorism authorities.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Food Report Update Faces Misinformation by Pro-Meat Groups",
    "domain": "business",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-10-02T22:33:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Financial Times",
      "Deutsche Welle"
    ],
    "domains": [
      "www.dw.com",
      "www.ft.com"
    ],
    "snippets": [
      "A major scientific update to one of the most influential food and planetary health reports of the last decade is in the crosshairs of a pro-meat misinformation campaign.",
      "Emergency investment in the technology does not amount to a long-term defence strategy"
    ],
    "image_url": "",
    "titles": [
      "Online attacks threaten major climate-friendly diet report",
      "Drone attacks threaten us all"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.888,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.633,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "A significant update to a key report on food and planetary health faces a misinformation campaign by pro-meat advocates. Despite emergency funding in technology, experts argue it's not a sustainable long-term defense strategy.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]