[
  {
    "title": "Economic Data Release at Risk Amid Congressional Spending Deadlock",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 30 Sep 2025 16:11:40 GMT",
    "source": "BBC",
    "sources": [
      "Al Jazeera",
      "BBC",
      "Financial Times",
      "ABC News",
      "Global News",
      "Deutsche Welle"
    ],
    "domains": [
      "www.bbc.com",
      "www.aljazeera.com",
      "globalnews.ca",
      "www.dw.com",
      "abcnews.go.com",
      "www.ft.com"
    ],
    "snippets": [
      "Funding will be cut off unless Republicans and Democrats can agree a way forward on a spending bill.",
      "A US government shutdown could result in layoffs of federal workers.",
      "The US could see its first government shutdown in almost seven years as both parties stand firm on their demands.",
      "The United States is facing yet another government shutdown. What happens and who is impacted when the government can't pay its bills? And could the Trump administration use it as an excuse for more layoffs?",
      "A potential shutdown of the U.S. government looms at midnight, as President Donald Trump and members of congress work toward a deal to avert it.",
      "Key economic data will be delayed if lawmakers fail to break funding deadlock",
      "Employee furloughs and potential layoffs would halt some government activities if the U.S. government shuts down by midnight Tuesday."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/5096/live/f6627200-9d40-11f0-973f-51ea2fc41b54.jpg",
    "titles": [
      "Why the US government might shut down and when it might happen",
      "Why is the US government on the brink of a shutdown? What will it mean?",
      "US government shutdown looms amid 'large differences'",
      "What does a US government shutdown actually mean?",
      "The US government may shut down at midnight. Here's what to know",
      "What happens if the US government shuts down?",
      "What U.S. services could be hit by a government shutdown?"
    ],
    "score_components": {
      "magnitude": 0.986,
      "recency": 0.9,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.825,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Funding for key economic data is at risk as Republicans and Democrats struggle to agree on a spending bill. If no resolution is reached, the release of crucial economic information could be delayed.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Spotify Founder Daniel Ek to Step Down as CEO, Become Chairman",
    "domain": "business",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Tue, 30 Sep 2025 12:33:07 -0400",
    "source": "NPR",
    "sources": [
      "CNBC",
      "The Guardian",
      "Axios",
      "NPR"
    ],
    "domains": [
      "news.google.com",
      "www.cnbc.com",
      "www.npr.org",
      "www.theguardian.com"
    ],
    "snippets": [
      "The founder of the world's biggest music streaming service says he'll remain at the company as Executive Chairman, and will be replaced by two co-CEOs.",
      "<a href=\"https://news.google.com/rss/articles/CBMiZEFVX3lxTE1nU1BWaUxwR3V2VklMRkd3M1RTdGZMdVhROUtZVXRIOEJYbm9ZVGRWdW9KRWNueEw0ODRIQlNOLWxHc2dxMm9JOUFsS25faGdKMzVYa1J2WDN5Q1NxUVktMFh6cUk?oc=5\" target=\"_blank\">Spotify CEO Daniel Ek to step aside</a>&nbsp;&nbsp;<font color=\"#6f6f6f\">Axios</font>",
      "Spotify's CEO Daniel Ek is set to step down in January next year and move to the role of Executive Chairman, the company said on Tuesday.",
      "<p>Ek founded Stockholm-based music streaming company nearly two decades ago and will stay on as executive chair</p><p><a href=\"https://www.theguardian.com/technology/spotify\">Spotify</a> said Tuesday that founder Daniel Ek is stepping down as CEO to become the executive chair.</p><p>The Stockholm-b"
    ],
    "image_url": "",
    "titles": [
      "Spotify's Daniel Ek announces that he'll step aside as CEO",
      "Spotify CEO Daniel Ek to step aside - Axios",
      "Spotify founder Daniel Ek stepping down as CEO, company names co-CEOs to replace him",
      "Spotify founder Daniel Ek steps down from CEO role"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.926,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.806,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Daniel Ek, founder of Spotify, will step down as CEO in January to become Executive Chairman. Spotify, which achieved its first full-year profitability last year, will appoint Gustav Söderström and Alex Norström as co-CEOs. Ek founded the Stockholm-based music streaming company nearly two decades ago.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Scientists Develop Technique to Create Eggs from Skin Cells for Infertility Trea",
    "domain": "science",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Tue, 30 Sep 2025 11:01:00 -0400",
    "source": "NPR",
    "sources": [
      "Wired",
      "BBC",
      "New Scientist",
      "NPR"
    ],
    "domains": [
      "www.newscientist.com",
      "www.npr.org",
      "www.wired.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Scientists created the eggs using DNA from adult skin cells, a step that could someday potentially lead to new ways to treat infertility and enable gay couples to have genetically related children.",
      "US scientists testing the technique say it could help people overcome infertility and potentially allow same-sex couples to have a genetically related child.",
      "An innovative use of skin cells could provide a route for gay couples or women with fertility problems to have children they are both genetically related to",
      "The embryos weren’t used to try to establish a pregnancy, but the researchers behind the technique say it could one day be used to address infertility."
    ],
    "image_url": "",
    "titles": [
      "Scientists create human eggs in the lab, using skin cells",
      "Scientists make embryos from human skin DNA for first time",
      "Egg cells made with DNA from human skin fertilised in the lab",
      "Scientists Made Human Eggs From Skin Cells and Used Them to Form Embryos"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.897,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.794,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Scientists have developed a technique to create eggs from the DNA of adult skin cells, offering a potential future treatment for infertility. This method could also enable gay couples to have genetically related children. However, the embryos created were not used to attempt pregnancy. The researchers believe this approach could one day help address infertility issues.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump, Netanyahu Agree on Gaza Peace Deal; Hamas Approval Pending",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Tue, 30 Sep 2025 19:24:09 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Washington Post",
      "Axios",
      "New York Times"
    ],
    "domains": [
      "www.nytimes.com",
      "www.aljazeera.com",
      "news.google.com",
      "www.washingtonpost.com"
    ],
    "snippets": [
      "Details are key in any peace agreement. Donald Trump’s 20-point plan for Gaza is notably lacking in them.",
      "US President Donald Trump and Israeli Prime Minister Benjamin Netanyahu say they agree on a new Gaza peace deal.",
      "<a href=\"https://news.google.com/rss/articles/CBMiigFBVV95cUxOeHlpLWZjbFpUazZha2YxampoeWJfUktad1haSV9tMC1LdTZjNVdqUkR1OElXbmxkeG9uODl3MGlMUFBuTDlwQnJPbzRpMG02MGdKakVDcjUzY1RoVFFSVTlYcC1VSTl5dFYwUDNCTlVkOXZnTUJhZjRuNWxjdGJULU1MODFjRWNKaGc?oc=5\" target=\"_blank\">Qatar, Egypt and Turkey urge Hamas to ac",
      "The Israeli premier’s reluctance to fully withdraw troops or make way for a Palestinian state, combined with Hamas’s reluctance to disarm, may result in a fragile deal, analysts say.",
      "It would end the war and secure the release of all hostages. Hamas would give up its arms and its power, while a transitional government is set up. Hamas has not agreed and the terms will be hard for it to swallow."
    ],
    "image_url": "",
    "titles": [
      "Trump’s Gaza peace plan has 20 points but few details",
      "Key takeaways from US President Trump’s ‘Gaza peace plan’",
      "Qatar, Egypt and Turkey urge Hamas to accept Trump's Gaza peace plan - Axios",
      "Netanyahu tries to sell Trump’s Gaza peace plan to a skeptical right wing",
      "Trump’s Gaza Plan: What We Know"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.982,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.793,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "US President Donald Trump and Israeli Prime Minister Benjamin Netanyahu have agreed on a new Gaza peace deal, lacking detailed information. The deal aims to end the war and secure the release of all hostages by having Hamas disarm and relinquish power for a transitional government. However, challenges arise from Netanyahu's reluctance to withdraw troops or allow a Palestinian state, and Hamas's hesitation to disarm. The outcome remains uncertain as Hamas has yet to agree to the terms.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Ex-Congo President Kabila Sentenced to Death in Absentia for Multiple Crimes",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Tue, 30 Sep 2025 16:30:06 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "The Guardian",
      "Deutsche Welle",
      "New York Times"
    ],
    "domains": [
      "www.nytimes.com",
      "www.aljazeera.com",
      "www.theguardian.com",
      "www.dw.com"
    ],
    "snippets": [
      "Head of military tribunal says Kabila convicted of several crimes, including treason, murder and torture.",
      "Former Congolese President Joseph Kabila was sentenced to death in absentia by a military court. He was found guilty of treason and complicity with the M23 militia.",
      "<p>Military court convicts Kabila of war crimes, treason and other offences in verdict that could fuel enduring tensions</p><p>A military court in the Democratic Republic of the Congo has sentenced the country’s former president Joseph Kabila to death in absentia after convicting him of war crimes, ",
      "Joseph Kabila, who was president of the Democratic Republic of Congo for 18 years, was convicted of treason by a court in Kinshasa."
    ],
    "image_url": "",
    "titles": [
      "DR Congo’s ex-President Joseph Kabila sentenced to death in absentia",
      "Congo: Death sentence for former leader Joseph Kabila",
      "Former DRC president Joseph Kabila sentenced to death in absentia",
      "Congo’s Former President Sentenced to Death in Absentia"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.925,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.774,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Former Congolese President Joseph Kabila was sentenced to death in absentia by a military court in the Democratic Republic of the Congo. He was convicted of several crimes, including treason, murder, torture, and complicity with the M23 militia. This verdict comes after Kabila's 18-year presidency and could escalate tensions in the region.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "South African Ambassador to France Found Dead in Paris",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 30 Sep 2025 16:21:56 GMT",
    "source": "BBC",
    "sources": [
      "Al Jazeera",
      "BBC",
      "Deutsche Welle",
      "New York Times"
    ],
    "domains": [
      "www.nytimes.com",
      "www.aljazeera.com",
      "www.dw.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The circumstances around Nathi Mthethwa's death are being investigated by the French authorities.",
      "South African Ambassador Nkosinathi Emmanuel &quot;Nathi&quot; Mthethwa was found dead outside of a high-rise hotel in Paris.",
      "Ambassador Nkosinathi Emmanuel \"Nathi\" Mthethwa's body was discovered outside a Paris hotel. The circumstances of his death are under investigation.",
      "The police are investigating the death of the ambassador, Nkosinathi Emmanuel Mthethwa, as a possible suicide."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/ca83/live/869eb4c0-9dfd-11f0-a82d-4d2348b593b6.jpg",
    "titles": [
      "South Africa's top diplomat in France found dead near Paris hotel",
      "South African Ambassador to France found dead outside Paris hotel",
      "South Africa's ambassador to France found dead in Paris",
      "South African Ambassador to France Is Found Dead in Paris"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.903,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.77,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "South African Ambassador Nkosinathi Emmanuel \"Nathi\" Mthethwa was found dead outside a high-rise hotel in Paris. French authorities are investigating the circumstances of his death, with police considering it a possible suicide.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Angels' Washington, Montgomery Exit; Team Seeks New Manager for 2026",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 30 Sep 2025 15:55:28 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports",
      "Sportsnet"
    ],
    "domains": [
      "www.cbssports.com",
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "Ron Washington, who missed most of the season after undergoing heart surgery, and Ray Montgomery will not be managing the Angels in 2026, a source told ESPN.",
      "The offseason carousel has started. Here's who is out -- and who could be in line to replace them.",
      "At least four MLB teams will be looking for a new manager this winter",
      "<p>The Los Angeles Angels will have a new skipper in 2026.</p>"
    ],
    "image_url": "",
    "titles": [
      "Washington out as Angels manager, source says",
      "Tracking MLB offseason manager changes: Washington won't return to Angels, who else is out?",
      "Angels reportedly move on from Ron Washington, interim Ray Montgomery, will get new manager for 2026",
      "Report: Ron Washington won’t return as Angels manager"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.993,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.76,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Ron Washington and Ray Montgomery will not return as managers for the Los Angeles Angels in 2026, following Washington's absence due to heart surgery. The Angels are among at least four MLB teams seeking new managers this offseason, as confirmed by a source to ESPN.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Gaza Palestinians React to Trump's 20-Point Plan Endorsed by Netanyahu",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Tue, 30 Sep 2025 18:22:34 +0000",
    "source": "Al Jazeera",
    "sources": [
      "CityNews",
      "Al Jazeera",
      "Axios"
    ],
    "domains": [
      "www.aljazeera.com",
      "news.google.com",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "US president says Hamas has &#039;three or four days&#039; to respond to his Gaza ceasefire proposal.",
      "Palestinians in Gaza have been reacting to US President Donald Trump&#039;s 20-point plan to bring an end to the war on Gaza.",
      "<a href=\"https://news.google.com/rss/articles/CBMijAFBVV95cUxNd2MweHlKVzZIOXJ1SWQxYk84VTN2Q3lEOHdEeGhOc2Zsd001N1lTcVlvaVRJRmVxNlN6TGM0cGlubldsblhRbFV1VXBUeXlTQ05kcWVPazNLRDN2azBCN3REVWp0bzJ2ak9rNHlaRVN4SS1neG03X0MwVDVuV3cweWRlQXVNZ0VuZVRtVg?oc=5\" target=\"_blank\">The scramble to shape Trump's Gaza pl",
      "OTTAWA — Prime Minister Mark Carney says Canada welcomes U.S. President Donald Trump&#8217;s &#8220;historic new Middle East peace plan,&#8221; which Washington has asked Ottawa to sell to other nations. Trump&#8217;s plan to put the Gaza Strip and its 2.1 million Palestinians under an international"
    ],
    "image_url": "",
    "titles": [
      "Can Trump’s plan end the war in Gaza?",
      "Palestinians in Gaza react to Trump plan on ending Israel’s war",
      "The scramble to shape Trump's Gaza plan is just beginning - Axios",
      "PM Carney welcomes Trump’s peace plan proposal for Israel and Gaza"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.962,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.746,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Palestinians in Gaza have responded to US President Donald Trump's 20-point plan aimed at ending the war on Gaza. The plan, which has received endorsement from Prime Minister Benjamin Netanyahu, largely meets Netanyahu's expectations, despite increasing international isolation.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Labour Unveils Tax Strategy, Albanese Endorses Gaza Peace Plan Excluding Hamas",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 30 Sep 2025 06:12:28 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Deutsche Welle",
      "The Guardian",
      "Financial Times"
    ],
    "domains": [
      "www.ft.com",
      "www.dw.com",
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "European and Middle Eastern leaders have welcomed a new US peace plan for Gaza, as President Donald Trump warned Hamas to accept it.",
      "Donald Trump revealed a proposed plan to end the war in Gaza during Israeli Prime Minister Benjamin Netanyahu's visit to the White House. What exactly is in the 20-point plan?",
      "The hurried diplomacy and backroom arm-twisting that shaped the White House plan",
      "<p>Anthony Albanese applauds commitment to denying Hamas a role in any future governance of Gaza, and urges Hamas to agree to the terms</p><ul><li><p><a href=\"https://www.theguardian.com/australia-news/live/2025/sep/30/australia-news-live-albanese-supermarket-united-arab-emirates-uae-coalition-sussa"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/43b9/live/c404dca0-9dc0-11f0-92db-77261a15b9d2.jpg",
    "titles": [
      "Trump's 20-point plan in full",
      "What is Donald Trump's 20-point plan to end Gaza war?",
      "How Donald Trump’s Gaza deal came together",
      "‘There is hope’: Australia welcomes Trump’s 20-point peace plan for Gaza"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.731,
      "consensus": 0.908,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.745,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Labour's tax strategies for the upcoming Budget and a 20-point Gaza peace plan are highlighted in recent news. Anthony Albanese has endorsed the exclusion of Hamas from future governance in Gaza and calls for Hamas to accept the peace terms.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Administration to Deport 400 Iranians Amid Persecution Concerns",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Tue, 30 Sep 2025 17:53:44 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "The Guardian",
      "Axios"
    ],
    "domains": [
      "www.aljazeera.com",
      "news.google.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "An Iranian Foreign Ministry official says the Trump administration plans to deport about 400 Iranians.",
      "<a href=\"https://news.google.com/rss/articles/CBMid0FVX3lxTE5KYjI5eXlzcFhIZnpIVE1tMnVQU29HYXRLQ3BZYkZTTEE3NnQ2Y3pac2dHblQ4elV0Ym1Pd00xZktrNGxKbHUzOEFlS1dzeFNsbzZmV280MUFFSEZTRVRfdWkyYV8wUGJrdjMyNUtiUk5VSEROSy1V?oc=5\" target=\"_blank\">Trump admin to deport hundreds of Iranians back to Iran: reports</a",
      "<p>Uncommon instance of cooperation between the two countries reportedly came after months of talks</p><p>The US has deported 120 Iranians under an expulsion campaign that raises fears over the potential persecution of returnees.</p><p>As many as 400 Iranians are being sent back to their home countr"
    ],
    "image_url": "",
    "titles": [
      "Trump administration deporting hundreds of Iranian citizens: Tehran",
      "Trump admin to deport hundreds of Iranians back to Iran: reports - Axios",
      "US deports 120 Iranians back to Tehran in Trump immigration crackdown"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.952,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.744,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Trump administration plans to deport about 400 Iranians back to Iran, following months of negotiations between the two countries. So far, 120 Iranians have already been deported under this campaign. Concerns have been raised about the potential persecution of those being returned to Iran.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Afghanistan Faces First Nationwide Internet Outage Under Taliban Rule",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Tue, 30 Sep 2025 08:51:25 -0400",
    "source": "NPR",
    "sources": [
      "Washington Post",
      "Deutsche Welle",
      "NPR"
    ],
    "domains": [
      "www.npr.org",
      "www.washingtonpost.com",
      "www.dw.com"
    ],
    "snippets": [
      "The outage was the first nationwide shutdown since the Taliban returned to power in August 2021 and was part of their professed crackdown on immorality.",
      "Fiber-optic and mobile internet access has been cut off, and experts warn of serious consequences for trade and girls' access to education.",
      "Two weeks after the regime signaled plans to ban fiber-optic internet, nearly all links to the outside world are cut, grounding planes and closing businesses."
    ],
    "image_url": "",
    "titles": [
      "The U.N. mission appeals to the Taliban to restore internet access in Afghanistan",
      "Taliban's internet shutdown in Afghanistan: What's at stake?",
      "Taliban internet shutdown paralyzes Afghanistan"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.857,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.743,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In Afghanistan, a nationwide internet outage occurred for the first time since the Taliban's return to power in August 2021, as part of a crackdown on immorality. This disruption, resulting from the Taliban's plans to ban fiber-optic internet, severed fiber-optic and mobile internet access, affecting trade, education for girls, grounding planes, and closing businesses.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "6.9-Magnitude Earthquake in Philippines Kills 6, Injures Many",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Tue, 30 Sep 2025 16:51:34 +0000",
    "source": "Al Jazeera",
    "sources": [
      "CityNews",
      "Al Jazeera",
      "The Guardian"
    ],
    "domains": [
      "www.aljazeera.com",
      "ottawa.citynews.ca",
      "www.theguardian.com"
    ],
    "snippets": [
      "Rescue efforts under way after quake off Cebu island sends people running into the streets, damages buildings.",
      "<p>Power knocked out and buildings and roads damaged as rescuers search for casualties</p><p>A 6.9-magnitude quake has struck off the the central <a href=\"https://www.theguardian.com/world/philippines\">Philippines</a> coast, damaging buildings and roads and knocking out power in parts of the region,",
      "MANILA, Philippines (AP) — An offshore earthquake of magnitude 6.9 jolted the central Philippines and collapsed the walls of buildings late Tuesday, killing at least six people, injuring several more and sending residents scrambling out of homes into darkness as the intense shaking cut off power, of"
    ],
    "image_url": "",
    "titles": [
      "Deaths reported after powerful earthquake hits off Philippines coast",
      "Central Philippines hit by powerful 6.9-magnitude earthquake",
      "Strong earthquake in central Philippines kills at least 6 people and damages houses and buildings"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.932,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.733,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A 6.9-magnitude earthquake hit off the coast of the central Philippines, causing at least six deaths and injuring several others. The quake, which occurred late Tuesday, led to widespread damage, including collapsed buildings and damaged roads, and knocked out power in parts of the region. Rescue efforts are underway as residents and authorities deal with the aftermath.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "UEFA 2025: Galatasaray vs. Liverpool, Benfica vs. Chelsea Predictions Released",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Tue, 30 Sep 2025 18:29:17 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sports Illustrated",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "news.google.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "SportsLine soccer expert Martin Green has locked in his UEFA Champions League 2025 predictions for Galatasaray vs. Liverpool, which is streaming live on Paramount+",
      "Brandt Sutton locked in his 2025 UEFA Champions League predictions for Benfica vs. Chelsea, which is streaming live on Paramount+",
      "<p>⚽ Plus EFL updates | <a href=\"https://www.theguardian.com/football/live/2025/sep/30/galatasaray-v-liverpool-champions-league-live\">Galatasaray v Liverpool – live</a><br />⚽️ <a href=\"https://www.theguardian.com/football/live\">Live scores</a> | <a href=\"https://www.theguardian.com/football/2025/se",
      "<a href=\"https://news.google.com/rss/articles/CBMihAFBVV95cUxQTFNBTVNZVjUtMXRncFp3Y1FId0MyZm92Z1BTS1c3X2NaTnlJM1l2M1dtZzV0WVdqR2FQc1cyX0U5Q25PS0dnUG43NnBuUHlONXUydnNpekM4QW9OWlQ2WTRWbWpGR21zbkt2cE5QQndPaHo1Wl9VSjJSVXVkTmZ6WUdaNEI?oc=5\" target=\"_blank\">How to Watch Galatasaray vs. Liverpool on TV, Li",
      "<a href=\"https://news.google.com/rss/articles/CBMiiwFBVV95cUxOMzdyeHE5MlVEeXVIODIyQVppYmxpa2F6SmdfeldTc3owUVdtSEVNTjZUY2pDX0YtOVVLb3pIOFd0d2s0SVFmLXB5V3M2NHNyQk5DMVpEdjdmZ2pDcUp5QjBlSGhEMTgxWnprdDZKTGhDZ05tQnNwa0V3WFZIcG1XWm1ZM0doeEpZck5N?oc=5\" target=\"_blank\">How to Watch Kairat vs. Real Madrid on "
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/30/c20fb830-310b-4623-a63d-4b48587a7ddc/mohamed-salah-liverpool.jpg",
    "titles": [
      "Liverpool vs. Galatasaray odds, how to watch, live stream, time: UEFA Champions League picks for Sept. 30",
      "Chelsea vs. Benfica odds, how to watch, stream, start time: UEFA Champions League picks, prediction",
      "Chelsea v Benfica, Bodø/Glimt v Tottenham, and more: Champions League – live",
      "How to Watch Galatasaray vs. Liverpool on TV, Live Stream - Sports Illustrated",
      "How to Watch Kairat vs. Real Madrid on TV, Live Stream - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.964,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.73,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "SportsLine experts Martin Green and Brandt Sutton have made their UEFA Champions League 2025 predictions for the matches between Galatasaray vs. Liverpool and Benfica vs. Chelsea, respectively. Both matches are available for streaming live on Paramount+. Additionally, updates on the English Football League (EFL) are provided, alongside links for live scores and information on how to watch these games on TV and online.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "750K Federal Workers Face Furlough Risk Amid Shutdown Concerns",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Tue, 30 Sep 2025 17:39:16 GMT",
    "source": "Axios",
    "sources": [
      "CNBC",
      "Axios",
      "Business Insider"
    ],
    "domains": [
      "www.cnbc.com",
      "www.businessinsider.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMiigFBVV95cUxNV0xnNWlZd2h3ZFRsbUtCUG1aUkczZXhxUkxvU29MeFlUOEFEY1lSOEd3VkpNYkJxZ3lVcDdDQXMyd1lIZ1dXby1fcFRMdGVQRkVOajZSSXF3R0NtUzhRRjljWEk1UlZFYWN3S1Bla0NsNlpoTWxLRDNOeFA1Y3hPUUJicUVmUVBMT0E?oc=5\" target=\"_blank\">750K federal workers risk furloughs in g",
      "<a href=\"https://news.google.com/rss/articles/CBMid0FVX3lxTFBKT1lta1d2UEUzVk95dy1IWW5ZdUU5alZuZmM3U3FjbFBjX2lFeFNOS0YzRXVaTXNuNFV6dFhnYk1kd3VUeUhUTEhSd0FscFNfaEswNmtYdW9RQl9kNmg0LXY3WWRsdnpuUlF4OUYtdFRhZzJZZERv?oc=5\" target=\"_blank\">Federal workers don't want a shutdown, but some are OK with it</a>&",
      "<a href=\"https://news.google.com/rss/articles/CBMibEFVX3lxTE5DTUs5dG1xWFdidzQ4cUpraUlhbUozYVNPdDRLLWRBVVFYZUJTVnduR2hYRXdNYTY4U1l5VVdKMU5TRXRKSWY0eTZMaElnWTMyX2RVQUtnOVNvUHNtQUhUdE5kQ0NHS1I0WnZDaA?oc=5\" target=\"_blank\">IPO market poised to freeze with government shutdown</a>&nbsp;&nbsp;<font color=\"",
      "Democrats insist that any stopgap funding bill included an extension of enhance Affordable Care Act tax credits due to expire at the end of 2025.",
      "Federal workers received an email Tuesday, saying that a looming government shutdown will come with furloughs."
    ],
    "image_url": "",
    "titles": [
      "750K federal workers risk furloughs in government shutdown, CBO estimates - Axios",
      "Federal workers don't want a shutdown, but some are OK with it - Axios",
      "IPO market poised to freeze with government shutdown - Axios",
      "Government shutdown would furlough about 750,000 federal workers, CBO says",
      "Read the email federal workers are getting hours before a potential government shutdown"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.928,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.729,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Approximately 750,000 federal workers are at risk of furloughs due to a potential government shutdown. Despite the risk, some federal employees are indifferent to the possibility of a shutdown. The shutdown could also freeze the IPO market. Democrats are demanding that any temporary funding measure to prevent the shutdown includes an extension of enhanced Affordable Care Act tax credits set to expire at the end of 2025. Federal workers were notified via email about the potential furloughs associated with the shutdown.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Deepti Sharma Leads India to Win Over Sri Lanka in World Cup Opener",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 30 Sep 2025 18:28:50 GMT",
    "source": "BBC",
    "sources": [
      "Sky Sports",
      "BBC",
      "The Guardian"
    ],
    "domains": [
      "www.skysports.com",
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Deepti Sharma scores a half-century and takes three wickets as India seal a 59-run win over Sri Lanka in the opening match of the Women's World Cup.",
      "<ul><li><p>India, 269-8, beat Sri Lanka, 211, by 59 runs (DLS)</p></li><li><p>Sharma scores 53 and takes three wickets in Guwahati</p></li></ul><p>Deepti Sharma impressed with bat and ball as India beat fellow co-hosts Sri Lanka by 59 runs (Duckworth-Lewis-Stern method) in the rain-affected opening ",
      "Amanjot Kaur scored her maiden Women's Cricket World Cup half-century as India began their campaign with a 59-run victory (DLS Method) over Sri Lanka in a rain-affected opening encounter in Guwahati."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/cfd2/live/b76e2ca0-9e18-11f0-92db-77261a15b9d2.jpg",
    "titles": [
      "India impress to beat Sri Lanka in World Cup opener",
      "Deepti Sharma leads India rally to deny Sri Lanka in Cricket World Cup opener",
      "Amanjot impresses as India beat Sri Lanka in rain-affected World Cup opener"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.944,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.726,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Deepti Sharma starred with a half-century and three wickets, leading India to a 59-run victory over Sri Lanka under the Duckworth-Lewis-Stern method in the rain-affected Women's World Cup opener in Guwahati. Amanjot Kaur also scored her maiden World Cup half-century, contributing to India's total of 269-8 before restricting Sri Lanka to 211.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump, Hegseth Urge Military to Use Cities for 'Warrior Ethos'",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Tue, 30 Sep 2025 16:03:34 GMT",
    "source": "Axios",
    "sources": [
      "Financial Times",
      "Axios",
      "The Guardian"
    ],
    "domains": [
      "www.ft.com",
      "news.google.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMiiAFBVV95cUxQcC1PNlc2cUh6ZnZCTmMwdHRYbldaRWpVU3NwTnhycElLbFZGUW1qSlFmNGpiaUtRYkNrQ1VxRW0wYUM1UFhSTXRKMllSN19RUkc2bFYtSGpjWEkyMDY1djlXRk5PWU8zWGM3cktSQUVGTmkyY0E4U2Q4NFBpRDNlZDBBV3BuMWlW?oc=5\" target=\"_blank\">Trump says military should use U.S. cities ",
      "Defence secretary Pete Hegseth also tells admirals and generals they must restore ‘warrior ethos’",
      "<p>President and defense chief delivered pair of incendiary speeches to a crowd of hundreds of generals and admirals</p><ul><li><p><a href=\"https://www.theguardian.com/us-news/live/2025/sep/30/us-government-shutdown-funding-trump-vance-portland-hegseth-latest-updates\">US politics – latest updates</a"
    ],
    "image_url": "",
    "titles": [
      "Trump says military should use U.S. cities as \"training grounds\" - Axios",
      "Trump says US cities should be used as military ‘training grounds’",
      "Trump defends troops in US cities after Hegseth decries military DEI efforts"
    ],
    "score_components": {
      "magnitude": 0.847,
      "recency": 0.897,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.723,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "President Trump and Defense Secretary Pete Hegseth addressed hundreds of generals and admirals, advocating for the military's use of U.S. cities to restore 'warrior ethos.' Their speeches, described as incendiary, aimed to influence military leadership amidst current U.S. political dynamics.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Imposes New Tariffs on Canadian Timber, Goods",
    "domain": "business",
    "source_domain": "financialpost.com",
    "location": "national",
    "published": "Tue, 30 Sep 2025 19:32:21 +0000",
    "source": "Financial Post",
    "sources": [
      "Financial Post",
      "CityNews"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "financialpost.com"
    ],
    "snippets": [
      "U.S. President Donald Trump has issued new tariffs that could add further pressure on Canadian producers of softwood lumber and furniture. A presidential proclamation on Monday evening set out a 10 per cent duty on imports of softwood timber and lumber, along with a 25 per cent levy on imports of ki",
      "U.S. President Donald Trump has issued new tariffs that could add further pressure on Canadian producers of softwood lumber and furniture. A presidential proclamation on Monday evening set out a 10 per cent duty on imports of softwood timber and lumber, along with a 25 per cent levy on imports of ki"
    ],
    "image_url": "",
    "titles": [
      "Trump hits Canadian lumber producers with additional 10 per cent tariff",
      "Trump hits Canadian lumber producers with additional 10 per cent tariff"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.985,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.716,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "U.S. President Donald Trump announced new tariffs on Canadian goods, imposing a 10% duty on softwood timber and lumber, and a 25% levy on unspecified imports. This move is expected to increase pressure on Canadian producers of softwood lumber and furniture.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Imgur Blocks UK Access Amid Plans for Child Data Fine",
    "domain": "technology",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Tue, 30 Sep 2025 13:19:57 GMT",
    "source": "BBC",
    "sources": [
      "TechCrunch",
      "BBC",
      "The Verge"
    ],
    "domains": [
      "www.theverge.com",
      "techcrunch.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The image-hosting platform - which is widely used to make memes - was facing a fine over its use of children's data.",
      "The image-sharing site Imgur has shut off access to UK users after the country’s data watchdog warned the platform of a fine, as reported earlier by the BBC. In a post on Imgur’s help page, Imgur confirms that users in the UK can no longer log in, view content, or upload images starting September 30",
      "Imgur, one of the web's most popular image sharing and hosting platforms, has shut off access to its site in the U.K., following a notice of a fine by the country's data protection watchdog."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/90cd/live/66c98e50-9dfc-11f0-a82d-4d2348b593b6.jpg",
    "titles": [
      "Image site Imgur blocks access to UK users after regulator warned of fine",
      "Imgur is blocking users in the UK",
      "Imgur pulls out of UK after data regulator warns of fines"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.848,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.716,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Imgur, a popular image-sharing platform, has blocked access to its site in the U.K. after the country's data protection watchdog announced plans to fine the company for improperly using children's data.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Nigel Wright, Ex-Harper Chief of Staff and Onex Executive, Dies",
    "domain": "general",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Tue, 30 Sep 2025 19:21:06 +0000",
    "source": "Global News",
    "sources": [
      "CityNews",
      "Global News"
    ],
    "domains": [
      "globalnews.ca",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "Wright was Harper's chief of staff from 2011 to 2013, but left that high-profile position over his involvement in the Senate expenses scandal.",
      "OTTAWA — Nigel Wright, a longtime Canadian businessman and former top aide to prime minister Stephen Harper, has died. Onex, the private equity firm where Wright worked for nearly three decades, announced his death in a post today. The firm&#8217;s president and CEO, Bobby LeBlanc, says in a stateme"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/09/8eecf70f583aac3e7282c3096459963674a40effba541aa0606a1ffba78ac2ec.jpg?quality=65&strip=all",
    "titles": [
      "Nigel Wright, former top aide to Stephen Harper, dead at 62",
      "Nigel Wright, former chief of staff to Stephen Harper, dead at age 62"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.981,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.701,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Nigel Wright, a Canadian businessman and former chief of staff to Prime Minister Stephen Harper from 2011 to 2013, has passed away. Wright, known for his involvement in the Senate expenses scandal, was a longtime executive at Onex, a private equity firm. His death was confirmed by Onex's president and CEO, Bobby LeBlanc.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Dolphins' Tyreek Hill Out for Season with Knee Injury",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 30 Sep 2025 15:55:28 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sky Sports"
    ],
    "domains": [
      "www.skysports.com",
      "www.espn.com"
    ],
    "snippets": [
      "Dolphins wide receiver Tyreek Hill may not need multiple surgeries after dislocating his left knee, coach Mike McDaniel said on Tuesday, a day after the Miami veteran suffered the gruesome injury during the team's 27-21 victory over the New York Jets.",
      "Miami Dolphins wide receiver Tyreek Hill is out for the season with torn ligaments in his knee after injuring it during his side's 27-21 win over the New York Jets."
    ],
    "image_url": "",
    "titles": [
      "Dolphins' Hill may not need multiple surgeries",
      "Dolphins star Hill out for season"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.993,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.689,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Miami Dolphins wide receiver Tyreek Hill will miss the rest of the season due to torn ligaments in his left knee, an injury sustained during a 27-21 victory over the New York Jets. Despite initial concerns, Dolphins coach Mike McDaniel indicated that Hill might not require multiple surgeries for the dislocation.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: sustain",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Lynx's Collier Criticizes WNBA Leadership and Officiating",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 30 Sep 2025 15:55:28 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "www.espn.com"
    ],
    "snippets": [
      "Lynx star Napheesa Collier said the WNBA has the \"worst leadership\" and accused commissioner Cathy Engelbert of being \"negligent\" in her governance.",
      "<p>Minnesota Lynx superstar Napheesa Collier delivers a statement on the state of the WNBA, calling out league officials for allowing poor officiating and failing to do right by its players.</p>",
      "<p>Minnesota Lynx star Napheesa Collier is joining her coach in raising alarm bells about the state of the WNBA.</p>"
    ],
    "image_url": "",
    "titles": [
      "Collier blasts WNBA's Engelbert: 'Worst leadership'",
      "Collier sounds off on WNBA brass: ‘Worst leadership in the world’",
      "Lynx star Napheesa Collier on WNBA: ‘Worst leadership in the world’"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.993,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.689,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Napheesa Collier, a star player for the Minnesota Lynx, criticized the WNBA's leadership, specifically targeting Commissioner Cathy Engelbert for negligence. Collier accused the league of poor officiating and not adequately supporting its players, aligning her concerns with her coach's previous statements about the league's governance issues.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Sauce Gardner Claims Refs Target Him Over Jets' Losing Streak",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Tue, 30 Sep 2025 15:55:28 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports"
    ],
    "domains": [
      "www.cbssports.com",
      "www.espn.com"
    ],
    "snippets": [
      "Star cornerback Sauce Gardner believes the officials are picking on him, and he claimed it's because the Jets are a losing team.",
      "Gardner has been flagged for pass interference each of the last two games"
    ],
    "image_url": "",
    "titles": [
      "Sauce: Refs picking on me because Jets losing",
      "Sauce Gardner claims Jets are penalized more because they're a losing team"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.993,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.686,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Star cornerback Sauce Gardner expressed concerns that referees are targeting him due to the Jets' losing record. He noted receiving pass interference penalties in the last two games.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Browns to Start Dillon Gabriel as QB in Week 5 to Boost 2025 Season Performance",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Tue, 30 Sep 2025 19:52:44 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Yahoo Sports"
    ],
    "domains": [
      "duckswire.usatoday.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Don't discount another team turning the page under center",
      "Will making a move at quarterback turn the Browns' 2025 season around?",
      "After an abysmal offensive start to the season, it appears that former Oregon Duck quarterback Dillon Gabriel will start in Week 5 for the Browns."
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/30/445557dc-58ff-4e99-a388-1880228e6065/joe-flacco-dillon-gabriel.jpg",
    "titles": [
      "Browns expected to start Dillon Gabriel in Week 5 vs. Vikings: Was Cleveland right to turn to rookie QB?",
      "Browns expected to start Dillon Gabriel at QB, bench Joe Flacco after 1-3 start",
      "Cleveland Browns expected to move to Dillon Gabriel as starting QB in Week 5, per report"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.992,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.663,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Cleveland Browns are making a quarterback change, starting Dillon Gabriel, a former Oregon Duck, in Week 5 after a poor offensive performance at the season's start. This move aims to improve their 2025 season.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: improve",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Amazon Launches New Kindle Scribe Models, Features Color Screen Option",
    "domain": "business",
    "source_domain": "financialpost.com",
    "location": "national",
    "published": "Tue, 30 Sep 2025 19:44:40 +0000",
    "source": "Financial Post",
    "sources": [
      "Financial Post",
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com",
      "financialpost.com"
    ],
    "snippets": [
      "NEW YORK (AP) &#8212; Online juggernaut Amazon Inc. unveiled its next generation of Kindle, Ring and Echo devices, among other gadgets, that are all powered by artificial intelligence and connected to Alexa+, its AI-infused personal assistant, which made its debut in February. The lineup, announced ",
      "The new Kindle Scribe has a larger 11-inch glare-free display, is just 5.4mm thick, and weighs only 400g. It’s also 40% faster when writing or turning pages."
    ],
    "image_url": "",
    "titles": [
      "Amazon unveils new generation of AI-powered Kindle and other devices",
      "Amazon unveils new Kindle Scribe and Kindle Scribe Colorsoft"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.989,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.653,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Amazon unveiled three new models of the Kindle Scribe, including one with a color screen. These third-generation eReaders feature an 11-inch glare-free display, are 5.4mm thick, weigh 400g, and offer a 40% faster performance in writing and page-turning.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Colorado Fined $50K for Fans' Anti-LDS Chants at BYU Game",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Tue, 30 Sep 2025 19:06:35 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Yahoo Sports"
    ],
    "domains": [
      "sports.yahoo.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Colorado faces a $50,000 fine from the Big 12 after student chants with anti-LDS language targeted BYU",
      "Colorado coach Deion Sanders apologized to BYU on Tuesday just before the Big 12 Conference reprimanded the Buffaloes and issued a $50,000 fine for derogatory chants by fans over the weekend.  The expletives and religious slurs directed at Mormons took place as No. 23 BYU beat Colorado 24-21 at Fols"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/09/30/78568a0c-1684-4d4a-86a1-329982277035/byu-colorado.jpg",
    "titles": [
      "Big 12 fines Colorado, issues public reprimand for 'hateful and discriminatory' chants toward BYU",
      "Big 12 fines Colorado $50K for derogatory chants from fans directed at BYU, Deion Sanders apologizes"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.976,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.65,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Colorado has been fined $50,000 by the Big 12 Conference due to derogatory chants by fans targeting BYU with anti-LDS language. Colorado's coach, Deion Sanders, issued an apology to BYU before the fine was announced. This incident occurred during a game where BYU defeated Colorado 24-21.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "WNBA Commissioner's Remarks on New Media Deal Spark Debate",
    "domain": "business",
    "source_domain": "www.forbes.com",
    "location": "global",
    "published": "Tue, 30 Sep 2025 14:57:17 -0400",
    "source": "Forbes",
    "sources": [
      "Sports Illustrated",
      "Forbes"
    ],
    "domains": [
      "news.google.com",
      "www.forbes.com"
    ],
    "snippets": [
      "WNBA Commissioner allegedly said Caitlin Clark should be grateful to the WNBA and players should be on their knees in gratitude for new media deal.",
      "<a href=\"https://news.google.com/rss/articles/CBMikgFBVV95cUxQSDhvdElfblFBSUNvWTNSc0wwa0lRX1FTbVlKNExjZTJhSjhSeWRwOEwyY2ZvdWdKMEM1dmtRdHczMS15MW5RSmRySGlnMDk0ay1sd2FkYkYxVTFMbkdIcUE4bWhRUG85VVlzMi11LUFaU01yeHY5U1JSRkZhZEIydDA3WXgwQ2hZcmFsR3I5Z0R5QQ?oc=5\" target=\"_blank\">Angel Reese Seemed to Love Na"
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/68dc26bfbcf05b324e5f0a54/0x0.jpg?width=960",
    "titles": [
      "Napheesa Collier Calls Out WNBA Commissioner Amid Lockout Rumors",
      "Angel Reese Seemed to Love Napheesa Collier Calling Out WNBA Commissioner - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.973,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.65,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "WNBA Commissioner is reported to have stated that Caitlin Clark and other players should feel grateful for the league's new media deal, suggesting they should be \"on their knees in gratitude.\" This statement has sparked discussions and reactions within the sports community, reflecting on the commissioner's perspective on the value and recognition of players' contributions to the league.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Amazon Unveils New Alexa+ Smart Devices, Including Dot Max and Echo Show 11",
    "domain": "technology",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Tue, 30 Sep 2025 18:04:42 GMT",
    "source": "CNBC",
    "sources": [
      "TechCrunch",
      "CNBC"
    ],
    "domains": [
      "techcrunch.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "Amazon unveiled a slew of new smart speakers and displays that are revamped with Alexa+, its personal assistant powered by generative artificial intelligence.",
      "Amazon debuts new devices, the Dot Max, Echo Studio, Echo Show 8, and Echo Show 11, powered by AI.",
      "Amazon announced new Fire TV devices, 4K Stick, and Alexa+ AI features for TV viewers."
    ],
    "image_url": "",
    "titles": [
      "Amazon's new Echo devices designed for Alexa+ start at $99",
      "Amazon unveils new Echo devices, powered by its AI, Alexa+",
      "Alexa+ comes to new Fire TV devices with AI-powered conversations"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.936,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.642,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Amazon announced new smart speakers and displays, including the Dot Max, Echo Studio, Echo Show 8, and Echo Show 11, all integrated with Alexa+, a version of its assistant enhanced with generative artificial intelligence. This upgrade, dubbed Alexa Plus, will be included in these devices from the start, offering advanced AI capabilities to users. This move aims to expand the presence of Amazon's AI-powered assistant in homes.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Microsoft Unveils AI-Powered \"Agent Mode\" for Excel and Word",
    "domain": "technology",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Tue, 30 Sep 2025 07:11:40 GMT",
    "source": "Axios",
    "sources": [
      "Ars Technica",
      "Axios"
    ],
    "domains": [
      "arstechnica.com",
      "news.google.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMidEFVX3lxTE9DVWlibUZSSGUzTTBJZlYyYURXWXMwc29JLW1IanB0RTZaYzlmTzF2UVJwa0VabFdyV1hsT2FwMUxOMDl1Yzl5VzVMVXVjdlp1MnJPRkRhYlVHZmpRSzBRN0xFY0l1NVFkakxvYmczLUZnd0lf?oc=5\" target=\"_blank\">Microsoft debuts \"vibe working\" in Office</a>&nbsp;&nbsp;<font color=\"#",
      "Agent Mode in Word, Excel works like vibe coding tools but for knowledge work."
    ],
    "image_url": "",
    "titles": [
      "Microsoft debuts \"vibe working\" in Office - Axios",
      "With new agent mode for Excel and Word, Microsoft touts “vibe working”"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.746,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.621,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Microsoft has launched a new feature called \"Agent Mode\" for its Excel and Word applications, enabling users to generate complex spreadsheets and documents through simple AI prompts, a concept similar to \"vibe coding.\" This innovation aims to simplify app usage and enhance productivity.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: innovation",
    "constructiveness_source": "heuristic"
  }
]