[
  {
    "title": "Trump Meets Putin in Anchorage, Puts Business on Hold Over Ukraine Conflict",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Fri, 15 Aug 2025 05:00:00 -0400",
    "source": "NPR",
    "sources": [
      "CityNews",
      "NPR",
      "Al Jazeera",
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com",
      "ottawa.citynews.ca",
      "www.aljazeera.com",
      "www.npr.org"
    ],
    "snippets": [
      "President Trump told reporters on Friday that he's willing to talk about business with Russian President Vladimir Putin, but said there would be no deals \"until we get the war solved\" in Ukraine.",
      "President Trump and Russian President Vladimir Putin meet in Anchorage today to talk about Ukraine. Here's what to know.",
      "Donald Trump is meeting Vladimir Putin on Friday, but the White House is signalling that major agreements are unlikely.",
      "\"Trump wants to exhaust all options to have a peaceful end to war,\" the White House said Thursday. Whether those \"options\" are good or bad for Ukraine is key.",
      "The West has long sought to make Vladimir Putin a pariah over the bloodshed in Ukraine. But on Friday, the Russian leader will break out of international isolation and step foot on U.S. soil, welcomed by an American president eager to fulfill his promise of stopping the war. European leaders who hel"
    ],
    "image_url": "",
    "titles": [
      "Trump and Putin meet today in Anchorage. Here's what to know",
      "Trump and Putin meet in Anchorage today",
      "What to expect when Trump and Putin meet in Alaska",
      "Nothing is off the table as Trump and Putin set to meet",
      "What’s at stake as Trump and Putin meet in Alaska?"
    ],
    "score_components": {
      "magnitude": 0.96,
      "recency": 0.862,
      "consensus": 0.985,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.83,
    "summary": "President Donald Trump met with Russian President Vladimir Putin in Anchorage to discuss the situation in Ukraine. Trump expressed a willingness to engage in business discussions with Putin but emphasized that no deals would be made until the conflict in Ukraine is resolved. The White House indicated that while major agreements were unlikely at this meeting, Trump aimed to explore all options for a peaceful end to the war. This meeting marked a significant moment as Putin, who has been widely criticized by the West for his role in the Ukraine conflict, was welcomed in the U.S. by Trump, highli",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 101 tokens",
    "image": {
      "src": "icons/ukraine.svg",
      "thumbnail": "icons/ukraine.svg",
      "alt": "ukraine flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "DEA Head to Lead D.C. Police, Sparks Legal Challenge from City Leaders",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 15 Aug 2025 15:13:38 GMT",
    "source": "BBC",
    "sources": [
      "Deutsche Welle",
      "The Guardian",
      "Axios",
      "BBC"
    ],
    "domains": [
      "news.google.com",
      "www.theguardian.com",
      "www.bbc.com",
      "www.dw.com"
    ],
    "snippets": [
      "The DEA head, Terry Cole, would assume \"all the powers and duties\" of DC police chief, Bondi said.",
      "The nation's capital has been challenging the president's move to seize control of its police force. City leaders have called it the gravest threat to autonomy from federal power in decades.",
      "<a href=\"https://news.google.com/rss/articles/CBMiigFBVV95cUxPWXFfakpTSDRzNUNIT0R3MkZhWXRDSVNETlJlNV80VVR2eGxnRlBiZzFNUTdORDhLLWQtNjRyV0Fqc0xCVTJsUXBIVDZJT0dlMHFFLTdPRTQ3UlhWcmpBV3Z6WWZacnNFTFhwLXJsQTNYTkJCWVBzWUt2SFlGOFh6MlBnY0hYTnhwT2c?oc=5\" target=\"_blank\">D.C. attorney general sues to stop Trump",
      "<p>Pam Bondi says DEA chief Terry Cole in charge of Metropolitan police amid White House crackdown on crime</p><p><a href=\"https://www.theguardian.com/us-news/washington-dc\">Washington DC</a> was seeking an emergency restraining order on Friday against <a href=\"https://www.theguardian.com/us-news/do"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/5056/live/0eefa990-79e3-11f0-9cfe-35292c1863f3.jpg",
    "titles": [
      "Washington DC sues federal government over police takeover",
      "Washington legal chief sues Trump over police takeover",
      "D.C. attorney general sues to stop Trump's police takeover - Axios",
      "Washington DC sues after Trump officials’ ‘hostile takeover’ of city police"
    ],
    "score_components": {
      "magnitude": 0.9,
      "recency": 0.961,
      "consensus": 0.985,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.803,
    "summary": "The DEA head, Terry Cole, has been appointed to assume control over the Metropolitan Police Department in Washington D.C., as stated by Pam Bondi. This move comes amidst a crackdown on crime by the White House. The city's leaders, viewing this as a significant threat to their autonomy, are challenging the president's decision. The D.C. attorney general has filed a lawsuit against this action, seeking an emergency restraining order to prevent the transfer of power.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 79 tokens",
    "image": {
      "src": "icons/newspaper.svg",
      "thumbnail": "icons/newspaper.svg",
      "alt": "general",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Cloudburst in Pakistan and India Causes Flash Floods, 185 Dead",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 15 Aug 2025 15:04:55 GMT",
    "source": "BBC",
    "sources": [
      "New York Times",
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "The majority of deaths were recorded in Pakistan's mountainous Khyber Pakhtunkhwa area.",
      "<p>Search for the missing continues in north-west after downpour also sparks deadly flooding and landslides in India</p><p>A massive cloudburst has triggered flash floods in north-west Pakistan, killing at least 157 people, as rescuers continued to search for people missing after floods in neighbour",
      "The country has endured heavier rain during monsoon seasons, which scientists have attributed to climate change. The authorities said that at least 185 people died on Friday."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/d6ee/live/931139e0-79d5-11f0-bad9-e7f03dd8181e.jpg",
    "titles": [
      "Flash floods kill nearly 200 in Pakistan and Pakistan-administered Kashmir",
      "Flash floods kill at least 159 people in Pakistan after huge cloudburst",
      "Flash Floods in Pakistan Kill at Least 150 People in a Single Day"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.958,
      "consensus": 0.897,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.746,
    "summary": "A massive cloudburst in north-west Pakistan has resulted in flash floods, killing at least 157 people, with the majority of fatalities occurring in the Khyber Pakhtunkhwa area. The incident also caused deadly flooding and landslides in neighboring India. Rescue operations are ongoing for those still missing. The region has experienced heavier monsoon rains, which scientists link to climate change. The total death toll reported by authorities on Friday reached at least 185.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 73 tokens",
    "image": {
      "src": "icons/india.svg",
      "thumbnail": "icons/india.svg",
      "alt": "india flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "EasyJet Planes Collide at Manchester Airport; No Injuries Reported",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 15 Aug 2025 11:21:43 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC",
      "ABC News"
    ],
    "domains": [
      "www.theguardian.com",
      "abcnews.go.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The aircraft, bound for Paris and Gibraltar, clip wings while taxiing at the airport.",
      "Two easyJet planes clipped wings on the runway at Manchester International Airport in the United Kingdom on Friday morning, officials said.",
      "<p>Two aircraft clipped wings as they taxied to runway for takeoff, with no reports of injuries</p><p>Flights were briefly suspended at Manchester airport on Friday morning after two easyJet planes collided, clipping wings as they taxied to the runway for takeoff.</p><p>The aircraft, which were flyi"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/675f/live/bab54f40-79a3-11f0-a7e9-1ba858cfd910.png",
    "titles": [
      "EasyJet planes clip wings at Manchester Airport",
      "2 easyJet planes clip wings at Manchester Airport in UK",
      "Manchester airport suspends flights after easyJet planes collide"
    ],
    "score_components": {
      "magnitude": 0.82,
      "recency": 0.887,
      "consensus": 0.897,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.739,
    "summary": "Two easyJet planes collided, clipping wings while taxiing to the runway for takeoff at Manchester International Airport, UK, on Friday morning. There were no reported injuries. The incident briefly suspended flights at the airport. Both aircraft were bound for Paris and Gibraltar.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 42 tokens",
    "image": {
      "src": "icons/newspaper.svg",
      "thumbnail": "icons/newspaper.svg",
      "alt": "general",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Global Plastic Pollution Treaty Talks End Without Agreement",
    "domain": "general",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Fri, 15 Aug 2025 10:35:53 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Deutsche Welle",
      "New York Times",
      "Al Jazeera"
    ],
    "domains": [
      "www.aljazeera.com",
      "www.nytimes.com",
      "www.dw.com"
    ],
    "snippets": [
      "Several delegates express dismay at the failure to break a deadlock at the sixth round of talks in under three years.",
      "Negotiations aimed at tacking plastic pollution have concluded without an agreement. Countries differed on how ambitious the treaty should be and whether to focus on cutting plastic production or waste management.",
      "Countries failed to bridge wide gaps on whether the world should limit plastic manufacturing and restrict the use of harmful plastic chemicals."
    ],
    "image_url": "",
    "titles": [
      "Geneva talks on global plastic pollution treaty collapse without a deal",
      "UN talks on plastic pollution fail to reach deal",
      "United Nations Plastic Treaty Talks End Without Deal"
    ],
    "score_components": {
      "magnitude": 0.8,
      "recency": 0.891,
      "consensus": 0.897,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.732,
    "summary": "Negotiations to create a global treaty on plastic pollution ended without an agreement. Countries could not agree on the treaty's ambition level, whether to focus on reducing plastic production or improving waste management, and if it should include legally binding measures to curb production and address toxic chemicals. The talks aimed at addressing the increasing issue of plastic pollution concluded with no consensus reached.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 65 tokens",
    "image": {
      "src": "icons/newspaper.svg",
      "thumbnail": "icons/newspaper.svg",
      "alt": "general",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Canada Post, Union Meeting Delayed Amid Air Canada Talks",
    "domain": "general",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Fri, 15 Aug 2025 15:14:54 +0000",
    "source": "Global News",
    "sources": [
      "CityNews",
      "Global News"
    ],
    "domains": [
      "globalnews.ca",
      "ottawa.citynews.ca"
    ],
    "snippets": [
      "The Canadian Union of Postal Workers said talks had been postponed because federal mediators were unavailable 'due to their current involvement in the Air Canada negotiations.'",
      "OTTAWA — A meeting between Canada Post and the union representing 55,000 postal workers has been delayed until next week due to the availability of federal mediators, the company says. The two sides, which were set to meet Friday, will now meet on Aug. 20. It&#8217;s been two weeks since members of "
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/08/4271f48bcfb572f80756da5d9bcd8cef45592ca9ae5222d05e6d55c59b885fa1_7244ea.jpg?quality=65&strip=all",
    "titles": [
      "Canada Post strike talks with union delayed to next week",
      "Canada Post and union meeting delayed until next week due to mediator availability"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.982,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.719,
    "summary": "A scheduled meeting between Canada Post and the union representing 55,000 postal workers was postponed to Aug. 20 due to federal mediators being occupied with Air Canada negotiations. This delay was announced after the two parties were initially set to meet, marking two weeks since discussions were last held.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 50 tokens",
    "image": {
      "src": "icons/canada.svg",
      "thumbnail": "icons/canada.svg",
      "alt": "canada flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Trump, Putin Hold Summit in Alaska on Ukraine, European Security",
    "domain": "general",
    "source_domain": "www.bbc.co.uk",
    "location": "global",
    "published": "Thu, 14 Aug 2025 20:45:00 GMT",
    "source": "BBC",
    "sources": [
      "CityNews",
      "New York Times",
      "BBC"
    ],
    "domains": [
      "www.bbc.co.uk",
      "ottawa.citynews.ca",
      "www.nytimes.com"
    ],
    "snippets": [
      "Can Trump stop the war in Ukraine?",
      "The delegations include top diplomatic, military and economic officials, a sign that the U.S. and Russia will discuss more than the war in Ukraine.",
      "JOINT BASE ELMENDORF-RICHARDSON, Alaska (AP) — U.S. President Donald Trump is meeting face-to-face with Russian President Vladimir Putin in Alaska on Friday for a high-stakes summit that could determine not only the trajectory of the war in Ukraine but also the fate of European security. The sit-dow"
    ],
    "image_url": "https://ichef.bbci.co.uk/images/ic/240x135/p0j72y80.jpg",
    "titles": [
      "Inside Trump’s meeting with Putin… Americast is in Alaska!",
      "Who’s Attending the Trump-Putin Meeting in Alaska",
      "Trump’s meeting with Putin could determine the trajectory of the Russia-Ukraine war"
    ],
    "score_components": {
      "magnitude": 0.86,
      "recency": 0.654,
      "consensus": 0.897,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.706,
    "summary": "U.S. President Donald Trump is meeting with Russian President Vladimir Putin in Alaska for a summit aimed at addressing the war in Ukraine and European security. The meeting, involving top diplomatic, military, and economic officials from both nations, indicates a broad discussion agenda beyond the conflict. The outcome could significantly influence the direction of the Ukraine war and the overall security landscape in Europe.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 65 tokens",
    "image": {
      "src": "icons/uk.svg",
      "thumbnail": "icons/uk.svg",
      "alt": "uk flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Trump, Putin to Meet in Alaska for Russia-Ukraine Ceasefire Talks",
    "domain": "business",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Fri, 15 Aug 2025 11:57:35 -0400",
    "source": "ABC News",
    "sources": [
      "Forbes",
      "ABC News"
    ],
    "domains": [
      "abcnews.go.com",
      "www.forbes.com"
    ],
    "snippets": [
      "President Donald Trump and Russian President Vladimir Putin head to Alaska on Friday for a high-stakes summit as the U.S. seeks a ceasefire in the Russia-Ukraine war.",
      "The two are expected to hold a joint press conference following the meeting."
    ],
    "image_url": "https://s.abcnews.com/images/US/summit-1-rt-gmh-250815_1755273016936_hpMain_4x3t_384.jpg",
    "titles": [
      "Trump-Putin meeting live updates: Trump departs DC, Russia attacks Ukraine overnight",
      "Trump Departs Washington For ‘High Stakes’ Meeting With Putin (Live Updates)"
    ],
    "score_components": {
      "magnitude": 0.76,
      "recency": 0.996,
      "consensus": 0.682,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.696,
    "summary": "President Donald Trump and Russian President Vladimir Putin are scheduled to meet in Alaska on Friday for a summit aimed at negotiating a ceasefire in the Russia-Ukraine conflict. Following their discussions, they plan to hold a joint press conference.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "1 constructive keywords out of 40 tokens",
    "image": {
      "src": "icons/ukraine.svg",
      "thumbnail": "icons/ukraine.svg",
      "alt": "ukraine flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Justin Herbert to Debut in Preseason Game Against Rams",
    "domain": "sports",
    "source_domain": "www.forbes.com",
    "location": "global",
    "published": "Fri, 15 Aug 2025 10:56:30 -0400",
    "source": "Forbes",
    "sources": [
      "Forbes",
      "Sports Illustrated"
    ],
    "domains": [
      "news.google.com",
      "www.forbes.com"
    ],
    "snippets": [
      "Herbert convinced L.A. coach Jim Harbaugh to let him play so he can feel a live pass rush before the curtain lifts on the regular season.",
      "<a href=\"https://news.google.com/rss/articles/CBMifEFVX3lxTE9OQ0xDeWNJMmFQT09PRC1WQXVicDhSNFh4MnMyUExSSWl6R2tyWjVHRlBnZGRyMlJoUk9FbGVuVkJvQ0NTZjdIRHFBdkxDekhqWUZQblV2cXNHTFdHQkcyR3h3Q3pIODJpTjM0eUNMTy1rNm10cUxtdzVkWmM?oc=5\" target=\"_blank\">Justin Herbert to Play in First-Ever Preseason Game This Wee",
      "<a href=\"https://news.google.com/rss/articles/CBMicEFVX3lxTFAzMUFRb0VfQkQyY1dKajh4eG5ORnh5TWktR1pRTWFIb1lkQ3g2c1ItVUN1X1ZQdV9QVTY4a2VVcjVSZy1qOVY3cU1NRERFM0wtQnd0UjZaQ0d2ZTNyRUlZeHJqMGhOVEZSYmZOazNKVTU?oc=5\" target=\"_blank\">Steelers Name Starting Quarterback for Preseason Game vs. Buccaneers</a>&nbs"
    ],
    "image_url": "https://imageio.forbes.com/specials-images/imageserve/689f3d9e23306ac5cd0783b4/0x0.jpg?width=960",
    "titles": [
      "Justin Herbert Set For First Preseason Action For Los Angeles Chargers",
      "Justin Herbert to Play in First-Ever Preseason Game This Weekend for Chargers - Sports Illustrated",
      "Steelers Name Starting Quarterback for Preseason Game vs. Buccaneers - Sports Illustrated"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.975,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.668,
    "summary": "Justin Herbert is set to appear in his first-ever preseason game when the Los Angeles Chargers face the Los Angeles Rams at SoFi Stadium on Saturday. Coach Jim Harbaugh announced Herbert will play one or two series with the Chargers' offensive starters.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 43 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Jacob Bethell Set to Be Youngest England Men's T20 Captain",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Fri, 15 Aug 2025 15:03:57 GMT",
    "source": "BBC",
    "sources": [
      "Sky Sports",
      "BBC"
    ],
    "domains": [
      "www.bbc.com",
      "www.skysports.com"
    ],
    "snippets": [
      "All-rounder Jacob Bethell, 21, is set to become the youngest man to captain England in an international when he leads an understrength T20 side on a tour of Ireland.",
      "Jacob Bethell is set to become the youngest England men's captain for an international match, named as skipper for their T20 series in Ireland in September."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/b969/live/c6fbb8f0-79e6-11f0-ab39-5f560085c471.jpg",
    "titles": [
      "Bethell to become England's youngest men's captain",
      "Bethell named youngest-ever England captain for T20 series vs Ireland"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.958,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.664,
    "summary": "Jacob Bethell, 21, is poised to make history as the youngest man to captain England's men's cricket team during their T20 series in Ireland. This appointment comes as he leads an understrength side on tour in September, marking a significant milestone in his career and England cricket history.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 50 tokens",
    "image": {
      "src": "icons/uk.svg",
      "thumbnail": "icons/uk.svg",
      "alt": "england flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Trump Meets Putin in Alaska Over Ukraine, Outcome Uncertain",
    "domain": "business",
    "source_domain": "www.ft.com",
    "location": "global",
    "published": "Fri, 15 Aug 2025 11:29:51 GMT",
    "source": "Financial Times",
    "sources": [
      "New York Times",
      "Financial Times"
    ],
    "domains": [
      "www.ft.com",
      "www.nytimes.com"
    ],
    "snippets": [
      "After promising to solve the Ukraine war throughout his campaign, the US president faces a moment of truth in Alaska",
      "Ukrainian refugees in Alaska have mixed feelings about US and Russian leaders’ meeting",
      "Flying to Alaska to meet with President Vladimir V. Putin of Russia, President Trump said he had a “wonderful talk” with the authoritarian leader of Belarus. The comments added new uncertainty about Mr. Trump’s efforts to persuade Russia to end the war in Ukraine."
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Fb79d550d-b576-4fc0-8237-6fa115e4a6b2.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "titles": [
      "Trump the ‘dealmaker’ gears up for Putin summit",
      "‘May God give the right words to President Trump’: Anchorage awaits Putin summit",
      "Live Updates: Trump Praises Putin Ally En Route to High-Stakes Summit"
    ],
    "score_components": {
      "magnitude": 0.76,
      "recency": 0.889,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.664,
    "summary": "President Trump met with Russian President Vladimir Putin in Alaska, aiming to address the Ukraine war, a key promise from his campaign. Despite Trump describing a \"wonderful talk\" with Belarus's leader en route, the meeting has sparked mixed reactions among Ukrainian refugees in Alaska and raised doubts about Trump's ability to persuade Russia to cease hostilities in Ukraine. The outcome of the talks remains uncertain, reflecting the complexity of the situation.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 73 tokens",
    "image": {
      "src": "icons/ukraine.svg",
      "thumbnail": "icons/ukraine.svg",
      "alt": "ukraine flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Zelenskyy Doubts Putin's Sincerity in Negotiations Amid US Meeting",
    "domain": "general",
    "source_domain": "www.dw.com",
    "location": "global",
    "published": "2025-08-15T15:07:00Z",
    "source": "Deutsche Welle",
    "sources": [
      "Deutsche Welle",
      "New York Times"
    ],
    "domains": [
      "www.nytimes.com",
      "www.dw.com"
    ],
    "snippets": [
      "Trump described Putin as a \"smart guy\" while teasing the meeting as \"high stakes!\" Ukrainian President Zelenskyy said a trilateral meeting with Kyiv's involvement must follow. Follow DW for more.",
      "Plus, to appreciate a dancer, watch the hands."
    ],
    "image_url": "",
    "titles": [
      "Trump-Putin talks: Ukraine's fate on the line",
      "Friday Briefing: Ukraine’s Fate"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.979,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.661,
    "summary": "Ukrainian President Volodymyr Zelenskyy expressed skepticism about Russian President Vladimir Putin's readiness to negotiate sincerely. This comes amidst developments involving a meeting between US President Donald Trump and Vladimir Putin. Additionally, an unrelated note highlights the importance of observing a dancer's hands to fully appreciate their performance.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 49 tokens",
    "image": {
      "src": "icons/usa.svg",
      "thumbnail": "icons/usa.svg",
      "alt": "us flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Vectus Global Wins Contract to Address Haiti Gang Violence and Tax Issues",
    "domain": "business",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Fri, 15 Aug 2025 09:02:33 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Fortune",
      "Al Jazeera"
    ],
    "domains": [
      "fortune.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Vectus Global, a security company led by Erik Prince, has a contract to battle Haiti&#039;s gangs and restore tax collection.",
      "At least 1,520 people were killed and more than 600 injured from April to the end of June across Haiti."
    ],
    "image_url": "",
    "titles": [
      "Blackwater founder Erik Prince to send forces to Haiti to fight gangs",
      "Gang violence in Haiti is so bad the government is hiring 200 armed men from Blackwater founder Erik Prince to quell the crisis"
    ],
    "score_components": {
      "magnitude": 0.72,
      "recency": 0.863,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.645,
    "summary": "Vectus Global, headed by Erik Prince, secured a contract to combat gang violence in Haiti and aid in reinstating tax collection. Between April and June, Haiti experienced significant violence, resulting in at least 1,520 deaths and over 600 injuries.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 40 tokens",
    "image": {
      "src": "icons/briefcase.svg",
      "thumbnail": "icons/briefcase.svg",
      "alt": "business",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Castillo's Last-Second Field Goal Clinches 30-27 Win for Blue Bombers",
    "domain": "sports",
    "source_domain": "www.sportsnet.ca",
    "location": "national",
    "published": "Fri, 15 Aug 2025 00:12:24 EDT",
    "source": "Sportsnet",
    "sources": [
      "Sportsnet",
      "Ottawa Citizen"
    ],
    "domains": [
      "www.sportsnet.ca",
      "ottawacitizen.com"
    ],
    "snippets": [
      "<p>Sergio Castillo made up for an earlier miss in a big way when he booted a 47-yard field as time expired to lift the Blue Bombers to a 30-27 victory over the Ottawa Redblacks on Thursday.</p>",
      "WINNIPEG &#8212; Sergio Castillo was grateful he got a second chance. The Blue Bombers kicker made up for an earlier miss in a big way when he booted a 47-yard field goal as time expired to lift Winnipeg to a 30-27 victory over the Ottawa Redblacks on Thursday. Winnipeg was ahead 17-0 after the firs"
    ],
    "image_url": "https://www.sportsnet.ca/wp-content/uploads/2025/08/Collaros.jpg",
    "titles": [
      "Castillo’s game-winning field goal lifts Bombers after late surge from Redblacks",
      "Buzzer-beating field goal lifts Blue Bombers after late surge from Ottawa Redblacks"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.78,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.622,
    "summary": "Sergio Castillo kicked a 47-yard field goal as time expired, securing a 30-27 win for the Winnipeg Blue Bombers over the Ottawa Redblacks. This victory came after Winnipeg had led 17-0 in the first half, and Castillo redeemed himself from an earlier miss in the game.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 49 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "U.S. Government Investment Boosts Intel, Stocks Hit High Since March",
    "domain": "business",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Thu, 14 Aug 2025 22:59:24 GMT",
    "source": "Axios",
    "sources": [
      "CNBC",
      "Axios"
    ],
    "domains": [
      "news.google.com",
      "www.cnbc.com"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMickFVX3lxTFBsVUp1WHhiTUJzeHBMWVJqdTVBWTNZSWdnTTVFSXNVbXJ1dlpleWJXdTgxcnZqa1pib1oxd2VwMkxGbU1ZekxiWU5FQjlWeFktaUQySnhqZk1VWHpKZGkxd3BiZ1F1dzFURzVxMkJRcTZ5Zw?oc=5\" target=\"_blank\">Trump administration in talks to take Intel stake, reports say</a>&nbsp;&",
      "The U.S. government's stake in Intel would help fund factories it's currently building in Ohio, according to the report."
    ],
    "image_url": "",
    "titles": [
      "Trump administration in talks to take Intel stake, reports say - Axios",
      "Intel stock climbs 7% on report Trump administration is considering stake in chipmaker"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.685,
      "consensus": 0.682,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.613,
    "summary": "The U.S. government plans to invest in Intel, supporting the construction of new factories in Ohio. This development positively impacted Intel's stock, which achieved its highest value since March, recovering from a significant drop experienced in late July.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "1 constructive keywords out of 40 tokens",
    "image": {
      "src": "icons/usa.svg",
      "thumbnail": "icons/usa.svg",
      "alt": "u s flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Utah Mammoth's Caleb Desnoyers Out 12 Weeks for Wrist Surgery",
    "domain": "sports",
    "source_domain": "news.google.com",
    "location": "national",
    "published": "Thu, 14 Aug 2025 17:47:31 GMT",
    "source": "NHL",
    "sources": [
      "Sportsnet",
      "NHL"
    ],
    "domains": [
      "news.google.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "<a href=\"https://news.google.com/rss/articles/CBMif0FVX3lxTE9VY1NVRmZwUEVOVDNac0psNXYtYmNOTkt6Y3MyZ3kyVEFtZmRiWjBHOGd1QS16Vi1IRWtmdjJXcVB2emFtRXZXMEpQTFJvQkxQZEs3cXZ1WDNaQUdVblBFSFpCS1lHN0R4S0ZWV0JxZWdxNURFbFA0cTlXdzlwcUU?oc=5\" target=\"_blank\">Desnoyers, Mammoth 2025 1st-round pick, to miss start of",
      "<p>Caleb Desnoyers, the fourth overall selection from the 2025 draft, is set to miss 12 weeks after undergoing wrist surgery, Utah Mammoth general manager Bill Armstrong announced on Thursday.</p>"
    ],
    "image_url": "",
    "titles": [
      "Desnoyers, Mammoth 2025 1st-round pick, to miss start of season after wrist surgery - NHL.com",
      "Mammoth first-round pick Caleb Desnoyers to miss time after wrist surgery"
    ],
    "score_components": {
      "magnitude": 0.7,
      "recency": 0.615,
      "consensus": 0.682,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.589,
    "summary": "Caleb Desnoyers, the 4th overall pick in the 2025 draft, will be out for 12 weeks due to wrist surgery, as confirmed by Utah Mammoth's GM Bill Armstrong. This setback will impact the start of his season, affecting his ability to contribute to the team.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 46 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Air Canada's Offer Highlights Gender Wage Gap Concerns",
    "domain": "business",
    "source_domain": "financialpost.com",
    "location": "national",
    "published": "Fri, 15 Aug 2025 14:27:01 +0000",
    "source": "Financial Post",
    "sources": [
      "Financial Post"
    ],
    "domains": [
      "financialpost.com"
    ],
    "snippets": [
      "TORONTO &#8212; Air Canada wants to reinforce the gender wage gap by forcing Air Canada flight attendants – 70% of whom identify as women – to accept a wage offer less than one-third what Air Canada offered its pilots less than a year ago. “Air Canada’s male-dominated workforce received a significan"
    ],
    "image_url": "",
    "titles": [
      "CUPE: Air Canada is Reinforcing the Gender Wage Gap – And They Want the Government to Help Them Do It"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.965,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.538,
    "summary": "Air Canada has proposed a wage offer to its flight attendants, 70% of whom are women, that is less than one-third of what was offered to its predominantly male pilot workforce less than a year ago. This has raised concerns about reinforcing the gender wage gap within the company.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 50 tokens",
    "image": {
      "src": "icons/canada.svg",
      "thumbnail": "icons/canada.svg",
      "alt": "canada flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Nazem Kadri Hopeful for Team Canada Spot Despite Current Exclusion",
    "domain": "sports",
    "source_domain": "www.sportsnet.ca",
    "location": "national",
    "published": "Fri, 15 Aug 2025 09:37:09 EDT",
    "source": "Sportsnet",
    "sources": [
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca"
    ],
    "snippets": [
      "<p>For Nazem Kadri, pulling on a Team Canada sweater has always been a dream, and he isn&#8217;t letting that hope dim despite not being on Hockey Canada&#8217;s radar.</p>"
    ],
    "image_url": "https://www.sportsnet.ca/wp-content/uploads/2024/02/Naz.jpg",
    "titles": [
      "Kadri still chasing Team Canada dream after being left off Olympics camp roster"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.949,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.528,
    "summary": "Nazem Kadri remains hopeful of representing Team Canada in hockey, despite not currently being considered by Hockey Canada. He continues to pursue his dream of wearing the national team's jersey.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 31 tokens",
    "image": {
      "src": "icons/canada.svg",
      "thumbnail": "icons/canada.svg",
      "alt": "canada flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Weekly Feature to Track U.S. Players in Europe Ahead of World Cup",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Fri, 15 Aug 2025 11:13:33 EST",
    "source": "ESPN",
    "sources": [
      "ESPN"
    ],
    "domains": [
      "www.espn.com"
    ],
    "snippets": [
      "The European club season is upon us, which is a great time to start monitoring the U.S. player pool ahead of the men's World Cup. In a new weekly feature, we'll assess their progress on the road to next summer."
    ],
    "image_url": "",
    "titles": [
      "USMNT countdown to the World Cup: Sargent making early claim to be Pochettino's No. 9"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.981,
      "consensus": 0.393,
      "constructiveness": 0.131,
      "proximity": 0.75
    },
    "score": 0.523,
    "summary": "As the European club season begins, attention turns to monitoring U.S. players for the upcoming men's World Cup. A new weekly feature will track their progress leading up to the tournament next summer. This initiative aims to keep tabs on American players competing in Europe as they strive to secure spots on the national team for the World Cup.",
    "constructiveness_score": 0.131,
    "constructiveness_reason": "2 constructive keywords out of 61 tokens",
    "image": {
      "src": "icons/usa.svg",
      "thumbnail": "icons/usa.svg",
      "alt": "u s flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "WNBA Expands to Canada with Toronto Tempo Team",
    "domain": "sports",
    "source_domain": "www.sportsnet.ca",
    "location": "national",
    "published": "Fri, 15 Aug 2025 08:08:02 EDT",
    "source": "Sportsnet",
    "sources": [
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca"
    ],
    "snippets": [
      "<p>In less than a year, the WNBA will no longer be a one-country league. As the league holds its first regular-season game outside the U.S., Sarah Maat takes a look at the excitement building around the Toronto Tempo.</p>"
    ],
    "image_url": "https://www.sportsnet.ca/wp-content/uploads/2025/08/CP174680092.jpg",
    "titles": [
      "How the Toronto Tempo are working to become Canada’s team"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.92,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.522,
    "summary": "The WNBA is set to expand beyond the United States for the first time, with the introduction of the Toronto Tempo. This expansion will occur within the next year, marking a significant milestone as the league holds its first regular-season game in Toronto, Canada. This move has generated excitement around the new team and the league's growth.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 59 tokens",
    "image": {
      "src": "icons/canada.svg",
      "thumbnail": "icons/canada.svg",
      "alt": "canada flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Durant, Davis Set for Emotional Returns to Former Teams in November Games",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Fri, 15 Aug 2025 11:22:57 EST",
    "source": "ESPN",
    "sources": [
      "ESPN"
    ],
    "domains": [
      "www.espn.com"
    ],
    "snippets": [
      "The Rockets' Kevin Durant will make his return to Phoenix on Nov. 24, while the Mavericks' Anthony Davis will return to Los Angeles to play the Lakers on Nov. 28."
    ],
    "image_url": "",
    "titles": [
      "Hello again: Durant, Davis returns mark NBA slate"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.984,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.51,
    "summary": "Kevin Durant of the Houston Rockets is set to return to Phoenix for a game on November 24. Similarly, Anthony Davis from the Dallas Mavericks will play against the Lakers in Los Angeles on November 28. These scheduled games mark significant returns for both players to their former team cities.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 50 tokens",
    "image": {
      "src": "icons/trophy.svg",
      "thumbnail": "icons/trophy.svg",
      "alt": "sports",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "New Nanobody Tech Targets, Destroys Lung Cancer Cells",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Fri, 15 Aug 2025 09:49:04 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "phys.org"
    ],
    "snippets": [
      "A research team has developed a nanobody-based technology that can precisely identify and attack only lung cancer cells, opening new possibilities for cancer therapy."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/breakthrough-lung-canc.jpg",
    "titles": [
      "Precision nanobody acts as 'drone strike' against lung cancer cells, minimizing side effects"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.953,
      "consensus": 0.393,
      "constructiveness": 0.222,
      "proximity": 0.5
    },
    "score": 0.501,
    "summary": "A research team has created a nanobody technology that targets and destroys lung cancer cells specifically, offering potential advancements in cancer treatment. This innovation could lead to more effective and precise therapies for lung cancer patients.",
    "constructiveness_score": 0.222,
    "constructiveness_reason": "2 constructive keywords out of 36 tokens",
    "image": {
      "src": "icons/beaker.svg",
      "thumbnail": "icons/beaker.svg",
      "alt": "science",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Ancient Lakes in Tibesti Mountains Existed Over 5,000 Years, Study Finds",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Fri, 15 Aug 2025 09:34:04 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "phys.org"
    ],
    "snippets": [
      "An interdisciplinary research team led by scientists from Freie Universität Berlin and the Max Planck Institute for Meteorology has shown how deep lakes formed more than 9,500 years ago in the craters of the Tibesti Mountains and existed there for more than 5,000 years."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/study-explains-mystery.jpg",
    "titles": [
      "Study explains mystery of former crater lakes in the highest mountain range of the Sahara"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.948,
      "consensus": 0.393,
      "constructiveness": 0.078,
      "proximity": 0.5
    },
    "score": 0.493,
    "summary": "A research team from Freie Universität Berlin and the Max Planck Institute for Meteorology discovered that deep lakes formed in the craters of the Tibesti Mountains over 9,500 years ago and remained for more than 5,000 years. This interdisciplinary study sheds light on ancient climatic conditions in the region.",
    "constructiveness_score": 0.078,
    "constructiveness_reason": "1 constructive keywords out of 51 tokens",
    "image": {
      "src": "icons/beaker.svg",
      "thumbnail": "icons/beaker.svg",
      "alt": "science",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Kyiv Deploys US-Made Patriot System Against Russian Missiles",
    "domain": "business",
    "source_domain": "www.businessinsider.com",
    "location": "global",
    "published": "2025-08-15T14:46:07Z",
    "source": "Business Insider",
    "sources": [
      "Business Insider"
    ],
    "domains": [
      "www.businessinsider.com"
    ],
    "snippets": [
      "The US-made Patriot air defense system is Kyiv's best tool for intercepting Russian ballistic missiles."
    ],
    "image_url": "https://i.insider.com/689f3e99194a2d49b8aea155?format=jpeg",
    "titles": [
      "Russia improved its missiles. Now, Ukraine's Patriots are struggling to consistently shoot them down, defense intel says."
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.972,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.49,
    "summary": "Kyiv relies on the US-made Patriot air defense system to intercept Russian ballistic missiles effectively. The system serves as a crucial tool in Ukraine's defense strategy against potential missile threats.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 32 tokens",
    "image": {
      "src": "icons/usa.svg",
      "thumbnail": "icons/usa.svg",
      "alt": "us flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Trump Federalizes DC Police, Deploys National Guard",
    "domain": "business",
    "source_domain": "www.cnbc.com",
    "location": "national",
    "published": "Fri, 15 Aug 2025 15:37:07 GMT",
    "source": "CNBC",
    "sources": [
      "CNBC"
    ],
    "domains": [
      "www.cnbc.com"
    ],
    "snippets": [
      "Trump on Monday federalized the Washington, D.C., police department and ordered the deployment of National Guard troops in the capital city."
    ],
    "image_url": "",
    "titles": [
      "Judge sets hearing Friday on lawsuit challenging Trump takeover of DC police force"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.969,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.489,
    "summary": "On Monday, President Trump issued orders to federalize the Washington, D.C., police department and to deploy National Guard troops in the capital city. This action places the local police under federal control and introduces military presence in response to unspecified circumstances.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 42 tokens",
    "image": {
      "src": "icons/briefcase.svg",
      "thumbnail": "icons/briefcase.svg",
      "alt": "business",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Chinese Scientists Innovate Crop Pollination, Aim for Resilience",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Fri, 15 Aug 2025 10:34:28 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "phys.org"
    ],
    "snippets": [
      "For millennia, developing resilient crops relied on pollination by nature or humans—making the process long and often costly. Now, scientists from the Institute of Genetics and Developmental Biology (IGDB) of the Chinese Academy of Sciences have reimagined the pollination process by developing a new"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/croprobot-co-design-si.jpg",
    "titles": [
      "Flowers redesigned for robots: Gene editing and AI promise faster crop breeding"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.968,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.489,
    "summary": "Scientists at the Institute of Genetics and Developmental Biology, part of the Chinese Academy of Sciences, have innovated the traditional crop pollination process. This new method aims to make developing resilient crops faster and less expensive than the millennia-old techniques reliant on natural or human-assisted pollination.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 48 tokens",
    "image": {
      "src": "icons/china.svg",
      "thumbnail": "icons/china.svg",
      "alt": "chinese flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Ultrahuman acquires viO HealthTech to launch enhanced cycle and ovulation tracking",
    "domain": "technology",
    "source_domain": "techcrunch.com",
    "location": "global",
    "published": "Fri, 15 Aug 2025 16:00:00 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com"
    ],
    "snippets": [
      "Cycle and Ovulation Pro is available starting Friday as a premium PowerPlug in the Ultrahuman app for $3.99 per month or $39.99 per year for users in the U.S., U.K., EU, Australia, and Canada."
    ],
    "image_url": "",
    "titles": [
      "Ultrahuman acquires viO HealthTech to launch enhanced cycle and ovulation tracking"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.997,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.488,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 11 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Rare Subtropical Wood Stork Spotted in Wisconsin",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Fri, 15 Aug 2025 11:53:49 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "phys.org"
    ],
    "snippets": [
      "A very rare and apparently very confused subtropical wood stork somehow found its way to the wilds of Wisconsin."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/wood-stork.jpg",
    "titles": [
      "Deer hunter discovers rare subtropical wood stork in the wilds of Wisconsin"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.995,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.487,
    "summary": "A subtropical wood stork, typically not found in the region, was unexpectedly spotted in Wisconsin. This rare occurrence highlights the unusual presence of a species far from its normal habitat, emphasizing the bird's apparent confusion or displacement.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 38 tokens",
    "image": {
      "src": "icons/beaker.svg",
      "thumbnail": "icons/beaker.svg",
      "alt": "science",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Bumblebee Catfish Observed Climbing Waterfalls in Brazil for First Time",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Fri, 15 Aug 2025 11:50:01 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "phys.org"
    ],
    "snippets": [
      "Nature often puts on incredible displays. A recent example caught on camera shows thousands of bumblebee catfish (Rhyacoglanis paranensis) climbing waterfalls in southern Brazil. This is the first time the species has been observed in such a large group and climbing, according to a study published i"
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/going-up-in-the-world.jpg",
    "titles": [
      "Moving up in the world: Rare catfish species filmed climbing waterfalls"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.994,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.487,
    "summary": "For the first time, thousands of bumblebee catfish were observed climbing waterfalls in southern Brazil, as captured in a recent study. This remarkable behavior, never before documented for this species (Rhyacoglanis paranensis), highlights an extraordinary natural phenomenon and has been published in a scientific study, marking a significant observation in the species' behavior.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 53 tokens",
    "image": {
      "src": "icons/brazil.svg",
      "thumbnail": "icons/brazil.svg",
      "alt": "brazil flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Apatite: Key Mineral for Healthy Teeth and Bones",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Fri, 15 Aug 2025 11:34:25 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "phys.org"
    ],
    "snippets": [
      "Apatite. Rhymes with appetite, and fittingly, plays a vital role in the very act of eating. Found in teeth and bones, apatite provides the structural strength behind every bite and step we take."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/apatite-the-mineral-wi.jpg",
    "titles": [
      "Apatite: The mineral with bite and insight"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.988,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.486,
    "summary": "Apatite, a mineral that shares a phonetic resemblance with \"appetite,\" is crucial for human health as it forms the structural foundation of teeth and bones. This mineral enables the essential functions of eating and movement by providing the necessary strength for biting and walking.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 44 tokens",
    "image": {
      "src": "icons/beaker.svg",
      "thumbnail": "icons/beaker.svg",
      "alt": "science",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "ChatGPT’s mobile app has generated $2B to date, earns $2.91 per install",
    "domain": "technology",
    "source_domain": "techcrunch.com",
    "location": "global",
    "published": "Fri, 15 Aug 2025 15:36:28 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com"
    ],
    "snippets": [
      "ChatGPT is topping its rivals on mobile with $2B in global consumer spending to date."
    ],
    "image_url": "",
    "titles": [
      "ChatGPT’s mobile app has generated $2B to date, earns $2.91 per install"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.989,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.486,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 14 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Elon Musk Struggles to Improve Brand Reputation, Insiders Say",
    "domain": "business",
    "source_domain": "financialpost.com",
    "location": "national",
    "published": "Fri, 15 Aug 2025 15:00:36 +0000",
    "source": "Financial Post",
    "sources": [
      "Financial Post"
    ],
    "domains": [
      "financialpost.com"
    ],
    "snippets": [
      "Industry insiders say Elon Musk could be in 'a no-win' situation in terms of redeeming the brand"
    ],
    "image_url": "",
    "titles": [
      "Tesla continues to lose customers in Canada. Can it ever bounce back?"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.977,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.484,
    "summary": "Elon Musk faces a challenging situation regarding improving his brand's reputation, according to industry insiders. They suggest that Musk's efforts to enhance his brand image might not yield positive results, putting him in a difficult position with limited options for success.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 43 tokens",
    "image": {
      "src": "icons/briefcase.svg",
      "thumbnail": "icons/briefcase.svg",
      "alt": "business",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "I tested a bunch of Switch 2 screen protectors, and these are the best",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-08-15T11:10:59-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "www.theverge.com"
    ],
    "snippets": [
      "A glass screen protector is one of a few essential accessories that every Switch 2 owner should make, along with buying a protective case for the console. In fact, it should be a priority to stick one onto the console’s screen as soon as possible to avoid accidental scratches.  I’ve been installing "
    ],
    "image_url": "",
    "titles": [
      "I tested a bunch of Switch 2 screen protectors, and these are the best"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.98,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.484,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 14 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "The best deals on MacBooks right now",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-08-15T11:08:22-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "www.theverge.com"
    ],
    "snippets": [
      "Apple currently sells MacBooks equipped with its own M-series chips in a wide range of sizes and price points. It discontinued the M1 MacBook Air to make room for newer models, but some retailers are still selling the 2020 laptop starting at $599 ($50 off) at Walmart — a far cry from the $2,499 star",
      "The Nintendo Switch 2 is here, but we’re not going to forget about the original Switch. We’ve still got love for the console and its many millions of owners, so we’ll keep recommending the best controllers for the Switch right here. If you’re considering getting a Switch 2 in the future, all of the "
    ],
    "image_url": "",
    "titles": [
      "The best deals on MacBooks right now",
      "The best Nintendo Switch controllers to buy right now"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.979,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.484,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 7 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "For Legends: Z-A’s battle system, I rewired the Pokémon part of my brain",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-08-15T09:00:00-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "www.theverge.com"
    ],
    "snippets": [
      "Even if you've never played a Pok&#233;mon game before, you can probably figure out how the type chart works. Fire types are weak to water types, water is weak to grass, and grass is weak to fire. Type matchups are foundational to Pok&#233;mon battles, far before you get into the weeds of stats and "
    ],
    "image_url": "",
    "titles": [
      "For Legends: Z-A’s battle system, I rewired the Pokémon part of my brain"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.937,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.483,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 15 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Louisiana attorney general sues Roblox",
    "domain": "technology",
    "source_domain": "techcrunch.com",
    "location": "global",
    "published": "Fri, 15 Aug 2025 14:43:20 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com"
    ],
    "snippets": [
      "The lawsuit points to several sexually explicit experiences that were on the platform, including “Escape to Epstein Island,” “Diddy Party,” and “Public Bathroom Simulator Vibe.\""
    ],
    "image_url": "",
    "titles": [
      "Louisiana attorney general sues Roblox"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.971,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.482,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 5 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "GPT-5 failed the hype test",
    "domain": "technology",
    "source_domain": "www.theverge.com",
    "location": "global",
    "published": "2025-08-15T08:47:40-04:00",
    "source": "The Verge",
    "sources": [
      "The Verge"
    ],
    "domains": [
      "www.theverge.com"
    ],
    "snippets": [
      "Last week, on GPT-5 launch day, AI hype was at an all-time high. In a press briefing beforehand, OpenAI CEO Sam Altman said GPT-5 is \"something that I just don't wanna ever have to go back from,\" a milestone akin to the first iPhone with a Retina display. The night before the announcement livestream"
    ],
    "image_url": "",
    "titles": [
      "GPT-5 failed the hype test"
    ],
    "score_components": {
      "magnitude": 0.42,
      "recency": 0.933,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.482,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 6 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "Study Reveals How Radiation Affects Graphite in Nuclear Reactors",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Fri, 15 Aug 2025 10:07:05 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "phys.org"
    ],
    "snippets": [
      "Graphite is a key structural component in some of the world's oldest nuclear reactors and many of the next-generation designs being built today. But it also condenses and swells in response to radiation—and the mechanism behind those changes has proven difficult to study."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2025/study-sheds-light-on-g.jpg",
    "titles": [
      "Graphite's pore size distribution offers new clues to predicting nuclear reactor material failure"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.959,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.48,
    "summary": "Graphite, crucial for both old and next-gen nuclear reactors, undergoes condensation and swelling due to radiation, a process that has been challenging to understand. This phenomenon affects the structural integrity of reactors, making its study vital for safety and efficiency in nuclear energy production.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 45 tokens",
    "image": {
      "src": "icons/beaker.svg",
      "thumbnail": "icons/beaker.svg",
      "alt": "science",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  },
  {
    "title": "80th Anniversary of Japan's Surrender, Ending WWII for Australia",
    "domain": "science",
    "source_domain": "phys.org",
    "location": "global",
    "published": "Fri, 15 Aug 2025 09:46:18 EDT",
    "source": "Phys.org",
    "sources": [
      "Phys.org"
    ],
    "domains": [
      "phys.org"
    ],
    "snippets": [
      "Eighty years ago this week, Japan surrendered after nearly four years of war in the Asia-Pacific. For Australia, this meant the end of not only the war in the Pacific, but also the Second World War that had begun six years earlier, in September 1939."
    ],
    "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2020/ww2.jpg",
    "titles": [
      "New research shows WWII dominates Australians' knowledge of military history. But big gaps remain"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.952,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.479,
    "summary": "This week marks the 80th anniversary of Japan's surrender, concluding nearly four years of conflict in the Asia-Pacific and ending the Second World War for Australia. The war, which began in September 1939, spanned six years, significantly impacting the global landscape.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 43 tokens",
    "image": {
      "src": "icons/japan.svg",
      "thumbnail": "icons/japan.svg",
      "alt": "japan flag",
      "credit": "Twemoji",
      "license": "CC-BY-4.0",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": true
    }
  },
  {
    "title": "Meet the first batch of VCs set to judge Startup Battlefield 200 at TechCrunch Disrupt 2025",
    "domain": "technology",
    "source_domain": "techcrunch.com",
    "location": "global",
    "published": "Fri, 15 Aug 2025 14:00:00 +0000",
    "source": "TechCrunch",
    "sources": [
      "TechCrunch"
    ],
    "domains": [
      "techcrunch.com"
    ],
    "snippets": [
      "Startup Battlefield 200 is the crown jewel of TechCrunch Disrupt. From thousands of applicants, only the top 20 will take the Stage at Disrupt 2025 (October 27-29, San Francisco) to pitch their vision to panels of top-tier VCs in front of a live audience. Every contender is chasing game-changing imp"
    ],
    "image_url": "",
    "titles": [
      "Meet the first batch of VCs set to judge Startup Battlefield 200 at TechCrunch Disrupt 2025"
    ],
    "score_components": {
      "magnitude": 0.4,
      "recency": 0.956,
      "consensus": 0.393,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.479,
    "constructiveness_score": 0.0,
    "constructiveness_reason": "0 constructive keywords out of 16 tokens",
    "image": {
      "src": "icons/light-bulb.svg",
      "thumbnail": "icons/light-bulb.svg",
      "alt": "technology",
      "credit": "Heroicons",
      "license": "MIT",
      "provider": "local",
      "source": "local",
      "inlineRight": true,
      "noDesaturate": false
    }
  }
]