[
  {
    "title": "Ukrainians doubt potential of Trump’s peace plan amid deadly Russia attacks",
    "domain": "general",
    "location": "global",
    "published": "Mon, 07 Apr 2025 12:45:21 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Ukrainian servicemen and civilian survivors of deadly attacks say a ceasefire seems a distant prospect."
    ],
    "image_url": "",
    "summary": "Ukrainian servicemen and civilians affected by deadly attacks express skepticism about the likelihood of a ceasefire, indicating ongoing violence and conflict in the region. Their experiences suggest that peace negotiations or a halt in hostilities are not currently anticipated.",
    "titles": [
      "Ukrainians doubt potential of Trump’s peace plan amid deadly Russia attacks"
    ],
    "score_components": {
      "magnitude": 0.34,
      "recency": 0.972,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.495,
    "normalized_score": 10.0
  },
  {
    "title": "Palestinian-American boy killed by Israeli forces in West Bank",
    "domain": "general",
    "location": "global",
    "published": "Mon, 07 Apr 2025 10:56:21 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Israeli military says its troops shot Omar Rabea, 14, and two other boys because they were throwing stones towards a highway."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/804f/live/0cd0b800-1397-11f0-b054-11b99aeb4b3e.jpg",
    "summary": "The Israeli military reported that its troops shot 14-year-old Omar Rabea and two other boys for throwing stones towards a highway.",
    "titles": [
      "Palestinian-American boy killed by Israeli forces in West Bank"
    ],
    "score_components": {
      "magnitude": 0.32,
      "recency": 0.946,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.48250000000000004,
    "normalized_score": 9.38
  },
  {
    "title": "Dominican Republic boosts security on border with crisis-ridden Haiti",
    "domain": "general",
    "location": "global",
    "published": "Mon, 07 Apr 2025 09:09:55 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Caribbean island nation moving to extend border wall and eject migrants as violence and anarchy plague the neighbour."
    ],
    "image_url": "",
    "summary": "The Caribbean island nation has announced plans to extend its border wall and expel migrants in response to escalating violence and disorder in the neighboring country. This decision is aimed at enhancing security and managing the influx of people fleeing the unstable conditions next door.",
    "titles": [
      "Dominican Republic boosts security on border with crisis-ridden Haiti"
    ],
    "score_components": {
      "magnitude": 0.32,
      "recency": 0.922,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.47650000000000003,
    "normalized_score": 9.09
  },
  {
    "title": "Hong Kong stock market plunges most since ’97 crisis amid tariffs panic",
    "domain": "general",
    "location": "global",
    "published": "Mon, 07 Apr 2025 08:39:54 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Benchmark Hang Seng Index plummets as much as 13.74 percent in horror day for Asia&#039;s markets."
    ],
    "image_url": "",
    "summary": "The Benchmark Hang Seng Index experienced a significant drop, plummeting up to 13.74 percent in a single day, marking a substantial downturn in Asia's financial markets.",
    "titles": [
      "Hong Kong stock market plunges most since ’97 crisis amid tariffs panic"
    ],
    "score_components": {
      "magnitude": 0.32,
      "recency": 0.915,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.47475,
    "normalized_score": 9.0
  },
  {
    "title": "Ukraine to discuss minerals deal with US as Russia drags feet on ceasefire",
    "domain": "general",
    "location": "global",
    "published": "Mon, 07 Apr 2025 13:05:35 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Ukraine to send team to discuss the latest US proposal as Russia cites &#039;unanswered questions&#039; in ceasefire plan."
    ],
    "image_url": "",
    "summary": "Ukraine is dispatching a delegation to discuss the latest ceasefire proposal from the United States, while Russia has raised concerns over \"unanswered questions\" in the plan. This development indicates ongoing diplomatic efforts to address the conflict, though specific details of the proposal and concerns remain undisclosed.",
    "titles": [
      "Ukraine to discuss minerals deal with US as Russia drags feet on ceasefire"
    ],
    "score_components": {
      "magnitude": 0.24,
      "recency": 0.976,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.46599999999999997,
    "normalized_score": 8.57
  },
  {
    "title": "Alex Ovechkin breaks NHL goals record: How the Capitals star's illustrious career compares to Wayne Gretzky's",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 07 Apr 2025 14:36:39 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Ovechkin surpassed Gretzky's all-time goals record in Sunday's loss to the Islanders"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/04/07/df94fb87-7943-49ec-aa83-5d04ad16c840/gettyimages-2208858170-1-1.jpg",
    "summary": "In a recent NHL game, despite the Washington Capitals' loss to the New York Islanders, Alex Ovechkin achieved a significant milestone by breaking Wayne Gretzky's all-time goals record. This achievement cements Ovechkin's place in hockey history as the leading goal scorer.",
    "titles": [
      "Alex Ovechkin breaks NHL goals record: How the Capitals star's illustrious career compares to Wayne Gretzky's"
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.997,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.3792500000000001,
    "normalized_score": 4.31
  },
  {
    "title": "World sport-starved Moscow cheers Ovechkin NHL record",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 07 Apr 2025 14:25:30 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Russian engineer Leonid Alexeyev has been waiting for &quot;many years&quot; for his countryman Alexander Ovechkin to make ice hockey history, patiently keeping track of his goals -- until the towering Muscovite finally did it this weekend.We waited for this for many years,&quot; Alexeyev told AFP on the streets of Moscow."
    ],
    "image_url": "",
    "summary": "Russian engineer Leonid Alexeyev and many others have eagerly anticipated Alexander Ovechkin's historic achievement in ice hockey. After years of tracking his goals, their wait ended this weekend when the Muscovite athlete finally made history. Alexeyev expressed his long-term excitement and satisfaction to AFP in Moscow.",
    "titles": [
      "World sport-starved Moscow cheers Ovechkin NHL record"
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.995,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.37875000000000003,
    "normalized_score": 4.28
  },
  {
    "title": "Southampton relegated from PL in record time",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 7 Apr 2025 10:08:07 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Southampton's relegation from the Premier League was confirmed on Sunday, as they suffered a 3-1 defeat to Tottenham Hotspur."
    ],
    "image_url": "",
    "summary": "Southampton was relegated from the Premier League following a 3-1 loss to Tottenham Hotspur on Sunday. This defeat confirmed their departure from the top tier of English football.",
    "titles": [
      "Southampton relegated from PL in record time"
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.935,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.36375,
    "normalized_score": 3.54
  },
  {
    "title": "LeBron, MJ top reactions to Ovi breaking Gretzky's record",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 7 Apr 2025 07:42:22 EST",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Sports legends took to social media to congratulate Ovi on his historic moment."
    ],
    "image_url": "",
    "summary": "Sports legends congratulated Ovi on social media for achieving a historic milestone. The universal acclaim across platforms highlights the significance of his accomplishment in the sports world.",
    "titles": [
      "LeBron, MJ top reactions to Ovi breaking Gretzky's record"
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.902,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.35550000000000004,
    "normalized_score": 3.14
  },
  {
    "title": "It's so easy to be happy for Paige Bueckers",
    "domain": "sports",
    "location": "national",
    "published": "Mon, 07 Apr 2025 14:33:43 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "We don't know Paige Bueckers, but we were all rooting for her."
    ],
    "image_url": "",
    "summary": "Paige Bueckers, a figure whose specifics are not detailed, garnered widespread support from the public, despite many not personally knowing her. The outcome or current status of the situation involving Bueckers was not provided, indicating a focus on the general sentiment of support she received.",
    "titles": [
      "It's so easy to be happy for Paige Bueckers"
    ],
    "score_components": {
      "magnitude": 0.12,
      "recency": 0.997,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.35525000000000007,
    "normalized_score": 3.12
  },
  {
    "title": "US tariffs create ‘urgent’ problem for Germany, says Merz",
    "domain": "business",
    "location": "global",
    "published": "Mon, 07 Apr 2025 11:46:55 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Chancellor-in-waiting comments after Donald Trump announced 20% levies on all European exports"
    ],
    "image_url": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Fe20124d7-d17c-46e1-8d34-1f5dd9fa5c0f.jpg?source=next-home-page&dpr=2&width=580&fit=scale-down",
    "summary": "After Donald Trump announced a 20% tariff on all European exports, the Chancellor-in-waiting responded to the decision. The specifics of the response were not detailed in the provided content. This move by Trump marks a significant escalation in trade tensions between the US and Europe.",
    "titles": [
      "US tariffs create ‘urgent’ problem for Germany, says Merz"
    ],
    "score_components": {
      "magnitude": 0.32,
      "recency": 0.958,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.48550000000000004,
    "normalized_score": 9.53
  },
  {
    "title": "Even Trump's Biggest Fans on Wall Street Aren't Loving His Tariffs",
    "domain": "business",
    "location": "global",
    "published": "Mon, 07 Apr 2025 14:42:46 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "<figure><img alt=\"Jared Siskin / Patrick McMullan via Getty Images Bill Ackman speaks at The 2024 Pershing Square Foundation Prize Dinner at the Park Avenue Armory at the Park Avenue Armory on June 17, 2024 in New York City.\" src=\"https://www.investopedia.com/thmb/2wv0Vg8d6uoCPYA2trZTe2QoaNg=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2158830162-973d9ae969684f90a75e8f5f731bbf31.jpg\" title=\"Bill Ackman speaks at The 2024 Pershing Square Foundation Prize Dinner.\" /><figcaption><i><p>Jared Siskin / Patrick McMullan via Getty Images</p> Bill Ackman speaks at The 2024 Pershing Square Foundation Prize Dinner at the Park Avenue Armory at the Park Avenue Armory on June 17, 2024 in New York City.</i></figcaption></figure><p>Even one of President Donald Trump's most vocal backers is wary of his tariff plan. </p><p><a href=\"https://www.investopedia.com/articles/investing/042015/10-most-famous-hedge-fund-managers.asp#toc-bill-ackman\">Bill Ackman</a>, the billionaire CEO of hedge fund Pershing Square and one of Trump's most fervent supporters on Wall Street, on Sunday criticized the president's \"massive and disproportionate tariffs\" on key U.S. trading partners and urged Trump to call a \"90-day time out\" to allow for negotiations.<span class=\"ql-inline-citation\"></span> </p><p>\"Business is a confidence game. The president is losing the confidence of business leaders around the globe,\" Ackman posted to X on Sunday evening. \"The consequences for our country and the millions of our citizens who have supported the president—in particular low-income consumers who are already under a huge amount of economic stress—are going to be severely negative. This is not what we voted for.\" </p><h2>'Economic Nuclear War'</h2><p>Ackman equated Trump's reciprocal tariffs—including a 20% levy on imports from the <a href=\"https://www.investopedia.com/terms/e/europeanunion.asp\">European Union</a>, 46% on Vietnamese goods, and 24% on Japanese products—with declaring \"economic nuclear war on every country in the world,\" and warned the move would obstruct investment in the U.S. and cause lasting damage to America’s reputation on the world stage. </p><p>In separate posts Sunday evening and Monday morning, Ackman placed blame for the tariff plans squarely on the president's advisors. \"I just figured out why &#64;howardlutnick is indifferent to the stock market and the economy crashing,\" he wrote late Sunday, referring to Commerce Secretary and former Cantor Fitzgerald CEO Howard Lutnick. \"He and Cantor are long bonds. He profits when our economy implodes,\" Ackman wrote.<span class=\"ql-inline-citation\"></span> </p><p>National Economic Council Director Kevin Hassett criticized Ackman on <em>Fox News</em> on Monday morning, saying, \"I would urge everyone, especially Bill, to ease off the rhetoric a little bit. ... The idea that it's gonna be a 'nuclear winter' or something like that is completely irresponsible rhetoric.\"<span class=\"ql-inline-citation\"></span></p><h2>Ackman Softens Lutnick Comments Monday</h2><p>Ackman softened his comments on Lutnick Monday morning, writing that \"It was unfair of me to lash out at &#64;howardlutnick. I don't think he is pursuing his self interest… I am just frustrated watching what I believe to be a major policy error occur after our country and the president have been making huge economic progress that is now at risk due to the tariffs.\"<span class=\"ql-inline-citation\"></span></p><p>But Ackman continued to push back on the tariff plans. \"The formula used by the administration to calculate tariffs made other nations’ tariffs appear four times larger than they actually are,\" he wrote Monday morning, citing research from the American Enterprise Institute, a right-leaning think tank. \"The President's advisors need to acknowledge their error before April 9th and make a course correction before the President makes a big mistake based on bad math.\"<span class=\"ql-inline-citation\"></span></p>"
    ],
    "image_url": "https://www.investopedia.com/thmb/2wv0Vg8d6uoCPYA2trZTe2QoaNg=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2158830162-973d9ae969684f90a75e8f5f731bbf31.jpg",
    "summary": "Billionaire hedge fund CEO Bill Ackman, a prominent supporter of President Donald Trump, publicly criticized the president's tariff plans, describing them as \"massive and disproportionate\" and akin to declaring \"economic nuclear war\" on global trading partners. Ackman urged for a 90-day negotiation period and highlighted the negative impact on business confidence and low-income consumers in the U.S. He initially blamed Commerce Secretary Howard Lutnick for the tariff strategy, suggesting a conflict of interest, but later softened his stance. Ackman also called out the administration's tariff c",
    "titles": [
      "Even Trump's Biggest Fans on Wall Street Aren't Loving His Tariffs"
    ],
    "score_components": {
      "magnitude": 0.24,
      "recency": 0.999,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.47175,
    "normalized_score": 8.86
  },
  {
    "title": "Goldman Sachs Cuts GDP Estimate, Raises Risk of Recession Amid Tariff Rout",
    "domain": "business",
    "location": "global",
    "published": "Mon, 07 Apr 2025 12:48:30 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "<figure><img alt=\"Brendan Smialowski / AFP via Getty Images President Donald Trump announces tariffs at the White House on April 2, 2025\" src=\"https://www.investopedia.com/thmb/JsnfqkULMUNLoclWMvNmpGylRo8=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2207584694-e39d1d4fcc8542b1a340a3ccd90a7afe.jpg\" title=\"Donald Trump speaks at a podium while holding a chart of countries and tariff numbers.\" /><figcaption><i><p>Brendan Smialowski / AFP via Getty Images</p> President Donald Trump announces tariffs at the White House on April 2, 2025</i></figcaption></figure><br /><h3>Key Takeaways</h3><ul><li>Goldman Sachs analysts cut their projections for GDP growth, and said a recession could be more likely because of the Trump administration's tariffs.</li><li>They now put a 45% chance on a recession in the next 12 months, with its likelihood set to rise if most or all of the tariffs stay in place.</li><li>The analysts said they have seen financial conditions worsen, foreign consumers boycott American goods, and a \"spike in policy uncertainty.\"</li></ul><br /><br /><p>Goldman Sachs analysts told clients Sunday they are cutting their forecast for <a href=\"https://www.investopedia.com/terms/g/gdp.asp\">gross domestic product (GDP)</a> growth in 2025, and raising their recession risk forecast in response to the Trump administration's new tariffs.<span class=\"ql-inline-citation\"></span></p><p>The analysts now put a 45% chance on a recession coming in the next year, up from 35% previously, due to a \"sharp tightening in financial conditions, foreign consumer boycotts, and a continued spike in policy uncertainty that is likely to depress capital spending by more than we had previously assumed.\"</p><p>However, that 45% is predicated on the effective tariff rate rising by 15 points, less than it's currently expected to rise if the Trump administration's <a href=\"https://www.investopedia.com/tariff-tracker-where-do-president-trump-trade-proposals-stand-11702803\">tariffs announced last week</a> go into effect on Wednesday. If most or all of those tariffs are enacted and the effective tariff rate rises by roughly 20 points, the analysts said the likelihood of a recession could rise above 50%.</p><p>The Goldman analysts lowered their GDP growth forecasts to 0.5% for the fourth quarter and 1.3% for 2025, down from 1% and 1.5%, respectively.</p><p>The analysts said they now expect the Federal Reserve to make three consecutive quarter-point rate cuts starting in June, a month earlier than they previously expected cuts to start. In a recession, they expect about 2 points in total cuts over the next year.</p><p>The major indexes were down sharply Monday morning, extending last week's tariff-fueled selloff after the stock market had one of its <a href=\"https://www.investopedia.com/stocks-just-had-one-of-their-worst-weeks-of-this-century-update-11709694\">worst weeks</a> in years. (Read <em>Investopedia's</em> live coverage of <a href=\"https://www.investopedia.com/dow-jones-today-04072025-11710097\">today's market action here</a>.)</p><p><em>UPDATE—April 7, 2025: This article has been updated since it was first published to reflect more recent share price values. </em></p>"
    ],
    "image_url": "https://www.investopedia.com/thmb/JsnfqkULMUNLoclWMvNmpGylRo8=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2207584694-e39d1d4fcc8542b1a340a3ccd90a7afe.jpg",
    "summary": "In response to the Trump administration's new tariffs, Goldman Sachs analysts have revised their economic forecasts for 2025, increasing the likelihood of a recession to 45%, up from 35%. This probability could surpass 50% if the tariffs, which are expected to raise the effective tariff rate by about 20 points, are fully implemented. The analysts also lowered GDP growth projections to 0.5% for Q4 and 1.3% for the full year, down from previous estimates. Additionally, they anticipate the Federal Reserve will initiate three quarter-point rate cuts starting in June to counteract the economic down",
    "titles": [
      "Goldman Sachs Cuts GDP Estimate, Raises Risk of Recession Amid Tariff Rout"
    ],
    "score_components": {
      "magnitude": 0.24,
      "recency": 0.972,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.46499999999999997,
    "normalized_score": 8.52
  },
  {
    "title": "JPMorgan CEO Dimon Says Tariffs 'Will Slow Down Growth'",
    "domain": "business",
    "location": "global",
    "published": "Mon, 07 Apr 2025 14:03:43 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "<figure><img alt=\"Al Drago / Bloomberg via Getty Images JPMorgan Chase CEO Jamie Dimon speaking at an event on March 12, 2025\" src=\"https://www.investopedia.com/thmb/ZVWxIZZb7FElBIDoMDy8uXqPlpQ=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2204125565-94f94aeb0a62474197d21bd7ebe3a158.jpg\" title=\"JPMorgan Chase CEO Jamie Dimon speaks.\" /><figcaption><i><p>Al Drago / Bloomberg via Getty Images</p> JPMorgan Chase CEO Jamie Dimon speaking at an event on March 12, 2025</i></figcaption></figure><br /><h3>Key Takeaways</h3><ul><li>JPMorgan Chase CEO Jamie Dimon wrote in his annual letter to shareholders Monday that the Trump administration's newly announced tariffs are likely to slow growth and raise prices.</li><li>\"Whether or not the menu of tariffs causes a recession remains in question, but it will slow down growth,\" Dimon wrote.</li><li>Dimon said that the tariffs could be negotiated, and should be resolved quickly before negative impacts get worse.</li></ul><br /><br /><p>JPMorgan Chase (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;JPM\">JPM</a>) CEO <a href=\"https://www.investopedia.com/jamie-dimon-6361587\">Jamie Dimon</a> wrote in his annual letter to shareholders Monday that the Trump administration's newly announced tariffs are likely to slow growth and raise prices.<span class=\"ql-inline-citation\"></span></p><p>\"For the short-term, we are likely to see inflationary outcomes, not only on imported goods but on domestic prices, as input costs rise and demand increases on domestic products,\" Dimon wrote. \"How this plays out on different products will partially depend on their substitutability and price elasticity. Whether or not the menu of tariffs <a href=\"https://www.investopedia.com/goldman-sachs-cuts-gdp-estimate-raises-risk-of-recession-amid-tariff-rout-11710074\">causes a recession</a> remains in question, but it will slow down growth.\"</p><p>Dimon said that President Trump's policy platform of \"America First is fine, as long as it doesn't end up being America alone.\"</p><h2>Negative Tariff Effects 'Would Be Hard to Reverse'</h2><p>The CEO also said that once the currently proposed tariffs are negotiated, he hopes there are long-term positive impacts for the U.S., like increased manufacturing. However, Dimon stressed the need to resolve the tariff issue quickly, \"because some of the negative effects increase cumulatively over time and would be hard to reverse.\"</p><p>Dimon and other banking executives are likely to give their first extended thoughts on tariffs and the current state of the economy on their first-quarter earnings calls. JPMorgan is <a href=\"https://www.investopedia.com/what-to-expect-in-the-markets-this-week-update-trump-tariffs-dow-11708734\">slated to report its results Friday</a>.</p><p>For more of the market's reaction to the latest tariff news, check out <em>Investopedia's </em><a href=\"https://www.investopedia.com/dow-jones-today-04072025-11710097\">daily live markets coverage</a>.</p>"
    ],
    "image_url": "https://www.investopedia.com/thmb/ZVWxIZZb7FElBIDoMDy8uXqPlpQ=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2204125565-94f94aeb0a62474197d21bd7ebe3a158.jpg",
    "summary": "On March 12, 2025, JPMorgan Chase CEO Jamie Dimon expressed concerns in his annual shareholder letter about the Trump administration's new tariffs, predicting they will slow economic growth and increase prices. Dimon highlighted the potential for these tariffs to cause inflationary effects on both imported and domestic goods due to rising input costs and demand. He emphasized the importance of quick negotiation and resolution of the tariffs to mitigate long-term negative impacts and stressed that while \"America First\" policies are acceptable, they should not lead to isolation. Dimon also menti",
    "titles": [
      "JPMorgan CEO Dimon Says Tariffs 'Will Slow Down Growth'"
    ],
    "score_components": {
      "magnitude": 0.22,
      "recency": 0.99,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.4635,
    "normalized_score": 8.45
  },
  {
    "title": "Mesa Air Group Stock Soars as Regional Carrier Agrees To Merge With Republic Airways",
    "domain": "business",
    "location": "global",
    "published": "Mon, 07 Apr 2025 13:57:46 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "<figure><img alt=\"Angus Mordant / Bloomberg / Getty Images\" src=\"https://www.investopedia.com/thmb/98zuMj6mC9xWYlHuQBBkvm1t0KE=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2147876737-568e71fcbfe642468d8942648a6a9a96.jpg\" title=\"The FAA Air Traffic Control tower at Newark Liberty International Airport (EWR) in Newark, New Jersey\" /><figcaption><i><p>Angus Mordant / Bloomberg / Getty Images</p></i></figcaption></figure><br /><h3>Key Takeaways</h3><ul><li>Shares of Mesa Air Group soared Monday morning on news the carrier agreed to merge with fellow regional carrier Republic Airways in an all-stock transaction.</li><li>The combined firm would be renamed Republic Airways Holdings and remain listed on the Nasdaq with a new ticker symbol, \"RJET,\" the airlines said.</li><li>The deal \"is expected to close in either the late third or early fourth quarter of 2025,\" the carriers said.</li></ul><br /><br /><p>Shares of Mesa Air Group (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;MESA\">MESA</a>) soared more than 50% Monday morning on news the carrier agreed to merge with fellow regional carrier Republic Airways in an all-stock transaction.<span class=\"ql-inline-citation\"></span></p><p>The combined firm would be renamed Republic Airways Holdings and remain listed on the <a href=\"https://www.investopedia.com/terms/n/nasdaq.asp\">Nasdaq</a> with a new ticker symbol, \"RJET,\" the airlines said.</p><h2>Deal Expected To Close Late Q3 or Early Q4</h2><p>The deal, which \"is expected to close in either the late third or early fourth quarter of 2025,\" has been unanimously approved by both boards. Upon closing, Republic shareholders would own 88% of the combined company's common shares, while Mesa shareholders would own between 6% and 12%, \"dependent upon Mesa's achievement of certain pre-closing criteria.\" All outstanding Mesa debt would be erased.</p><p>\"The transaction is anticipated to deliver value creation for both Mesa and Republic shareholders, who stand to benefit from the ownership of a better capitalized airline with increased economies of scale, due to Republic's strong financial position, stable earnings and cash flow,\" the airlines said.</p><p>Indianapolis-based Republic Airways operates regional flights on behalf of United Airlines (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;UAL\">UAL</a>), Delta Air Lines (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;DAL\">DAL</a>), and American Airlines (<a class=\"pseudoStyle\" href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;AAL\">AAL</a>). It would continue to support the carriers under its existing capacity purchase agreements (CPA), and \"Mesa's operations will support United Airlines under a new 10-year CPA,\" the release said. </p><p>\"Republic and Mesa share a common mission to connect communities across America, and we believe that we can better achieve that mission together,\" said Republic CEO Bryan Bedford, President Donald Trump's nominee to <a href=\"https://www.investopedia.com/why-airline-pilots-have-concerns-about-trump-faa-chief-nominee-11699578\">head the Federal Aviation Administration (FAA)</a>. \"With this combination, we are establishing a single, well-capitalized, public company that will benefit from the deep expertise of Republic and Mesa associates, creating value for all stakeholders well into the future.\"<br /></p>"
    ],
    "image_url": "https://www.investopedia.com/thmb/98zuMj6mC9xWYlHuQBBkvm1t0KE=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2147876737-568e71fcbfe642468d8942648a6a9a96.jpg",
    "summary": "Mesa Air Group and Republic Airways announced an all-stock merger, with the combined entity to be named Republic Airways Holdings and to be listed on the Nasdaq under the ticker symbol \"RJET.\" The merger, expected to close between late Q3 and early Q4 of 2025, has been approved by both companies' boards. Upon completion, Republic shareholders will own 88% of the new company, while Mesa shareholders will own between 6% and 12%, based on Mesa meeting certain pre-closing criteria. The merger aims to create a better capitalized airline with increased economies of scale, benefiting shareholders of ",
    "titles": [
      "Mesa Air Group Stock Soars as Regional Carrier Agrees To Merge With Republic Airways"
    ],
    "score_components": {
      "magnitude": 0.22,
      "recency": 0.988,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.46299999999999997,
    "normalized_score": 8.43
  },
  {
    "title": "'Quantum Darwinism' may explain why we live in a shared reality",
    "domain": "science",
    "location": "global",
    "published": "Mon, 07 Apr 2025 13:00:23 +0100",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A framework inspired by evolution may demonstrate why two observers see the same non-quantum world emerge from the many fuzzy probabilities of the quantum realm"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/04/01201159/SEI_245909957.jpg",
    "summary": "A new framework inspired by evolutionary principles may explain why observers perceive the same non-quantum reality from the multitude of potential outcomes in the quantum realm. This approach suggests a unified way of understanding how consistent, observable phenomena arise from quantum probabilities.",
    "titles": [
      "'Quantum Darwinism' may explain why we live in a shared reality"
    ],
    "score_components": {
      "magnitude": 0.22,
      "recency": 0.961,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.45625000000000004,
    "normalized_score": 8.09
  }
]