[
  {
    "title": "UN: 36 recent Israeli strikes on Gaza killed only women, children",
    "domain": "general",
    "location": "global",
    "published": "Fri, 11 Apr 2025 19:12:30 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "UN investigators examined recent Israeli strikes on Gaza and found that the only people killed were women and children."
    ],
    "image_url": "",
    "summary": "UN investigators have concluded that recent Israeli strikes on Gaza resulted in the deaths of exclusively women and children. This finding highlights the civilian impact of the conflict.",
    "titles": [
      "UN: 36 recent Israeli strikes on Gaza killed only women, children"
    ],
    "score_components": {
      "magnitude": 0.32,
      "recency": 0.933,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.47925000000000006,
    "normalized_score": 10.0
  },
  {
    "title": "As an Israeli hostage turns 48, his wife waits for blue ticks on her messages",
    "domain": "general",
    "location": "global",
    "published": "Fri, 11 Apr 2025 23:16:35 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Eighteen months since Omri Miran was taken hostage by Hamas, his wife Lishay still sends family updates, which she hopes he will read one day."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/3b51/live/8bca2f00-16f4-11f0-b644-13c0d1d79f75.jpg",
    "summary": "Eighteen months after Omri Miran was taken hostage by Hamas, his wife Lishay continues to send family updates, holding onto hope that he will be able to read them someday.",
    "titles": [
      "As an Israeli hostage turns 48, his wife waits for blue ticks on her messages"
    ],
    "score_components": {
      "magnitude": 0.24,
      "recency": 0.99,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.46950000000000003,
    "normalized_score": 9.56
  },
  {
    "title": "Witkoff meets Putin as Trump urges Russia to 'get moving' on Ukraine ceasefire",
    "domain": "general",
    "location": "global",
    "published": "Fri, 11 Apr 2025 20:30:20 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The US envoy holds a third round of talks with the Russian president as agreement on a truce remains elusive."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/79bf/live/297dd9b0-16e9-11f0-b644-13c0d1d79f75.jpg",
    "summary": "The US envoy and the Russian president engaged in a third round of discussions, yet they have not reached an agreement on a truce. The talks aim to resolve ongoing tensions, but a conclusive outcome is still pending.",
    "titles": [
      "Witkoff meets Putin as Trump urges Russia to 'get moving' on Ukraine ceasefire"
    ],
    "score_components": {
      "magnitude": 0.26,
      "recency": 0.951,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.46575,
    "normalized_score": 9.39
  },
  {
    "title": "From Dubai to Lidl: How one woman's pregnancy craving launched a craze",
    "domain": "general",
    "location": "global",
    "published": "Fri, 11 Apr 2025 23:37:00 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The story behind the Can’t Get Knafeh of It chocolate bar, which combines the flavours of chocolate, pistachio and tahini with shredded pastry."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/860e/live/fd6a2e70-16c8-11f0-8a1e-3ff815141b98.jpg",
    "summary": "The Can't Get Knafeh of It chocolate bar is a unique confectionery product that blends the flavors of chocolate, pistachio, tahini, and shredded pastry, inspired by the traditional Middle Eastern dessert, knafeh. This innovative treat aims to offer a new taste experience by merging the rich, creamy textures of chocolate and tahini with the nutty crunch of pistachios and the delicate crispness of shredded pastry.",
    "titles": [
      "From Dubai to Lidl: How one woman's pregnancy craving launched a craze"
    ],
    "score_components": {
      "magnitude": 0.22,
      "recency": 0.994,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.4645,
    "normalized_score": 9.34
  },
  {
    "title": "Everyone's jumping on the AI doll trend - but what are the concerns?",
    "domain": "general",
    "location": "global",
    "published": "Fri, 11 Apr 2025 23:28:02 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "As online users create Barbie-like dolls of themselves, experts urge caution over AI's energy and data use."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/ac84/live/76cd5760-16f6-11f0-8a1e-3ff815141b98.jpg",
    "summary": "Online users are increasingly creating digital avatars resembling Barbie dolls. Experts are advising caution, highlighting concerns about the significant energy consumption and data usage associated with artificial intelligence technologies used in the creation process. They emphasize the importance of being mindful of AI's environmental impact and potential privacy issues related to data handling.",
    "titles": [
      "Everyone's jumping on the AI doll trend - but what are the concerns?"
    ],
    "score_components": {
      "magnitude": 0.22,
      "recency": 0.992,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.46399999999999997,
    "normalized_score": 9.31
  },
  {
    "title": "'I'm not upset about anything': Couples' chance to extend Masters record comes up short",
    "domain": "sports",
    "location": "national",
    "published": "Fri, 11 Apr 2025 23:30:44 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Fred Couples thrilled Masters crowds on Thursday with a first-round 71. Friday didn't go as well, and that was still OK with him."
    ],
    "image_url": "",
    "summary": "Fred Couples had a strong performance at the Masters with a first-round score of 71, captivating the audience on Thursday. However, his performance on Friday did not match the previous day's success. Despite this, Couples expressed contentment with his overall performance at the event.",
    "titles": [
      "'I'm not upset about anything': Couples' chance to extend Masters record comes up short"
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.993,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.3782500000000001,
    "normalized_score": 5.46
  },
  {
    "title": "Derek Carr injury opens door for Saints to take Shedeur Sanders at No. 9",
    "domain": "sports",
    "location": "national",
    "published": "Fri, 11 Apr 2025 23:49:44 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The Panthers could keep that from happening, by trading out of the No. 8 pick."
    ],
    "image_url": "",
    "summary": "The Carolina Panthers have the option to prevent a specific event from occurring by choosing to trade their No. 8 draft pick. The outcome or decision regarding this potential trade has not been specified in the available information.",
    "titles": [
      "Derek Carr injury opens door for Saints to take Shedeur Sanders at No. 9"
    ],
    "score_components": {
      "magnitude": 0.12,
      "recency": 0.997,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.35525000000000007,
    "normalized_score": 4.42
  },
  {
    "title": "Scottie Scheffler gets a break from an azalea, escapes a magnolia and trails by 3 at the Masters",
    "domain": "sports",
    "location": "national",
    "published": "Fri, 11 Apr 2025 23:45:25 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Even the azaleas at Augusta National seem to love Scottie Scheffler.  The two-time Masters champion's title defense took some unusual detours into the flora surrounding Augusta National's ryegrass fairways and bentgrass greens Friday, and if he hopes to win a third green jacket Sunday, he'll have to rally from another unfamiliar spot — three shots outside the lead.  Scheffler led by five shots at the halfway point in 2022 and won by three."
    ],
    "image_url": "",
    "summary": "Scottie Scheffler, a two-time Masters champion, faced challenges during his title defense at Augusta National, with his play veering into the surrounding flora. Despite these setbacks, he remains in contention for a third green jacket, currently three shots behind the lead. Last year, Scheffler had a five-shot lead at the halfway point and secured victory by three shots. He now faces a comeback to win from a less advantageous position.",
    "titles": [
      "Scottie Scheffler gets a break from an azalea, escapes a magnolia and trails by 3 at the Masters"
    ],
    "score_components": {
      "magnitude": 0.12,
      "recency": 0.996,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.355,
    "normalized_score": 4.41
  },
  {
    "title": "Nick Taylor finally made a major cut again. Some big names failed to do the same at the Masters",
    "domain": "sports",
    "location": "national",
    "published": "Fri, 11 Apr 2025 23:41:36 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Nick Taylor finally made the cut in another major.  Brooks Koepka missed the weekend at the Masters in agonizing fashion.  Then there was Bernhard Langer and Fred Couples, two former Masters champions, who took their attempts at making the cut all the way to the 18th hole Friday."
    ],
    "image_url": "",
    "summary": "Nick Taylor successfully made the cut in a major tournament. Brooks Koepka did not advance to the weekend at the Masters, missing the cut in a disappointing manner. Former Masters champions Bernhard Langer and Fred Couples also aimed to make the cut, with their efforts extending to the 18th hole on Friday.",
    "titles": [
      "Nick Taylor finally made a major cut again. Some big names failed to do the same at the Masters"
    ],
    "score_components": {
      "magnitude": 0.12,
      "recency": 0.996,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.355,
    "normalized_score": 4.41
  },
  {
    "title": "Reported injury to QB Derek Carr could energize the New Orleans Saints' draft",
    "domain": "sports",
    "location": "national",
    "published": "Fri, 11 Apr 2025 23:39:32 +0000",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "The news that New Orleans Saints quarterback Derek Carr has a serious shoulder injury puts the Saints in a different light for the draft."
    ],
    "image_url": "",
    "summary": "Derek Carr, the quarterback for the New Orleans Saints, has sustained a serious shoulder injury. This development significantly impacts the team's approach to the upcoming draft, as they may need to adjust their strategy to address this setback.",
    "titles": [
      "Reported injury to QB Derek Carr could energize the New Orleans Saints' draft"
    ],
    "score_components": {
      "magnitude": 0.12,
      "recency": 0.995,
      "proximity": 0.2,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.35475,
    "normalized_score": 4.4
  },
  {
    "title": "Trump's Pause on 'Reciprocal' Tariffs Did Little To Reduce Economic Risks",
    "domain": "business",
    "location": "global",
    "published": "Fri, 11 Apr 2025 21:16:34 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "<figure><img alt=\"Shawn Thew / EPA/Bloomberg via Getty Images\" src=\"https://www.investopedia.com/thmb/wQ4WOjTkskaXKZQdvvxPpdpNd_c=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2208898875-dfd20fad08f7474ca431baca7ce2fe2d.jpg\" title=\"Marco Rubio, US secretary of state, from left, US President Donald Trump, and Pete Hegseth, US secretary of defense, during a cabinet meeting at the White House in Washington, DC, US, on Thursday, April 10, 2025.\" /><figcaption><i><p>Shawn Thew / EPA/Bloomberg via Getty Images</p></i></figcaption></figure><br /><h3>Key Takeaways</h3><ul><li>President Donald Trump paused most of his \"reciprocal\" tariffs this week, leaving many others in place, as a simmering trade war threatens to be a drag on growth and push up prices.<br /></li><li>A typical household will pay more than $4,000 a year in import taxes even after the pause, one economist estimated.<br /></li><li>The remaining tariffs will drag down economic growth and stoke inflation, potentially leading to \"stagflation,\" forecasters said.<br /></li></ul><br /><br /><p>Financial markets may have rejoiced this week at the <a href=\"https://www.investopedia.com/trump-issues-90-day-pause-on-widespread-reciprocal-tariffs-11712133\">90-day reprieve</a> on President Donald Trump's \"Liberation Day\" tariffs, but the U.S. economy still faces a similar outlook as it did before the pause.</p><p>Higher consumer prices, slower growth, and an elevated risk of recession are still forecast despite Trump's withdrawal of the <a class=\"recommendation-inline-link\" href=\"https://www.investopedia.com/trump-imposes-sweeping-reciprocal-tariffs-11707935\">varied 'reciprocal' tariffs</a> that the White House announced last week.<span class=\"ql-inline-citation\"></span><span class=\"ql-inline-citation\"></span></p><p>The rapid-fire tariff policy changes mean many importers face lower tariffs than initially announced. However, U.S. consumers will still likely pay higher prices for imports than they did a month ago. <a href=\"https://www.investopedia.com/tariff-tracker-where-do-president-trump-trade-proposals-stand-11702803\">The remaining tariffs include</a>:<br /></p><ul><li>A 145% tariff on China<br /></li><li>A 10% global tariff<br /></li><li>A 25% tariff on certain products from Canada and Mexico<br /></li><li>A 25% tariff on cars, with a 25% tariff on car parts set to go into effect in May<br /></li><li>A 25% tariff on steel and aluminum</li></ul><p>The tariff against China was so extreme it was nearly the same as entirely cutting off trade with the U.S.'s third-largest trading partner, several economists said.<br /><br />\"The average tariff rate currently stands at around 20%, with the tariff rate on China...constituting a <em>de facto</em> embargo,\" Preston Caldwell, chief U.S. economist at Morningstar, wrote in a commentary Wednesday.<span class=\"ql-inline-citation\"></span> \"By comparison, at the end of 2024, the average effective tariff rate was 2.4%.\"<br /><br />The U.S. will buy 90% fewer products from China if the tariffs hold, shifting purchases to other countries, economists at Pantheon Macroeconomics estimated.</p><h2>Inflation and Recession Still Possible, Forecasters Say</h2><p>The remaining tariffs will take a significant financial toll on U.S. consumers as well as the economy, forecasters said. Economists at Goldman Sachs <a href=\"https://www.investopedia.com/goldman-sachs-reverses-recession-call-after-tariff-pause-11712329\">rolled back their forecast for a recession</a> in the coming year from 60% before the delay was announced but still saw a 45% chance of a recession.<br /><br />\"What was pulled back yesterday was actually enough for us to change our view about the effect of this on the economy, but ultimately, doesn't change the fact that you still got a substantial tariff rate,\" Alec Phillips, chief U.S. political economist at the investment bank, said in a conference call with clients Thursday.<br /><br />Other forecasters said the 90-day reprieve had not nearly reversed the damage.<br /><br />\"It was encouraging to see the president reverse himself on the so-called 'reciprocal' tariffs yesterday, but I wouldn’t take much solace in it as the global trade war continues to rage. I still put the odds of a recession this year at 60%,\" Mark Zandi, chief economist at Morgan Stanley, posted on social media platform X.<span class=\"ql-inline-citation\"></span><br /><br />Prediction markets were just as pessimistic, with gamblers on Polymarket pricing in about a 60% chance of a recession occurring in 2025.<span class=\"ql-inline-citation\"></span><br /><br />Economists at the Yale Budget Lab estimated Thursday that the costs of the tariffs will likely be passed through to consumers. The lab revised its estimates in the wake of the pause and found that the typical U.S. household will still lose $4,700 of purchasing power per year.<span class=\"ql-inline-citation\"></span><br /></p>"
    ],
    "image_url": "https://www.investopedia.com/thmb/wQ4WOjTkskaXKZQdvvxPpdpNd_c=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2208898875-dfd20fad08f7474ca431baca7ce2fe2d.jpg",
    "summary": "President Donald Trump has temporarily paused many of his \"reciprocal\" tariffs, leaving significant tariffs in place amid concerns of a trade war affecting economic growth and increasing prices. Despite the 90-day reprieve, the U.S. economy faces threats of higher consumer prices, slower growth, and a heightened risk of recession. The remaining tariffs include a 145% tariff on China and various tariffs on global imports, steel, aluminum, and automotive products. Economists warn that these tariffs will have a substantial financial impact on U.S. consumers and could lead to stagflation. Goldman ",
    "titles": [
      "Trump's Pause on 'Reciprocal' Tariffs Did Little To Reduce Economic Risks"
    ],
    "score_components": {
      "magnitude": 0.24,
      "recency": 0.962,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.4625,
    "normalized_score": 9.25
  },
  {
    "title": "Fed Officials Are Bracing For Higher Inflation, Slower Growth From Tariffs",
    "domain": "business",
    "location": "global",
    "published": "Fri, 11 Apr 2025 21:01:12 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "<figure><img alt=\"Brendan Smialowski / AFP via Getty Images\" src=\"https://www.investopedia.com/thmb/ZNOKRIWXBd85Ex0lnKCUgxz4qHw=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2207868667-78b26274050643b99cae4b060a69b9d2.jpg\" title=\"US Federal Reserve Chair Jerome Powell arrives to speak on the economy during the 2025 annual conference of the Society for Advancing Business Editing and Writing, in Arlington, Virginia, on April 4, 2025.\" /><figcaption><i><p>Brendan Smialowski / AFP via Getty Images</p></i></figcaption></figure><br /><h3>Key Takeaways</h3><ul><li>Federal Reserve officials are bracing for President Donald Trump's tariffs to impede both of the central bank's goals of keeping inflation in check and employment high.<br /></li><li>Fed officials said tariffs could raise consumer prices, stoking inflation, slowing the economy, and costing jobs.<br /></li><li>Rising inflation and unemployment would force the Fed to choose between fighting inflation and saving the labor market. Its monetary policy can only help one of those problems at a time, and could potentially make the other worse.<br /></li></ul><br /><br /><p>The U.S. economy is in for higher inflation and slower growth as President Donald Trump's trade war heats up, officials at the Federal Reserve said this week.<br /><br />Central bankers are in the same boat as other experts: waiting to see how the <a class=\"recommendation-inline-link\" href=\"https://www.investopedia.com/terms/t/trade-war.asp\">trade wars</a> unfold. Several Fed officials said they expect consumer prices to rise and economic growth to slow, worsening the outlook for both sides of the Fed's \"<a class=\"recommendation-inline-link\" href=\"https://www.investopedia.com/articles/investing/100715/breaking-down-federal-reserves-dual-mandate.asp\">dual mandate</a>\" to keep inflation low and employment high.<br /><br />Susan Collins, president of the Federal Reserve Bank of Boston, spoke with <em>Yahoo! Finance</em> Friday. She said she expects inflation of \"well over 3%\" this year. That would be a setback, considering the Fed's goal is to get inflation to a 2% annual rate, as measured by core Personal Consumption Expenditures. Core PCE increased 2.8% over the year in February.<span class=\"ql-inline-citation\"></span><br /><br />In a separate interview with the <em>Financial Times</em>, Collins said the central bank \"would absolutely be prepared\" to stabilize financial markets if they became disorderly. <a href=\"https://www.investopedia.com/stocks-are-on-one-of-the-wildest-rollercoaster-rides-of-the-last-25-years-11712174\">Stocks</a> and <a href=\"https://www.investopedia.com/three-major-questions-facing-the-beautiful-bond-market-11712580\">bond</a> prices have swung wildly in recent days in response to <a href=\"https://www.investopedia.com/trump-imposes-sweeping-reciprocal-tariffs-11707935\">Trump's steep tariffs</a> and his subsequent announcement on Wednesday that he would <a href=\"https://www.investopedia.com/trump-issues-90-day-pause-on-widespread-reciprocal-tariffs-11712133\">pause most of them for 90 days</a>.<br /><br />Alberto Musalem, president of the St. Louis Fed, said the central bank could use its monetary policy to \"lean against\" tariff-driven price increases. Speaking at a bankers' convention in Arkansas on Friday, Musalem said he was skeptical of the \"textbook\" view that the Fed should ignore tariff-driven price increases because they are, in theory, one-time events.<span class=\"ql-inline-citation\"></span><br /><br />Musalem acknowledged high inflation and a slower economy would put the Fed in a \"challenging\" position.<br /><br />The Federal Reserve's main tool to fight inflation and keep the labor market afloat is changing the <a class=\"recommendation-inline-link\" href=\"https://www.investopedia.com/terms/f/federalfundsrate.asp\">federal funds rate</a>, which influences borrowing costs on all kinds of loans. The Fed can lower the rate to boost the economy with easy money, preventing unemployment. Or, it can raise the rate to reduce borrowing and inflation by allowing supply and demand to rebalance.</p><p><a href=\"https://www.investopedia.com/how-would-the-federal-reserve-fight-stagflation-11700516\">But it can't do both at the same time</a>. The Fed has kept its rate high in recent months to smother out the last embers of the post-pandemic surge of inflation, which has come down considerably since 2022 but is still more than the Fed's 2% annual target.<br /><br />Austan Goolsbee, president of the Chicago Fed, said the tariffs were likely to cause inflation and economic stagnation at the same time, an economic condition known as \"<a class=\"recommendation-inline-link\" href=\"https://www.investopedia.com/terms/s/stagflation.asp\">stagflation</a>.\"<br /><br />\"Prices are going up while jobs are being lost and growth is coming down,\" Goolsbee said at the Economic Club of New York Thursday.<span class=\"ql-inline-citation\"></span> \"There is not a generic playbook for how the central bank should respond to a stagflationary shock.\"<br /><br />Jeff Schmid, president of the Federal Reserve Bank of Kansas City, said he would prioritize fighting inflation if the Fed were forced to choose between keeping price increases in check and preserving the labor market.<br /><br />\"There is a growing possibility that in setting policy, the Fed will have to balance inflation risks against growth and employment concerns,\" Schmid said in a speech to business leaders in Kansas City on Thursday. \"When contemplating this balance, I intend to keep my eye squarely focused on the outlook for inflation.\"<br /></p>"
    ],
    "image_url": "https://www.investopedia.com/thmb/ZNOKRIWXBd85Ex0lnKCUgxz4qHw=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2207868667-78b26274050643b99cae4b060a69b9d2.jpg",
    "summary": "Federal Reserve officials are concerned that President Donald Trump's tariffs could harm the U.S. economy by increasing inflation and slowing growth, potentially jeopardizing the central bank's dual mandate to maintain low inflation and high employment. Officials anticipate that tariffs will raise consumer prices and cost jobs, placing the Fed in a difficult position of having to choose between combating inflation or supporting the labor market, as it cannot address both issues simultaneously. The Fed has kept interest rates high to counter post-pandemic inflation but faces challenges with the",
    "titles": [
      "Fed Officials Are Bracing For Higher Inflation, Slower Growth From Tariffs"
    ],
    "score_components": {
      "magnitude": 0.24,
      "recency": 0.958,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.4615,
    "normalized_score": 9.2
  },
  {
    "title": "Powell Preaches Patience as Trump Tariffs Topple the Bull",
    "domain": "business",
    "location": "global",
    "published": "Fri, 11 Apr 2025 20:57:55 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Episode 234 of the Investopedia Express by Caleb Silver (April 7, 2025)"
    ],
    "image_url": "https://www.investopedia.com/thmb/QBCEKxjoBx1wgP1r6XqhZeH_FaQ=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/PowellPreachesPatienceasTrumpTariffsToppletheBull-5df1559653e5420b9e6e1c2dee876e01.jpg",
    "summary": "Episode 234 of the Investopedia Express, hosted by Caleb Silver on April 7, 2025, covered the latest trends and insights in the financial markets. The episode provided analysis on recent market movements, investment strategies, and forecasts for future economic conditions. Key discussions included the impact of global events on stock prices, the importance of diversification in investment portfolios, and tips for navigating market volatility. The episode aimed to equip listeners with knowledge to make informed investment decisions.",
    "titles": [
      "Powell Preaches Patience as Trump Tariffs Topple the Bull"
    ],
    "score_components": {
      "magnitude": 0.24,
      "recency": 0.958,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.4615,
    "normalized_score": 9.2
  },
  {
    "title": "Morgan Stanley Tops Q1 Estimates on Record Equities Trading Revenue",
    "domain": "business",
    "location": "global",
    "published": "Fri, 11 Apr 2025 14:54:29 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "<figure><img alt=\"Michael Nagle / Bloomberg via Getty Images\" src=\"https://www.investopedia.com/thmb/EBwsqPSXbtYpLV-JHwEcvsJ4Kos=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2193173512-f168f648e3d04b18a29e21aa7a3e869d.jpg\" title=\"Morgan Stanley headquarters in New York\" /><figcaption><i><p>Michael Nagle / Bloomberg via Getty Images</p></i></figcaption></figure><p>Morgan Stanley (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;MS\">MS</a>) posted better-than-expected first-quarter results on the back of record stock-trading revenue amid volatile markets.<span class=\"ql-inline-citation\"></span></p><p>The bank reported <a href=\"https://www.investopedia.com/terms/e/eps.asp\">earnings per share (EPS)</a> of $2.60 on record revenue of $17.74 billion. Analysts polled by Visible Alpha had expected $2.18 and $16.44 billion, respectively. </p><p>Morgan Stanley's results were powered by equity revenue that soared 45% year-over-year to a record $4.13 billion. The bank said it posted \"increases across business lines and regions, particularly in Asia, with outperformance in <a href=\"https://www.investopedia.com/articles/professionals/110415/role-prime-broker.asp\">prime brokerage</a> and derivatives driven by strong client activity amid a more volatile trading environment.\"</p><p>Morgan Stanley shares were down about 1% in recent trading but have risen more than 20% in the past 12 months.<br /></p>"
    ],
    "image_url": "https://www.investopedia.com/thmb/EBwsqPSXbtYpLV-JHwEcvsJ4Kos=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2193173512-f168f648e3d04b18a29e21aa7a3e869d.jpg",
    "summary": "Morgan Stanley reported first-quarter earnings exceeding expectations, with a profit of $2.60 per share on a record $17.74 billion in revenue, surpassing analyst forecasts of $2.18 per share and $16.44 billion in revenue. This financial performance was significantly boosted by a 45% increase in equity revenue to a record $4.13 billion, attributed to strong client activity in prime brokerage and derivatives, especially in Asia, amid volatile markets. Despite these results, Morgan Stanley's shares dropped about 1% in recent trading but have seen a 20% increase over the past year.",
    "titles": [
      "Morgan Stanley Tops Q1 Estimates on Record Equities Trading Revenue"
    ],
    "score_components": {
      "magnitude": 0.3,
      "recency": 0.873,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.45825000000000005,
    "normalized_score": 9.06
  },
  {
    "title": "S&P 500 Gains and Losses Today: Newmont Shares Soar as Gold Hits Fresh High",
    "domain": "business",
    "location": "global",
    "published": "Fri, 11 Apr 2025 21:24:44 GMT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "<figure><img alt=\"Bloomberg / Contributor / Getty Images\" src=\"https://www.investopedia.com/thmb/yAfH6HyZPtwXneBLruSwcUibdOU=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2199670404-e6c1ddd646414c679fe7722c16c707a0.jpg\" title=\"Gold bars\" /><figcaption><i><p>Bloomberg / Contributor / Getty Images</p></i></figcaption></figure><br /><h3>Key Takeaways</h3><ul><li>The S&amp;P 500 added 1.8% on Friday, April 11, 2025, closing out a turbulent week for the stock market as investors reacted to the latest announcements on tariffs. </li><li>The price of gold climbed to another record high, lifted by demand for \"safe haven\" assets, and shares of miner Newmont surged.</li><li>Texas Instruments, which manufactures chips in the U.S., posted the weakest performance in the index Friday after China said American chipmakers that outsource manufacturing outside the U.S. would not be subject to tariffs on U.S. goods. </li></ul><br /><br /><p>Major U.S. equities indexes rose Friday to close out a turbulent week for the stock market as investors reacted to the latest announcements on tariffs. After fluctuating for much of the trading day, the S&amp;P 500 rallied in the afternoon to close 1.8% higher. The Dow added 1.6%, and the Nasdaq gained 2.1%.</p><p>Shares of power management chipmaker Monolithic Power Systems (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;mpwr\">MPWR</a>) added 10% on Friday, posting the highest increase of any S&amp;P 500 stock. Before its bounce at the end of the volatile week, Monolithic stock had surged 23% Wednesday after President Trump announced a widespread 90-day tariff suspension, but given back a big portion of those gains on Thursday.</p><p>The price of gold <a href=\"https://www.investopedia.com/newmont-and-other-miner-stocks-pop-as-gold-keeps-hitting-record-highs-11713507\">surged to a record high</a> as the uncertainties surrounding global trade helped lift demand for the precious metal, which is often considered a \"<a href=\"https://www.investopedia.com/terms/s/safe-haven.asp\">safe haven</a>\" investment. Shares of Newmont (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;nem\">NEM</a>), the world's largest gold producer, jumped 7.9%.<br /></p><p>Goldman Sachs analysts upgraded shares of military shipbuilder Huntington Ingalls (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;hii\">HII</a>) to \"buy\" from \"sell\" and lifted their price target. The double upgrade for the stock came in the wake of an executive order signed by President Trump that could that could boost investments in domestic shipyards, with analysts suggesting that upcoming defense budgets could prioritize the construction of U.S.-made Navy vessels. Huntington Ingalls shares steamed 7.4% higher on Friday.</p><p>Texas Instruments (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;txn\">TXN</a>), which manufactures chips in the U.S., posted the S&amp;P 500's weakest daily performance as shares sank 5.7%. The downturn came after China said chips made by U.S. firms with outsourced manufacturing operations would <a href=\"https://www.investopedia.com/us-chip-firms-outsourcing-manufacturing-exempted-from-china-tariffs-against-us-11713590\">not be subject to tariffs on U.S. goods</a>. Shares of AI chip leader Nvidia (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;nvda\">NVDA</a>), which outsources manufacturing to TSMC (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;tsm\">TSM</a>) in Taiwan, gained 3.1% Friday, and TSMC added about 4%.</p><p>Shares of Aptiv (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;aptv\">APTV</a>), which provides hardware and software solutions for the automotive industry, fell 3%. RBC Capital cut its price target on Aptiv stock, citing uncertainty around the tariff impacts for automakers. Although Aptiv could benefit in its upcoming earnings report from pre-buying ahead of tariff implementation, analysts believe carmakers and suppliers could scale back or rescind guidance as they adjust to longer-term impacts.</p><p>Old Dominion Freight Line (<a href=\"https://www.investopedia.com/markets/quote?tvwidgetsymbol&#61;odfl\">ODFL</a>) shares lost 2.9% after Jefferies lowered its price target on the transport company's stock. Analysts pointed to macroeconomic concerns weighing on the industrial outlook and said they expect Old Dominion's less-than-truckload (LTL) freight volumes to remain below seasonal levels for the next few months.<br /></p>"
    ],
    "image_url": "https://www.investopedia.com/thmb/yAfH6HyZPtwXneBLruSwcUibdOU=/filters:no_upscale():max_bytes(150000):strip_icc():format(jpeg)/GettyImages-2199670404-e6c1ddd646414c679fe7722c16c707a0.jpg",
    "summary": "On April 11, 2025, the S&P 500 increased by 1.8%, closing a volatile week positively as investors reacted to new tariff announcements. Gold prices reached a record high, driven by demand for \"safe haven\" assets, with Newmont's shares jumping 7.9%. Texas Instruments saw the largest decline in the S&P 500, dropping 5.7% after China exempted U.S. chipmakers with overseas manufacturing from tariffs, impacting shares negatively. Conversely, Monolithic Power Systems experienced the highest increase in the S&P 500, gaining 10% following a 90-day tariff suspension announcement by President Trump. Addi",
    "titles": [
      "S&P 500 Gains and Losses Today: Newmont Shares Soar as Gold Hits Fresh High"
    ],
    "score_components": {
      "magnitude": 0.22,
      "recency": 0.964,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.45699999999999996,
    "normalized_score": 9.0
  },
  {
    "title": "Trump budget cuts would eliminate much of NOAA’s climate research",
    "domain": "science",
    "location": "global",
    "published": "Fri, 11 Apr 2025 21:37:10 +0100",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Proposed cuts would wipe out NOAA’s Ocean and Atmospheric Research office among a raft of other reductions to one of the main scientific agencies of the US"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/04/11202921/SEI_247187810.jpg",
    "summary": "Proposed budget cuts aim to eliminate the NOAA’s Ocean and Atmospheric Research office, alongside significant reductions to other parts of the agency, which is a key scientific entity in the US.",
    "titles": [
      "Trump budget cuts would eliminate much of NOAA’s climate research"
    ],
    "score_components": {
      "magnitude": 0.22,
      "recency": 0.953,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.45425000000000004,
    "normalized_score": 8.88
  },
  {
    "title": "Bronze naval ram from Roman battle recreated using ancient techniques",
    "domain": "science",
    "location": "global",
    "published": "Fri, 11 Apr 2025 17:00:33 +0100",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Roman ships equipped with bronze rams sank dozens of Carthaginian ships during a major naval battle in 241 BCE – now we know how the rams were made"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/04/11120440/SEI_247013865.jpg",
    "summary": "Recent research reveals the manufacturing technique behind the bronze rams on Roman ships that sank numerous Carthaginian vessels in a significant naval battle in 241 BCE. The study uncovers the sophisticated craftsmanship involved in producing these rams, which played a pivotal role in Rome's victory over Carthage. This insight into ancient naval warfare technology highlights the advanced metallurgical skills of the Romans during this period.",
    "titles": [
      "Bronze naval ram from Roman battle recreated using ancient techniques"
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.889,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.43225,
    "normalized_score": 7.89
  },
  {
    "title": "Methane-eating bacteria are ready to capture landfill emissions",
    "domain": "science",
    "location": "global",
    "published": "Fri, 11 Apr 2025 13:08:27 +0100",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Bioreactors housing methane-eating bacteria could offer a portable, off-grid solution for soaking up methane leaks from sites like landfills and coal mines"
    ],
    "image_url": "https://images.newscientist.com/wp-content/uploads/2025/04/10174134/SEI_247045150.jpg",
    "summary": "Researchers have developed portable bioreactors that use methane-eating bacteria to absorb methane emissions from sources such as landfills and coal mines. This innovative approach provides an off-grid solution to mitigate methane leaks, contributing to environmental protection efforts by reducing the impact of these potent greenhouse gases.",
    "titles": [
      "Methane-eating bacteria are ready to capture landfill emissions"
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.835,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.41874999999999996,
    "normalized_score": 7.28
  },
  {
    "title": "Driving the CAR to fight acute myeloid leukemia",
    "domain": "science",
    "location": "global",
    "published": "Fri, 11 Apr 2025 11:29:28 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "A multi-institutional team developed a chimeric antigen receptor (CAR) T cell-based strategy for specifically targeting AML cells in patients who relapsed following other treatments. The team identified a monoclonal antibody called KG2032 that reacts with a certain variant of the HLA-DRB1 molecule. KG2032 CAR T cells displayed strong anti-AML effects in a mouse model, and CAR natural killer cells showed similar results. Clinical trials are currently being planned."
    ],
    "image_url": "",
    "summary": "A team has developed a new treatment targeting acute myeloid leukemia (AML) cells in patients who relapsed after previous treatments. They designed CAR T cells using a monoclonal antibody, KG2032, that targets a variant of the HLA-DRB1 molecule. These CAR T cells demonstrated effective anti-AML activity in mouse models, with CAR natural killer cells showing similar outcomes. Clinical trials for this treatment are now in the planning stages.",
    "titles": [
      "Driving the CAR to fight acute myeloid leukemia"
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.826,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.4165,
    "normalized_score": 7.18
  },
  {
    "title": "From boring to bursting: Giant black hole awakens",
    "domain": "science",
    "location": "global",
    "published": "Fri, 11 Apr 2025 10:59:03 EDT",
    "source": "unknown",
    "sources": [
      "unknown"
    ],
    "snippets": [
      "Astronomers are investigating the longest and most energetic bursts of X-rays seen from a newly awakened black hole. Watching this strange behavior unfold in real time offers a unique opportunity to learn more about these powerful events and the mysterious behavior of massive black holes."
    ],
    "image_url": "",
    "summary": "Astronomers are currently studying unprecedented, long-lasting, and highly energetic X-ray bursts from a newly awakened black hole. This rare observation provides a valuable chance to gain insights into the enigmatic activities of massive black holes and the nature of such powerful cosmic events.",
    "titles": [
      "From boring to bursting: Giant black hole awakens"
    ],
    "score_components": {
      "magnitude": 0.2,
      "recency": 0.819,
      "proximity": 0.6,
      "consensus": 0.2,
      "constructiveness": 0.0
    },
    "score": 0.41474999999999995,
    "normalized_score": 7.1
  }
]