[
  {
    "title": "Rudy Giuliani Hospitalized After Car Accident in New Hampshire",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sun, 31 Aug 2025 16:32:47 -0400",
    "source": "NPR",
    "sources": [
      "Forbes",
      "Al Jazeera",
      "CNBC",
      "Deutsche Welle",
      "The Guardian",
      "BBC",
      "NPR",
      "Global News"
    ],
    "domains": [
      "www.dw.com",
      "globalnews.ca",
      "www.bbc.com",
      "www.npr.org",
      "www.cnbc.com",
      "www.aljazeera.com",
      "www.forbes.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "Former New York City Mayor Rudy Giuliani has been hospitalized with a broken vertebra after a car accident in New Hampshire, according to his spokesperson.",
      "The former Trump adviser's car was struck from behind on a highway in New Hampshire, a statement said.",
      "The weekend crash follows some volatile years for the one-time Republican presidential candidate.",
      "Former New York Mayor Rudy Giuliani's vehicle was \"struck from behind at high speed,\" his team said. The ex-Trump lawyer is reportedly in good spirits but will remain hospitalized.",
      "The former New York City mayor was taken to a trauma center with a fractured thoracic vertebrae, as well as lacerations and contusions, from a car accident.",
      "<p>New York City’s ex-mayor, 81, in ‘good spirits’ after being treated for fractured thoracic vertebrae, cuts and bruises</p><p>New York City’s former mayor <a href=\"https://www.theguardian.com/us-news/rudygiuliani\">Rudy Giuliani</a> has been hospitalized after getting injured in a car wreck in <a h",
      "Rudy Giuliani is recovering from a fractured vertebra and other injuries following a car crash in New Hampshire, a spokesperson for the former New York City mayor said Sunday.",
      "A spokesperson for the 81-year-old former New York City mayor said Giuliani was assisting a domestic violence victim at the time of the crash."
    ],
    "image_url": "",
    "titles": [
      "Rudy Giuliani hospitalized with broken vertebra after car accident, spokesperson says",
      "Former NYC mayor Rudy Giuliani injured in car accident, security guard says",
      "Former Trump personal lawyer Rudy Giuliani injured in car crash",
      "Rudy Giuliani seriously injured in car accident",
      "Rudy Giuliani hospitalized with serious injuries after New Hampshire car accident",
      "Rudy Giuliani hospitalized after car accident in New Hampshire",
      "Rudy Giuliani injured in New Hampshire car crash, his spokesperson says",
      "Rudy Giuliani Hospitalized After New Hampshire Car Accident, Spokesperson Says"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.928,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.861,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Former New York City Mayor Rudy Giuliani, 81, was hospitalized after his car was struck from behind in a high-speed accident in New Hampshire. He suffered a fractured thoracic vertebra, along with lacerations and contusions. Giuliani, who was assisting a domestic violence victim at the time, is in good spirits but will remain hospitalized for his injuries.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Judge Halts Deportation of Guatemalan Children by U.S. Government",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sun, 31 Aug 2025 19:27:38 -0400",
    "source": "NPR",
    "sources": [
      "Al Jazeera",
      "The Guardian",
      "NPR",
      "Axios",
      "New York Times"
    ],
    "domains": [
      "www.npr.org",
      "www.aljazeera.com",
      "www.nytimes.com",
      "www.theguardian.com",
      "news.google.com"
    ],
    "snippets": [
      "A federal district judge issued a temporary restraining order after the U.S. attempted to deport hundreds of unaccompanied Guatemalan children without proper immigration proceedings.",
      "District Judge Sparkle Sooknanan&#039;s emergency order follows a legal complaint brought on behalf of 10 children.",
      "<a href=\"https://news.google.com/rss/articles/CBMikAFBVV95cUxQTjhWc3lTc0cwU09qZDl0WWxENWFtbXlwdUwxVEZWeWk3dW5CemVJTjhfQXRjNllNeFBGb1lrTlhIM3VCbU9rbkNaNXVTeEZwYXlyTTJYWFlESUY2WVE1SndXVGpiZTdQeEpHVldKdHQyLVBmUGFhVGs5cTkybkh2Wjd6czdBYlBSZHc0RjUtbkk?oc=5\" target=\"_blank\">Judge halts deportation of hundr",
      "<p>Washington judge says unaccompanied children cannot be deported for at least 14 days as legal process unfolds</p><p>A US judge on Sunday ordered an emergency halt to a plan by the <a href=\"https://www.theguardian.com/us-news/trump-administration\">Trump administration</a> to deport a group of near",
      "The temporary block ended another last-minute flurry of legal action over the Trump administration’s immigration crackdown."
    ],
    "image_url": "",
    "titles": [
      "Hundreds of unaccompanied Guatemalan children can stay in the U.S. for now, judge says",
      "US judge blocks government from deporting unaccompanied Guatemalan minors",
      "Judge halts deportation of hundreds of Guatemalan children - Axios",
      "Judge orders US to halt deportation of hundreds of Guatemalan children",
      "Judge Halts U.S. Effort to Deport Guatemalan Children as Planes Sit on Tarmac"
    ],
    "score_components": {
      "magnitude": 0.944,
      "recency": 0.986,
      "consensus": 0.995,
      "constructiveness": 0.1,
      "proximity": 0.75
    },
    "score": 0.861,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "A federal judge issued a temporary restraining order, halting the U.S. government's attempt to deport hundreds of unaccompanied Guatemalan children without proper immigration proceedings. This decision, made by District Judge Sparkle Sooknanan, comes after a legal complaint on behalf of 10 children, temporarily preventing these deportations for at least 14 days as the legal process continues. This move interrupts the Trump administration's broader immigration crackdown efforts.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Israel Kills Hamas Spokesperson in Gaza Airstrike; Tensions Escalate",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 31 Aug 2025 20:32:56 GMT",
    "source": "BBC",
    "sources": [
      "Deutsche Welle",
      "BBC",
      "Washington Post",
      "New York Times",
      "Financial Post"
    ],
    "domains": [
      "www.washingtonpost.com",
      "www.dw.com",
      "www.bbc.com",
      "www.nytimes.com",
      "financialpost.com"
    ],
    "snippets": [
      "The military spokesman was killed in strikes on Saturday, Israel says - Hamas has not confirmed the death.",
      "Israel announced that prominent Hamas spokesperson Abu Obeida was killed by an Israeli strike. It comes as Israel's major Gaza City offensive is underway. DW has more.",
      "For nearly two decades, Abu Obaida was the face of Hamas’s military operations. Israel says it killed him in a strike Saturday in Gaza City.",
      "Hamas did not immediately comment on the Israeli military’s claim that Abu Obeida, one of the armed group’s best-known officials in the Arab world, had been killed.",
      "Israel claimed it killed an iconic Hamas spokesman in a Gaza City airstrike, and said more such blows would follow if a sweep of the Palestinian Islamist faction’s last stronghold goes ahead as planned."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/7a00/live/a20c7f00-867c-11f0-b391-6936825093bd.jpg",
    "titles": [
      "Hamas spokesman Abu Obeida killed in Gaza, Israel says",
      "Israel says Hamas spokesman killed in Gaza airstrike",
      "Israel says it killed longtime spokesman of Hamas’s military wing",
      "Israel Says It Killed Abu Obeida, Spokesman for Hamas’s Armed Wing",
      "Israel Says It Killed Key Hamas Spokeman as Cabinet Meets"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.909,
      "consensus": 0.995,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.831,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Israel announced the death of Hamas spokesperson Abu Obeida in an airstrike in Gaza City, amid a significant offensive. This action coincides with a weekend that saw at least 43 Palestinian fatalities, escalating hunger, and widespread displacement. The Israeli military has warned of further strikes against Hamas if operations in the region continue as planned.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Liverpool, Newcastle Agree on Record British Transfer for Isak",
    "domain": "sports",
    "source_domain": "liverpooloffside.sbnation.com",
    "location": "national",
    "published": "Sun, 31 Aug 2025 23:51:25 +0000",
    "source": "Yahoo Sports",
    "sources": [
      "Yahoo Sports",
      "Forbes",
      "Sky Sports",
      "Sportsnet"
    ],
    "domains": [
      "www.skysports.com",
      "sports.yahoo.com",
      "www.forbes.com",
      "liverpooloffside.sbnation.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Our long national nightmare is almost over, a deal has been made for Alexander Isak.",
      "Alexander Isak had been looking for a path out of Newcastle in recent weeks.",
      "Alexander Isak has been attempting to force a move from Newcastle United to Liverpool, but he must do so before tomorrow's transfer deadline.",
      "Liverpool&#160;and&#160;Newcastle&#160;have agreed a British-record transfer for Alexander Isak.",
      "<p>One of the more dramatic and long-winded transfer sagas in recent memory appears to have finally come to an end. </p>"
    ],
    "image_url": "",
    "titles": [
      "Liverpool Finalize Deal With Newcastle For Alexander Isak",
      "Liverpool reportedly reaches deal to sign Newcastle's Alexander Isak for $176 million",
      "Will Alexander Isak Finally Leave Newcastle United And Join Liverpool?",
      "Liverpool agree British-record deal to sign Isak",
      "Reports: Liverpool land Alexander Isak after Newcastle accept record fee"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.994,
      "consensus": 0.928,
      "constructiveness": 0.1,
      "proximity": 0.25
    },
    "score": 0.778,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Alexander Isak's transfer saga concludes as Liverpool and Newcastle United reach a British-record agreement for his move. This deal, finalizing before the transfer deadline, marks the end of Isak's recent efforts to leave Newcastle.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Krejcikova Saves 8 Match Points to Beat Townsend at US Open",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sun, 31 Aug 2025 19:22:51 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sky Sports",
      "The Guardian"
    ],
    "domains": [
      "www.espn.com",
      "www.theguardian.com",
      "www.skysports.com"
    ],
    "snippets": [
      "Barbora Krejcikova fought off eight match points in a second set that ended with a 25-minute tiebreaker before outlasting American Taylor Townsend 1-6, 7-6 (13), 6-3 in a back-and-forth thriller Sunday at the US Open.",
      "<ul><li><p>American misses first grand slam singles quarter-final</p></li><li><p>Townsend had become huge crowd favorite in Queens</p></li></ul><p>A tearful Taylor Townsend suffered a heartbreaking fourth-round loss at the US Open after Barbora Krejcikova astonishingly saved eight match points.</p><",
      "Taylor Townsend's dream US Open run came to a heartbreaking end as she failed to convert eight match points against former Wimbledon champion Barbora Krejcikova on Sunday."
    ],
    "image_url": "",
    "titles": [
      "Krejcikova saves 8 match points, ousts Townsend",
      "US Open: Taylor Townsend in tears as Krejcikova saves eight match points to survive",
      "Townsend fails to convert EIGHT match points in heart-breaking US Open loss"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.984,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.758,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Barbora Krejcikova saved eight match points in a dramatic US Open match, defeating American Taylor Townsend 1-6, 7-6 (13), 6-3. The second set featured a 25-minute tiebreaker. Townsend, a crowd favorite in Queens, missed her chance to reach her first grand slam singles quarter-final after a thrilling but ultimately heartbreaking fourth-round loss.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Aaron Judge Ties Yogi Berra with 358th Home Run for Yankees",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sun, 31 Aug 2025 19:22:51 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports",
      "Sportsnet"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Aaron Judge moved into a tie with Hall of Fame catcher Yogi Berra for fifth in franchise history when he hit his 358th career homer in Sunday's loss.",
      "Judge slugged the shot, his 43rd of the season, Sunday afternoon against the White Sox",
      "<p>Aaron Judge lofted his 358th career home run on Sunday, tying him New York Yankees great Yogi Berra for fifth-most in franchise history. </p>",
      "<p>New York Yankees star Aaron Judge hit his 358th career homer in the first inning of Sunday&#8217;s game against the White Sox, moving into a tie with Yogi Berra for fifth in franchise history.</p>"
    ],
    "image_url": "",
    "titles": [
      "Judge ties Berra on Yankees' career HRs list",
      "WATCH: Aaron Judge ties Yogi Berra on Yankees' all-time home run list with career homer No. 358",
      "Judge hits 358th homer to tie Yogi Berra for 5th-most in Yankees history",
      "Aaron Judge ties Yogi Berra for fifth on Yankees’ career homers list"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.984,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.758,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Aaron Judge hit his 358th career home run during Sunday's game against the White Sox, tying with Yogi Berra for the fifth-most homers in New York Yankees history. This home run was also his 43rd of the season.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Phillies Sign Walker Buehler to Minor League Deal After Red Sox Release",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sun, 31 Aug 2025 19:22:51 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports",
      "Sportsnet"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "The Phillies signed veteran right-hander Walker Buehler to a minor league contract, the team announced on Sunday.",
      "Buehler was released by the Red Sox last week",
      "<p>As their pitching comes into question with a smattering of injuries, the Philadelphia Phillies are building up a contingency plan for the stretch run. </p>"
    ],
    "image_url": "",
    "titles": [
      "Phillies sign veteran RHP Buehler to minors deal",
      "Phillies add veteran pitcher Walker Buehler, will be playoff eligible for NL East-leading team",
      "Phillies sign RHP Walker Buehler, claim LHP Tim Mayza off waivers"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.984,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.758,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Philadelphia Phillies have signed veteran right-hander Walker Buehler to a minor league contract. This move comes after Buehler was released by the Red Sox last week. The Phillies aim to strengthen their pitching lineup amid concerns over injuries as they prepare for the stretch run.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Aroldis Chapman Secures $13.3M One-Year Deal with Red Sox for 2026",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sun, 31 Aug 2025 19:22:51 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "CBS Sports",
      "Sportsnet"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "All-Star closer Aroldis Chapman and the Boston Red Sox finalized a $13.3 million, one-year contract for 2026 that includes a 2027 vesting option.",
      "A vesting option could keep Chapman in Boston through 2027",
      "<p>It appears Aroldis Chapman will be sticking around for another season in Boston.</p>"
    ],
    "image_url": "",
    "titles": [
      "Red Sox, Chapman agree on $13.3M deal for '26",
      "Aroldis Chapman extension: Red Sox lock up All-Star closer through 2026 on $13.3 million deal, per report",
      "Red Sox, Aroldis Chapman agree to one-year extension"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.984,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.758,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Aroldis Chapman and the Boston Red Sox have agreed on a one-year contract for 2026, valued at $13.3 million, with a vesting option for 2027. This deal could extend Chapman's tenure with the team through the 2027 season.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Charlie Woods Scores Hole in One at Junior Players Championship",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sun, 31 Aug 2025 19:22:51 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Sportsnet",
      "Sports Illustrated"
    ],
    "domains": [
      "www.espn.com",
      "news.google.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Charlie Woods made an ace on the third hole at TPC Sawgrass in the final round of the Junior Players Championship.",
      "<a href=\"https://news.google.com/rss/articles/CBMib0FVX3lxTE5UbUE3T1JiczI3VE9ia18zc29udGIwbEVoWE10eS1LM1hjX3hRUDFoME1aV0V3N3FpR2F0NEFVVVE3QjlJazloa3l1aVh4clFJMlBPYnN5d2tRTlVReGo4NkcwbVlLTnFSaW1LMFpOTQ?oc=5\" target=\"_blank\">Charlie Woods Gets Hole in One in Junior Players Championship at TPC Sawgrass",
      "<p>Charlie Woods has authored a moment to remember at an iconic golf course.</p>"
    ],
    "image_url": "",
    "titles": [
      "Charlie Woods makes ace during Junior Players",
      "Charlie Woods Gets Hole in One in Junior Players Championship at TPC Sawgrass - Sports Illustrated",
      "Charlie Woods fires hole-in-one at TPC Sawgrass"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.984,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.758,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Charlie Woods achieved a hole in one on the third hole at TPC Sawgrass during the final round of the Junior Players Championship. This notable accomplishment highlighted his performance in the tournament.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Buffalo Bills' DeWayne Carter Out for Season with Torn Achilles",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sun, 31 Aug 2025 22:30:13 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sportsnet",
      "Sports Illustrated"
    ],
    "domains": [
      "www.cbssports.com",
      "news.google.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Carter, 24, appeared in 11 games as a rookie",
      "<a href=\"https://news.google.com/rss/articles/CBMihgFBVV95cUxQdEc3bjFjZjViRm1XVVV1QURtbUxOQVNHdmoyVjBuQ1FuaXdYVTZsZkg0alpLbDdhdmlBVW5OdkFNMENjNzFXUFQ2OVp4MElLYU83bHNrem9yMmVBeWMtR2pRZ09JUDJTYWNfSWJnV2p3cnE3NzVrUm9HR2pNVWNVZHlkQ3VCUQ?oc=5\" target=\"_blank\">Bills Lose Key Defensive Lineman to Season-En",
      "<p>Buffalo Bills backup defensive tackle DeWayne Carter will miss the season after tearing his Achilles tendon, two people with knowledge of the injury confirmed to The Associated Press on Sunday.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/08/31/d11e99d2-1e16-4d0e-bdf9-2fc49d012b34/carter.jpg",
    "titles": [
      "DeWayne Carter injury: Bills lose key defensive lineman for season due to torn Achilles, per report",
      "Bills Lose Key Defensive Lineman to Season-Ending Injury Ahead of Week 1 - Sports Illustrated",
      "AP Source: Bills defensive tackle Carter to miss season after tearing Achilles tendon"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.966,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.73,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "DeWayne Carter, a 24-year-old defensive tackle for the Buffalo Bills, will miss the rest of the season due to a torn Achilles tendon. This was confirmed by two sources to The Associated Press. Carter appeared in 11 games during his rookie year.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Norway and UK Sign £10bn Anti-Submarine Warship Deal, Boosting Jobs",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 31 Aug 2025 16:56:04 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC",
      "Financial Times"
    ],
    "domains": [
      "www.bbc.com",
      "www.theguardian.com",
      "www.ft.com"
    ],
    "snippets": [
      "The government says the agreement will support thousands of jobs, including more than 2,000 in Scotland.",
      "The £10bn agreement will deliver major boost for British defence industry and Glasgow shipyards",
      "<p>MoD says agreement will support 4,000 jobs and ‘significantly strengthen Nato’s northern flank’</p><p>Norway has agreed a £10bn deal for anti-submarine warships that will be built in the UK, as the two countries plan joint operations in northern Europe to deal with <a href=\"https://www.theguardia"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/26f3/live/2cdbfc10-8677-11f0-af50-c1dc79fc71e5.jpg",
    "titles": [
      "UK secures £10bn deal to supply Norway with warships",
      "UK secures its largest ever warship deal from Norway",
      "Norway signs £10bn deal for anti-submarine warships built in UK"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.843,
      "consensus": 0.789,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.715,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Norway has entered a £10bn deal for anti-submarine warships to be built in the UK, expected to support 4,000 jobs, including over 2,000 in Scotland, and boost the British defence industry. The agreement, aimed at strengthening NATO's northern flank, involves joint operations in northern Europe.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: support",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Atwood Pens Satire in Response to Alberta's Book Ban Policy",
    "domain": "general",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sun, 31 Aug 2025 22:18:07 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "CityNews"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "globalnews.ca"
    ],
    "snippets": [
      "Margaret Atwood is taking aim at Alberta's controversial ban on school library books containing sexual content with a new, satirical short story.",
      "EDMONTON — Margaret Atwood is taking aim at Alberta&#8217;s controversial ban on school library books containing sexual content with a new, satirical short story after the famed author&#8217;s novel &#8220;The Handmaid&#8217;s Tale&#8221; was yanked from some shelves due to the province&#8217;s swee"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/08/8beeff529abe9e38ba214e0ddfb261f08a0ea1469a4fcd1df3c00df4ddc3a6c7.jpg?quality=65&strip=all",
    "titles": [
      "Margaret Atwood takes aim at Alberta’s school library books ban with satirical story",
      "Margaret Atwood takes aim at Alberta’s school library books ban with satirical story"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.962,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.697,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Margaret Atwood has written a satirical short story in response to Alberta's ban on school library books with sexual content. This action comes after her novel \"The Handmaid's Tale\" was removed from some school shelves in the province due to the controversial policy.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Blue Jays Overcome Brewers 8-4, Avoid Sweep with Key Hits and Bullpen Strength",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sun, 31 Aug 2025 20:34:54 +0000",
    "source": "Global News",
    "sources": [
      "Global News",
      "Sportsnet"
    ],
    "domains": [
      "www.sportsnet.ca",
      "globalnews.ca"
    ],
    "snippets": [
      "Vladimir Guerrero Jr. drove in the go-ahead run with a single in the fourth inning and the Toronto Blue Jays held on for an 8-4 win over the Milwaukee Brewers on Sunday.",
      "<p>Jamie Campbell and Caleb Joseph discuss the Toronto Blue Jays&#8217; 8-4 win over the Milwaukee Brewers and highlight the Blue Jays’ bullpen coming up big in high-leverage situations to secure some clutch outs to avoid the sweep by the Brewers.</p>",
      "<p>Myles Straw and Nathan Lukes each finished with two hits and two RBIs while George Springer and Vladimir Guerrero Jr. added RBIs of their own to lead the Toronto Blue Jays to an 8-4 victory over the Milwaukee Brewers.</p>"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/08/ad687e7e100d2fbfe5d7ee988d30c3323c49f611f482e29d1090d9d4faf14a02.jpg?quality=65&strip=all",
    "titles": [
      "Guerrero helps Blue Jays avoid sweep vs. Brewers",
      "Blue Jays’ bullpen comes up big to secure win over Brewers",
      "MLB Highlights: Blue Jays 8, Brewers 4"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.928,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.691,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The Toronto Blue Jays defeated the Milwaukee Brewers 8-4, with Vladimir Guerrero Jr. driving in the go-ahead run. The Blue Jays' bullpen played a crucial role in securing the win by delivering clutch outs in high-leverage situations. Myles Straw and Nathan Lukes contributed with two hits and two RBIs each, while George Springer and Guerrero Jr. also added RBIs to avoid a sweep by the Brewers.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Seth Rollins Retains Title at WWE Clash 2025; Cena Beats Logan Paul",
    "domain": "business",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sun, 31 Aug 2025 19:46:53 EST",
    "source": "ESPN",
    "sources": [
      "ESPN",
      "Forbes"
    ],
    "domains": [
      "www.espn.com",
      "www.forbes.com"
    ],
    "snippets": [
      "Seth Rollins retained the World Heavyweight Championship against Jey Uso, CM Punk, and LA Knight, while John Cena beat Logan Paul at WWE Clash in Paris.",
      "Seth Rollins pinned CM Punk to retain the world title at WWE Clash in Paris 2025 after a shocking reveal from Becky Lynch.",
      "John Cena defeated Logan Paul in an instant classic at WWE Clash in Paris 2025 as his legendary career inches closer to its end.",
      "WWE Clash in Paris 2025 could get Rusev back on track after \"The Bulgarian Brute\" forced Sheamus to tap out following a fantastic match.",
      "Becky Lynch barely beat Nikki Bella at WWE Clash in Paris 2025, but their feud may still be far from finished."
    ],
    "image_url": "",
    "titles": [
      "WWE Clash in Paris results: Rollins keeps title, holds off Uso, Punk and Knight",
      "WWE Clash In Paris 2025 Results As Becky Lynch Interferes, Seth Rollins Wins",
      "WWE Clash In Paris 2025 Results As John Cena Beats Logan Paul In Instant Classic",
      "WWE Clash In Paris 2025 Results As Rusev Taps Out Sheamus",
      "WWE Clash In Paris 2025 Results As Becky Lynch Escapes Nikki Bella"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.992,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.685,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "At WWE Clash in Paris 2025, Seth Rollins successfully defended the World Heavyweight Championship against Jey Uso, CM Punk, and LA Knight, securing victory over CM Punk. John Cena triumphed over Logan Paul in a highly anticipated match. Rusev defeated Sheamus, signaling a potential comeback. Becky Lynch narrowly won against Nikki Bella, suggesting their rivalry might continue.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Trump Proposes ID Requirement for US Elections, Seeks Mail Voting Ban",
    "domain": "general",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Sun, 31 Aug 2025 18:36:15 -0400",
    "source": "ABC News",
    "sources": [
      "ABC News",
      "The Guardian"
    ],
    "domains": [
      "www.theguardian.com",
      "abcnews.go.com"
    ],
    "snippets": [
      "But Trump did say a trilateral meeting \"will happen\" without specifying when.",
      "<p>President also wants to ban most voting by mail in push stemming from baseless claims related to 2020 election loss</p><p><a href=\"https://www.theguardian.com/us-news/donaldtrump\">Donald Trump</a> has said he will issue an executive order to mandate identification for all US elections, a move lik"
    ],
    "image_url": "https://s.abcnews.com/images/US/donald-trump-4-ap-gmh-250828_1756385399780_hpMain_4x3t_384.jpg",
    "titles": [
      "Trump admin live updates: Trump plans to issue executive order to require voter ID",
      "Trump says he plans unconstitutional executive order to mandate ID for voters"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.968,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.673,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Donald Trump announced plans to issue an executive order mandating identification for all US elections, aiming to ban most mail voting, citing unfounded claims about the 2020 election. Additionally, he mentioned a trilateral meeting will occur, though no specific date was provided.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Ukraine Arrests Suspect in Killing of Ex-Parliament Speaker Parubiy",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 31 Aug 2025 22:55:49 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "CityNews"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "www.bbc.com"
    ],
    "snippets": [
      "Ukrainian President Volodymyr Zelensky says \"urgent investigations\" are underway to establish what happened.",
      "KYIV, Ukraine (AP) — President Volodymyr Zelenskyy said Sunday that Ukrainian officials arrested a suspect in the shooting death of former parliament speaker and prominent pro-Western politician Andriy Parubiy. Zelenskyy said in a statement on X that a person was taken into custody after shooting Pa"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/4d6a/live/74f342a0-86b4-11f0-b391-6936825093bd.jpg",
    "titles": [
      "Arrest after fatal shooting of Ukrainian politician Andriy Parubiy",
      "Zelenskyy announces arrest in shooting death of pro-Western Ukrainian politician Andriy Parubiy"
    ],
    "score_components": {
      "magnitude": 0.775,
      "recency": 0.955,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.66,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Ukrainian President Volodymyr Zelenskyy announced the arrest of a suspect in the killing of former parliament speaker Andriy Parubiy. Zelenskyy confirmed that \"urgent investigations\" are in progress to understand the circumstances surrounding the incident.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "US Temporarily Halts Visa Approvals for Palestinian Passport Holders",
    "domain": "general",
    "source_domain": "www.theguardian.com",
    "location": "global",
    "published": "Sun, 31 Aug 2025 23:28:34 GMT",
    "source": "The Guardian",
    "sources": [
      "New York Times",
      "The Guardian"
    ],
    "domains": [
      "www.nytimes.com",
      "www.theguardian.com"
    ],
    "snippets": [
      "<p>Restrictions to prevent travel for healthcare and college and come after denying visas to Palestinian Authority leaders</p><p>The United States has suspended visa approvals for nearly everyone who holds a <a href=\"https://www.theguardian.com/world/palestinian-territories\">Palestinian</a> passport",
      "The move will stop, at least temporarily, travel for medical treatment, attending university, visiting relatives or conducting business."
    ],
    "image_url": "https://i.guim.co.uk/img/media/4a44c5e12a9599072995d0a6ca31006fe954a734/576_71_4432_3546/master/4432.jpg?width=140&quality=85&auto=format&fit=max&s=0aae720fdaf05722d3a6f6faf6a9f810",
    "titles": [
      "US reportedly suspends visa approvals for nearly all Palestinian passport holders",
      "U.S. Suspends Visas for Palestinian Passport Holders, Officials Say"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.966,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.648,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "The United States has temporarily suspended visa approvals for holders of Palestinian passports. This decision affects travel for medical treatment, university attendance, family visits, and business activities. This follows a decision to deny visas to Palestinian Authority leaders.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]