[
  {
    "title": "Israeli Airstrike Kills Yemeni Houthi PM and Ministers in Sanaa",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sat, 30 Aug 2025 10:28:55 -0400",
    "source": "NPR",
    "sources": [
      "The Guardian",
      "NPR",
      "New York Times",
      "Al Jazeera",
      "BBC",
      "Financial Post",
      "Washington Post",
      "CityNews",
      "Financial Times"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "www.theguardian.com",
      "www.ft.com",
      "www.nytimes.com",
      "www.bbc.com",
      "financialpost.com",
      "www.washingtonpost.com",
      "www.npr.org",
      "www.aljazeera.com"
    ],
    "snippets": [
      "The Iranian-backed Houthis said an Israeli airstrike killed the prime minister of the rebel-controlled government in the Yemeni capital, Sanaa.",
      "Ahmed Ghaleb Nasser al-Rahawi and several other Houthi officials were killed in the attack, the Iran-backed movement says.",
      "Houthis condemn killing of Ahmed al-Rahawi, other government ministers in Israeli attack on Yemen&#039;s capital this week.",
      "Iran-backed militants confirm death of Ahmed Ghaleb al-Rahawi in bombing of Sana’a on Thursday",
      "<p>Ahmed al-Rahawi killed alongside several ministers gathered for prerecorded speech by rebel group’s leader</p><p>An Israeli airstrike killed the prime minister of the Houthi rebel-controlled government in Yemen’s capital, Sana’a, the Houthis have said.</p><p>Ahmed al-Rahawi was killed in a strike",
      "Prime Minister Ahmad al-Rahawi and several ministers were killed in an Israeli strike Thursday on Sanaa, the Houthis said.",
      "Ahmed al-Rahawi had led the Houthi cabinet in Yemen since 2024. His killing is unlikely to halt the Iranian-backed group’s missile attacks on Israel.",
      "The prime minister of Yemen’s Houthi government was killed in Israeli strikes on Thursday, along with a number of ministers, the group’s presidency said in a statement.",
      "CAIRO (AP) — An Israeli airstrike killed the prime minister of the Houthi rebel-controlled government in Yemen&#8217;s capital Sanaa, the Houthis said Saturday. He was the most senior Houthi official killed in the Israeli-U.S. campaign against the Iranian-backed rebels. Ahmed al-Rahawi was killed in"
    ],
    "image_url": "",
    "titles": [
      "Houthi rebels say Israeli airstrike killed their prime minister in Yemen's capital",
      "Yemen's Houthi rebels say prime minister was killed in Israeli strike",
      "Yemen’s Houthis confirm prime minister killed in Israeli strike on Sanaa",
      "Houthi prime minister killed in Israeli air strike on Yemen",
      "Israeli airstrike kills Houthi prime minister in Yemen, rebels say",
      "Israeli strike killed Houthi prime minister",
      "Houthis Say Prime Minister Was Killed in Israeli Attack",
      "Yemen’s Houthis Say Prime Minister Died in Israeli Strike",
      "Israeli airstrike kills Houthi rebel prime minister in Yemen’s capital"
    ],
    "score_components": {
      "magnitude": 1.0,
      "recency": 0.693,
      "consensus": 1.0,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.814,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Ahmed al-Rahawi, the Prime Minister of the Houthi-controlled government in Yemen, and several ministers were killed in an Israeli airstrike on Sanaa. The strike, confirmed by Israel's military as targeting a Houthi location, represents a significant escalation in the conflict involving the Iranian-backed Houthis. Al-Rahawi's death marks the highest-profile casualty in the ongoing Israeli-U.S. campaign against the rebels. Despite his killing, it is reported that the incident is unlikely to stop the Houthis' missile attacks on Israel.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Ostapenko Apologizes for Remarks to Townsend After US Open Match",
    "domain": "sports",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sun, 31 Aug 2025 06:32:37 +0000",
    "source": "Al Jazeera",
    "sources": [
      "CBS Sports",
      "ESPN",
      "Al Jazeera",
      "Sky Sports"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com",
      "www.skysports.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "&#039;When I said education, I was speaking only about what I believe as tennis etiquette,&#039; Ostapenko said on social media.",
      "Jelena Ostapenko apologized on social media Saturday, three days after telling Taylor Townsend that she had \"no class\" and \"no education\" following their second-round match at the US Open.",
      "Ostapenko's post-match blowup went viral on Wednesday",
      "Jelena Ostapenko has apologised for her comments towards Taylor Townsend at the US Open."
    ],
    "image_url": "",
    "titles": [
      "Ostapenko apologises to Townsend for ‘no education’ comments",
      "Ostapenko apologizes for words toward Townsend",
      "US Open 2025: Jelena Ostapenko apologizes to Taylor Townsend for 'no class' comments after their match",
      "Ostapenko apologies for 'no education' comment to Townsend at US Open"
    ],
    "score_components": {
      "magnitude": 0.892,
      "recency": 0.968,
      "consensus": 0.908,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.783,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Latvian tennis player Jelena Ostapenko apologized on social media for telling American opponent Taylor Townsend she has \"no class\" and \"no education\" after their US Open match. Ostapenko's remarks, which went viral, were made following their second-round game. She cited language barriers, stating \"English is not my first language,\" as part of her apology.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Chicago Mayor Bans Police from Aiding Federal Immigration Enforcement",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 30 Aug 2025 23:34:44 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "Al Jazeera",
      "BBC",
      "CityNews"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com",
      "ottawa.citynews.ca",
      "www.aljazeera.com"
    ],
    "snippets": [
      "The order is the latest chapter in an escalating feud between the White House and Illinois state officials over violent crime and immigration.",
      "Mayor Brandon Johnson says order aims to protect residents from &#039;threats and actions of out-of-control administration&#039;.",
      "<p>Brandon Johnson’s order directs city police not to collaborate with federal agents in immigration enforcement</p><p>The mayor of <a href=\"https://www.theguardian.com/us-news/chicago\">Chicago</a> has signed an executive order outlining how the city will attempt to resist <a href=\"https://www.thegu",
      "The mayor of Chicago pushed back Saturday against what he called the “out-of-control” Trump administration&#8217;s plan to surge federal officers into the nation’s third-largest city, which could take place within days. The Chicago Police Department will be barred from helping federal authorities wi",
      "<p>Brandon Johnson has signed an executive order to counter plans to send federal agents into the city. Key US politics stories from Saturday 30 August at a glance</p><p>Resistance is growing to Donald Trump’s immigration crackdown, with the mayor of Chicago, Brandon Johnson, signing an executive or"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/e03d/live/84c17ff0-85f9-11f0-9cf6-cbf3e73ce2b9.jpg",
    "titles": [
      "Chicago mayor signs order to resist potential Trump crackdown",
      "Chicago mayor signs order to resist possible Trump troop deployment",
      "Chicago mayor signs executive order directing city to resist Trump’s immigration raids",
      "Chicago mayor defies Trump’s immigration crackdown plan for the city",
      "Trump news at a glance: Backlash in Chicago as mayor defies president’s immigration crackdown"
    ],
    "score_components": {
      "magnitude": 0.912,
      "recency": 0.82,
      "consensus": 0.908,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.77,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Chicago Mayor Brandon Johnson signed an executive order preventing city police from collaborating with federal agents on immigration enforcement, aiming to protect residents against what he terms the \"threats and actions\" of the Trump administration's plans to increase federal presence in the city. This move underscores Johnson's stance against the administration's approach towards Chicago.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Piastri Takes Pole at Dutch GP, Narrowly Beats Norris",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sun, 31 Aug 2025 01:36:05 EST",
    "source": "ESPN",
    "sources": [
      "The Guardian",
      "ESPN",
      "Sportsnet"
    ],
    "domains": [
      "www.espn.com",
      "www.theguardian.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Oscar Piastri secured pole position after beating his teammate and title rival Lando Norris.",
      "<ul><li><p>Australian gives himself chance to extend title advantage</p></li><li><p>Isack Hadjar takes career-best fourth for Racing Bulls</p></li></ul><p>The sun may have been shining but the blustery winds barrelling in over the dunes on the edge of the North Sea delivered a buffeting that might j",
      "<p>Oscar Piastri beat his teammate Lando Norris by just over one-hundredth of a second to take pole position for the Dutch Grand Prix in qualifying on Saturday.</p>"
    ],
    "image_url": "",
    "titles": [
      "Piastri takes pole ahead of Norris at Dutch GP",
      "Oscar Piastri earns F1 Dutch GP pole by finest margin ahead of Lando Norris",
      "Piastri edges McLaren teammate Norris for pole at Dutch Grand Prix"
    ],
    "score_components": {
      "magnitude": 0.827,
      "recency": 0.949,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.752,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Oscar Piastri secured pole position for the Dutch Grand Prix, edging out his McLaren teammate Lando Norris by a mere 0.012 seconds in a closely contested qualifying session. This achievement gives Piastri an opportunity to extend his lead in the title race, while Isack Hadjar achieved a career-best fourth place for Racing Bulls.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Zelenskyy Condemns Assassination of Ex-Speaker Parubiy in Ukraine",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 30 Aug 2025 16:41:58 GMT",
    "source": "BBC",
    "sources": [
      "Financial Times",
      "Al Jazeera",
      "BBC"
    ],
    "domains": [
      "www.ft.com",
      "www.bbc.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "President Zelensky said the killing of Parubiy was a \"terrible murder\" - with a manhunt under way.",
      "Ukrainian President Volodymyr Zelenskyy condemns killing of prominent politician Andriy Parubiy as &#039;horrendous murder&#039;.",
      "Assassination of former parliament speaker Andriy Parubiy is the most significant in a series of high-profile killings"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/6bad/live/f1197b20-858c-11f0-ab22-d347aa25866a.jpg",
    "titles": [
      "Prominent Ukrainian politician Andriy Parubiy shot dead in Lviv",
      "Former Ukrainian parliament speaker shot dead in Lviv",
      "Prominent Ukrainian nationalist politician shot dead in Lviv"
    ],
    "score_components": {
      "magnitude": 0.867,
      "recency": 0.71,
      "consensus": 0.789,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.693,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Ukrainian President Volodymyr Zelenskyy condemned the assassination of Andriy Parubiy, a former parliament speaker, calling it a \"horrendous murder.\" This incident marks a significant event in a series of high-profile killings in Ukraine. A manhunt is currently underway to find those responsible for Parubiy's death.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Jonah Winston Commits to Florida State After Upset Win Over Alabama",
    "domain": "sports",
    "source_domain": "www.espn.com",
    "location": "national",
    "published": "Sun, 31 Aug 2025 01:45:00 EST",
    "source": "ESPN",
    "sources": [
      "CBS Sports",
      "ESPN"
    ],
    "domains": [
      "www.espn.com",
      "www.cbssports.com"
    ],
    "snippets": [
      "Florida State landed a legacy commitment Saturday night when class of 2026 athlete Jonah Winston, the brother of former Seminoles Heisman Trophy winner Jameis Winston, announced his pledge shortly after the program upset No. 8 Alabama.",
      "Winston made his decision shortly after Florida State pulled off a huge upset against No. 8 Alabama"
    ],
    "image_url": "",
    "titles": [
      "Jonah Winston, brother of Jameis, commits to FSU",
      "Florida State football recruiting: Jonah Winston, younger brother of Jameis, commits to Seminoles after win"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.952,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.67,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Jonah Winston, brother of former Heisman Trophy winner Jameis Winston, committed to Florida State's class of 2026. His announcement came after Florida State's significant upset victory over No. 8 Alabama.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Brewers Beat Blue Jays with Late Home Runs; Yankees, Pirates, Padres Win",
    "domain": "sports",
    "source_domain": "globalnews.ca",
    "location": "national",
    "published": "Sat, 30 Aug 2025 21:50:25 +0000",
    "source": "Global News",
    "sources": [
      "Sportsnet",
      "Global News"
    ],
    "domains": [
      "globalnews.ca",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "Jackson Chourio and Christian Yelich had back-to-back home runs in the ninth inning as the Milwaukee Brewers edged the Toronto Blue Jays 4-1 on Saturday afternoon.",
      "<p>Jackson Chourio and Christian Yelich homered on back-to-back pitches to break a ninth-inning tie and lift the Milwaukee Brewers to a 4-1 win over the Toronto Blue Jays.</p>",
      "<p>Aaron Judge smacked his 42nd home run of the season before the New York Yankees came alive in the 11th inning scoring three runs to beat the Chicago White Sox 5-3.</p>",
      "<p>Oneil Cruz knocked a solo homer and Bryan Reynolds picked up three walks and a two-run single as the Pittsburgh Pirates rolled to a 10-3 win over the Boston Red Sox.</p>",
      "<p>Ramón Laureano crushed a home run while adding three RBIs on two hits with four other teammates also adding two hits as the San Diego Padres easily beat the Minnesota Twins 12-3.</p>",
      "<p>Corbin Carroll broke a scoreless tie with a solo shot as part of a three-run seventh inning to help push the Arizona Diamondbacks over the Los Angeles Dodgers 6-1.</p>",
      "<p>The Miami Marlins plated five runs in the first inning and Connor Norby picked up two of his three RBIs with a double in the top of the ninth to defeat the New York Mets 11-8.</p>",
      "<p>Weston Wilson hit a home run before Trea Turner played the hero with a walk-off RBI single in the 10th inning to help the Philadelphia Phillies get past the Atlanta Braves 3-2.</p>",
      "<p>Gavin Williams struck out eight batters over seven great innings of work while Kyle Manzardo smashed a home run to help the Cleveland Guardians beat the Seattle Mariners 4-3.</p>"
    ],
    "image_url": "https://globalnews.ca/wp-content/uploads/2025/08/e899d279bde76bb992242a25f68926843c860776d44f953648e1ffb500ac7b52.jpg?quality=65&strip=all",
    "titles": [
      "Chourio, Yelich lift Brewers over Blue Jays 4-1",
      "MLB Highlights: Brewers 4, Blue Jays 1",
      "MLB Highlights: Yankees 5, White Sox 3",
      "MLB Highlights: Pirates 10, Red Sox 3",
      "MLB Highlights: Padres 12, Twins 3",
      "MLB Highlights: Diamondbacks 6, Dodgers 1",
      "MLB Highlights: Marlins 11, Mets 8",
      "MLB Highlights: Phillies 3, Braves 2 (10)",
      "MLB Highlights: Guardians 4, Mariners 3"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.807,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 1.0
    },
    "score": 0.666,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Jackson Chourio and Christian Yelich hit back-to-back home runs in the ninth inning to secure a 4-1 victory for the Milwaukee Brewers over the Toronto Blue Jays. In other games, Aaron Judge's 42nd homer helped the Yankees overcome the White Sox 5-3 in the 11th inning, the Pirates defeated the Red Sox 10-3, the Padres won 12-3 against the Twins, the Diamondbacks beat the Dodgers 6-1, the Marlins outlasted the Mets 11-8, the Phillies edged the Braves 3-2 with a 10th-inning walk-off single, and the Guardians beat the Mariners 4-3.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Modi Visits China, Signaling Thaw in India-China Relations",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 31 Aug 2025 07:18:58 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Deutsche Welle"
    ],
    "domains": [
      "www.dw.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Prime Minister Narendra Modi is in China for the first time in seven years.",
      "Chinese Premier Xi Jinping met Indians Prime Minister Narendra Modi, whose visit furthers the thaw in relations between the countries. The two-day summit brings together leaders from more than 20 nations. Follow DW live.",
      "Indian Prime Minister Narendra Modi's first visit to China in seven years is a sign of a thaw in the relations between the neighbors. The two-day summit will bring together leaders from more than 20 nations."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/3e4c/live/c5cc70a0-862f-11f0-bc02-175687692641.jpg",
    "titles": [
      "Putin and Modi in China for summit overshadowed by trade wars with US",
      "SCO summit: Modi, Putin, other world leaders arrive in China",
      "SCO summit: World leaders gather in China's Tianjin"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.963,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.655,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Indian Prime Minister Narendra Modi visited China for the first time in seven years, marking a significant thaw in relations between the two countries. He met with Chinese Premier Xi Jinping during a two-day summit that hosted leaders from over 20 nations. This visit indicates a warming of ties between India and China.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Drones Play AC/DC to Protect Cattle from Wolves Near CA-OR Border",
    "domain": "business",
    "source_domain": "abcnews.go.com",
    "location": "national",
    "published": "Sun, 31 Aug 2025 01:18:16 -0400",
    "source": "ABC News",
    "sources": [
      "Financial Post",
      "ABC News"
    ],
    "domains": [
      "abcnews.go.com",
      "financialpost.com"
    ],
    "snippets": [
      "Biologists are using drones to scare wolves away from cattle",
      "For millennia humans have tried to scare wolves away from their livestock. Most of them didn&#8217;t have drones. But a team of biologists working near the California-Oregon border do, and they&#8217;re using them to blast AC/DC&#8217;s &#8220;Thunderstruck,&#8221; movie clips and live human voices "
    ],
    "image_url": "https://s.abcnews.com/images/US/wirestory_ea893a7f07796d03664b02a33dd5ddcb_4x3_384.jpg",
    "titles": [
      "Drones blasting AC/DC, Scarlett Johannson help biologists protect cattle from wolves",
      "Drones blasting AC/DC and Scarlett Johansson are helping biologists protect cattle from wolves"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.943,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.654,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Biologists near the California-Oregon border are using drones to deter wolves from cattle by playing AC/DC's \"Thunderstruck,\" movie clips, and live human voices. This innovative approach aims to protect livestock without harming the wolves, leveraging technology to continue a millennia-old human effort to safeguard animals.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: effort",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Millie Bright Withdraws from England's Euro 2025 Squad, Feels \"Normal\" Again",
    "domain": "sports",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 31 Aug 2025 07:03:18 GMT",
    "source": "BBC",
    "sources": [
      "BBC",
      "Yahoo Sports"
    ],
    "domains": [
      "www.bbc.com"
    ],
    "snippets": [
      "Chelsea's Millie Bright speaks to BBC Radio 5 Live's Women's Football Weekly about pulling out of England's Euro 2025 squad and feeling back to herself.",
      "Chelsea's Millie Bright speaks to BBC Radio 5 Live's Women's Football Weekly about pulling out of England's Euro 2025 squad and feeling back to herself."
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/505f/live/c677cf80-84f5-11f0-b599-154efb9f3687.jpg",
    "titles": [
      "Missing Euros 'best decision I ever made' - Bright",
      "Missing Euros 'best decision I ever made' - Bright"
    ],
    "score_components": {
      "magnitude": 0.755,
      "recency": 0.958,
      "consensus": 0.571,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.649,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Millie Bright, a player for Chelsea, discussed on BBC Radio 5 Live's Women's Football Weekly her decision to withdraw from England's Euro 2025 squad. She mentioned feeling back to her normal self following the decision.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Five Arrested at London Hotel During Anti-Asylum Protest",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 31 Aug 2025 05:39:46 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "A group of men in masks attempted to enter a hotel housing asylum seekers, say the Met.",
      "<p>Two anti-asylum groups marched to Crowne Plaza before attempting to enter building at rear, Met police say</p><p>Five people have been arrested at a protest in London where a group of masked men attempted to enter a hotel housing asylum seekers on Saturday.</p><p>At about noon, two anti-asylum gr"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/81ee/live/87a77160-85c3-11f0-9b32-899a93135c52.jpg",
    "titles": [
      "Five arrests after masked men tried to enter asylum hotel, police say",
      "Five arrested after masked men try to enter west London asylum hotel"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.931,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.641,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "In London, five individuals were arrested during a protest where masked men, part of two anti-asylum groups, attempted to enter a hotel accommodating asylum seekers. The incident, reported by the Metropolitan Police, occurred on Saturday when the groups marched to the Crowne Plaza and tried to access the building from the rear.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Conservative Leader Vows to Boost North Sea Oil, Gas Amid Climate Concerns",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sun, 31 Aug 2025 01:25:49 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "The government warns Kemi Badenoch's plans would \"only accelerate the worsening climate crisis\".",
      "<p>Conservative leader says it is ‘absurd’ to shift away from fossil fuels and leave ‘vital resources untapped’</p><p>The Conservative party will aim to “maximise extraction” of oil and gas in the North Sea if it wins power, Kemi Badenoch is expected to announce.</p><p>Badenoch will use a speech in "
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/468a/live/43964620-85fc-11f0-9cf6-cbf3e73ce2b9.jpg",
    "titles": [
      "Tories pledge to get all oil and gas out of North Sea",
      "Tories would maximise North Sea oil and gas extraction, Badenoch to say"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.852,
      "consensus": 0.591,
      "constructiveness": 0.1,
      "proximity": 0.5
    },
    "score": 0.635,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Kemi Badenoch, a Conservative leader, plans to maximize oil and gas extraction in the North Sea if her party wins power, arguing against moving away from fossil fuels. This stance has drawn warnings from the government, which believes such actions would worsen the climate crisis.",
    "constructiveness_score": 0.1,
    "constructiveness_reason": "keywords: plan",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Williams, Fernandez Reach U.S. Open Round of 16 in Doubles",
    "domain": "sports",
    "source_domain": "www.sportsnet.ca",
    "location": "national",
    "published": "Sat, 30 Aug 2025 23:06:26 EDT",
    "source": "Sportsnet",
    "sources": [
      "CityNews",
      "Sportsnet"
    ],
    "domains": [
      "ottawa.citynews.ca",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "<p>Felix Auger-Aliassime of Montreal promised fans he was &#8220;getting closer&#8221; after a recent rash of disappointing showings.</p>",
      "<p>Canadian Felix Auger-Aliassime takes match point against Germany&#8217;s Alexander Zverev to cap off the upset during the third round of the US Open.</p>",
      "<p>Venus Williams and Leylah Fernandez reached the third round of women’s doubles at the U.S. Open by defeating Ulrikke Eikeri and Eri Hozumi 7-6 (1), 6-1 on Saturday.</p>",
      "Felix Auger-Aliassime of Montreal promised fans he was &#8220;getting closer&#8221; after a recent rash of disappointing showings. After taking down the world&#8217;s third-ranked Alexander Zverev of Germany in Saturday&#8217;s third round of the U.S. Open, he wagged his finger at Louis Armstrong St"
    ],
    "image_url": "https://www.sportsnet.ca/wp-content/uploads/2025/08/FAA-4.jpg",
    "titles": [
      "Canada’s Auger-Aliassime stuns Zverev, advances to fourth round of US Open",
      "Auger-Aliassime clinches third-round win over Zverev at US Open",
      "Canada’s Fernandez, Williams reach third round of doubles at US Open",
      "Canada’s Auger-Aliassime stuns 3rd seed Zverev, advances to 4th round of US Open"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.901,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.635,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Venus Williams and Leylah Fernandez advanced to the Round of 16 at the U.S. Open after beating Ulrikke Eikeri and Eri Hozumi 7-6 (1), 6-1 in women's doubles. This result marks Williams' best Grand Slam performance in nearly ten years.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Florida State Upsets Alabama, Shaking College Football Playoff Predictions",
    "domain": "sports",
    "source_domain": "www.cbssports.com",
    "location": "national",
    "published": "Sun, 31 Aug 2025 00:02:28 +0000",
    "source": "CBS Sports",
    "sources": [
      "CBS Sports",
      "Sportsnet"
    ],
    "domains": [
      "www.cbssports.com",
      "www.sportsnet.ca"
    ],
    "snippets": [
      "It's reflection time for one of the SEC's perceived elites during opening weekend",
      "<p>New quarterback Tommy Castellanos led a punishing rushing attack for Florida State with 78 yards and a touchdown as the Seminoles stunned No. 8 Alabama 31-17 on Saturday, ending the Crimson Tide&#8217;s streak of 23 straight wins in season openers.</p>"
    ],
    "image_url": "https://sportshub.cbsistatic.com/i/2025/08/30/8b49dbdf-ebcf-4ede-9f9b-05debe87e4b3/tysimpsonalabama.jpg",
    "titles": [
      "Florida State humiliates No. 8 Alabama as Crimson Tide's glow as a football elite flickers away",
      "Florida State stuns No. 8 Alabama, snaps Crimson Tide’s win streak in openers"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.845,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.624,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Florida State, after a 2-10 season, delivered a significant defeat to Alabama, considered a contender for the College Football Playoff. This loss comes under Alabama's second-year coach, Kalen DeBoer, marking a reflective moment for the team early in the season.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Jacob Elordi Unrecognizable as Frankenstein in Netflix Adaptation",
    "domain": "business",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 30 Aug 2025 22:04:19 GMT",
    "source": "BBC",
    "sources": [
      "Forbes",
      "BBC"
    ],
    "domains": [
      "www.forbes.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Saltburn star Jacob Elordi is unrecognisable as Frankenstein's creation in the new Netflix adaptation.",
      "Not everybody can do a red carpet well. Clooney is certainly good at it.  Noomi Rapace aced it. So did Jacob Elordi, who played the Monster in \"Frankenstein.\""
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/1345/live/1b1bdf80-85e2-11f0-84c8-99de564f0440.jpg",
    "titles": [
      "Frankenstein is monster success at Venice film festival",
      "Venice Film Festival: The ‘Jay Kelly’ And ‘Frankestein’ Premieres"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.795,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.614,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Jacob Elordi stars as Frankenstein's creation in a new Netflix adaptation, showcasing a transformation that renders him unrecognizable. His recent appearance on the red carpet, alongside notables like George Clooney and Noomi Rapace, has been well-received, highlighting his versatility as an actor from Saltburn to the global stage.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Indonesia Protests: Buildings Torched, 3 Dead Amid Economic, Police Unrest",
    "domain": "general",
    "source_domain": "www.npr.org",
    "location": "national",
    "published": "Sat, 30 Aug 2025 05:13:00 -0400",
    "source": "NPR",
    "sources": [
      "New York Times",
      "NPR"
    ],
    "domains": [
      "www.nytimes.com",
      "www.npr.org"
    ],
    "snippets": [
      "An angry mob set fire to a local parliament building in an Indonesian provincial capital, leaving at least three people dead and five others hospitalized, officials said.",
      "In spreading protests against the president, three government workers died after jumping from a building that protesters set afire. A fourth person was attacked by a crowd and later died of his injuries."
    ],
    "image_url": "",
    "titles": [
      "3 dead after mob sets fire to Indonesian regional parliament building",
      "3 Dead in Indonesia After Jumping From Building Protesters Set on Fire, Official Says"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.621,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.75
    },
    "score": 0.604,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "In Indonesia, protests against President Prabowo Subianto's economic policies and police brutality have escalated, leading to the torching of parliamentary buildings in four provinces, including Sulawesi Island. The unrest, sparked by a police vehicle running over a motorcycle taxi driver, has resulted in at least three deaths and several injuries. In one incident, a local parliament building was set ablaze, killing at least three people and hospitalizing five.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Peer Lord Charles Brockett Denies Rape Charges in Court",
    "domain": "general",
    "source_domain": "www.bbc.com",
    "location": "global",
    "published": "Sat, 30 Aug 2025 17:57:46 GMT",
    "source": "BBC",
    "sources": [
      "The Guardian",
      "BBC"
    ],
    "domains": [
      "www.theguardian.com",
      "www.bbc.com"
    ],
    "snippets": [
      "Lord Brockett was arrested on Friday, the Metropolitan Police said.",
      "<p>Peer who appeared on I’m a Celebrity denies charges of rape and sexual assault at Westminster magistrates court</p><p>A celebrity peer and former reality TV show contestant has appeared in court after being charged with rape and sexual assault by penetration, police said.</p><p>Lord Charles Brock"
    ],
    "image_url": "https://ichef.bbci.co.uk/ace/standard/240/cpsprodpb/3df6/live/8725e120-85ca-11f0-bc2f-491435739aad.jpg",
    "titles": [
      "Celebrity peer charged with rape and sexual assault",
      "Celebrity peer Lord Charles Brocket charged with rape"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.729,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.601,
    "summary_source": "cache",
    "summary_reason": "",
    "summary": "Lord Charles Brockett, a peer and former reality TV contestant, was arrested and charged with rape and sexual assault by penetration. He appeared in Westminster Magistrates Court, denying all charges.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  },
  {
    "title": "Salah Labels Arsenal Premier League Favorites Ahead of Anfield Clash",
    "domain": "sports",
    "source_domain": "www.aljazeera.com",
    "location": "global",
    "published": "Sat, 30 Aug 2025 16:00:50 +0000",
    "source": "Al Jazeera",
    "sources": [
      "Al Jazeera",
      "Yahoo Sports"
    ],
    "domains": [
      "onefootball.com",
      "www.aljazeera.com"
    ],
    "snippets": [
      "Premier League holders Liverpool face an Arsenal side that have finished second for the last three seasons.",
      "Mohamed Salah has called Arsenal the favourites to win the Premier League ahead of Sunday’s game at Anfield against Liverpool.Photo by Julian Finney/Getty ImagesSpeaking this week ahead of Liverpool..."
    ],
    "image_url": "",
    "titles": [
      "Liverpool vs Arsenal: Premier League – teams, start, lineups",
      "Liverpool star: Arsenal are Premier League title favourites"
    ],
    "score_components": {
      "magnitude": 0.735,
      "recency": 0.715,
      "consensus": 0.591,
      "constructiveness": 0.0,
      "proximity": 0.5
    },
    "score": 0.598,
    "summary_source": "gpt",
    "summary_reason": "",
    "summary": "Liverpool, the current Premier League champions, are set to play against Arsenal, a team that has secured second place for the past three seasons. Ahead of their match at Anfield, Liverpool's Mohamed Salah has labeled Arsenal as the favorites to win the Premier League.",
    "constructiveness_score": 0.0,
    "constructiveness_reason": "no heuristic matches",
    "constructiveness_source": "heuristic"
  }
]