{
  "'dead man walking': socal man charged with threatening to assassinate trump": "Thomas Eugene Streavel, 73, from Yucca Valley, pleaded not guilty to three felony charges of making threats against Donald Trump on Facebook. These charges were addressed in court on Tuesday.",
  "47bf7f6a4015fd7e9577dcd6e52d19cf": "Thomas Eugene Streavel, 73, from Yucca Valley, pleaded not guilty to three felony charges of making threats against Donald Trump on Facebook. These charges were addressed in court on Tuesday.",
  "australia mushroom trial live: erin patterson tells court she felt ‘scared, responsible’ after husband asked if she poisoned his parents using dehydrator": "A 50-year-old Victorian woman, Erin Patterson, has pleaded not guilty to three murder charges and one attempted murder charge related to a fatal incident involving a beef wellington lunch in 2023. Her trial continues as she addresses allegations concerning health deceptions and issues with the food prepared, specifically the inclusion of foraged mushrooms in the meal.",
  "15e47dfae5ecb15f8f176cb3c0bfa2aa": "A 50-year-old Victorian woman, Erin Patterson, has pleaded not guilty to three murder charges and one attempted murder charge related to a fatal incident involving a beef wellington lunch in 2023. Her trial continues as she addresses allegations concerning health deceptions and issues with the food prepared, specifically the inclusion of foraged mushrooms in the meal.",
  "power to expel students for poor behaviour outside school criticised as adding to victorian educators’ workload": "The principals' association has expressed concerns over a new move that is expected to gain significant support. They caution that schools should not be burdened with solving \"all the problems of society.\" This statement highlights the association's stance on the responsibilities of educational institutions amidst societal issues.",
  "bb368d85d49627f22cdc5f18de53f006": "The principals' association has expressed concerns over a new move that is expected to gain significant support. They caution that schools should not be burdened with solving \"all the problems of society.\" This statement highlights the association's stance on the responsibilities of educational institutions amidst societal issues.",
  "australia news live: teal nicolette boele declared bradfield winner after recount; man in custody as part of pheobe bishop investigation": "Greens leader Larissa Waters has declared that the party will prioritize women's safety and policies related to health, housing, among others, in the next parliament. This announcement highlights the Greens' commitment to addressing issues affecting women in the upcoming legislative session.",
  "d9b1918fda481680ed9bd280e4e97d68": "Greens leader Larissa Waters has declared that the party will prioritize women's safety and policies related to health, housing, among others, in the next parliament. This announcement highlights the Greens' commitment to addressing issues affecting women in the upcoming legislative session.",
  "tv tonight: little simz at her soul-bearing, electrifying best": "Multi-award-winning rapper Little Simz performs an electrifying session at Maida Vale Studios, aired at 11.40pm on BBC One. Before embarking on a European tour and curating the Meltdown festival in London, she showcases six hits from her new album, \"Lotus,\" and her back catalogue. The performance includes a conversation with Clara Amfo, offering fans a preview of her latest work and past favorites.",
  "10a3bebe21e928b98d5a9ece088e3ba5": "Multi-award-winning rapper Little Simz performs an electrifying session at Maida Vale Studios, aired at 11.40pm on BBC One. Before embarking on a European tour and curating the Meltdown festival in London, she showcases six hits from her new album, \"Lotus,\" and her back catalogue. The performance includes a conversation with Clara Amfo, offering fans a preview of her latest work and past favorites.",
  "why the panthers will win the stanley cup (again)": "Despite Edmonton being favored to win the Cup Final, analysis points to five key reasons why Florida is poised to secure a repeat victory. These reasons suggest a competitive edge for Florida, underscoring their potential to overcome Edmonton's challenge and retain their title.",
  "df9fa253990c89df95b19af1046f725a": "Despite Edmonton being favored to win the Cup Final, analysis points to five key reasons why Florida is poised to secure a repeat victory. These reasons suggest a competitive edge for Florida, underscoring their potential to overcome Edmonton's challenge and retain their title.",
  "cora irked as bosox fall again: 'not getting better'": "Following a 4-3 loss to the Angels, Red Sox manager Alex Cora expressed frustration over his team's performance, highlighting repeated mistakes and a lack of improvement. This statement came in the wake of the team's continued struggles, signaling Cora's dwindling patience with the current state of affairs.",
  "a51f708ff158d09093b6c6a1ec882814": "Following a 4-3 loss to the Angels, Red Sox manager Alex Cora expressed frustration over his team's performance, highlighting repeated mistakes and a lack of improvement. This statement came in the wake of the team's continued struggles, signaling Cora's dwindling patience with the current state of affairs.",
  "barber details medical emergency that nixed fight": "Maycee Barber, a UFC flyweight, experienced a medical complication in her locker room while warming up for her UFC Fight Night bout against Erin Blanchfield on Saturday. This incident led to the last-minute cancellation of their fight, as confirmed by Barber in an interview with ESPN on Tuesday.",
  "b2116ac84b0d89d828c726816a564374": "Maycee Barber, a UFC flyweight, experienced a medical complication in her locker room while warming up for her UFC Fight Night bout against Erin Blanchfield on Saturday. This incident led to the last-minute cancellation of their fight, as confirmed by Barber in an interview with ESPN on Tuesday.",
  "knicks fire thibodeau after best run in 25 years": "The New York Knicks have decided to terminate the contract of head coach Tom Thibodeau, despite him guiding the team to its first Eastern Conference finals appearance in 25 years just a week prior. This marks a significant change in leadership for the Knicks following a notable season achievement.",
  "a8b6e2c2a147744543f4445c120aed19": "The New York Knicks have decided to terminate the contract of head coach Tom Thibodeau, despite him guiding the team to its first Eastern Conference finals appearance in 25 years just a week prior. This marks a significant change in leadership for the Knicks following a notable season achievement.",
  "more men allege sexual misconduct by ex-iu doc": "At least 15 former players of the Indiana men's basketball team have accused a former team physician of improper sexual conduct. They also claim that Indiana officials, including the late coach Bobby Knight, were aware of these actions.",
  "a1ea67a4e8c1a75ecf3bf3a24b58bcb3": "At least 15 former players of the Indiana men's basketball team have accused a former team physician of improper sexual conduct. They also claim that Indiana officials, including the late coach Bobby Knight, were aware of these actions.",
  "how ray-ban maker essilorluxottica’s all-pervasive €112 billion empire has disrupted and dominated how we see the world": "EssilorLuxottica, a dominant force in the vision industry, faces the challenge of sustaining growth despite already commanding a significant market share. The company's strategy for continued expansion in this context remains a focal point of interest.",
  "40b8987b13ad920862692f36d2899f92": "EssilorLuxottica, a dominant force in the vision industry, faces the challenge of sustaining growth despite already commanding a significant market share. The company's strategy for continued expansion in this context remains a focal point of interest.",
  "rolls-royce ceo fired managers and held staff brainstorms as part of a ‘4 pillar’ turnaround plan that led to 600% share price jump": "Tufan Erginbilgiç implemented a four-pillar strategy at Rolls-Royce, focusing on transparency and employee involvement. This approach entailed revealing the company's challenges to its workforce and actively engaging them in the problem-solving process. This method aimed to foster a collaborative environment for addressing and overcoming the company's issues.",
  "943f0a54d84c305cde637893d99e3c26": "Tufan Erginbilgiç implemented a four-pillar strategy at Rolls-Royce, focusing on transparency and employee involvement. This approach entailed revealing the company's challenges to its workforce and actively engaging them in the problem-solving process. This method aimed to foster a collaborative environment for addressing and overcoming the company's issues.",
  "toyota industries' shares nosedive on $33 billion buyout deal — steepest fall in 10 months": "Shares of Toyota Industries experienced a significant drop, declining by up to 13%, following the announcement of a 4.7 trillion yen ($33 billion) plan by the Toyota group to privatize the company. This move marks a notable financial decision within the Toyota group, impacting Toyota Industries' market performance.",
  "1865e3c06092ea3689fd376427b5458e": "Shares of Toyota Industries experienced a significant drop, declining by up to 13%, following the announcement of a 4.7 trillion yen ($33 billion) plan by the Toyota group to privatize the company. This move marks a notable financial decision within the Toyota group, impacting Toyota Industries' market performance.",
  "us tariffs of 50% on steel and aluminium come into force": "The US President has intensified the trade war by increasing tariffs on all exporting countries, with the exception of the UK. This action involves doubling the existing levies, marking a significant escalation in the trade tensions between the US and its global trading partners.",
  "fa9580742161b0301dbb989fe7ce230f": "The US President has intensified the trade war by increasing tariffs on all exporting countries, with the exception of the UK. This action involves doubling the existing levies, marking a significant escalation in the trade tensions between the US and its global trading partners.",
  "europe confronts trump’s triple threat on ukraine, nato and trade": "During a five-week period of extensive discussions, there are concerns among officials that the US president may use major issues as leverage against each other. This strategy could affect the outcomes of these talks.",
  "e7d9da4e3c0bea4a7430d5838be74e63": "During a five-week period of extensive discussions, there are concerns among officials that the US president may use major issues as leverage against each other. This strategy could affect the outcomes of these talks.",
  "roman massacre debunked: new findings rewrite maiden castle’s bloody past": "Recent research challenges the long-held belief that the Maiden Castle burials in England were the result of a Roman massacre. The study provides evidence suggesting that the deaths occurred over a longer period, debunking the theory of a single, violent confrontation with Roman forces. This new understanding rewrites the historical narrative of Maiden Castle's past, shifting away from the notion of a bloody conflict with the Romans.",
  "bae3fc6bf6fea5da7dabcba1d307ce37": "Recent research challenges the long-held belief that the Maiden Castle burials in England were the result of a Roman massacre. The study provides evidence suggesting that the deaths occurred over a longer period, debunking the theory of a single, violent confrontation with Roman forces. This new understanding rewrites the historical narrative of Maiden Castle's past, shifting away from the notion of a bloody conflict with the Romans.",
  "ancient dna unlocks genetic secrets of maya rise and fall": "Researchers have utilized ancient DNA to uncover genetic secrets behind the rise and fall of the Maya civilization. This study provides significant insights into the historical population dynamics and factors contributing to the civilization's decline, offering a new perspective on human history through genetic evidence.",
  "1d98d153b485f6705e33d07928b6a7af": "Researchers have utilized ancient DNA to uncover genetic secrets behind the rise and fall of the Maya civilization. This study provides significant insights into the historical population dynamics and factors contributing to the civilization's decline, offering a new perspective on human history through genetic evidence.",
  "crafty cockatoos learn to use public drinking fountains": "In Sydney, sulphur-crested cockatoos have been observed queuing at public drinking fountains for water, showcasing a new example of cultural evolution among urban birds. This behavior highlights their adaptability and intelligence in navigating city environments to meet their hydration needs.",
  "f8c302baa7c3899b5a6dc1bd3c30c2d4": "In Sydney, sulphur-crested cockatoos have been observed queuing at public drinking fountains for water, showcasing a new example of cultural evolution among urban birds. This behavior highlights their adaptability and intelligence in navigating city environments to meet their hydration needs.",
  "eating 3 servings of berries a day could boost healthy aging, study reveals": "A long-term study has found that consuming three servings of flavonoid-rich foods, such as berries and tea, daily can reduce frailty, enhance mental health, and improve physical function in the aging process.",
  "d92477e19db8850e1af57eff1f906569": "A long-term study has found that consuming three servings of flavonoid-rich foods, such as berries and tea, daily can reduce frailty, enhance mental health, and improve physical function in the aging process.",
  "one in 36 men carry a hidden dementia risk factor, scientists warn": "Recent research from the ASPREE trial reveals that men with two copies of a common genetic variant have twice the risk of developing dementia. This discovery highlights a significant hidden risk factor for dementia, affecting approximately 1 in 36 men.",
  "89b6256785840d95e3ad9df1768b7cdd": "Recent research from the ASPREE trial reveals that men with two copies of a common genetic variant have twice the risk of developing dementia. This discovery highlights a significant hidden risk factor for dementia, affecting approximately 1 in 36 men.",
  "uk to be spared 50% steel and aluminium tariffs imposed by trump on other countries – business live": "Asian and European stock markets experienced gains, with Airbus shares increasing by 3.4% following reports of potential large orders from Chinese airlines. This positive market movement occurred despite new trade levies introduced by the U.S. Additionally, the UK was exempted from a 50% tariff by the U.S. after being the first country to secure a trade deal with it, contributing to the optimistic market sentiment.",
  "03a16903f8c8ee3069c8e6d00eb95483": "Asian and European stock markets experienced gains, with Airbus shares increasing by 3.4% following reports of potential large orders from Chinese airlines. This positive market movement occurred despite new trade levies introduced by the U.S. Additionally, the UK was exempted from a 50% tariff by the U.S. after being the first country to secure a trade deal with it, contributing to the optimistic market sentiment.",
  "deadly mushroom lunch cook tells court she threw up toxic meal": "Erin Patterson has been charged with the murder of three family members and the attempted murder of another using poisonous fungi. The accusation details the deliberate use of toxic mushrooms as the method of poisoning. The current status of the case, including Patterson's response to the charges or any legal proceedings, was not provided in the information available.",
  "544de71c68cded26ac0dd76a4a3ddc6c": "Erin Patterson has been charged with the murder of three family members and the attempted murder of another using poisonous fungi. The accusation details the deliberate use of toxic mushrooms as the method of poisoning. The current status of the case, including Patterson's response to the charges or any legal proceedings, was not provided in the information available.",
  "australia news live: coronial investigation into death of kumanjayi white on hold during criminal investigation, nt police say": "Nicolette Boele, representing the Teal party, has won the Bradfield electoral seat after a close and dramatic recount, defeating the Liberal candidate. This development follows intense competition and anticipation for the outcome.",
  "ea223e424f1b21f37d2c3b6f733712e1": "Nicolette Boele, representing the Teal party, has won the Bradfield electoral seat after a close and dramatic recount, defeating the Liberal candidate. This development follows intense competition and anticipation for the outcome.",
  "greens warn super has become taxpayer-funded scheme for growing wealth, signalling tough line on negotiations": "The Greens party in Australia is advocating for a reduction in the threshold for superannuation tax concessions from $3 million to $2 million and is calling for the introduction of indexation rules. They argue that the current $4 trillion superannuation system excessively benefits the wealthy with taxpayer subsidies. In contrast, the Labor party believes its current approach to superannuation concessions is the fairest. The Greens' position indicates a push for more equitable superannuation policies.",
  "93bb37038587b0b62f42a711d190155a": "The Greens party in Australia is advocating for a reduction in the threshold for superannuation tax concessions from $3 million to $2 million and is calling for the introduction of indexation rules. They argue that the current $4 trillion superannuation system excessively benefits the wealthy with taxpayer subsidies. In contrast, the Labor party believes its current approach to superannuation concessions is the fairest. The Greens' position indicates a push for more equitable superannuation policies.",
  "sancho confirms chelsea exit; returns to man utd": "Jadon Sancho is set to return to Manchester United after confirming his departure from Chelsea, where he was on a season-long loan. His time at Stamford Bridge has concluded, marking the end of his temporary stay with the club.",
  "df198b66984dc2016508fdd9729a2779": "Jadon Sancho is set to return to Manchester United after confirming his departure from Chelsea, where he was on a season-long loan. His time at Stamford Bridge has concluded, marking the end of his temporary stay with the club.",
  "transfer rumors, news: man united eye psg striker ramos": "Manchester United is reportedly considering Paris-Saint-Germain striker Goncalo Ramos as a potential transfer target after failing to secure Ipswich Town's Liam Delap, according to Transfer Talk. This development in their transfer strategy highlights the club's ongoing search for new talent.",
  "6c76cfa51e1399b68786bb2e10aa5e79": "Manchester United is reportedly considering Paris-Saint-Germain striker Goncalo Ramos as a potential transfer target after failing to secure Ipswich Town's Liam Delap, according to Transfer Talk. This development in their transfer strategy highlights the club's ongoing search for new talent.",
  "trump says ‘extremely hard’ to make a deal with china’s xi as trade stalemate fuels calls for leaders to talk": "Two countries have accused each other of breaching a trade agreement that was established in Switzerland on May 12. The nature of the violations or the specific countries involved were not detailed. The current status of the dispute or any resolutions have not been provided.",
  "ea23303706b9f2bdc6958589f1bd2eee": "Two countries have accused each other of breaching a trade agreement that was established in Switzerland on May 12. The nature of the violations or the specific countries involved were not detailed. The current status of the dispute or any resolutions have not been provided.",
  "fed's powell tells princeton grads to guard integrity amid trump criticism": "Federal Reserve Chairman Jerome Powell recently declined President Donald Trump's request to lower interest rates, emphasizing the importance of focusing on employment and price stability. This decision reflects the Fed's commitment to its dual mandate despite external pressures.",
  "2bdcec9abe9c37ef07cae340bf8c6c6a": "Federal Reserve Chairman Jerome Powell recently declined President Donald Trump's request to lower interest rates, emphasizing the importance of focusing on employment and price stability. This decision reflects the Fed's commitment to its dual mandate despite external pressures.",
  "trump's 50% steel tariffs hit the world but uk spared full blow": "President Donald Trump implemented a 50% tariff on steel and aluminum imports from Europe, which took effect on Wednesday. This move has brought U.S. tariffs back into focus within the European region.",
  "9035a4146a10ff775cb1d612c2077838": "President Donald Trump implemented a 50% tariff on steel and aluminum imports from Europe, which took effect on Wednesday. This move has brought U.S. tariffs back into focus within the European region.",
  "tesla's australia sales soar in may — a bright spot amid struggles elsewhere": "In May, the automaker achieved its highest electric vehicle sales in Australia in nearly a year, marking a significant success amidst broader sales challenges in other markets.",
  "757df2d02cb41dcd06451b18b910e5db": "In May, the automaker achieved its highest electric vehicle sales in Australia in nearly a year, marking a significant success amidst broader sales challenges in other markets.",
  "can iceland help the u.s. clean up its aluminum industry?": "The imposition of tariffs by the Trump administration has led to increased aluminum prices, highlighting the importance of not wasting this material. Iceland is emerging as a pivotal location for the circularity of aluminum, suggesting potential strategies for more sustainable management and recycling of the metal.",
  "07ce824e16e6aec70ec6eb07e6220f62": "The imposition of tariffs by the Trump administration has led to increased aluminum prices, highlighting the importance of not wasting this material. Iceland is emerging as a pivotal location for the circularity of aluminum, suggesting potential strategies for more sustainable management and recycling of the metal.",
  "scientists reveal which seeds are best to include in annual flowering seed mixes to attract insect pollinators": "New research published in Plants, People, Planet indicates that the typical annual flowering seed mixes found in gardens and parks might not be optimal for pollinator attraction. The study identifies specific plant species that could better support a diverse range of pollinators, suggesting a reevaluation of commonly used seed mixes to enhance pollinator-friendly environments.",
  "416329e9b1d4331d1cc713a44b28b696": "New research published in Plants, People, Planet indicates that the typical annual flowering seed mixes found in gardens and parks might not be optimal for pollinator attraction. The study identifies specific plant species that could better support a diverse range of pollinators, suggesting a reevaluation of commonly used seed mixes to enhance pollinator-friendly environments.",
  "how a common plant pathogen affects urban trees": "New research published in Plant-Environment Interactions examines the impact of the Phytophthora pathogen on urban trees, focusing on the Common Lime species. The study highlights the importance of trees in cities for enhancing air quality, offering cooling effects, and adding natural beauty. It details how Phytophthora, a widespread plant pathogen, poses a threat to these benefits by affecting the health of urban trees.",
  "3d46c07344007fe36d7d0a4102fd37d7": "New research published in Plant-Environment Interactions examines the impact of the Phytophthora pathogen on urban trees, focusing on the Common Lime species. The study highlights the importance of trees in cities for enhancing air quality, offering cooling effects, and adding natural beauty. It details how Phytophthora, a widespread plant pathogen, poses a threat to these benefits by affecting the health of urban trees.",
  "how useful are states' adolescent social media laws?": "Over half of U.S. states have enacted bills aimed at regulating adolescent social media use, including measures like school cell phone bans and anti-cyberbullying laws. However, a study published in The Milbank Quarterly highlights the significant limitations of these state policies. The research suggests the need for identifying priorities to develop more effective interventions for managing the impact of social media on young people.",
  "1bbbcc11c39d365a5c385c12daaa9145": "Over half of U.S. states have enacted bills aimed at regulating adolescent social media use, including measures like school cell phone bans and anti-cyberbullying laws. However, a study published in The Milbank Quarterly highlights the significant limitations of these state policies. The research suggests the need for identifying priorities to develop more effective interventions for managing the impact of social media on young people.",
  "man allegedly linked to palm springs bombing arrested at jfk airport": "Federal authorities arrested a man at JFK airport in New York for allegedly supplying bomb components to the individual who attacked a fertility clinic in Palm Springs last month.",
  "a89c8b4b444b65fcbf92eb1aa706ff44": "Federal authorities arrested a man at JFK airport in New York for allegedly supplying bomb components to the individual who attacked a fertility clinic in Palm Springs last month.",
  "israeli-backed aid sites in gaza close temporarily after deadly shootings": "The Gaza Humanitarian Foundation is taking steps to enhance its operations following an incident where at least 27 Palestinians were reported killed near a distribution center, according to statements from health workers. The foundation's efforts aim to address the aftermath and prevent future occurrences.",
  "b24f6ddb33f1631c6c60b45003388e89": "The Gaza Humanitarian Foundation is taking steps to enhance its operations following an incident where at least 27 Palestinians were reported killed near a distribution center, according to statements from health workers. The foundation's efforts aim to address the aftermath and prevent future occurrences.",
  "eleven die in bengaluru crush as fans gather for ipl victory parade": "Thousands of fans gathered on Wednesday to welcome the Royal Challengers Bengaluru, showcasing widespread support and enthusiasm for the team. The event highlighted the team's significant following and the community's engagement in their success.",
  "81542bb56ad3c450f461463402a17097": "Thousands of fans gathered on Wednesday to welcome the Royal Challengers Bengaluru, showcasing widespread support and enthusiasm for the team. The event highlighted the team's significant following and the community's engagement in their success.",
  "vietnam drops two-child policy amid demographic fears": "The country, previously one of the last with policies aimed at reducing births to control population, has now changed its stance. This shift indicates a significant policy change in how the nation approaches population control, moving away from measures designed to limit birth rates.",
  "8ff9beefaa43594ef3f25b71bbf5e2a7": "The country, previously one of the last with policies aimed at reducing births to control population, has now changed its stance. This shift indicates a significant policy change in how the nation approaches population control, moving away from measures designed to limit birth rates.",
  "2025 fc 100: yamal, mbappe among best men's soccer players": "The UEFA Champions League final has concluded, marking the end of the 2024-25 men's soccer season. Following this, the FC 100 has released its annual ranking of the top 100 players in the world of men's soccer.",
  "e1c79819e171b309b366d267c2a73d10": "The UEFA Champions League final has concluded, marking the end of the 2024-25 men's soccer season. Following this, the FC 100 has released its annual ranking of the top 100 players in the world of men's soccer.",
  "nba coaching carousel: what's next for knicks' coaching job?": "The article discusses current vacancies in NBA coaching positions, evaluating the appeal of each opportunity. It provides a breakdown of available coaching jobs across the NBA, assessing factors that make certain positions more attractive than others. The analysis likely includes considerations such as team roster, management stability, market size, and potential for success. The exact number of vacancies and the teams involved are not specified in the provided content.",
  "c7fd09c16295e23616bff07649e1cb5f": "The article discusses current vacancies in NBA coaching positions, evaluating the appeal of each opportunity. It provides a breakdown of available coaching jobs across the NBA, assessing factors that make certain positions more attractive than others. The analysis likely includes considerations such as team roster, management stability, market size, and potential for success. The exact number of vacancies and the teams involved are not specified in the provided content.",
  "source: madrid push to sign river's mastantuono": "A Real Madrid representative is currently in Buenos Aires aiming to finalize the acquisition of Franco Mastantuono, a prominent player from River Plate, as reported by a source to ESPN.",
  "c7b6d4da2f3ff17a7555ae13b9dc9d62": "A Real Madrid representative is currently in Buenos Aires aiming to finalize the acquisition of Franco Mastantuono, a prominent player from River Plate, as reported by a source to ESPN.",
  "sources: chelsea keen on maignan but balk at fee": "Chelsea is in discussions to sign AC Milan goalkeeper Mike Maignan, according to ESPN sources. However, negotiations are currently stalled as there is a significant difference in valuation between the two clubs.",
  "c698de4c8441ff8392c0efd1019d7421": "Chelsea is in discussions to sign AC Milan goalkeeper Mike Maignan, according to ESPN sources. However, negotiations are currently stalled as there is a significant difference in valuation between the two clubs.",
  "source: man city agree $62m deal for reijnders": "Manchester City has finalized a deal to acquire midfielder Tijjani Reijnders from AC Milan for €55 million ($62 million), according to ESPN sources.",
  "3454cc670f0f720db512a5cd1ab3f9a0": "Manchester City has finalized a deal to acquire midfielder Tijjani Reijnders from AC Milan for €55 million ($62 million), according to ESPN sources.",
  "trump says 'too late' powell must lower interest rates after weak adp jobs report": "Former President Donald Trump has criticized Federal Reserve Chair Jerome Powell for his decision to maintain current interest rates, giving him the nickname \"Too Late.\" This nickname reflects Trump's view that Powell's actions on interest rates are delayed.",
  "3aa3e8d930870415e3c171e5c26c0da5": "Former President Donald Trump has criticized Federal Reserve Chair Jerome Powell for his decision to maintain current interest rates, giving him the nickname \"Too Late.\" This nickname reflects Trump's view that Powell's actions on interest rates are delayed.",
  "amazon to invest $10 billion in north carolina data centers in ai push": "Amazon announced its intention to invest $10 billion in building new data centers in North Carolina, aiming to enhance its artificial intelligence infrastructure. This expansion reflects the company's commitment to growing its technological capabilities.",
  "d43514ea32f65e191e238488a38b24d7": "Amazon announced its intention to invest $10 billion in building new data centers in North Carolina, aiming to enhance its artificial intelligence infrastructure. This expansion reflects the company's commitment to growing its technological capabilities.",
  "americans’ interest in electric cars dwindles as the firestorm around tesla grows": "Interest in purchasing electric vehicles (EVs) has declined to its lowest point in six years, marking a significant decrease in consumer enthusiasm for EVs. This downturn in interest reflects a change in consumer attitudes towards electric vehicles during this period.",
  "84451fc227c203c244e3989dcf52cc81": "Interest in purchasing electric vehicles (EVs) has declined to its lowest point in six years, marking a significant decrease in consumer enthusiasm for EVs. This downturn in interest reflects a change in consumer attitudes towards electric vehicles during this period.",
  "microsoft gives linkedin chief roslansky added role running office": "Ryan Roslansky, the CEO of LinkedIn for the last five years, has expanded his role to also manage Microsoft's Office productivity suite. This change indicates a closer integration of LinkedIn with Microsoft's broader software offerings.",
  "a569db69ed80e4b53d956480b2afce34": "Ryan Roslansky, the CEO of LinkedIn for the last five years, has expanded his role to also manage Microsoft's Office productivity suite. This change indicates a closer integration of LinkedIn with Microsoft's broader software offerings.",
  "airbnb ceo brian chesky says his dad did him ‘a service’ by never complimenting him—it’s a lesson he’s kept while building the $82 billion giant": "The billionaire founder, inspired by other successful billionaires such as Bill Gates and Mark Cuban, utilized tough love as a motivation for success. This approach helped him to overcome challenges and achieve significant accomplishments in his career.",
  "25ed79085d53783cb5882e501c39ad7f": "The billionaire founder, inspired by other successful billionaires such as Bill Gates and Mark Cuban, utilized tough love as a motivation for success. This approach helped him to overcome challenges and achieve significant accomplishments in his career.",
  "ancient “black box” opened: researchers extract secrets from 200-year-old brains": "Researchers have successfully extracted and analyzed brain tissues from individuals buried about 200 years ago at the site of the former Blackberry Hill Hospital. This groundbreaking study has unveiled significant insights into the preservation and decomposition of brain matter over centuries, offering a new understanding of historical diseases and potentially advancing current medical research. The findings mark a notable advancement in the field of neuropathology and historical medicine.",
  "34ea9265c34bc7fe821d64a6164944d1": "Researchers have successfully extracted and analyzed brain tissues from individuals buried about 200 years ago at the site of the former Blackberry Hill Hospital. This groundbreaking study has unveiled significant insights into the preservation and decomposition of brain matter over centuries, offering a new understanding of historical diseases and potentially advancing current medical research. The findings mark a notable advancement in the field of neuropathology and historical medicine.",
  "this plant you’ve never heard of can do what scientists thought was impossible": "A study on beetleweed has revealed that autopolyploid plants, which have multiple sets of chromosomes, can coexist together. This discovery challenges previous scientific beliefs and has implications for understanding plant evolution and diversity.",
  "6d5d2147b60e8b7fd2f7cc8b4f2b4fd0": "A study on beetleweed has revealed that autopolyploid plants, which have multiple sets of chromosomes, can coexist together. This discovery challenges previous scientific beliefs and has implications for understanding plant evolution and diversity.",
  "adhesive made from wood works in a standard glue gun": "Researchers have developed a new adhesive that is safe and recyclable, addressing the issue of toxicity and petroleum dependency found in most widely used adhesives. This innovative adhesive is made from xylan, a component found in plant cell walls, offering an environmentally friendly alternative.",
  "0b5227dda7f928ba0d8ae8d836e2b2da": "Researchers have developed a new adhesive that is safe and recyclable, addressing the issue of toxicity and petroleum dependency found in most widely used adhesives. This innovative adhesive is made from xylan, a component found in plant cell walls, offering an environmentally friendly alternative.",
  "microbes that extract rare earth elements can also capture carbon": "A microorganism has been identified with the capability to extract rare earth and critical elements used in manufacturing satellites and solar panels. Additionally, it possesses the ability to capture carbon dioxide, enhancing its potential environmental benefits.",
  "9837634a66b1a1cd0df7facaaedc8f0b": "A microorganism has been identified with the capability to extract rare earth and critical elements used in manufacturing satellites and solar panels. Additionally, it possesses the ability to capture carbon dioxide, enhancing its potential environmental benefits.",
  "peptide bridge enables cofactor channeling in fusion enzyme and cuts nadph use": "Oxidoreductases, crucial enzymes for biocatalysis, face challenges due to their reliance on the expensive cofactor NAD(P), which is consumed in high amounts. Enhancing the efficiency of how these enzymes use NAD(P) is considered highly significant for reducing costs and improving biocatalytic processes.",
  "3786daf6f5b52d4870082e37bfefe517": "Oxidoreductases, crucial enzymes for biocatalysis, face challenges due to their reliance on the expensive cofactor NAD(P), which is consumed in high amounts. Enhancing the efficiency of how these enzymes use NAD(P) is considered highly significant for reducing costs and improving biocatalytic processes."
}