{
  "'dead man walking': socal man charged with threatening to assassinate trump": "Thomas Eugene Streavel, 73, from Yucca Valley, pleaded not guilty to three felony charges of making threats against Donald Trump on Facebook. These charges were addressed in court on Tuesday.",
  "47bf7f6a4015fd7e9577dcd6e52d19cf": "Thomas Eugene Streavel, 73, from Yucca Valley, pleaded not guilty to three felony charges of making threats against Donald Trump on Facebook. These charges were addressed in court on Tuesday.",
  "australia mushroom trial live: erin patterson tells court she felt ‘scared, responsible’ after husband asked if she poisoned his parents using dehydrator": "A 50-year-old Victorian woman, Erin Patterson, has pleaded not guilty to three murder charges and one attempted murder charge related to a fatal incident involving a beef wellington lunch in 2023. Her trial continues as she addresses allegations concerning health deceptions and issues with the food prepared, specifically the inclusion of foraged mushrooms in the meal.",
  "15e47dfae5ecb15f8f176cb3c0bfa2aa": "A 50-year-old Victorian woman, Erin Patterson, has pleaded not guilty to three murder charges and one attempted murder charge related to a fatal incident involving a beef wellington lunch in 2023. Her trial continues as she addresses allegations concerning health deceptions and issues with the food prepared, specifically the inclusion of foraged mushrooms in the meal.",
  "power to expel students for poor behaviour outside school criticised as adding to victorian educators’ workload": "The principals' association has expressed concerns over a new move that is expected to gain significant support. They caution that schools should not be burdened with solving \"all the problems of society.\" This statement highlights the association's stance on the responsibilities of educational institutions amidst societal issues.",
  "bb368d85d49627f22cdc5f18de53f006": "The principals' association has expressed concerns over a new move that is expected to gain significant support. They caution that schools should not be burdened with solving \"all the problems of society.\" This statement highlights the association's stance on the responsibilities of educational institutions amidst societal issues.",
  "australia news live: teal nicolette boele declared bradfield winner after recount; man in custody as part of pheobe bishop investigation": "Greens leader Larissa Waters has declared that the party will prioritize women's safety and policies related to health, housing, among others, in the next parliament. This announcement highlights the Greens' commitment to addressing issues affecting women in the upcoming legislative session.",
  "d9b1918fda481680ed9bd280e4e97d68": "Greens leader Larissa Waters has declared that the party will prioritize women's safety and policies related to health, housing, among others, in the next parliament. This announcement highlights the Greens' commitment to addressing issues affecting women in the upcoming legislative session.",
  "tv tonight: little simz at her soul-bearing, electrifying best": "Multi-award-winning rapper Little Simz performs an electrifying session at Maida Vale Studios, aired at 11.40pm on BBC One. Before embarking on a European tour and curating the Meltdown festival in London, she showcases six hits from her new album, \"Lotus,\" and her back catalogue. The performance includes a conversation with Clara Amfo, offering fans a preview of her latest work and past favorites.",
  "10a3bebe21e928b98d5a9ece088e3ba5": "Multi-award-winning rapper Little Simz performs an electrifying session at Maida Vale Studios, aired at 11.40pm on BBC One. Before embarking on a European tour and curating the Meltdown festival in London, she showcases six hits from her new album, \"Lotus,\" and her back catalogue. The performance includes a conversation with Clara Amfo, offering fans a preview of her latest work and past favorites.",
  "why the panthers will win the stanley cup (again)": "Despite Edmonton being favored to win the Cup Final, analysis points to five key reasons why Florida is poised to secure a repeat victory. These reasons suggest a competitive edge for Florida, underscoring their potential to overcome Edmonton's challenge and retain their title.",
  "df9fa253990c89df95b19af1046f725a": "Despite Edmonton being favored to win the Cup Final, analysis points to five key reasons why Florida is poised to secure a repeat victory. These reasons suggest a competitive edge for Florida, underscoring their potential to overcome Edmonton's challenge and retain their title.",
  "cora irked as bosox fall again: 'not getting better'": "Following a 4-3 loss to the Angels, Red Sox manager Alex Cora expressed frustration over his team's performance, highlighting repeated mistakes and a lack of improvement. This statement came in the wake of the team's continued struggles, signaling Cora's dwindling patience with the current state of affairs.",
  "a51f708ff158d09093b6c6a1ec882814": "Following a 4-3 loss to the Angels, Red Sox manager Alex Cora expressed frustration over his team's performance, highlighting repeated mistakes and a lack of improvement. This statement came in the wake of the team's continued struggles, signaling Cora's dwindling patience with the current state of affairs.",
  "barber details medical emergency that nixed fight": "Maycee Barber, a UFC flyweight, experienced a medical complication in her locker room while warming up for her UFC Fight Night bout against Erin Blanchfield on Saturday. This incident led to the last-minute cancellation of their fight, as confirmed by Barber in an interview with ESPN on Tuesday.",
  "b2116ac84b0d89d828c726816a564374": "Maycee Barber, a UFC flyweight, experienced a medical complication in her locker room while warming up for her UFC Fight Night bout against Erin Blanchfield on Saturday. This incident led to the last-minute cancellation of their fight, as confirmed by Barber in an interview with ESPN on Tuesday.",
  "knicks fire thibodeau after best run in 25 years": "The New York Knicks have decided to terminate the contract of head coach Tom Thibodeau, despite him guiding the team to its first Eastern Conference finals appearance in 25 years just a week prior. This marks a significant change in leadership for the Knicks following a notable season achievement.",
  "a8b6e2c2a147744543f4445c120aed19": "The New York Knicks have decided to terminate the contract of head coach Tom Thibodeau, despite him guiding the team to its first Eastern Conference finals appearance in 25 years just a week prior. This marks a significant change in leadership for the Knicks following a notable season achievement.",
  "more men allege sexual misconduct by ex-iu doc": "At least 15 former players of the Indiana men's basketball team have accused a former team physician of improper sexual conduct. They also claim that Indiana officials, including the late coach Bobby Knight, were aware of these actions.",
  "a1ea67a4e8c1a75ecf3bf3a24b58bcb3": "At least 15 former players of the Indiana men's basketball team have accused a former team physician of improper sexual conduct. They also claim that Indiana officials, including the late coach Bobby Knight, were aware of these actions.",
  "how ray-ban maker essilorluxottica’s all-pervasive €112 billion empire has disrupted and dominated how we see the world": "EssilorLuxottica, a dominant force in the vision industry, faces the challenge of sustaining growth despite already commanding a significant market share. The company's strategy for continued expansion in this context remains a focal point of interest.",
  "40b8987b13ad920862692f36d2899f92": "EssilorLuxottica, a dominant force in the vision industry, faces the challenge of sustaining growth despite already commanding a significant market share. The company's strategy for continued expansion in this context remains a focal point of interest.",
  "rolls-royce ceo fired managers and held staff brainstorms as part of a ‘4 pillar’ turnaround plan that led to 600% share price jump": "Tufan Erginbilgiç implemented a four-pillar strategy at Rolls-Royce, focusing on transparency and employee involvement. This approach entailed revealing the company's challenges to its workforce and actively engaging them in the problem-solving process. This method aimed to foster a collaborative environment for addressing and overcoming the company's issues.",
  "943f0a54d84c305cde637893d99e3c26": "Tufan Erginbilgiç implemented a four-pillar strategy at Rolls-Royce, focusing on transparency and employee involvement. This approach entailed revealing the company's challenges to its workforce and actively engaging them in the problem-solving process. This method aimed to foster a collaborative environment for addressing and overcoming the company's issues.",
  "toyota industries' shares nosedive on $33 billion buyout deal — steepest fall in 10 months": "Shares of Toyota Industries experienced a significant drop, declining by up to 13%, following the announcement of a 4.7 trillion yen ($33 billion) plan by the Toyota group to privatize the company. This move marks a notable financial decision within the Toyota group, impacting Toyota Industries' market performance.",
  "1865e3c06092ea3689fd376427b5458e": "Shares of Toyota Industries experienced a significant drop, declining by up to 13%, following the announcement of a 4.7 trillion yen ($33 billion) plan by the Toyota group to privatize the company. This move marks a notable financial decision within the Toyota group, impacting Toyota Industries' market performance.",
  "us tariffs of 50% on steel and aluminium come into force": "The US President has intensified the trade war by increasing tariffs on all exporting countries, with the exception of the UK. This action involves doubling the existing levies, marking a significant escalation in the trade tensions between the US and its global trading partners.",
  "fa9580742161b0301dbb989fe7ce230f": "The US President has intensified the trade war by increasing tariffs on all exporting countries, with the exception of the UK. This action involves doubling the existing levies, marking a significant escalation in the trade tensions between the US and its global trading partners.",
  "europe confronts trump’s triple threat on ukraine, nato and trade": "During a five-week period of extensive discussions, there are concerns among officials that the US president may use major issues as leverage against each other. This strategy could affect the outcomes of these talks.",
  "e7d9da4e3c0bea4a7430d5838be74e63": "During a five-week period of extensive discussions, there are concerns among officials that the US president may use major issues as leverage against each other. This strategy could affect the outcomes of these talks.",
  "roman massacre debunked: new findings rewrite maiden castle’s bloody past": "Recent research challenges the long-held belief that the Maiden Castle burials in England were the result of a Roman massacre. The study provides evidence suggesting that the deaths occurred over a longer period, debunking the theory of a single, violent confrontation with Roman forces. This new understanding rewrites the historical narrative of Maiden Castle's past, shifting away from the notion of a bloody conflict with the Romans.",
  "bae3fc6bf6fea5da7dabcba1d307ce37": "Recent research challenges the long-held belief that the Maiden Castle burials in England were the result of a Roman massacre. The study provides evidence suggesting that the deaths occurred over a longer period, debunking the theory of a single, violent confrontation with Roman forces. This new understanding rewrites the historical narrative of Maiden Castle's past, shifting away from the notion of a bloody conflict with the Romans.",
  "ancient dna unlocks genetic secrets of maya rise and fall": "Researchers have utilized ancient DNA to uncover genetic secrets behind the rise and fall of the Maya civilization. This study provides significant insights into the historical population dynamics and factors contributing to the civilization's decline, offering a new perspective on human history through genetic evidence.",
  "1d98d153b485f6705e33d07928b6a7af": "Researchers have utilized ancient DNA to uncover genetic secrets behind the rise and fall of the Maya civilization. This study provides significant insights into the historical population dynamics and factors contributing to the civilization's decline, offering a new perspective on human history through genetic evidence.",
  "crafty cockatoos learn to use public drinking fountains": "In Sydney, sulphur-crested cockatoos have been observed queuing at public drinking fountains for water, showcasing a new example of cultural evolution among urban birds. This behavior highlights their adaptability and intelligence in navigating city environments to meet their hydration needs.",
  "f8c302baa7c3899b5a6dc1bd3c30c2d4": "In Sydney, sulphur-crested cockatoos have been observed queuing at public drinking fountains for water, showcasing a new example of cultural evolution among urban birds. This behavior highlights their adaptability and intelligence in navigating city environments to meet their hydration needs.",
  "eating 3 servings of berries a day could boost healthy aging, study reveals": "A long-term study has found that consuming three servings of flavonoid-rich foods, such as berries and tea, daily can reduce frailty, enhance mental health, and improve physical function in the aging process.",
  "d92477e19db8850e1af57eff1f906569": "A long-term study has found that consuming three servings of flavonoid-rich foods, such as berries and tea, daily can reduce frailty, enhance mental health, and improve physical function in the aging process.",
  "one in 36 men carry a hidden dementia risk factor, scientists warn": "Recent research from the ASPREE trial reveals that men with two copies of a common genetic variant have twice the risk of developing dementia. This discovery highlights a significant hidden risk factor for dementia, affecting approximately 1 in 36 men.",
  "89b6256785840d95e3ad9df1768b7cdd": "Recent research from the ASPREE trial reveals that men with two copies of a common genetic variant have twice the risk of developing dementia. This discovery highlights a significant hidden risk factor for dementia, affecting approximately 1 in 36 men."
}